{
	"tafseer": [
		{
			"id": 6169,
			"surah": 102,
			"ayat": 1,
			"tafsir": "In this verse, Allah reveals that humans are busy boasting with wealth, friends and followers, so they neglect doing charity. They are preoccupied with just talking, being deceived by their offspring and colleagues without thinking about the good deeds that are beneficial to themselves and their families. It was narrated from Mutharrif from his father, he said: I met the Prophet when he was reading al-hakumut-takatsur, he said, \"The son of Adam said, 'This is my treasure, this is my treasure. The Prophet said, \"O son of Adam! You don't own from your wealth except what you eat and spend, or the clothes you wear until they are weathered, or what you give charity until they run out.\" (Muslim History) It was also narrated that the Prophet said: If the son of Adam had a valley of wealth , really he wants to have two treasure valleys, and if he has two treasure valleys, he really wants to have three treasure valleys and does not fill the human stomach (not satisfied) unless his stomach is filled with soil and Allah will accept repentance (give forgiveness) to people who repent.(History of Ahmad, al-Bukhari, Muslim, and at-Tirmidhi from Anas) Some commentators are of the opinion that the meaning of this verse is to be proud of being extravagant. Someone tries to have more than others either wealth or position with the goal solely to achieve heights and pride, not to be used in the way of goodness or to help uphold justice and good intentions innya. Know, in fact the life of this world is only games and banter, adornment and mutual pride among you and competition in wealth and offspring, like the rain whose plants amaze the farmers; then it (the plant) dries up and you see it turns yellow and then it crumbles. And in the hereafter (later) there will be a severe punishment and forgiveness from Allah and His pleasure. And the life of this world is nothing but false pleasures. (al-hadid\/57: 20)"
		   },
		   {
			"id": 6170,
			"surah": 102,
			"ayat": 2,
			"tafsir": "Furthermore, Allah explained that the state of boasting among humans or by trying to have more than others will continue until they enter the grave. Thus, they have wasted their life for things that are not useful, both in life in this world and for the life hereafter. Scholars are of the opinion that visiting cemeteries is the most effective antidote to soften the heart, because by visiting graves humans will remember death and the hereafter, so that by itself will limit extravagant desires. The Prophet Muhammad said: I once forbade you to visit the graves, so now visit the graves, because visiting the graves will make you ascetic from the luxuries of this world and remind you of the afterlife. (History of Ibn Majah from Ibn Mas'ud)."
		   },
		   {
			"id": 6171,
			"surah": 102,
			"ayat": 3,
			"tafsir": "Then Allah with this verse warns that boasting is not worth doing because the consequences are bad and cause chaos and hostility. On the contrary, Allah recommends creating harmony in life, helping each other in upholding the truth and helping each other in virtue and in preserving social life, by fostering noble morals and good character."
		   },
		   {
			"id": 6172,
			"surah": 102,
			"ayat": 4,
			"tafsir": "Allah repeats His threat through this verse and is a threat after a threat, like a master telling his servant not to do something, then the master repeats his words."
		   },
		   {
			"id": 6173,
			"surah": 102,
			"ayat": 5,
			"tafsir": "This verse is Allah's warning in the form of a command to beware of such bad behavior. The desire to exaggerate can preoccupy someone to do work that is not useful. What he thinks is right is actually wrong. It's just a mere supposition that must change, because it doesn't match the reality. What must be a position is one that is in accordance with the reality that can be witnessed by the eye, by feelings or based on valid arguments."
		   },
		   {
			"id": 6174,
			"surah": 102,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains some of the punishment that will be experienced by those who boast because of this negligence. They will be punished in the afterlife, and will definitely see that place with their own eyes. Therefore, they should always contemplate the awesomeness of the doom in their minds so that it will lead them to good and beneficial deeds. The meaning of the words \"seeing the hell of Jahim\" is to feel its doom, in accordance with the purpose of the Qur'an in the use of these words."
		   },
		   {
			"id": 6175,
			"surah": 102,
			"ayat": 7,
			"tafsir": "Then with this verse, Allah strengthens the contents of the previous verse, that the doom will really be felt by those who are deluded. Therefore, anyone and from any group should fear their Lord and avoid actions that cause them to be tortured. One should pay attention to the favors of Allah that are in him to be maintained and used in accordance with the function of these blessings. Also, they should not commit crimes, fabricate evil, and hope for Allah's forgiveness solely by claiming to be Muslim by using grandiose names and titles, while he violates the laws of the Al-Qur'an and commits acts the same as the enemy of Islam."
		   },
		   {
			"id": 6176,
			"surah": 102,
			"ayat": 8,
			"tafsir": "Allah further strengthens His reproach against them by saying that they will be questioned on that day about the pleasures they boast about in this world, what they did with those favors. Have they fulfilled Allah's right thereof, or have they kept the limits of Allah's law which have been determined in enjoying these favors. If they don't do it, know that these blessings are the peak of accidents in the Hereafter. It was narrated from the Prophet Muhammad, he said: Whoever among you wakes up in the morning safe in himself or safe in his place, healthy and fit body and has provisions to live for the day, then it is as if the world with all its wealth has been handed over to him. (History of al-Bukhari, Abu Dawud, at-Tirmidhi, and Ibn Majah from 'Ubaidillah bin Muhsan)."
		   }
	]
}
