{
	"tafseer": [
		{
			"id": 3706,
			"surah": 36,
			"ayat": 1,
			"tafsir": "In the previous surahs, it has been discussed about the beginning of the surah which starts with the letters of the alphabet. In conclusion, it is stated that the strongest opinion determines the letters of the alphabet are intended as a warning to arouse the interest of those who read them to important matters that will be mentioned in the following verses. However, from the narration of Ibn 'Abbas, information is obtained that yes sin means yes human (O mankind), namely O Muhammad. This is also the opinion of Abu Hurairah, 'Ikrimah, adh-ahhak, Sufyan bin Uyainah and Sa'id bin Jubair. According to them, ya sin comes from the Habsyah dialect. While Malik, who narrated from Zaid bin Aslam, said that the meaning of ya sin is the abbreviation of the names of Allah. There are others who think that yes sin is a summary of the sentence \"Ya Sayidal Basyar\", namely the Prophet Muhammad himself. Or it is one of the names of the Qur'an. However, the majority of scholars leave the meaning of ya sin to God. (for more details, see the tafsir of surah al-Baqarah\/2: 1)"
		   },
		   {
			"id": 3707,
			"surah": 36,
			"ayat": 2,
			"tafsir": "Allah swears by the Qur'an which is full of wisdom. There are several meanings of wisdom extracted from the opinions of commentators, namely: the word \"wisdom\" here muhkam, means that which is certain to be true, and there cannot possibly be anything in it that is false (not true), whether it is the meaning of pronunciation, purpose, wisdom, story , the law, and others even if viewed from any angle. \"Judge\" is a trait that is owned by intelligent people (intelligent). Likewise the Qur'an, with the wisdom it contains provides human life with provisions to purify their hearts and give them a sense of spiritual satisfaction. With purity of heart and clarity of mind, the secrets contained in nature will be revealed. The Al-Qur'an provides guidance for life that is full of wisdom, all of its teachings are in line and in harmony with a healthy mind and controlled desires, namely the way of thinking that leads to human benefit."
		   },
		   {
			"id": 3708,
			"surah": 36,
			"ayat": 3,
			"tafsir": "This verse states that the purpose of Allah's oath with the Qur'an which contains wisdom is the statement that the Prophet Muhammad was one of Allah's messengers who was sent to bring the truth. This is a firm rejection of those who do not believe in Muhammad as Allah's messenger."
		   },
		   {
			"id": 3709,
			"surah": 36,
			"ayat": 4,
			"tafsir": "This verse confirms that the Prophet was on a straight path. This is an affirmation that the religion and Shari'a brought by the Prophet Muhammad are true, straight, come from God. One of the characteristics of Muhammad's message is always being on a straight path. The truth he carries is clear, without confusing truth and falsehood. Muhammad's Shari'a does not tend to follow human desires, but always encourages humans to be happy, both in this world and in the hereafter. Allah's Word: And truly, you really guide (man) to the straight path. (asy-Shura\/42: 52)"
		   },
		   {
			"id": 3710,
			"surah": 36,
			"ayat": 5,
			"tafsir": "This verse firmly determines the position of the Qur'an, namely the holy book that comes from Allah, not the holy book made by humans. Allah has revealed to His servants in order to understand the nature of the scriptures which He sent down, namely from the Almighty, who acts as He wishes, but He is also Most Merciful to His servants. This compassion is stated in the Al-Qur'an which contains mercy for all human beings. A similar meaning to this verse is: And indeed, this (Qur'an) was truly sent down by the Lord of the worlds. (asy-Syu'ara'\/26: 192)"
		   },
		   {
			"id": 3711,
			"surah": 36,
			"ayat": 6,
			"tafsir": "As for the wisdom of the reduction of the Qur'an, among others, to warn the Arabs who had never been sent to them an apostle. In this verse it is mentioned that the moral decay of the Arab nation is due to the heedlessness in their hearts. A negligent heart is a heart that does not carry out the obligations that must be carried out. They are Arabs descended from the Prophet Ismail who had never been sent by any messenger to them. Therefore, they do not know the law that brings people to happiness in this world and in the hereafter. As for the word qaum which contains a special meaning aimed only at the Arabs, it does not change the true meaning of the treatise, which is addressed to all mankind, as emphasized in another verse: Say (Muhammad), \"O people! Truly I am Allah's Messenger to all of you. (al-A'raf\/7: 158)"
		   },
		   {
			"id": 3712,
			"surah": 36,
			"ayat": 7,
			"tafsir": "It was Allah's decree to punish the forefathers of the disbelievers as happened to most of the people who had rejected the coming of the apostles sent to them. Their denial and moral wickedness caused their hearts to be incapable of experiencing the truth and unwilling to submit to Allah."
		   },
		   {
			"id": 3713,
			"surah": 36,
			"ayat": 8,
			"tafsir": "Then a parable is given to those who do not want to believe, as if shackles had been placed around their necks, their hands were raised up to their chins. This causes their faces to always look up. Such is the picture of an unbeliever because he cannot turn right and left to make comparisons. The shackles were so tight that they did not allow his head to move at all. In another verse there is also a statement: And if the truth were to indulge their desires, the heavens and the earth, and all that is in them, would surely perish. We even warned them, but they turned away from the warning. (al-Mu'minun\/23: 71) According to history, this verse was originally revealed in connection with the intention of Abu Jahl and two of his friends who came from Bani Makhzum. Abu Jahal once swore that if he saw Muhammad praying in the Baitullah, he would drop a large rock on his head. One day, he saw the Prophet prostrating, in his hand was a large enough stone. When he lifted the stone and was about to throw it at the Prophet who was prostrating, he hesitated and the stone slipped from his hand. Abu Jahl returned to his people and told what had happened. Then there was also a Bani Makhzum, because he was interested in the story of Abu Jahl, he also intended to throw the Prophet when he was going to pray. When he was about to carry out his evil intentions, Allah blinded his eyes. He returned to his people blind. He told that when he was about to carry out his intention, suddenly a large animal appeared ready to pounce on him. If he had thrown the stone too, the beast would have pounced on him. Some say that the meaning of shackles here is the meaning of majazi (figuratively). So what is meant by shackles is a barrier that hinders one's intention to believe in Allah."
		   },
		   {
			"id": 3714,
			"surah": 36,
			"ayat": 9,
			"tafsir": "Then it is also described that those who do not believe that look good at the evil deeds they do. This causes them to be arrogant, so they are reluctant to follow the teachings of the apostles. His mind is closed from the truth, from that which can be of benefit. Therefore, there was nothing they could understand except what had been passed down from their ancestors. In short, they are always in a prison of ignorance, as if their hearts are separated by a wall, so they cannot think and reflect on the arguments for the truth of the teachings brought by the apostles. There are also those who interpret the wall that blocks it with the hijab; so that it means that Allah made the hijab that prevented polytheists from hurting the Messenger. While closed eyes are interpreted, they cannot sense well what they see, and there is no clue that can straighten their minds. (10) In this verse, Allah explains that people who cannot accept the instructions, even though they are threatened with painful punishment, will not change. Because their hearts are actually dead and cannot accept instructions. This is because their minds are no longer able to think about the truth being conveyed, and their eyes are blind from the truth. In short, those whom Allah has decreed to be in error, it is no longer possible for him to benefit from all the advice that people convey. Allah said: Verily those who disbelieve, it is the same to them, you (Muhammad) give warning or you do not warn, they will not believe. Allah has locked their hearts and ears, their eyesight has been closed, and they will receive a severe punishment. (al-Baqarah\/2: 6-7) And His words: Indeed, those who have been confirmed to receive the decree of your Lord, will not believe. (Yunus\/10: 96)"
		   },
		   {
			"id": 3715,
			"surah": 36,
			"ayat": 10,
			"tafsir": "In this verse, Allah makes it clear that those who cannot accept this guidance, even when threatened with severe punishment, will not change. Because their hearts are actually dead and cannot accept instructions. This is because their minds are no longer able to think about the truth being conveyed, and their eyes are blind from the truth. In short, those whom Allah has decreed to be in error, it is no longer possible for him to benefit from all the advice that people convey. Allah said: Verily those who disbelieve, it is the same to them, you (Muhammad) give warning or you do not warn, they will not believe. Allah has locked their hearts and ears, their eyesight has been closed, and they will receive a severe punishment. (al-Baqarah\/2: 6-7) And His words: Indeed, those who have been confirmed to receive the decree of your Lord, will not believe. (Yunus\/10: 96)"
		   },
		   {
			"id": 3716,
			"surah": 36,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains that only people who can accept the instructions of the Prophet Muhammad who are afraid of hearing Allah's threats, namely those who believe in the Qur'an and want to implement the guidelines he has outlined. They feel conscious, terrified, and horrified when they hear God's threat and torment. Allah is the Greatest of His Mercy and the Most Painful of His Punishment, as stated in another verse: Tell My servants that I am the Most Forgiving, the Most Merciful, and indeed My punishment is a very painful punishment. (al-hijr\/15: 49-50) Allah ordered the Prophet Muhammad to give good news to those who believe that they will receive magfirah (pardon) and a noble reward, namely eternal favors that cannot be described, never seen by the eye, heard by the ear, and crossed the heart. Another verse states: Indeed, those who fear their Lord whom they cannot see, they will receive forgiveness and a great reward. (al-Mulk\/67: 12) The meaning of Allah's word \"fear God the Most Merciful even though he does not see it\" is to always carry out orders and stay away from His prohibitions when there are people who know or not, or he fears Allah both when he is alone or with other people. It is people of faith and personality like the one above that Allah gave the good news through the Prophet Muhammad. The good news is that all the sins they have ever committed will be forgiven by Allah with His magfirah, and they will enjoy a glorious reward, namely heaven which is as wide as the heavens and the earth, as stated in the verse: And hurry to seek forgiveness from your Lord and get heaven. an area as wide as the heavens and the earth is prepared for those who are pious. (ali 'Imran \/ 3: 133)"
		   },
		   {
			"id": 3717,
			"surah": 36,
			"ayat": 12,
			"tafsir": "Then it is also stated that one must fear his Lord, because Allah will revive all those who have died and raise them from their respective graves on the Day of Judgment. At that time humans got a record of all the deeds, both big and small, that had been done in the world before. Not a single action goes unnoticed. Everything is written in the book with care and. The Qur'an states: And put the book (record of charity), then you will see the sinners fear what is (written) in it, and they say, \"How unfortunate we are, what book is this, there is nothing left , the small and the large but all are recorded,\" and they find (all) what they have done (written). And your Lord does not wrong anyone. (al-Kahf\/18: 49) Not only their deeds are written in the book, but also all the deeds they left behind, which were followed and still used by many people after they died, such as the knowledge they taught, the property that was donated, or the hospital he founded for public health. Likewise the evil deeds left behind, such as the slander that he once spread, causing people to clash or divide. In short, every action that creates an impact, whether beneficial or harmful, is written down in that book. This verse is in line with the hadith of the Prophet which reads: Whoever makes a good tradition (habit) will get the reward and the reward of those who practice it after he dies without their reward being reduced in the least. And whoever makes a bad tradition (habit), he will bear his sins and the sins of those who do it after (he) dies without the slightest reduction in their sins. Then the Messenger of Allah read the verse \"wanaktubu maqaddamu wa atsarahum\" (and We are the ones who record what they have done and the traces they (leave).\" (Al-Bukhari history from Abu Musa.. al-Asy'ari) with the meaning of Allah's word \"And We write down what they have done and the marks they left behind\", Imam at-Tirmidhi narrated a story, as contained by Ibn Kathir in his commentary, where it is said that there were people from Bani Salamah living on the outskirts of Medina. They felt how far their place of residence was from the Prophet's mosque. So that they could come in congregation earlier to gain the virtue of congregational prayers, they intended to move their homes to the area around the mosque, so this verse was revealed. After Rasulullah called them, he also said, \"Your good intentions will be written down.\" Finally they did not move. Ibn Jarir ath-tabari also narrated that the houses of some Ansar people were far away. from the Prophet's mosque. They wanted to move it, so this verse came down. They finally canceled the intention. Perhaps what prompted the Bani Salamah people or a group of Ansar friends to move their homes was the hadith of the Prophet which states that praying in congregation is 27 times more rewarded than praying alone. The Messenger of Allah said: The person who has the most reward in prayer is the one who walks the farthest on foot, then the farthest, and the person who waits for the prayer so that he does it with the imam is greater in reward than the person who prays (alone) then he sleeps.\" (Al-Bukhari and Muslim narrations from Abu Musa) Then it was further emphasized that not only the deeds of the Children of Adam were carefully written down in the book, but also what happened on this earth. the real one) is the Lawh Mahfudh. This verse is further strengthened by explanations of other verses which read: He (Musa) replied, \"Knowledge about it is in my Lord, in a Book (Lauh Mahfudh), my Lord will not make mistakes or forget. \" (thaha\/20: 52) And the verse: And all (things) both small and large (everything) is written. (al-Qamar\/54: 53) Thus the explanation of the verses above confirms the coming of the Day of Judgment, where humans will receive a reward for all their efforts, both bad and good. From this verse it can be understood that the good news is forgiveness and paradise for those who fear God and follow the instructions of the Qur'an ordained by Allah later after the day of Resurrection."
		   },
		   {
			"id": 3718,
			"surah": 36,
			"ayat": 13,
			"tafsir": "Allah ordered the Prophet Muhammad to tell the Quraysh polytheists and at the same time to the people who denied his treatise about the history of Ashhabul Qaryah as a lesson for them. The essence of the story states that anyone who denies the apostle will experience the unfortunate fate that Ashhabul Qaryah experienced. In several tafsirs it is explained that what is meant by Ashhabul Qaryah is a resident of the city of Antakia (Arabic: Anthakiyah), but some say the residents of an unknown city. As for the three envoys, some say that they were Isa's envoys. to the residents of the country, and some say they are messengers sent to the residents of the country."
		   },
		   {
			"id": 3719,
			"surah": 36,
			"ayat": 14,
			"tafsir": "Because the two envoys who mentioned their names (Yuhana and Bulus) failed to carry out their mission, another person named Syam'un was sent with the same task. The message they brought was so that the people of Antakia would cleanse themselves of acts of polytheism, so that they would free themselves from all forms of worship other than Allah, and then return to the teachings of monotheism."
		   },
		   {
			"id": 3720,
			"surah": 36,
			"ayat": 15,
			"tafsir": "Then in this verse it is stated that the basic reason why his people do not want to believe in Allah. Most of the deniers believe that the three envoys are ordinary human beings like them too, without any outstanding features. At that time, maybe now, a person will not be respected if he does not have extraordinary intelligence or expertise. The second reason is because they believe that the Most Merciful God did not send down treatises or books containing revelations nor did He command them to believe in the three messengers. Hence, they concluded the three messengers were a lie. God's Word, which describes their rejection of \"ma anzala ar-rahman\", shows that the people of Antakia have known God for a long time, but they denied it and replaced it with idols. Therefore, all their apostles rejected."
		   },
		   {
			"id": 3721,
			"surah": 36,
			"ayat": 16,
			"tafsir": "Such views were refuted by the envoys by saying that only Allah knows that they are really the people who were sent to these residents. If they lie, then a painful punishment will befall them. Their task will be approved by Allah, and it will be known later who is at fault and must bear the risk for that mistake. In another verse, an answer like that could indeed be uttered by an apostle, for example: And they ask you to send down the punishment immediately. Had it not been for the appointed time, the punishment would have come to them, and (the punishment) would have come to them suddenly, while they were not aware of it. (al-'Ankabut\/29: 53)"
		   },
		   {
			"id": 3722,
			"surah": 36,
			"ayat": 17,
			"tafsir": "This verse explains that the mission carried by the apostles was simply conveying God's message. The decision is in the hands of humans, whether to believe in the message or not. If they believe, the benefit of that faith is for their happiness too, in this world and in the hereafter. On the other hand, if the disbelievers do not want to carry out the call of the apostles, the consequences will certainly befall themselves."
		   },
		   {
			"id": 3723,
			"surah": 36,
			"ayat": 18,
			"tafsir": "In this verse it is explained that the people of Antakia could no longer overrule the apostles' reasons. Therefore, they threaten by saying that if tribulation befalls them in the future, it will be due to the actions of these three people. Thus, if the apostles did not want to stop this futile preaching, they had to stone him or subject him to very painful tortures. The three envoys countered their words by saying that if the people of Antakia were to be forced to experience torment, it would be the result of their own actions. Aren't those who associate partners with Allah, do immoral acts, and commit mistakes? Meanwhile, the three envoys only invited them to obey Allah, to be sincere in worship, and to repent of all mistakes. Was it because the apostles warned them of the painful punishment of Allah and invited them to become one with Allah, then they tortured the apostles? Is that the appropriate reward for the apostles? This shows that they are a nation that transgresses the limits by way of thinking and determines the decision to torture and stone the apostles. They despise the people they should turn to for guidance. The verse which is similar in meaning to this verse is: Then when goodness (prosperity) comes to them, they say, \"This is because of our (efforts). And if trouble befalls them, they throw it because of that bad luck on Musa and his followers. Know, in fact their fate is in the hands of Allah, but most of them do not know. (al-A'raf\/7: 131)"
		   },
		   {
			"id": 3724,
			"surah": 36,
			"ayat": 19,
			"tafsir": "In this verse it is explained that the people of Antakia could no longer overrule the apostles' reasons. Therefore, they threaten by saying that if tribulation befalls them in the future, it will be due to the actions of these three people. Thus, if the apostles did not want to stop this futile preaching, they had to stone him or subject him to very painful tortures. The three envoys countered their words by saying that if the people of Antakia were to be forced to experience torment, it would be the result of their own actions. Aren't those who associate partners with Allah, do immoral acts, and commit mistakes? Meanwhile, the three envoys only invited them to obey Allah, to be sincere in worship, and to repent of all mistakes. Was it because the apostles warned them of the painful punishment of Allah and invited them to become one with Allah, then they tortured the apostles? Is that the appropriate reward for the apostles? This shows that they are a nation that transgresses the limits by way of thinking and determines the decision to torture and stone the apostles. They despise the people they should turn to for guidance. The verse which is similar in meaning to this verse is: Then when goodness (prosperity) comes to them, they say, \"This is because of our (efforts). And if trouble befalls them, they throw it because of that bad luck on Musa and his followers. Know, in fact their fate is in the hands of Allah, but most of them do not know. (al-A'raf\/7: 131)"
		   },
		   {
			"id": 3725,
			"surah": 36,
			"ayat": 20,
			"tafsir": "This verse explains that sunatullah applies if the apostle who is in charge of conveying the truth is pressed, he will surely receive Allah's help. In connection with the story of the rejection of the people of Antakia against the three envoys of Prophet Isa, there comes a man named habib an-Najjar who has no influence or decisive power, nor is he a family or person who has influence over the king of that country. Only with the dynamics of the strength of his faith did he come from all over the country to defend the three envoys by warning those who wanted to torture them. He called on the inhabitants of the city to follow the apostles who came only to convey God's instructions."
		   },
		   {
			"id": 3726,
			"surah": 36,
			"ayat": 21,
			"tafsir": "The man explained that the three envoys who preached the truth did not expect any reward at all for their efforts in conveying the treatise. They received instructions from Allah that the one who should be worshiped is Allah, the One and Only, without associating Him with anything. The man named habib an-Najjar came from afar to explain to the people of Antakia that he was teaching them lessons and teaching, after he believed what he was saying was something good for himself and them. Why does he not worship Allah Almighty who created him, and to Him all living things return? There they will receive all the rewards of their deeds. People who do good must enjoy the results of their goodness, while those who do evil, of course, cannot escape the punishment in return. The above affirmation is in response to the question of his people who do not want to believe. According to habib, it is inappropriate for him to seek another god apart from God Almighty. The god they worship is a god who is unable to benefit or reject harm, does not hear or see, and is unable to provide help (intercession). These gods, of course, cannot prevent them from the punishment of Allah, even though they have worshiped them. Therefore, if he participates in worshiping what they worship other than God Almighty, he has indeed taken a misguided path. If he worships a statue made of stone or other creatures, which is absolutely impossible to bring benefits or repel harm, doesn't that mean he is in error? The man who had come from far away ended his advice by confirming in front of his people to the three emissaries about his true stance. He said, \"Listen, O messengers of Prophet Isa, I believe in your Lord who has sent you. Therefore, watch and listen to what I have to say.\" According to history, after Habib announced his stand, the infidels then threw stones at him. His whole body was bleeding. Finally Habib died in a state of martyrdom upholding the truth. There is also a history that says that both his legs were pulled in opposite directions until they were torn so that fresh blood was gushing from the rectum. He died in carrying out his duties. Before meeting his death, the hero still had time to pray to Allah, \"O Allah, show me my people, indeed they are people who do not know.\" When the day of Resurrection arrived, Allah ordered the habib, \"Enter you into heaven as a reward for what you have done while in the world.\" After he entered and felt how beautiful and enjoyable Allah's reward was for those who had faith and were patient in carrying out da'wah duties, he also said, \"I wish my people used to know that I received forgiveness and glory from Allah.\" Magfirah and glory that can only be enjoyed by some people who believe. In fact the verse above uses the word \"tamani\" (expecting something that is impossible to achieve) to encourage the Antakia and believers in general to try as much as possible to obtain such a reward, repent from all disbelief, and enter into the group of people who feel the beauty of believing in Allah, obeying the way of the saints of Allah, by holding back anger and bestowing compassion on those who are against him. Ibn 'Abbas said that Habib advised his people when he was still alive with the words, \"Follow the treatise brought by the messengers.\" Then after he died as a result of their torment, he also still hoped, \"May my people know that Allah has forgiven me and made me one of those who are glorified.\" After the habib was killed, Allah lowered His torment on them. Jibril was ordered to come to the rebellious people. With just one shout, like a thunderbolt, they suddenly all died. That is a reward that is commensurahte with mistakes for denying Allah's messengers, killing His saints, and denying Allah's message."
		   },
		   {
			"id": 3727,
			"surah": 36,
			"ayat": 22,
			"tafsir": "This verse describes the awareness that arises in the heart and the light of faith that has illuminated the person's soul, so that he believes that there is not the slightest reason for him not to believe in Allah. Because it is He who has created and shaped him in such a way in the process of events, so that he has been able to embrace the religion of monotheism, namely a religion that teaches to believe in Allah as the One and Only God. At the end of this verse, that person states that only to Allah will he return after leaving this mortal world, not to anyone else. This statement arose from the depths of his heart, after he felt the power and greatness of Allah. A person dedicates himself to Allah because: 1. Feels the power and greatness of Allah. Only He has the right to be worshiped, nothing else. Because of that belief, he remains a slave to Allah under any circumstances, whether he is favored by Him or not, whether he is in misery or in pleasure, whether in narrowness or spaciousness. 2. The servant who worships Allah has felt the favors bestowed upon him, he feels dependent on Allah's favors. 3. A servant hopes for a reward from Allah and is afraid of being overwritten by His punishment. The servant referred to in this verse is a servant who belongs to the first class. The servant continues to worship Allah according to what He has ordained, even though he is beset by calamities, tribulations and other trials. He stated that everything that was in him, his soul and body, life and death, all belonged to God. This person's faith is in accordance with the faith referred to in the word of Allah: Say (Muhammad), \"Indeed, my prayer, my worship, my life and my death are for Allah, the Lord of the worlds, He has no partner; and that is what I have been commanded and I am a the first to surrender (muslim).\" (al-An'am\/6: 162-163)"
		   },
		   {
			"id": 3728,
			"surah": 36,
			"ayat": 23,
			"tafsir": "Then the servant mentioned above asked himself, \"Do I deserve to worship God other than Allah, the Almighty, even though if He intended to bring calamity or harm upon me, surely nothing would be able to help me, and so did the gods. that I worship. They are powerless in the least to save me from harm and calamity.”"
		   },
		   {
			"id": 3729,
			"surah": 36,
			"ayat": 24,
			"tafsir": "Then the servant mentioned above asked himself, \"Do I deserve to worship God other than Allah, the Almighty, even though if He intended to inflict some calamity or harm on me, surely nothing could help me, neither did the gods. whom I worship. They are powerless in the least to save me from harm and calamity.\""
		   },
		   {
			"id": 3730,
			"surah": 36,
			"ayat": 25,
			"tafsir": "He then obtained the correct answer to that question, namely that it is not proper for him to serve other than Allah. Only Allah is the true God. And if he worships other than Allah, surely he is in a clear error."
		   },
		   {
			"id": 3731,
			"surah": 36,
			"ayat": 26,
			"tafsir": "Finally, the person makes the right decision based on full confidence that he only believes in Allah, namely the true God for him and his people. He then announced his faith and belief to his people, and said emphatically, \"Indeed, I have believed in Allah, who is your true Lord. So listen to this statement of my faith.\" The attitudes and statements of faith like those mentioned above, which are made in the midst of a society that is still wallowing in disbelief, polytheism, and disobedience, are truly a form of courage that arises from the light of faith that has illuminated one's conscience. He wanted his people to believe too. He is not afraid of threats that endanger himself, for the sake of carrying out his sacred duty to invite people to the right path. According to a history, when the man said that his people attacked him and killed him and no one defended him. Meanwhile according to Qatadah, \"His people stoned him, and he kept praying, 'O my Lord, show me my people, because they do not know.' They stoned him until he breathed his last. In another narration it is stated that the person referred to in the above verses is named habib an-Najjar, who has measles, but likes to give charity. He gives half of his daily income. It is said that after his people heard his statement of faith in Islam, anger flared against him, and finally they killed him. However, at the moment before he breathed his last, an angel descended upon him to inform him that Allah had forgiven all his sins that he had committed before he believed, and he was entered into heaven so that he would be included in the group of people who receive glory in the sight of Allah. . In the last seconds, he still managed to say words filled with hope, \"It would be nice if my people knew God's grace that He bestowed upon me, thanks to my faith in Him, I have received forgiveness for my sins. I will be entered into heaven with multiple rewards, and are among those who are honored with Him. If they had known this, they would have believed too.\" Habib's statement is a statement of very high value and shows the height of his morals. Even though he had been stoned and tortured by his people, he still hoped that his people would be aware and receive mercy from God as they had experienced."
		   },
		   {
			"id": 3732,
			"surah": 36,
			"ayat": 27,
			"tafsir": "Finally, the person makes the right decision based on full confidence that he only believes in Allah, namely the true God for him and his people. He then announced his faith and belief to his people, and said emphatically, \"Indeed, I have believed in Allah, who is your true Lord. So listen to this statement of my faith.\" The attitudes and statements of faith like those mentioned above, which are made in the midst of a society that is still wallowing in disbelief, polytheism, and disobedience, are truly a form of courage that arises from the light of faith that has illuminated one's conscience. He wanted his people to believe too. He is not afraid of threats that endanger himself, for the sake of carrying out his sacred duty to invite people to the right path. According to a history, when the man said that his people attacked him and killed him and no one defended him. Meanwhile according to Qatadah, \"His people stoned him, and he kept praying, 'O my Lord, show me my people, because they do not know.' They stoned him until he breathed his last. In another narration it is stated that the person referred to in the above verses is named habib an-Najjar, who has measles, but likes to give charity. He gives half of his daily income. It is said that after his people heard his statement of faith in Islam, anger flared against him, and finally they killed him. However, at the moment before he breathed his last, an angel descended upon him to inform him that Allah had forgiven all his sins that he had committed before he believed, and he was entered into heaven so that he would be included in the group of people who receive glory in the sight of Allah. . In the last seconds, he still managed to say words filled with hope, \"It would be nice if my people knew God's grace that He bestowed upon me, thanks to my faith in Him, I have received forgiveness for my sins. I will be entered into heaven with multiple rewards, and are among those who are honored with Him. If they had known this, they would have believed too.\" Habib's statement is a statement of very high value and shows the height of his morals. Even though he had been stoned and tortured by his people, he still hoped that his people would be aware and receive mercy from God as they had experienced."
		   },
		   {
			"id": 3733,
			"surah": 36,
			"ayat": 28,
			"tafsir": "Finally, the person makes the right decision based on full confidence that he only believes in Allah, namely the true God for him and his people. He then announced his faith and belief to his people, and said emphatically, \"Indeed, I have believed in Allah, who is your true Lord. So listen to this statement of my faith.\" The attitudes and statements of faith like those mentioned above, which are made in the midst of a society that is still wallowing in disbelief, polytheism, and disobedience, are truly a form of courage that arises from the light of faith that has illuminated one's conscience. He wanted his people to believe too. He is not afraid of threats that endanger himself, for the sake of carrying out his sacred duty to invite people to the right path. According to a history, when the man said that his people attacked him and killed him and no one defended him. Meanwhile according to Qatadah, \"His people stoned him, and he kept praying, 'O my Lord, show me my people, because they do not know.' They stoned him until he breathed his last. In another narration it is stated that the person referred to in the above verses is named habib an-Najjar, who has measles, but likes to give charity. He gives half of his daily income. It is said that after his people heard his statement of faith in Islam, anger flared against him, and finally they killed him. However, at the moment before he breathed his last, an angel descended upon him to inform him that Allah had forgiven all his sins that he had committed before he believed, and he was entered into heaven so that he would be included in the group of people who receive glory in the sight of Allah. . In the last seconds, he still managed to say words filled with hope, \"It would be nice if my people knew God's grace that He bestowed upon me, thanks to my faith in Him, I have received forgiveness for my sins. I will be entered into heaven with multiple rewards, and are among those who are honored with Him. If they had known this, they would have believed too.\" Habib's statement is a statement of very high value and shows the height of his morals. Even though he had been stoned and tortured by his people, he still hoped that his people would be aware and receive mercy from God as they had experienced."
		   },
		   {
			"id": 3734,
			"surah": 36,
			"ayat": 29,
			"tafsir": "In this verse, Allah explains the punishment that befalls those who are polytheists, disbelievers, and deny His religion. Allah does not need to send down armies of angels to destroy them, but with just one scream from the angel Gabriel, the disbelievers become stiff and lifeless again. The event happened so quickly, as proof of how great God's power is."
		   },
		   {
			"id": 3735,
			"surah": 36,
			"ayat": 30,
			"tafsir": "Allah explains that this kind of attitude and behavior of the disbelievers is very regrettable. They not only rejected the call of faith, but also ridiculed the apostles and those who had faith. In fact, not infrequently they persecuted and killed him. If they would think with common sense, they would have accepted the call of faith from the apostles and those who had faith. Allah explains the position of disbelievers in the hereafter when they are subjected to terrible punishment for denying the apostles."
		   },
		   {
			"id": 3736,
			"surah": 36,
			"ayat": 31,
			"tafsir": "Allah then warned them to be willing to pay attention to the fate that befell the disbelievers centuries before them who had been afflicted by Allah's wrath, so that they were destroyed and disappeared from the face of the earth. They would never reappear in this world. Ibn Kathir said, \"Most of the salaf scholars narrate that what is meant by 'country' in this verse is the country of Antakiyah, and those who were sent were the envoys of Prophet Isa, to that country to convey his message.\" There are several things that make us object to accepting this history because of the following factors: 1. It is impossible for Allah to destroy the country of Antakiyah because the inhabitants of that country were the first residents of the country to believe in Jesus. Allah will not destroy a land whose inhabitants are believing and fulfilling the call of the messenger sent to them. 2. In this verse it is explained that the country was destroyed by Allah, so that the entire land and its inhabitants were destroyed. The Qur'an explains that Allah sent down punishment on the disbelievers in the form of their destruction and annihilation with their land, until the Torah was revealed. After the Torah was revealed, Allah never sent down such punishment. This is understood from His words: And indeed, We gave Moses the Book (Torah) after We destroyed the former nations, to be a lamp for mankind and guidance and mercy, so that they may receive a lesson. (al-Qashash\/28: 43) 3. There is not a single strong text regarding this history, such as information explaining when and where the incident occurred, and so on. Meanwhile the Muslims believe in the stories contained in the Qur'an. Not all stories are explained in detail in the Qur'an. Some of the stories are explained in detail and some are not. However, each story has a purpose and purpose. Therefore, it is not necessary for Muslims to know the details of the story mentioned in the verse above. However, Muslims should use these stories as lessons and recommendations, so that they can add to and strengthen each other's faith."
		   },
		   {
			"id": 3737,
			"surah": 36,
			"ayat": 32,
			"tafsir": "In this verse, Allah confirms that all of them, both past, present and future, will surely be gathered before His presence to account for their actions and behavior while in the world."
		   },
		   {
			"id": 3738,
			"surah": 36,
			"ayat": 33,
			"tafsir": "In this verse it is explained that one of the signs of Allah's power and the existence of the day of resurrection, is the presence of land that was originally dead, barren and arid, and did not grow any plants, but with Allah's power everything came alive with rain falling from the sky. This allows the growth of various plants that produce food for humans and other creatures that live on this earth. In this way, humans and other creatures obtain food to grow their bodies and give them strength. In addition, these agricultural products can also be used as commercial materials to be traded by humans."
		   },
		   {
			"id": 3739,
			"surah": 36,
			"ayat": 34,
			"tafsir": "Allah also created on this earth gardens, fields, and rice fields, which can be planted with various plants that produce foodstuffs for humans, such as dates and grapes which are food ingredients for the Arabs. Similarly, rice, wheat and corn are staple foods for other nations. In addition, Allah also created water sources which then flowed into rivers, which are very necessary for life on earth. Even in our time, water is needed not only for drinking, bathing and washing, but also for irrigation and power generation which are essential for the advancement of agriculture and industry."
		   },
		   {
			"id": 3740,
			"surah": 36,
			"ayat": 35,
			"tafsir": "Allah created and bestowed all these things on human beings, so that they may be nourished by their fruits and their results. Likewise from the results of their handicraft business, which we are now familiar with the almost countless agricultural and industrial products. If they want to think about how great Allah's power and favors are, why don't they also want to thank Him. This kind of attitude and behavior is really not worthy of intelligent people."
		   },
		   {
			"id": 3741,
			"surah": 36,
			"ayat": 36,
			"tafsir": "In this verse another proof of Allah's power is explained, namely that He has created His creatures in pairs, both pairs of sex, namely male and female, as well as pairs of characteristics, such as: big and small, strong and weak, tall and low, rich and poor, and so on. Even the pairing also occurs in electric currents, namely positive and negative currents, which then creates a force that can generate electricity and cause light. Electric power and the light it produces are vital in human life in this modern era. These are all things that man has managed to know up to the present day. However, there are many more pairs that have not been reached by human knowledge and discoveries until now. Perhaps, human scientific and technological advances in the future will also be able to reveal some of the secrets that are still hidden about the existence of pairs in other fields that are not yet known in our time. In this verse, the signs of Allah's power and greatness are explained in pairs that He has created, namely: 1. Objects that He has grown on earth that are known to humans, such as plants and so on. 2. In themselves, as there are types of men and types of women. From the relationship between the two types, their offspring were born. 3. Things that are not yet known to humans. Allah's knowledge is vast and unlimited, while what humans know is only a small part of it. Regarding couples, there are also things that have not been revealed by humans."
		   },
		   {
			"id": 3742,
			"surah": 36,
			"ayat": 37,
			"tafsir": "In this verse, Allah explains another proof about His almighty power and proof of the existence of the day of resurrection, namely the existence of the night. God took off the day and brought the night, suddenly man was in darkness. This verse laid the foundations for natural science and astronomy. The occurrence of day and night is due to the movement of the solar system, especially the earth and the sun, so that the part of the earth that is exposed to sunlight experiences day, and the part that is not exposed to sunlight experiences night. This happened one after another. The advancement of human knowledge regarding astronomy or astronomy at this time has allowed them to know about objects in the outer space. With advances in technology, humans can finally navigate space, not just observing it from the earth. The existence of day and night is also beneficial for humans. During the day they use to work for the necessities of their life. While night time is generally used for resting and sleeping, as one of their physical and spiritual needs."
		   },
		   {
			"id": 3743,
			"surah": 36,
			"ayat": 38,
			"tafsir": "Allah explains another proof of His power, namely the circulation of the sun, which moves in a certain orbit in an orderly manner according to the conditions set by Allah. He did not deviate from the predetermined line in the slightest. If he had deviated by a hair's breadth, there would have been a collision with other heavenly bodies. We cannot imagine what will happen as a result of that event. At first glance, one would accept that only the sun moves, while the earth stays in place. In the morning, the sun is seen in the east, while in the afternoon it is in the west. However, astronomy says that the sun moves while rotating on its axis, while the earth is in front of it, also walks while rotating on its axis, and revolves around the sun. It turns out that what is determined by astronomy is in line with what has been explained in the verse. Therefore, it is no exaggeration to say that the higher human scientific and technological ability, the more open are the truths that have been presented in the Qur'an since fourteen centuries ago. Allah is the Greatest. God is great in power."
		   },
		   {
			"id": 3744,
			"surah": 36,
			"ayat": 39,
			"tafsir": "Allah has determined certain distances for the moon's cycle, so that at each distance it changes, both in shape and size, as well as in the strength of its light. At first the moon appeared in a small state and weak light. Then it becomes a crescent moon with a curved shape and a brighter light. Furthermore, the more perfect round shape, so that it becomes a full moon with a very bright light. But then it shrank more and more, until at last it resembled a dry bunch curved in shape with a fading light, returning to its former state. If we also pay attention to the billions of other celestial bodies, with different distances and sizes, as well as different speeds of motion, all running in an orderly manner, all of this will add to our belief about the limitlessness of this natural space and how the power of Allah who created and governed His creatures. Taking into account all that, there will be no other words that come out of the mouth of a believer, other than the words \"Allahu Akbar, Allah is the Greatest, and the Greatest is His power.\""
		   },
		   {
			"id": 3745,
			"surah": 36,
			"ayat": 40,
			"tafsir": "Based on Allah's arrangements and provisions that apply to natural objects, a rule called \"Sunnatullah\", it is impossible for a collision between the sun and the moon to occur, and neither does the night precede the day. Everything will go according to the rules He has set. Each of them continues to move according to the orbit that God has set for him. How small is human power, compared to the power of God who creates and regulates the course of natural objects so that they continue to run in an orderly manner. Humans have made various traffic regulations on the highway equipped with various signs. However, road traffic accidents still occur everywhere. Human regulations always show their weak side."
		   },
		   {
			"id": 3746,
			"surah": 36,
			"ayat": 41,
			"tafsir": "In this verse, Allah states that a ship sailing in the middle of the ocean is one of the proofs of His greatness and power. The ship transports people and goods for their needs from one country to another, both those that are nearby and those that are far away. The use of sea transportation as a means of transportation used by humans to move and transport goods has been known since ancient times, and has even been known since the time of Prophet Noah. The person who first made the ship was Prophet Noah. The ship was made at the command and guidance of Allah. This is explained in His word: And build the ship with the supervision and guidance of Our revelation. (Hud\/11: 37) Boats, canoes and heavy ships, whether driven by human power, wind power or engine power, can slide easily on the water transporting people and goods from one island to another, from from one continent to another, of course related to a force that holds the ship, so it doesn't sink. This is evidence of Allah's power and greatness through the enactment of His natural law. Allah says: Do you not see that the ship actually sails on the sea by the grace of Allah, so that He will show you some of His signs (greatness). Indeed, in that there are His signs (greatness) for everyone who is very patient and very grateful. (Luqman\/31: 31)"
		   },
		   {
			"id": 3747,
			"surah": 36,
			"ayat": 42,
			"tafsir": "In this verse, Allah reminds people of another proof of His power. God gave humans a variety of vehicles besides boats, arks and ships, namely animals that can be used as vehicles or means of transportation, for example: horses, donkeys, camels, elephants and so on. This is a land transportation tool for humans. In another verse Allah says: And (He has created) horses, mules and donkeys, for you to ride and (to be) ornaments. Allah creates what you do not know. (an-Nahl\/16: 8) To make it possible to transport more people and goods, humans can make land transportation tools pulled by these animals, such as carts, carts, carts, and so on. By using the mind that God has bestowed upon him, humans can also make means of transportation that move with engine power that use fuel in the form of petroleum or coal, which is also provided and bestowed by God to humans. These motorized vehicles can run faster and have more loads. Thanks to the progress of reason (reason) and science that Allah has bestowed on humans, they can make vehicles that can fly in the air, from balloons, airplanes, to rockets that propel space ships whose speeds can exceed the speed of voice. These are all gifts from Allah to humans. By getting around the law of gravity, humans succeeded in creating airplanes for the benefit of human transportation."
		   },
		   {
			"id": 3748,
			"surah": 36,
			"ayat": 43,
			"tafsir": "Allah warns that if He wills to sink the ships sailing in the sea, it will surely happen. The coming of a strong windstorm that creates powerful waves, will cause the ships to sink, the passengers perish and be buried to the bottom of the sea, unable to be helped anymore. This is a warning so that humans do not be arrogant, arrogant, and feel that their achievements in creating vehicles that can run on land, sea, and air are solely because of their brain intelligence, not because of a gift from Allah. From natural science we can know that something can float on water, if the density of the object is lighter than the specific gravity of the water through which it passes. This is the provision or sunatullah that Allah has set for the water He has created. By getting around the natural law of water that can make an object sink and can also float, humans can make a submarine that can dive deep into the seabed, but when needed can rise to the surface of the water. This is done by reducing the air in the cavity of the submarine so that it sinks. However, if air was pumped back into the cavity, the submarine would become light enough to float on the surface of the water."
		   },
		   {
			"id": 3749,
			"surah": 36,
			"ayat": 44,
			"tafsir": "In this verse, Allah confirms that because of His great love for His servants, and so that they can have fun enjoying His gifts, Allah does not allow those vehicles to perish, both those traveling on land , sailing on the surface and in the water, as well as flying in the air. Especially if the people who use the vehicle are not arrogant and are always careful and careful. If at any time an accident occurs, it is because the person concerned was not careful, was not careful, was negligent, or for other reasons."
		   },
		   {
			"id": 3750,
			"surah": 36,
			"ayat": 45,
			"tafsir": "Allah explains that if those who disobey were advised to guard themselves against Allah's punishment that will come in the future, they would still turn their backs, not wanting to listen to that advice. In fact, the advice was conveyed so that they get mercy from Allah. Protecting oneself from Allah's torment is by having faith in Him, namely doing what He commands, staying away from all His prohibitions, and being grateful for every gift He gives. However, the hearts of those who deny are closed to the truth. They always turn away from good advice. Therefore, it is natural for them to be overwritten by Allah's wrath and torment."
		   },
		   {
			"id": 3751,
			"surah": 36,
			"ayat": 46,
			"tafsir": "Allah confirms that those who deny it always turn away from every sign that shows His oneness and power, and acknowledge the apostleship of His messenger. Their hearts are blind, even though their eyes can clearly see all these signs."
		   },
		   {
			"id": 3752,
			"surah": 36,
			"ayat": 47,
			"tafsir": "Allah mentions the other side of their denial, namely their reluctance to donate some of the property that He has bestowed upon them. When they are advised to spend their wealth for the benefit of the poor and those who need help, they answer the believers who recommend it, \"What is the need for us to feed them, because God can feed them if God wants.\" Besides that, they say that those believers who like to donate their wealth to help the poor are misguided and stupid. How far their opinion is from the truth. Donating some property and helping others in the form of obligatory contributions, such as zakat, as well as voluntary contributions, such as alms, is a manifestation of faith and gratitude for God's blessings, and at the same time eliminates the stinginess of the human soul. Property, according to Islamic teachings has a social function, not only for self-interest. Property must be used as a tool to strengthen brotherhood, solidarity and mutual cooperation. Humans will not be able to live alone, without expecting help from others in various necessities of life, even though he is a very rich man."
		   },
		   {
			"id": 3753,
			"surah": 36,
			"ayat": 48,
			"tafsir": "The other side of the bad characteristics of the people who deny it is their disbelief about the existence of the Day of Resurrection after death. When it is said that they will be resurrected after death, to be accountable for their actions while in this world, they answer mockingly, \"When will this promise be fulfilled?\" Such is the condition of people who deny, their hearts are no longer open to accept the truth. Their regret will only arise after they face the reality of what they once denied."
		   },
		   {
			"id": 3754,
			"surah": 36,
			"ayat": 49,
			"tafsir": "God warned them that they would not wait too long for the resurrection day to come. It is enough with a signal shout, namely the sound of the first blast of the trumpet that brings about the destruction of this world. Then all humans will be resurrected and gathered before God to be reckoned for all their deeds while in the world and then they will receive a reward according to their deeds. Another verse that has the same meaning as this verse is, Allah's word: Are they just waiting for the Doomsday to come to them suddenly while they are not aware of it? (az-Zukhruf\/43: 66) Humans will not be aware of the arrival of Doomsday. They were suddenly killed in a state of dissension and disputation in world affairs. The events of Doomsday or death occur suddenly because both of them occur not as a result of a compromise between Allah and humans, but because of Allah's will and power alone. Ibn Jarir ath-Tabari narrated from Ibn 'Umar that he said, \"The trumpet will really be blown when the condition of people is in the busyness of their respective affairs in their respective streets, markets, and places, until the condition of two people who are bargaining bidding on clothes, for example, when the clothes have not reached the hands of one of them, then suddenly the trumpet is blown, until they all die. This is what is meant by the word of Allah in this verse. Narrated by al-Bukhari and Muslim from Abu Hurairah ra that the Messenger of Allah said: \"The Day of Judgment will actually occur when two people are spreading their clothes (while haggling), and both of them do not have time to trade and fold again. Doomsday will really happen when someone makes a pool and he has not had time to give a drink from the pool. The Day of Judgment will truly occur when a person squeezes his goat's milk and he has not had time to drink it, and the Day of Judgment will truly occur when a person takes the food he is about to put in his mouth and he has not had time to eat it.\" Bukhari, Muslim from Abu Hurayrah)"
		   },
		   {
			"id": 3755,
			"surah": 36,
			"ayat": 50,
			"tafsir": "It happened so quickly, and so suddenly, that they did not have the slightest opportunity to testify or leave a message to their families, nor could they be reunited with them. Each facing his own issues, awaiting the judgment of the judgment of the Just and Almighty God."
		   },
		   {
			"id": 3756,
			"surah": 36,
			"ayat": 51,
			"tafsir": "After all humans die with the first trumpet blast, then the second trumpet is blown to raise them from their graves. At that time, all mankind arose and came back to life. They woke up and rushed to Allah Almighty to receive their reckoning. Another verse related to this verse is the word of Allah: (That is) on the day when they come out of the grave quickly as if they went quickly to idols (while in the world). (al-Ma'arij\/70: 43)"
		   },
		   {
			"id": 3757,
			"surah": 36,
			"ayat": 52,
			"tafsir": "This verse describes the astonishment and shock of the disbelievers when they were resurrected from the graves. They said, \"Oh woe to us, who raised us from our bed?\" They were astonished and amazed at being raised from the grave and facing the calamities and hardships of that time. When they were astonished and amazed, those who believed said to them, \"Everything that has happened and what we have experienced is in accordance with what God promised and was conveyed by the apostles who were sent to us all when we were in the world before. have been informed of the promise, threat, and resurrection day as we are currently facing. Therefore, we should not be astonished and astonished by the situation we are currently in.\" According to one history, what is meant by the sound of the trumpet in this verse is the very loud voice of the angel Israfil who shouted, \"O the bones that have been shattered, Allah commands you all to gather again as before to receive a fair decision.\" In this verse the disbelievers ask about who raised them and brought them back to life on this resurrection day. Their questions were answered by what was conveyed to them before when they were still alive on earth. This gives the sense that it is as if God told them to remember what they had done previously to the apostles who were sent."
		   },
		   {
			"id": 3758,
			"surah": 36,
			"ayat": 53,
			"tafsir": "This verse explains how easy it is for Allah to resurrect all humans who were before the Day of Judgment. It is enough with just one shout, then all humans will revive, and gather before Allah to receive a just calculation and decision from Him. Another verse which means the same as this verse is His word: The matter of the Doomsday event, is just like the twinkling of an eye or faster (again). Verily Allah is Almighty over all things. (an-Nahl\/16: 77) And His words: Then the return is only with one blow. So instantly they came back to life on the (new) earth. (an-Nazi'at\/79: 13-14)"
		   },
		   {
			"id": 3759,
			"surah": 36,
			"ayat": 54,
			"tafsir": "Then Allah explained that on the Day of Judgment, every human being will receive a reward for all the deeds he has done while living in the world, good deeds are rewarded with multiple rewards and bad and evil deeds will be rewarded with a punishment equal to that action. As it is God's nature to make fair decisions, on that day He will make fair decisions. Therefore, a person will not receive a reward for the good done by someone else, otherwise someone will not receive punishment for the bad deeds done by someone else."
		   },
		   {
			"id": 3760,
			"surah": 36,
			"ayat": 55,
			"tafsir": "Allah explains that those who believe are rewarded by Allah with multiple rewards, in the form of a paradise full of pleasure. In it, they feel pleasure and enjoyment that they have never felt before, beauty that they have never seen, and soothing voices that they have never heard of. At that time, he did not think of the punishment that disbelievers who are immersed in hell are suffering. All he felt and remembered was joy and contentment with his friends in heaven."
		   },
		   {
			"id": 3761,
			"surah": 36,
			"ayat": 56,
			"tafsir": "In heaven the believers and their wives are in beautiful gardens with shady trees, sitting on sofas and beds, chatting while enjoying the various kinds of fortune they receive from their Lord. From the words \"hum wa azwajuhum\" (them and their spouses) it can be understood that those who believe will live happily and peacefully with their spouses in heaven and receive blessings in various forms that are incomparable. There are things that they directly enjoy, such as getting a comfortable and beautiful place, and tasting delicious food and so on. There is also the fulfillment of their desires and aspirations as members or heads of families. While living in the world they aspire to a happy family, have a beautiful and loyal wife. Their desires like that will be fulfilled by God in heaven later. In fact, in another verse it is explained that their children and grandchildren who believe are exalted by Allah in the same degree as their father and mother. They will be gathered with their parents in heaven, without discriminating between the gifts of favors to each member of the family. Allah says: And those who believe, along with their children and grandchildren who follow them in faith, We bring them together with their children and grandchildren (in heaven), and We do not reduce their reward in the least. Everyone is bound by what he does. (ath-thur\/52: 21) From this verse it is also understood that every believer always tries to make their husband, wife, children and family, good believers, so that their aspirations to be able to relate to each other Allah will grant their family in the hereafter."
		   },
		   {
			"id": 3762,
			"surah": 36,
			"ayat": 57,
			"tafsir": "Believers will eat all kinds of delicious fruits in paradise, and get all they desire. For those who like to play, various game tools are provided, for those who like sports, all sports needs are provided. The same goes for the various artistic instruments that they want God's Word: In them they can ask for all kinds of fruits safely and securely. (ad-Dukhan\/44: 55) (58) What they want is greetings from Allah conveyed to them to glorify them. This greeting was conveyed by God directly or perhaps by means of an angel, as the word of God says: ¦while the angels enter their places from all the doors; (while saying), \"Peace be upon you for your patience.\" So what a pleasure the end is. (ar-Ra'd\/13: 23-24) Salam means safe and prosperous, protected from all that is not liked, obtained everything that is desired so that the person gets physical and spiritual pleasures that are incomparable."
		   },
		   {
			"id": 3763,
			"surah": 36,
			"ayat": 58,
			"tafsir": "What they want is greetings from Allah conveyed to them to glorify them. This greeting was conveyed directly by Allah or perhaps by means of an angel, as Allah says: while the angels enter their places from all the doors; (while saying), \"Peace be upon you for your patience.\" So what a pleasure the end is. (ar-Ra'd\/13: 23-24) Salam means safe and prosperous, protected from all that is not liked, obtained everything that is desired so that the person gets physical and spiritual pleasures that are incomparable."
		   },
		   {
			"id": 3764,
			"surah": 36,
			"ayat": 59,
			"tafsir": "Allah commands the disbelievers to immediately separate from the believers and enter hell as a place that has been prepared for them. This command was conveyed by Allah, when all humans had finished being brought to account in Padang Mahsyar. Believers are ordered to enter paradise and disbelievers are ordered to enter hell. Another verse that is in line with this verse is the word of God: (Commanded to the angels), \"Gather the unjust people and their colleagues and what they used to worship, besides Allah, then show them the way to hell. (ash-shaffat) \/37:22-23)"
		   },
		   {
			"id": 3765,
			"surah": 36,
			"ayat": 60,
			"tafsir": "In this verse it is explained that the disbelievers who are brought to hell are rebuked and reminded by Allah for the sinful deeds they have done in this world. Allah said, \"Didn't I ever instruct you to never worship Satan. In addition, I have presented you with strong evidence according to reason, and I sent messengers to you with a book containing instructions to the path of worldly happiness. and the hereafter. Actually, the hidayat and the sending of the apostles are enough reasons for you not to follow Satan's temptations. But you ignore all of this, so your fate will be as it is now.\" Allah explained that His reason for forbidding people from following Satan is because Satan is a real enemy to humans. Human enmity with Satan has been going on for a long time, namely since Satan misled Adam and Eve, so that they were expelled by God from heaven. Since then Satan has always tried and made every effort to lead people astray."
		   },
		   {
			"id": 3766,
			"surah": 36,
			"ayat": 61,
			"tafsir": "Allah commands man to worship only Him, to follow all that He commands, and to give up all that He forbids. If a person has carried out everything that He has commanded and stopped all that He has forbidden, it means that he has taken the path that is pleased, and that is the straight path and that is the true religion that comes from the Lord of the worlds."
		   },
		   {
			"id": 3767,
			"surah": 36,
			"ayat": 62,
			"tafsir": "This verse explains the influence and consequences of Satan's temptations on humans, that is, they disobey and disobey Allah, and many of them even associate partners with Him. How weak are the hearts of men, so that they can be tempted by satan. Even though they have been endowed with intellect, thoughts, feelings, physical and spiritual abilities, as well as taufik and guidance in the form of religion that the apostle conveyed to them. In fact, with all the gifts given, humans can distinguish between what is right and what is wrong, which is the straight path and which is the wrong way, which are sins and which are righteous deeds. But they are negligent and always follow their passions."
		   },
		   {
			"id": 3768,
			"surah": 36,
			"ayat": 63,
			"tafsir": "God declared to the disbelievers, \"O disbelievers, this is the Hellfire that I promised you and that promise was delivered by the apostle who was sent to you while living in the world before. However, you do not believe it, you even deny it. and is disobedient to Me and worships gods besides Me.\" The Qur'an uses the word hadzihi, which is a form of isim isyarah for something close to describe that Hell is already in front of them, this is a terrible picture."
		   },
		   {
			"id": 3769,
			"surah": 36,
			"ayat": 64,
			"tafsir": "Furthermore, Allah ordered them, \"O disbelievers, enter and feel today the heat of hell fire. Stay in it as a recompense for the denial and sin that you have done before.\" From these verses it is understood as if Allah is warning the disbelievers who are being punished that they no longer need to regret, despair and grieve because of the punishment they are experiencing. The punishment given to them is God's decree that cannot be changed anymore. While living on earth, they have been given various warnings and various trials, but they still deny it. Therefore, feel and accept the punishment that is being inflicted."
		   },
		   {
			"id": 3770,
			"surah": 36,
			"ayat": 65,
			"tafsir": "When receiving the punishment in hell, there are some of the disbelievers who deny their evil deeds in this world as explained in the word of Allah: .\" (al-An'am\/6: 23) So in this verse 65, Allah shuts their mouths so that they cannot lie or argue about their actions. What's more, their hands then speak and their feet bear witness to what they are doing, so that it is no longer possible for them to avoid their actions which are against religion. On this day of the hereafter, the law applies as fairly as possible in accordance with all their actions in the world. According to the history of Anas bin Malik it is said: From Anas bin Malik, he said, \"We were on the side of the Prophet, suddenly he laughed. He said, \"Do you know why I laugh? We replied, \"Allah and His Messenger know better.\" He said, \"(I laugh) because of a conversation between a servant and his Lord.\" The servant said, \"O my Lord, haven't you saved me from tyranny? \"Yes, I have saved you\", replied his Lord. The servant said, \"Surely I will not allow myself except for a witness from me.\" His Lord replied, \" Enough, you are a witness against yourself and the angels who record deeds are also witnesses.\" The Prophet then said, \"Then the servant's mouth was closed, then the limbs were ordered to speak, \"Speak!\" The Prophet said again, \"Then the members of the body speak (according to their actions). (History of Imam Abu Ya'la al-Maushuli) There are many verses in the Al-Qur'an which explain the testimony of the members of the human they have done while living in this world, among them is the word of Allah: On the day, (when) their tongues, hands and feet bear witness against them for what they used to do.(an-Nur\/24: 24) Allah made hands and the feet speak as a witness because it is the hands that do the deed, while the feet witness what the hands do. So the actions of the hands are a pledge or acknowledgment, while the words of the feet are testimony. If all the bad deeds of a human being are exposed and disclosed while living in world and known by many people, he feels ashamed and finds it difficult to hide their faces. In fact, many people kill themselves because they don't really Gup endured the embarrassment. In the afterlife, they will experience what they were unable to experience and endure while living in this world."
		   },
		   {
			"id": 3771,
			"surah": 36,
			"ayat": 66,
			"tafsir": "This verse explains Allah's power over His servants, that is, if He wishes, he can erase the sight and hearing of disbelievers, so that they cannot see even though they have to do a lot of good deeds and do good. However, because of the nature of God's love for humans, He did not do this. Unbelievers can still see and do good in the world according to religious instructions. However, they did not do this, they even sinned a lot. Thus, besides that they do not have good deeds that need to be rewarded, their sins are also very many so that Allah's punishment in the hereafter is certainly very heavy. They cannot avoid all of this because of the testimony of their hands and feet."
		   },
		   {
			"id": 3772,
			"surah": 36,
			"ayat": 67,
			"tafsir": "This verse also explains the power of Allah, that is, if Allah wills, He can change the shape of the disbelievers where they are, so that they are no longer able to walk and return. However, this was not done because Allah is Most Gracious and Most Merciful. Even so, those who disbelieve who have the opportunity to do good deeds according to religious instructions also do not do so, they even grow in denial so that they deserve severe and humiliating punishment in the hereafter."
		   },
		   {
			"id": 3773,
			"surah": 36,
			"ayat": 68,
			"tafsir": "Furthermore, Allah confirms that whoever extends his life, will surely be returned to the beginning of what happened. That is, they come back as weak and lacking in sense as a child. I am no longer strong enough to do heavy prayers and start to forget a lot, so not many can do worship properly. At the end of this verse, Allah asks why they did not understand and seize the opportunity while they were still young and strong. The Prophet saw explained this in his hadith which reads: Take advantage of the fifth opportunity before the fifth comes: your free time before your busy time, your rich time before your poor time, your healthy time before your sickness, your youth before your old age, and your life time before your death. (History of al-hakim from Ibn 'Abbas) Do the disbelievers not use their minds that the longer and older a person's life, the weaker his body and spirit are and the more unable he is to do anything. Allah has given them enough age to be able to do a lot, do good deeds, gain sufficient knowledge, worship properly, and so on. However, they did not make the best use of that age. Allah sent the apostles to them with instructions to the straight path, but they did not follow the apostles and the instructions, they even denied and denied them."
		   },
		   {
			"id": 3774,
			"surah": 36,
			"ayat": 69,
			"tafsir": "In this verse, Allah refutes the accusations of the disbelievers who say that the Qur'an is poetry created by the Prophet Muhammad himself. Thus, according to their charge, Muhammad was a poet. This is strongly refuted in this verse, because the Qur'an is God's revelation that brings the truth. While the Prophet Muhammad was tasked with conveying to mankind all the truths received from Allah. The Prophet Muhammad was not a poet who was just delusional, but a messenger of Allah who brought the truth to correct ignorant people. Al-Qur'an is far different from poetry that developed in Arab lands at that time. This difference can be seen in: 1. Arabic poetry at that time was a series of sentences tied to certain wazan (sentence scales) or patterns, bahr-bahr (rhythm and notation in Arabic poetry), such as bahr kamil, bahr rajaz, and others. Meanwhile, the verses of the Al-Qur'an, the sentence structure is so beautiful, the choice of diction in the words is so precise, but it is not tied to the wazan and bahr of Arabic poetry. 2. Arabic poetry is also tied to qafiyah, which is a certain final letter. If this is not fulfilled, then the poem is damaged, so that there is an element of coercion or takalluf. In the verses of the Al-Qur'an there are several letters that end in the same way so they rhyme (masju'), but they become more beautiful because they are not rigid and there is no element of coercion (takalluf). 3. The contents of Arabic poetry are usually in the form of imagination of poets with high imagination so that they forget many things that are not in accordance with the existing reality. Meanwhile, the verses of the Al-Qur'an are all in accordance with reality, both the unseen world and the real world, so that they provide correct information. 4. Arabic poetry is usually in the form of exaggerated praise for kings or tribal chiefs, making kings more arrogant. Poetry can also contain reproaches or ridicule of enemies so as to increase existing hostility. Meanwhile, the Al-Qur'an always talks about the truth without making people arrogant, even the verses of the Al-Qur'an prohibit pride and hatred and enmity. 5. Arabic poetry is often composed and arranged by poets and used to get prizes as a poet's livelihood. Meanwhile, the verses of the Al-Qur'an merely provide information, guidance, and good lessons. Even the verses of the Qur'an cannot be bought and sold at low prices to obtain a certain income. From the things above it is evident that the language of the Qur'an is more beautiful than poetry and its content is better and provides greater benefits for human life as a whole. Allah confirmed that He did not teach poetry to Muhammad peace be upon him. He only revealed the Qur'an to him, to convey to mankind. The accusation by polytheists and infidels that Muhammad is a poet is an accusation that is inappropriate and cannot be accepted by common sense. Then Allah emphasized again that the Al-Qur'an which was conveyed by Muhammad SAW is a lesson and a holy book that provides information to mankind to achieve inner and outer happiness, this world and the hereafter. The polytheists say that the Qur'an is poetry, because the words and sentences contained in it are so beautiful and precise. Sometimes they even say that the Qur'an is magic, because its words and sentences really fascinate anyone who hears them. However, their accusations are completely untrue. The Qur'an is not magic or poetry, because poetry is an arrangement that is bound to certain patterns, while the Qur'an is not like that."
		   },
		   {
			"id": 3775,
			"surah": 36,
			"ayat": 70,
			"tafsir": "Furthermore, Allah explained that the function of the Qur'an, among other things, is to give a warning to mankind. In addition, he also explains the certainty of the punishment for those who disbelieve. People whose hearts, minds and spirits are still alive must take the Al-Qur'an as the main guideline, because the Al-Qur'an carries teachings that eradicate ignorance and freezing, cure mental illnesses that destroy human life, both born and born. as well as inwardly and is a mercy for those who are pious. On the other hand, people whose hearts, minds and spirits are dead and frozen, do not want to take lessons and guidance from the Qur'an because Satan's temptations have shackled them in such a way. In fact, in the hearts of these disbelievers and polytheists, they have acknowledged the truth and miracles of the Qur'an. However, they did not dare to confess this, for fear of losing influence among their people, which would lead to a decline in their authority and loss of their source of income."
		   },
		   {
			"id": 3776,
			"surah": 36,
			"ayat": 71,
			"tafsir": "Allah reminds the disbelievers about the nature and grace that He has bestowed upon those for whom they should be grateful. The grace that is bestowed is then controlled by them and benefited in such a way. However, they are never grateful, even denying this grace. Among God's grace and gifts are various animals and livestock that He has created and provided for humans. Some of these animals they make vehicles to transport them and goods from one place to another. From these animals they also obtain food, drink, clothing, and other necessities. However, they are ungrateful to God who created and provided these things for their benefit."
		   },
		   {
			"id": 3777,
			"surah": 36,
			"ayat": 72,
			"tafsir": "Allah reminds the disbelievers about the nature and grace that He has bestowed upon those for whom they should be grateful. The grace that is bestowed is then controlled by them and benefited in such a way. However, they are never grateful, even denying this grace. Among God's grace and gifts are various animals and livestock that He has created and provided for humans. Some of these animals they make vehicles to transport them and goods from one place to another. From these animals they also obtain food, drink, clothing, and other necessities. However, they are ungrateful to God who created and provided these things for their benefit."
		   },
		   {
			"id": 3778,
			"surah": 36,
			"ayat": 73,
			"tafsir": "Allah reminds the disbelievers about the nature and grace that He has bestowed upon those for whom they should be grateful. The grace that is bestowed is then controlled by them and benefited in such a way. However, they are never grateful, even denying this grace. Among God's grace and gifts are various animals and livestock that He has created and provided for humans. Some of these animals they make vehicles to transport them and goods from one place to another. From these animals they also obtain food, drink, clothing, and other necessities. However, they are ungrateful to God who created and provided these things for their benefit."
		   },
		   {
			"id": 3779,
			"surah": 36,
			"ayat": 74,
			"tafsir": "Allah explains in this verse that the disbelievers have mastered and benefited in such a way from the grace that Allah created and bestowed. Do not they thank Him, on the contrary they believe in other than Allah, because they expect to get help soon. They worship statues, idols, or other objects, but all of that can do nothing to help. Thus, they expect the impossible, which is not justified by common sense and reason."
		   },
		   {
			"id": 3780,
			"surah": 36,
			"ayat": 75,
			"tafsir": "Allah explains in this verse that the disbelievers have mastered and benefited in such a way from the grace that Allah created and bestowed. Do not they thank Him, on the contrary they believe in other than Allah, because they expect to get help soon. They worship statues, idols, or other objects, but all of that can do nothing to help. Thus, they expect the impossible, which is not justified by common sense and reason."
		   },
		   {
			"id": 3781,
			"surah": 36,
			"ayat": 76,
			"tafsir": "Finally, Allah consoled the Prophet Muhammad from the behavior and actions of the disbelievers and polytheists, that is, the Prophet did not have to feel sad listening to their utterances and accusations made against him and the Qur'an. Allah is All-Knowing of all their deeds, both those that are done openly and those that they keep secret. All of that will be held accountable to them later on the Day of Judgment and they will surely receive their reward in the form of a painful punishment."
		   },
		   {
			"id": 3782,
			"surah": 36,
			"ayat": 77,
			"tafsir": "Because there are some people who do not believe in the existence of the Day of Resurrection, in this verse Allah reminds them of His power in creating humans, as part of all His creatures. This was stated in a tone of astonishment at the attitude of some of the humans. Namely: does man not think about and pay attention that Allah has created him from a drop of semen, but then after going through a process, he is born into the world in the form of a perfect human, then he becomes a person who is hostile to Allah and His messengers. This kind of attitude is completely unacceptable to a common sense. If man realizes that Allah has the power to create him, even from a drop of semen, then makes him the best creature on this earth, he must be sure that Allah has the power to return it to its origin, and He also has the power to repeat His creation, namely bring him back to life again. Therefore, humans should not behave against God's commands."
		   },
		   {
			"id": 3783,
			"surah": 36,
			"ayat": 78,
			"tafsir": "In this verse it is explained about the doubts of the Meccan infidels against the existence of the resurrection day. They think so because they have forgotten the origin of each incident. They are reminded that Allah has created them from a drop of semen, so that they are born in the form of living and whole human beings. If they had remembered and realized this, they would surely have believed that Allah also had the power to bring them back to life after death, even though their bones had been crushed."
		   },
		   {
			"id": 3784,
			"surah": 36,
			"ayat": 79,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to answer the questions of the people mentioned above, by emphasizing that it is Allah who created them in the first time, from nothing. there is being. Allah is All-Knowing of all His creatures. For humans, repeating an action is easier than doing it the first time. However, for Allah to create something the first time, it is as easy as repeating it, because Allah is Almighty."
		   },
		   {
			"id": 3785,
			"surah": 36,
			"ayat": 80,
			"tafsir": "In this verse it is stated that Allah also ordered His Messenger to explain to these polytheists that what will revive the weathered bones is Allah who has created for them, a fire burning from wood which was originally a wet and green tree. but then the wood dried up enough to start a fire. In everyday life, the Arabs already know that there are several types of wood which when rubbed against each other will spark a fire. All of these were created by Allah for humans so that they could warm themselves, cook, use them for lighting, and various other needs. Giving this example is quite clear for those who use fire wood on a daily basis. They thought that the weathered bones had become cold and dry and could no longer accept life, because this life needed heat. Even though they see that wood that is weathered and cold can generate heat and start a fire every day. Even wood that is still wet and leaves some can start a fire. According to scientific studies, fire here can be interpreted as energy. Inside the plant there is indeed a process of utilizing solar energy to convert the material taken by the plant into chemical energy. An explanation of the occurrence of this energy change, which is referred to as the process of photosynthesis is as follows. Of the many parts of a plant, one of the most important is the presence of chloroplasts (chloroplasts) found in leaves. In this chloroplast there are thousands of chlorophyll (chlorophyll) or green leaf grains, and in the language of the Qur'an it is known as al-khadir (green material). The two verses above allude to the presence of green chlorophyll (al-An'am\/6: 99) and the role of the sun in running this \"green factory\" (at-Takwir\/81: 17-18). Plant cells, unlike human or animal cells, can use solar energy directly. Plants will convert solar energy into chemical energy, and store it in the form of nutrients in a special way. This process is called photosynthesis (Photosynthesis). These green cells can only be seen using a microscope. It is the only laboratory in the world that can store solar energy in the form of organic matter. As described above, plants are very and very important creatures for the survival of other creatures. In addition to producing food, the process of photosynthesis carried out by plants also produces oxygen. Oxygen is the material for breathing for all living things, including humans and animals. Thus, it is right for Allah to give an example, not only dry wood can start a fire, but wood that is still green and wet can also be used as fire wood. On the other hand, bones that can receive life are not only fresh bones, but even weathered bones can receive life by the power of God."
		   },
		   {
			"id": 3786,
			"surah": 36,
			"ayat": 81,
			"tafsir": "God asks questions to people who do not believe in the resurrection day that if they believe that God has the power to create the heavens and the earth, why does God not have the power to create something similar to that. The answer is that Allah must have the power to create it, because He is the Creator, and the All-Knowing."
		   },
		   {
			"id": 3787,
			"surah": 36,
			"ayat": 82,
			"tafsir": "Allah explains how easy it is for Him to create something. If He wishes to create a creature, it is sufficient for Allah to say, \"Be,\" then the creature is immediately manifested. In view of His great power, the existence of the Resurrection Day, in which He brings people back to life after the destruction on the Day of Judgment, is not an impossible thing, and should not be denied."
		   },
		   {
			"id": 3788,
			"surah": 36,
			"ayat": 83,
			"tafsir": "Believers must say that Allah is Holy. In His hands full power over everything in nature. He is the one who creates, organizes, and maintains it. To Him sell all creatures returned. This kind of acknowledgment and belief must arise if humans use common sense to pay attention to the contents of this nature, all of which are evidence for God's power."
		   }
	]
}
