{
	"tafseer": [
		{
			"id": 6158,
			"surah": 101,
			"ayat": 1,
			"tafsir": "In this verse, Allah mentions the word al-qari'ah, which is one of the names of the Day of Judgment, such as al-haqqah, as-sakhkhah, ath-thammah, and al-Gasyiyah. The Day of Judgment is also called al-qari'ah because it shakes everyone's heart due to its awesomeness. The word al-qari'ah is also used to refer to a great disaster. Allah says: And those who disbelieve are always afflicted by their own deeds. (ar-Ra'd\/13: 31) That is to say they were struck by a great calamity that knocked on their hearts and hurt their bodies, so they complained about it."
		   },
		   {
			"id": 6159,
			"surah": 101,
			"ayat": 2,
			"tafsir": "In this verse Allah repeats the word al-qari'ah in the form of a question to call for attention so that people understand because of the enormity of the events of the Day of Judgment and the riots that make the heart shrink, making it difficult to describe it accurately and it is difficult to know the truth."
		   },
		   {
			"id": 6160,
			"surah": 101,
			"ayat": 3,
			"tafsir": "Allah repeating the word al-qari'ah is to describe the awesomeness of the Day of Judgment, as if there was nothing that could be used as an example for that al-qari'ah. No matter how you imagine it, al-qari'ah is more powerful than that."
		   },
		   {
			"id": 6161,
			"surah": 101,
			"ayat": 4,
			"tafsir": "Because it is very difficult to know the essence of al-qari'ah, in this verse Allah explains the time of his coming. At that time, the human state was like moths flying around the lights at night. This likeness is to describe the human condition that is confused and uncertain of its destination. The people on that terrible day were scattered everywhere, confused, and did not know where to go, what to do, or what they were gathered there for. This condition is not unlike termites whose direction is not determined. In another verse, Allah says: It is as if they were locusts flying around. (al-Qamar\/54: 7)"
		   },
		   {
			"id": 6162,
			"surah": 101,
			"ayat": 5,
			"tafsir": "In this verse, Allah reveals that the mountains that have been destroyed are flying from their places like fluff in the wind. Then what is the condition of a human who has a weak body when experiencing that al-qari'ah. There are many verses in the Qur'an about the condition of the mountains on the Day of Judgment, among which Allah says: And you will see mountains that you think are still in place, but they walk (like) the clouds walk. (an-Naml\/27: 88) And the mountains became like heaps of sand that were poured out. (al-Muzzammil\/73: 14) And the mountains were run so that they became mirages. (an-Naba'\/78: 20) All these explanations are to explain that large and strong mountains should still not be moved, but al-Qari'ah can destroy them, let alone human beings who are weak."
		   },
		   {
			"id": 6163,
			"surah": 101,
			"ayat": 6,
			"tafsir": "In these verses, Allah explains about the rewards for those who do a lot of good deeds, namely when their deeds are weighed and the balance is heavy because they do many good deeds. The reward for these people is eternal pleasure in heaven. They live in it full of happiness, enjoyment, and satisfaction. We must believe in the existence of the mizan (balance\/scales) mentioned in this verse and in His words: And We will set the right scales on the Day of Judgment. (al-Anbiya'\/21: 47)"
		   },
		   {
			"id": 6164,
			"surah": 101,
			"ayat": 7,
			"tafsir": "In these verses, Allah explains about the rewards for those who do a lot of good deeds, namely when their deeds are weighed and the balance is heavy because they do many good deeds. The reward for these people is eternal pleasure in heaven. They live in it full of happiness, enjoyment, and satisfaction. We must believe in the existence of the mizan (balance\/scales) mentioned in this verse and in His words: And We will set the right scales on the Day of Judgment. (al-Anbiya'\/21: 47)"
		   },
		   {
			"id": 6165,
			"surah": 101,
			"ayat": 8,
			"tafsir": "Allah also explains the fate of the bad people, that is, if the deeds of the bad people are weighed and their balance is light because they have done a lot of evil and done little good in the world, then they will be placed in the Hawiyah hell, where the torture of the bad people is, a place where they live in misery; somewhere they were thrown into it."
		   },
		   {
			"id": 6166,
			"surah": 101,
			"ayat": 9,
			"tafsir": "Allah also explains the fate of the bad people, that is, if the deeds of the bad people are weighed and their balance is light because they have done a lot of evil and done little good in the world, then they will be placed in the Hawiyah hell, where the torture of the bad people is, a place where they live in misery; somewhere they were thrown into it."
		   },
		   {
			"id": 6167,
			"surah": 101,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains the meaning of the word hawiyah in the form of a question, namely: what is Hawiyah hell and from what was it made? The Hawiyah Hell is a burning fire that is very hot where sinful people are plunged into it to receive recompense for the crimes and wrongs they have committed. This verse illustrates that if all the fires throughout the world are gathered and united, they will not be able to match the heat of the Hawiyah hellfire."
		   },
		   {
			"id": 6168,
			"surah": 101,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains the meaning of the word hawiyah in the form of a question, namely: what is Hawiyah hell and from what was it made? The Hawiyah Hell is a burning fire that is very hot where sinful people are plunged into it to receive recompense for the crimes and wrongs they have committed. This verse illustrates that if all the fires throughout the world are gathered and united, they will not be able to match the heat of the Hawiyah hellfire."
		   }
	]
}
