{
	"tafseer": [
		{
			"id": 5420,
			"surah": 71,
			"ayat": 1,
			"tafsir": "This verse explains that Allah has sent Prophet Noah to his people to convey His religion, so that they will fear His terrible punishment before the time comes, and have faith and follow his teachings. Prophet Noah is the third prophet and apostle of Allah after Adam and Idris. He was sent to his people who worshiped idols. God ordered Noah to preach to his people so that they would believe in Him and stop idol worship. Allah threatened that if they did not heed the warning, they would be subject to terrible punishment as a result of their denial."
		   },
		   {
			"id": 5421,
			"surah": 71,
			"ayat": 2,
			"tafsir": "Noah immediately preached to carry out his apostolic duties. He said that he was truly Allah's messenger to invite them to believe and leave idol worship."
		   },
		   {
			"id": 5422,
			"surah": 71,
			"ayat": 3,
			"tafsir": "In this verse, the contents of Noah's call are explained, namely: 1. Let them worship Allah alone, God Almighty, there is no god but Him. In the command to worship Allah conveyed by Noah, there is a hint that they should do everything that is obligatory, and stop everything that is forbidden. From God's command to only worship Him, it can be understood that the religion adopted by Noah's people was the religion of shirk. 2. Let them fear Allah, that is, carry out everything that is ordered and stay away from everything that He has forbidden. 3. Obey everything he is ordered and forbidden, because what he orders and forbids comes from Allah. Obeying Noah meant obeying God. To be able to properly worship Allah and fear Him, Noah's people needed to follow the explanations and examples given by Prophet Noah."
		   },
		   {
			"id": 5423,
			"surah": 71,
			"ayat": 4,
			"tafsir": "In this verse, God's promise to Noah's people is explained if they obey his call, namely: 1. Allah will forgive their sins. Their sins from worshiping idols will be erased by their faith. 1. Allah will extend their life. Even though their age has been determined, but if they believe, Allah will extend their life and stop the punishment that will be meted out to them. Doing so is an easy thing for Allah, because He is Almighty and All-Determining everything He wills. In connection with the problem of delaying the arrival of death, namely extending the life mentioned in this verse, some commentators state that Allah will change the destiny that He has determined, if He so wishes. Therefore, obeying Allah, doing pious deeds, and connecting friendships can extend human life. The Prophet Muhammad said: From Anas bin Malik, the Messenger of Allah said: Whoever wants his sustenance to be expanded and his life extended, he should establish friendship. (Al-Bukhari) This point will be clearer when connected with psychology. According to psychology, there is a reciprocal relationship between a person's body and his spirit. Spiritual health has a big influence on physical health, and vice versa. Therefore, a person is said to be healthy if his body and mind are healthy. In general, people who are diligent in doing good deeds and connecting friendship are people who are spiritually healthy. In other words, piety to Allah can eliminate spiritual diseases. If the spirit is healthy, of course the body is healthy too and life will be long. At the end of this verse, Allah confirms that if He has determined the death of a person or all humans, after their endeavor, then their coming cannot be postponed nor can it be hastened for a moment."
		   },
		   {
			"id": 5424,
			"surah": 71,
			"ayat": 5,
			"tafsir": "Prophet Noah complained about the attitude of his people to Allah that even though he had called his people day and night, they still ignored him. In fact, they are increasingly called on, farther away and run away from the call."
		   },
		   {
			"id": 5425,
			"surah": 71,
			"ayat": 6,
			"tafsir": "Prophet Noah complained about the attitude of his people to Allah that even though he had called his people day and night, they still ignored him. In fact, they are increasingly called on, farther away and run away from the call."
		   },
		   {
			"id": 5426,
			"surah": 71,
			"ayat": 7,
			"tafsir": "Prophet Noah also complained that every time he called on them to have faith and no longer worship idols so that their sins would be forgiven, they plugged their fingers into their ear holes so as not to hear his call. They even covered their faces so they wouldn't see it. This was fueled by their hatred for him. More than that, they are also increasingly denial and arrogant."
		   },
		   {
			"id": 5427,
			"surah": 71,
			"ayat": 8,
			"tafsir": "Prophet Noah complained to Allah that he had made every effort to make them believe. He has addressed them openly in public, and sometimes in two ways at once, namely inviting them together in public, and approaching them one by one in private. However, they still refused and rejected the call. From this verse it can be understood that Prophet Noah had carried out his duties regardless of the dangers that could threaten his life. Noah really loved his people, and he wanted them to believe in order to avoid the punishment of Allah. And he has carried out his duties with full devotion to Allah."
		   },
		   {
			"id": 5428,
			"surah": 71,
			"ayat": 9,
			"tafsir": "Prophet Noah complained to Allah that he had made every effort to make them believe. He has addressed them openly in public, and sometimes in two ways at once, namely inviting them together in public, and approaching them one by one in private. However, they still refused and rejected the call. From this verse it can be understood that Prophet Noah had carried out his duties regardless of the dangers that could threaten his life. Noah really loved his people, and he wanted them to believe in order to avoid the punishment of Allah. And he has carried out his duties with full devotion to Allah."
		   },
		   {
			"id": 5429,
			"surah": 71,
			"ayat": 10,
			"tafsir": "Noah called on his people to ask forgiveness from Allah for their sins of worshiping idols. If they ask for forgiveness, then Allah will surely grant it, because He is Most Forgiving. Their faith will erase the sins of shirk that they have committed."
		   },
		   {
			"id": 5430,
			"surah": 71,
			"ayat": 11,
			"tafsir": "Prophet Noah conveyed to his people Allah's promises if they believe in Him, namely: 1. Allah will send down heavy rain which will fertilize their land and provide abundant results so that they will prosper. 2. Allah will grant them abundant wealth. 3. Allah will grant many children to continue their offspring, so that they do not become extinct. 4. Allah will fertilize their gardens, so that they give abundant results. 5. Allah will give them rivers and irrigation to water their gardens, so that they are lush and green. God's promise to Noah's people suited the people of that time very well. Noah's people are the ancestors of today's mankind. Their culture is still in the early stages of human culture. However, God's promise did not appeal to them in the least. This shows their extreme denial. God's promise contains a hint that He told them to use reason. They seemed to be told to think about the use of rain for them. The rain will fertilize the earth where they live, producing the plants and fruits they need. Some of the agricultural produce they can eat and some can be sold, thereby increasing their wealth. The rain will flow the water into rivers that are beneficial to them. If they are willing to use such thoughts, they will certainly come to a conclusion about who sends down the rain and fertilizes the earth so that it produces the necessities of life for them. Finally, they will certainly come to a conclusion as Noah called for them, namely to believe in God Almighty and Who created all their needs."
		   },
		   {
			"id": 5431,
			"surah": 71,
			"ayat": 12,
			"tafsir": "Prophet Noah conveyed to his people Allah's promises if they believe in Him, namely: 1. Allah will send down heavy rain which will fertilize their land and provide abundant results so that they will prosper. 2. Allah will grant them abundant wealth. 3. Allah will grant many children to continue their offspring, so that they do not become extinct. 4. Allah will fertilize their gardens, so that they give abundant results. 5. Allah will give them rivers and irrigation to water their gardens, so that they are lush and green. God's promise to Noah's people suited the people of that time very well. Noah's people are the ancestors of today's mankind. Their culture is still in the early stages of human culture. However, God's promise did not appeal to them in the least. This shows their extreme denial. God's promise contains a hint that He told them to use reason. They seemed to be told to think about the use of rain for them. The rain will fertilize the earth where they live, producing the plants and fruits they need. Some of the agricultural produce they can eat and some can be sold, thereby increasing their wealth. The rain will flow the water into rivers that are beneficial to them. If they are willing to use such thoughts, they will certainly come to a conclusion about who sends down the rain and fertilizes the earth so that it produces the necessities of life for them. Finally, they will certainly come to a conclusion as Noah called for them, namely to believe in God Almighty and Who created all their needs."
		   },
		   {
			"id": 5432,
			"surah": 71,
			"ayat": 13,
			"tafsir": "Prophet Noah advised his people that they should acknowledge the power of the Almighty God. They should also hope to be glorified by Allah by believing in Him. However, they still didn't do that."
		   },
		   {
			"id": 5433,
			"surah": 71,
			"ayat": 14,
			"tafsir": "Prophet Noah reminded again of the greatness and power of Allah contained within them, namely that He created them in stages. From a drop of semen, it becomes a zygote, blood, a plate of flesh and bone, a fetus, and then is born. From babies who don't know anything, they become adult humans, have children, and finally die. By virtue of Allah's authority, they should have faith in Him. The stages of human occurrence that show God's power are also stated in other verses: It was He who created you from dust, then from a drop of sperm, then from a clot of blood, then you were born as a child, then allowed you to grow up, then grow old . But among you there are those who were turned off before that. (We do this) so that you arrive at the specified time, so that you understand. (al-Mu'min\/40: 67) In another verse, Allah says: And indeed, We have created man from essence (derived) from the ground. Then We made it semen (stored) in a firm place (womb). Then We made the semen something to stick to, then We made the sticky lump of flesh, and We made the lump of flesh bones, then We covered the bones with meat. Then, We made him a different (form) creature. Glory be to Allah, the best Creator. (al-Mu'minun\/23: 12-14) Scientifically, the stages of human creation can be explained as follows: 1. The level of the essence of the soil, when humans cannot be called anything. Please look again at the explanation of \"soil essence\" in the scientific study of surahh al-Hijr\/15 verses 26, 28 and 33. 2. The nutfah level. When all the ground essence enters our body, it is then used by the body as a 'starter'. materials in the metabolic process of forming germ in reproductive cells. Nuthfah is translated as semen or drop of semen. The literal meaning is a drop or small part of fluid (thick liquid, concentrate). In the world of science, it is the concentration of fluid containing sperm. Called also as nuthfatun amsyaj or a drop of mixed sperm. This implies the mixing of two nuthfah or seeds, namely from the male side (sperm) and from the female side (eggs, ovaries). In surahh al-Insan\/76:2, it appears once that only one drop of sperm (one sperm) mixed with (fertilized) the ovary. This is very consistent with the science of embryology. Nuthfah is also called water which is despised (ma'in mahin, al-Mursalat\/77: 20) or u water that radiates (ma'in dafiq, ath-thariq\/86: 6). The first, implies the nature of the discharge of semen through the genital organs, which are used daily to dispose of feces (urine). The latter shows the process of entry of nutfah (sperm) into the uterus. 3. Level of 'alaqah. 'Alaqah is a form of pre-embryonic development, which occurs after the fusion of the sperm (sperm) and egg. Moore and Azzindani (1982) explain that 'alaqah in Arabic means a leech or a suspended thing or a clot of blood. Leeches are low-level animals, shaped like pears, and live by sucking blood. So 'alaqah is an embryonic stage (stage), which is shaped like a pear, where the cardiovascular system (cardiac vessel system) has begun to appear, and its life depends on its mother's blood, similar to a leech. 'Alaqah is formed around 24-25 days after fertilization. If the pre-embryonic 'alaqah tissue is removed (aborted), it does look like a blood clot (a blood clot like). 4. Mudhgah level. 'Alaqah which is formed around 24-25 days after fertilization, then develops into mudhgah on the 26-27th day, and ends before the 42nd day. The rapid change from 'alaqah to mudhgah is seen in the use of the word fa in surah 23:14. In Arabic the word fa denotes a series of rapid changes. In general, mudhgah is translated as 'a lump of flesh. Mudhgah is an embryonic stage that is shaped like a 'chewing gum', which shows an irregular surface. Mudhgah or 'a lump of flesh' consists of cells or tissues that have undergone differentiation or have not undergone differentiation. as can be seen in the explanation in surahh al-hajj\/22: 5 above by Moore and Azzadani. In verse 5, surahh al-hajj\/22, it is explained: \"...., then from a lump of flesh (mudhgah) that is perfect and imperfect, so that We explain to you and We set it in the womb,...\" Moore and Azzindani (1982), translating with the sentence \"...., then from a lump of flesh (mudhgah) that has been differentiated and which has not been differentiated, so that We explain to you and We set it in the womb,...\" . Indeed, the essence of mudhgah consists of cells or tissues\/organs that have undergone differentiation or not. 5.The rate of bone formation. After this mudhgah level, bones begin to form. This is very much in line with today's modern embryology. 6. The level of wrapping the bones by the flesh, the fetus begins to form. 7. The level of the baby in the womb is a continuation of the 6th level above. Then proceed with the perfection of human formation. Wallahu a'lam bi as-sawab Such is the journey of human life which shows that human events go through a complex and vulnerable process. Therefore, their realization in this world should be grateful for by having faith in Allah."
		   },
		   {
			"id": 5434,
			"surah": 71,
			"ayat": 15,
			"tafsir": "In this verse, Noah asked his people to pay attention to the sky which consists of seven levels. This verse can have a special meaning for Noah's people and can also have a general meaning (for all humans) because this verse uses the natural words tarau (did you not notice). To pay attention here means to use the mind. Therefore, the way to pay attention to what is ordered is the way that is commonly used by the world of science. This verse has special meaning for Noah's people, meaning that they should use their five senses and reason in observing this nature. With such observations, they can also know how big and great nature is. That the heavens are so vast and multilevel is also understandable to them according to their simple understanding. They should acknowledge the greatness of Allah by believing in Him. This verse also applies in general, namely addressed to the people of the Prophet Muhammad until now and in the future. Even now, commentators have not been able to confirm the \"sky\" which consists of seven levels. But regarding the \"sky\" it is not impossible to be discovered by future generations. Regarding the sky, another verse informs: And did the disbelievers not know that the heavens and the earth were both together, then We separated them; and We made every living thing out of water; then why do they not believe? (al-Anbiya'\/21: 30) What scientists can only understand now is that the universe was formed from a very dense mass, then exploded, and gave rise to galaxies, solar systems, planets, and so on . However, even that is still a theory called the big bang theory. From this verse it can be understood that the order to think and meditate on the power and greatness of Allah is directed to all human beings, both those who have a high level of knowledge and those who are still low. All human beings are able and able to do it, thereby strengthening their faith in Allah, God Almighty. This verse also teaches humans about how to know and seek His religion, namely by contemplating this natural occurrence. With that contemplation, man will come to his Creator. The Creator of this world is certainly the Omniscient and Omnipotent, not something that knows nothing and is utterly powerless. He is the one who determines everything, the Almighty, not associated with anything. Therefore, true religion is a religion that recognizes the oneness of God and true worship is worship that is directly addressed to Him, not using intermediaries and so on."
		   },
		   {
			"id": 5435,
			"surah": 71,
			"ayat": 16,
			"tafsir": "Prophet Noah explained to his people that the God who is worshiped created a shining moon and a shining sun. From this verse it can be understood that: 1. The sun emits its own light, while the moon gets light from the sun. The light emitted by the moon comes from sunlight which it reflects to the earth. Therefore, sunlight is harsher and brighter than moonlight. 2. Rays and light are useful for humans, but the forms of use are different. Verses that distinguish light and light from the two celestial bodies, the sun and the moon, have been put forward many times. Stars have light sources, while planets do not. An explanation of this can be seen in surahh Yunus\/10: 5. A scientific explanation of this is as follows: In discussing celestial bodies, the Qur'an has also distinguished stars and planets. Stars are celestial bodies that emit light, while planets only reflect the light received from stars. It is He who makes the sun shine and the moon shine, and it is He who determines the places of their orbits, so that you may know the number of years and the reckoning of time. Allah did not create that way but correctly. He explains the signs (His greatness) to those who know. (Yunus\/10: 5) The sun is the largest celestial body in our solar system. It is a glowing gas column, with a diameter of about 1.4 million km. The average distance between the center of the earth and the sun is about 150 million km. At the center of the sun, the temperature reaches around 20.0000C. In astronomy, the sun is a celestial body that is classified into types of stars. In this universe there are billions, even trillions of stars. The sun is one of them. Stars are celestial bodies that emit light because on the surface and inside of stars are still going on powerful hydrogen nuclear reactions. The result of this reaction is what causes the emission of light. Meanwhile, the 10 celestial bodies orbiting the sun, including the earth (and the moon orbiting the earth), are classified into planet types. The number of stars is estimated at more than 6 billion, perhaps even up to 100 billion. However, only about 6,000 stars are visible to the naked eye. The temperature, color, size and density of stars vary. The hottest stars are generally bluish-white. The surface temperature can reach 20.0000C. While those that are less hot are yellow, like the sun. There are sizes that exceed thousands or millions of times the size of the sun. The distance of the nearest star from the solar system is 4,000 light years. If the speed of light is 186,000 miles per second, then the distance to the nearest star is 104 x 109 miles. Light from the closest star to the solar system, Alpha Centauri, takes 4 years to reach Earth. As for the \"farthest\" star, Riga, its light has only reached Earth more than 1,000 years later. Compare that to sunlight reaching the earth in just 4 minutes. Planets can be categorized as dead stars. The surface has cooled, and turned into a solid. Planets do not emit light. However, if it is illuminated by a light source (eg the sun), then it will reflect it, so it looks like it is glowing. Thus, the word 'luminous' can be interpreted as visible to the eye because it reflects the light received from the light source. The moon is bright because it reflects the light it receives from the sun."
		   },
		   {
			"id": 5436,
			"surah": 71,
			"ayat": 17,
			"tafsir": "Prophet Noah then explained to his people that God Almighty and must be worshiped is God who makes humans grow with nutrients that come from the soil. Besides that, humans were also created from the ground, namely from semen and ovum which were formed from food that came from the soil. From the sperm and ovum which are formed from the nutrients that come from the soil, fertilization occurs, then they grow into humans like plants grow. Plants in their life journey experience various processes, humans too. Noah's people did not learn from the process of human creation. They still deny God and do not believe in His greatness. This is what Prophet Noah reminded them of in this verse."
		   },
		   {
			"id": 5437,
			"surah": 71,
			"ayat": 18,
			"tafsir": "Prophet Noah also explained to his people that they would die and would be returned to the ground or buried. Then they will be removed from the land on the Day of Resurrection to be held accountable. Because of that accountability, they should have faith and do good in life in this world."
		   },
		   {
			"id": 5438,
			"surah": 71,
			"ayat": 19,
			"tafsir": "Allah reaffirms the blessings He has bestowed on humans, namely He has created the earth wide and flat so that they can live their lives easily. With the flat surface of the earth, humans can make roads so they can explore the earth to places far away. These verses describe that God made the earth relatively flat (plane), despite the fact that there are many mountains on the earth that serve as pillars for the earth's surface, and the fact that 70% of the earth's surface is sea level. However, the profile of the earth's surface is relatively flat and smooth compared to planets or other celestial bodies in the universe. According to experts, the condition of the earth, including its surface, is in accordance with the living conditions and comforts of the humans who inhabit it. God with His mercy has conditioned the surface of the earth so that humans enjoy the comforts of life in the world. Why did Allah make the surface of the earth flat (as a stretch)? The reason is so that man can explore his paths. This means that God expects humans to study and explore the entire surface and the bowels of the earth. What is meant by \"walking the streets\" is not only physically exploring the earth's surface, but also scientifically. To achieve or produce knowledge, humans need to wander, explore while observing all the ins and outs and all corners of the earth, so that they can carry out their functions as Allah's caliphs on the surface of the earth. The accumulation of human knowledge about the earth is called earth science, and in further development humans need to learn earth science and also earth sciences as well as relevant science and technology in order to be able to manage this earth."
		   },
		   {
			"id": 5439,
			"surah": 71,
			"ayat": 20,
			"tafsir": "Allah reaffirms the blessings He has bestowed on humans, namely He has created the earth wide and flat so that they can live their lives easily. With the flat surface of the earth, humans can make roads so they can explore the earth to places far away. These verses describe that God made the earth relatively flat (plane), despite the fact that there are many mountains on the earth that serve as pillars for the earth's surface, and the fact that 70% of the earth's surface is sea level. However, the profile of the earth's surface is relatively flat and smooth compared to planets or other celestial bodies in the universe. According to experts, the condition of the earth, including its surface, is in accordance with the living conditions and comforts of the humans who inhabit it. God with His mercy has conditioned the surface of the earth so that humans enjoy the comforts of life in the world. Why did Allah make the surface of the earth flat (as a stretch)? The reason is so that man can explore his paths. This means that God expects humans to study and explore the entire surface and the bowels of the earth. What is meant by \"walking the streets\" is not only physically exploring the earth's surface, but also scientifically. To achieve or produce knowledge, humans need to wander, explore while observing all the ins and outs and all corners of the earth, so that they can carry out their functions as Allah's caliphs on the surface of the earth. The accumulation of human knowledge about the earth is called earth science, and in further development humans need to learn earth science and also earth sciences as well as relevant science and technology in order to be able to manage this earth."
		   },
		   {
			"id": 5440,
			"surah": 71,
			"ayat": 21,
			"tafsir": "Noah complained to God that his people were still disobedient to him. They didn't want to follow his call, and still followed their leaders who consisted of rich people, who had lots of wealth and children. However, the treasure was only used for extravagance. Their children are also not well-educated, so that when they grow up, they become misguided and evil"
		   },
		   {
			"id": 5441,
			"surah": 71,
			"ayat": 22,
			"tafsir": "This verse explains that the dignitaries and leaders of Noah's people did all kinds of tricks to hinder and destroy the religion that Noah brought. Among them is by blocking and threatening people who want to follow Noah's call, strengthening the position of idols, and even inciting people to persecute Noah."
		   },
		   {
			"id": 5442,
			"surah": 71,
			"ayat": 23,
			"tafsir": "The dignitaries of Noah's people asked his people not to leave the gods that had been worshiped by their ancestors first. They were told to keep on worshiping their idols namely, wadd, suwa', yuguts, ya'uq and nasr. The five idols are the most respected idols among the many idols of Noah's tribes. Each tribe also has its own idols that are different from one another. This is where the scholars argue that the religion of shirk began to develop at the time of Prophet Noah. Previously, during the time of Prophet Adam and Idris, there was no belief in shirk or idol worship. The worship of many idols then came down to the Arabs. Therefore, the Arabs also had idols named after the names that were used by Noah's people. According to the history of al-Bukhari, Ibn al-Mundhir, and Ibn Mardawaih from Ibn 'Abbas that he said, \"Then the idols moved to the Arabs, then Wadd became the idol of the Kalb tribe, Suwa' became the idol of the Hudhail tribe, the Yaguts became the idol of the tribe of Kalb. the Murad tribe which later moved to the Guthaif tribe; Ya'uq became the idol of the Hamdan tribe, and Nasr became the name of the idol of the Himyar tribe.\" In addition, there are also idols other than those mentioned in the verse above which were worshiped by Noah's people, which later also moved to the Arabs, such as al-Lat, the idol of the Thaqif people in Ta'if; al-'Uzza, idols of the tribes of Sulaim, Gathfan, and Jusyam; Manah, idol of the Khuza'ah tribe in Qudaid; Asaph, Na'ilah, and Hubal, idols worshiped by the Meccans. Hubal is the biggest and most majestic idol, according to them, which is placed on top of the Kaaba. They made the idols themselves to worship. The transfer of these idols from other nations to the Arabs as hinted by the history above shows that the teachings of monotheism brought by the Prophet Muhammad apply or are universal. This teaching is not only for the Arab nation, but also for other nations."
		   },
		   {
			"id": 5443,
			"surah": 71,
			"ayat": 24,
			"tafsir": "The dignitaries and leaders of Noah's people misled their people from the way of Allah and influenced them with various kinds of tricks, so they followed him. Thus, those who came after them followed in their footsteps, all the way to the Ignorant Arabs. The following prayer of the Prophet Abraham indicates that the worship of idols continued until his time. Because of that, he prayed to Allah so that his children and grandchildren would be spared from worshiping these idols. God's Word: And (remember), when Abraham prayed, \"O God, make this land (Mecca), a safe land, and keep me and my children and grandchildren away from worshiping idols. O God, these idols have misled many of the people . Whoever follows me, then that person belongs to my group, and whoever disobeys me, then You are Most Forgiving, Most Merciful.\" (Ibrahim\/14: 35-36) At the end of this verse, Noah prayed that Allah would add to the error of his people. He did this because they were unjust, that is, they denied and even more denied it when they were advised. The prayer was asked by Prophet Noah after seeing that his people could no longer be advised in any way."
		   },
		   {
			"id": 5444,
			"surah": 71,
			"ayat": 25,
			"tafsir": "This verse explains that Allah drowned the tyrannical people of Prophet Noah with an enormous flood. All of this is due to their denial and sin against Allah. In such circumstances, no one can prevent them from the punishment of Allah. Even the idols they worship cannot save themselves from being destroyed, let alone help others. In the afterlife, they will be thrown into hell. In the previous verses, such as in surahh Hud, it has been explained that after Prophet Noah thought that it was impossible for his people to accept his call, then upon Allah's revelation, he began to build ships. After the ship was finished, the flood came, so that Noah and his family and those who believed in him could be saved by the ship"
		   },
		   {
			"id": 5445,
			"surah": 71,
			"ayat": 26,
			"tafsir": "At the time of the flood, Prophet Noah prayed to Allah that He would destroy all the disbelievers by drowning them. Noah's request was granted by God. The reason Prophet Noah prayed to Allah to destroy all the disbelievers were: 1. If any of them were allowed to live, they would still try to lead people astray. 2. If any of them are allowed to live, they will also produce children who are disbelievers and will try to make other people become disbelievers. Prophet Noah concluded that it was no longer possible for the disbelievers who were in his day to have faith. His conclusion is based on his experience calling them for 950 years. Because of that, he prayed to God that all the disbelievers would be drowned without leaving a single one of them. In another verse, Allah says: And We help him from those who have denied Our signs. Verily they were evil people, so We drowned them all. (al-Anbiya'\/21: 77)"
		   },
		   {
			"id": 5446,
			"surah": 71,
			"ayat": 27,
			"tafsir": "At the time of the flood, Prophet Noah prayed to Allah that He would destroy all the disbelievers by drowning them. Noah's request was granted by God. The reason Prophet Noah prayed to Allah to destroy all the disbelievers were: 1. If any of them were allowed to live, they would still try to lead people astray. 2. If any of them are allowed to live, they will also produce children who are disbelievers and will try to make other people become disbelievers. Prophet Noah concluded that it was no longer possible for the disbelievers who were in his day to have faith. His conclusion is based on his experience calling them for 950 years. Because of that, he prayed to God that all the disbelievers would be drowned without leaving a single one of them. In another verse, Allah says: And We help him from those who have denied Our signs. Verily they were evil people, so We drowned them all. (al-Anbiya'\/21: 77)"
		   },
		   {
			"id": 5447,
			"surah": 71,
			"ayat": 28,
			"tafsir": "After Noah prayed to Allah to destroy the disbelievers, he prayed for the safety of himself and his parents and all those who believe. At the end of the verse, Noah asks Allah again to increase the error of the disbelievers, so that they will finally feel the unimaginable punishment on the Day of Judgment."
		   }
	]
}
