{
	"tafseer": [
		{
			"id": 2251,
			"surah": 19,
			"ayat": 1,
			"tafsir": "It has been explained in the initial interpretation of surahh al-Baqarah that the beginning of suras that begin with hijaiyah letters such as Alif Lam Mim, Kaf Ha Ya 'Ain shad and so on are included in the verse \"Mutasyabihat\" whose real meaning is only known by Allah the purpose is to be a warning and add attention to the Al-Qur'an which contains a lot of wisdom and deep secrets."
		   },
		   {
			"id": 2252,
			"surah": 19,
			"ayat": 2,
			"tafsir": "What is being read is an explanation of the mercy of your Lord bestowed on an old servant of His, namely the Prophet Zakaria as when he prayed to be given a pious child. Prophet Zakaria came from the descendants of the Children of Israel who became a prophet after Prophet Jonah to lead his people."
		   },
		   {
			"id": 2253,
			"surah": 19,
			"ayat": 3,
			"tafsir": "Namely when he prayed in a soft voice while alone in his mihrab, so that he would be given offspring who would continue his apostolic duties. His prayer was deliberately said in a soft voice and in a quiet state, so that it felt more sincere and fulfilled. Then the Qur'an mentions how the sound of his prayer. Praying is indeed commanded by God to all of us with humility, that is humility and in a soft voice, not screaming, as mentioned in God's word: Pray to your God with humility and a soft voice. Truly, He does not like those who transgress. (al-A'raf\/7: 55)"
		   },
		   {
			"id": 2254,
			"surah": 19,
			"ayat": 4,
			"tafsir": "The Prophet Zakaria, among other things, said in his prayer, \"O my Lord, I actually ask for my prayer to be answered, for several reasons that I believe will open Your grace. First, I have reached a very old age, which is almost ninety years, where I already feel that my bones are weak, and the weakness of the frame causes general weakness in my whole body, and an old man like me deserves to be loved and pitied. Second, my head is full of gray hair, so whoever looking at me must have pity and be moved to fulfill my request. Thirdly, I have never been disappointed in praying to You, O Lord, since I was young, especially now where my weakness has appeared in its entirety.\" Prophet Zakaria himself knew that if his prayer was granted, it would bring many improvements in the field of religion and society. Therefore he continued his prayer as mentioned in the following verse."
		   },
		   {
			"id": 2255,
			"surah": 19,
			"ayat": 5,
			"tafsir": "And actually I am worried about the people who will control and lead my people, because there is no one who can be trusted among them, therefore I ask to be blessed with a child. Even though my wife is barren and I myself am very old, this does not cause me to despair, because I believe in the wisdom and power of the Most High God. Giving up is indeed forbidden by Allah, as in some of His words, namely: \"…and do not despair of Allah's mercy. Indeed, those who despair of Allah's mercy are only those who disbelieve.\" (Yusuf\/12: 87) And the word of Allah: \"He (Ibrahim) said, \"No one despairs of the mercy of his Lord, except those who go astray.\" (al-hijr\/15: 56)"
		   },
		   {
			"id": 2256,
			"surah": 19,
			"ayat": 6,
			"tafsir": "This verse mentions the contents of Prophet Zakariya's prayer, O Lord, give me a descendant who will inherit me and inherit part of Jacob's family and make him someone who deserves to be obedient and approved by You, because he has noble and noble character and mind, can be made a queen role model by all his followers. Prayer for pious offspring and later to become leaders for pious people is indeed commanded by Allah, as in His word: And those who say, \"O our Lord, grant us our spouses and our offspring as gladdened (our) hearts,\" and make us leaders for the pious.\" (al-Furqan\/25:74)"
		   },
		   {
			"id": 2257,
			"surah": 19,
			"ayat": 7,
			"tafsir": "In this verse Allah informs about the granting of Zakaria's prayer and the naming of his son directly from Allah himself. God said to Zakaria, that God had given him good news, that his request to be blessed with a son would be granted, and that preparations had been made so that when his son was born he would be named Yahya and that name had never been given to anyone before him."
		   },
		   {
			"id": 2258,
			"surah": 19,
			"ayat": 8,
			"tafsir": "Prophet Zakaria as after being told that he would have a son asked Allah. The question arose not because of doubts about Allah's power, but to get an explanation of how, because he felt that he was no longer able to have sons, and his wife was barren. Will he be made like a young man again with sufficient physical strength, or will his wife be returned to being a young woman who can give birth to a child, or will he have to remarry with another woman who is not barren? Since Zakaria was overjoyed at the news of having a child, and he was full of wonder about the manner in which it was carried out, he could not help but ask his Lord about it. Then answered with the word of God in the following verse:"
		   },
		   {
			"id": 2259,
			"surah": 19,
			"ayat": 9,
			"tafsir": "The verse explains that Zakariya will be blessed with a son, even though he is very old and his wife is barren. It is easy for God. If God was able to create Adam from nothing and then become something, then creating a child from what was, namely Zakaria and his wife, would be easier for God. Some of God's words below show that there is not the slightest difficulty for God to create everything He wills, namely: Don't you know that God knows what is in the heavens and on earth? Indeed, this is already contained in a Book (Lauh Mahfudz). Verily, that is very easy for Allah. (al-hajj\/22: 70) And the word of Allah: And do they not see how Allah began the creation (creation), then He repeated it (again). Truly, that is easy for Allah. (al-'Ankabut\/29: 19)"
		   },
		   {
			"id": 2260,
			"surah": 19,
			"ayat": 10,
			"tafsir": "Then the Prophet Zakaria asked Allah again to give signs that his child would soon be born, so that his heart would be more peaceful and his gratitude would deepen. He said, \"O my Lord, give me a sign that can add peace to my heart about the fulfillment of your promise.\" Something like this never happened to the Prophet Abraham when he was asked, \"Don't you believe that Allah has the power to revive the dead?\" He replied, \"Indeed I believe, but I ask so that my heart will be more reassured.\" As mentioned in the word of Allah: And (remember) when Abraham said, \"O my Lord, show me how You raise the dead.\" God said, \"Don't you believe yet?\" He (Ibrahim) replied, \"I believe, but so that my heart is calm (steady).\" He (Allah) said, \"Then take four birds, then chop them up and place them on each hill one part, then call them, they will come to you quickly.\" Know that Allah is Mighty, Most Wise. (al-Baqarah\/2: 260)"
		   },
		   {
			"id": 2261,
			"surah": 19,
			"ayat": 11,
			"tafsir": "Prophet Zakaria a.s. came out of the mihrab to his people, who had been waiting for a long time because it was their custom to join in the congregational prayers together at his place of worship in the morning and evening. They asked, \"What happened that caused him to be late in opening his mihrab door?\" Then he gave a sign to them, to glorify Allah from polytheism and from accusations of having children and from any character that is not worthy of Allah. They were ordered to glorify much in the morning and in the evening."
		   },
		   {
			"id": 2262,
			"surah": 19,
			"ayat": 12,
			"tafsir": "God ordered Yahya to take the book of the Torah, which is the greatest gift from God to the Children of Israel, with full attention and earnestness, and to practice its contents sincerely. Then Allah revealed the highly commendable qualities of the Prophet Yahya which should be emulated by all his followers. Among other things, Allah has given him wisdom and a very deep understanding of religion and enthusiasm to practice all good deeds even though at that time Yahya was still very young. It was narrated that he was once surrounded by children of his age and invited to play together, then he replied, \"We are not created by God to play games. Come join me in praying.\""
		   },
		   {
			"id": 2263,
			"surah": 19,
			"ayat": 13,
			"tafsir": "Allah made the Prophet Yahya a person who has compassion for fellow human beings, especially the poor as Allah made the Prophet Muhammad saw to have the same feelings, as stated in the word of Allah: So thanks to Allah's mercy you (Muhammad) treat them gently. (Ali 'Imran \/ 3: 159) And the word of Allah: Indeed, there has come to you an apostle from your own people, he feels the weight of the suffering you experience, (he) really wants (faith and safety) for you, forbearing and merciful to those who believer. (at-Taubah\/9: 128) Prophet Yahya's nature was also clean from shirk and always kept away from every act that caused God's wrath. He was always devoted to carrying out Allah's commands and staying away from his prohibitions."
		   },
		   {
			"id": 2264,
			"surah": 19,
			"ayat": 14,
			"tafsir": "This verse describes the character of the Prophet Yahya who was always devoted to his parents, because serving them was made a good deed after worshiping Allah, in accordance with His words: And your Lord has commanded you not to worship other than Him and to do good to your parents. .(al-Isra\/17: 23) Among the other characteristics of the Prophet Yahya is that he is not arrogant towards other human beings, always humble, as the trait commanded by the Prophet Muhammad in the word of Allah: And humble yourselves towards those who believe follow you. (asy-Syu'ara\/26: 215) And the word of Allah: If you had been tough and rough-hearted, they would have distanced themselves from around you. (Ali 'Imran\/3: 159) Because of this very bad arrogant nature, it caused the Devil to be cursed because he acted arrogantly, did not want to bow down to respect the Prophet Adam as, at the command of Allah. The last characteristic among the commendable characteristics of the Prophet Yahya is that he never disobeyed God's commands."
		   },
		   {
			"id": 2265,
			"surah": 19,
			"ayat": 15,
			"tafsir": "Allah explained the merits of the Prophet Yahya because of his obedience and piety, safety, welfare for him on the day he was born into the world, and on the day he died leaving this mortal world and on the day he was raised alive again on the Day of Judgment. He mentioned these three events, because every human being in those three periods really needed God's grace and grace."
		   },
		   {
			"id": 2266,
			"surah": 19,
			"ayat": 16,
			"tafsir": "Allah ordered the Prophet Muhammad to tell the story of Maryam which is described in the Qur'an when Maryam, the mother of the Prophet Isa, distanced herself from her family to a place east of Baitul Makdis to find peace in worshiping Allah. Maryam wanted to break away from the routine activities of daily life. In connection with this verse, Ibn Abbas said, \"Among all people I know the most about why the Christians made their Qibla towards the East; that is according to Allah's word that Maryam calmed down and distanced herself from her family to a place to the East, then they made the birthplace of Prophet Isa as a Qibla.\""
		   },
		   {
			"id": 2267,
			"surah": 19,
			"ayat": 17,
			"tafsir": "So Maryam made a veil (wall) to protect her from the sight of her family and other humans. Then Allah sent the angel Gabriel to her in the form of a handsome and handsome man to inform Maryam that she would give birth to a son without a father. As for the wisdom of Jibril's coming in human form so as not to cause fear in Maryam."
		   },
		   {
			"id": 2268,
			"surah": 19,
			"ayat": 18,
			"tafsir": "When Maryam saw that there was a man in her isolated place, she took refuge in Allah Ta'ala from evil that might arise, saying, \"Indeed, I take refuge from you in God the Most Gracious; don't ever bother me if you are pious to Him, because everyone who is pious always keeps away from immoral acts.\""
		   },
		   {
			"id": 2269,
			"surah": 19,
			"ayat": 19,
			"tafsir": "To reassure Maryam and dispel her suspicions, Archangel Jibril said, \"Indeed, I am only a messenger from your Lord to convey the news to you that a pure boy will be born from all kinds of stains.\" The angel Gabriel mentioned that he himself would deliver the news about the boy, because he was ordered by Allah Ta'ala to blow the spirit into Maryam's body."
		   },
		   {
			"id": 2270,
			"surah": 19,
			"ayat": 20,
			"tafsir": "Maryam was very surprised to hear the news and with an astonished tone she said, \"How will I get a son when no man has ever touched me; and I am not an adulterer either.\""
		   },
		   {
			"id": 2271,
			"surah": 19,
			"ayat": 21,
			"tafsir": "Jibril answered Maryam's question by saying that Maryam would have a son even though she was not married or had relations with men; for such is the will of Almighty Allah and such is easy for Him. Allah made a son from Maryam to be a proof for humans of His power. The gift of a son to Maryam is a mercy from Allah because one day the boy will become a prophet who calls to the path of happiness in the world and the hereafter. And that is God's irreversible decision.\""
		   },
		   {
			"id": 2272,
			"surah": 19,
			"ayat": 22,
			"tafsir": "After Jibril explained the purpose of his arrival, Maryam replied, \"I surrender to Allah's decree.\" Then Jibril blew the spirit of Prophet Isa into Maryam so that Maryam became pregnant; then he exiled himself with his womb to a place far from the crowd to avoid accusations and ridicule from the Children of Israel."
		   },
		   {
			"id": 2273,
			"surah": 19,
			"ayat": 23,
			"tafsir": "When Maryam felt sick because she was about to give birth to her child, she had to lean on the base of a date palm to make the birth easier; full of sorrow he said, \"Oh, it would be better if I just died before this, and I become something that is not meaningful anymore forgotten.\" She hoped that she would die before giving birth because she felt the severity of the suffering caused by giving birth to a child without a father which resulted in accusations and ridicule from her people who did not know what really happened; or he wished to become something insignificant in the eyes of men, to be forgotten instead of suffering from intense feelings of depression and shame."
		   },
		   {
			"id": 2274,
			"surah": 19,
			"ayat": 24,
			"tafsir": "So Jibril came and called out from a lowly place, \"Do not grieve, for verily your Lord has made a creek flow under you.\" This was a blessing for Maryam because at first the place was dry and there was no running water, but then there was clean running water."
		   },
		   {
			"id": 2275,
			"surah": 19,
			"ayat": 25,
			"tafsir": "Jibril then told Maryam to shake the date palm tree and later the tree would drop ripe dates on her. And this is another blessing for Maryam because at first the date palms were dry, by Allah's will they would become green and fertile again and bear fruit as sustenance for Maryam."
		   },
		   {
			"id": 2276,
			"surah": 19,
			"ayat": 26,
			"tafsir": "So Jibril told Maryam to eat, drink and be happy because she got the sustenance and relieve her heart's sadness because Allah has the power to cleanse her from all inappropriate accusations, so that Maryam is still considered a pure woman who has never been tarnished. If you see a human being who asks about his problems and the problems of his child, then hint to him, \"Indeed I have vowed for myself to fast solely for God the Most Gracious, and I will not speak directly to anyone today, because my words may be rejected and not believed."
		   },
		   {
			"id": 2277,
			"surah": 19,
			"ayat": 27,
			"tafsir": "After Maryam was ordered to fast on the day she gave birth to her son and not speak to anyone and after receiving assurahnces from Allah that her honor would be preserved; So Maryam surrendered her entire destiny to the decree of Allah, Maryam carried her child and brought it to her people, this caused her people to reproach her actions and say, \"O Maryam, you have actually done something that is very wrong.\""
		   },
		   {
			"id": 2278,
			"surah": 19,
			"ayat": 28,
			"tafsir": "Then they added insults and ridicule and accusations to Maryam, saying, \"O sister of Aaron, your father was never a bad person and your mother was never a prostitute. How did you get this child.\" Maryam was called \"Aaron's sister\", because it was the custom of the Children of Israel to mention the names of the previous prophets and pious people. It was narrated by al-Mugirah bin Syu'bah who was sent by the Messenger of Allah, to Najran in Yemen where there were Christians and they asked him, \"Why do you read in the Qur'an,\" O sister of Harun, \"Even though Aaron and Musa lived a long time before the birth of Jesus son of Maryam?\" al-Mugirah did not have time to give an answer and when he returned to Medina and met the Prophet he put forward the question. The Messenger of Allah replied: \"Why don't you tell them that their habit (the Children of Israel) likes to mention the names of the prophets and pious people before them.\" (Ahmad's history)"
		   },
		   {
			"id": 2279,
			"surah": 19,
			"ayat": 29,
			"tafsir": "Maryam pointed to her son to speak and explained his situation, because Maryam had vowed not to talk to anyone and was sure that her child had understood the hint. The Jews asked in astonishment, \"How are we going to talk to a baby who is still in her arms?\" They suspected that Maryam was making fun of them."
		   },
		   {
			"id": 2280,
			"surah": 19,
			"ayat": 30,
			"tafsir": "Isa as who was still in his mother's arms then said, \"Indeed I am a servant of Allah, He will give me the holy book of the Bible and He will make me a Prophet.\" This speech contains an explanation that his mother was a holy woman because a prophet must be from the lineage of pious and holy people."
		   },
		   {
			"id": 2281,
			"surah": 19,
			"ayat": 31,
			"tafsir": "Furthermore, little Jesus said, Allah will make me a blessed person wherever I am, because I benefit people and guide them to the path of happiness; Allah has commanded me to perform prayers because establishing prayers involves cleansing oneself from various kinds of physical and spiritual sins. Allah has also ordered me to perform zakat as long as I live in this world. Zakat aims to cleanse property, soul and provide assistance to the poor."
		   },
		   {
			"id": 2282,
			"surah": 19,
			"ayat": 32,
			"tafsir": "Isa who was still a baby explained further, that God commanded him to be devoted to his mother, submit and always do good to her. This remark also shows Maryam's holiness, because if it were not so then the Prophet Isa would not have been ordered to serve his mother. Jesus' further statement said, \"God did not make me arrogant because I always obeyed God and did not make me a wretched person because I always did good to my mother.\""
		   },
		   {
			"id": 2283,
			"surah": 19,
			"ayat": 33,
			"tafsir": "Then Isa prayed, May peace and safety be bestowed upon him on three occasions, namely the day he was born, the day he died and the day he was raised to life again on the Day of Judgment. So no one can harm him in these three events which are the most difficult and critical events for every servant of Allah living in the world. Jews and Christians deny that Jesus never spoke when he was still a baby and still in his arms. They argued that if this had really happened, the news would have spread widely among the general public, because this incident was a very strange thing and very interesting. They have made inquiries everywhere and found no such information in their books. For Muslims this event remains a belief because it is stated in the Qur'an that the truth is certain because if Jesus (as) had not spoken when he was small and cleared his mother of all dirty accusations, the Jews would have carried out the stoning of Maryam, most likely that only a limited number of people witnessed the baby's speech so that it did not become widespread among them."
		   },
		   {
			"id": 2284,
			"surah": 19,
			"ayat": 34,
			"tafsir": "In this verse, Allah confirms that Jesus is a servant of Allah who will become a prophet and the Bible will be revealed to him, who has noble qualities and morals, not as alleged by his people, not a child of adultery and not a child of Allah as said and trusted by his people at a later date. What he said when he was a baby in his arms were true words and there could be no doubt even though his people still doubted those words and accused him of being a sorcerer. He is not a sorcerer as the Jews say, not the son of God as preached by the Christians and not God as the other groups say. He is a servant of Allah who will be appointed as a prophet and apostle."
		   },
		   {
			"id": 2285,
			"surah": 19,
			"ayat": 35,
			"tafsir": "In this verse Allah reaffirms that Jesus is not the son of Allah. It is not natural and impossible for God to have children because God does not need offspring like humans who in their old age really need help and care and need people who will continue and maintain the results of their business or make their name proud after they die. Allah does not need all of that because He is Almighty, always standing alone does not need the help of others as stated in His word: Allah, there is no god but Him. The Ever-living One, Who continually cares for (His creatures). (Ali 'Imran\/3: 2) Glory be to Allah from all the shortcomings and from all the accusations uttered by the unbelievers. If He wants to create something, it is enough for Him to say \"Kun\" (be) then he is created. For him it is not difficult to create a child without a father or to create a human being without a mother and father like creating Adam and Allah said: Verily the likeness (creation) of Isa is to Allah, like (the creation of) Adam. He created him from dust, then He said to him, \"Be!\" Then be that something. (Ali 'Imran\/3: 59) Allah, who is perfect and so great in power, would not possibly need a child, because that would show weakness and deficiencies."
		   },
		   {
			"id": 2286,
			"surah": 19,
			"ayat": 36,
			"tafsir": "In this verse Allah explains again the words of Jesus when he was a baby in the cradle in addition to his sayings in verses 30-33 of this surahh namely, \"That Allah is my Lord and your Lord, so you should worship Him.\" Isa emphasized to his people that he was only a servant of Allah like them too even though he was born in an extraordinary way without a father. This does not imply that he is a son of God, or that he is a God worthy of worship. He is just an ordinary human being created by God. Therefore he invites his people to worship Allah Who created it and created all creatures. All they deserve to worship is Allah, the Creator of all things. Then Isa explained to them that humans should worship Allah, not worship demons and idols. This is the straight path that will lead them to happiness in this world and the hereafter. This is also the way shown by the prophets before him. Whoever takes that path will be happy and whoever takes a path other than that will go astray and be wretched."
		   },
		   {
			"id": 2287,
			"surah": 19,
			"ayat": 37,
			"tafsir": "Then in this verse Allah explains that Prophet Isa's people did not heed the instructions given to them. They have fallen into the great abyss of error and strife. They are divided into several factions; The \"Yakubiyah\" group is a group that follows the teachings of a priest named Jacob, who says that Jesus is a god who was sent down to earth but then ascended again to heaven. The \"Nasturians\" follow the teachings of a priest named Nastur who said that Jesus was the son of God who was sent down to earth and then raised back up to heaven. This group says that Jesus is one of three persons, namely: Father, son and Ruhulkudus. Another group says that Isa is one of the three Gods, namely: Allah, Isa his son and Maryam the mother of Isa. Besides these misguided groups, there are also groups who are true and believe in accordance with the teachings and instructions of Isa who believe that Jesus is a servant of Allah and His Messenger, this group is called \"Malakania\". Against the misguided groups, Allah threatens them that they will see for themselves how terrible the Day of Judgment will be and how painful the torment will be for them. All their limbs will bear witness to their disbelief and disbelief. Allah postponed their torment until the Day of Judgment and did not hasten their torment solely because of His mercy and compassion as stated in the words of the Prophet PBUH: Verily Allah has postponed torture for the wrongdoer so that when He tortures him, he will not be able to escape the torment . (Al-Bukhari and Muslim narrations from Abu Musa) Regarding the attitude of Prophet Isa's people, the Prophet Muhammad said: No one can stand hearing hurtful words except Allah. They say that Allah has children while Allah still gives them sustenance and health. (Al-Bukhari's history from Abdullah bin Qais)"
		   },
		   {
			"id": 2288,
			"surah": 19,
			"ayat": 38,
			"tafsir": "On the Day of Judgment, those who disbelieve think about their unfortunate fate, their ears become very sensitive and their eyesight is very sharp, whatever happens immediately becomes their attention. So Allah then said, \"How sensitive are their ears and how sharp are their sights when they face Us. Even though they are in this world as if they are deaf and cannot listen to the instructions that the Prophet brought, and it is as if they are blind, they cannot see the truths and miracles that given to the apostles. They did not see or feel the power of Allah that was clearly visible in the universe.\" If they were in this world to use their hearing and sight as they are in the hereafter, they would not remain in disbelief, they would believe in Allah and His Messenger. But there is no use for sensitive ears and sharp eyes at that time, because their fate is already decided and they will definitely go to hell. They at that time felt very sorry and wished that they could be returned to the world to correct their mistakes and iniquities, but what can be said rice has become mush. This empty wish will not come true because they will be shackled, chained, and sent to hell as stated in the word of Allah: (Allah said), \"Catch him and bind his hands around his neck.\" Then put him into the burning fire of hell. Then bind him with a chain that is seventy cubits long. Verily he is the one who does not believe in Allah the Most Great. (al-haqqah\/69: 30-33) Such will be their fate in the hereafter because they are people who have truly strayed from the straight path."
		   },
		   {
			"id": 2289,
			"surah": 19,
			"ayat": 39,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to warn people, especially the polytheists of Mecca, that on the Day of Judgment they die in a state of disbelief, the infidels will regret themselves for not wanting to believe and always trying to uphold what is false while living in this world. . Believers are taken to heaven and disbelievers are brought to hell. These two groups were told that each of them would not leave the place prepared for them forever, and they would not experience death forever. It was narrated in a hadith from Abu Sa'id, the Messenger of Allah said, \"At that time \"death\" was brought in the form of a good-looking sheep, then people came who called, O inhabitants of heaven! Then they were stunned to notice. So the caller asked , \" Do you know what this is ? \" They said , Yes , it is \" Death . \" All of them saw it . They saw it too. Then \"death\" in the form of sheep was slain between heaven and hell, then the caller said, \"O inhabitants of heaven, you are eternal in heaven and you will not experience death again. O inhabitants of hell, you will live in hell forever and will not experience death again.\" Then Rasulullah recited this verse. (Al-Bukhari and Muslim) the day of resurrection, why do they not want to think about invitations and directions to the right path, but regret is no longer useful."
		   },
		   {
			"id": 2290,
			"surah": 19,
			"ayat": 40,
			"tafsir": "In this verse Allah comforted the Prophet Muhammad, asking the Prophet not to be sad because the polytheists did not want to believe and always belied him. Because they will later return to Allah and their disbelief will be rewarded with a fitting reward because We are the Almighty. We will inherit the earth and everything in it on the Day of Resurrection."
		   },
		   {
			"id": 2291,
			"surah": 19,
			"ayat": 41,
			"tafsir": "In these verses Allah ordered the Messenger of Allah to explain to the polytheists of Mecca the story of the Prophet Abraham whom they consider to be the father of the Arab nation. They themselves consider themselves their children and grandchildren and preach that they are followers of their religion. Even though the Prophet Abraham was a believer, a lover of Allah and a Prophet who worshiped God Almighty, not a polytheist who worshiped idols. Allah ordered Muhammad to tell them when the Prophet Abraham forbade his people to worship idols and told his father the following, \"Why do you worship idols that cannot hear the praise of their worshipers when they are worshiped, cannot see how solemnly you worship them, cannot help people who worship him and provide the slightest benefit of goods and cannot avoid harm if the worshiper asks him for help.\" With words that are gentle and acceptable to reason, Prophet Ibrahim called his father to monotheism and left the worship of idols of inanimate objects that were powerless. Whereas only humans can hear and see and can provide help, they are not worthy of worship, let alone inanimate objects that we make ourselves, if we want to damage them or destroy them, they are powerless to defend themselves. Such objects which are not likely to provide benefits or assistance to humans, should not be worshiped by humans. This is in accordance with the parable explained by Allah in His word: \"O people! A parable has been made. So listen! Verily, everything you call on other than Allah cannot create even a single fly, even though they unite to create it. And if the fly snatches something from them, they will not be able to take it back from the fly. Just as weak are those who worship and those who are worshiped.\" (al-hajj\/22: 73)"
		   },
		   {
			"id": 2292,
			"surah": 19,
			"ayat": 42,
			"tafsir": "In these verses Allah ordered the Messenger of Allah to explain to the polytheists of Mecca the story of the Prophet Abraham whom they consider to be the father of the Arab nation. They themselves consider themselves their children and grandchildren and preach that they are followers of their religion. Even though the Prophet Abraham was a believer, a lover of Allah and a Prophet who worshiped God Almighty, not a polytheist who worshiped idols. Allah ordered Muhammad to tell them when the Prophet Abraham forbade his people to worship idols and told his father the following, \"Why do you worship idols that cannot hear the praise of their worshipers when they are worshiped, cannot see how solemnly you worship them, cannot help people who worship him and provide the slightest benefit of goods and cannot avoid harm if the worshiper asks him for help.\" With words that are gentle and acceptable to reason, Prophet Ibrahim called his father to monotheism and left the worship of idols of inanimate objects that were powerless. Whereas only humans can hear and see and can provide help, they are not worthy of worship, let alone inanimate objects that we make ourselves, if we want to damage them or destroy them, they are powerless to defend themselves. Such objects which are not likely to provide benefits or assistance to humans, should not be worshiped by humans. This is in accordance with the parable explained by Allah in His word: \"O people! A parable has been made. So listen! Verily, everything you call on other than Allah cannot create even a single fly, even though they unite to create it. And if the fly snatches something from them, they will not be able to take it back from the fly. Just as weak are those who worship and those who are worshiped.\" (al-hajj\/22: 73)"
		   },
		   {
			"id": 2293,
			"surah": 19,
			"ayat": 43,
			"tafsir": "Furthermore, Prophet Ibrahim as told his father that he had been given knowledge by God that his father had not known. With this knowledge, Ibrahim could lead people to the straight path and free them from actions that demean them while bringing them to the happiness of the world and the hereafter. Even though he was his son and much younger but Allah had revealed His mercy to Abraham by giving him that knowledge. Ibrahim really wanted his father to follow him, so he could lead his father to the straight path."
		   },
		   {
			"id": 2294,
			"surah": 19,
			"ayat": 44,
			"tafsir": "my father, do not follow the teachings of satan which lead you to worship idols, because satan always deceives people so that they stray from the right path. In fact, Satan is a creature who disobeys his Lord, a creature who is very arrogant and arrogant, because of that Allah cursed him and kept him away from His grace. Because Satan has been angered by God, he is determined to always try to lead people astray. Don't be one of those people who are tricked by Satan and fall into his trap. I'm worried that if you continue to follow his teachings you will be afflicted with God's wrath like the wrath that has befallen the devil and you will certainly be included in his class."
		   },
		   {
			"id": 2295,
			"surah": 19,
			"ayat": 45,
			"tafsir": "my father, do not follow the teachings of satan which lead you to worship idols, because satan always deceives people so that they stray from the right path. In fact, Satan is a creature who disobeys his Lord, a creature who is very arrogant and arrogant, because of that Allah cursed him and kept him away from His grace. Because Satan has been angered by God, he is determined to always try to lead people astray. Don't be one of those people who are tricked by Satan and fall into his trap. I'm worried that if you continue to follow his teachings you will be afflicted with God's wrath like the wrath that has befallen the devil and you will certainly be included in his class."
		   },
		   {
			"id": 2296,
			"surah": 19,
			"ayat": 46,
			"tafsir": "The father of the Prophet Ibrahim refused his son's invitation which was spoken in a gentle tone with hard and sharp words that revealed extreme disapproval and anger. His father said, \"Do you hate the idols that I worship, which I glorify and which I glorify, O Abraham? Don't you realize your misunderstanding? Aren't the idols that I worship the worship of all your people? Aren't the gods that I glorify?\" was your ancestor worshiped since ancient times? Have you gone mad or possessed by a devil with your preaching that you have received knowledge from the true God? If you don't stop your call, I will stone you to death, or you will leave my side even from this country and never come back again.\" Hearing these very loud rebuttals and answers, Ibrahim's heart melted, because he loved and was very polite to his father and really wanted him to be free from the error of worshiping idols and receiving guidance to the right path, and wanting to believe in Allah, the One and Almighty. He wanted that by having faith his father would receive grace and mercy from his Lord. But what will he do and say, while his father is crazy and kicks him out of his house and hometown and doesn't even want him to come back as if he's not his son anymore."
		   },
		   {
			"id": 2297,
			"surah": 19,
			"ayat": 47,
			"tafsir": "There was no answer from Ibrahim to his father's rude shouts except to say, \"peace be upon you.\" I pray that you will always be healthy and fit. I will not reply to those harsh words harshly because you are my father whom I love. I will not do anything that harms or harms you, let me leave this country, leave you, leave your home and hometown. I ask God to forgive you and always be under the shadow of His grace, to be guided to the straight path that leads to goodness and happiness. Indeed Prophet Ibrahim as had prayed for him as stated in the word of Allah: \"And forgive my father, indeed he is one of those who went astray,\" (Asy-Syu'ara\/26: 86) Prophet Ibrahim as was sure that God would grant his prayer because it was usually in the past his prayers are always answered. Prophet Ibrahim prayed for his father because he had promised him that he would believe as stated in the word of Allah: As for Abraham's request for forgiveness (to Allah) for his father, it was nothing but because of a promise he had made to his father. So when it became clear to Ibrahim that his father was an enemy of Allah, Abraham separated himself from him. Truly, Ibrahim was a very meek and forbearing man. (at-Taubah\/9: 114)"
		   },
		   {
			"id": 2298,
			"surah": 19,
			"ayat": 48,
			"tafsir": "Next Ibrahim said to his father, \"I will leave you, leave your people, leave the idols that you worship. I will leave here so that I can freely worship my God who will help me and deliver me from the dangers that befall me, because of all my instructions and advice. you refuse outright and even threaten me with terrible threats. I will worship and pray only to my Lord and I will never worship anyone other than Him.\" According to history, Ibrahim moved to Syria and there he married Siti Sarah. He hoped that by praying and worshiping God, he would not become a disappointed person like his father who always worshiped and prayed to the idols, but it turned out that the idols couldn't do anything let alone carry out what was asked of him."
		   },
		   {
			"id": 2299,
			"surah": 19,
			"ayat": 49,
			"tafsir": "After Prophet Ibrahim left his country Ur Kildan (Iraq) and settled in the country of Sham, God gave him a prosperous and happy life. Allah gave him children and grandchildren, some of whom Allah appointed to be prophets among the Children of Israel. God gave him Isaac, and this Isaac also got a son named Jacob who replaced his position as a prophet. As for his first son, Ismail, who he left around the Kaaba, he was also appointed as a Prophet who exalted and enlivened the symbols of religion there. Such was God's reply to Prophet Abraham who was willing to leave his father, his people and his homeland for the sake of the safety of his faith and spread the religion of monotheism that God had commanded him. Allah does not ignore and does not waste even replacing the sadness of leaving his family and homeland with the happiness of a new family and homeland and accepts his teachings and instructions and gives him good children and grandchildren, some of whom become upholders of Allah's religion and even many who become prophets. ."
		   },
		   {
			"id": 2300,
			"surah": 19,
			"ayat": 50,
			"tafsir": "In this verse Allah explains that almost all of the children of Prophet Abraham and his grandchildren were appointed as prophets and bestowed upon them His grace and gifts and blessed their lives with joy and happiness both in this world and in the hereafter. They all left a good name and made the name of Prophet Ibrahim proud and exalted so that his glory and height were recognized by all parties, both among the Jews, the Christians and the polytheists themselves. This is a clear fact for the answer to the prayer of Prophet Ibrahim as mentioned in the verse: And make me a good speech for those (who come) later. (asy-Syu'ara'\/26: 84) It is only natural that Allah raised his rank and named him \"Khalilullah\" (His beloved) as mentioned in the verse: And Allah has chosen Abraham to be (His) favorite. (an-Nisa'\/4: 125) And made the prints of his feet when building the Kaaba a blessed place, and circumcised prayers there as mentioned in the verse: \"And (remember), when We made the house (Kaaba) a gathering place and a safe place for humans. And make Maqam Ibrahim a place of prayer.\" (al-Baqarah\/2: 125)"
		   },
		   {
			"id": 2301,
			"surah": 19,
			"ayat": 51,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to explain to the polytheists the story about the Prophet Musa and the virtues of his qualities so that the Prophet himself and his people could know how Allah honored and glorified him. One of the features of the Prophet Musa (pbuh) is that he is the person chosen by Allah and He is willing to solely convey the preaching of the religion of monotheism such as his preaching to Pharaoh and his people, as stated in this verse: (Allah) said, \"O Musa! Truly I chose (preferably) you from other humans (in your time) to carry My message and My words, therefore hold fast to what I give you and be among those who are grateful.\" (al-A'raf\/7: 144) Allah appointed him as an apostle in addition to being a prophet. The difference between apostles and prophets is that messengers have treatises that must be conveyed to humans and revealed to him books containing creeds, laws and so on, while prophets are people who receive revelations from Allah regarding the true religion and inform it to humans but do not has treatises that must be conveyed to humans and the book was not revealed to him. Among the Children of Israel there were many prophets whose job was only to maintain and convey the Shari'a brought by the Prophet Musa mentioned in the Torah, such as Yusa', Ilyas and others."
		   },
		   {
			"id": 2302,
			"surah": 19,
			"ayat": 52,
			"tafsir": "In this verse it is explained how Allah called Musa as and spoke directly to him to the right of the hill of Tur, which is a hill located on the Sinai peninsula. At that time Musa was heading to Egypt from Midian to convey his message to Pharaoh. It was on the Tursina hill that Moses was informed by Allah that he had been made an apostle and promised him that he would be victorious in facing the tyrannical Pharaoh who proclaimed himself as God. God also promised him that he would send down mercy on the family of the Children of Israel by sending down the Torah. Allah also explained that He had brought Moses closer to Him at the time of speaking with the meaning of glorifying him and choosing him as His Messenger as if Moses at that time was close to God as close as a king when talking to his ministers. We cannot know how God spoke directly to Moses. Did Moses really hear a voice or did Moses just feel that he had been in a high spiritual realm as if he had heard a Divine revelation. We cannot know how it actually happened, we must leave it all to Allah Almighty. Our obligation as believers is only to believe in it, because it is narrated in the Qur'an."
		   },
		   {
			"id": 2303,
			"surah": 19,
			"ayat": 53,
			"tafsir": "Among Allah's blessings on Musa is that Allah has granted his request that Harun, his half-brother, be appointed as a prophet to assist him in conveying his Lord's message as stated in the verse: And make me a helper from my family, (namely) Aaron, my brother, strengthen my strength with (the presence of ) him, and make him a companion in my affairs. (thaha\/20: 29-30-31-32) And in the verse: And my brother Aaron, he is more eloquent in tongue than I am, so send him with me as my helper to justify my (sayings); verily, I am afraid that they will lie to me.\" (al-Qashash\/28: 34) As a gift and mercy from Allah to Musa Allah allowed Musa's request as stated in the verse: He (Allah) said, \"Indeed, your request has been granted , O Musa! (thaha\/20: 36) Regarding Prophet Musa's request for Prophet Harun, some of the (former) salaf scholars, including Ibn Jarir ath-tabari said, \"No one can intercede for another person greater than the intercession given to Harun by the intercession of the Prophet Musa.\" According to the history of Ibn Abbas, Harun at that time was about 4 years older than Musa."
		   },
		   {
			"id": 2304,
			"surah": 19,
			"ayat": 54,
			"tafsir": "In this verse, God ordered the Prophet Muhammad to tell about Ismail, the ancestor of the Arabs, who was appointed by God to become a prophet and apostle so that he could be an example for them in his qualities, loyalty and honesty, fortitude and patience in carrying out God's commands and obedience and obedience. . One of the most prominent traits is keeping promises. Keeping promises is a trait possessed by every apostle and prophet, but this trait in Ismail was so prominent that God made this trait as Ismail's specialty. Among the promises he kept even though the promise endangered his life was his willingness to be slaughtered as a sacrifice to carry out God's command to his father Abraham which he received through the intercession of ar-ruyah ash-sadiqah (true dreams) which is equivalent to revelation. When Ibrahim talked with Ismail about God's command to slaughter him, Ismail emphatically stated that he was willing to be slaughtered for the sake of obeying God's command and he would be steadfast and patient in facing death no matter how painful and painful it was. This is stated in the verse: So when the child reached (the age of) being able to try with him, (Ibrahim) said, \"O my son! I actually dreamed that I was slaughtering you. So think about what you think!\" He (Ismail) replied, \"O my father! Do what (Allah) commands you; God willing, you will find me among those who are patient.\" (ash-shaffat\/37: 102) That was Ismail's promise to his father Ibrahim. Ismail actually kept this promise and he gave himself to his father who was ready with a sharp knife to slaughter him. Ibrahim even though with a feeling of great compassion and pity laid Ismail down to make it easier to slaughter and a knife was pointed at his neck. At that time Allah called Ibrahim and replaced Ishmael with a big fat sheep. This is told by Allah in His word: So when both of them had surrendered and he (Ibrahim) laid his son on (his) cheek, (to carry out Allah's command). Then We called him, \"O Ibrahim! Indeed, you have justified the dream.\" Indeed, thus We reward those who do good. In fact, this is really a real test. And We ransomed the child with a large sacrifice. (ash-shaffat\/37: 103-107) In addition to this prominent characteristic, Ismail was appointed by Allah to be a prophet and messenger to the Jurhum tribe who settled in Mecca with his mother. As an apostle, Ismail was commissioned by Allah to convey the treatise, namely the treatise that had been delivered by his father the Prophet Abraham to the Jurhum tribe. Indeed, before the Prophet Muhammad was sent as an apostle, there were among the Arabs people who adhered to monotheism and most likely the monotheism that they adhered to was the ideology that Ismail brought and conveyed to his people."
		   },
		   {
			"id": 2305,
			"surah": 19,
			"ayat": 55,
			"tafsir": "In this verse Allah explains that Ismail always ordered his family to keep praying and paying zakat, because prayer and zakat had been prescribed since the Prophet Abraham. The treatise delivered by the Prophet Ismail was the treatise brought by his father Ibrahim. Even though what is explained here only concerns his family, the order covers all his people because the apostle was sent not only for the family but was sent for all his people. At first, the Prophet Muhammad himself was only ordered to convey Islamic teachings to his family and then was ordered to invite all people to follow the teachings he brought. This is contained in the word of Allah: And warn your closest relatives (Muhammad), (asy- Syu'ara'\/26: 214) And His words: And order your family to pray and be patient in doing it. (thaha\/20: 132) Then Allah explained that Ismail was a person Allah pleased with because he was never negligent in obeying the commands of his Lord, and always carried out his duties to the best of his ability."
		   },
		   {
			"id": 2306,
			"surah": 19,
			"ayat": 56,
			"tafsir": "In these two verses the Prophet Muhammad was ordered to also explain a bit of news about Prophet Idris. According to some narrations, it says that Prophet Idris was the grandmother of Prophet Noah as. According to a well-known history, she was the grandmother of Prophet Noah. He was the first person to investigate the science of the stars and the science of arithmetic, as one of the miracles given to him by God. He was the first messenger sent by Allah after Adam a.s., and revealed to him a book consisting of thirty pages. He is also considered to be the person who first created scales and measures, pens for writing, sewing clothes instead of animal skins and weapons for war. Allah explained in this verse the high position of the Prophet Idris because he was a believer justifying the power and oneness of Allah and He appointed him to be a prophet and raised his rank to the highest level, both in this world and in the hereafter. As for the world, it is by receiving the treatise brought by his people and the fragrance of his name among mankind. This is the same as Allah's gift to the Prophet Muhammad as mentioned in the word of Allah: \"And We exalted your name (name) for you.\" (asy-Syarh\/94: 4) In the afterlife he will be placed in heaven in the highest and noblest place, where the prophets and shiddiqin are as mentioned in the verse: And whoever obeys Allah and the Messenger (Muhammad), then they will together with those who are favored by Allah, (namely) the prophets, the lovers of truth, the martyrs and the pious. They are the best friends. (an-Nisa'\/4: 69)."
		   },
		   {
			"id": 2307,
			"surah": 19,
			"ayat": 57,
			"tafsir": "In these two verses the Prophet Muhammad was ordered to also explain a bit of news about Prophet Idris. According to some narrations, it says that Prophet Idris was the grandmother of Prophet Noah as. According to a well-known history, she was the grandmother of Prophet Noah. He was the first person to investigate the science of the stars and the science of arithmetic, as one of the miracles given to him by God. He was the first messenger sent by Allah after Adam a.s., and revealed to him a book consisting of thirty pages. He is also considered to be the person who first created scales and measures, pens for writing, sewing clothes instead of animal skins and weapons for war. Allah explained in this verse the high position of the Prophet Idris because he was a believer justifying the power and oneness of Allah and He appointed him to be a prophet and raised his rank to the highest level, both in this world and in the hereafter. As for the world, it is by receiving the treatise brought by his people and the fragrance of his name among mankind. This is the same as Allah's gift to the Prophet Muhammad as mentioned in the word of Allah: \"And We exalted your name (name) for you.\" (asy-Syarh\/94: 4) In the afterlife he will be placed in heaven in the highest and noblest place, where the prophets and shiddiqin are as mentioned in the verse: And whoever obeys Allah and the Messenger (Muhammad), then they will together with those who are favored by Allah, (namely) the prophets, the lovers of truth, the martyrs and the pious. They are the best friends. (an-Nisa'\/4: 69)."
		   },
		   {
			"id": 2308,
			"surah": 19,
			"ayat": 58,
			"tafsir": "In this verse, Allah explains that the prophets and apostles whose names have been mentioned in the previous verses are people who have been given gifts and favors by Allah by elevating their degrees and making their names proud among mankind. In general, all the prophets and apostles received such gifts from the first father Adam to the second father Noah, to the Prophet Abraham and his descendants including Isaac, Jacob, Ishmael, Moses, Aaron, Zakaria, Jesus and all of His chosen people. , all of them have a characteristic that is rarely possessed by other people, namely when the verses of Allah are read to them they immediately fall down (fall down) to prostrate and cry and humble themselves because they remember the greatness of Allah. They are human beings who are full of piety, very sharp hearing and feelings when they hear the name of Allah and their hearts tremble when His verses are read, they do not have the words they will say to describe what they feel in their hearts so that tears roll down their cheeks. them and fell prostrate before Allah the Most Great, Almighty, Most Compassionate and Most Merciful. Such is the nature possessed by the prophets and apostles and it is only natural that Allah gives them great gifts and favors. This is also mentioned in the word of Allah: Verily, those who believe are those who, when Allah's name trembles in their hearts, and when His verses are recited to them, their faith increases (strengthens) and they put their trust only in Allah. (an-Anfal\/8: 2) Rasulullah saw, said: Read the Qur'an and cry, if you can't cry, try to cry. (History of Ibn Majah)"
		   },
		   {
			"id": 2309,
			"surah": 19,
			"ayat": 59,
			"tafsir": "In this verse Allah explains that many people came later after the death of the prophets and apostles mentioned in the previous verses, deviated from the straight path, abandoned the teachings brought by the previous apostles so they no longer prayed and always following the will of lust and openly violating God's prohibitions such as drinking, gambling, adultery, and holding false testimonies. They are threatened by Allah with a strong threat, they will be afflicted with accidents and losses both in this world and in the hereafter. In connection with this verse Abu Sa'id al-Khudri narrates that the Messenger of Allah said: \"There will come a generation after sixty years, they neglect their prayers and indulge in lust, then these people will meet with accidents and losses. Then another one will come generations, they read the Qur'an but only in the throat (mouth) only (not into the heart) and all read the Qur'an, believers, hypocrites and evil and wicked people (can no longer distinguish which a true believer and which one is a pretender).\" (History of Ahmad, Ibn hibban and al-hakim) Then Rasulullah read this verse (as stated above). 'Uqbah bin 'Amir also narrated that I heard the Messenger of Allah say: \"A part of my ummah will be destroyed, namely \"Ahlul Kitab\" and \"Ahlullaban\". I asked, \"Who are the \"Ahlul Kitab\" O Messenger of Allah?\" He replied, \"They are people -people who study the Qur'an to argue with the believers.\" \"Then who are the \"Ahlullaban\"?\" The Messenger of Allah replied, \"They are people who follow their passions and abandon prayer.\" (History of Ahmad and al-hakim from 'Uqbah bin 'Amir al-Juhhani) Such is the fate of those who neglect prayer and indulge in lust and squander it, they must lose even though what they suffer cannot be seen with their eyes and will surely receive a fitting reward in hereafter. Here it is clear that the prayer which has become the Shari'a since the Prophet Abraham is very important and should not be wasted let alone abandoned. It is narrated that the Prophet Muhammad said: \"Prayer is is the pillar of religion. Whoever founded it, he has upheld the religion, and whoever abandons it, he has undermined the religion.\" (Narrated by al-Baihaqi from Umar ra)"
		   },
		   {
			"id": 2310,
			"surah": 19,
			"ayat": 60,
			"tafsir": "In this verse Allah explains that the person in verse 59 if they repent and return to doing good deeds then Allah will forgive their sins and will be admitted to heaven and they will not be harmed in the slightest. Such is the decree of Allah, the Most Just, Most Gracious and Most Merciful. Even though someone has been dragged into the abyss of disobedience because of being deceived and deceived by worldly delights that are mortal, but if they are converted and return to the right path and repent to Allah truly repentance Allah will accept their repentance with terms and conditions which is explained in other passages."
		   },
		   {
			"id": 2311,
			"surah": 19,
			"ayat": 61,
			"tafsir": "This verse explains that the paradise promised by Allah will be a place of residence for those who repent and fear it, is the paradise of 'Adn. Even though the promised paradise cannot be seen by humans in this world, because it is still supernatural and when humans will definitely enter it, it cannot be known with certainty because all of this is only known by Allah. But for those who believe and believe in the occurrence of the day of resurrection and reckoning, there is not the slightest doubt because that is the promise of Allah, the Most Perfect, the Most Just and the Most Wise. Surely the promise will be fulfilled and He will carry it out."
		   },
		   {
			"id": 2312,
			"surah": 19,
			"ayat": 62,
			"tafsir": "Allah also explained that in heaven there will be no quarrels, useless words will not be heard as happened in the world where humans for their own interests or for the interests of their families and groups are always arguing, fighting, accusing and accusing each other. endless accusations, causing them to lose peace and prosperity. Even they are filled with anxiety and worry. It's different with heaven, because humans have entered another world, all desires can be achieved and enjoyed, there is no longer any enmity or power struggles among themselves to achieve something, so what is heard is only greetings (congratulations), both words come from angels. or from each other. All of them feel safe and secure because every morning and evening they are given sustenance by their Lord, sustenance that cannot be imagined in one's mind how delicious and delicious it tastes. Allah describes the favors provided for the inhabitants of heaven, as mentioned in the Qudsi Hadith: I provide for My pious servants favors that eyes have never seen, ears have never heard of and cannot imagine in the trajectory of the heart. man. (History of al-Bukhari and Muslim from Abu Hurairah)"
		   },
		   {
			"id": 2313,
			"surah": 19,
			"ayat": 63,
			"tafsir": "Thus the atmosphere in heaven is safe and secure, the atmosphere is happy and prosperous. Its inhabitants feel relieved and satisfied with the favors and gifts that God has bestowed upon them, and Allah is pleased with them because they in the world are always obedient and obedient to Him, patient in facing His trials as stated in His word: Allah says, \" This is when the righteous will benefit from their righteousness. They will have gardens beneath which rivers flow, they will abide therein forever. Allah is pleased with them and they are pleased with Him. That is a great victory.\" (al-Ma'idah\/5: 119) Such is the condition and nature of heaven that He will pass on to His servants who truly believe and always fear Him as stated in His words: Close friends on that day are enemies to one another, except those who are pious. \"O My servants! There is no fear for you on that day nor do you grieve. (That is) those who believe in Our verses and they surrender. Enter you into heaven, you and your partner will cheered up.\" Gold plates and cups are passed around them, and in Paradise there will be whatever the heart desires and all that is pleasing to the eye. And you stay in it. And that is the paradise that you are bequeathed because of the deeds that you have done. In that paradise there will be many fruits for you of which you will eat. (az-Zukhruf\/43: 63-73)"
		   },
		   {
			"id": 2314,
			"surah": 19,
			"ayat": 64,
			"tafsir": "In this verse Gabriel emphasized to the Prophet Muhammad that the angels would not be able to descend to bring revelations to the apostles unless they had received orders from Allah according to His will and wisdom, in accordance with the interests of His servants, both regarding worldly affairs and regarding afterlife affairs. It is He who owns all that is before us and behind us and that is in between, He is the one who takes care of it and rules it. Therefore He also knows better about what is good and what is not good for His creatures. It is He who determines when the angels will come down to His messengers to bring revelation, and for how long He allows angels not to come down to them according to His knowledge and wisdom. So if an angel is late in sending down his revelation to the Messenger, it is not because Allah has left the Messenger, is angry or He has forgotten about him. It is impossible for Allah to be negligent and forgetful."
		   },
		   {
			"id": 2315,
			"surah": 19,
			"ayat": 65,
			"tafsir": "How could God be careless and forgetful when He owns and manages and controls everything in the heavens and on earth and everything in between. Almighty and All-Wise Allah will never be negligent or forget to care for and govern all of His creatures. Therefore, do not let the Apostle think that Allah has been angry with him with the delay in revelation. All that happens according to His will and wisdom. The Apostle was ordered to wait patiently and continue to worship Him no matter what the polytheists say. Truly Allah is God Almighty there is nothing that can match Him, therefore it is to Him that humans must surrender, obey and obey His commands."
		   },
		   {
			"id": 2316,
			"surah": 19,
			"ayat": 66,
			"tafsir": "Al-Wahidi narrated that this verse was revealed in the case of Ubay bin Khalaf. He took a piece of bone that had almost been crushed and crushed it with his hands like flour, then he threw it into the strong wind, and the bones scattered. Then he said, \"Some say that we will be resurrected after we die and after we become like these bones.\" Is it possible that when I die I will be resurrected and revived? Questions like that are also found in other verses: And they say, \"When we die, become dust and bones, will we really be resurrected?\" (al-Waqi'ah\/56: 47) And His words: And they said, \"When we have become bones and things that were destroyed, will we really be resurrected as new creatures?\" (al-Isra'\/17: 49) Those are the questions raised by people who are shallow in mind and do not want to think deeply about the power of Allah, because the eyes of their hearts have been covered by the misguidance and pleasures of worldly life, so that no light appears to them anymore. bright truth. Therefore Allah rejected their questions. Does a human who thinks like that never know that Allah has created him from nothing. Is there anyone who can create something from nothing, can also create it from something that exists even if it is in the form of bones or destroyed objects. This is a strange thought which would not arise except from those whose hearts have been clouded with aversion and who do not want to think things over carefully and deeply. In another verse Allah says: And it is He who started the creation, then repeats it again, and that is easier for Him. He has the nature of the Most High in the heavens and on earth. And He is the Most Mighty, the Most Wise. (ar-Rum\/30: 27) And His words: And he made a parable for Us and forgot the origin of its occurrence; he said, \"Who can give life to the bones, which are shattered?\" Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 78-79) In a hadith Qudsi Allah says: \"The son of Adam has belied Me while he has no right to lie to Me. The Son of Adam has hurt Me while he has no right to hurt Me. As for his deception against Me, he said that I would not bring him back to life as I created him the first time. Creating it the first time is not easier for Me than creating it later (meaning it is just as easy). As for what hurt Me was his words: Verily I have children, while I am God Almighty Who depends on Me for everything, who has neither child nor birth, and no one is equal to Me.\" (Riwayat al- Bukhari from Abu Hurairah)"
		   },
		   {
			"id": 2317,
			"surah": 19,
			"ayat": 67,
			"tafsir": "Al-Wahidi narrated that this verse was revealed in the case of Ubay bin Khalaf. He took a piece of bone that had almost been crushed and crushed it with his hands like flour, then he threw it into the strong wind, and the bones scattered. Then he said, \"Some say that we will be resurrected after we die and after we become like these bones.\" Is it possible that when I die I will be resurrected and revived? Questions like that are also found in other verses: And they say, \"When we die, become dust and bones, will we really be resurrected?\" (al-Waqi'ah\/56: 47) And His words: And they said, \"When we have become bones and things that were destroyed, will we really be resurrected as new creatures?\" (al-Isra'\/17: 49) Those are the questions raised by people who are shallow in mind and do not want to think deeply about the power of Allah, because the eyes of their hearts have been covered by the misguidance and pleasures of worldly life, so that no light appears to them anymore. bright truth. Therefore Allah rejected their questions. Does a human who thinks like that never know that Allah has created him from nothing. Is there anyone who can create something from nothing, can also create it from something that exists even if it is in the form of bones or destroyed objects. This is a strange thought which would not arise except from those whose hearts have been clouded with aversion and who do not want to think things over carefully and deeply. In another verse Allah says: And it is He who started the creation, then repeats it again, and that is easier for Him. He has the nature of the Most High in the heavens and on earth. And He is the Most Mighty, the Most Wise. (ar-Rum\/30: 27) And His words: And he made a parable for Us and forgot the origin of its occurrence; he said, \"Who can give life to the bones, which are shattered?\" Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 78-79) In a hadith Qudsi Allah says: \"The son of Adam has belied Me while he has no right to lie to Me. The Son of Adam has hurt Me while he has no right to hurt Me. As for his deception against Me, he said that I would not bring him back to life as I created him the first time. Creating it the first time is not easier for Me than creating it later (meaning it is just as easy). As for what hurt Me was his words: Verily I have children, while I am God Almighty Who depends on Me for everything, who has neither child nor birth, and no one is equal to Me.\" (Riwayat al- Bukhari from Abu Hurairah)"
		   },
		   {
			"id": 2318,
			"surah": 19,
			"ayat": 68,
			"tafsir": "Therefore Allah threatens such people by swearing that He will gather them in the plains of glory together with Satan whom they consider to be their leader. They will see and experience how terrible and great the atmosphere at that time was, so that no one thinks about anything but his own safety as stated in God's word: On that day man will flee from his brother, and from his mother and father, and from his wife and children. . Every one of them that day had some business to occupy him with. ('Abasa\/80: 34-37) It was in this very critical and critical situation that they were brought to hell in a state of kneeling and humiliation, unable to stand up anymore because of the very bitter experience and indescribable suffering."
		   },
		   {
			"id": 2319,
			"surah": 19,
			"ayat": 69,
			"tafsir": "Therefore Allah threatens such people by swearing that He will gather them in the plains of glory together with Satan whom they consider to be their leader. They will see and experience how terrible and great the atmosphere at that time was, so that no one thinks about anything but his own safety as stated in God's word: On that day man will flee from his brother, and from his mother and father, and from his wife and children. . Every one of them that day had some business to occupy him with. ('Abasa\/80: 34-37) It was in this very critical and critical situation that they were brought to hell in a state of kneeling and humiliation, unable to stand up anymore because of the very bitter experience and indescribable suffering."
		   },
		   {
			"id": 2320,
			"surah": 19,
			"ayat": 70,
			"tafsir": "The disbelievers were gathered in groups according to the degree of their iniquity, then Allah set aside those who were the most disbelievers, the most arrogant and rebellious and the most misleading people on earth from each group to be thrown first into hell. For Allah, Who is All-Knowing, Extensive in Knowledge, it is not difficult to determine people like that because all their deeds in the world have been recorded in their respective books, as stated in His word: On that day you will be presented (to your Lord), not there is anything from you that is hidden (from Allah). (al-haqqah\/69: 18) They will be shackled, thrown into hell and even in hell they will be chained as it is in His word: (Allah said), \"Arrest him and shackle his hands around his neck.\" Then put him into the burning fire of hell. Then bind him with a chain that is seventy cubits long. (al-haqqah\/69: 30-32) After that, another turn will come to be thrown into hell according to the level of disbelief and iniquity."
		   },
		   {
			"id": 2321,
			"surah": 19,
			"ayat": 71,
			"tafsir": "Then Allah directs His words to all mankind and explains that all people will be taken to a place where hell is. They were brought closer to that hell and stood around it. This has become His decree that cannot be changed anymore and must be carried out. In the Muslim hadith from Abu Sa'id al-Khudriy it is explained (¦ then a bridge was built over Hell, and intercession is allowed, they said O Allah save us “ save us, the Messenger of Allah was asked, what is that bridge? Rasulullah replied, \"a slippery footing there are grabbers and pins, and thorns (like) those in Najd, which have small thorns called as-Sa'dan. There are believers who walk in the twinkling of an eye like lightning, wind, flying birds, racehorses and like people who drive, then there are survivors, caught and escaped, some are thrown into hell hell.\")"
		   },
		   {
			"id": 2322,
			"surah": 19,
			"ayat": 72,
			"tafsir": "This verse emphasizes that Allah at that time released the righteous from the torments of hell and allowed the disbelievers to fall into it on their knees. Allah explains that those who are released from the torments of hell are pious people, not just believers, because those who believe are not necessarily among those who are pious, because many of those who believe violate orders. Allah and do his prohibition. If his sins are more than his good deeds, then he will be tortured first in hell according to the sins he has committed, then expelled from hell after receiving punishment commensurahte with his sins, then put into heaven. As for those whose good deeds are more than their sins, then he will be admitted to heaven after his sins are forgiven by Allah with His mercy and compassion. This is stated in the word of Allah: So as for those whose scales (goodness) are heavy, then he is in a satisfying (happy) life. And as for those whose scales (goodness) are light, then the place of their return is the Hawiyah hell. And do you know what Hawiyah's hell is? (That is) a very hot fire. (al-Qari'ah\/101: 6-11)"
		   },
		   {
			"id": 2323,
			"surah": 19,
			"ayat": 73,
			"tafsir": "In this verse, Allah explains the attitude of the disbelievers when the verses of the Qur'an are read to them whose truth is obvious and cannot be denied, the words that come out of their mouths against the truth of these verses are ridicule and ridicule. joke. They tell the believers which of us is happiest in life, has the most peace of mind, has the nicest house, has the highest position and has the most numbers. How can we, who are much higher and more noble than all of you, be in evil and take a wrong path. This is impossible. So we consider that you are in error because besides being weak, miserable and few in number, you can only gather secretly to discuss matters in secluded and quiet places such as Darul Arqam and so on. It is impossible for the religion that you profess to be the true religion and it is impossible for the verses of the Qur'an to be good and useful. Because if that were the case, of course we would be the first to believe and believe in it. That is the only reason and explanation that can be presented by disbelievers to believers and their explanations like this are also found in other verses: And those who disbelieve say to those who believe, \"If only the Qur'an were something well, of course they do not deserve to precede us (believe) in him.\" But because they don't get on with it they'll say, \"It's an old lie.\" (al-Ahqaf\/46: 11)"
		   },
		   {
			"id": 2324,
			"surah": 19,
			"ayat": 74,
			"tafsir": "Allah rejected the ridicule of the disbelievers by explaining that in the past He had destroyed many peoples because of their iniquity, such as the people of 'Ad and Samud even though they were richer and more luxurious than the infidels of Mecca and their country was also a land that fertile, and has a beautiful panorama. So the wealth, the luxury of the people and the beauty of a country are not a reference for judging a people that they are on the right side and are God's favorite. The measure is faith in Allah and obedience and adherence to carrying out His commands and leaving His prohibitions. If it were true that wealth and luxury were the measure, surely they would not be destroyed by Allah. In fact, this verse is a threat from Allah to the polytheists of Mecca, if they are not conscious and aware and remain disobedient, it is not impossible that they will be destroyed as well as the earlier people."
		   },
		   {
			"id": 2325,
			"surah": 19,
			"ayat": 75,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to answer the ridicule and ridicule of the polytheists who were proud of their wealth by saying that those who went astray from their people would not be destroyed by Allah at this time, because of his mercy and compassion and because among them there are The Prophet Muhammad and those who believe. This is in His words: But Allah will not punish them, as long as you (Muhammad) are among them. And not (also) Allah will punish them, while they (still) ask for forgiveness. (al-Anfal\/8: 33) Allah will let them and suspend and give them the opportunity to drag on in disbelief and lawlessness until the time comes when they will see for themselves the torment of Allah in the world with the total defeat they experienced (such as the Battle of Badr and the expulsion of the polytheists of Mecca) and in the hereafter they will see who is actually more noble, receiving God's mercy and grace and who will receive humiliating torments so that their position is so despicable and so low."
		   },
		   {
			"id": 2326,
			"surah": 19,
			"ayat": 76,
			"tafsir": "As entertainment for the Muslims who are humiliated and ridiculed, because indeed they are powerless to answer the challenges of the polytheists who boast about their wealth. Allah promised to give them additional instructions in addition to the instructions they had received. With these instructions they will be more pious and happier. Let the disbelievers be proud of wealth and position and always be in arrogance and arrogance. Let them drag on in error and lawlessness. One day Allah will inflict His harsh punishment on them. It is at that time that they will realize that they have made a big mistake and regret it very, very much, but regret will not help them in the slightest, because it is like rice that has become mush, regret it first, regret it, then it is useless. In facing the arrogance of the polytheists, Muslims should be patient and steadfast, always practice Allah's instructions, obey and obey His commands. Thus their hearts will be spacious, their minds will be calm, their good deeds will increase. They will always be under the protection of His grace and love. Allah will provide for them a double reward."
		   },
		   {
			"id": 2327,
			"surah": 19,
			"ayat": 77,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to pay attention to how arrogant and arrogant the infidels were who dared to say that in the afterlife they would be rewarded with lots of wealth and children. Even though those words seem to show that they believe in the resurrection day, in fact they do not believe in the existence of the resurrection day at all. Such remarks are only a mockery and mockery of the beliefs of the believers with the understanding that if Khabab bin Arat really believes in the resurrection day, let his debt be paid on the resurrection day. Now he doesn't want to pay for it because Khabbab has faith in Muhammad. The ridicule was compounded by saying that he would be rich and have many children in the afterlife. How dare he invent something that he does not know at all, while he himself denies the occult."
		   },
		   {
			"id": 2328,
			"surah": 19,
			"ayat": 78,
			"tafsir": "Therefore, in this verse Allah criticized him by saying, \"Does he know unseen things or has he promised Allah that He will give him sustenance and many children?\" The two possibilities are very far apart, because no one can know what is unseen, let alone what is related to the hereafter. And it is also impossible for him to promise with God that he will be given a lot of sustenance in the hereafter while he himself denies that day and associates partners with Allah with idols. The place of a person like this is hell and the torment that will be inflicted on him will be very heavy."
		   },
		   {
			"id": 2329,
			"surah": 19,
			"ayat": 79,
			"tafsir": "In this verse Allah threatens them with harsh threats because of their impudence to ascribe something to Allah without knowledge and without a basis that can be accounted for rationally. Allah will take all of their possessions in proportion to their disobedience and disobedience and torment them with uninterrupted torments. Allah will take away all his wealth and children that he left when he died so that in the hereafter he will come to Allah alone, no one will defend and help him. Indeed, on that day there is nothing that can help people except faith and deeds according to the word of Allah: (namely) on the day (when) wealth and children are useless, except for those who come to Allah with a clean heart. (asy- Syu'ara\/26: 88-89) And they will be brought before your Lord by marching. (Allah said), \"Surely you come to Us, as We created you in the first time; even you think that We will not set for you a time (to rise to fulfill) the covenant.\" (al-Kahf\/18: 48)"
		   },
		   {
			"id": 2330,
			"surah": 19,
			"ayat": 80,
			"tafsir": "In this verse Allah threatens them with harsh threats because of their impudence to ascribe something to Allah without knowledge and without a basis that can be accounted for rationally. Allah will take all of their possessions in proportion to their disobedience and disobedience and torment them with uninterrupted torments. Allah will take away all his wealth and children that he left when he died so that in the hereafter he will come to Allah alone, no one will defend and help him. Indeed, on that day there is nothing that can help people except faith and deeds according to the word of Allah: (namely) on the day (when) wealth and children are useless, except for those who come to Allah with a clean heart. (asy- Syu'ara\/26: 88-89) And they will be brought before your Lord by marching. (Allah said), \"Surely you come to Us, as We created you in the first time; even you think that We will not set for you a time (to rise to fulfill) the covenant.\" (al-Kahf\/18: 48)"
		   },
		   {
			"id": 2331,
			"surah": 19,
			"ayat": 81,
			"tafsir": "In this verse, Allah explains to the Prophet Muhammad that the intention and purpose of polytheists worshiping idols and other idols is so that these idols and worships can help them, both in this world and in the hereafter. They offer various kinds of goods and money to the idols in the hope that the idols will grant their requests, be blessed and blessed in life, effort and work, and that they will remain happy, noble and honorable. Among them it is as if idols are the most powerful, have the right to bestow mercy and favors, have the right to inflict torment and misery. In the afterlife (according to their understanding) these idols will be able to intercede for them and will help them when they face difficulties or experience suffering."
		   },
		   {
			"id": 2332,
			"surah": 19,
			"ayat": 82,
			"tafsir": "This verse rejects this misconception, especially regarding the ability of idols to provide help in the afterlife. These idols and offerings will not be able to help them in any way, they will even deny before Allah that they are worshiped by the polytheists as stated in the word of Allah: And when those who associate partners (Allah) see partners them, they said, \"O our Lord, these are our partners whom we used to worship besides You.\" Then their allies declared to them, \"You are utter liars.\" (an-Nahl\/16: 86) And His words: (That is) when those who are followed let go of the hands of those who follow, and they see the doom, and (when) all relations between them are cut off. And those who followed said, \"If we had the opportunity (to return to the world), of course we would let go of them, just as they let go of us.\" Thus Allah shows them their deeds which they regret. And they will not come out of the hell fire. (al-Baqarah\/2: 166-167)"
		   },
		   {
			"id": 2333,
			"surah": 19,
			"ayat": 83,
			"tafsir": "In this verse Allah warns the Prophet Muhammad that He has released the devil and gave him the opportunity to deceive, persuade and deceive people who are affected by the seduction of the devil including the Meccan infidels so that they will remain in error and will not return to the right path no matter what. Muhammad invited and called them. This was explained by Allah as an antidote to the heart of the Prophet Muhammad who was grieving because he had earnestly and wholeheartedly provided instructions and warnings to them, but they still denied and did not want to believe."
		   },
		   {
			"id": 2334,
			"surah": 19,
			"ayat": 84,
			"tafsir": "In this verse, Allah forbade the Prophet Muhammad to feel sad and angry with the disbelievers and asked that their punishment be hastened because the time to inflict punishment was near, only the days were numbered. In this world they will be rewarded with their defeat in the Battle of Badr and in the hereafter even though in our minds it is still far away but for Allah that day is near. Because one day in the hereafter in Allah's calculations is not 24 hours like our calculations, maybe a thousand years or maybe more, as stated in His word: And they ask you (Muhammad) that the doom will be hastened, even though Allah will not violate His promise. And verily a day with your Lord is like a thousand years according to your reckoning. (al-hajj\/22: 47)"
		   },
		   {
			"id": 2335,
			"surah": 19,
			"ayat": 85,
			"tafsir": "On that day Allah gathers those who are pious to appear before Him as a group that is glorified for their faith and deeds in the world. They were brought in a nice and beautiful vehicle as honored guests. Ali bin Abi Talib said that the group was not an ordinary group that walked or was herded but was brought in a vehicle whose beauty had never been seen by humans, on which there was a golden seat and the tutoring straps were inlaid with emerald jewels so that they arrived at the door of heaven."
		   },
		   {
			"id": 2336,
			"surah": 19,
			"ayat": 86,
			"tafsir": "On the other hand, disobedient people who remain in denial and disbelief are herded into hell. On the way to hell, they suffer various kinds of indescribable suffering, such as thirst and hunger because of the heat in the desert air. They are herded like lowly animals that are helpless not to a shady place or to a clear spring to quench thirst and thirst but to a very hot hell."
		   },
		   {
			"id": 2337,
			"surah": 19,
			"ayat": 87,
			"tafsir": "Unbelievers will not get intercession from anyone to help them or relieve their suffering. Because those who are entitled to receive intercession on that day are only those whom Allah has promised to receive intercession, namely believers who during their lifetime in the world have prepared themselves to receive intercession with their deeds of worship and their struggle to uphold the word of Allah. Intercession on that day is only owned by the prophets, scholars and martyrs according to their respective deeds and devotions. Among the acts of worship that make a person entitled to intercession is maintaining the five daily prayers as well as possible. The Messenger of Allah said, \"Whoever comes on the Day of Resurrection to bring his five daily prayers perfectly, namely perfected his ablution, kept his time, bowed and prostrated, never left anything behind, Allah promised not to torture him. But people who have left their prayers will not get Allah's promise. It is up to God whether He will give him mercy or inflict punishment on him.\" (Narrated by ath-thabrani in the book \"al-Ausath\" from Abu Hurairah)"
		   },
		   {
			"id": 2338,
			"surah": 19,
			"ayat": 88,
			"tafsir": "In this verse Allah confirms that those who say that Allah has their good children from Meccan polytheists, Jews, Christians or adherents of other religions, are people who are misguided because they have uttered very unpleasant remarks and have - invent a big lie against Allah. These words are very wrong, cannot be accepted by reason and are very contrary to the attributes of Allah, the One and Only, the Creator, the Almighty and the Almighty. Allah is very angry with them because the impudence of their mouths demeans the dignity of the Most High as if Allah is equated with humans and His other creatures who need offspring who will continue their existence in the future and who will help support them when they have become weak helpless. Even though He is the Eternal Life, always standing alone, not requiring help or assistance from other than Him, as stated in His word: Allah, there is no god but Him. The Ever-living One, Who is constantly taking care of (His creatures). (Ali 'Imran \/ 3: 2) Allah rebuked them severely and said that they had said something very wrong with such words, words that should not have come out of the mouths of His creatures which He himself created, his creatures who had been awarded His reason and mind so that he can distinguish between what is right and what is wrong."
		   },
		   {
			"id": 2339,
			"surah": 19,
			"ayat": 89,
			"tafsir": "In this verse Allah confirms that those who say that Allah has their good children from Meccan polytheists, Jews, Christians or adherents of other religions, are people who are misguided because they have uttered very unpleasant remarks and have - invent a big lie against Allah. These words are very wrong, cannot be accepted by reason and are very contrary to the attributes of Allah, the One and Only, the Creator, the Almighty and the Almighty. Allah is very angry with them because the impudence of their mouths demeans the dignity of the Most High as if Allah is equated with humans and His other creatures who need offspring who will continue their existence in the future and who will help support them when they have become weak helpless. Even though He is the Eternal Life, always standing alone, not requiring help or assistance from other than Him, as stated in His word: Allah, there is no god but Him. The Ever-living One, Who is constantly taking care of (His creatures). (Ali 'Imran \/ 3: 2) Allah rebuked them severely and said that they had said something very wrong with such words, words that should not have come out of the mouths of His creatures which He himself created, his creatures who had been awarded His reason and mind so that he can distinguish between what is right and what is wrong."
		   },
		   {
			"id": 2340,
			"surah": 19,
			"ayat": 90,
			"tafsir": "If the earth, the sky and the mountains could hear and understand the words of those disbelievers, even though he was not given a mind and mind by Allah, then the heavens, the earth and the great mountains would shake violently from shock and might become devastated, because they cannot accept words that are very heavy responsibility, and very insulting and demeaning to the dignity of their Creator. Fortunately, the earth, the heavens and the mountains cannot hear, let alone understand, the utterances of those disbelievers who are very wrong."
		   },
		   {
			"id": 2341,
			"surah": 19,
			"ayat": 91,
			"tafsir": "If the earth, the sky and the mountains could hear and understand the words of those disbelievers, even though he was not given a mind and mind by Allah, then the heavens, the earth and the great mountains would shake violently from shock and might become devastated, because they cannot accept words that are very heavy responsibility, and very insulting and demeaning to the dignity of their Creator. Fortunately, the earth, the heavens and the mountains cannot hear, let alone understand, the utterances of those disbelievers who are very wrong."
		   },
		   {
			"id": 2342,
			"surah": 19,
			"ayat": 92,
			"tafsir": "Allah in this verse argues with His words, \"It is not worthy of the Most Gracious God to adopt a child.\" Such was the answer of Allah, the Most Gracious, the Most Merciful, to the words of His servant, who was very angry with Him. He did not yell at and punish them directly, but answered them with words that should have been thought out deeply so that they would return to the truth and purify their Lord from all qualities that contradict His oneness and majesty."
		   },
		   {
			"id": 2343,
			"surah": 19,
			"ayat": 93,
			"tafsir": "In this verse, Allah also confirms that everything in the heavens and on earth, including angels, jinns and humans, will all come to the presence of Allah (his Lord) on the Day of Resurrection as servants, obedient and submissive to all the decisions and punishments that He decides. for each of his creatures. No one could dispute His judgment at that time because it was a fair verdict. There are those who are entitled to receive punishment and torment in accordance with the iniquities and crimes committed, there are also those who are entitled to receive rewards and rewards according to their piety and good deeds that have been cultivated."
		   },
		   {
			"id": 2344,
			"surah": 19,
			"ayat": 94,
			"tafsir": "Then Allah explained that all their deeds and piety had been recorded in a very thorough and detailed book, no one was spared in the record, all their deeds, both small and large. All their real and hidden words had been carefully written down and calculated and they were all waiting for what reply they would receive."
		   },
		   {
			"id": 2345,
			"surah": 19,
			"ayat": 95,
			"tafsir": "On the Day of Resurrection, the disbelievers come before the presence of Allah to receive calculations and decisions regarding their own actions, not accompanied by even the closest people, such as children or wives. Such is the provision that Allah has set for each of His servants on that day, no one can escape His judgment, everyone must face this great and terrible event with a feeling of anxiety, whether he will be included in the group of people -people who are wretched who will be herded into hell in a humiliating condition or belong to the group of happy people who will be invited to enter heaven with honor and glory."
		   },
		   {
			"id": 2346,
			"surah": 19,
			"ayat": 96,
			"tafsir": "This verse explains that Allah will instill compassion in the hearts of His fellow servants who are believers, pious and continue to do good deeds. This means that everyone who truly believes and always does good deeds will definitely get a good place in the heart of every Muslim. Even though a believer never tries to attract other people's hearts, that person is definitely attracted to him, because the instilled feeling of sympathy and affection for a believer is not only in the form of sweet mouths and kind words, but because Allah Himself instills that affection. into the breasts of His servants. In a hadith narrated by Abu Hurairah, the Messenger of Allah said: Indeed, Allah loves a servant of His. He called the Angel Gabriel then He said to him, \"Indeed I love so and so you should love him too.\" Then call (it) in the sky then fall on him compassion on earth. (Al-Bukhari, Muslim and at-Tirmidhi) Regarding this verse Ibn Mardawaih and ad-Dailami narrated from al-Bara' he said that the Messenger of Allah said to Ali Karramallahu wajhah: Say, \"O Allah, give me Your promise (so that I be saved in the hereafter) and instill in the hearts of those who believe love for me.\" Then come down this verse. (History of Ibn Mardawaih and ad-Dailami) Indeed, if we pay attention to human life in society, the truth of this verse will be proven. Every person who truly believes, is truly sincere in his good deeds, really works for the benefit of his people without expecting money, rank or position, and only hopes for Divine pleasure, surely that person is loved by his people even though he himself does not try to do good. that direction. If someone hates or is angry with him, surely the angry person is someone who has bad intentions, has no noble character and is tempted by the tricks of Satan and the Devil."
		   },
		   {
			"id": 2347,
			"surah": 19,
			"ayat": 97,
			"tafsir": "Allah explained that the Qur'an was revealed in Arabic, the language used by the Prophet Muhammad and his people was meant to make it easy for the Prophet to convey its contents and intentions and to be easily understood by his people, because it was to them that the message of Islam was conveyed first and then to them. all human beings from various ethnic groups and languages. The Qur'an, which contains warnings and good news, commands and prohibitions, aims to give guidance to humans to fear Allah, namely to believe in Him without associating Him with anything and obey His commands, stop His prohibitions and always seek His pleasure. His. Such people will be blessed by Allah for happiness in this world and in the hereafter. As for those who disbelieve in Him and belie His Messenger, they will receive a suitable reward for their denial and disobedience both in this world and in the hereafter. The denial of the peoples who used to be rewarded in this world by destroying and destroying them with various kinds of punishment, some in the form of a terrible earthquake, a hurricane, a loud thundering sound and so on, as was inflicted on the people of 'Ad, Samud and the people of Islam. Prophet Noah. Whereas for the people of Muhammad the torment in this world is not in the form of destruction and annihilation but by bringing down trials and calamities, with the hope that they will wake up and realize and then return to the truth. Revenge in the hereafter is to bestow His gifts on the believers who are pious by entering them into Jannatun Na'im heaven which is full of pleasures and pleasures and gets His love and pleasure. For those who disbelieve and disbelieve, a painful punishment is provided, namely hell. As proof of the truth of His threat. Allah explained that many rebellious former peoples were destroyed and some of their remains can still be seen and witnessed to this day and some have no trace at all. But what is clear is that these peoples have been destroyed and no one is left until now, there is only the news that people have passed down from generation to generation. News about them is narrated in the Qur'an clearly, so we must believe it because the source is the revelation of Allah."
		   },
		   {
			"id": 2348,
			"surah": 19,
			"ayat": 98,
			"tafsir": "Allah explained that the Qur'an was revealed in Arabic, the language used by the Prophet Muhammad and his people was meant to make it easy for the Prophet to convey its contents and intentions and to be easily understood by his people, because it was to them that the message of Islam was conveyed first and then to them. all human beings from various ethnic groups and languages. The Qur'an, which contains warnings and good news, commands and prohibitions, aims to give guidance to humans to fear Allah, namely to believe in Him without associating Him with anything and obey His commands, stop His prohibitions and always seek His pleasure. His. Such people will be blessed by Allah for happiness in this world and in the hereafter. As for those who disbelieve in Him and belie His Messenger, they will receive a suitable reward for their denial and disobedience both in this world and in the hereafter. The denial of the peoples who used to be rewarded in this world by destroying and destroying them with various kinds of punishment, some in the form of a terrible earthquake, a hurricane, a loud thundering sound and so on, as was inflicted on the people of 'Ad, Samud and the people of Islam. Prophet Noah. Whereas for the people of Muhammad the torment in this world is not in the form of destruction and annihilation but by bringing down trials and calamities, with the hope that they will wake up and realize and then return to the truth. Revenge in the hereafter is to bestow His gifts on the believers who are pious by entering them into Jannatun Na'im heaven which is full of pleasures and pleasures and gets His love and pleasure. For those who disbelieve and disbelieve, a painful punishment is provided, namely hell. As proof of the truth of His threat. Allah explained that many rebellious former peoples were destroyed and some of their remains can still be seen and witnessed to this day and some have no trace at all. But what is clear is that these peoples have been destroyed and no one is left until now, there is only the news that people have passed down from generation to generation. News about them is narrated in the Qur'an clearly, so we must believe it because the source is the revelation of Allah."
		   }
	]
}
