{
	"tafseer": [
		{
			"id": 5830,
			"surah": 82,
			"ayat": 1,
			"tafsir": "These verses describe the chaos that will ensue on the Day of Judgment and the destruction of the universe. The phenomenon of the destruction of nature is described by the splitting of the heavens so that the formation of the universe becomes chaotic. The stars fell scattered, no longer in position. Even though Allah informs us that the sun has a certain position which is the center of its rotation, and so does the moon. Allah's Word: So pay attention to the traces of Allah's mercy, how Allah revives the earth after it is dead (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30: 50) Another phenomenon is the overflowing oceans drowning all the land. Fresh water mixed with salt water, there is no more land that can be inhabited by living things, let alone sea water that overflows to heat. Truly the earth has changed, it is no longer the earth that is commonly known by humans. (That is) on the day (when) the earth is replaced by another earth and (so does) the sky, and they (humans) gather (in Padang Mahsyar) to face Allah, the One and Only, the Almighty. (Ibrahim\/14: 48) For a scientific study of surahh al-Infithar\/82:1-3, see also a scientific study of surahh al-haqqah\/69: 13-16; al-Ma'arij\/70: 8, and at-Takwir\/81: 1-3. When there is a process towards the Big Crunch, namely the process of condensing or shrinking the universe, then all matter breaks back into fundamental matter such as quarks, electrons and so on, forces such as gravitational, electromagnetic, strong nuclear and weak nuclear forces begin to unite. return. The space sky begins to weaken because there is no support for gravity, and begins to shrink\/shrink and crack\/split. That's when celestial bodies, including stars that are starting to lose their gravitational forces, collide with each other. This is the image of 'the stars falling apart, because they have lost their gravitational forces, and because they decompose again or decay into their fundamental matter. According to Bashiruddin, when the sun has evolved to swell and become red (see the scientific study of surahh at-Takwir\/81: 1-3), the earth's temperature will rise, until sea water reaches its boiling point. The heat of the earth by this red solar radiation, is very likely to melt the icebergs in the Arctic (North Pole) and Antarctic ice continent (South Pole), so that the oceans will overflow violently, drowning many islands. This sea water will then boil and evaporate and disappear from the earth. Earth becomes uninhabitable. Paul Davies says that when the universe had compressed to one-hundredth (1\/100th) of its present size, the effect of pressure would have caused the temperature to rise until it reached the boiling point of liquid matter; and the earth became an uninhabitable place."
		   },
		   {
			"id": 5831,
			"surah": 82,
			"ayat": 2,
			"tafsir": "These verses describe the chaos that will ensue on the Day of Judgment and the destruction of the universe. The phenomenon of the destruction of nature is described by the splitting of the heavens so that the formation of the universe becomes chaotic. The stars fell scattered, no longer in position. Even though Allah informs us that the sun has a certain position which is the center of its rotation, and so does the moon. Allah's Word: So pay attention to the traces of Allah's mercy, how Allah revives the earth after it is dead (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30: 50) Another phenomenon is the overflowing oceans drowning all the land. Fresh water mixed with salt water, there is no more land that can be inhabited by living things, let alone sea water that overflows to heat. Truly the earth has changed, it is no longer the earth that is commonly known by humans. (That is) on the day (when) the earth is replaced by another earth and (so does) the sky, and they (humans) gather (in Padang Mahsyar) to face Allah, the One and Only, the Almighty. (Ibrahim\/14: 48) For a scientific study of surahh al-Infithar\/82:1-3, see also a scientific study of surahh al-haqqah\/69: 13-16; al-Ma'arij\/70: 8, and at-Takwir\/81: 1-3. When there is a process towards the Big Crunch, namely the process of condensing or shrinking the universe, then all matter breaks back into fundamental matter such as quarks, electrons and so on, forces such as gravitational, electromagnetic, strong nuclear and weak nuclear forces begin to unite. return. The space sky begins to weaken because there is no support for gravity, and begins to shrink\/shrink and crack\/split. That's when celestial bodies, including stars that are starting to lose their gravitational forces, collide with each other. This is the image of 'the stars falling apart, because they have lost their gravitational forces, and because they decompose again or decay into their fundamental matter. According to Bashiruddin, when the sun has evolved to swell and become red (see the scientific study of surahh at-Takwir\/81: 1-3), the earth's temperature will rise, until sea water reaches its boiling point. The heat of the earth by this red solar radiation, is very likely to melt the icebergs in the Arctic (North Pole) and Antarctic ice continent (South Pole), so that the oceans will overflow violently, drowning many islands. This sea water will then boil and evaporate and disappear from the earth. Earth becomes uninhabitable. Paul Davies says that when the universe had compressed to one-hundredth (1\/100th) of its present size, the effect of pressure would have caused the temperature to rise until it reached the boiling point of liquid matter; and the earth became an uninhabitable place."
		   },
		   {
			"id": 5832,
			"surah": 82,
			"ayat": 3,
			"tafsir": "These verses describe the chaos that will ensue on the Day of Judgment and the destruction of the universe. The phenomenon of the destruction of nature is described by the splitting of the heavens so that the formation of the universe becomes chaotic. The stars fell scattered, no longer in position. Even though Allah informs us that the sun has a certain position which is the center of its rotation, and so does the moon. Allah's Word: So pay attention to the traces of Allah's mercy, how Allah revives the earth after it is dead (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30: 50) Another phenomenon is the overflowing oceans drowning all the land. Fresh water mixed with salt water, there is no more land that can be inhabited by living things, let alone sea water that overflows to heat. Truly the earth has changed, it is no longer the earth that is commonly known by humans. (That is) on the day (when) the earth is replaced by another earth and (so does) the sky, and they (humans) gather (in Padang Mahsyar) to face Allah, the One and Only, the Almighty. (Ibrahim\/14: 48) For a scientific study of surahh al-Infithar\/82:1-3, see also a scientific study of surahh al-haqqah\/69: 13-16; al-Ma'arij\/70: 8, and at-Takwir\/81: 1-3. When there is a process towards the Big Crunch, namely the process of condensing or shrinking the universe, then all matter breaks back into fundamental matter such as quarks, electrons and so on, forces such as gravitational, electromagnetic, strong nuclear and weak nuclear forces begin to unite. return. The space sky begins to weaken because there is no support for gravity, and begins to shrink\/shrink and crack\/split. That's when celestial bodies, including stars that are starting to lose their gravitational forces, collide with each other. This is the image of 'the stars falling apart, because they have lost their gravitational forces, and because they decompose again or decay into their fundamental matter. According to Bashiruddin, when the sun has evolved to swell and become red (see the scientific study of surahh at-Takwir\/81: 1-3), the earth's temperature will rise, until sea water reaches its boiling point. The heat of the earth by this red solar radiation, is very likely to melt the icebergs in the Arctic (North Pole) and Antarctic ice continent (South Pole), so that the oceans will overflow violently, drowning many islands. This sea water will then boil and evaporate and disappear from the earth. Earth becomes uninhabitable. Paul Davies says that when the universe had compressed to one-hundredth (1\/100th) of its present size, the effect of pressure would have caused the temperature to rise until it reached the boiling point of liquid matter; and the earth became an uninhabitable place."
		   },
		   {
			"id": 5833,
			"surah": 82,
			"ayat": 4,
			"tafsir": "And when the graves are opened so that the corpses that are in them come out after being resurrected and revived to be accountable for their deeds in the world before Allah the Creator. This is reaffirmed in another word of Allah: Then does he not know when what is in the grave is brought out. (al-'Adiyat\/100: 9)"
		   },
		   {
			"id": 5834,
			"surah": 82,
			"ayat": 5,
			"tafsir": "Humans are burdened with the responsibility to do good in the world, but there are those among them who are negligent and do not carry out their obligations, and some even commit acts that are prohibited. In this verse, Allah swears by the graves that are dismantled and the corpses that are in them come out, resurrected, and revived to be tried and their deeds will be accounted for while living in this world. On the Day of Resurrection, people will know their deeds, good and bad, those they did or those they neglected. They know this from the book that was handed over to them, as Allah says: And every human being We have tied (the record) of his deeds around his neck. And on the Day of Resurrection We will bring out for him an open Book. \"Read your book, suffice yourself today as your counter.\" (al-Isra'\/17: 13-14) This verse encourages humans to always obey Allah, do good deeds, and leave all immoral acts that will harm them in the afterlife."
		   },
		   {
			"id": 5835,
			"surah": 82,
			"ayat": 6,
			"tafsir": "In this verse, Allah denounces people who disbelieve, are deceived, and dare to do things that are forbidden by Allah. In fact, Allah is Most Gracious with the various gifts He has bestowed on humans, such as abundant sustenance, good and pious offspring, bodily health, and so on. They should be grateful in return for God's mercy, not do otherwise. Allah's warning not to be deceived by anything so that you are not compelled to act arrogantly towards Him is reiterated in His words: So never be deceived by the life of this world, and do not be deceived by deceivers in (obeying) Allah. (Luqman\/31: 33)"
		   },
		   {
			"id": 5836,
			"surah": 82,
			"ayat": 7,
			"tafsir": "Allah again reminds humans of all His generosity, by mentioning His creation in humans. Allah has made the human body balanced, standing upright and proud, not like animals with four legs or creeping things. Allah also created all members of the human body to work in an orderly, harmonious and balanced manner. Allah says that the creation of humans is the best creation of creatures. Allah says: Indeed, We have created man in the best form. (at-Tin\/95: 4)"
		   },
		   {
			"id": 5837,
			"surah": 82,
			"ayat": 8,
			"tafsir": "In this verse, Allah mentions that human beings were created according to His will. There are people who are white, yellow, black, olive, and others. There are people with straight hair, curly, black, blonde, brown, and so on. There are also people who are tall, slim, tall, short, small, and so on. However, it is worth remembering that even though humans have basically the same nature and form, there are still differences between one person and another. (In fact) We were able to rearrange his fingers perfectly. (al-Qiyamah\/75: 4) Scientific review verses-7-8: Allah has made the composition of the human body balanced. If we look at the morphology (shape of the human physical body) from the front, the balance will be very clear. Human morphology looks symmetrical and balanced if we draw the center line from the head, -through the midpoint-, down to the bottom, you will see the balance of the physical composition of the human body. The left and right hemispheres are mirror images of one another. Each hemisphere has one eye, one ear, one nostril, one ear, one hand, and one leg, one hemisphere with the other, is a balanced symmetrical mirror image. Allah has bestowed a nervous system on humans, which functions to regulate the balance and balance of the human body, as well as the human ability to orient in 3-dimensional space. The nervous system that regulates human balance is in the human Peripheral Nervous System (CNS). In the CNS there is a nervous system that regulates the balance of the human body, which is known as the VIIIth nerve, or also called the Vestibulocochlear nerve (front \"snail-ear\" nerve). This VIII nerve has a function for balance, equillibrium, and orientation in three-dimensional space, (Nerves and Nervous Systems in The New Encyclopaedia Britannica, Vol. 24, Macropaedia , 2005, p. 817). In the physiological (physiological) mechanism of humans, Allah has also equipped humans with two nervous systems, in which one balances one another. Within the CNS there is also an Autonomous Nervous System consisting of the Sympathetic Nervous System (SNS) and the Parasympathetic Nervous System (PNS), both of which work antagonistically, yet balance one another. The function of the SNS is to respond to the stressful conditions faced by humans, by releasing hormones (neurotransmitters), adrenaline (epinephrine), and noradrenaline (norepinephrine). In the presence of these two hormones, blood pressure rises, heart rate increases rapidly (tachy-cardia), blood vessels dilate (skeletal muscle vasodilatation), blood vessels in the stomach and intestines narrow (gastrointestinal vasoconstriction), pupils dilate (puppillary dilatation), enlarged lungs (broncheal dilatation). While the PSN function is the opposite of the SNS earlier. PNS will release a hormone (neurotransmitter): acetylcholine. The presence of this hormone will cause: decreased blood pressure, slow heart rate (brady-cardia), narrowed pupils. These two nervous systems: SNS and PNS work complementary to each other, for the passage of human physiological (physiological) processes, to maintain its survival. (Nerves and Nervous Systems in The New Encyclopaedia Britannica, Vol. 24, Macropaedia, 2005, pp. 818-820). Balance is also found in the structure of the human brain. In the human brain there are two pairs of hemispheres or sides of the brain, each of which forms a mirror image. The dominant hemisphere, often called the 'left hemisphere', is used to record or store things related to: language, mathematics, and analytical functions and skills. While the non-dominant hemisphere, often called the right hemisphere, is used to record or store things related to simple spatial concepts, music, visual recognition, and emotions. The two hemispheres of the brain are balanced and complementary, and the two hemispheres are connected by many projection nerves through the corpus callosum. (Nerves and Nervous Systems in The New Encyclopaedia Britannica, Vol. 24, Macropaedia, 2005, p. 805)."
		   },
		   {
			"id": 5838,
			"surah": 82,
			"ayat": 9,
			"tafsir": "This verse explains the consequences of the actions of humans who are deceived so they dare to do things that are forbidden by Allah. Their actions do not stop at this crime, but they even belie the Day of Judgment, where the good and bad deeds of humans will be rewarded in the hereafter. Not believing in the Day of Judgment means that people don't need to be responsible, so they can do whatever they want. Not believing in the day of reckoning is contrary to the purpose of human creation (see surahh al-Baqarah\/2: 30 and adh-dzariyat\/51\/: 56) so that Allah asks humans what their true understanding of their own creation is. Allah's Word: So do you think that We created you playfully (without any intention) and that you will not be returned to Us? (al-Mu'minun\/23: 115)"
		   },
		   {
			"id": 5839,
			"surah": 82,
			"ayat": 10,
			"tafsir": "These verses give a warning to unbelievers who do not believe in the day of resurrection so that they do not continue to be negligent and disbelieving and not prepare to prepare for the day of reckoning because they think that no one is watching their behavior and actions. Allah explains in this verse that there are angels who are given the task of overseeing and recording all human actions, both bad and good, and those that are done openly or secretly. This noble angel records all human deeds. In the Qur'an, these angels are called Raqib and 'Atid. Allah said: (Remember) when two angels recorded (his actions), one sat on the right and the other on the left. There is not a single word he utters but there is a guardian angel by his side who is always ready (to take notes). (Qaf\/50: 17-18) The angels know what humans do and record it. There is no information in the Qur'an how the angels recorded it, but we believe Allah has a system and a way that goes beyond human capabilities in recording this data."
		   },
		   {
			"id": 5840,
			"surah": 82,
			"ayat": 11,
			"tafsir": "These verses give a warning to unbelievers who do not believe in the day of resurrection so that they do not continue to be negligent and disbelieving and not prepare to prepare for the day of reckoning because they think that no one is watching their behavior and actions. Allah explains in this verse that there are angels who are given the task of overseeing and recording all human actions, both bad and good, and those that are done openly or secretly. This noble angel records all human deeds. In the Qur'an, these angels are called Raqib and 'Atid. Allah said: (Remember) when two angels recorded (his actions), one sat on the right and the other on the left. There is not a single word he utters but there is a guardian angel by his side who is always ready (to take notes). (Qaf\/50: 17-18) The angels know what humans do and record it. There is no information in the Qur'an how the angels recorded it, but we believe Allah has a system and a way that goes beyond human capabilities in recording this data."
		   },
		   {
			"id": 5841,
			"surah": 82,
			"ayat": 12,
			"tafsir": "These verses give a warning to unbelievers who do not believe in the day of resurrection so that they do not continue to be negligent and disbelieving and not prepare to prepare for the day of reckoning because they think that no one is watching their behavior and actions. Allah explains in this verse that there are angels who are given the task of overseeing and recording all human actions, both bad and good, and those that are done openly or secretly. This noble angel records all human deeds. In the Qur'an, these angels are called Raqib and 'Atid. Allah said: (Remember) when two angels recorded (his actions), one sat on the right and the other on the left. There is not a single word he utters but there is a guardian angel by his side who is always ready (to take notes). (Qaf\/50: 17-18) The angels know what humans do and record it. There is no information in the Qur'an how the angels recorded it, but we believe Allah has a system and a way that goes beyond human capabilities in recording this data."
		   },
		   {
			"id": 5842,
			"surah": 82,
			"ayat": 13,
			"tafsir": "This verse explains the results or consequences of recording human deeds, namely the reward and heaven for those who do good, and the punishment for those who commit immorality and sins. Paradise is the reward for those who are pious and do good deeds. Allah says: And as for those who fear the greatness of their Lord and refrain from (desires) their lusts, then verily, heaven is (his) abode. (an-Nazi'at\/79: 40-41) Meanwhile, those who are disobedient will be punished by Allah in the fires of hell. Allah says: So as for those who transgress the limits, and prioritize the life of the world, then indeed, hell is his place of residence. (an-Nazi'at\/79: 37-39)"
		   },
		   {
			"id": 5843,
			"surah": 82,
			"ayat": 14,
			"tafsir": "This verse explains the results or consequences of recording human deeds, namely the reward and heaven for those who do good, and the punishment for those who commit immorality and sins. Paradise is the reward for those who are pious and do good deeds. Allah says: And as for those who fear the greatness of their Lord and refrain from (desires) their lusts, then verily, heaven is (his) abode. (an-Nazi'at\/79: 40-41) Meanwhile, those who are disobedient will be punished by Allah in the fires of hell. Allah says: So as for those who transgress the limits, and prioritize the life of the world, then indeed, hell is his place of residence. (an-Nazi'at\/79: 37-39)"
		   },
		   {
			"id": 5844,
			"surah": 82,
			"ayat": 15,
			"tafsir": "Allah explains once again that those who are disobedient will be put into hell on the Day of Resurrection. That's the worst place to come back. Allah says: And those who disbelieve in their Lord will receive the punishment of Hell. And that's the worst place to come back. (al-Mulk\/67: 6) They will remain in hell forever. They didn't have the ability to get themselves out of that place because there was no other helper who could help them. Allah says: They want to get out of hell, but will not be able to get out of there. And they will get eternal punishment. (al-Ma'idah\/5: 37)"
		   },
		   {
			"id": 5845,
			"surah": 82,
			"ayat": 16,
			"tafsir": "Allah explains once again that those who are disobedient will be put into hell on the Day of Resurrection. That's the worst place to come back. Allah says: And those who disbelieve in their Lord will receive the punishment of Hell. And that's the worst place to come back. (al-Mulk\/67: 6) They will remain in hell forever. They didn't have the ability to get themselves out of that place because there was no other helper who could help them. Allah says: They want to get out of hell, but will not be able to get out of there. And they will get eternal punishment. (al-Ma'idah\/5: 37)"
		   },
		   {
			"id": 5846,
			"surah": 82,
			"ayat": 17,
			"tafsir": "In verses 17 and 18, Allah asks the Prophet and his people if they know what the day of judgment is? This question is not asking for an answer, but a reproach for those who do not want to believe in this day of judgment. Are all the information and signs that the Qur'an provides not enough to make them believe? Allah then explains in verse 19 that on the day of reckoning no human can help others. Parents cannot help their children and vice versa. Husbands cannot help their wives, and friends or friends cannot help their friends. Everyone is busy with themselves. All matters on that day will be in the hands of Allah. The only thing that can help people is charity. Allah's Word: And that man only gets what he has worked for, and indeed his efforts will be shown (to him). (an-Najm\/53: 39-40) And His word again: And there is no (again) for him any group that can help him besides Allah; nor will he be able to defend himself. (al-Kahf\/18: 43)"
		   },
		   {
			"id": 5847,
			"surah": 82,
			"ayat": 18,
			"tafsir": "In verses 17 and 18, Allah asks the Prophet and his people if they know what the day of judgment is? This question is not asking for an answer, but a reproach for those who do not want to believe in this day of judgment. Are all the information and signs that the Qur'an provides not enough to make them believe? Allah then explains in verse 19 that on the day of reckoning no human can help others. Parents cannot help their children and vice versa. Husbands cannot help their wives, and friends or friends cannot help their friends. Everyone is busy with themselves. All matters on that day will be in the hands of Allah. The only thing that can help people is charity. Allah's Word: And that man only gets what he has worked for, and indeed his efforts will be shown (to him). (an-Najm\/53: 39-40) And His word again: And there is no (again) for him any group that can help him besides Allah; nor will he be able to defend himself. (al-Kahf\/18: 43)"
		   },
		   {
			"id": 5848,
			"surah": 82,
			"ayat": 19,
			"tafsir": "In verses 17 and 18, Allah asks the Prophet and his people if they know what the day of judgment is? This question is not asking for an answer, but a reproach for those who do not want to believe in this day of judgment. Are all the information and signs that the Qur'an provides not enough to make them believe? Allah then explains in verse 19 that on the day of reckoning no human can help others. Parents cannot help their children and vice versa. Husbands cannot help their wives, and friends or friends cannot help their friends. Everyone is busy with themselves. All matters on that day will be in the hands of Allah. The only thing that can help people is charity. Allah's Word: And that man only gets what he has worked for, and indeed his efforts will be shown (to him). (an-Najm\/53: 39-40) And His word again: And there is no (again) for him any group that can help him besides Allah; nor will he be able to defend himself. (al-Kahf\/18: 43)"
		   }
	]
}
