{
	"tafseer": [
		{
			"id": 4847,
			"surah": 54,
			"ayat": 1,
			"tafsir": "Allah states that the Day of Judgment is nearing, when the life of the world will end. In another verse that is the same as what Allah means by saying: Allah's decree will surely come, so do not ask for it to be hastened. (an-Nahl\/16: 1) Allah says: People are getting closer to the calculation of their deeds, while they are in a state of neglect (with the world), turning away (from the hereafter). (al-Anbiya'\/21: 1) At that time the moon will split into pieces as a result of deviations from its circulation, as stated in other verses which simultaneously mean: When the sky is split open. (al-Insyiqaq\/84: 1) And His words: When the sun is rolled up, and when the stars fall. (at-Takwir\/81: 1-2) There are many other verses that show the very terrible events that will occur when the world is destroyed with the arrival of the Day of Judgment. Most commentators are of the opinion that the incident in the first verse has occurred and the moon was split in two at the time of the Prophet Muhammad, five years before he migrated. According to the hadith narrated by al-Bukhari, Muslim and Ibn Jarir from Anas bin Malik that the people of Mecca asked the Prophet Muhammad to put forward a miracle as proof of his apostleship, so Allah showed them the moon split in two, so they saw \"Jabal Nur\" was between the two halves of the moon. It was also narrated from Sahih al-Bukhari, Muslim and other hadith narrators from Ibn Mas'ud that: \"The moon was split during the time of the Prophet Muhammad, into two halves, one side was on the hill and the other was under it, while the Prophet Muhammad peace be upon him shouted, \"Watch!\" Abu Dawud also narrated that, \"There was a division of the moon during the time of the Prophet Muhammad, so the Quraysh said, \"This is the magic of Abu Kabsyah's son.\" Then one of them said, \"Wait first for the news brought by the arriving travelers, because Muhammad saw was unable to enchant all humans.\" Then came the travelers bringing the news of the incident. Then in al-Baihaqi's narration there is an addition, \"Then they asked the travelers who came from all over, their answer was, \"Indeed we have seen it,\" then Allah sent down this verse, \"The time has come and the moon has split .\" The commentators differ on the splitting of the moon. Some argue that the moon was indeed split open during the time of the Prophet as part of his miracle. But some commentators believe that the splitting of the moon did not occur during the time of the prophet, but will occur later on the Day of Judgment. this is due to the loss of the balance of attraction between the planets.("
		   },
		   {
			"id": 4848,
			"surah": 54,
			"ayat": 2,
			"tafsir": "The polytheists saw a proof of the truth of Muhammad's apostleship, so they turned and denied and denied it, saying that, \"This is magic that fascinates us which he will continue to do.\" Thus if there is no faith, then even though their minds can accept the truth of the Qur'an and empirically seen in the deeds and behavior of the Prophet that proves his apostleship, they still deny the truth that is in front of their eyes. ("
		   },
		   {
			"id": 4849,
			"surah": 54,
			"ayat": 3,
			"tafsir": "The polytheists denied the truth conveyed to them by the Prophet Muhammad, and followed their desires because of their ignorance. At the end of this verse it is emphasized that something will stop at a predetermined target, according to God's decree. Because of that the problems of polytheists will end with humiliation in this world and eternal punishment in the hereafter, while your problems, O Muhammad saw, will end with victory in this world and heaven in the hereafter."
		   },
		   {
			"id": 4850,
			"surah": 54,
			"ayat": 4,
			"tafsir": "The polytheists who denied Muhammad's apostleship and followed their desires, have known several stories about earlier peoples who denied the apostles, so that Allah sent down punishment on them, as stated in the Qur'an. However, these stories did not leave an impression on their hearts and could not prevent disbelief, then Allah destroyed them, while in the hereafter they will be tormented according to the shirk that has adorned their souls."
		   },
		   {
			"id": 4851,
			"surah": 54,
			"ayat": 5,
			"tafsir": "The story contains wisdom that is of very high value in guiding people to the right path, but the wisdom and warnings contained in these stories are no longer useful to them because their consciences have been locked away. Allah's Word: Signs (of Allah's greatness) and messengers do not benefit those who do not believe. (Yunus\/10: 101)"
		   },
		   {
			"id": 4852,
			"surah": 54,
			"ayat": 6,
			"tafsir": "Allah ordered His messenger not to hold a debate with polytheists, because there is no benefit. Therefore, turn away from them, the liars. Since they have gotten to the level of not willing to submit to evidence and the truth, it is proper for you not to give them any more advice. Allah knows that Rasulullah SAW was not bored with their problems and irritated because of their arrogance. Allah reminds people that there will be a resurrection day, on that day the angels will summon people to come to a place that is very dangerous and hated by polytheists, namely Padang Mahsyar."
		   },
		   {
			"id": 4853,
			"surah": 54,
			"ayat": 7,
			"tafsir": "They will come out of the grave with their eyes down, because they are unable to see the awesomeness that happened that day, and when they come out of the grave together, they rush to the place of reckoning according to the call, like locusts that fly in the air. In another verse with the same meaning, Allah says: On that day, humans will be like flying moths. (alQari'ah\/101: 4)"
		   },
		   {
			"id": 4854,
			"surah": 54,
			"ayat": 8,
			"tafsir": "They immediately came to meet the call, no one opposed the call, no one was late in fulfilling it, as they said, \"This is a very dangerous day and a doomed place.\" Allah's Word: So that is a very difficult day, for the disbelievers it is not easy. (al-Muddatstsir\/74: 9-10)"
		   },
		   {
			"id": 4855,
			"surah": 54,
			"ayat": 9,
			"tafsir": "Before the people of Prophet Muhammad saw, Noah's people had denied Prophet Noah's apostleship. They belied Noah's apostleship and even accused him of being crazy and threatened and frightened Noah to stop his preaching, otherwise they would stone him."
		   },
		   {
			"id": 4856,
			"surah": 54,
			"ayat": 10,
			"tafsir": "Prophet Noah prayed to Allah that he was powerless against the threats of his people, and asked Allah to help him. Prophet Noah's prayer is found in surahh Nuh\/71: 26-28, that Prophet Noah begged Allah to destroy the disbelievers, because they will only lead people astray and will give birth to disobedient and disbelieving people. Besides that, Prophet Noah also asked for forgiveness for both parents and believers. This was done after Prophet Noah learned of their denial and almost tired of Prophet Noah in conveying his message. God's Word: And Noah said, \"O my Lord, do not let any of the disbelievers live on the earth. Verily, if You let them stay, they will surely lead Your servants astray, and they will only give birth to children who are evil and ungrateful. O my Lord, forgive me, my parents, and anyone who enters my house with faith and all men who believe male and female. And do not add to those who are wrongdoers other than destruction.\" (Noah\/71: 26-28)"
		   },
		   {
			"id": 4857,
			"surah": 54,
			"ayat": 11,
			"tafsir": "Allah granted Noah's prayer by pouring out a lot of water from the sky and lasted for years."
		   },
		   {
			"id": 4858,
			"surah": 54,
			"ayat": 12,
			"tafsir": "Besides that, from within the earth, Allah emits springs on its surface, then the two waters meet, namely water that is sent down from the sky and water that is emitted from the earth, there is a great flood as has been determined by Allah. This verse describes the events of the flood at the time of Prophet Noah. However, if the first words in the sentence above are connected with the statement in the previous ayat, then both of them will show the water cycle. This passage about the water cycle explains that rainwater falls and the earth emits it again in the form of springs."
		   },
		   {
			"id": 4859,
			"surah": 54,
			"ayat": 13,
			"tafsir": "Allah saved Prophet Noah from a great flood by ordering Noah and his followers to board a large ship made of nailed boards that had been prepared beforehand. The meaning of this verse is in line with Allah's word in surahh al-'Ankabut: So We saved Noah and those who were on the ship. (al-'Ankabut\/29: 15)"
		   },
		   {
			"id": 4860,
			"surah": 54,
			"ayat": 14,
			"tafsir": "Even though the typhoon was very powerful accompanied by very heavy rain and waves of water like a large mountain, the ship sailed safely under Allah's supervision as a reply to his prayer, as informed in another verse. And the ship sailed with them into the waves like the mountains. And Noah called his son, when he (the child) was in a remote place, \"O my son! Get on (to the ship) with us and do not be with the disbelievers.\" (Hud\/11:42)"
		   },
		   {
			"id": 4861,
			"surah": 54,
			"ayat": 15,
			"tafsir": "Disaster events for Noah's people were made by God as a lesson for humans of all time. So that they can defend the truth and destroy the falsehood that denies the messengers of Allah. The ark landed on the hill \"Gambling.\" (Name of Mountain in Kurdistan region) And it was said, \"O earth! Swallow your water and O sky (rain!) stop.\" And the waters were turned back, and orders were completed and the ship came to rest on Mount Judi, and it was said, \"Perish the unjust.\" (Hud\/11: 44) In another verse the incident is stated: Indeed, when the water rose (up to the mountain), We brought your (ancestors) into the ship, so that We would make it (the incident) as a warning for you and so that it would be noticed by ears that want to hear. (al-haqqah\/69: 11-12) Furthermore, at the end of this verse Allah asks, \"are there still people who want to remember and contemplate that incident to be used as a lesson.\" This means that the event needs to be contemplated and remembered for all time to increase faith and piety."
		   },
		   {
			"id": 4862,
			"surah": 54,
			"ayat": 16,
			"tafsir": "Allah warns those who disobey and deny the apostles and do not take responsibility for the enormity of God's torment and his threats aimed at people who do not heed the calls of the apostles"
		   },
		   {
			"id": 4863,
			"surah": 54,
			"ayat": 17,
			"tafsir": "Allah sent down the Qur'an which is easy to read and understand to be used as a lesson for people who want to make it a lesson, therefore humans should have faith in it and practice it. In another verse it is stated that the Al-Qur'an is only beneficial for believers, because they carry it out: And keep on giving warnings, because actually these warnings are beneficial for believers. (adh-dzariyat\/51: 55) And as He says: The Book (Al-Qur'an) that We sent down to you is full of blessings so that they live up to its verses and so that people with common sense can learn a lesson. (shad\/38: 29) So indeed, We have made it easy (the Qur'an) in your language (Muhammad), so that with it you can give glad tidings to those who fear Allah, and so that you can warn people who disobey. (Maryam\/19: 97) The Qur'an is easy to understand and implement, because the Prophet saw explained and exemplified its implementation. The contents of the Qur'an are glad tidings for those who are pious and a warning for those who disobey, therefore humans should be pious by practicing them and not denying them, because they will become losers."
		   },
		   {
			"id": 4864,
			"surah": 54,
			"ayat": 18,
			"tafsir": "In this verse Allah states that the people of 'Ad considered their prophet and the message he brought to them was a lie. To the people who denied the apostles, Allah has delivered a warning and sent down a very terrible punishment. This should be used as a reference by people who come later."
		   },
		   {
			"id": 4865,
			"surah": 54,
			"ayat": 19,
			"tafsir": "This verse explains that Allah released a very powerful typhoon that roared. This is Allah's punishment for the people of 'Ad at a time when they were wallowing in sin and disobedience. This incident occurred for seven nights and eight days continuously as informed in another verse: (Fussilat\/41: 16) And His words: Allah sent down the wind on them for seven nights and eight continuous days. (al-haqqah\/69: 7)"
		   },
		   {
			"id": 4866,
			"surah": 54,
			"ayat": 20,
			"tafsir": "In this verse it is stated that the wind threw them and then threw them down head first because so hard their heads were cut off and their bodies were lying around like date palm trees that were uprooted and scattered because they were uprooted by a storm. Such is the severity of the storm that can topple their massive bodies as stated in His words: The people are stronger than they (themselves) and they have cultivated the earth (soil) and prospered it beyond what they had prospered. (ar-Rum\/30:9)"
		   },
		   {
			"id": 4867,
			"surah": 54,
			"ayat": 21,
			"tafsir": "Allah again states, how great is His punishment and His warning. This statement shows that God himself views this event as great. In another verse it is stated that Allah's punishment is very severe: We want them to feel humiliating torments in life in this world. Meanwhile, the punishment in the hereafter will be more humiliating and they will not be given any help. (Fussilat\/41: 16)"
		   },
		   {
			"id": 4868,
			"surah": 54,
			"ayat": 22,
			"tafsir": "Allah also reaffirms that the Qur'an is easy to understand and take as a warning because Allah gives clear examples in it, therefore humans should have faith in it in carrying out the teachings contained in it so that they will be happy in this world and in the hereafter."
		   },
		   {
			"id": 4869,
			"surah": 54,
			"ayat": 23,
			"tafsir": "In this verse, Allah explains that the Samud people consider lies the warnings conveyed by their prophet Nabi Saleh, namely monotheism of Allah, faith in the apostles and the Day of Judgment."
		   },
		   {
			"id": 4870,
			"surah": 54,
			"ayat": 24,
			"tafsir": "They considered Prophet Saleh to be lying, because in their view, it is impossible for a new teaching taught by one person to be truer than the teachings that have been followed by all people and have been accepted since their ancestors. They see that following one person who brings other teachings from the teachings they received from their ancestors will make them go astray and go crazy."
		   },
		   {
			"id": 4871,
			"surah": 54,
			"ayat": 25,
			"tafsir": "Furthermore, they argued that it was impossible for the revelation to be revealed to someone, namely Prophet Saleh, while he was an ordinary human being. Why is the revelation not revealed to their leaders who are powerful, respected, wealthy, and so on. Therefore, in their view, Prophet Saleh lied and only boasted. ("
		   },
		   {
			"id": 4872,
			"surah": 54,
			"ayat": 26,
			"tafsir": "Allah vehemently refutes their views by declaring that in the near future they will find out who really is lying and arrogant"
		   },
		   {
			"id": 4873,
			"surah": 54,
			"ayat": 27,
			"tafsir": "Allah explained that he fulfilled their request to transform a she-camel from a large rock according to their request, as a miracle of Prophet Saleh. They asked for such a miracle because they were renowned as great stonecutters and the rocks were their abode. The female camel that was embodied from a mountain rock was made by Allah as a test for the people of Prophet Saleh. The place where they live is now near Mada'in, an area between the Hijaz and Syria. At the end of this verse Allah ordered Prophet Saleh to wait for what they will do, whether they believe or they remain unbelievers. And so that Prophet Saleh will be patient with their disturbances until God's provision comes, because God continues to defend truth and destroy falsehood."
		   },
		   {
			"id": 4874,
			"surah": 54,
			"ayat": 28,
			"tafsir": "Allah ordered Prophet Saleh to inform his people about the distribution of well water between them and the camels, namely one day for the female camels and one day for them. Each of them came in turn to collect the water from the well. ("
		   },
		   {
			"id": 4875,
			"surah": 54,
			"ayat": 29,
			"tafsir": "Allah explained that finally the Samud people objected to such a distribution and wanted to kill the camel. They then called one of their people who was known to be very cruel, his name was Kudar bin Salif and chopped up the camel."
		   },
		   {
			"id": 4876,
			"surah": 54,
			"ayat": 30,
			"tafsir": "Allah again explains how great is Allah's punishment and His threats. They had been warned of threats and calamities, but they paid no heed"
		   },
		   {
			"id": 4877,
			"surah": 54,
			"ayat": 31,
			"tafsir": "The doom in this verse is saihah. As already explained in the vocabulary of surahh Hud\/11: 67, saihah is rajfah (great earthquake) and saiqah (lightning that strikes). Thus the punishment they receive is thunder that thunders accompanied by a terrible earthquake. The lightning scorched their bodies so that they died burning and dry like grass that died dry because of drought. ("
		   },
		   {
			"id": 4878,
			"surah": 54,
			"ayat": 32,
			"tafsir": "This is the explanation of the Qur'an about the earlier people. The explanation is straightforward, I hope anyone wants to take it as a lesson for faith."
		   },
		   {
			"id": 4879,
			"surah": 54,
			"ayat": 33,
			"tafsir": "The story begins to punish them. Allah explained that the people of Lut had also considered Allah's warnings which He conveyed through the Prophet Lut, to be lies. The warnings are for them to leave the dirty deeds they are doing, namely sexual relations between men."
		   },
		   {
			"id": 4880,
			"surah": 54,
			"ayat": 34,
			"tafsir": "Allah sent them a tornado that flew the stones and then threw their heads so they perished, the only survivors were the Prophet Lut's family, namely those who believed in him. Because Allah ordered them to leave their country first before dawn."
		   },
		   {
			"id": 4881,
			"surah": 54,
			"ayat": 35,
			"tafsir": "This rescue is a gift from Allah to those who believe. The favor is in the form of their safety from the punishment. Such is the law of Allah, that He always gives favors to those who are grateful and obedient to carry out His commands and stay away from His prohibitions, and punish those who disobey."
		   },
		   {
			"id": 4882,
			"surah": 54,
			"ayat": 36,
			"tafsir": "The punishment for those who disobedience deserves to be imposed because Allah through the Prophet Lut has warned them but they do not care about it, they continue to commit acts of sexual intercourse with men."
		   },
		   {
			"id": 4883,
			"surah": 54,
			"ayat": 37,
			"tafsir": "Their crimes reached their climax when they asked the Prophet Lut to hand over to them, his guests. The guests were angels disguised as handsome young men to test them. They knew the guests because of the betrayal of Lot's wife who told them of her arrival. When the Prophet Lut saw them coming, he closed the door to protect his guests, and offered them his \"daughters.\" But they weren't interested in the girls and tried to break down the door. Finally Prophet Lut opened the door. As soon as they entered, their eyes became blind and could not see the guests because they were slapped by Jibril with his wings. At the end of this verse, Allah reveals to them that they will feel His punishment in the form of blindness in their eyes, which they had previously been threatened with."
		   },
		   {
			"id": 4884,
			"surah": 54,
			"ayat": 38,
			"tafsir": "In the morning, the doom came. They were showered with stones by Allah so that they and their country were completely buried. The Prophet Lut himself and his family, namely his two daughters and those who believed, had been ordered out of the country before dawn so that they were safe."
		   },
		   {
			"id": 4885,
			"surah": 54,
			"ayat": 39,
			"tafsir": "Thus the punishment of Allah against the people of the Prophet Lut. They had to feel the severity of the punishment because they did not want to pay attention to Allah's warnings through His prophet. Allah's warnings must come true, therefore they should not be ignored."
		   },
		   {
			"id": 4886,
			"surah": 54,
			"ayat": 40,
			"tafsir": "The tafsir of this verse as explained in verse 32 of this surahh is always used as the closing of each of the four stories (namely the story of Noah's people, the story of 'Ad, the story of the Samud people and the story of the people of Lut). Allah also reaffirms that the Qur'an is easy to understand and take as a warning because Allah gives clear examples in it, therefore humans should have faith in it in carrying out the teachings contained in it so that they will be happy in this world and in the hereafter."
		   },
		   {
			"id": 4887,
			"surah": 54,
			"ayat": 41,
			"tafsir": "These verses explain that warning after warning has been delivered many times to Pharaoh's people and his followers. But they still deny it. These warnings are all the apostolic signs and miracles that Allah gave to Prophet Musa as revealed in surahh al-A'raf\/7: 133 and al-Isra'\/17: 101. Because of that Allah sent down punishment on them. The punishment comes from the Almighty and Almighty Substance, which shows that the punishment is very great. In the form of the sinking of Pharaoh and his followers in the Red Sea."
		   },
		   {
			"id": 4888,
			"surah": 54,
			"ayat": 42,
			"tafsir": "These verses explain that warning after warning has been delivered many times to Pharaoh's people and his followers. But they still deny it. These warnings are all the apostolic signs and miracles that Allah gave to Prophet Musa as revealed in surahh al-A'raf\/7: 133 and al-Isra'\/17: 101. Because of that Allah sent down punishment on them. The punishment comes from the Almighty and Almighty Substance, which shows that the punishment is very great. In the form of the sinking of Pharaoh and his followers in the Red Sea."
		   },
		   {
			"id": 4889,
			"surah": 54,
			"ayat": 43,
			"tafsir": "Allah warned the disbelievers of Mecca whether they felt more noble than the disbelievers before those who had been overwritten by Allah's punishment such as the people of Noah, the people of 'Ad and the people of Samud. Will they be saved from Allah's punishment because of their disbelief towards Him and their lies towards His Messenger. Or do they really get written guarantees in the holy books that they feel free from Allah's punishment even though they always disbelieve and do bad things. If their belief is true, it is necessary to show the basis for the truth of their belief."
		   },
		   {
			"id": 4890,
			"surah": 54,
			"ayat": 44,
			"tafsir": "Allah still continues to question whether they feel they are a very united force so that they are so strong and impossible to defeat. Abu Jahal said, their troops were many and strong, they would definitely win (in the Battle of Badr). ("
		   },
		   {
			"id": 4891,
			"surah": 54,
			"ayat": 45,
			"tafsir": "Allah confirmed that their unity will be scattered and their strength will be broken by the Islamic forces. Allah's promise was proven in the Battle of Badr, where more than 70 of their leaders were killed and the rest fled back to Mecca. Evidence of the truth of Muhammad's prophethood, because this verse was revealed in Mecca, while the Prophet did not yet have an army, even the followers of the Prophet were scattered, hunted and tortured by polytheists wherever they were, 'Umar bin al-Khaththab said, \"When the verse was revealed I did not understand what it meant. But during the Battle of Badr, I saw the Prophet wearing armor and I read with him this verse, 'That faction will surely be defeated, only then did I understand the meaning of the verse.\" It was narrated by al-Bukhari from Ibn 'Abbas that the Prophet said while he was still in the camp, on the day of the Battle of Badr: \"I claim Your message and Your promise! O Allah, if You had willed (our defeat) you would not have been worshiped.\" again after today.\" Then Abu Bakr held the Prophet's hand and said, \"That's enough, O Messenger of Allah! You have urged your Lord so much.\" Then he came out (from the tent) jumping in armor while reading this verse. (Al-Bukhari's history) Then Allah stated that this is the punishment of the world and they will meet an even more severe punishment on the Day of Judgment."
		   },
		   {
			"id": 4892,
			"surah": 54,
			"ayat": 46,
			"tafsir": "This war is the punishment they will experience in this world, in the form of defeat, being killed or taken prisoner, but they will still receive another, more terrible punishment, namely the punishment of hell in the hereafter. The punishment for the hereafter is greater and lasts forever and is strong forever."
		   },
		   {
			"id": 4893,
			"surah": 54,
			"ayat": 47,
			"tafsir": "Allah states, that actually those who associate partners with Allah and belie His messengers are people astray and deviate from the true path in this world. In the afterlife, they will be subject to a painful punishment due to their misguidance."
		   },
		   {
			"id": 4894,
			"surah": 54,
			"ayat": 48,
			"tafsir": "Disobedient people will be dragged into hell by dragging and banging their faces on the ground because of that they suffer greatly. Their suffering in hell is even greater. Hell will melt their skin and flesh"
		   },
		   {
			"id": 4895,
			"surah": 54,
			"ayat": 49,
			"tafsir": "All creatures created by Him according to the provisions and laws that have been established by Him. Therefore if someone is punished because of the provisions and laws. And everything will happen according to His decree. In another verse, Allah also says about decrees or predestination, namely: And He created all things, then determined the proper measurements. (al-Furqan\/25: 2) But humans are obliged to try, His provision is left to Allah according to the word of Allah: And that humans only get what they have worked for and indeed the efforts will be shown (to him). (an-Najm\/53: 39-40) In an authentic hadith narrated by Ahmad and Muslim from Abu Hurairah: Rasulullah SAW said, \"Ask Allah for help, and don't be weak. If something happens to you, then say, Allah has decreed it. What what He wants, He does, and don't say: if I do this it will be like that. Indeed, the word \"if\" opens (the possibility of) the actions of satan. In accordance with the hadith of the Prophet Muhammad: Rasulullah saw said: everything is determined by its size even weaknesses and intelligence. (History of Imam Ahmad and Muslim from Ibn 'Umar) Allah swt said: For him (man) there are angels who always take care of him in turn, from the front and behind him. They guard him at the command of Allah. Indeed, Allah will not change the condition of a people before they change the condition of themselves. And if Allah wills bad for a people, then no one can reject it and there is no protector b for them besides Him. (ar-Ra'd\/13: 11)"
		   },
		   {
			"id": 4896,
			"surah": 54,
			"ayat": 50,
			"tafsir": "In fact, God's command is only delivered once and the order must happen quickly, faster than the blink of an eye. When Allah swt wants something to happen then He just says \"Be it\" what He wants will come true immediately. Likewise regarding the punishment of infidels, the punishment must be carried out in the hereafter. ("
		   },
		   {
			"id": 4897,
			"surah": 54,
			"ayat": 51,
			"tafsir": "This verse explains that Allah destroyed people who were like them, namely the people who denied the prophets in ancient times, they were destroyed because of their rebellion. These events should be a lesson for the Meccan infidels and for anyone after them to believe. Allah says in another verse about the punishment that is passed on to one generation, the same as the punishment that was passed on to the previous generation. And given a barrier between them and what they want as was done to people who agree with them before. Indeed, they were (in the world) in deep doubt. (Saba'\/34: 54)"
		   },
		   {
			"id": 4898,
			"surah": 54,
			"ayat": 52,
			"tafsir": "All human actions are collected in their respective notebooks. That's because every human action, small or big, good or bad, is recorded by an angel in the notebook. Angel Kiram, or call it Raqib, records good deeds and Angel Katibin, or 'Atid, records bad deeds. In another verse Allah says: There is not a single word that he utters but there is a watchdog beside him who is always ready (to take notes). (Qaf\/50: 18) Because all human activities, both actions and speech, both good and bad, both big and small are recorded in their respective notebooks, it is very easy for Allah to punish those who sin and give reward for those who do good."
		   },
		   {
			"id": 4899,
			"surah": 54,
			"ayat": 53,
			"tafsir": "All human actions are collected in their respective notebooks. That's because every human action, small or big, good or bad, is recorded by an angel in the notebook. Angel Kiram, or call it Raqib, records good deeds and Angel Katibin, or 'Atid, records bad deeds. In another verse Allah says: There is not a single word that he utters but there is a watchdog beside him who is always ready (to take notes). (Qaf\/50: 18) Because all human activities, both actions and speech, both good and bad, both big and small are recorded in their respective notebooks, it is very easy for Allah to punish those who sin and give reward for those who do good."
		   },
		   {
			"id": 4900,
			"surah": 54,
			"ayat": 54,
			"tafsir": "For those who are pious, Allah will give heaven according to their level of piety. As you know, heaven is multilevel. In the heavens rivers flow which shows that heaven is a place that is cool, beautiful and gives a lot of results. They occupy a rightful place that is without blemish or lack and they are under the auspices of the almighty Maharaja, who will give them what He wants without anyone hindrance."
		   },
		   {
			"id": 4901,
			"surah": 54,
			"ayat": 55,
			"tafsir": "For those who are pious, Allah will give heaven according to their level of piety. As you know, heaven is multilevel. In the heavens rivers flow which shows that heaven is a place that is cool, beautiful and gives a lot of results. They occupy a rightful place that is without blemish or lack and they are under the auspices of the almighty Maharaja, who will give them what He wants without anyone hindrance."
		   }
	]
}
