{
	"tafseer": [
		{
			"id": 5127,
			"surah": 59,
			"ayat": 1,
			"tafsir": "This verse explains that he has glorified Allah and glorified Him in all that is in the heavens and on earth, by purifying Him of qualities that are not worthy of Him, either by words, deeds, or by a statement of his heart. Allah says: The seven heavens, the earth and all that is in them glorify Allah. And there is nothing but glorify Him by praising Him, but you do not understand their tasbih. Indeed, He is Most Forbearing, Most Forgiving. (al-Isra'\/17: 44) From this first verse it is understood that all of God's creatures in the heavens and on earth, whether living creatures, such as humans, animals, and plants, as well as inanimate creatures such as rocks, water, air , planets, rivers, and so on, glorify Him. Each glorifies according to circumstances and events. If you pay attention to all of God's existing creatures, you will see that each creature is subject to the laws and regulations that have been determined for it. It was as if these creatures were unable to escape from those laws and decrees. If he violates it, surely he will be damaged or destroyed. These laws and decrees are sunatullah. An example is the law of water flowing from a high place to a low place. Rainwater that falls from the sky on mountainous areas, will be stopped by its flow if someone stops it. What held him back were the vegetation that grew abundantly in the mountains. With the presence of plants, water will enter the soil through its roots, so that rainwater does not flow directly to low places. The flow of water seems to be arranged in such a way that it can be used by humans for drinking, agriculture, and so on. If an area is a barren area, then there is no rainwater to hold it. Water flows directly into a low place towards the sea, so it cannot be utilized by humans, it can even damage humans with the danger of flooding and drought during the dry season. In this case, water is subject to the laws and ordinances established by God. No one can deny these laws and decrees, including humans. If humans destroyed the forest, then the danger would immediately fall on them. On the other hand, if they take good care of it, they will receive the benefits immediately. There are many other examples that show that all creatures are always submissive and obedient to God's laws, such as the law of gravity, and laws that apply to humans, such as those who are diligent will succeed, and those who are lazy will not succeed. All human beings are physically subject to this law. Following Allah's laws and decrees as well as possible means glorifying Him. All objects both in the heavens and on earth, from the smallest particles to the super galaxies are subject to Allah's decree (sunatullah). For example, the differences in the masses and orbits of the planets in our solar system form a stable and perfect dynamic system, and interact with each other in full harmony. All glorify or submit to the provisions of Allah. As explained in the previous verses that Allah's law is in the form of sunatullah, namely the law that applies in this world. Shari'a is God's provisions and rules brought by the apostles to humans. Humans must submit and obey the sunatullah and must obey and carry out God's law. As for other creatures, they only submit to the sunatullah. Humans who submit to the two laws of God are humans who are happy in this world and in the hereafter. At the end of this verse it is emphasized that Allah is Mighty, Most Wise. The point is that Allah, the Creator of the universe, is the Most Mighty Substance, there is nothing that can violate His laws and decrees. Anyone who opposes and violates it will feel the consequences either directly or indirectly. If in the world they have not received the consequences, in the afterlife they will definitely feel it. It is Allah who created all things, and He knows with certainty the benefits and uses of their creation. Allah knows with certainty why something was created and also knows with certainty the consequences that His creation will bring about, whether the consequences are big or small."
		   },
		   {
			"id": 5128,
			"surah": 59,
			"ayat": 2,
			"tafsir": "In this verse it is explained that one of the proofs of Allah's might and wisdom is to drive the Jews out of the city of Medina. With His help, the Muslims were able to expel them from their homes, even though they were previously people who had power over the Aus and Khazraj tribes in various fields of life. Since before the birth of Prophet Isa, Jews have inhabited the city of Medina. They consisted of three tribes, namely Bani Qainuqa', Bani Nadhir, and Bani Quraidhah. After the Prophet Muhammad migrated to Medina, he entered into a peace treaty with the three tribes. Among the contents of the peace agreement are: 1. The Muslims and the Jews are both trying to create a peaceful atmosphere in the city of Medina. Each of them is free to embrace the religion they believe in. 2. The Muslims and the Jews are obliged to help each other and fight against any other person or tribe who wants to attack the city of Medina. 3. Whoever among them lives inside or outside the city of Medina, it is obligatory for his security and wealth to be maintained. 4. If there was a dispute or conflict between the Muslims and the Jews, which could not be resolved, the matter was handed over to the Prophet Muhammad. Even though the peace treaty has been concluded as described above, in the hearts of the Jewish people there is still hatred and jealousy for the Prophet Muhammad and the Muslims. They considered themselves sons and lovers of God, thus the apostle and prophethood were their right as Jews. According to them, other ethnic groups have no right to the position that God has given them. Their feelings of envy and jealousy increased after seeing the success of the Prophet Muhammad in spreading Islam, so that it was growing day by day, while they were unable to stop it. Nevertheless, they are always waiting for an opportunity to carry out their wishes. Allah says: Many of the People of the Book wish they could return you after you believed, became disbelievers again, out of envy in themselves, after the truth became clear to them. So forgive and be broad-minded, until Allah gives His commandments. Indeed, Allah is Almighty over all things. (al-Baqarah\/2: 109) At first, they tried to beat the Prophet Muhammad by way of debate, but they always failed to break the reasons put forward. Therefore, they began to resort to violence, provocation and slander. At first Bani Qainuqa' violated the peace treaty that had been made with the Prophet Muhammad. One day, an Arab Muslim woman entered the Bani Qainuqa' market, and they mistreated her. An Arab who happened to be passing by tried to defend him, but he was beaten and beaten to death. The actions of the Bani Qainuqa' angered the Muslims, so that a fight broke out between the two groups, which resulted in loss of property and lives on both sides. Rasulullah saw tried to reconcile them, but they always denied it and caused trouble. Because of their attitude which always showed hostility to the Muslims and endangered the security of the city of Medina, the Prophet gave the decision to fight them so that they left the city of Medina. This incident occurred after the Battle of Badr. After the Bani Qainuqa' incident, the Bani Nadhir Jews also committed treason. They planned to kill the Prophet Muhammad himself. The assassination attempt they carried out when the Prophet and his companions visited their village. However, their plan failed and Rasulullah SAW survived the assassination attempt. In this regard, Allah says: O you who believe! Remember Allah's favor (given) to you, when a people intends to attack you with his hand, then Allah withholds their hand from you. And fear Allah, and only in Allah should the believers place their trust. (al-Ma'idah\/5: 11) After the Messenger of Allah uncovered the murder plan, he decided to expel the Bani Nadhir from the city of Medina. This expulsion took place in the month of Rabiulawal in the fourth Hijri year. Among them there are those who live in Syria and Khaibar. They opposed the decision of the Prophet Muhammad, and they secretly organized forces to fight against the Muslims. They made alliances with Meccan polytheists and hypocrites. The Bani Quraidhah who still lived in the city of Medina also joined the alliance. So Rasulullah saw surrounded them for 25 days. Among them were killed and expelled. Thus, all the Jews who used to live in Medina have moved to other places, such as Khaibar, Syria, and other countries. This is what is meant by expulsion in this verse, namely the expulsion of the Jews from the city of Medina because of their betrayal of the agreement they had made with the Prophet Muhammad. This verse explains that Allah has expelled the Jews, Bani Qainuqa' and Bani Nadhir, from Medina for the first time by providing assistance to the Muslims to defeat and expel them. The word \"first time\" indicates that there were several times when the expulsion of Jews from Medina occurred. As for what is meant in this verse is the first expulsion. The next expulsion was the expulsion of the Bani Quraidhah Jews after the Ahzab War, and the expulsion carried out by 'Umar bin al-Khaththab when he became caliph. Believers did not think that the Jews could be expelled from the city of Medina, considering their circumstances, strength, wealth, knowledge and equipment. The Jews living in Medina at that time were better off than the Emigrants and Ansars. Many of them are good at writing and reading, many are knowledgeable, and so on, in addition to their shrewdness in doing business, trading and managing things. The facts show that the expulsion was carried out. This can strengthen the faith of Muslims and their belief in Allah's help. The Bani Nadhir originally thought that the strong fortifications they had built could save them from enemy attacks. They really believed in his strength, so they dared to pit against each other and slander the Muslims, so that the Meccan polytheists grew stronger in their hostility. Then the Jews planned an alliance with polytheists and hypocrites to fight against the Muslims. Under these circumstances, the Bani Nadhir were suddenly defeated by the Muslims whom they had taken lightly so far. In fact they were expelled from Medina. They were only allowed to take with them what their camels could carry. Some of the Bani Nadhir went to Adhriat (Sham) and some to Khaibar. Then explained the reasons for the defeat, acceptance and submission of the Bani Nadhir to the decision of the Prophet when he came to them. At that time, there was great fear in their hearts, especially because of the actions of the Prophet who sentenced their leader, Ka'ab bin Asyraf, to death and coupled with the actions of the hypocrites who did not keep their promises to them. Allah explained the condition of the Bani Nadhir Jews when they were about to leave Medina in a state of exile. They demolished their houses, and closed the roads in their settlements, with the intention that the house could not be used by the Muslims and so that they could carry as much equipment as possible. They left Medina full of anger and revenge against the Muslims, but they did not want to understand and think about the reasons for their expulsion, whether the decision was in accordance with their actions or not. At the end of this verse, Allah warns Muslims who want to use their minds to reflect on this incident, and take lessons from it. If they ponder and think about it properly, they will certainly come to the conclusion that the decision and punishment handed down to Bani Nadhir was an appropriate decision and punishment, even considered light considering the actions and actions they had committed."
		   },
		   {
			"id": 5129,
			"surah": 59,
			"ayat": 3,
			"tafsir": "In this verse Allah confirms that the death penalty for their leader and expulsion is a punishment commensurahte with the crimes they have committed. In fact, the punishment was still lighter than the punishment given to the polytheists in the Battle of Badr, lighter than the punishment given to the Bani Quraidhah tribe. Especially compared to the punishments that God inflicted on past peoples."
		   },
		   {
			"id": 5130,
			"surah": 59,
			"ayat": 4,
			"tafsir": "The punishment that the Jews received was that they were defeated by the believers and expelled from Medina. The punishment happened because they opposed Allah and His messenger, and denied His revelation. It has become sunatullah that everyone who disobeys Allah and His Messenger will be punished and will be humiliated in this world and in the hereafter. According to the history of al-hakim from 'Aisyah, the Banu Nadhir Jews who lived and cultivated dates in the city of Medina had their movements restricted by the Prophet six months after the Battle of Badr. Then they were driven out of the city of Medina and allowed to take their wealth only what their camels could carry. Prior to that, Rasulullah saw ordered to master and cut down their date palms."
		   },
		   {
			"id": 5131,
			"surah": 59,
			"ayat": 5,
			"tafsir": "It was narrated from Ibn Ishaq and Ibn Jarir who came from Qatadah, Mujahid, and Yazid bin Ruman that when the Prophet arrived at Bani Nadhir, they hid in their forts. The Messenger of Allah ordered the Muslims to cut down and burn their date palms to cause smoke. Bani Nadhir shouted to the Messenger of Allah, \"O Muhammad, you have prohibited doing damage to this earth and denounced those who did it, but why did you cut down date palms and burn them?\" Because of this, doubts arise in the minds of those who believe. They said, \"We will ask the Messenger of Allah. Do we get a reward for cutting down those date palms, or are we sinning because we don't know.\" So this verse came down which explains that the order for the cutting and burning of the date palm trees by the Jews was at the command of Allah, and Allah justified destroying the property of the disbelievers if it was necessary. All the actions taken by the Prophet against the Bani Nadhir Jews, whether cutting down their palm trees or not, were all based on Allah's command with the intention of ridding Medina of the evils of the Bani Nadhir. At the end of this verse it is emphasized that Allah ordered this to glorify and increase the enthusiasm of those who believe, as well as humiliate and multiply the sorrow of the Bani Nadhir Jews. Grief because they lost the war, sorrow because they were expelled from their hometown, and sorrow because their property was destroyed."
		   },
		   {
			"id": 5132,
			"surah": 59,
			"ayat": 6,
			"tafsir": "This verse explains the law of fai', that is booty obtained from enemies, without war. This happened because the enemy had surrendered and admitted defeat before the battle. The assets left by the Bani Nadhir after they were expelled from the city of Medina were considered fai', because the Bani Nadhir surrendered to the Muslims before the war broke out. Allah explained that the property of the Bani Nadhir which they left behind because they were expelled from Medina fell into the hands of the Prophet Muhammad by the will of Allah, so that they belonged to Allah and His Messenger. The treasure was not distributed to the soldiers who fought, as was the case with the spoils of war (ganimah). Because the treasure was obtained without going through war, without the use of cavalry and camels, it was as if the Muslim army had not made any effort to obtain this treasure. The Bani Nadhir Jews who owned the treasure had declared that they had admitted defeat before the war started, and were willing to accept the conditions set by Allah and His Messenger for them. The treasure is used to uphold Allah's religion and the public interest. According to al-Qurthubi, the fai' property handed over by Allah to His Messenger was not taken and used by the Apostle all of it, but the Apostle only took it for the needs of his family. While the rest is used for the benefit and welfare of the Muslims. Allah explains that His sunnah has applied to all of His creatures in every condition, time and place, namely defeating and instilling fear in the hearts of the enemies of His messengers. Among them is that Allah has made Bani Nadhir's hearts fear, so that they surrendered to Rasulullah saw. Because they had surrendered, Allah gave authority to His messenger to control the wealth of Bani Nadhir. Therefore, the Muslim army is not entitled to it. At the end of this verse, Allah reminds of His power over all of His creatures. If Allah wills, He instills fear and trembling in His enemies without fighting, as was the case with the Banu Nadhir. They surrendered, even though they were in strong fortresses."
		   },
		   {
			"id": 5133,
			"surah": 59,
			"ayat": 7,
			"tafsir": "This verse explains that fai' assets originating from disbelievers, such as the assets of the Bani Quraidhah, Bani Nadhir, residents of Fadak and Khaibar, were then handed over by Allah to His Messenger, and used for public purposes, were not distributed among the Muslim armies. . Then it was explained that the division of the fai's wealth was for Allah, the Messenger of Allah, the relatives of the Prophet from Bani Hasyim and Bani Muttalib, orphans who were indigent, poor people who needed help, and people who ran out of shopping money on the way. After the Messenger of Allah died, the four-fifths of the Apostle's portion and the one-fifth of one-fifth were used for the needs of those who continued his apostolic duties, such as warriors in the way of Allah, preachers, and so on. Some followers of Shafi'i are of the opinion that the share of the Prophet was left to agencies that seek the benefit of the Muslims and to uphold the Islamic religion. The Ibnus-sabil referred to in this verse are people who have been stranded on their way for a good cause, because their fares have run out and those who have been stranded have no place to live. Then it was explained that Allah determined such a distribution with the aim that the wealth would not fall under the authority of the rich and be divided by them, so that the wealth would only circulate among them as was usual in the Arab Jahiliyya era. Allah commands the Muslims to follow the provisions that have been decided, both regarding fai' assets and ganimah assets. Property is lawful for Muslims and everything that is forbidden by Allah they should stay away from and not take it. This verse contains the general principles of the Islamic religion, namely to obey the Prophet by carrying out all his commands and avoiding his prohibitions, because obeying the Prophet is essentially obeying Allah too. Everything that the Messenger of Allah conveyed came from Allah, as He said: And not what he said (the Qur'an) according to his wishes. Nothing else (the Qur'an) is a revelation that was revealed (to him). (an Najm\/53: 3-4) Rasulullah SAW conveyed everything to humans with the aim of explaining Allah's religion contained in the Qur'an. Allah said: (We sent them) with statements (miracles) and books. And We sent down Adh-dhikr (Al-Qur'an) to you, so that you explain to people what has been revealed to them and so that they think about it. (an-Nahl\/16: 44) Verse 44 of tafsir an-Nahl suggests to Muslims to carry out the hadiths of the Prophet, as well as carry out the messages of the Qur'an, because the two are an inseparable unit. At the end of verse 7, Allah orders people to fear Him by carrying out all His commands and avoiding His prohibitions. Not fearing Allah means being disobedient to Him. Everyone who is disobedient will be overwritten by a painful punishment."
		   },
		   {
			"id": 5134,
			"surah": 59,
			"ayat": 8,
			"tafsir": "This verse explains that the people who are entitled to receive the distribution of the fai' assets in ayat 7 above are the Muhajirin people because they are considered relatives of the Prophet Muhammad. They, as immigrants, had come to Medina following the Prophet's emigration, leaving their hometowns, relatives, property, and friends who used to help them. In Medina they lived in poverty, but they were defenders of the Prophet and warriors in the way of Allah. According to this verse, Allah ordered the Prophet Muhammad to take care of them by handing over some of this fai' to them. Then Allah explained the characteristics of the Emigrants as follows: 1. Those who believe in Allah and His Messenger, they show their obedience only to Allah alone by sacrificing everything they have just to seek His pleasure. 2. People who are willing to leave their homes and possessions to carry out the commands of Allah and His Messenger. 3. People who dare to sacrifice their souls and bodies to defend Allah and His Messenger. It is reported that the poverty and suffering of the Emigrants were such that some tied ropes to their stomachs to reduce their hunger. However, they do not reveal their poverty and suffering to others. In another verse, Allah commands the Muslims to provide for them, in addition to also mentioning their characteristics: (What you spend) is for the needy people who are hindered (his efforts due to jihad) in the way of Allah, so that he does not can strive on earth; (other people) who don't know, think that they are rich people because they keep themselves (from begging). You (Muhammad) know them from their characteristics, they do not ask others by force. Whatever good treasure you spend, verily, Allah is All-Knowing. (al-Baqarah\/2: 273) Therefore, Allah provided a great reward for them as explained in a hadith of the Prophet saw: Rasulullah saw said, \"Give good tidings, O poor immigrants, with perfect light on the Day of Judgment. You enter heaven first half a day before the rich. Half a day (on the Day of Judgment) is for five hundred years (time in the world).\" (History of Abu Dawud from Sa'id al-Khudri) People who have characteristics and circumstances like those of the Emigrants exist all the time as long as there is a struggle to uphold the religion of Allah. Therefore, the commandment in this verse also applies to Muslims today and Muslims in the future."
		   },
		   {
			"id": 5135,
			"surah": 59,
			"ayat": 9,
			"tafsir": "This verse explains the attitude of the believers from the Ansar group in accepting and helping their brothers and sisters who are poor immigrants, and Allah's statement praising their attitude. The characteristics of the Ansar people are: 1. They love the Muhajirin people, and want the Muhajirin people to get good as they want that good for themselves. The Messenger of Allah (PBUH) brought the Muhajirin and Ansar together as if they were siblings. The Ansar people provided part of their houses for the Muhajirin, and looked for Ansar women to be wives for the Muhajirin and so on. 'Umar bin al-Khatthab once said, \"I willed to the caliphs who were appointed after me, so that they would know the rights of the Emigrants and maintain their honor. And I willed to do good to the Ansar people, people who live in the city of Medina and have faith before the arrival of the Emigrants, so that Allah will accept their kindness and forgive all their mistakes.\" Narrated by Ibn Mundhir from Yazid bin al-Aslam it was explained that the Ansar people said, \"O Messenger of Allah, this is our land for him, part of it is for us Ansars and partly for the Emigrants.\" The Prophet replied, \"No, just meet their needs and divide the two dates, the land is still yours.\" They said, \"We are happy with the decision.\" So this verse was revealed which describes the characteristics of the Ansar people. 2. The Ansar did not wish to acquire the fai' treasure as it had been given to the Muhajirin. It is narrated that the Messenger of Allah said to the Ansar, \"Surely our brothers (Muhajirin) have left their possessions and their children and have migrated to your country.\" They said, \"Our property has been divided among us.\" Rasulullah said, \"Or something else than that?\" They said, \"What is it O Messenger of Allah?\" He said, \"They are people who do not work, so provide tamar and distribute it to them.\" They replied, \"Yes, O Messenger of Allah.\" 3. They prioritized the Muhajirin over themselves, even though they themselves were in tightness, so that an Ansar had two wives, then divorced the other so that he could marry a friend of the Muhajirin. Narrated by al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah, he said, \"A man had come to the Messenger of Allah, and said, 'I am hungry. So the Messenger of Allah said to his wives asked for food, but there was none, he said, 'Isn't there anyone who wants to receive this man as a guest tonight? Know that those who want to receive this man as a guest (and feed him) tonight, will be graced by Allah . Abu Talhah, a member of the Ansar group, said, 'I am O Messenger of Allah. So he went to his wife and said, 'Respect the guests of the Messenger of Allah. His wife replied, 'By Allah, there is no food except food for children. Abu Talhah said, \"When the children are going to have dinner, put them to sleep, turn off the lights, let us endure hunger tonight so that we can receive the Messenger of Allah's guests. So his wife did that. Early the next morning, Abu Talha went to the Messenger of Allah to tell the story. iwa that night and he said, 'Allah was really amazed that night to the actions of the husband and wife. So this verse was revealed regarding that incident.\" Al-Wahidi also narrated from Muharib bin Ditsar from Ibn 'Umar that a friend of the Prophet Muhammad from the Ansar group was given a goat's head. It occurred to him that maybe someone else needed it more than him. Immediately same time the head of the goat was sent to his friend, but the friend also sent it to another friend, so that the goat's head moved around seven houses and finally returned to the first person's house. This history has something to do with the revelation of this verse. Allah goes on emphasizes that those who can control themselves by following Allah's religion, so that they can get rid of their greed for wealth, stinginess, and self-centeredness, are lucky people. They have succeeded in achieving their life goals as outlined by Allah. In a hadith the Prophet saw explained that he said: It will not dust collects (sticky) on a person's face when struggling in the way of Allah with the smoke of hell forever, and will not gather in the heart of a servant of miserliness and faith forever. (An-Nasa'i History) In another hadith it is explained: The Messenger of Allah said, \"Keep yourself from unjust acts, in fact unjust deeds (cause) darkness on the Day of Judgment, protect yourself from miserliness, because indeed miserliness destroys people who were before you, caused bloodshed among them and will make what they have made lawful.\" (History of Ahmad, al-Bukhari, Muslim, and al-Baihaqi from Jabir bin 'Abdullah) The Prophet also said in another hadith: (Three groups) who are free from miserliness, namely people who pay zakat, honor guests, and give something to difficult people. (History of ath-thabrani)"
		   },
		   {
			"id": 5136,
			"surah": 59,
			"ayat": 10,
			"tafsir": "This verse explains that the generations of Muslims who came later, after the end of the generation of Muhajirin and Ansar, until the Day of Judgment came, they prayed to Allah, which means, \"O our Lord, forgive our sins and the sins of our brothers and sisters of the same religion.\" believe before us.\" There are several things that can be taken from this verse, namely: 1. If someone prays, then the prayer begins for oneself, then for others. 2. Muslims have a brotherly relationship with one another, like the relationship between brothers and sisters. They pray for each other that Allah will forgive all their sins, both present and past. 3. Muslims are obliged to love the companions of the Prophet Muhammad, because they have set an example in good relations with fellow human beings. If someone wants his life to be happy in this world and in the hereafter, he should follow the example of the brotherly relationship that was practiced by the Muhajirin and Ansar. This 10th verse has a close relationship with the previous verse (9th verse). Therefore, the purpose of this verse is to explain how the relationship of the Muhajirin people who have left their hometowns, families and possessions in Mecca with the believing Ansar people who receive the Muhajirin people with love and brotherhood in their hometowns , which they do solely to seek Allah's pleasure and jointly uphold Allah's religion and show their true faith, so should the relations of the Muslims who came after. Let them help each other and strengthen brotherhood in exalting the word of God. From this verse it can be understood that the relationship between people who are emigrating and residents of the country that accepts them can lead to a strong brotherly relationship between people, as long as that relationship contains elements of faith, sincerity, and helping each other, as was done by the Muhajireen and the Ansar. In this situation there are the most opportunities for a believer to perform various actions that form the qualities of piety and are pleasing to Allah. Ibn Abi Laila said, \"Humans are divided into several levels, namely the level of the Muhajirin, the level of the Ansar, and the level of the next generation who always follow in the footsteps of the Muhajirin and Ansar. Therefore, we should try to get into one of these three levels. Then mentioned the continuation of the prayer of those who believe, which means, \"O our Lord, do not instill in our hearts envy of those who believe.\" Jealousy and revenge are the source of all evil and immorality that encourage people to commit destruction, injustice, and spilled blood on the earth. Allah says: And those who were earlier and first (converted to Islam) among the Muhajirin and Ansar and those who followed them well, Allah was pleased with them and they too are pleased with Allah. Allah has prepared for them gardens beneath which rivers flow. They will abide therein forever. . That's a great victory. (at-Taubah\/9: 100) At the end of this verse it is explained that the people referred to in verse 10 say that Allah is Most Merciful to His servants, and bestows His grace a lot. Therefore, they asked Him to grant their prayers. It was narrated from Ibn 'Umar that he heard that a man met some of the Muhajirin, then a verse was read, \"Lil fuqara'il-muhajirin\" (for the poor group of Muhajirin), then one said to him, \"They are people Muhajireen, are you one of them?\" The man replied, \"No.\" Then it was also read to him: \"Wal-ladhina tabawwa'ud-dara wal-imana min qablihim\" (and those who have occupied the city of Medina and believed before their arrival). Then one of them said to him, \"They are from the Ansar group, are you from their group?\" He replied, \"No.\" Then recited the verse: \"Wal-ladhina ja'u min ba'dihim\" (those who came later), Someone also asked him, \"Are you from their group?\" He replied, \"I hope so.\" Then he said, \"Didn't some of them blame others?\" This verse shows that between believers it is not permissible to criticize each other."
		   },
		   {
			"id": 5137,
			"surah": 59,
			"ayat": 11,
			"tafsir": "It was narrated by Ibn Ishaq, Ibn Mundhir, and Abu Nu'aim from Ibn 'Abbas that this verse was revealed to be related to a group of people from Bani Auf, among whom were 'Abdullah bin Ubay bin Salul, Wadi'ah bin Malik, Suwaid, and Da' is, was sent to the Bani Nadhir as explained in this verse. Allah told Rasulullah saw, \"Aren't you surprised O Muhammad to see the actions of those hypocrites? They promised something to the Bani Nadhir Jews, against their own will. The hypocrites led by 'Abdullah bin Ubay told the Bani Nadhir Jews that they were close friends, because they harbored enmity with the Muslims.\" They said, \"O Bani Nadhir, if you are expelled from your country as Muhammad saw and the Muslims wanted, we will definitely be with you, and no one can prevent us from joining you all.\" Furthermore, the hypocrites said, \"O Bani Nadhir, if Muhammad fights you all, we will definitely help you and join in the annihilation of your enemies\", in reality everything the hypocrites promised was a lie. They easily break the promises they have made even though the promise is confirmed by an oath. God knew that they were lying. The saying \"God testifies that they are really liars\" is an occult news that will happen in the future. As stated that the hypocrites had promised help to the Bani Nadhir, but Allah stated that the hypocrites would not keep their promise. This was actually proven later. Reporting of an incident that will occur in the future is one of the proofs of the miracles of the Qur'an. 'Abdullah bin Ubay and his friends when they saw the Muslims besieging Bani Nadhir, sent two envoys to convey the message that he and his friends would come to help with all the strength that was at their disposal, to free them from Muhammad's siege. After the Bani Nadhir were tightly surrounded by the Muslims for days, the promised help did not come. Finally the Bani Nadhir Jews were convinced that the promise of 'Abdullah bin Ubay and his friends was a lie. Then arose fear and trembling in their hearts. Therefore, they declared surrender to Rasulullah SAW unconditionally. So the Messenger of Allah decided that they must accept the punishment prescribed for them, and leave the city of Medina by force."
		   },
		   {
			"id": 5138,
			"surah": 59,
			"ayat": 12,
			"tafsir": "In this verse Allah reaffirms the truth of the news of an event in the future by stating that actually if the Bani Nadhir were expelled from the city of Medina, there would be no hypocrites who would accompany them. Likewise, if Muhammad saw fought the Bani Nadhir, they would not give any help and the Bani Nadhir would lose, because Allah did not give them any help."
		   },
		   {
			"id": 5139,
			"surah": 59,
			"ayat": 13,
			"tafsir": "In this verse it is explained that the reasons why the hypocrites did not keep their promise to help the Bani Nadhir, as they had agreed, was because they feared the Muslims more than Allah. Therefore, they did not dare to oppose the Muslims, even though they were with Bani Nadhir. This verse shows what is in the hearts of hypocrites. They do not believe in the power and greatness of Allah. The most important thing for them is the safety of themselves and their property. For this safety, they did what was possible, such as the act of nifaq, to the Messenger of Allah they stated that they were among the believers, while to the Bani Nadhir they declared the same fate and responsibility in facing the Muslims. In addition, they do not want to understand the teachings that the Prophet conveyed to them. Whether the teaching is true or not, for them, what determines everything is only possessions and wealth. Therefore, it can be seen in their attitude when facing difficulties, they have no grip, and vacillate here and there. They fear man more than God. Allah's Word: When they were obliged to fight, suddenly some of them (the hypocrites) were afraid of humans (enemies), as they feared Allah, even more afraid (than that). (an-Nisa'\/4: 77)"
		   },
		   {
			"id": 5140,
			"surah": 59,
			"ayat": 14,
			"tafsir": "In this verse it is explained that the mentality of the Jews and the hypocrites has fallen in such a way. If the hypocrites kept their word and fought with the Bani Nadhir Jews against the Muslims, they would not be able to face them either, because in their hearts there was fear and dread for the Muslims. If they also fight, they will only fight behind the strong forts they have made, behind the walls of their houses, not daring to go out to face the Muslims. At the end of this verse, another reason is explained that causes them to be afraid to fight against the Muslims, namely that there is great conflict and hostility between them, there is no unity between them. This verse indicates to the Muslims that unity is a condition for achieving victory. No matter how strong the weaponry, equipment, and unity of the army, it will be meaningless if they are not united and are not sure that their goals will be achieved. Because a united nation or people even with adequate equipment will be able to achieve everything they aspire to. This provision applies to all human beings wherever they are. Regarding the need for strong belief, unity and oneness in facing anything, Allah says: O you who believe! If you meet (enemy) troops, then be firm and invoke (name) Allah a lot (dhikr and pray) so that you will be lucky. And obey Allah and His Messenger and do not fight, which causes you to be afraid and lose your strength and be patient. Indeed, Allah is with those who are patient. (al-Anfal\/8: 45-46) If embedded in a nation of strong faith and solid unity and unbreakable army unity, surely they will be able to face all kinds of difficulties facing enemies who will fight them. Allah says: Those who believe that they will meet Allah say, \"How many small groups defeat large groups with the permission of Allah.\" And Allah is with those who are patient. (al-Baqarah\/2: 249) Meanwhile, Allah reminds the Muslims not to be influenced by something that seems good, such as the relationship between the hypocrites and the Bani Nadhir, they seem to be united in facing the Muslims, even though in Between them there is conflict and enmity."
		   },
		   {
			"id": 5141,
			"surah": 59,
			"ayat": 15,
			"tafsir": "Allah explained that the situation of the Bani Nadhir Jews was the same as that of the Bani Qainuqa' Jews who also lived around the city of Medina. Because the actions of Bani Qainuqa' were similar to those of Bani Nadhir, the Messenger of Allah (saw) fought them against them on the Saturday of Shawwal, 20 months after the Prophet's migration. Finally they were expelled from Medina to a place called Adhri'at in the land of Sham. The Bani Qainuqa' have felt the bad consequences of their actions. The time gap between the two incidents was not long, only two years. So the events of Bani Nadhir took place in the fourth year of hijrah. The expulsion of the Bani Qainuqa' should have been a lesson for the Bani Nadhir when dealing with the Muslims in Medina. Had they carried out the terms agreed upon in the peace treaty that they had established with the Prophet, they would have lived in peace and tranquility under the rule of the Prophet. But they violated the peace treaty, so they suffered the same fate as Bani Qainuqa'. From this verse it can be understood that Muslims are ordered to be kind to people who are not Muslims, as long as those who are not Muslims are kind to them. That good attitude is a reflection of the heart's desire, then it manifests itself in deeds and actions, both openly and secretly. The desire of the heart can also be read on the face of someone in his association. If non-Muslims do not behave well, as the Bani Qainuqa' and Bani Nadhir did, it is only natural for the Muslims to take appropriate action to compensate for their actions."
		   },
		   {
			"id": 5142,
			"surah": 59,
			"ayat": 16,
			"tafsir": "This verse explains that the treacherous acts of the hypocrites who promised to help the Banu Nadhir when they were attacked by the Muslims and joined them when they were expelled from Medina, were like the deeds of the devil. Satan always seduces people to deny Allah and not follow the religion that His messenger has conveyed. However, when humans need help in dealing with the tribulations and calamities that come to them, Satan escapes and does not keep his word. They even said, \"Indeed I fear Allah, Lord of the Worlds.\" Allah equates hypocrites with satans to show that the qualities of hypocrites are the same as those of satan. The rebellious satan obeys Allah's laws, believing that Allah exists, is One and Only He has the right to be worshiped. Satan also believes that the conditions for obtaining happiness in life in this world and in the hereafter are only by following Allah's religion. However, they are a wicked people. They know the truth of something but don't put it into practice. Likewise with the hypocrites, they know what is right and what is wrong, but they do not practice the truth. They even commit seditious and forbidden acts. Allah said: And satan said when the matter (hisab) had been settled, \"Indeed Allah has promised you a true promise, and I have promised you, but I violated it. I have no power over you, except (only) I call you then you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, nor can you help me. In fact, I do not justify what you did associating me (with Allah) from the first.\" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) So the form of the parable in this verse is that hypocrites are likened to satan. The Bani Nadhir Jews are equated with people who have been deceived by Satan's enticements. Their fear of Muslims is equated with their fear of Allah, and even more than that."
		   },
		   {
			"id": 5143,
			"surah": 59,
			"ayat": 17,
			"tafsir": "This verse explains the consequences that will be experienced by the hypocrites and the Banu Nadhir Jews who have been deceived by Satan. Both of these groups will be put into hell with the devil who became their friend. They are eternal in hell. That is the recompense according to their deeds."
		   },
		   {
			"id": 5144,
			"surah": 59,
			"ayat": 18,
			"tafsir": "Believers are commanded to fear Allah, by carrying out the commandments and staying away from His prohibitions. Including carrying out God's commands is purifying obedience and submitting oneself only to Him, there is not the slightest element of shirk in it, carrying out the obligatory prayers, and establishing good relations with fellow human beings. In another verse, the signs of a pious person are explained: Virtue is not turning your face east and west, but virtue is (virtue) of those who believe in Allah, the last day, angels, books and prophets the prophet and gave the treasures he loved to relatives, orphans, the poor, people on the way (travelers), beggars, and to free slaves, who perform prayers and pay zakat, people who keep promises when promised, and those who are patient in poverty, suffering and in times of war. They are the people who are true, and they are the people who are pious. (al-Baqarah\/2: 177) In the Qur'an the expression of the word piety has several meanings, including: First, carry out God's commands and stay away from His prohibitions, as stated in the Qur'an and taught by the Prophet Muhammad as example ayat above. Second, fear of disobeying Allah's commandments and protecting oneself from immoral acts. People who fear Allah should always pay attention and examine what they will do, whether there will be benefits for themselves in the hereafter or not. Of course all that will be useful for himself in the hereafter. In addition, a person should always take into account his own actions, whether they are in accordance with religious teachings or not. If more is done that is prohibited by Allah, let him try to cover it with good deeds. In other words, this verse instructs humans to always be self-aware, to take into account everything that they will and have done before Allah calculates it in the hereafter. A warning at the end of this verse to always fear Allah, because He knows that everything His servants do, both visible and invisible, outwardly and inwardly, there is nothing that escapes His knowledge."
		   },
		   {
			"id": 5145,
			"surah": 59,
			"ayat": 19,
			"tafsir": "This verse can mean specific and can also mean general. Of particular significance is that this verse relates to the hypocrites and the Bani Nadhir Jews and their attitudes and actions towards the Muslims at the time this verse was revealed. The general meaning is all those who like to mislead other people from the right path and those who want to be led astray because they are deceived by the seductions and grandiose promises of those who mislead. That is, never should a believer be like a person who forgets Allah, then Allah forgets him. People who forget Allah, such as the hypocrites and the Bani Nadhir Jews at the time of the Prophet Muhammad, did not fear Him. They only think about the life of this world, not thinking about the life in the hereafter. They are preoccupied with their wealth and children and grandchildren and everything related to worldly pleasures. Allah's Word: O you who believe! Do not let your possessions and your children distract you from the remembrance of Allah. And whoever does so, then they are the ones who are the losers. (al-Munafiqun\/63: 9) Then it was explained that if someone forgets Allah, then Allah forgets him too. The meaning of Allah's statement to forget them is that Allah does not like them, so they wallow in error, the longer they go astray, the further they are from the straight path, the path that Allah pleases. Therefore, in the hereafter they are also forgotten by Allah, and Allah does not help and lighten their suffering. Finally they are put into hell, as a reward for their deeds and actions. It was emphasized that people like the hypocrites and Bani Nadhir Jews were wicked people. They know what is good (hak) and what is wrong, what is good and what is evil. However, they do not practice what is right and good, but instead practice what is wrong and what is evil."
		   },
		   {
			"id": 5146,
			"surah": 59,
			"ayat": 20,
			"tafsir": "The inhabitants of hell are not the same as the hypocrites and Bani Nadhir, with the inhabitants of heaven, such as the Muhajirin and Ansar. Allah says: Do those who commit evil think that We will treat them like those who believe and do good, that is, they are the same in life and in death? How bad their judgment was. (al-Jatsiyah\/45: 21) And His word: Is it fitting that We treat those who believe and do good the same as those who do mischief on earth? Or is it appropriate for We to consider those who are pious to be the same as those who are evil? (sad\/38: 28) Allah explains that they are not the same, because the people who are put into heaven are those who are lucky, achieve what they want. The good deeds they do exceed the bad deeds they have done, so that the reward they receive can cover the sins they have committed."
		   },
		   {
			"id": 5147,
			"surah": 59,
			"ayat": 21,
			"tafsir": "In this verse it is explained that if the mountains had been given reason, thought, and feelings as they have been bestowed upon humans, then the Qur'an had been sent down to them, the mountains would have submitted to Allah, and even crumbled out of fear of Him. His. However, the Qur'an is not for mountains, but for humans. What a beautiful metaphor this is, comparing humans who are small and weak, with mountains that are so big, high, and hard. It is said that the mountain will bow before the revelation of Allah, and will crumble because of fear. This verse is a warning to humans who do not want to use the reason, thoughts, and feelings that God has bestowed upon them. They are more influenced by the passions and pleasures of life in the world, so that it closes their minds and minds. For fear of losing influence and position, they will not want to follow the truth. How high is the value of the Qur'an, so that not all of God's creatures can properly understand its intentions and purposes. In order to understand it, certain conditions must be met, including: adequate knowledge, using common sense, clearing one's conscience, and sincere intentions. The condition of some people is explained in the word of God: Then after that your heart becomes hard, so that (your heart) is like a rock, even harder. Whereas from those stones there must be rivers (the water) gushing out of them. There is also a split and then springs out of it. And there are also those who slide down because of fear of Allah. And Allah is not unaware of what you do. (al-Baqarah\/2: 74) This verse is also the same as the word of Allah: And if there is a reading (Holy Bible) with which the mountains can be shaken, or the earth is split open, or a dead person can speak, (that is Al-Qur'an). (ar-Ra'd\/13: 31) Then it was explained that the parables contained in the Qur'an should be a lesson for people who want to use their minds, thoughts and feelings. Thus, they can carry out the instructions of the Qur'an as well as possible."
		   },
		   {
			"id": 5148,
			"surah": 59,
			"ayat": 22,
			"tafsir": "Allah, who sent down the Qur'an and established it as a guide for humans, is God Almighty, there is no god but Him. He is the one who deserves to be worshiped, no one else. All worship of other than Allah, such as trees, stones, statues, the sun, and so on, is an act of misguidance. He is All-Knowing of all that exists, both visible and unseen in the heavens and on earth. He is Most Gracious to His creatures, and Most Compassionate."
		   },
		   {
			"id": 5149,
			"surah": 59,
			"ayat": 23,
			"tafsir": "He is Allah, God Almighty, who owns everything that exists, and takes care of everything according to His will. The Blessed One of all kinds of defects and deficiencies. The Most Prosperous, the Most Preserving of the safety, balance and survival of all His creatures, the Mighty One does not abuse His creatures, but His demands are very strict. He is the Greatest and Most Holy of all that is associated with Him."
		   },
		   {
			"id": 5150,
			"surah": 59,
			"ayat": 24,
			"tafsir": "Allah is the Creator of all His creatures. He who created all creatures from nothing to nothing. Which forms creatures according to their respective duties and characteristics. He has beautiful qualities, a great name that is not owned by any other being, apart from Him. To Him glorify and praise everything in the heavens and on earth. What really matters in prayer is sincerity, solemnity and submission to Allah. By reading these verses, it is hoped that all three will appear, so that the prayer will be accepted by God. Narrated by al-Bukhari and Muslim from Abu Hurairah from the Prophet PBUH said: Verily Allah has ninety-nine names, one hundred minus one, whoever memorizes, lives and absorbs them, will surely enter heaven. (Al-Bukhari and Muslim) What is meant by living and absorbing it here is really understanding the attributes of Allah, feeling His majesty, greatness, and power over all creatures, and feeling His compassion. This creates submission, obedience, and solemnity in everyone who worships Him."
		   }
	]
}
