{
	"tafseer": [
		{
			"id": 6226,
			"surah": 113,
			"ayat": 1,
			"tafsir": "In the following verses, Allah commands the Prophet Muhammad and all Muslims to always take refuge in God, the Creator of all creatures, so that they are protected from all kinds of evil or the consequences of evil that are caused by the creatures He has created."
		   },
		   {
			"id": 6227,
			"surah": 113,
			"ayat": 2,
			"tafsir": "In the following verses, Allah commands the Prophet Muhammad and all Muslims to always take refuge in God, the Creator of all creatures, so that they are protected from all kinds of evil or the consequences of evil that are caused by the creatures He has created."
		   },
		   {
			"id": 6228,
			"surah": 113,
			"ayat": 3,
			"tafsir": "Then Allah explained that some of His creatures often cause evil at night when everything is covered by darkness. Meanwhile, the pitch black night creates fear and anxiety, as if there is something hidden in the darkness of the night that will hurt people."
		   },
		   {
			"id": 6229,
			"surah": 113,
			"ayat": 4,
			"tafsir": "In this verse, Allah orders people to take refuge in Him from the evil of sorcerers who blow spells with the intention of breaking the bonds of affection and tearing apart kinship ties, such as marriage ties and so on. The act of magic can turn the affection between two close friends into enmity. The agitator brings news that appears to be true and hard to refute, as a sorcerer does in his attempt to separate a husband and wife. Jumhur scholars based on authentic hadith which explains that the Prophet was bewitched by Labid al-A'sam. This does not affect the revelation that Allah revealed to him, but only the body and feelings that are not related to the Shari'a. Sheikh Muhammad 'Abduh said, \"With regard to the above statement, a hadith has been narrated about the Prophet being bewitched by Labid bin al-A'sam, which was very impressive on the personality of the Prophet, so that it was as if he was doing something even though he was not doing it. or took something but he did not take it. Then Allah told him about the sorcerer. Then the magic was released in his heart, then the Prophet saw became healthy again, and this surah was revealed. The Prophet saw was enchanted so that it touched the mind which is directly related to his soul, because of that the polytheists say, as Allah says: You are only following a man who is bewitched.(al-Isra'\/17: 47) On the other hand, what we must believe is that the Qur'an is mutawatir and denies that the Prophet was bewitched, because those who said so were polytheists. The Qur'an denounces their words. If this hadith were included in the anthem There are authentic hadiths, but they are classified as Sunday hadiths which are not sufficient to be used as a basis for aqidah. While the infallibility of the prophets is a creed that has been firmly held. Avoiding the Prophet saw from magic does not mean turning off magic as a whole. Maybe a person who is enchanted becomes mad but it is impossible for the Prophet (s) to happen because Allah is guarding and protecting him. According to 'Atha', Al-hasan, and Jabir, this surahh al-Falaq is a Makkiyyah surahh which was revealed before the migration, while what they accuse was that the Prophet saw was bewitched in Medina. Therefore, it is very weak to hold on to such hadiths and to declare them as authentic hadiths. Muslims must adhere to the text of the Al-Qur'an, there is no need to adhere to the hadith of the Sunday."
		   },
		   {
			"id": 6230,
			"surah": 113,
			"ayat": 5,
			"tafsir": "In this verse, Allah commands the Muslims to seek refuge in Him from the evil of people who are envious if he carries out his envy with earnest efforts and various ways to remove the favors of the person who is the object of his envy and by setting a trap to plunge the person he envies fall into abyss. The ruse he was carrying out was so cunning that it was hard to see through. There is no way to avoid it except by asking for help from Allah, the Creator, because it is He who can reject his tricks, avoid his crimes, or thwart his efforts. Hasad is unlawful, and was the first sin when the devil was jealous of the Prophet Adam, and Qabil was jealous of Abel."
		   }
	]
}
