{
	"tafseer": [
		{
			"id": 5164,
			"surah": 61,
			"ayat": 1,
			"tafsir": "Everything in the heavens and earth acknowledges that only Allah has the right to be worshiped and nothing else, He is the One who creates, controls, sustains life, and determines everything in this universe. Allah has perfect attributes, and all creatures are subject to His will. He creates everything according to the purposes and goals He wills, as well as according to its uses."
		   },
		   {
			"id": 5165,
			"surah": 61,
			"ayat": 2,
			"tafsir": "After Allah explained the characteristics of His perfection, He reminded the Muslims of their shortcomings, that is, they said a word, but they did not realize it or do it. Among other things, they say, \"We want to do the good things that God has commanded,\" but when the command comes, they don't do it. There are two kinds of human weakness that this verse points out, namely: 1. The discrepancy between their words and their deeds. This weakness seems easy to fix, but difficult to implement. There are very many people who are good at talking, like to recommend a good deed, and remind others to stay away from God's prohibitions, but they themselves do not carry it out. It was narrated by Ibn 'Abbas that 'Abdullah bin Rawahah said, \"The believers at the time of the Prophet before the jihad were required to say, \"If we knew the actions that were liked by Allah, of course we would carry them out.\" So the Prophet said that the actions that were most liked by Allah were believe in Him, strive to eradicate disobedience that can damage faith, and acknowledge the truth of the message conveyed by His Prophet. After the order for jihad came, some believers found it hard to do it. So this verse came down as a reproach for their bad attitude 2. Not keeping the promises they have made. Likes to keep promises that have been set is one of the characteristics of the characteristics of believers. If that characteristic is not possessed by people who claim to believe in Allah and His Messenger, it means he has become a hypocrite. The Messenger of Allah said: There are three signs of a hypocrite: when he promises, he breaks his promise a, if he says, he lies and if he is believed, he betrays. (Al-Bukhari and Muslim) But that doesn't mean that people can't tell the truth if they can't do it themselves. Saying the truth is mandatory, while carrying it out depends on ability. Allah said: So fear Allah according to your ability and listen and obey; and spend good treasures for yourself. And whoever guards himself from stinginess, those are the lucky ones. (at-Tagabun\/64: 16)"
		   },
		   {
			"id": 5166,
			"surah": 61,
			"ayat": 3,
			"tafsir": "Allah warns that it is a great sin for someone to say something, but he himself does not carry it out. This holds true both in the sight of God and in the eyes of society. Keeping promises is a manifestation of strong faith. Noble character, and a humane attitude towards a person, engenders the trust and respect of society. On the other hand, acts of violating promises are signs of weak faith, as well as bad behavior and inhumane attitudes, will create mutual suspicion and grudges in society. For this reason, the religion of Islam strongly denounces people who like to lie and break their promises. So that believers don't have this reprehensible character, it would be nice if keeping promises and telling the truth were made the main educational goals taught to children besides believing in Allah and His Messenger and training themselves to do the various forms of worship that are required. ."
		   },
		   {
			"id": 5167,
			"surah": 61,
			"ayat": 4,
			"tafsir": "In this verse Allah commends those who fight in His cause with regular ranks and firm unity. Allah loves such Muslims. There are no splits, even the smallest ones, like a solid wall tightly packed with concrete stones. This verse suggests to the Muslims that they maintain a strong and solid unity, have high spirits, like to fight and make sacrifices. Forming and maintaining unity among Muslims means getting rid of everything that might cause division, such as differences of opinion about something trivial and unimportant, selfishness, pride in ethnicity and ancestry, prioritizing class, inhumanity, and so on. . Therefore, in fostering unity and oneness, Allah warns and orders the Muslims to guard and organize the rows (rows) in prayer neatly, shoulder to shoulder, not a single empty place. The empty place will be filled by satan, while satan is the enemy of humans. It is not good for someone to pray alone behind the row, except by pulling back someone who is in the row in front of him. Arranging ranks in prayer is an exercise in arranging ranks in jihad in the way of Allah."
		   },
		   {
			"id": 5168,
			"surah": 61,
			"ayat": 5,
			"tafsir": "Allah ordered the Prophet Muhammad to convey to the Muslims and People of the Book about Prophet Musa who regretted his people, why they opposed and hurt him. Even though they knew that he was an apostle sent by Allah to them. In another verse it is explained that Musa ordered his people to fight so they could enter the city of Baitulmakdis, but his people refused. Allah said: O my people! Enter the holy land (Palestine) that Allah has determined for you, and do not turn back (for fear of the enemy), then you will become a loser. They said, \"O Musa! Indeed, in that country there are people who are very strong and cruel, we will not enter it until they leave it. If they leave there, surely we will enter.\" (al-Ma'idah\/5: 21-22) This verse is an antidote to the hearts of the Prophet Muhammad and the Muslims to always be patient with the attitude of the hypocrites, who claim to be Muslims, but behind the Prophet they deny it. In connection with that, the Prophet once said, \"Hopefully Allah will bestow His mercy on Musa whose people hurt him more severely than what happened to me, but he remained patient.\" Allah forbids Muslims to offend the Prophet Muhammad, as what happened to the Prophet Musa. He said: O you who believe! Do not be like those who hurt Moses, so Allah cleared him of the accusations they had made. And he is a man who has an honorable position in the sight of Allah. (al-Ahzab\/33: 69) After those who were disobedient and offended the Prophet Muhammad turned away and denied the truth, while they knew the truth, Allah turned their hearts away from His guidance. Thus, it was no longer possible for them to get any leads. Allah says: And (similarly) We turned away their hearts and eyes like the first time they did not believe in it (the Qur'an), and We left them confused in error. (al-An'am\/6: 110) The meaning of Allah's words \"turn away the hearts of the disbelievers\" in this verse is to let them go astray. The more misguidance and disobedience they commit, the farther they are from God's guidance, making it difficult for them to return to the right path. At the end of this verse, Allah confirms His statement above that people who have drifted away from the true path will no longer be able to receive taufik and guidance from Him. They are the wicked, whereas Allah will not guide the wicked."
		   },
		   {
			"id": 5169,
			"surah": 61,
			"ayat": 6,
			"tafsir": "Allah ordered the Prophet Muhammad to convey to the Muslims and People of the Book, the story of the denial of Jesus' people when he told his people that he was Allah's apostle who was sent to them. He also confirmed the Torah that was brought by the Prophet Musa, as well as the books of Allah that had been revealed to the previous prophets. He called on his people to believe in the apostle who came later named Ahmad (Muhammad saw). In another verse it is also emphasized that the news about the arrival of Muhammad as the last prophet and apostle of Allah is also found in the Torah and the Bible. Allah said: (That is) those who followed the Messengers, Prophets who were unlettered (ill illiterate) whose (names) they found written in the Torah and the Gospel that they had. (al-A'raf\/7: 157) In a hadith, the Prophet said: Verily I am a servant of Allah as the seal of the prophets. Indeed Prophet Adam is like a gemstone. I will inform you about the tafsir of the verse, namely the prayer of my father the Prophet Abraham and the good news from the Prophet Jesus regarding my arrival, and the dream that my mother and all the mothers of the prophets saw. (Ahmad's history from 'Irbadh bin Sariyah) In the Torah there are many signs of the arrival of the Prophet Muhammad as the last prophet and apostle, such as Genesis 21: 13. \" It means the descendants of Hajar, the mother of Ishmael who later became the Arabs who inhabited the Arabian Peninsula. When the Prophet Abraham went to Egypt with his wife, Sarah, he was awarded by the King of Egypt a female slave, named Hajar, who he later made as his wife. When Hajar had given birth to her son Ishmael, she was delivered by Abraham to Mecca at the behest of Allah. It was in Mecca that Ishmael grew up and became prolific. Among his descendants was named Muhammad who later became the last prophet and apostle. The Book of Genesis 21:18 instructs that the Children of Israel follow and support the Prophet Muhammad, who will come later. \"Get up, take up the slave, support him, for I will make him a great nation.\" Likewise, the Book of Genesis 17: 20 states: \"I have granted your request regarding Ishmael, that I have blessed him and given him and multiplied him greatly, twelve kings will be divided from him and I will make him a great nation.\" The book of Habakkuk 3: 3 states: \"That God came from a friend and the Most Holy One from the mountains of Paran-Selah. So His glory covered all the heavens and the earth was full of praise.\" Here are described the friends and saints of the Paran mountains. What is meant by friends here is the Prophet Muhammad, and Paran is Mecca. Likewise the Prophet Musa in the Book of Deuteronomy 18: 17-22 has stated the arrival of the Prophet Muhammad saw: \"Then at that time the Lord said to me (Moses), \"It is true what they (the Children of Israel) said.\" That I (God) will make to them is a prophet from among his brothers (namely the Prophet and the Children of Israel) who is like you (the Prophet Musa) and I will put all my words in his mouth and he will also tell him everything I tell him. hear all My words that will be spoken by him in My name, surely I will demand them later on that person. But there are Prophets who conduct themselves arrogantly and speak words in My name, which I did not order to say, or who speak in the name of gods, the Prophet will surely be killed by law. So if you say in your heart like this, \"By what may we know that these words are not the words of God?\" That if the Prophet speaks in the name of God, then what he says doesn't happen or doesn't come, that is, a word that is not the word of God, then the Prophet also says carelessly, don't be afraid of him.\" In the verses of the Torah above, there are indications of the prophecy of the Prophet Muhammad as follows, \"A prophet among all his brothers.\" This shows that the future prophet will come from the brothers of the Children of Israel, but not from the Children of Israel themselves, because the Children of Israel are descendants of Jacob and he is the son of Isaac. While Isaac is Ishmael's brother. The brothers of the Children of Israel were the Children of Ismail, and the Prophet Muhammad was clearly a descendant of the Children of Ismail. Then the sentence \"like you\" gives the sense that the prophet who will come must be like Prophet Musa, meaning a prophet who brings religion like that brought by Prophet Musa. As it is written that the Prophet Muhammad was the only prophet who brought the Shari'a which also applies to the Children of Israel. Then it is said that the Prophet was \"not arrogant\", \"and would not be killed.\" Muhammad saw, as it is understood, was not an arrogant person, both before becoming a prophet, let alone after becoming a prophet. Before becoming a prophet, it turned out that he had been liked by the general public, and was trusted by the Quraysh people. This is proven by his calling al-Amin (trust). If he was arrogant, surely he would not be given that highly commendable title and the Prophet Muhammad would not be killed. Christians apply the prophecy to Jesus, even though they believe that Jesus died on the cross. This clearly contradicts the prophetic verse itself. Because the prophet must not have been killed (crucified and so on). There are many other clues in the Torah that explain Muhammad's prophethood as given by the Prophet Isaiah 42: 1-2; Prophet Yermin 31: 31-32, Prophet Daniel 2: 38-45; and many more that need not be mentioned here. Likewise in the Bible where Muhammad is mentioned a lot in the book of John. Then it was explained that the prophet and apostle named Ahmad was born with strong arguments and miracles given by Allah. However, they also denied it and said that Muhammad was a sorcerer. About the Prophet Muhammad that was conveyed by all the prophets, Allah explained in His word: And (remember), when Allah took the agreement from the prophets, \"When I gave you the book and wisdom then came to you a Messenger who confirmed what was in you , you will truly believe in him and help him.\" Allah said, \"Do you agree and accept the agreement with Me for that?\" They replied, \"We agree.\" Allah said, \"Then testify you (the prophets) and I will be a witness with you.\" (Ali 'Imran\/3: 81)"
		   },
		   {
			"id": 5170,
			"surah": 61,
			"ayat": 7,
			"tafsir": "Allah states, \"Who is more unjust than those who make up something about Allah\", as saying that Allah has partners in governing this world. From this verse it is understood that the most unjust people are those who are invited to embrace the religion of Allah, the true religion and bring people to happiness in this world and in the hereafter, namely Islam, they reject the invitation. They even invent lies against Allah, such as denying the Prophet Muhammad, viewing the Qur'an as a magic creation of a sorcerer named Muhammad, and so on. Those who invent lies about God are wronging themselves, by doing forbidden things. People who do that deed will not get taufik from Allah."
		   },
		   {
			"id": 5171,
			"surah": 61,
			"ayat": 8,
			"tafsir": "It was narrated by Ibn 'Abbas that the revelation did not come down to the Prophet Muhammad for forty days. So a Jewish leader, namely Ka'ab bin al-Ashraf, asked the Jews to be happy because Allah had extinguished the light of Muhammad's preaching by not sending down revelations to him anymore. Hearing Ka'ab's words the Prophet felt sad. In this regard, this verse was revealed. This verse explains the reasons for those who lie to Allah. These sinful acts and utterances aim to extinguish the light of the Islamic religion which illuminates people who are in darkness. Their actions are like a person who wants to extinguish the sun that dazzles the view with a breath of his mouth that means nothing. At the end of this verse it is emphasized that Allah will continue to radiate the light of His religion to all corners of the world with the preaching of the Prophet Muhammad and those who believe even though the disbelievers do not like it."
		   },
		   {
			"id": 5172,
			"surah": 61,
			"ayat": 9,
			"tafsir": "This verse confirms that Allah has sent the Prophet Muhammad with the task of conveying His religion to all mankind. These religious principles are found in the Al-Qur'an and hadith, which contain instructions for achieving happiness in the world and the hereafter. With the advent of Islam, the religion that existed before was declared no longer valid. Islam is superior to other religions according to the will of Allah, even though the polytheists do not like it."
		   },
		   {
			"id": 5173,
			"surah": 61,
			"ayat": 10,
			"tafsir": "(10-11) In this verse Allah commands the Muslims to do good deeds by saying, \"O you who believe in Allah and His messenger, do you all want me to show you a trade that is beneficial and sure to bring multiple profits?\" and eternal good fortune or release you from the fires of hell.” The expression of the verse above gives the understanding that good deeds with great rewards are as great as a business that never loses because it will enter heaven and be safe from the fires of hell. Allah's Word: \"Indeed, Allah buys from the believers, both themselves and their property by providing heaven for them\". (At-Taubah\/9:111) Then mention the forms of trading that provide huge profits, namely: 1. Always believe in Allah, the angels, His books, His messengers, the existence of the Day of Judgment, qada' and qadar Allah. 2. Doing good deeds solely for the sake of Allah, not because of pleasure, is a manifestation of one's faith. 3. Jihad in the way of Allah. Jihad is all kinds of efforts and efforts made to uphold the religion of Allah. There are two kinds of jihad mentioned in this verse, namely jihad with the body and soul and jihad with wealth. Jihad with body and soul is fighting against the enemies of religion who want the destruction of Islam and the Muslims. Jihad with wealth, namely spending property to uphold God's sentence, such as for war costs, building mosques, houses of worship, schools, hospitals, and other public interests. In addition, there are other forms of jihad, namely jihad against lust, self-control, trying to form good character in oneself, eliminating jealousy, and so on. At the end of this verse it is emphasized that faith and jihad are deeds with the best consequences, both for oneself, children, family, property and society, if humans truly understand."
		   },
		   {
			"id": 5174,
			"surah": 61,
			"ayat": 11,
			"tafsir": "see verse 10"
		   },
		   {
			"id": 5175,
			"surah": 61,
			"ayat": 12,
			"tafsir": "It was narrated by at-Tirmidhi and al-hakim and declared valid from 'Abdullah bin Salam that when the companions of the Messenger of Allah were sitting around chatting, some of them said, \"If we knew the deeds which are more beloved to Allah we would surely will do it,\" then this verse was revealed. If man has faith, acknowledges the truth of the Messenger of Allah and strives in His way, surely Allah will forgive his sins. As if the sin had never been committed or kept him away from the sinful act. Allah also prepared a place for them in paradise beneath which rivers flow. The place in heaven is the most beautiful place, and the most pleasing to the hearts of those who are in it."
		   },
		   {
			"id": 5176,
			"surah": 61,
			"ayat": 13,
			"tafsir": "In this verse, it is explained that the victory and profit that will be obtained by the Prophet and the Muslims in the world, that is, they will be able to defeat their enemies, conquer several countries in the near future, provide a good position for the Muslims, as well as faith and physical strength. Thus, they ruled in East and West, and the religion of Islam spread throughout the world. This verse includes verses that explain miracles, namely explaining something that will happen in the future. The Messenger of Allah and his friends believed in this, so that it grew great strength and enthusiasm among the Muslims. In history, it has been seen and proven that in a very short time, the Islamic religion has been embraced by a portion of the world's population, from the western tip of Africa to the eastern tip of Indonesia, from Morocco to Merauke, and from Central Asia in the north to Africa in the south. Then Allah ordered the Prophet Muhammad to convey to the Muslims about the benefits they would get from this trade in the world with benefits and in the hereafter in the form of heaven. The use of the word commerce in this verse is used as an analogy because Arab society at that time lived from commerce and commerce."
		   },
		   {
			"id": 5177,
			"surah": 61,
			"ayat": 14,
			"tafsir": "Allah commands the Muslims to become helpers of Allah's religion, to spread His religion, to exalt His words so that no one can defeat them, with faith and jihad. The same thing was done by the closest friends of Prophet Isa who said to them, \"Who is the helper of Allah's religion?\" They replied, \"We are the helpers of Allah's religion.\" When Prophet Isa conveyed his treatise to the Children of Israel with the help of his loyal friends, some of the Children of Israel accepted his call, while others denied and rejected it. Those who reject this accuse Jesus of being a child of adultery, who was born because of his mother Maryam's adultery with a man, and some say that Jesus is the son of God, His lover, and so on. In dealing with those who denied the call of Prophet Isa and fabricated lies about him, Allah strengthened the hearts of those who believed from them, so that they succeeded in defeating the enemies. Allah's Word: Indeed, We will help Our messengers and those who believe in the life of this world and on the day when the witnesses appear (the Day of Judgment). (Gafir\/40: 51)"
		   }
	]
}
