{
	"tafseer": [
		{
			"id": 6131,
			"surah": 98,
			"ayat": 1,
			"tafsir": "In this verse, Allah reveals that those who deny the apostleship of the Prophet Muhammad, consisting of Jews, Christians and polytheists, will not give up their disbelief, and will not abandon the traditions of their ancestors, until evidence comes. that is, the messenger of the Prophet Muhammad. The arrival of the Prophet saw caused a shock in the beliefs and customs that had been entrenched and rooted within them. They stated that what the Prophet brought was no different or more than what was contained in their religion. Thus, according to them, there is no good in following the new by leaving the old, even following the old is more reassuring for the soul because it does not conflict with the attitudes of their ancestors."
		   },
		   {
			"id": 6132,
			"surah": 98,
			"ayat": 2,
			"tafsir": "In these verses, Allah explains that what is meant by proof is the personal heart of the Holy Prophet who recited to the disbelievers the pages of the Qur'an which are clean from human interference, from all kinds of errors, and from additions, i.e. proofs that radiate truth. Allah says: (Which) will not be visited by evil either from the front or from behind (in the past and in the future). (Fussilat\/41: 42) The true teachings contained in the books of the previous prophets, such as Prophet Musa, Prophet Isa, and Prophet Abraham, are summarized in the Qur'an. In another verse which has almost the same meaning, Allah says: And indeed, (the Qur'an) is (mentioned) in the books of the former. (asy-Syu'ara'\/26: 196) Indeed this is found in the earlier books, (namely) the books of Abraham and Moses. (al-A'la\/87: 18-19) Some scholars are of the opinion that what is meant by the al-kitab are surahhs and verses of the Qur'an, because each surah is a solid book. There are also those who understand that the laws and regulations contained in God's words are without error. In another verse, Allah says: Praise be to Allah who has sent down the Book (the Qur'an) to His servant and He has not made it crooked; as a straight guide, to warn of a very painful punishment from His side and give good news to the believers who do good that they will get a good reward. (al-Kahf\/18: 1-2)"
		   },
		   {
			"id": 6133,
			"surah": 98,
			"ayat": 3,
			"tafsir": "In these verses, Allah explains that what is meant by proof is the personal heart of the Holy Prophet who recited to the disbelievers the pages of the Qur'an which are clean from human interference, from all kinds of errors, and from additions, i.e. proofs that radiate truth. Allah says: (Which) will not be visited by evil either from the front or from behind (in the past and in the future). (Fussilat\/41: 42) The true teachings contained in the books of the previous prophets, such as Prophet Musa, Prophet Isa, and Prophet Abraham, are summarized in the Qur'an. In another verse which has almost the same meaning, Allah says: And indeed, (the Qur'an) is (mentioned) in the books of the former. (asy-Syu'ara'\/26: 196) Indeed this is found in the earlier books, (namely) the books of Abraham and Moses. (al-A'la\/87: 18-19) Some scholars are of the opinion that what is meant by the al-kitab are surahhs and verses of the Qur'an, because each surah is a solid book. There are also those who understand that the laws and regulations contained in God's words are without error. In another verse, Allah says: Praise be to Allah who has sent down the Book (the Qur'an) to His servant and He has not made it crooked; as a straight guide, to warn of a very painful punishment from His side and give good news to the believers who do good that they will get a good reward. (al-Kahf\/18: 1-2)"
		   },
		   {
			"id": 6134,
			"surah": 98,
			"ayat": 4,
			"tafsir": "The situation of the Jewish infidels, Christians and polytheists after the arrival of the Prophet was different from their situation before. They were before the Prophet saw came in a state of disbelief, immersed in ignorance and lust, but after the Prophet came, a group of them believed. Thus, their situation is not what it used to be. Those who do not believe even doubt the truth brought by the Prophet, some even believe in the truth altogether. Great debates and disputes sometimes occur between polytheists and Christians. The Jews said to the polytheists, \"Surely Allah will send a prophet from among the Arabs who live in Mecca.\" They explained the characteristics of the prophet and threatened people saying that when the prophet was born, they would help him by supporting all his actions and working together to destroy the polytheists. It was in such circumstances that the Prophet Muhammad was sent. Then the polytheists were all hostile and opposed to the Prophet. They also invited other Arabs to be hostile to him and hurt his followers whose hearts have been illuminated with faith and widened their chests to know the truth. Then Allah in this verse consoled His Prophet by saying that he did not need to be troubled or upset because of their attitude and challenges towards him. It was also their attitude towards the previous prophets that they divided."
		   },
		   {
			"id": 6135,
			"surah": 98,
			"ayat": 5,
			"tafsir": "Due to divisions among them, in this verse, in a tone of reviling Allah, it is emphasized that they were not ordered except to worship Him. The orders addressed to them are for the good of the world and their religion, and to achieve happiness in this world and the hereafter. They are also ordered to surrender themselves both physically and spiritually in worshiping Allah and cleansing the deeds of shirk as the religion brought by the Prophet Abraham who distanced himself from the disbelief of his people to the religion of monotheism by sincerely worshiping Allah. Sincerity is one of the two conditions for acceptance of charity, and that is the work of the heart. While the second is to follow the Sunnah of the Prophet. Allah said: Then We revealed to you (Muhammad), \"Follow the straight religion of Abraham.\" (an-Nahl\/16: 123) His other words: Abraham was not a Jew and not (also) a Christian, but he was a straight man and a Muslim. (Ali 'Imran\/3: 67) Establishing prayer in this verse means doing it continuously at all times by focusing the soul on the greatness of Allah, to get used to submitting to Him. While what is meant by issuing zakat is distributing it to those who are entitled to receive it as determined by the Al-Qur'anul Karim. The description of the verse above about sincerity in worship, abstaining from shirk, establishing prayers, and issuing zakat, is the intention of the straight religion which is mentioned in other holy books."
		   },
		   {
			"id": 6136,
			"surah": 98,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that disbelievers from among the People of the Book and polytheists have polluted their souls with shirk and immorality and have denied the real truth of Muhammad's prophethood. They will be tormented by Allah with torments that will not allow them to escape from it forever, namely the burning fires of hell. The torture was in return for their actions. They are classified as the worst creatures."
		   },
		   {
			"id": 6137,
			"surah": 98,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains the reward for those who believe. Their souls have been illuminated by the light of guidance and confirming what the Prophet brought. They also practice it by sacrificing their lives, property, and whatever they have in the way of Allah, and behave well with all of Allah's servants. They are classified as the best creatures."
		   },
		   {
			"id": 6138,
			"surah": 98,
			"ayat": 8,
			"tafsir": "Then in this verse, Allah explains that what they will receive from their Lord is paradise 'Adn in which there are various pleasures and delights, more complete and perfect than the pleasures and delights of this world, and beneath which rivers flow. They live in it forever. They are entitled to receive this reward because they are in the good pleasure of Allah and remain in His provisions. They get praise and achieve what they want from the happiness of life in this world and in the hereafter. They please Allah and they are pleased with him. Rewards which are the happiness of the world and the hereafter are only obtained by those whose souls are full of piety to Allah."
		   }
	]
}
