{
	"tafseer": [
		{
			"id": 6217,
			"surah": 111,
			"ayat": 1,
			"tafsir": "In this verse Allah explains that Abu Lahab will lose and perish and these words as a curse from Allah for him. Perish in both hands because the hand is a tool to work and act. If both of a person's hands have perished, it means that he has perished. Abu Lahab said, even though his name was Abdul-'Uzza, because he had a charming handsome face. However, the scholars are of the opinion that it was said by Abu Lahab because he must be a resident of hell whose fire is volatile. It is like the communists choosing the red flag and the leftist group because the leftist group is ashabusy-syimal. The beginning of this verse is a curse on Abu Lahab's destruction and the conclusion is a statement from Allah that the curse has been proven and Abu Lahab will surely lose in this world and in the hereafter. When the verse tabbat yadA abi lahabin watabba came down, Umm Jamil al-'AurA (a woman who was blind in one eye) bint harb came screaming. He carried a fist of stones, as he said. \"He denounced (our religion), we reject him. We hate his religion and we deny his orders.\" At that time the Prophet sitting in the mosque with Abu Bakr. When Abu Bakr saw the woman, he said, O Messenger of Allah, that woman has come. I was afraid he would see you.\" So the Messenger of Allah said \"He will not see me.\" Then the Prophet recited a verse and took refuge in it. He read \"And when you read the Qur'an, We made it between you and those who an unbeliever is a closed barrier.\" The woman stood in front of Abu Bakr, but he could not see Rasulullah saw. He said, \"O Abu Bakr, I got the news that your friend has insulted me.\" Abu Bakr said, \"No . For God's sake, the owner of the Kaaba. He did not criticize you.\" Then the woman turned away saying, \"The Quraysh already knew that I was the daughter of their chief.\" (History of al-hakim)"
		   },
		   {
			"id": 6218,
			"surah": 111,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that what Abu Lahab was proud of in life, namely wealth and position, in fact could not save him from Allah's punishment on the Day of Judgment. Likewise, his efforts to antagonize and defeat the Prophet Muhammad were not successful at all. Abu Lahab really hated the Prophet and was the most persistent in inviting people to oppose him and was the harshest in dealing with him. Raba'ah bin 'Ubbad said: I saw the Prophet Muhammad during the Jahiliah era at the dzu al-Majaz market saying, \"Say there is no God but Allah, you will be happy!\" People gathered around him. Behind him was a man, white in color, with squint in his eyes, and two strands of hair on his head, saying, \"He (Muhammad) is religious and a liar.\" He followed the Prophet wherever he went, so I asked, \"Who is this person?\" They replied, \"It was his own uncle Abu Lahab.\" (Ahmad's history) It is hereby explained that Abu Lahab was always against the truth and kept people away from following the truth. He stated that the Prophet Muhammad was a liar. He also opposed him and degraded religious values and the guidance he brought."
		   },
		   {
			"id": 6219,
			"surah": 111,
			"ayat": 3,
			"tafsir": "In this verse, Allah confirms that Abu Lahab will enter a turbulent hell and feel the heat of the punishments of hell. The meaning of this statement is that in fact Abu Lahab will suffer losses, his efforts will not be successful in opposing Allah's religion. There is no point in wealth, effort, and effort for that, because Allah exalts the words of His Messenger, and spreads his da'wah. Abu Lahab will be punished on the Day of Judgment with hell that shoots sparks and the temperature is very hot, Allah's punishment is provided for people like Abu Lahab from among the disbelievers who oppose the Prophet, in addition to the punishment in the world with the failure of his efforts. His wife as the main helper in the effort to oppose and hurt Rasulullah saw will also be punished together. Apart from that, his wife also spread slander everywhere, spread fake news, and fueled the fire of enmity."
		   },
		   {
			"id": 6220,
			"surah": 111,
			"ayat": 4,
			"tafsir": "Allah confirmed that Abu Lahab's wife would be punished like her husband. His wife was named Arwa bint Harb, the sister of Abu Sufyan bin Harb. He was punished for his efforts to spread slander and extinguish the message of the Prophet Muhammad. The Arabs say that a person who tries to spread and destroy relations between people is as if he is carrying firewood between people, as if he is burning silaturrahim between them. There are also those who say that Abu Lahab's wife put thorns, broken glass, and dirt on the roads that the Prophet Muhammad used to walk with the intention of hurting him."
		   },
		   {
			"id": 6221,
			"surah": 111,
			"ayat": 5,
			"tafsir": "In this verse, Allah reveals the ugliness of Abu Lahab's wife, her humility and the ugliness of her deeds. Around his neck there is always a strong rope, which he uses to carry the thorns that will be placed on the path that the Prophet passed. This statement was an insult to her and her husband. The efforts of Abu Lahab's wife were so hard to kindle enmity between people, that Allah described her as a woman who carried firewood hanging around her neck wherever she went. This is the worst parable for a woman. It has been narrated from Sa'id bin Musayyab that Umm Jamil (the nickname of Abu Lahab's wife) had a very expensive necklace, and he said, \"Indeed I will use the price of this necklace to make enemies of Muhammad.\" Then Allah replaced the necklace with a necklace from the fire of hell."
		   }
	]
}
