{
	"tafseer": [
		{
			"id": 5759,
			"surah": 80,
			"ayat": 1,
			"tafsir": "At the beginning of this surah 'Abasa, Allah rebuked the Prophet Muhammad for his surly face and turning away from the blind 'Abdullah bin Ummi Maktum, when this friend interrupted the Prophet's conversation with some Qurayshi figures. At that time 'Abdullah bin Ummi Maktum asked and asked the Prophet to recite and teach some of the revelations that had been received by the Prophet. He repeated this request several times because he did not know the Prophet was busy dealing with some Quraysh officials. In fact, according to the priority scale, the Prophet was dealing with important figures who were expected to convert to Islam because this would have a major influence on the further development of da'wah. So it is humane if the Prophet saw did not pay attention to 'Abdullah bin Ummi Maktum's question, especially since there had been a portion of time that had been set aside for the Prophet's talks with his companions. But the Prophet Muhammad as the best human being and the main role model for every believer (uswah hasanah), the Prophet should not discriminate between human degrees. In setting the priority scale, we also have to pay more attention to the little ones, especially those who have weaknesses, such as 'Abdullah bin Ummi Maktum who is blind and cannot see. So the Prophet should have prioritized discussions with 'Abdullah bin Ummi Maktum rather than with Quraysh figures. In this incident the Prophet did not say a word to 'Abdullah bin Ummi Maktum which caused his heart to hurt, but Allah saw the sour expression on the face of the Prophet Muhammad and did not heed Ummi Maktum which caused him to be offended. The wisdom of Allah's rebuke to the Prophet Muhammad also provides evidence that the Qur'an is not the composition of the Prophet, but is truly the word of Allah. This very harsh rebuke could not have been composed by the Prophet himself. 'Abdullah bin Ummi Maktum was a clean and intelligent person. If he listens to wisdom, he can nourish it and rid himself of the rottenness of polytheism. As for the Quraysh princes, most of them were rich and arrogant people so that the Prophet should not have taken them too seriously to convert to Islam. The Prophet's task is only to convey the treatise and the issue of guidance is solely under the power of Allah. Human strength must be viewed from the perspective of intelligence and determination as well as willingness to accept and implement the truth. As for the assets, position, and influence of the leadership, they are not permanent, at one time they were there and at other times they were lost, so they cannot be relied on. The Prophet himself, after this verse was revealed, always respected 'Abdullah bin Ummi Maktum and often glorified him through his words, \"Welcome to the person who caused me to be reprimanded by Allah. Do you have any needs?\""
		   },
		   {
			"id": 5760,
			"surah": 80,
			"ayat": 2,
			"tafsir": "At the beginning of this surah 'Abasa, Allah rebuked the Prophet Muhammad for his surly face and turning away from the blind 'Abdullah bin Ummi Maktum, when this friend interrupted the Prophet's conversation with some Qurayshi figures. At that time 'Abdullah bin Ummi Maktum asked and asked the Prophet to recite and teach some of the revelations that had been received by the Prophet. He repeated this request several times because he did not know the Prophet was busy dealing with some Quraysh officials. In fact, according to the priority scale, the Prophet was dealing with important figures who were expected to convert to Islam because this would have a major influence on the further development of da'wah. So it is humane if the Prophet saw did not pay attention to 'Abdullah bin Ummi Maktum's question, especially since there had been a portion of time that had been set aside for the Prophet's talks with his companions. But the Prophet Muhammad as the best human being and the main role model for every believer (uswah hasanah), the Prophet should not discriminate between human degrees. In setting the priority scale, we also have to pay more attention to the little ones, especially those who have weaknesses, such as 'Abdullah bin Ummi Maktum who is blind and cannot see. So the Prophet should have prioritized discussions with 'Abdullah bin Ummi Maktum rather than with Quraysh figures. In this incident the Prophet did not say a word to 'Abdullah bin Ummi Maktum which caused his heart to hurt, but Allah saw the sour expression on the face of the Prophet Muhammad and did not heed Ummi Maktum which caused him to be offended. The wisdom of Allah's rebuke to the Prophet Muhammad also provides evidence that the Qur'an is not the composition of the Prophet, but is truly the word of Allah. This very harsh rebuke could not have been composed by the Prophet himself. 'Abdullah bin Ummi Maktum was a clean and intelligent person. If he listens to wisdom, he can nourish it and rid himself of the rottenness of polytheism. As for the Quraysh princes, most of them were rich and arrogant people so that the Prophet should not have taken them too seriously to convert to Islam. The Prophet's task is only to convey the treatise and the issue of guidance is solely under the power of Allah. Human strength must be viewed from the perspective of intelligence and determination as well as willingness to accept and implement the truth. As for the assets, position, and influence of the leadership, they are not permanent, at one time they were there and at other times they were lost, so they cannot be relied on. The Prophet himself, after this verse was revealed, always respected 'Abdullah bin Ummi Maktum and often glorified him through his words, \"Welcome to the person who caused me to be reprimanded by Allah. Do you have any needs?\""
		   },
		   {
			"id": 5761,
			"surah": 80,
			"ayat": 3,
			"tafsir": "In these verses, Allah admonished His Messenger, \"What tells you about the condition of this blind man? Maybe he wants to cleanse himself with the teachings you gave him or wants to benefit himself and he gets the pleasure of Allah, while the teaching has not certainly useful for the infidels of Quraysh that you are dealing with.\""
		   },
		   {
			"id": 5762,
			"surah": 80,
			"ayat": 4,
			"tafsir": "In these verses, Allah admonished His Messenger, \"What tells you about the condition of this blind man? Maybe he wants to cleanse himself with the teachings you gave him or wants to benefit himself and he gets the pleasure of Allah, while the teaching has not certainly useful for the infidels of Quraysh that you are dealing with.\""
		   },
		   {
			"id": 5763,
			"surah": 80,
			"ayat": 5,
			"tafsir": "In these verses, Allah continues His admonition, \"As for the Meccan infidels who feel that they are self-sufficient and capable, they are not interested in believing in you, why are you being too inclined towards them and are eager for them to convert to Islam.\""
		   },
		   {
			"id": 5764,
			"surah": 80,
			"ayat": 6,
			"tafsir": "In these verses, Allah continues His admonition, \"As for the Meccan infidels who feel that they are self-sufficient and capable, they are not interested in believing in you, why are you being too inclined towards them and are eager for them to convert to Islam.\""
		   },
		   {
			"id": 5765,
			"surah": 80,
			"ayat": 7,
			"tafsir": "In these verses, Allah continues His admonition, \"As for the Meccan infidels who feel that they are self-sufficient and capable, they are not interested in believing in you, why are you being too inclined towards them and are eager for them to convert to Islam.\""
		   },
		   {
			"id": 5766,
			"surah": 80,
			"ayat": 8,
			"tafsir": "In these verses, Allah reminded the Prophet Muhammad, \"And as for a person like 'Abdullah bin Ummi Maktum who comes to you in a hurry to get guidance and mercy from his Lord, while he fears Allah if he falls into the valley of error, then you behave indifferent and pays no heed to her requests.\""
		   },
		   {
			"id": 5767,
			"surah": 80,
			"ayat": 9,
			"tafsir": "In these verses, Allah reminded the Prophet Muhammad, \"And as for a person like 'Abdullah bin Ummi Maktum who comes to you in a hurry to get guidance and mercy from his Lord, while he fears Allah if he falls into the valley of error, then you behave indifferent and pays no heed to her requests.\""
		   },
		   {
			"id": 5768,
			"surah": 80,
			"ayat": 10,
			"tafsir": "In these verses, Allah reminded the Prophet Muhammad, \"And as for a person like 'Abdullah bin Ummi Maktum who comes to you in a hurry to get guidance and mercy from his Lord, while he fears Allah if he falls into the valley of error, then you behave indifferent and pays no heed to her requests.\""
		   },
		   {
			"id": 5769,
			"surah": 80,
			"ayat": 11,
			"tafsir": "In this verse, Allah admonished His Prophet not to repeat such actions when he faced Ibn Ummi Maktum and al-Walid bin al-Mugirah and his friends. Indeed, God's teaching is a warning and advice to awaken those who forget or do not pay attention to the signs of the greatness and power of their Lord. Whoever wants a clear and clear warning, of course he will pay attention and act according to the will of that guidance. Especially when it is noted that the guidance comes from noble books as explained in the following verses."
		   },
		   {
			"id": 5770,
			"surah": 80,
			"ayat": 12,
			"tafsir": "In this verse, Allah admonished His Prophet not to repeat such actions when he faced Ibn Ummi Maktum and al-Walid bin al-Mugirah and his friends. Indeed, God's teaching is a warning and advice to awaken those who forget or do not pay attention to the signs of the greatness and power of their Lord. Whoever wants a clear and clear warning, of course he will pay attention and act according to the will of that guidance. Especially when it is noted that the guidance comes from noble books as explained in the following verses."
		   },
		   {
			"id": 5771,
			"surah": 80,
			"ayat": 13,
			"tafsir": "Al-Qur'an is one of the books that was revealed to the prophets. It is a noble book and has high teaching value and is purified from all kinds of satanic influence. The Qur'an was revealed by means of writers, namely angels who are very noble and devoted, as in the word of Allah: Those who do not disobey Allah in what He commands them and always do what they are ordered to do. (at-Tahrim\/66: 6)"
		   },
		   {
			"id": 5772,
			"surah": 80,
			"ayat": 14,
			"tafsir": "Al-Qur'an is one of the books that was revealed to the prophets. It is a noble book and has high teaching value and is purified from all kinds of satanic influence. The Qur'an was revealed by means of writers, namely angels who are very noble and devoted, as in the word of Allah: Those who do not disobey Allah in what He commands them and always do what they are ordered to do. (at-Tahrim\/66: 6)"
		   },
		   {
			"id": 5773,
			"surah": 80,
			"ayat": 15,
			"tafsir": "Al-Qur'an is one of the books that was revealed to the prophets. It is a noble book and has high teaching value and is purified from all kinds of satanic influence. The Qur'an was revealed by means of writers, namely angels who are very noble and devoted, as in the word of Allah: Those who do not disobey Allah in what He commands them and always do what they are ordered to do. (at-Tahrim\/66: 6)"
		   },
		   {
			"id": 5774,
			"surah": 80,
			"ayat": 16,
			"tafsir": "Al-Qur'an is one of the books that was revealed to the prophets. It is a noble book and has high teaching value and is purified from all kinds of satanic influence. The Qur'an was revealed by means of writers, namely angels who are very noble and devoted, as in the word of Allah: Those who do not disobey Allah in what He commands them and always do what they are ordered to do. (at-Tahrim\/66: 6)"
		   },
		   {
			"id": 5775,
			"surah": 80,
			"ayat": 17,
			"tafsir": "In these verses, Allah gives a stern warning to humans with firm sentences, namely: human perish! How great was his denial of the favors of Allah which had been bestowed upon him from birth to death. Allah put forward a question so that it can be used as a reflection by humans to be able to raise awareness, namely from what did Allah create it? Allah gives details about the kinds of favors that have been given to humans in three periods, namely the beginning, the middle and the end. Allah signaled the first with the following question: \"From what did Allah create man?\""
		   },
		   {
			"id": 5776,
			"surah": 80,
			"ayat": 18,
			"tafsir": "In these verses, Allah gives a stern warning to humans with firm sentences, namely: human perish! How great was his denial of the favors of Allah which had been bestowed upon him from birth to death. Allah put forward a question so that it can be used as a reflection by humans to be able to raise awareness, namely from what did Allah create it? Allah gives details about the kinds of favors that have been given to humans in three periods, namely the beginning, the middle and the end. Allah signaled the first with the following question: \"From what did Allah create man?\""
		   },
		   {
			"id": 5777,
			"surah": 80,
			"ayat": 19,
			"tafsir": "In answer to the above questions, Allah explained that humans were created from a drop of contemptible sperm. Allah then determines the stages of events, age, sustenance, and fate."
		   },
		   {
			"id": 5778,
			"surah": 80,
			"ayat": 20,
			"tafsir": "In this verse, Allah explains that He has facilitated the path of man in the middle, namely giving him the opportunity to take the right path or the wrong path. Actually, humans do not deserve to be arrogant, if they understand the origin of what happened, as Allah says: Who beautified everything that He created and who started the creation of humans from soil, then He made their offspring from the essence of despicable water (semen). (as-Sajdah\/32: 7-8)"
		   },
		   {
			"id": 5779,
			"surah": 80,
			"ayat": 21,
			"tafsir": "In these two verses it is explained that in the last stage (extermination), God kills and puts people into the grave. Until the time comes on the Day of Resurrection, Allah will raise them up again from their graves. Allah's Word explains: It is from it (soil) that We created you and to it We will return you and from there We will bring you out at another time. (thaha\/20:55)"
		   },
		   {
			"id": 5780,
			"surah": 80,
			"ayat": 22,
			"tafsir": "In these two verses it is explained that in the last stage (extermination), God kills and puts people into the grave. Until the time comes on the Day of Resurrection, Allah will raise them up again from their graves. Allah's Word explains: It is from it (soil) that We created you and to it We will return you and from there We will bring you out at another time. (thaha\/20:55)"
		   },
		   {
			"id": 5781,
			"surah": 80,
			"ayat": 23,
			"tafsir": "In this verse, Allah repeats His warning about human disbelief towards His blessings by stating that every disbeliever is very strange. They should have believed and glorified Allah after experiencing the favors bestowed upon them, but they behaved otherwise. They deny the favor as if it were only the result of their own efforts."
		   },
		   {
			"id": 5782,
			"surah": 80,
			"ayat": 24,
			"tafsir": "In this verse, Allah instructs people to pay attention to their food, how He has prepared nutritious food containing protein, carbohydrates, and other things so as to meet their daily needs. Humans can taste the delicacy of food and drink which is also a driving force for maintaining the body so that it remains in good health and is able to carry out the tasks assigned to it."
		   },
		   {
			"id": 5783,
			"surah": 80,
			"ayat": 25,
			"tafsir": "In this verse it is explained that in fact Allah has poured out rainwater from the sky with a sufficiently large outpouring to meet the needs of all His creatures, both humans, animals and plants."
		   },
		   {
			"id": 5784,
			"surah": 80,
			"ayat": 26,
			"tafsir": "Then Allah opened the surface of the earth as well as possible so that air and sunlight could enter the earth, so that the soil became fertile to grow various plants."
		   },
		   {
			"id": 5785,
			"surah": 80,
			"ayat": 27,
			"tafsir": "In this verse and in the following verses Allah mentions several types of plants: first, Allah grows grains on earth such as wheat, rice and other things which are the staple food. Second and third, Allah also grows grapes and various vegetables that can be eaten directly. Fourth and fifth, olives and date palms. Sixth, gardens that are large, tall, and full of fruit. Not only can the fruit be used, but the tree can also be used as building materials and housing tools. Seventh, various other fruits, such as pears, apples, mangoes, and so on. Eighth, various kinds of grasses. The water that descends from the sky and its role in \"vivifying the dead land\" is clearly described in surahh al-Furqan\/25: 48-49. What is the content of rainwater so that it can be used for plant growth is in surahh Qaf\/50: 9. While the description of how the earth was \"split\", in addition to the verse above, is also found in surahh Fussilat\/41: 39, as in the fragment: \"And Among His verses is that you see the earth dry and barren, so when We send down water on it, it will surely move and expand.\" The verse explains what will happen to dry land when raindrops fall on it. The verse also explains that there are three stages of how a plant develops until it produces fruit. The stages of plant development described in the verse above are as follows: First: Movement of the soil. What is meant by the movement of the soil is the movement of soil particles. These particles consist of layers consisting of silica and alumina materials. When water enters the particle layers, there will be swelling of the sludge-forming particles. This can be explained as follows: 1. The electrostatic charge on the surface of the particles (which occurs after the presence of water) will disrupt stability. This particle will move on, before there is a stabilizer in the form of a particle with the opposite electrical charge. Here we should be grateful, about how Allah has created everything in pairs, thus bringing a stable and peaceful atmosphere. This includes electric charges. 2. The movement of soil particles is also caused by collisions with water particles. The irregular movement of water particles causes soil particles to move in all directions. Such movement was discovered by a botanist named Robert Brown in 1828. The movement is highly dependent on the speed and number of water particles. Thus, the movement that occurs is a direct interaction between soil particles and water particles. Second: Expansion of the land. What is meant by swelling of the soil is the expansion of soil particles. Soil particles will get thicker. Thus, the soil will expand, in line with the expansion of soil particles. It has been stated previously that soil particles consist of layers that are related to one another. Between one layer and another there are pores. It is into these pores that water and dissolved ions will enter. With very narrow pore shapes and the presence of an electrostatic field on the surface of the coating, the water is like being placed in a bottle, and does not flow out. In other words, water will be stored in the pores in each layer. Third: Germination Stage. The seed germination stage occurs when water is available. When the water is at a sufficient stage, the embryo inside the seed will become active and absorb simple nutrient material (complex nutritional material is broken down into simple ones with the help of enzymes). At this stage, the roots will grow downwards, moving between soil particles to find areas that meet the requirements and obtain the nutrients they need. Then the leaves will develop upwards, penetrate the soil surface, and direct it to the source of sunlight. So, briefly, the stages above can be explained in this way. The word \"moving\" clearly indicates the effect of water on soil particles. This effect can occur as a result of electrostatic charge or direct impact between water particles and soil. Meanwhile, the word \"swelling\" refers to the thickening of soil particles due to water trapping between the layers that form soil particles. Thus, soil particles function as water reservoirs, places to store water. This is in accordance with the following verse: And We send down water from the sky with a size; then We caused the water to settle on the earth, and surely We have power to make it disappear. (al-Mu'minun\/23: 18) Then the roots, followed by the leaves, begin to grow. The sapling will appear, continue to grow and produce for human needs. Are humans still ungrateful? So pay attention to the traces of God's grace, how God revived the earth after it died (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30:50)"
		   },
		   {
			"id": 5786,
			"surah": 80,
			"ayat": 28,
			"tafsir": "In this verse and in the following verses Allah mentions several types of plants: first, Allah grows grains on earth such as wheat, rice and other things which are the staple food. Second and third, Allah also grows grapes and various vegetables that can be eaten directly. Fourth and fifth, olives and date palms. Sixth, gardens that are large, tall, and full of fruit. Not only can the fruit be used, but the tree can also be used as building materials and housing tools. Seventh, various other fruits, such as pears, apples, mangoes, and so on. Eighth, various kinds of grasses. The water that descends from the sky and its role in \"vivifying the dead land\" is clearly described in surahh al-Furqan\/25: 48-49. What is the content of rainwater so that it can be used for plant growth is in surahh Qaf\/50: 9. While the description of how the earth was \"split\", in addition to the verse above, is also found in surahh Fussilat\/41: 39, as in the fragment: \"And Among His verses is that you see the earth dry and barren, so when We send down water on it, it will surely move and expand.\" The verse explains what will happen to dry land when raindrops fall on it. The verse also explains that there are three stages of how a plant develops until it produces fruit. The stages of plant development described in the verse above are as follows: First: Movement of the soil. What is meant by the movement of the soil is the movement of soil particles. These particles consist of layers consisting of silica and alumina materials. When water enters the particle layers, there will be swelling of the sludge-forming particles. This can be explained as follows: 1. The electrostatic charge on the surface of the particles (which occurs after the presence of water) will disrupt stability. This particle will move on, before there is a stabilizer in the form of a particle with the opposite electrical charge. Here we should be grateful, about how Allah has created everything in pairs, thus bringing a stable and peaceful atmosphere. This includes electric charges. 2. The movement of soil particles is also caused by collisions with water particles. The irregular movement of water particles causes soil particles to move in all directions. Such movement was discovered by a botanist named Robert Brown in 1828. The movement is highly dependent on the speed and number of water particles. Thus, the movement that occurs is a direct interaction between soil particles and water particles. Second: Expansion of the land. What is meant by swelling of the soil is the expansion of soil particles. Soil particles will get thicker. Thus, the soil will expand, in line with the expansion of soil particles. It has been stated previously that soil particles consist of layers that are related to one another. Between one layer and another there are pores. It is into these pores that water and dissolved ions will enter. With very narrow pore shapes and the presence of an electrostatic field on the surface of the coating, the water is like being placed in a bottle, and does not flow out. In other words, water will be stored in the pores in each layer. Third: Germination Stage. The seed germination stage occurs when water is available. When the water is at a sufficient stage, the embryo inside the seed will become active and absorb simple nutrient material (complex nutritional material is broken down into simple ones with the help of enzymes). At this stage, the roots will grow downwards, moving between soil particles to find areas that meet the requirements and obtain the nutrients they need. Then the leaves will develop upwards, penetrate the soil surface, and direct it to the source of sunlight. So, briefly, the stages above can be explained in this way. The word \"moving\" clearly indicates the effect of water on soil particles. This effect can occur as a result of electrostatic charge or direct impact between water particles and soil. Meanwhile, the word \"swelling\" refers to the thickening of soil particles due to water trapping between the layers that form soil particles. Thus, soil particles function as water reservoirs, places to store water. This is in accordance with the following verse: And We send down water from the sky with a size; then We caused the water to settle on the earth, and surely We have power to make it disappear. (al-Mu'minun\/23: 18) Then the roots, followed by the leaves, begin to grow. The sapling will appear, continue to grow and produce for human needs. Are humans still ungrateful? So pay attention to the traces of God's grace, how God revived the earth after it died (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30:50)"
		   },
		   {
			"id": 5787,
			"surah": 80,
			"ayat": 29,
			"tafsir": "In this verse and in the following verses Allah mentions several types of plants: first, Allah grows grains on earth such as wheat, rice and other things which are the staple food. Second and third, Allah also grows grapes and various vegetables that can be eaten directly. Fourth and fifth, olives and date palms. Sixth, gardens that are large, tall, and full of fruit. Not only can the fruit be used, but the tree can also be used as building materials and housing tools. Seventh, various other fruits, such as pears, apples, mangoes, and so on. Eighth, various kinds of grasses. The water that descends from the sky and its role in \"vivifying the dead land\" is clearly described in surahh al-Furqan\/25: 48-49. What is the content of rainwater so that it can be used for plant growth is in surahh Qaf\/50: 9. While the description of how the earth was \"split\", in addition to the verse above, is also found in surahh Fussilat\/41: 39, as in the fragment: \"And Among His verses is that you see the earth dry and barren, so when We send down water on it, it will surely move and expand.\" The verse explains what will happen to dry land when raindrops fall on it. The verse also explains that there are three stages of how a plant develops until it produces fruit. The stages of plant development described in the verse above are as follows: First: Movement of the soil. What is meant by the movement of the soil is the movement of soil particles. These particles consist of layers consisting of silica and alumina materials. When water enters the particle layers, there will be swelling of the sludge-forming particles. This can be explained as follows: 1. The electrostatic charge on the surface of the particles (which occurs after the presence of water) will disrupt stability. This particle will move on, before there is a stabilizer in the form of a particle with the opposite electrical charge. Here we should be grateful, about how Allah has created everything in pairs, thus bringing a stable and peaceful atmosphere. This includes electric charges. 2. The movement of soil particles is also caused by collisions with water particles. The irregular movement of water particles causes soil particles to move in all directions. Such movement was discovered by a botanist named Robert Brown in 1828. The movement is highly dependent on the speed and number of water particles. Thus, the movement that occurs is a direct interaction between soil particles and water particles. Second: Expansion of the land. What is meant by swelling of the soil is the expansion of soil particles. Soil particles will get thicker. Thus, the soil will expand, in line with the expansion of soil particles. It has been stated previously that soil particles consist of layers that are related to one another. Between one layer and another there are pores. It is into these pores that water and dissolved ions will enter. With very narrow pore shapes and the presence of an electrostatic field on the surface of the coating, the water is like being placed in a bottle, and does not flow out. In other words, water will be stored in the pores in each layer. Third: Germination Stage. The seed germination stage occurs when water is available. When the water is at a sufficient stage, the embryo inside the seed will become active and absorb simple nutrient material (complex nutritional material is broken down into simple ones with the help of enzymes). At this stage, the roots will grow downwards, moving between soil particles to find areas that meet the requirements and obtain the nutrients they need. Then the leaves will develop upwards, penetrate the soil surface, and direct it to the source of sunlight. So, briefly, the stages above can be explained in this way. The word \"moving\" clearly indicates the effect of water on soil particles. This effect can occur as a result of electrostatic charge or direct impact between water particles and soil. Meanwhile, the word \"swelling\" refers to the thickening of soil particles due to water trapping between the layers that form soil particles. Thus, soil particles function as water reservoirs, places to store water. This is in accordance with the following verse: And We send down water from the sky with a size; then We caused the water to settle on the earth, and surely We have power to make it disappear. (al-Mu'minun\/23: 18) Then the roots, followed by the leaves, begin to grow. The sapling will appear, continue to grow and produce for human needs. Are humans still ungrateful? So pay attention to the traces of God's grace, how God revived the earth after it died (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30:50)"
		   },
		   {
			"id": 5788,
			"surah": 80,
			"ayat": 30,
			"tafsir": "In this verse and in the following verses Allah mentions several types of plants: first, Allah grows grains on earth such as wheat, rice and other things which are the staple food. Second and third, Allah also grows grapes and various vegetables that can be eaten directly. Fourth and fifth, olives and date palms. Sixth, gardens that are large, tall, and full of fruit. Not only can the fruit be used, but the tree can also be used as building materials and housing tools. Seventh, various other fruits, such as pears, apples, mangoes, and so on. Eighth, various kinds of grasses. The water that descends from the sky and its role in \"vivifying the dead land\" is clearly described in surahh al-Furqan\/25: 48-49. What is the content of rainwater so that it can be used for plant growth is in surahh Qaf\/50: 9. While the description of how the earth was \"split\", in addition to the verse above, is also found in surahh Fussilat\/41: 39, as in the fragment: \"And Among His verses is that you see the earth dry and barren, so when We send down water on it, it will surely move and expand.\" The verse explains what will happen to dry land when raindrops fall on it. The verse also explains that there are three stages of how a plant develops until it produces fruit. The stages of plant development described in the verse above are as follows: First: Movement of the soil. What is meant by the movement of the soil is the movement of soil particles. These particles consist of layers consisting of silica and alumina materials. When water enters the particle layers, there will be swelling of the sludge-forming particles. This can be explained as follows: 1. The electrostatic charge on the surface of the particles (which occurs after the presence of water) will disrupt stability. This particle will move on, before there is a stabilizer in the form of a particle with the opposite electrical charge. Here we should be grateful, about how Allah has created everything in pairs, thus bringing a stable and peaceful atmosphere. This includes electric charges. 2. The movement of soil particles is also caused by collisions with water particles. The irregular movement of water particles causes soil particles to move in all directions. Such movement was discovered by a botanist named Robert Brown in 1828. The movement is highly dependent on the speed and number of water particles. Thus, the movement that occurs is a direct interaction between soil particles and water particles. Second: Expansion of the land. What is meant by swelling of the soil is the expansion of soil particles. Soil particles will get thicker. Thus, the soil will expand, in line with the expansion of soil particles. It has been stated previously that soil particles consist of layers that are related to one another. Between one layer and another there are pores. It is into these pores that water and dissolved ions will enter. With very narrow pore shapes and the presence of an electrostatic field on the surface of the coating, the water is like being placed in a bottle, and does not flow out. In other words, water will be stored in the pores in each layer. Third: Germination Stage. The seed germination stage occurs when water is available. When the water is at a sufficient stage, the embryo inside the seed will become active and absorb simple nutrient material (complex nutritional material is broken down into simple ones with the help of enzymes). At this stage, the roots will grow downwards, moving between soil particles to find areas that meet the requirements and obtain the nutrients they need. Then the leaves will develop upwards, penetrate the soil surface, and direct it to the source of sunlight. So, briefly, the stages above can be explained in this way. The word \"moving\" clearly indicates the effect of water on soil particles. This effect can occur as a result of electrostatic charge or direct impact between water particles and soil. Meanwhile, the word \"swelling\" refers to the thickening of soil particles due to water trapping between the layers that form soil particles. Thus, soil particles function as water reservoirs, places to store water. This is in accordance with the following verse: And We send down water from the sky with a size; then We caused the water to settle on the earth, and surely We have power to make it disappear. (al-Mu'minun\/23: 18) Then the roots, followed by the leaves, begin to grow. The sapling will appear, continue to grow and produce for human needs. Are humans still ungrateful? So pay attention to the traces of God's grace, how God revived the earth after it died (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30:50)"
		   },
		   {
			"id": 5789,
			"surah": 80,
			"ayat": 31,
			"tafsir": "In this verse and in the following verses Allah mentions several types of plants: first, Allah grows grains on earth such as wheat, rice and other things which are the staple food. Second and third, Allah also grows grapes and various vegetables that can be eaten directly. Fourth and fifth, olives and date palms. Sixth, gardens that are large, tall, and full of fruit. Not only can the fruit be used, but the tree can also be used as building materials and housing tools. Seventh, various other fruits, such as pears, apples, mangoes, and so on. Eighth, various kinds of grasses. The water that descends from the sky and its role in \"vivifying the dead land\" is clearly described in surahh al-Furqan\/25: 48-49. What is the content of rainwater so that it can be used for plant growth is in surahh Qaf\/50: 9. While the description of how the earth was \"split\", in addition to the verse above, is also found in surahh Fussilat\/41: 39, as in the fragment: \"And Among His verses is that you see the earth dry and barren, so when We send down water on it, it will surely move and expand.\" The verse explains what will happen to dry land when raindrops fall on it. The verse also explains that there are three stages of how a plant develops until it produces fruit. The stages of plant development described in the verse above are as follows: First: Movement of the soil. What is meant by the movement of the soil is the movement of soil particles. These particles consist of layers consisting of silica and alumina materials. When water enters the particle layers, there will be swelling of the sludge-forming particles. This can be explained as follows: 1. The electrostatic charge on the surface of the particles (which occurs after the presence of water) will disrupt stability. This particle will move on, before there is a stabilizer in the form of a particle with the opposite electrical charge. Here we should be grateful, about how Allah has created everything in pairs, thus bringing a stable and peaceful atmosphere. This includes electric charges. 2. The movement of soil particles is also caused by collisions with water particles. The irregular movement of water particles causes soil particles to move in all directions. Such movement was discovered by a botanist named Robert Brown in 1828. The movement is highly dependent on the speed and number of water particles. Thus, the movement that occurs is a direct interaction between soil particles and water particles. Second: Expansion of the land. What is meant by swelling of the soil is the expansion of soil particles. Soil particles will get thicker. Thus, the soil will expand, in line with the expansion of soil particles. It has been stated previously that soil particles consist of layers that are related to one another. Between one layer and another there are pores. It is into these pores that water and dissolved ions will enter. With very narrow pore shapes and the presence of an electrostatic field on the surface of the coating, the water is like being placed in a bottle, and does not flow out. In other words, water will be stored in the pores in each layer. Third: Germination Stage. The seed germination stage occurs when water is available. When the water is at a sufficient stage, the embryo inside the seed will become active and absorb simple nutrient material (complex nutritional material is broken down into simple ones with the help of enzymes). At this stage, the roots will grow downwards, moving between soil particles to find areas that meet the requirements and obtain the nutrients they need. Then the leaves will develop upwards, penetrate the soil surface, and direct it to the source of sunlight. So, briefly, the stages above can be explained in this way. The word \"moving\" clearly indicates the effect of water on soil particles. This effect can occur as a result of electrostatic charge or direct impact between water particles and soil. Meanwhile, the word \"swelling\" refers to the thickening of soil particles due to water trapping between the layers that form soil particles. Thus, soil particles function as water reservoirs, places to store water. This is in accordance with the following verse: And We send down water from the sky with a size; then We caused the water to settle on the earth, and surely We have power to make it disappear. (al-Mu'minun\/23: 18) Then the roots, followed by the leaves, begin to grow. The sapling will appear, continue to grow and produce for human needs. Are humans still ungrateful? So pay attention to the traces of God's grace, how God revived the earth after it died (dry). Indeed, it means that He will definitely (power) bring the dead back to life. And He is almighty over all things. (ar-Rum\/30:50)"
		   },
		   {
			"id": 5790,
			"surah": 80,
			"ayat": 32,
			"tafsir": "All of that is property for the enjoyment of human life, and is food for him and for his livestock."
		   },
		   {
			"id": 5791,
			"surah": 80,
			"ayat": 33,
			"tafsir": "In this verse it is explained that when the Day of Judgment comes, when a very powerful deafening sound is heard, namely the second blast of the Angel Israfil, then on that day all disbelievers will feel sorrow and regret. In the next verse, the awesomeness of the Day of Judgment is detailed."
		   },
		   {
			"id": 5792,
			"surah": 80,
			"ayat": 34,
			"tafsir": "In these verses it is explained that on the Day of Resurrection, humans will run away from their brothers, mothers and fathers, even from their wives and children. This is because all thoughts are only focused on saving oneself from a very frightening disaster, so that they forget their parents, siblings, wife and children. Allah's Word: O people! Fear your Lord and be afraid of the day when (at that time) a father cannot help his child, and a child cannot (also) help his father in the least. Indeed, Allah's promise must be true, so never be deceived by the life of this world, and do not be deceived by deceivers in (obeying) Allah. (Luqman\/31: 33)"
		   },
		   {
			"id": 5793,
			"surah": 80,
			"ayat": 35,
			"tafsir": "In these verses it is explained that on the Day of Resurrection, humans will run away from their brothers, mothers and fathers, even from their wives and children. This is because all thoughts are only focused on saving oneself from a very frightening disaster, so that they forget their parents, siblings, wife and children. Allah's Word: O people! Fear your Lord and be afraid of the day when (at that time) a father cannot help his child, and a child cannot (also) help his father in the least. Indeed, Allah's promise must be true, so never be deceived by the life of this world, and do not be deceived by deceivers in (obeying) Allah. (Luqman\/31: 33)"
		   },
		   {
			"id": 5794,
			"surah": 80,
			"ayat": 36,
			"tafsir": "In these verses it is explained that on the Day of Resurrection, humans will run away from their brothers, mothers and fathers, even from their wives and children. This is because all thoughts are only focused on saving oneself from a very frightening disaster, so that they forget their parents, siblings, wife and children. Allah's Word: O people! Fear your Lord and be afraid of the day when (at that time) a father cannot help his child, and a child cannot (also) help his father in the least. Indeed, Allah's promise must be true, so never be deceived by the life of this world, and do not be deceived by deceivers in (obeying) Allah. (Luqman\/31: 33)"
		   },
		   {
			"id": 5795,
			"surah": 80,
			"ayat": 37,
			"tafsir": "Every human being on the terrible Day of Judgment has his own business which is enough to keep him busy so that he does not have time to pay attention to other people. When they were still in the world, they helped each other up to the point of redeeming them with wealth when needed, especially when it was concerned with the safety of their own children who would continue their generations to come or regarding the honor of their wife, the person closest and most loyal to him. However, on the Day of Judgment, there will be no more opportunity to pay attention to his family members because of the awesomeness of the Day of Judgment which will be very busy. On that day people will be divided into two groups: the happy and the unfortunate, and the first group is stated in the following verse."
		   },
		   {
			"id": 5796,
			"surah": 80,
			"ayat": 38,
			"tafsir": "Many of the faces of the believers that day were beaming with joy because they could see for themselves that what God had promised to those who believe turned out to be fulfilled with great joy. They laughed and rejoiced."
		   },
		   {
			"id": 5797,
			"surah": 80,
			"ayat": 39,
			"tafsir": "Many of the faces of the believers that day were beaming with joy because they could see for themselves that what God had promised to those who believe turned out to be fulfilled with great joy. They laughed and rejoiced."
		   },
		   {
			"id": 5798,
			"surah": 80,
			"ayat": 40,
			"tafsir": "In contrast to the second group it was stated that many disbelievers' faces on that day were covered with dust full of regret and sadness. They were closed again by darkness because it was overwritten by humiliation and distress. They are the disbelievers who are very disobedient."
		   },
		   {
			"id": 5799,
			"surah": 80,
			"ayat": 41,
			"tafsir": "In contrast to the second group it was stated that many disbelievers' faces on that day were covered with dust full of regret and sadness. They were closed again by darkness because it was overwritten by humiliation and distress. They are the disbelievers who are very disobedient."
		   },
		   {
			"id": 5800,
			"surah": 80,
			"ayat": 42,
			"tafsir": "In contrast to the second group it was stated that many disbelievers' faces on that day were covered with dust full of regret and sadness. They were closed again by darkness because it was overwritten by humiliation and distress. They are the disbelievers who are very disobedient."
		   }
	]
}
