{
	"tafseer": [
		{
			"id": 2933,
			"surah": 26,
			"ayat": 1,
			"tafsir": "See the description of this verse in volume I which explains Fawatihus-suwar (al-Baqarah\/2: 1)."
		   },
		   {
			"id": 2934,
			"surah": 26,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that these verses of the Qur'an explain right and wrong, good and bad clearly and easily understood, as a guide for humans in worldly and hereafter life. By practicing the contents and contents of these verses, humans will definitely achieve happiness in this world and in the hereafter. This is believed to be true by the Prophet Muhammad and his companions who have believed. However, the Meccan infidels always rejected these teachings and made fun of them when the Prophet Muhammad called them to faith. They even ridiculed, insulted, and accused him of various kinds of accusations, such as declaring that Muhammad was crazy or a person who had been enchanted or a poet."
		   },
		   {
			"id": 2935,
			"surah": 26,
			"ayat": 3,
			"tafsir": "The Prophet Muhammad was a man who loved his people and always hoped that they would all believe. He believes that by embracing Islam, they will surely be happy and safe from the calamities that Allah used to send down to those who disbelieved before. He almost gave up because after all this time he had called on them with strong reasons and arguments that could not be refuted, they still disobeyed and humiliated him. It is very tragic and very sad for a religious leader who loves his people and tries for their safety and happiness, but is always ridiculed by his people. In this verse, Allah rebuked the Prophet Muhammad who was in the peak of sadness and sorrow by saying whether the Prophet would destroy himself just because his people did not want to accept the true guidance and teachings? It was as if Allah gave him a warning, why did the Prophet really hope that his people would all believe? Even though his main obligation is only to convey Allah's message as stated in His word: Isn't it the responsibility of the apostles to convey (God's message) clearly. (an-Nahl\/16: 35) Actually with this rebuke Allah forbade him to do so as mentioned in His word in another surah: Verily Allah misleads whom He wills and guides whom He wills. So do not you (Muhammad) let yourself perish because of sorrow for them. Surely Allah is Aware of what they do. (Fathir\/35: 8)"
		   },
		   {
			"id": 2936,
			"surah": 26,
			"ayat": 4,
			"tafsir": "In this verse it is explained that if Allah wanted to force them to believe, it would be very easy for Him. However, Allah wants to apply His sunnah to the Quraysh that believing is not by coercion and violence, but by self-awareness and will. Forcing people to believe is contrary to the verses of the Qur'an (al-Baqarah\/2: 256) and the sunna of Allah. This was not permitted by the apostles according to the word of God: And if your Lord had willed, all people on earth would have believed entirely. But do you (want to) force people so that they become believers? (Yunus\/10: 99). Therefore, Allah, with His wisdom and decree, sent messengers who would call upon the people to the truth and pure monotheism, and guide them to the straight path, and the Shari'ah that would lead them to happiness in this world and the hereafter. Thus Allah sent down the Qur'an to Muhammad as a miracle. The miracles of the Al-Qur'an will remain in effect throughout time until the Day of Judgment in accordance with the message that Muhammad brought to all mankind in all times and places. The miracles given to the prophets before Muhammad only apply to the time and place where the prophet spread his message. After that, the miracles were just news written in history and could not be witnessed again by generations that came later. In contrast to the Al-Qur'an, until now with increasing human knowledge, and the more advanced their technology, the truth of the Al-Qur'an will become clearer and clearer. Scientific hints mentioned in the Qur'an briefly, which may not have been understood in previous times, are increasingly being revealed, so that Muslims are increasingly convinced of the truth of the Qur'an. In this regard, there are also an increasing number of people who are self-aware that the Al-Qur'an is indeed a book sent down by Allah to guide people to the right path, so that they have faith and embrace Islam."
		   },
		   {
			"id": 2937,
			"surah": 26,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains the character and character of the polytheists. Their hearts have been closed to accept the truth, because they have been defiled by arrogance and pride. They really love position, rank, and treasure. When they hear the verses of Allah, which call them to believe and adhere to its teachings, they spontaneously reject and turn away from them. Yet if they are willing to pay attention and reflect on it, they will certainly get many lessons that can remind them that the ideas they hold and the actions they take have far deviated from the truth conveyed by the Qur'an. Such is the character and character of the polytheists. They immediately rejected the verses and belied it and even ridiculed and ridiculed it. Therefore, Allah threatens them by saying that in the hereafter they will see and feel the consequences of their ridicule and ridicule themselves. They will be tortured in Hellfire with very painful and humiliating torments, according to God's word in another verse: It is a loss for those who deny the meeting with God; so that when the Doomsday comes to them suddenly, they say, \"How great our regret for our negligence regarding the Doomsday,\" while they carry their sins on their backs. What a shame what they carried. (al-An'am\/6: 31) And His words: How great is the regret for those servants, every time an apostle comes to them, they always make fun of him. (Yasin\/36: 30)"
		   },
		   {
			"id": 2938,
			"surah": 26,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains the character and character of the polytheists. Their hearts have been closed to accept the truth, because they have been defiled by arrogance and pride. They really love position, rank, and treasure. When they hear the verses of Allah, which call them to believe and adhere to its teachings, they spontaneously reject and turn away from them. Yet if they are willing to pay attention and reflect on it, they will certainly get many lessons that can remind them that the ideas they hold and the actions they take have far deviated from the truth conveyed by the Qur'an. Such is the character and character of the polytheists. They immediately rejected the verses and belied it and even ridiculed and ridiculed it. Therefore, Allah threatens them by saying that in the hereafter they will see and feel the consequences of their ridicule and ridicule themselves. They will be tortured in Hellfire with very painful and humiliating torments, according to God's word in another verse: It is a loss for those who deny the meeting with God; so that when the Doomsday comes to them suddenly, they say, \"How great our regret for our negligence regarding the Doomsday,\" while they carry their sins on their backs. What a shame what they carried. (al-An'am\/6: 31) And His words: How great is the regret for those servants, every time an apostle comes to them, they always make fun of him. (Yasin\/36: 30)"
		   },
		   {
			"id": 2939,
			"surah": 26,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains the character and character of the polytheists. Their hearts have been closed to accept the truth, because they have been defiled by arrogance and pride. They really love position, rank, and treasure. When they hear the verses of Allah, which call them to believe and adhere to its teachings, they spontaneously reject and turn away from them. Yet if they are willing to pay attention and reflect on it, they will certainly get many lessons that can remind them that the ideas they hold and the actions they take have far deviated from the truth conveyed by the Qur'an. Such is the character and character of the polytheists. They immediately rejected the verses and belied it and even ridiculed and ridiculed it. Therefore, Allah threatens them by saying that in the hereafter they will see and feel the consequences of their ridicule and ridicule themselves. They will be tortured in Hellfire with very painful and humiliating torments, according to God's word in another verse: It is a loss for those who deny the meeting with God; so that when the Doomsday comes to them suddenly, they say, \"How great our regret for our negligence regarding the Doomsday,\" while they carry their sins on their backs. What a shame what they carried. (al-An'am\/6: 31) And His words: How great is the regret for those servants, every time an apostle comes to them, they always make fun of him. (Yasin\/36: 30)"
		   },
		   {
			"id": 2940,
			"surah": 26,
			"ayat": 8,
			"tafsir": "Then Allah reproached the disbelievers who did not want to use their minds to see that what was happening in nature showed Allah's power. If they would think about and meditate on Allah's creation, they would certainly become people who believe in Allah and His Messenger. They will no longer worship idols that are not able to provide the slightest benefit and also prevent harm and harm, both for themselves and their worshippers. The disbeliever does not pay attention to the various kinds of colorful plants, each of which has its own specialties in terms of leaves, flowers and fruit. Even though they all grow in the same soil and are watered with the same water, they produce fruits that are different in shape, color and taste. Does this not show the power and wisdom of His Creator? However, if the heart is closed by feelings of pride and arrogance, the mind is influenced by greed to gain rank, position, and wealth, then all paths to reach the truth will be closed. Anything that goes against their will is all evil and ugly in their eyes. These are the factors that turn them away from thinking and meditating on Allah's power. Therefore, most of them remain in denial, disbelief, and always challenge the message and truth brought by the Prophet Muhammad. They always deny the Day of Judgment, the day of resurrection, and the day of reckoning, because they don't want to think about it. They just want to have fun in this world, so they feel it's pointless to think about how things will be after death. According to them, the dead body must have crumbled into the ground and will not return. In fact, God has the power to destroy them in various ways, just as God destroyed the rebellious ancients. Some were destroyed by typhoons and great floods, some were destroyed by violent earthquakes, and some were destroyed by thunderous noises. However, Allah has the nature of mercy and compassion. For this reason, Allah did not inflict on the polytheists of Mecca the torments that were inflicted on the former ummah, in the hope that there might be unbelievers who disobeyed and challenged them or their descendants who would believe. The Quran states that all inanimate and living things in the universe are created in pairs. The verse above gives an example of plants. However, actually the concept of pairing is not only in plants, but in almost all of their creations. In the Qur'an it is stated, among other things: \"Glory be to Him who has created pairs of all, both from what the earth and themselves grow and from what they do not know.\" (Yasin\/36: 36). \"And We have created everything in pairs...\" (adz-dzariyat\/51: 49)."
		   },
		   {
			"id": 2941,
			"surah": 26,
			"ayat": 9,
			"tafsir": "Then Allah reproached the disbelievers who did not want to use their minds to see that what was happening in nature showed Allah's power. If they would think about and meditate on Allah's creation, they would certainly become people who believe in Allah and His Messenger. They will no longer worship idols that are not able to provide the slightest benefit and also prevent harm and harm, both for themselves and their worshippers. The disbeliever does not pay attention to the various kinds of colorful plants, each of which has its own specialties in terms of leaves, flowers and fruit. Even though they all grow in the same soil and are watered with the same water, they produce fruits that are different in shape, color and taste. Does this not show the power and wisdom of His Creator? However, if the heart is closed by feelings of pride and arrogance, the mind is influenced by greed to gain rank, position, and wealth, then all paths to reach the truth will be closed. Anything that goes against their will is all evil and ugly in their eyes. These are the factors that turn them away from thinking and meditating on Allah's power. Therefore, most of them remain in denial, disbelief, and always challenge the message and truth brought by the Prophet Muhammad. They always deny the Day of Judgment, the day of resurrection, and the day of reckoning, because they don't want to think about it. They just want to have fun in this world, so they feel it's pointless to think about how things will be after death. According to them, the dead body must have crumbled into the ground and will not return. In fact, God has the power to destroy them in various ways, just as God destroyed the rebellious ancients. Some were destroyed by typhoons and great floods, some were destroyed by violent earthquakes, and some were destroyed by thunderous noises. However, Allah has the nature of mercy and compassion. For this reason, Allah did not inflict on the polytheists of Mecca the torments that were inflicted on the former ummah, in the hope that there might be unbelievers who disobeyed and challenged them or their descendants who would believe. The Quran states that all inanimate and living things in the universe are created in pairs. The verse above gives an example of plants. However, actually the concept of pairing is not only in plants, but in almost all of their creations. In the Qur'an it is stated, among other things: \"Glory be to Him who has created pairs of all, both from what the earth and themselves grow and from what they do not know.\" (Yasin\/36: 36). \"And We have created everything in pairs...\" (adz-dzariyat\/51: 49)."
		   },
		   {
			"id": 2942,
			"surah": 26,
			"ayat": 10,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to tell his disbelieving people the story of Prophet Musa as dealing with Pharaoh. This story begins when the Prophet Musa was still on Mount Sinai, he received an order to go to Egypt to call on Pharaoh with his people who had gone astray. They are a people who have always been unjust, who have long enslaved the Children of Israel and have acted arbitrarily against them. Prophet Musa was ordered to convey the treatise to Pharaoh and his people who were so arrogant and arrogant. People who consider themselves the descendants of the gods, while other nations are despicable people, including the Israelites, the people of Moses themselves. Pharaoh had a powerful empire and soldiers who were brave and fully armed. To Pharaoh and his people, Moses was commanded by Allah to call on them to change their ingrained beliefs to become people of faith and piety by leaving all those actions and beliefs that were not right. Of course Musa was a bit worried and worried about his fate in dealing with this rude and arrogant people."
		   },
		   {
			"id": 2943,
			"surah": 26,
			"ayat": 11,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to tell his disbelieving people the story of Prophet Musa as dealing with Pharaoh. This story begins when the Prophet Musa was still on Mount Sinai, he received an order to go to Egypt to call on Pharaoh with his people who had gone astray. They are a people who have always been unjust, who have long enslaved the Children of Israel and have acted arbitrarily against them. Prophet Musa was ordered to convey the treatise to Pharaoh and his people who were so arrogant and arrogant. People who consider themselves the descendants of the gods, while other nations are despicable people, including the Israelites, the people of Moses themselves. Pharaoh had a powerful empire and soldiers who were brave and fully armed. To Pharaoh and his people, Moses was commanded by Allah to call on them to change their ingrained beliefs to become people of faith and piety by leaving all those actions and beliefs that were not right. Of course Musa was a bit worried and worried about his fate in dealing with this rude and arrogant people."
		   },
		   {
			"id": 2944,
			"surah": 26,
			"ayat": 12,
			"tafsir": "In this verse, Allah explains how Musa as responded to the command of his Lord. Musa (as) was fully aware that he had to carry out God's commands because it was his duty as a messenger. However, Musa (as) imagined how the Pharaoh's people had strayed from the right path. He also knows how hard and rude they are towards people who oppose their beliefs, while he himself feels like a weak and helpless person. Musa was very worried that Pharaoh's people would accuse him of being a liar and a liar. Moreover, if there was a fierce debate with Pharaoh and his people, Musa, who was not so eloquent in his tongue, would become nervous in giving proper and strong reasons, so that his chest would narrow when facing them. Musa complained about everything he felt to Allah and asked Him to appoint Harun as, his brother, to be an apostle to help and help him. Aaron is an eloquent person and is good at expressing what is in his heart in good and interesting language. This is also mentioned in another verse: He (Moses) said, \"O my Lord, expand my chest, and make my affairs easy for me, and remove the stiffness from my tongue, so that they understand my words, and make me a servant from my family, (namely) Aaron, my brother, strengthen my strength with (the presence of) him, and make him a friend in my affairs. (thaha\/20: 25-32). Similarly, it is stated in another of His words, namely: And my brother Aaron, he is more eloquent in tongue than I, so send him with me as my helper to justify my (sayings); indeed, I am afraid they will lie to me.\" (al-Qasas\/28: 34). Musa was worried that he would face Pharaoh and his people alone because he had accidentally killed a Qibthi (native Egyptian). This happened when Musa saw a fight that took place between the Qibthi people and a Bani Israel. He intended to help this member of his clan and hit the Qibthi so hard that he fell and died immediately. Musa was worried that he would be killed by Pharaoh's people because of this incident, so he could not convey his message. However, if Aaron was by his side and he was killed, then his brother could continue his message. So Musa's request that Aaron be appointed as an apostle to help him is not because he was afraid of death in conveying his preaching and treatise, but so that his preaching and treatise would not stop if he died, because it was continued by his brother, Harun."
		   },
		   {
			"id": 2945,
			"surah": 26,
			"ayat": 13,
			"tafsir": "In this verse, Allah explains how Musa as responded to the command of his Lord. Musa (as) was fully aware that he had to carry out God's commands because it was his duty as a messenger. However, Musa (as) imagined how the Pharaoh's people had strayed from the right path. He also knows how hard and rude they are towards people who oppose their beliefs, while he himself feels like a weak and helpless person. Musa was very worried that Pharaoh's people would accuse him of being a liar and a liar. Moreover, if there was a fierce debate with Pharaoh and his people, Musa, who was not so eloquent in his tongue, would become nervous in giving proper and strong reasons, so that his chest would narrow when facing them. Musa complained about everything he felt to Allah and asked Him to appoint Harun as, his brother, to be an apostle to help and help him. Aaron is an eloquent person and is good at expressing what is in his heart in good and interesting language. This is also mentioned in another verse: He (Moses) said, \"O my Lord, expand my chest, and make my affairs easy for me, and remove the stiffness from my tongue, so that they understand my words, and make me a servant from my family, (namely) Aaron, my brother, strengthen my strength with (the presence of) him, and make him a friend in my affairs. (thaha\/20: 25-32). Similarly, it is stated in another of His words, namely: And my brother Aaron, he is more eloquent in tongue than I, so send him with me as my helper to justify my (sayings); indeed, I am afraid they will lie to me.\" (al-Qasas\/28: 34). Musa was worried that he would face Pharaoh and his people alone because he had accidentally killed a Qibthi (native Egyptian). This happened when Musa saw a fight that took place between the Qibthi people and a Bani Israel. He intended to help this member of his clan and hit the Qibthi so hard that he fell and died immediately. Musa was worried that he would be killed by Pharaoh's people because of this incident, so he could not convey his message. However, if Aaron was by his side and he was killed, then his brother could continue his message. So Musa's request that Aaron be appointed as an apostle to help him is not because he was afraid of death in conveying his preaching and treatise, but so that his preaching and treatise would not stop if he died, because it was continued by his brother, Harun."
		   },
		   {
			"id": 2946,
			"surah": 26,
			"ayat": 14,
			"tafsir": "In this verse, Allah explains how Musa as responded to the command of his Lord. Musa (as) was fully aware that he had to carry out God's commands because it was his duty as a messenger. However, Musa (as) imagined how the Pharaoh's people had strayed from the right path. He also knows how hard and rude they are towards people who oppose their beliefs, while he himself feels like a weak and helpless person. Musa was very worried that Pharaoh's people would accuse him of being a liar and a liar. Moreover, if there was a fierce debate with Pharaoh and his people, Musa, who was not so eloquent in his tongue, would become nervous in giving proper and strong reasons, so that his chest would narrow when facing them. Musa complained about everything he felt to Allah and asked Him to appoint Harun as, his brother, to be an apostle to help and help him. Aaron is an eloquent person and is good at expressing what is in his heart in good and interesting language. This is also mentioned in another verse: He (Moses) said, \"O my Lord, expand my chest, and make my affairs easy for me, and remove the stiffness from my tongue, so that they understand my words, and make me a servant from my family, (namely) Aaron, my brother, strengthen my strength with (the presence of) him, and make him a friend in my affairs. (thaha\/20: 25-32). Similarly, it is stated in another of His words, namely: And my brother Aaron, he is more eloquent in tongue than I, so send him with me as my helper to justify my (sayings); indeed, I am afraid they will lie to me.\" (al-Qasas\/28: 34). Musa was worried that he would face Pharaoh and his people alone because he had accidentally killed a Qibthi (native Egyptian). This happened when Musa saw a fight that took place between the Qibthi people and a Bani Israel. He intended to help this member of his clan and hit the Qibthi so hard that he fell and died immediately. Musa was worried that he would be killed by Pharaoh's people because of this incident, so he could not convey his message. However, if Aaron was by his side and he was killed, then his brother could continue his message. So Musa's request that Aaron be appointed as an apostle to help him is not because he was afraid of death in conveying his preaching and treatise, but so that his preaching and treatise would not stop if he died, because it was continued by his brother, Harun."
		   },
		   {
			"id": 2947,
			"surah": 26,
			"ayat": 15,
			"tafsir": "In these verses, Allah confirmed to Musa (as) that everything he was worried about would not happen. He would not be able to be killed by Pharaoh because Pharaoh would not be able to act arbitrarily against him. As for Moses' request that his brother, Aaron, be appointed as an apostle has been granted by God. That way, the order to go preaching to Pharaoh and his people was borne by Musa and Harun. In another verse, Allah confirms that Moses' request was granted, namely: He (Allah) said, \"Indeed, your request has been granted, O Musa! (thaha\/20: 36). Allah tells the departure of Musa and Harun calling on Pharaoh and his people to the religion of monotheism by bringing a miracle that would strengthen his call, namely Musa's staff which could become a snake, and his hands when inserted into his armpits would become white and shining.To dispel all the anxiety and worry in the hearts of Moses and Aaron, Allah confirmed that He would always hear and pay attention to what will happen when the two of them have faced Pharaoh. This is clearly explained in another verse, namely: He (Allah) said, \"Don't worry both of you, in fact I am with you both, I hear and see. (thaha\/20: 46). Allah ordered Musa and Harun to say emphatically to Pharaoh that they had come before him to convey that they were both messengers sent by Allah, Lord of the worlds, to him and his people. In addition, both of them had to ask Pharaoh to free the Children of Israel who had been enslaved so far. Both of them wanted to take them back to the holy land of Baitul Makdis, the land of their homeland, where their ancestors had lived there since ancient times. This is so that they can freely embrace the monotheistic religion without any pressure or obstacles from anyone. In Tafsir al-Maragi it is explained that according to history, the Children of Israel who lived in Egypt were enslaved by Pharaoh and his people for a long time, namely for 400 years. Pharaoh was indeed very powerful and acted arbitrarily against his people, especially the Children of Israel. According to al-Qurtubi, as quoted by al-Maragi, Musa and Harun had to wait one year before they could meet Pharaoh."
		   },
		   {
			"id": 2948,
			"surah": 26,
			"ayat": 16,
			"tafsir": "In these verses, Allah confirmed to Musa (as) that everything he was worried about would not happen. He would not be able to be killed by Pharaoh because Pharaoh would not be able to act arbitrarily against him. As for Moses' request that his brother, Aaron, be appointed as an apostle has been granted by God. That way, the order to go preaching to Pharaoh and his people was borne by Musa and Harun. In another verse, Allah confirms that Moses' request was granted, namely: He (Allah) said, \"Indeed, your request has been granted, O Musa! (thaha\/20: 36). Allah tells the departure of Musa and Harun calling on Pharaoh and his people to the religion of monotheism by bringing a miracle that would strengthen his call, namely Musa's staff which could become a snake, and his hands when inserted into his armpits would become white and shining.To dispel all the anxiety and worry in the hearts of Moses and Aaron, Allah confirmed that He would always hear and pay attention to what will happen when the two of them have faced Pharaoh. This is clearly explained in another verse, namely: He (Allah) said, \"Don't worry both of you, in fact I am with you both, I hear and see. (thaha\/20: 46). Allah ordered Musa and Harun to say emphatically to Pharaoh that they had come before him to convey that they were both messengers sent by Allah, Lord of the worlds, to him and his people. In addition, both of them had to ask Pharaoh to free the Children of Israel who had been enslaved so far. Both of them wanted to take them back to the holy land of Baitul Makdis, the land of their homeland, where their ancestors had lived there since ancient times. This is so that they can freely embrace the monotheistic religion without any pressure or obstacles from anyone. In Tafsir al-Maragi it is explained that according to history, the Children of Israel who lived in Egypt were enslaved by Pharaoh and his people for a long time, namely for 400 years. Pharaoh was indeed very powerful and acted arbitrarily against his people, especially the Children of Israel. According to al-Qurtubi, as quoted by al-Maragi, Musa and Harun had to wait one year before they could meet Pharaoh."
		   },
		   {
			"id": 2949,
			"surah": 26,
			"ayat": 17,
			"tafsir": "In these verses, Allah confirmed to Musa (as) that everything he was worried about would not happen. He would not be able to be killed by Pharaoh because Pharaoh would not be able to act arbitrarily against him. As for Moses' request that his brother, Aaron, be appointed as an apostle has been granted by God. That way, the order to go preaching to Pharaoh and his people was borne by Musa and Harun. In another verse, Allah confirms that Moses' request was granted, namely: He (Allah) said, \"Indeed, your request has been granted, O Musa! (thaha\/20: 36). Allah tells the departure of Musa and Harun calling on Pharaoh and his people to the religion of monotheism by bringing a miracle that would strengthen his call, namely Musa's staff which could become a snake, and his hands when inserted into his armpits would become white and shining.To dispel all the anxiety and worry in the hearts of Moses and Aaron, Allah confirmed that He would always hear and pay attention to what will happen when the two of them have faced Pharaoh. This is clearly explained in another verse, namely: He (Allah) said, \"Don't worry both of you, in fact I am with you both, I hear and see. (thaha\/20: 46). Allah ordered Musa and Harun to say emphatically to Pharaoh that they had come before him to convey that they were both messengers sent by Allah, Lord of the worlds, to him and his people. In addition, both of them had to ask Pharaoh to free the Children of Israel who had been enslaved so far. Both of them wanted to take them back to the holy land of Baitul Makdis, the land of their homeland, where their ancestors had lived there since ancient times. This is so that they can freely embrace the monotheistic religion without any pressure or obstacles from anyone. In Tafsir al-Maragi it is explained that according to history, the Children of Israel who lived in Egypt were enslaved by Pharaoh and his people for a long time, namely for 400 years. Pharaoh was indeed very powerful and acted arbitrarily against his people, especially the Children of Israel. According to al-Qurtubi, as quoted by al-Maragi, Musa and Harun had to wait one year before they could meet Pharaoh."
		   },
		   {
			"id": 2950,
			"surah": 26,
			"ayat": 18,
			"tafsir": "When Musa and Harun were allowed to appear before Pharaoh and confirm to him that they were both messengers of Allah, the Creator of the universe and asked that the Children of Israel be released from slavery and allowed to leave Egypt, Pharaoh was very surprised and felt astonished. He was surprised why the two of them were so daring to oppose his rule, while he himself considered himself a god for his people, including in this case the Children of Israel. Then Musa and Aaron also demanded the liberation of all the Children of Israel from the clutches of slavery. Pharaoh wondered why Musa had the courage to say two things that made no sense at all? Pharaoh knew very well that Musa was his foster son. Since childhood, he was educated and brought up in his palace. Pharaoh also knew that as an adult, Musa had killed a person close to him, namely his own cook when he fought with one of the Children of Israel. Pharaoh was also surprised why Musa, with such a biography, dared to challenge his authority and demanded things that did not make sense in his opinion. With a loud tone and unbearable anger, Pharaoh replied, \"Didn't we raise and educate you since childhood? We saved you from being killed where at that time we ordered that every male child of the Children of Israel must be killed. . We educated and raised them in our palaces, we love and care for them like loving and caring for our own children. However, now you are asking us for two things that are impossible to happen, namely that I step down from my divine throne and admit that you are an apostle of A God we don't know. Then you also ask that the Children of Israel who have lived in this land of Egypt for centuries be released and you take them to a land that you consider your ancestral land. This is a joke that is not funny and is stupid and stupid which shows that both of you are unscrupulous humans maybe even humans who have gone mad.\""
		   },
		   {
			"id": 2951,
			"surah": 26,
			"ayat": 19,
			"tafsir": "When Musa and Harun were allowed to appear before Pharaoh and confirm to him that they were both messengers of Allah, the Creator of the universe and asked that the Children of Israel be released from slavery and allowed to leave Egypt, Pharaoh was very surprised and felt astonished. He was surprised why the two of them were so daring to oppose his rule, while he himself considered himself a god for his people, including in this case the Children of Israel. Then Musa and Aaron also demanded the liberation of all the Children of Israel from the clutches of slavery. Pharaoh wondered why Musa had the courage to say two things that made no sense at all? Pharaoh knew very well that Musa was his foster son. Since childhood, he was educated and brought up in his palace. Pharaoh also knew that as an adult, Musa had killed a person close to him, namely his own cook when he fought with one of the Children of Israel. Pharaoh was also surprised why Musa, with such a biography, dared to challenge his authority and demanded things that did not make sense in his opinion. With a loud tone and unbearable anger, Pharaoh replied, \"Didn't we raise and educate you since childhood? We saved you from being killed where at that time we ordered that every male child of the Children of Israel must be killed. . We educated and raised them in our palaces, we love and care for them like loving and caring for our own children. However, now you are asking us for two things that are impossible to happen, namely that I step down from my divine throne and admit that you are an apostle of A God we don't know. Then you also ask that the Children of Israel who have lived in this land of Egypt for centuries be released and you take them to a land that you consider your ancestral land. This is a joke that is not funny and is stupid and stupid which shows that both of you are unscrupulous humans maybe even humans who have gone mad.\""
		   },
		   {
			"id": 2952,
			"surah": 26,
			"ayat": 20,
			"tafsir": "In these verses, Allah explains Musa's answer to Pharaoh's insults and insults towards him, after the stiffness of his tongue was gone. Musa explained that the murder he committed against Pharaoh's baker who had a fight with one of the Children of Israel was an accident and was not planned. He just wanted to intervene and teach the baker a lesson not to be rude and insult the Children of Israel. He did beat him but did not intend to kill, because he could not bear to see the baker being so arrogant and insulting his people, the Children of Israel. If it is considered a mistake, then Musa admits that at that time he really made a mistake. Now he has changed, Musa has become an apostle who was given the task by Allah to invite Pharaoh and his people to true religious life. Musa was also given the task of freeing the Children of Israel from slavery that was not right, namely human slavery by humans. If Pharaoh mentioned his good merits for raising and educating Musa in the palace, this was due to Pharaoh's wisdom on his wife's desire to save him when his mother threw him into the Nile River. Fir'aun's family then took him and looked after and raised him. On the other hand, Pharaoh had exploited the Children of Israel by treating them as slaves."
		   },
		   {
			"id": 2953,
			"surah": 26,
			"ayat": 21,
			"tafsir": "In these verses, Allah explains Musa's answer to Pharaoh's insults and insults towards him, after the stiffness of his tongue was gone. Musa explained that the murder he committed against Pharaoh's baker who had a fight with one of the Children of Israel was an accident and was not planned. He just wanted to intervene and teach the baker a lesson not to be rude and insult the Children of Israel. He did beat him but did not intend to kill, because he could not bear to see the baker being so arrogant and insulting his people, the Children of Israel. If it is considered a mistake, then Musa admits that at that time he really made a mistake. Now he has changed, Musa has become an apostle who was given the task by Allah to invite Pharaoh and his people to true religious life. Musa was also given the task of freeing the Children of Israel from slavery that was not right, namely human slavery by humans. If Pharaoh mentioned his good merits for raising and educating Musa in the palace, this was due to Pharaoh's wisdom on his wife's desire to save him when his mother threw him into the Nile River. Fir'aun's family then took him and looked after and raised him. On the other hand, Pharaoh had exploited the Children of Israel by treating them as slaves."
		   },
		   {
			"id": 2954,
			"surah": 26,
			"ayat": 22,
			"tafsir": "In these verses, Allah explains Musa's answer to Pharaoh's insults and insults towards him, after the stiffness of his tongue was gone. Musa explained that the murder he committed against Pharaoh's baker who had a fight with one of the Children of Israel was an accident and was not planned. He just wanted to intervene and teach the baker a lesson not to be rude and insult the Children of Israel. He did beat him but did not intend to kill, because he could not bear to see the baker being so arrogant and insulting his people, the Children of Israel. If it is considered a mistake, then Musa admits that at that time he really made a mistake. Now he has changed, Musa has become an apostle who was given the task by Allah to invite Pharaoh and his people to true religious life. Musa was also given the task of freeing the Children of Israel from slavery that was not right, namely human slavery by humans. If Pharaoh mentioned his good merits for raising and educating Musa in the palace, this was due to Pharaoh's wisdom on his wife's desire to save him when his mother threw him into the Nile River. Fir'aun's family then took him and looked after and raised him. On the other hand, Pharaoh had exploited the Children of Israel by treating them as slaves."
		   },
		   {
			"id": 2955,
			"surah": 26,
			"ayat": 23,
			"tafsir": "In these verses, Allah explains Musa's answer to Pharaoh's insults and insults towards him, after the stiffness of his tongue was gone. Musa explained that the murder he committed against Pharaoh's baker who had a fight with one of the Children of Israel was an accident and was not planned. He just wanted to intervene and teach the baker a lesson not to be rude and insult the Children of Israel. He did beat him but did not intend to kill, because he could not bear to see the baker being so arrogant and insulting his people, the Children of Israel. If it is considered a mistake, then Musa admits that at that time he really made a mistake. Now he has changed, Musa has become an apostle who was given the task by Allah to invite Pharaoh and his people to true religious life. Musa was also given the task of freeing the Children of Israel from slavery that was not right, namely human slavery by humans. If Pharaoh mentioned his good merits for raising and educating Musa in the palace, this was due to Pharaoh's wisdom on his wife's desire to save him when his mother threw him into the Nile River. Fir'aun's family then took him and looked after and raised him. On the other hand, Pharaoh had exploited the Children of Israel by treating them as slaves."
		   },
		   {
			"id": 2956,
			"surah": 26,
			"ayat": 24,
			"tafsir": "In this verse, Allah explains that after Pharaoh heard Musa's words and saw his convincing attitude and sincerity in conveying da'wah, especially those related to monotheism, namely that Pharaoh and his people would worship God Almighty who created them, then Fir' aun rose against. He asked in an angry tone, \"O Musa, you claim to be the messenger of the Lord of the worlds. What is the Lord of the worlds?\" Pharaoh was very surprised and felt offended at Musa's confession about the power and oneness of Allah because he had proclaimed to his people that he was the only god, there is no god but him, as Allah explained in His word: And Pharaoh said, \"O rulers of my people! I do not know that there is a God for you besides me. (al-Qasas\/28: 38) (24) In this verse, Allah explains Musa's answer to Pharaoh's question about the God that Moses acknowledged as the God who sent him. To make it easier for Pharaoh to understand what was being asked, Musa explained some of the characteristics that show God's power over all the worlds, according to the purpose of Pharaoh's question. Musa said that God who sent him was the God who created the heavens and the earth and what -what is between the two as best as possible.God who made the sun, the moon, the sparkling stars in the sky, the rivers, the seas, the mountains, the trees hon, the animals, the plants of the earth, the wind, air, and other things that exist between the heavens and the earth. If indeed Pharaoh and his people were cool-headed, sane-minded, and open-hearted people, then with Musa's answer, of course he would have believed and believed in the oneness of God who sent Moses."
		   },
		   {
			"id": 2957,
			"surah": 26,
			"ayat": 25,
			"tafsir": "In this verse it is explained about Pharaoh's reaction to Musa's answer above. After hearing Musa's answer, he quickly turned to his people who were around him, and expressed his astonishment. Pharaoh said to them in a sarcastic and mocking tone, \"O my people, you all have heard the words of Musa who said that there is a god besides me? Is that not something strange and something that is an aberration?\" This was done by Pharaoh because he was worried that his people would be affected by Musa's answer. If so, they would turn their backs on disbelief and acknowledge him as God again."
		   },
		   {
			"id": 2958,
			"surah": 26,
			"ayat": 26,
			"tafsir": "Musa saw that Pharaoh and his people were still not satisfied with the answer, so they did not want to admit and believe that the one who sent Musa, God calls all the worlds. Musa then added his explanation with the hope that with this additional explanation, they would realize and realize their misguided stance. Musa said that the God who sent him was the God of Pharaoh and his ancestors. Musa turned their eyes to an important matter, namely that the real God is the God who created them, their ancestors, and Pharaoh. With this incident, they will think that they and nature exist because there is a Creator and someone who regulates it, has the power to do according to His will. It is the God of the universe who arranges it, namely God who is essential and still exists, even though all His creatures are no longer there and He is Qadim without beginning. He is also the God who sent Moses."
		   },
		   {
			"id": 2959,
			"surah": 26,
			"ayat": 27,
			"tafsir": "After Musa explained the evidence for the lordship of Allah who sent him, Pharaoh remained silent for a thousand languages, unable to give an answer. He then issued words addressed to his people to doubt them against the reasons and evidence that had been put forward by the Prophet Musa. Pharaoh said, \"O my people. In fact the apostle who claims that he was sent to you all, is actually a madman. He issued words that could not be understood and understood at all because he said that there is a God besides me.\""
		   },
		   {
			"id": 2960,
			"surah": 26,
			"ayat": 28,
			"tafsir": "In this verse, Moses reiterates the attributes of God calling out to all nature who sent him. He is the God who rules east and west and what is between them. He is the God who made the east where the sun rises, and the west where the sun sets. He is also the one who makes the journey of the stars in an orderly circulation. Those who are willing to use their minds can certainly understand that such incidents are clear evidence showing the existence of a God who arranges everything neatly and very well. Musa at first faced and answered Pharaoh's question with a gentle tone and steady words: \"if you use your mind\". That speech was appropriate to reject Fir'awn's accusation that he was a madman."
		   },
		   {
			"id": 2961,
			"surah": 26,
			"ayat": 29,
			"tafsir": "In this verse, Allah tells us that when Pharaoh was unable to paralyze the information and evidence presented by Musa to him, he then became violent and threatened Musa. Pharaoh said, \"O Musa. If you dare to worship God besides me, then I will put you in prison. There you will feel very painful torture, cruel treatment, and there is not the slightest mercy.\" The torture suffered by those who were imprisoned by Pharaoh was more severe than murder, because he imprisoned a person until the person concerned died."
		   },
		   {
			"id": 2962,
			"surah": 26,
			"ayat": 30,
			"tafsir": "In this verse, Allah explains that when Musa saw Pharaoh's treatment that threatened the safety of his soul, he was forced not to present evidence that is usually acceptable to reason. He turned to miracles and extraordinary things. Musa said to Pharaoh, \"O Pharaoh, are you going to imprison me even if I put forward a clear argument for the truth of my confession? That argument is a miracle that proves the existence of God Almighty, and the truth of my prophethood.\""
		   },
		   {
			"id": 2963,
			"surah": 26,
			"ayat": 31,
			"tafsir": "In this verse, Allah explains that when Pharaoh heard the words of Prophet Musa, he said, \"O Musa, if you are true in your claim that you are an apostle, then bring us something that is real. Someone who claims to be a apostle, of course, has evidence to justify his claim.\" Pharaoh put forward the invitation because he was sure that Musa would not be able to fulfill his request."
		   },
		   {
			"id": 2964,
			"surah": 26,
			"ayat": 32,
			"tafsir": "In this verse, Allah explains that after Pharaoh put forward demands that Musa should bring clear evidence of the truth of his preaching, Musa immediately threw down his staff which suddenly transformed into a real snake. It is mentioned in Tafsir ar-Razi that after Musa's staff turned into a snake, the snake bounced up, then fell back down to earth straight to Pharaoh. Pharaoh said, \"By the one who sent you Musa, take the snake, otherwise I will take it myself.\" Musa then took it and the snake returned to being a stick again as usual."
		   },
		   {
			"id": 2965,
			"surah": 26,
			"ayat": 33,
			"tafsir": "In this verse, Allah explains that after Musa finished showing the clear evidence, Pharaoh said, \"Are there any other miracles besides that?\" Musa replied, \"Yes.\" Musa then put his hands into his pockets, then took them out again. Suddenly the hand glowed illuminating the circumstances around him, because the light was very bright. Ibn 'Abbas said, \"When Musa took his hand out of his shirt, suddenly that hand became white and shone shining on those who saw it, like the sun's rays that blinded the eyes.\""
		   },
		   {
			"id": 2966,
			"surah": 26,
			"ayat": 34,
			"tafsir": "When Pharaoh saw and witnessed the evidence shown by Musa, which showed the truth of his preaching, he still denied and strongly opposed Musa. He then put forward three things to the leaders of his people. First, to relieve the hearts of the dignitaries and leaders of the people who were around him, Pharaoh said to them, \"Indeed, this Musa, is truly an accomplished sorcerer, not God's apostle calling all the worlds as he claims. What he demonstrated was not a miracle, but sheer magic.\""
		   },
		   {
			"id": 2967,
			"surah": 26,
			"ayat": 35,
			"tafsir": "Second, to incite and instill hatred in the hearts of the dignitaries and leaders of their people, so that they do not believe in Musa, Pharaoh said to them, \"Actually the intention of the magic that Moses showed was to win the hearts of the people. It aims to make supporters and his followers will multiply to defeat your princes and princes. Finally, they will seize and expel you from your own country.\" Third, Pharaoh asked for considerations, ideas, and suggestions from the princes of his country and the leaders of his people, about what he should do, and how to do it to stem and frustrate Musa's wishes. Abu as-Su'ud, the author of Tafsir Ersyad al-'Aql as-Salim ila Mazaya al-Kitab al-Karim, considers Pharaoh's request to the ruler of his country to be the result of his confusion and astonishment at the miracle that Moses has shown. This caused Pharaoh to change his attitude in three ways which demeaned him and lowered his position:"
		   },
		   {
			"id": 2968,
			"surah": 26,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains the answers of the dignitaries and leaders of the Pharaohs for the advice he asked for. They suggested that the business of Moses and his brother Aaron should be postponed because they would gather all the master magicians in their land. The sorcerers were gathered and ordered to come and have a magic contest with Moses. On the day and place that has been determined, the sorcerers must show their superiority in front of Pharaoh and Musa. According to them, at that time victory will be on their side so that the people back to support him. This suggestion was well received by Pharaoh and will be implemented in time. In return, he would also meet their demands."
		   },
		   {
			"id": 2969,
			"surah": 26,
			"ayat": 37,
			"tafsir": "In this verse, Allah explains the answers of the dignitaries and leaders of the Pharaohs for the advice he asked for. They suggested that the business of Moses and his brother Aaron should be postponed because they would gather all the master magicians in their land. The sorcerers were gathered and ordered to come and have a magic contest with Moses. On the day and place that has been determined, the sorcerers must show their superiority in front of Pharaoh and Musa. According to them, at that time victory will be on their side so that the people back to support him. This suggestion was well received by Pharaoh and will be implemented in time. In return, he would also meet their demands."
		   },
		   {
			"id": 2970,
			"surah": 26,
			"ayat": 38,
			"tafsir": "In this verse, Allah explains that after Pharaoh received advice from the dignitaries and leaders of his people not to act rashly on Musa, and it was better to gather magicians, then Pharaoh carried out the suggestion. He ordered that the sorcerers be ready at the appointed time, that is, on the day that was announced as a holiday."
		   },
		   {
			"id": 2971,
			"surah": 26,
			"ayat": 39,
			"tafsir": "In these verses, Allah explains that Pharaoh ordered his people to gather, to witness the events that will occur on the day designated as the feast day. Pharaoh believed that his party would get the victory. He thought that none of his people would believe in Moses. Pharaoh deliberately gathered all his people to witness a power struggle between his magicians and Musa, so that they would continue to follow the magicians and stick to their religion."
		   },
		   {
			"id": 2972,
			"surah": 26,
			"ayat": 40,
			"tafsir": "In these verses, Allah explains that Pharaoh ordered his people to gather, to witness the events that will occur on the day designated as the feast day. Pharaoh believed that his party would get the victory. He thought that none of his people would believe in Moses. Pharaoh deliberately gathered all his people to witness a power struggle between his magicians and Musa, so that they would continue to follow the magicians and stick to their religion."
		   },
		   {
			"id": 2973,
			"surah": 26,
			"ayat": 41,
			"tafsir": "In these verses, Allah explains that after gathering in the room where Pharaoh was sitting, the sorcerers asked Pharaoh's wisdom to pay them and make them closer to him if they won later. Pharaoh accepted the request well, he even promised to make them advisors who were always invited to sit together, and made the people closest to him. After there was a mutual understanding between the sorcerers and Pharaoh about payment and other facilities, they then pitted against Musa. They asked him, \"O Musa! Was it you who performed and demonstrated your magic first or were we the first?\""
		   },
		   {
			"id": 2974,
			"surah": 26,
			"ayat": 42,
			"tafsir": "In these verses, Allah explains that after gathering in the room where Pharaoh was sitting, the sorcerers asked Pharaoh's wisdom to pay them and make them closer to him if they won later. Pharaoh accepted the request well, he even promised to make them advisors who were always invited to sit together, and made the people closest to him. After there was a mutual understanding between the sorcerers and Pharaoh about payment and other facilities, they then pitted against Musa. They asked him, \"O Musa! Was it you who performed and demonstrated your magic first or were we the first?\""
		   },
		   {
			"id": 2975,
			"surah": 26,
			"ayat": 43,
			"tafsir": "This verse describes the atmosphere of a power struggle between the magicians of Pharaoh and the miracles of Prophet Musa. Musa offered the magicians to start their magic, which they believed could invalidate Moses' recognition as an apostle of God. Pharaoh's sorcerers immediately threw the ropes they had prepared while saying Pharaoh's name, and they felt sure they would win. With the swift movement of their hands and magic, the ropes seemed to move, deceiving onlookers so that they thought the ropes had turned into real snakes, slithering to and fro. This is described in the word of God: Then suddenly their ropes and sticks appeared to him (Moses) as if he was crawling fast, because of their magic. (thaha\/20: 66) With their magic, the magicians have frightened and deceived the eyes of many people. They put out all the abilities that were in them, and considered it was enough to gain victory in the power struggle."
		   },
		   {
			"id": 2976,
			"surah": 26,
			"ayat": 44,
			"tafsir": "This verse describes the atmosphere of a power struggle between the magicians of Pharaoh and the miracles of Prophet Musa. Musa offered the magicians to start their magic, which they believed could invalidate Moses' recognition as an apostle of God. Pharaoh's sorcerers immediately threw the ropes they had prepared while saying Pharaoh's name, and they felt sure they would win. With the swift movement of their hands and magic, the ropes seemed to move, deceiving onlookers so that they thought the ropes had turned into real snakes, slithering to and fro. This is described in the word of God: Then suddenly their ropes and sticks appeared to him (Moses) as if he was crawling fast, because of their magic. (thaha\/20: 66) With their magic, the magicians have frightened and deceived the eyes of many people. They put out all the abilities that were in them, and considered it was enough to gain victory in the power struggle."
		   },
		   {
			"id": 2977,
			"surah": 26,
			"ayat": 45,
			"tafsir": "After all the Pharaoh's sorcerers threw their ropes and sticks, which in the shadows of the crowd seemed to become snakes, then it was Musa's turn. When Moses dropped his stick which turned into a real snake, suddenly the snake ate up the fake snakes they had made up. Thus it is clear which is true and which is false as stated in the word of God: Then the truth is proven, and everything they do is in vain. (al-A'raf\/7: 118) And His words: Actually, We throw the right (truth) to the wrong (not right) then the right thing destroys it, then immediately (the wrong) disappears. (al-Anbiya'\/21: 18)"
		   },
		   {
			"id": 2978,
			"surah": 26,
			"ayat": 46,
			"tafsir": "After all the Pharaoh's sorcerers threw their ropes and sticks, which in the shadows of the crowd seemed to become snakes, then it was Musa's turn. When Moses dropped his stick which turned into a real snake, suddenly the snake ate up the fake snakes they had made up. Thus it is clear which is true and which is false as stated in the word of God: Then the truth is proven, and everything they do is in vain. (al-A'raf\/7: 118) And His words: Actually, We throw the right (truth) to the wrong (not right) then the right thing destroys it, then immediately (the wrong) disappears. (al-Anbiya'\/21: 18)"
		   },
		   {
			"id": 2979,
			"surah": 26,
			"ayat": 47,
			"tafsir": "In these verses, Allah explains that after witnessing what happened, Pharaoh's magicians surrendered. They fell on their knees and then prostrated themselves to Allah, the Almighty and Almighty God, while vowing, \"We have believed in the Lord of the Worlds, namely the God who worshiped Moses and Aaron.\" They do so because they are aware that what they are showing to the public is just a fantasy and a trick. As for what Moses showed was a miracle, and really not magic. It was a power far superior to anything they knew, and came from heaven to strengthen Moses in his claim to be an apostle of God."
		   },
		   {
			"id": 2980,
			"surah": 26,
			"ayat": 48,
			"tafsir": "In these verses, Allah explains that after witnessing what happened, Pharaoh's magicians surrendered. They fell on their knees and then prostrated themselves to Allah, the Almighty and Almighty God, while vowing, \"We have believed in the Lord of the Worlds, namely the God who worshiped Moses and Aaron.\" They do so because they are aware that what they are showing to the public is just a fantasy and a trick. As for what Moses showed was a miracle, and really not magic. It was a power far superior to anything they knew, and came from heaven to strengthen Moses in his claim to be an apostle of God."
		   },
		   {
			"id": 2981,
			"surah": 26,
			"ayat": 49,
			"tafsir": "After the sorcerers vowed that they would become believers in the Lord of the worlds, meaning they would no longer acknowledge Pharaoh as their god, Pharaoh became very angry. Arrogantly, he threatened to take action against them, but the threat was ignored by them. Even with that threat, their faith has grown stronger because the veil of disbelief has been lifted and the light of truth has become clear to them. The vow made by the sorcerers made Pharaoh feel that his rights as a powerful person had been violated and that he recognized himself as a god, because they had believed in Musa without asking him for permission first. According to Pharaoh, before they embraced the religion of Moses, they had to first ask his permission, because he was a ruler who had to be obeyed. To trick and mislead the people, Pharaoh accused Musa and the sorcerers that there was a conspiracy, because Moses taught them magic. The accusation was of course groundless, because before the power struggle, they had not met Musa. The pinnacle of Pharaoh's anger, he threatened them that they would feel torment as a result of their actions. He threatened to cut off their hands and feet crosswise and even killed them."
		   },
		   {
			"id": 2982,
			"surah": 26,
			"ayat": 50,
			"tafsir": "Pharaoh's threat, which was quite heavy, was completely ignored by the sorcerers. They even wished they could feel the threat because to them everyone who is alive must die at some time, there is no way to escape it. God's Word: Every living thing will taste death. (al-Anbiya'\/21: 35) And His words: Say, \"Surely the death you flee from him, he will surely meet you,\" (al-Jumu'ah\/62: 8) They only think of two things, as a consolation for them: First, they will return to the teachings of the Lord of the Worlds, the God who is worshiped by Musa and Harun and follow the religion of the Prophet Musa as. Thus, they will be safe from the doom of the hereafter which is very painful and prolonged, which is much heavier than the torment that Pharaoh threatened them. Second, they really hope that the Lord of the Worlds will forgive their sins for committing acts of magic and disbelief. They were the first to believe in the God worshiped by Moses, of the many people who also witnessed the power struggle."
		   },
		   {
			"id": 2983,
			"surah": 26,
			"ayat": 51,
			"tafsir": "Pharaoh's threat, which was quite heavy, was completely ignored by the sorcerers. They even wished they could feel the threat because to them everyone who is alive must die at some time, there is no way to escape it. God's Word: Every living thing will taste death. (al-Anbiya'\/21: 35) And His words: Say, \"Surely the death you flee from him, he will surely meet you,\" (al-Jumu'ah\/62: 8) They only think of two things, as a consolation for them: First, they will return to the teachings of the Lord of the Worlds, the God who is worshiped by Musa and Harun and follow the religion of the Prophet Musa as. Thus, they will be safe from the doom of the hereafter which is very painful and prolonged, which is much heavier than the torment that Pharaoh threatened them. Second, they really hope that the Lord of the Worlds will forgive their sins for committing acts of magic and disbelief. They were the first to believe in the God worshiped by Moses, of the many people who also witnessed the power struggle."
		   },
		   {
			"id": 2984,
			"surah": 26,
			"ayat": 52,
			"tafsir": "This verse explains that Allah revealed to Moses to go with the Children of Israel to leave Egypt at night. Allah also reported that when Pharaoh heard this news, he and his army would definitely follow and force them to return to being slaves serving their wants and needs. The departure of the Children of Israel will be a great loss for them."
		   },
		   {
			"id": 2985,
			"surah": 26,
			"ayat": 53,
			"tafsir": "This verse explains that when Pharaoh learned that Musa and the Children of Israel had departed, he then dispatched several of his officials throughout Egypt. He also gathered his army to follow Musa and the Children of Israel, returned them to Egypt, and tortured them with severe tortures. To arouse enthusiasm and encourage his soldiers, Pharaoh said that the task they had to do was easy to carry out because Musa and the Children of Israel were very few in number. Therefore, they need not hesitate. With ease and in a relatively short time, they would be able to catch up with Musa and his party and turn them back."
		   },
		   {
			"id": 2986,
			"surah": 26,
			"ayat": 54,
			"tafsir": "This verse explains that when Pharaoh learned that Musa and the Children of Israel had departed, he then dispatched several of his officials throughout Egypt. He also gathered his army to follow Musa and the Children of Israel, returned them to Egypt, and tortured them with severe tortures. To arouse enthusiasm and encourage his soldiers, Pharaoh said that the task they had to do was easy to carry out because Musa and the Children of Israel were very few in number. Therefore, they need not hesitate. With ease and in a relatively short time, they would be able to catch up with Musa and his party and turn them back."
		   },
		   {
			"id": 2987,
			"surah": 26,
			"ayat": 55,
			"tafsir": "Pharaoh looked for reasons to be hostile to the Children of Israel by saying that they were enemies who were always in chaos so that security was not guaranteed. The Israelites are also said to have always aroused anger, embraced new religions, and left the religion of their ancestors. They dared to leave Egypt without first asking permission, taking away the property they borrowed from Pharaoh and his people. Pharaoh told his people to always be careful and vigilant so that their actions do not have far-reaching consequences. They had sufficient and complete weapons to defeat the Children of Israel."
		   },
		   {
			"id": 2988,
			"surah": 26,
			"ayat": 56,
			"tafsir": "Pharaoh looked for reasons to be hostile to the Children of Israel by saying that they were enemies who were always in chaos so that security was not guaranteed. The Israelites are also said to have always aroused anger, embraced new religions, and left the religion of their ancestors. They dared to leave Egypt without first asking permission, taking away the property they borrowed from Pharaoh and his people. Pharaoh told his people to always be careful and vigilant so that their actions do not have far-reaching consequences. They had sufficient and complete weapons to defeat the Children of Israel."
		   },
		   {
			"id": 2989,
			"surah": 26,
			"ayat": 57,
			"tafsir": "This verse explains that Allah will bring out Pharaoh and his people from pleasure into trouble and destruction. They will leave the luxurious and towering houses, leave the beautiful gardens where they can relax to their heart's content. They will also leave rivers flowing as clear as the Nile to be a part of their lives."
		   },
		   {
			"id": 2990,
			"surah": 26,
			"ayat": 58,
			"tafsir": "Allah explained that Pharaoh and his people would leave wealth, kingdom, and a high and noble position that was incomparable. Ibn Umar, Ibn 'Abbas, and Mujahid stated that what is meant by a noble position here is the pulpits for the Pharaoh's dignitaries. Several commentators differ on this high position. Some argue that these are beautiful houses, and some argue that the pulpits and mahligai of the Pharaoh's dignitaries. Allah says: \"How many gardens and springs they left behind, also gardens and beautiful dwellings, and the pleasures they could enjoy there.\" (ad-Dukhan\/44: 25-27)"
		   },
		   {
			"id": 2991,
			"surah": 26,
			"ayat": 59,
			"tafsir": "This verse explains that all the gardens and beautiful places, rivers, wealth, and high positions that will be left by Pharaoh and his people, will be bestowed upon the Children of Israel in Palestine according to Allah's promise to them. Allah's Word: \"And We inherited to the oppressed people, the eastern and western parts of the earth that We have blessed. And the good word of your Lord was perfect (as a promise) to the Children of Israel because of their patience. And We destroyed what was made Pharaoh and his people and what they built.\" (al-A'raf\/7: 137)"
		   },
		   {
			"id": 2992,
			"surah": 26,
			"ayat": 60,
			"tafsir": "This verse explains that Pharaoh and all his government officials and troops could only leave Egypt to join Musa and the Children of Israel in the morning. Regarding their delay, there are two opinions: First: As mentioned in the Old Testament (Exodus 11-12), they were struck by a deadly disaster on the night when Moses and the Children of Israel left Egypt. In the middle of that night, many Egyptian virgins died, both humans and animals, causing them to be busy burying the bodies until morning. Second: Because that night they were covered in thick fog and very cold air until morning."
		   },
		   {
			"id": 2993,
			"surah": 26,
			"ayat": 61,
			"tafsir": "When Musa and the Children of Israel and Pharaoh and his army were in close proximity, the Children of Israel felt anxious and worried that they would be overtaken by Pharaoh and his army. They said to Musa, \"Pharaoh and his soldiers tortured our children before we left, and when they overtake us, they will all kill us.\""
		   },
		   {
			"id": 2994,
			"surah": 26,
			"ayat": 62,
			"tafsir": "Upon the anxiety and concern of the Children of Israel, Musa comforted them with a firm statement that they would never be overtaken by Pharaoh. His actions to invite and take the Children of Israel out of Egypt to Palestine is God's order and will. Thus, Allah will show them the way out, so that they are safe from all the dangers that threaten them. Allah is also the one who will give him help and victory and guarantee their safety from the cruelty of Pharaoh and his army."
		   },
		   {
			"id": 2995,
			"surah": 26,
			"ayat": 63,
			"tafsir": "This verse explains that Allah revealed to Moses and showed the way out of the danger that threatened it. Musa was ordered to strike his staff into the sea so that the sea was split open and formed a path that would be passed by every descendant of the Children of Israel. Every part of the sea water is a large and high mountain, and forms a dry path and can be passed by the Children of Israel, as Allah says: day, and beat (make) a dry path for them in the sea, (you) need not fear that you will be overtaken and do not need to worry (will drown).\" (thaha\/20: 77)"
		   },
		   {
			"id": 2996,
			"surah": 26,
			"ayat": 64,
			"tafsir": "In this verse, Allah explains that after Pharaoh saw the Children of Israel from up close walking across the sea, he and his army followed in their footsteps and entered the sea. When Pharaoh and his army were in the middle of the sea, while Musa and the Children of Israel had reached the other side of the sea and all of them arrived safely on land, the sea water was linked again as usual. Thus, Pharaoh, who was walking the same path, was trapped in water and drowned with his army, so that no one survived."
		   },
		   {
			"id": 2997,
			"surah": 26,
			"ayat": 65,
			"tafsir": "In this verse, Allah explains that after Pharaoh saw the Children of Israel from up close walking across the sea, he and his army followed in their footsteps and entered the sea. When Pharaoh and his army were in the middle of the sea, while Musa and the Children of Israel had reached the other side of the sea and all of them arrived safely on land, the sea water was linked again as usual. Thus, Pharaoh, who was walking the same path, was trapped in water and drowned with his army, so that no one survived."
		   },
		   {
			"id": 2998,
			"surah": 26,
			"ayat": 66,
			"tafsir": "In this verse, Allah explains that after Pharaoh saw the Children of Israel from up close walking across the sea, he and his army followed in their footsteps and entered the sea. When Pharaoh and his army were in the middle of the sea, while Musa and the Children of Israel had reached the other side of the sea and all of them arrived safely on land, the sea water was linked again as usual. Thus, Pharaoh, who was walking the same path, was trapped in water and drowned with his army, so that no one survived."
		   },
		   {
			"id": 2999,
			"surah": 26,
			"ayat": 67,
			"tafsir": "The success of Musa and all his followers safely reached the other side of the land, and the sinking of Pharaoh and his entire army in the middle of the ocean is a clear sign of Allah's power and the truth of Prophet Musa as His messenger. Allah always gives help and victory to His servants who truly believe. Allah also always destroys and tortures those who deny His verses, especially in the hereafter. Allah's Word: Allah will surely help those who help His (religion). Indeed, Allah is Mighty, Mighty. (al-hajj\/22: 40) Such is the reward (against) the enemies of Allah (namely) hell; they will find eternal abodes therein in return for their disbelief of Our signs. (Fussilat\/41: 28) A man who is hard and has a heart of stone like Pharaoh and his people will not want to believe, even though they clearly see the truth of something. This incident was also a consolation for the Prophet because with it, he knew that it was not only him who had experienced such trials, but also the previous prophets and apostles of Allah. Everything ended in victory for the prophets and messengers of Allah, and defeat for their enemies."
		   },
		   {
			"id": 3000,
			"surah": 26,
			"ayat": 68,
			"tafsir": "This verse explains that Allah is Mighty and Almighty. He will punish His enemies and the enemies of the prophets and apostles. However, Allah is Most Merciful to the supporters and defenders of His religion."
		   },
		   {
			"id": 3001,
			"surah": 26,
			"ayat": 69,
			"tafsir": "Allah ordered the Prophet Muhammad to tell the polytheists of Mecca the story of the Prophet Abraham as a teaching for all his people. They are expected to emulate and emulate the noble qualities that adorned the personality of the Prophet Abraham. He is a person who is sincere in charity, trust, and always worships Allah Almighty. He was awarded by Allah for brain intelligence since childhood as a gift worthy of being received by an apostle. This is what causes Ibrahim to always oppose his people (including his father) who worship idols which they treat as gods."
		   },
		   {
			"id": 3002,
			"surah": 26,
			"ayat": 70,
			"tafsir": "Ibrahim considered that idol worship was something that did not make sense. He asked his father and his people why they devoted themselves to gods who understood nothing. In fact, it was not that he did not know the real nature of the idols being worshiped, but Ibrahim wanted to hear from them the concrete reasons for such worship. According to historians, the statues they worshiped were made of gold and silver, and some were made of copper and iron. Therefore, they feel proud of the god of their creation. \"Why did you deify the statues?\" he asked."
		   },
		   {
			"id": 3003,
			"surah": 26,
			"ayat": 71,
			"tafsir": "The question was answered by his people with arrogance, \"Indeed we are idol worshipers. All our life and life, we willingly dedicate to him.\" According to commentators, the people of Prophet Abraham worshiped idols only during the day. They are very diligent and solemn worship."
		   },
		   {
			"id": 3004,
			"surah": 26,
			"ayat": 72,
			"tafsir": "Hearing this statement, Ibrahim became more convinced that this belief was not based on sound reasons. He began to think about how to straighten the way of thinking of his people who had gone astray. His main task is to return them to the teachings of monotheism. Ibrahim asked again if the idols could hear their prayers. He questioned this in order to test how far their logic could be used to understand words and actions in the form of prayers to these idols. Because if the person being worshiped does not listen, how can he grant the request that is put forward to him. Strictly speaking, how is it possible to correctly understand the nature of worship like that if their brains cannot properly digest the purpose of worshiping these idols."
		   },
		   {
			"id": 3005,
			"surah": 26,
			"ayat": 73,
			"tafsir": "Abraham's next series of questions was whether it was true that the gods they worshiped could bring benefits to life. Could he provide sustenance, eat, and drink if he really was an almighty god? On the other hand, can he release his worshipers from the misfortunes and calamities that have befallen them?"
		   },
		   {
			"id": 3006,
			"surah": 26,
			"ayat": 74,
			"tafsir": "They answered these questions according to what they knew. However, in the end Ibrahim learned the real motive for the worship, which was a tradition inherited from their ancestors. \"We only find our ancestors doing that, and that's the custom that we follow,\" they answered firmly to Ibrahim."
		   },
		   {
			"id": 3007,
			"surah": 26,
			"ayat": 75,
			"tafsir": "The answer did not satisfy him. These baseless acts of taklid must be eradicated. How to eradicate it by way of awakening their minds of their mistakes and their ancestors. Ibrahim reminded whether it had never occurred to him and had never crossed his mind to analyze and reflect on the actions that were merely exemplary."
		   },
		   {
			"id": 3008,
			"surah": 26,
			"ayat": 76,
			"tafsir": "In this verse, he emphasized that they or their ancestors were humans who did not want to use their minds. Because it turns out that the statues that are worshiped cannot hear, let alone understand what is asked of them. Moreover, the statues could neither bring benefit nor repel harm. Its function is solely for human creations which should not be used as offerings."
		   },
		   {
			"id": 3009,
			"surah": 26,
			"ayat": 77,
			"tafsir": "Then the Prophet Abraham confirmed his stance. The establishment of an apostle of God who brought treatises to spread monotheism (monotheism) among his people. He proclaimed himself as the main enemy of their gods. According to him, the only one who has the right to be worshiped is God Almighty, God of the universe. It is to Him that man must devote himself. The belief in monotheism is based on several sound reasons. The mission brought by the Prophet Abraham, was also carried by the previous prophet, Noah. All the prophets and apostles carried such an important task. Besides inviting people to unite with God, they are also openly hostile to every form of worship that in principle associates partners with God. Prophet Noah also opposed his people who intended to harm him due to his call to believe, as described in the word of Allah: Therefore make up your mind and gather your allies (to destroy me), and do not keep your decision secret. Then act upon me, and do not delay any longer. (Yunus\/10: 71) Likewise the word of Allah explains the words of the Prophet Hud as: He (Hud) replied, \"Indeed I bear witness to Allah and witness that I am free from what you associate with. (Had\/11: 54)"
		   },
		   {
			"id": 3010,
			"surah": 26,
			"ayat": 78,
			"tafsir": "In the following verses, Prophet Ibrahim explains some of the arguments for the oneness of God, which are some of the attributes of Allah Rabbul 'alamin. Allah is the creator of humans, with the best creation. He also gives instructions (guidance). As you know, guidance is diverse. There is guidance called the guidance of the five senses, guidance of reason (mind), guidance of instinct (intelligence that is brought from birth), and guidance of religion (ad-din). Reason is God's guidance which is very valuable, because with reason humans are able to distinguish between bad and good. Reason is what distinguishes humans from animals. However, reason alone is not a guarantee for human safety. Therefore, Allah completes his favor by giving them religion. Religious guidance is only God who gives it. If someone is desired by Allah to obtain guidance (religion), no one can stop him. On the other hand, if Allah has not willed it that way, no one can provide guidance. Even the prophets and apostles themselves who were assigned to bring guidance also did not have the authority to give guidance as seen in the story of the Prophet Abraham in another verse (surahh al-An'am\/6: 74-88) which tells of a dialogue between him and his father ( azar) and his people. Ibrahim tried to convert his father to Islam, but Allah did not give guidance, so he remained in polytheism. Likewise, the uncle of the Prophet Muhammad, Abu Talib, who has contributed a lot in developing the Prophet's da'wah in Mecca. The Prophet really wanted his uncle to convert to Islam, but Allah had not given guidance so that he remained polytheist until the end of his life. Allah said: Indeed, you (Muhammad) cannot guide those you love, but Allah guides those whom He wills, and He knows better those who are willing to receive guidance. (al-Qasas\/28: 56)"
		   },
		   {
			"id": 3011,
			"surah": 26,
			"ayat": 79,
			"tafsir": "This verse explains that God gives humans food and drink. Eating and drinking are sustenance from Allah. The way God gives sustenance is by making it easier for humans to obtain it. It all depends on the skills and knowledge possessed by each human being. Allah sent down rain from the sky as a drink for humans, animals and livestock. With the rain water, the earth becomes fertile and produces a variety of plants to be enjoyed. Likewise God provides a thousand kinds of valuable objects in the bowels of the earth such as iron, oil, gold, aluminum, and so on. All with the intention of making the best use of it. Allah says: (He is) Who made the earth a stretch for you and the sky as a roof, and He is the one who sends down water (rain) from the sky, then He produces with it (rain) fruits as sustenance for you. Therefore do not set up equals for Allah, while you know. (al-Baqarah\/2: 22)."
		   },
		   {
			"id": 3012,
			"surah": 26,
			"ayat": 80,
			"tafsir": "This verse explains that it is God who heals man when he is sick. Allah has the power to heal any disease that is suffered by a person. Even so, humans also have to find out how to get that healing. Imam Jamaluddin al-Qasimi in his commentary describes that this verse describes the morality of a servant of Allah to his Creator. Because disease is sometimes the result of human actions themselves, for example caused by violations of health norms, or daily lifestyle, disease attacks on the body cannot be avoided. On the other hand, the one who has the right to cure the disease is Allah alone. If a sick person feels this way when he is sick, then he will really appreciate God's blessings after he recovers from the disease. The fact proves that most people get sick due to lack of attention to the prevailing health norms."
		   },
		   {
			"id": 3013,
			"surah": 26,
			"ayat": 81,
			"tafsir": "This verse emphasizes that it is God who kills humans, then He also revives and resurrects. No one has the right and is able to do that, except He himself. What is meant by reviving in this verse is resurrecting after death. Between the arrival of death and new life is marked by a long time and cannot be known by humans the terms of its arrival. If it is questioned, death is also sometimes the result of human actions themselves, while in this verse Allah emphasizes that He Himself is the one who kills humans, so how do we distinguish between death attributed to Allah and sickness caused by humans? Death is a decree that definitely applies to all people without exception, while special pain befalls someone. This means that not all people suffer from a type of disease, each of them suffers from a different disease. Often people die suddenly, without being preceded by illness. It is clear that death is general in nature, on the contrary, a special illness befalls a person."
		   },
		   {
			"id": 3014,
			"surah": 26,
			"ayat": 82,
			"tafsir": "In this verse it is emphasized that only Allah alone can forgive one's sins in the hereafter (see also surahh ali 'Imran\/3: 135). No one can bear the sins of another, but each is responsible for his own actions. Allah said: And a person will not bear the burden of another person's sins. (al-An'am\/6: 164)"
		   },
		   {
			"id": 3015,
			"surah": 26,
			"ayat": 83,
			"tafsir": "Ibrahim begged to be rewarded with wisdom. Wisdom means knowledge that is practiced properly. In relation to the personality of a pious person, wisdom is interpreted as God's guidance in doing good deeds, with Allah's grace he is free from all major and minor sins. Meanwhile, there are other commentators who interpret wisdom as fair treatment of fellow human beings in deciding a case. In relation to this Abrahamic prayer, wisdom is interpreted as knowledge about the attributes of divinity and knowledge about the truth that will be practiced in everyday life. Apart from that, he also prayed to be included in an environment of good people, and among groups who always put their trust in Him. This request was granted by Allah, as stated in another verse: And verily in the hereafter he will be among the pious. (al-Baqarah\/2: 130) Narrated in a hadith, Rasulullah prayed like the prayer of the Prophet Abraham, namely: \"O Allah, kill us in a state of Muslims, revive us in a state of Muslims, and enter us into the group of pious people, not among those who are despicable and afflicted by calamity (fitrah).\" (Ahmad's history from Rifa'ah bin Rafi')"
		   },
		   {
			"id": 3016,
			"surah": 26,
			"ayat": 84,
			"tafsir": "Furthermore, Ibrahim prayed that his good name would become a good word for those who came later, so that he would become the main role model until the Day of Judgment, this was granted by Allah, as He said: And We immortalized Abraham (praise) in among those who came later, \"Peace be upon Abraham.\" Thus We reward those who do good. (as-saffat\/37: 108-110). Allah's promise in the verse above is proven true in the pages of prophetic history. Lots of descendants of the Prophet Abraham who became prophets and messengers of Allah, both from the descendants of Ishmael or from the descendants of Isaac. The major religions in the world (Islam, Christianity and Judaism) each classify their religion to the Prophet Abraham. Therefore, he is glorified and respected by various religions in their own way. Based on this information, it is natural for them to think that Abraham was a Jew (according to Jewish confessions). Likewise, Abraham is seen as a Christian (according to Christian religious beliefs), because Isa Almasih, the son of Maryam, is also a descendant of the Prophet Abraham. Strictly speaking in prophetic history, he is considered the father of the prophets. However, all allegations that Abraham was a Jew or a member of a certain religion are not true. The Qur'an refutes this belief: Ibrahim was neither a Jew nor a Christian, but he was a straight man, a Muslim and he was not one of the polytheists. (ali 'Imran\/3: 67) The meaning of good speech in this prayer is the Prophet Muhammad. He is indeed a descendant of Prophet Ibrahim (from Ismail's side) who was the last to be appointed as a prophet and apostle. The treatise of the Prophet Muhammad (and also the prophets) is a treatise on the religion of monotheism. Rasulullah himself in a hadith said: I am (the implementation of the prayer of Ibrahim). (Muslim history from 'Aisyah) In essence, the religion conveyed by the Prophet Muhammad is a continuation of the teachings conveyed by the Prophet Abraham."
		   },
		   {
			"id": 3017,
			"surah": 26,
			"ayat": 85,
			"tafsir": "After Prophet Ibrahim asked for worldly rewards, namely by making his good name as a role model for people after him, he also prayed that he would enjoy the reward of his deeds in the hereafter. Namely the pleasures of heaven along with those who are allowed to enter it. The expression of this verse uses the words \"he who inherits heaven\", because it is likened to the pleasures that a king gets in a kingdom inherited from his father."
		   },
		   {
			"id": 3018,
			"surah": 26,
			"ayat": 86,
			"tafsir": "Then he also prayed for the welfare and safety of his father (azar) who was still a polytheist. However, after the Prophet Abraham learned that his father was an enemy of Allah because he associated partners with Him, Ibrahim finally separated from his father. Allah's Word: As for Abraham's request for forgiveness (to Allah) for his father, it was nothing but because of a promise he had made to his father. So when it became clear to Ibrahim that his father was an enemy of Allah, Abraham separated himself from him. Truly, Ibrahim was a very meek and forbearing man. (at-Taubah\/9: 114)."
		   },
		   {
			"id": 3019,
			"surah": 26,
			"ayat": 87,
			"tafsir": "Furthermore, Ibrahim prayed to Allah so that he would not experience humiliation on the Day of Judgment. This gives the impression of how humble a prophet is, even though he has obtained such a high degree in the sight of Allah, but he still begs not to be humiliated on the Day of Resurrection. Ibrahim complained to God saying, \"O God, didn't you promise that I would not be humiliated on the Day of Judgment. What humiliation would be heavier for me than the humiliation of meeting my father in this state?\" Allah responded to his prayer by saying, \"O Ibrahim, in fact I have forbidden paradise for the disbelievers.\""
		   },
		   {
			"id": 3020,
			"surah": 26,
			"ayat": 88,
			"tafsir": "This verse describes the greatness of the Day of Judgment. No one will be saved on that day from Allah's punishment, except for those who are free from sin and guilt. Wealth and descendants who have time in the world no one can help. Allah specifically mentions \"children\" in this verse, because children are the closest and most beneficial to their parents in the world. In another verse, Allah explains that children are the jewels of worldly life. On the other hand, good and pious deeds will be rewarded eternally until the end of the world. When Allah sent down the verse about gold and silver (surahh at-Taubah\/9: 34), the friends asked the Messenger of Allah about what treasures should be owned in order to bring benefits (for ukhrawi life). The Messenger of Allah replied: The best (wealth) is a tongue that always remembers Allah, a heart that is always grateful, and a pious wife helps her husband to remain faithful.\" (History of Ahmad and at-Tirmidhi from Sauban)"
		   },
		   {
			"id": 3021,
			"surah": 26,
			"ayat": 89,
			"tafsir": "This verse explains that the pleasure that will be obtained in the hereafter cannot be bought with a lot of wealth. It is also impossible to exchange with many children and descendants. Because each human being is only saved by charity and a clean heart. But the only people who are saved are those whose beliefs are clean from elements of polytheism and whose morals are noble."
		   },
		   {
			"id": 3022,
			"surah": 26,
			"ayat": 90,
			"tafsir": "Heaven is brought closer to those who are pious, so that it can be seen clearly. How heaven is brought closer, is explained in another verse: While heaven is brought closer to those who fear Allah in a place that is not far (from them). (Qaf\/50: 31) Bringing heaven closer to pious people will make them happy because the obedience they have done while in the world will soon bear fruit. They will enter soon."
		   },
		   {
			"id": 3023,
			"surah": 26,
			"ayat": 91,
			"tafsir": "Conversely, hell is also shown to people who go astray. They witnessed the awesomeness of the flames. In the Qur'an it is described that the flames of hell can already be heard from afar. That would be their abode, inescapably. That verse describes how quickly the torment came upon them. Indeed, they never imagined that while they were still in this world, because they did not care about Allah's punishment, as explained in this verse: And they were told, \"Today we forget you as you have forgotten your meeting (with) ; and your return home is hell, and there will be no helper for you (al-Jatsiyah\/45: 34)"
		   },
		   {
			"id": 3024,
			"surah": 26,
			"ayat": 92,
			"tafsir": "Then when facing hell that is ready to accept disbelievers and polytheists, questions are asked to ridicule them, \"Where are the idol gods that you worship now? Can they save you from the torment of Allah?\" Not only to save other people, but also to escape from them, the idol gods are not capable."
		   },
		   {
			"id": 3025,
			"surah": 26,
			"ayat": 93,
			"tafsir": "Then when facing hell that is ready to accept disbelievers and polytheists, questions are asked to ridicule them, \"Where are the idol gods that you worship now? Can they save you from the torment of Allah?\" Not only to save other people, but also to escape from them, the idol gods are not capable."
		   },
		   {
			"id": 3026,
			"surah": 26,
			"ayat": 94,
			"tafsir": "Then the people who went astray and had been appointed as the inhabitants of hell were overturned together with their leaders and the entire devil's army. The devil's army in this verse is intended to be people who like to follow immoral acts. Both those who follow or the leader who is followed are thrown into it."
		   },
		   {
			"id": 3027,
			"surah": 26,
			"ayat": 95,
			"tafsir": "Then the people who went astray and had been appointed as the inhabitants of hell were overturned together with their leaders and the entire devil's army. The devil's army in this verse is intended to be people who like to follow immoral acts. Both those who follow or the leader who is followed are thrown into it."
		   },
		   {
			"id": 3028,
			"surah": 26,
			"ayat": 96,
			"tafsir": "In hell, misleading leaders and their followers blame each other. They question each other who has brought them to commit crimes so that they go to hell."
		   },
		   {
			"id": 3029,
			"surah": 26,
			"ayat": 97,
			"tafsir": "After a fight, they both realize that there is no one to blame but themselves. They admit that their heresy is very severe, namely associating partners with Allah"
		   },
		   {
			"id": 3030,
			"surah": 26,
			"ayat": 98,
			"tafsir": "They really regretted why they considered the idol as powerful as Allah, so they worshiped it."
		   },
		   {
			"id": 3031,
			"surah": 26,
			"ayat": 99,
			"tafsir": "Apart from their own mistakes, they were also influenced by the evil solicitations of their leaders. These leaders always propagated doing various acts that violated religion so they followed suit. This is said again by Allah in another verse: And they said, \"O our Lord, indeed we have obeyed our leaders and princes, then they led us astray from the (right) path.\" (al-Ahzab\/33: 67) This verse very succinctly explains the regret of people who follow a leader without realizing where they are being led.So, we don't have to obey a leader if we believe that the leader actually leads to iniquity."
		   },
		   {
			"id": 3032,
			"surah": 26,
			"ayat": 100,
			"tafsir": "Those disbelievers and polytheists just realized that in this afterlife, no one else or angels will help them escape from Allah's punishment that is in sight. If, in the past, they believed and did good deeds, surely it would have interceded for them."
		   },
		   {
			"id": 3033,
			"surah": 26,
			"ayat": 101,
			"tafsir": "They also realize that close friends or family themselves will not be able to help. In another verse it is stated: So is there an intercessor for us who will give us help or so that we are returned (to the world) so that we will do charity unlike what we have done before? (al-A'raf\/7: 53)."
		   },
		   {
			"id": 3034,
			"surah": 26,
			"ayat": 102,
			"tafsir": "They hope to be returned to the world. If the wish is granted, they promise to believe and do good deeds. However, that is not possible. That's their only reason, because even if they were returned to the world, they would still deny it."
		   },
		   {
			"id": 3035,
			"surah": 26,
			"ayat": 103,
			"tafsir": "These are some of God's statements that Abraham conveyed to his people. With the arguments above, it is clear that the core of the teachings that he conveyed to his people were the understanding of monotheism and belief in the existence of the Day of Resurrection. There is no substance worthy of worship except Allah the Almighty. It's just that most people don't want to understand or don't want to accept that truth."
		   },
		   {
			"id": 3036,
			"surah": 26,
			"ayat": 104,
			"tafsir": "Allah, with His might and His Most Merciful nature, always reminds those who go astray and do not want to believe in His verses. Allah sent messengers to them in order to obtain guidance from Him. God sent the apostles with religious teachings and laws, so that they and their descendants could follow them."
		   },
		   {
			"id": 3037,
			"surah": 26,
			"ayat": 105,
			"tafsir": "These verses explain that Prophet Noah had been lied to by his people when he conveyed Allah's religion to them. Even though what they were denying was only the Prophet Noah himself, that action meant denying the other apostles of Allah, both those who were sent before and after the Prophet Noah later. This is because the treatises brought by the apostles are basically the same, namely the belief in monotheism. Prophet Noah was the third prophet sent by Allah, after Prophet Adam and Prophet Idris. Prophet Nuh was also the first messenger, based on a qudsi hadith: From Abu Hurairah ra that the Prophet said, \"Allah said, 'Yes Nuh, you are the first messenger who was sent to earth.\" (Muslim history from Abu Hurairah) The meaning of the first apostle here is Allah's apostle who was first sent after Prophet Adam and Prophet Idris. He is also called the second human father after Adam, because some commentators argue that all humans perished and died because of typhoons and floods, except for the people who were on the boat with Noah. Among the survivors, there were three sons, namely Sam, Ham and Yafits. So all humans that exist until now come from the descendants of the three sons of Prophet Noah. There is no definite information about the time gap between Adam and Idris with Noah. There are only a few discrepancies in the Ibriyah Taurah, the Samiriyah Taurah, and the Greek translation of the Torah. Prophet Noah was sent to his brothers, meaning people who are still considered relatives of Noah. In other surahhs it is stated that Noah was sent to his people. Noah's people worshiped statues and idols which they considered to be gods. Therefore, Prophet Noah reminded them to fear Allah and fear His terrible punishment. The punishment will be inflicted by Allah on those who deny the call of His prophet."
		   },
		   {
			"id": 3038,
			"surah": 26,
			"ayat": 106,
			"tafsir": "These verses explain that Prophet Noah had been lied to by his people when he conveyed Allah's religion to them. Even though what they were denying was only the Prophet Noah himself, that action meant denying the other apostles of Allah, both those who were sent before and after the Prophet Noah later. This is because the treatises brought by the apostles are basically the same, namely the belief in monotheism. Prophet Noah was the third prophet sent by Allah, after Prophet Adam and Prophet Idris. Prophet Nuh was also the first messenger, based on a qudsi hadith: From Abu Hurairah ra that the Prophet said, \"Allah said, 'Yes Nuh, you are the first messenger who was sent to earth.\" (Muslim history from Abu Hurairah) The meaning of the first apostle here is Allah's apostle who was first sent after Prophet Adam and Prophet Idris. He is also called the second human father after Adam, because some commentators argue that all humans perished and died because of typhoons and floods, except for the people who were on the boat with Noah. Among the survivors, there were three sons, namely Sam, Ham and Yafits. So all humans that exist until now come from the descendants of the three sons of Prophet Noah. There is no definite information about the time gap between Adam and Idris with Noah. There are only a few discrepancies in the Ibriyah Taurah, the Samiriyah Taurah, and the Greek translation of the Torah. Prophet Noah was sent to his brothers, meaning people who are still considered relatives of Noah. In other surahhs it is stated that Noah was sent to his people. Noah's people worshiped statues and idols which they considered to be gods. Therefore, Prophet Noah reminded them to fear Allah and fear His terrible punishment. The punishment will be inflicted by Allah on those who deny the call of His prophet."
		   },
		   {
			"id": 3039,
			"surah": 26,
			"ayat": 107,
			"tafsir": "Prophet Noah told his people that he was an apostle of Allah who was sent to them. He is trusted to convey Allah's commands and prohibitions, without adding or subtracting anything. In surahh Hud\/11: 31 it is explained that Prophet Noah did not have wealth to give to his people. Therefore, he could not promise them wealth and wealth. He also does not know the occult, never says that he is an angel, and does not promise pleasure and happiness to those who follow his calls. All of that only Allah knows, owns, and determines, because He is the Almighty. Noah was only in charge of delivering it."
		   },
		   {
			"id": 3040,
			"surah": 26,
			"ayat": 108,
			"tafsir": "This verse explains the contents of the message conveyed by Prophet Noah to his people, namely to fear Allah and worship only Him. In verse 3 of surahh Nuh it is stated that three things were commanded by Allah, namely to worship only Allah, fear Him, and obey Prophet Noah. In other verses it is explained that the treatise brought by Prophet Noah also mentions the following matters: 1. The good consequences that will be obtained by those who are pious. Allah will increase their sustenance, and send down rain. Then with that water, Allah fertilizes the earth, and makes plants grow. 2. Presenting evidence of the oneness and power of Allah, as well as explaining the evidence of the truth of the message he brought. Among them is about the creation of human beings in several processes of events starting from a drop of sperm to being born as a human. Allah creates the heavens and the earth, the moon shines and the sun shines, gives life and death to mankind, then all mankind will return to Him."
		   },
		   {
			"id": 3041,
			"surah": 26,
			"ayat": 109,
			"tafsir": "In this verse it is explained that in carrying out the task of conveying Allah's religion, Prophet Noah would not ask anyone for wages, and did not expect the slightest wealth, power and splendor. He seeks only the pleasure and reward of Allah."
		   },
		   {
			"id": 3042,
			"surah": 26,
			"ayat": 110,
			"tafsir": "In this verse, Prophet Noah repeats and reaffirms God's command that his people fear and obey Him. This repetition is to emphasize to his people that piety to Allah is a very important thing and must be done by every human being, as a sign of gratitude for the countless blessings that He has bestowed upon them. Piety is the source of all goodness and is the key to opening the gate of pleasure and happiness in the hereafter. Prophet Noah tried his best to convey his message by presenting Allah's promises and threats for those who did not follow the messenger's call. He also presented evidence of the truth of the treatise he brought to them. However, his people still do not accept it."
		   },
		   {
			"id": 3043,
			"surah": 26,
			"ayat": 111,
			"tafsir": "This verse explains the attitude of his people towards Noah's call. They said that there was no reason for them to follow Noah's call because none of the smart and intelligent among them were interested in the call let alone their leaders. Only people who are stupid and weak or people who want something who want to be followers of Prophet Noah. Allah said: So said the disbelieving leaders of their people, \"We did not see you, but only a human (ordinary) like us, and we did not see anyone who followed you, but those who were lowly among you who were quick to believe. We don't see that you have any advantage over us, we even think you are a liar.\" (Hud\/11:27)"
		   },
		   {
			"id": 3044,
			"surah": 26,
			"ayat": 112,
			"tafsir": "In this verse, Prophet Noah answered the objections of his people by saying that he did not know the true condition of those who followed his call. He was not commissioned by Allah to investigate their origins or their respective positions in society. He was only assigned to convey the religion of Allah to his people. If any of them believe, then he only looks at them according to their appearance, not according to their position in society, their skills and intelligence, and not according to their wealth and poverty."
		   },
		   {
			"id": 3045,
			"surah": 26,
			"ayat": 113,
			"tafsir": "Prophet Noah submitted an account of all the deeds done by his followers who have full faith in Allah, because He is the Knower of all things. It is He who has the authority to judge the deeds of His servants, and He is also the one who gives the reward. Good deeds are rewarded with multiple rewards, while bad deeds are rewarded with appropriate punishment. That's God's law. They should know the law of God."
		   },
		   {
			"id": 3046,
			"surah": 26,
			"ayat": 114,
			"tafsir": "Even though Prophet Noah had tried day and night to call on his people, they still ignored him. According to his people, believing in Noah meant humbling himself to join the lowly people. In fact, they forced Noah to immediately expel the believers from their land, so as not to humiliate the dignity and religion of their ancestors. Prophet Noah answered the request of his people by saying that he would not expel those who had believed, even if they were poor people, or came from a low class according to the views of his people. All of them in the sight of Allah are pious people. It is a person's faith and obedience that is used as a measure, whether he is a good and noble person or he is a lowly person."
		   },
		   {
			"id": 3047,
			"surah": 26,
			"ayat": 115,
			"tafsir": "Furthermore Noah told his people that he was just an apostle sent by God to them to convey His religion. He also conveyed warnings and threats that Allah's punishment would befall those who disobeyed and disobedient, as well as those who denied the messenger's call. Meanwhile, those who follow the messenger's call, and heed the words and threats, whether rich or poor, nobles or ordinary people, will be rewarded by God with a paradise full of pleasures."
		   },
		   {
			"id": 3048,
			"surah": 26,
			"ayat": 116,
			"tafsir": "Thus Prophet Noah carried out his duties as an apostle of Allah. He tried his best to convey God's call, day and night, both secretly and openly. The more active Prophet Noah called them, the stronger the obstacles and obstacles that his people gave him. Their attitude is described in the word of Allah: And indeed, every time I call on them (to believe) that You forgive them, they stick their fingers in their ears and cover their clothes (over their faces) and they remain (deny) and are very arrogant. (Noah\/71: 7). Finally they threatened Prophet Noah to immediately stop his efforts to get them to follow the religion he preached. If he still continues his efforts and does not stop them, they will stone and destroy Noah."
		   },
		   {
			"id": 3049,
			"surah": 26,
			"ayat": 117,
			"tafsir": "Receiving such threats, Prophet Noah could do nothing but complain to Allah that his people had belied him. He hoped that by praying he would get help from God."
		   },
		   {
			"id": 3050,
			"surah": 26,
			"ayat": 118,
			"tafsir": "Furthermore, Prophet Noah prayed that Allah would give a fair decision regarding the problems that occurred between him and his people. He had mobilized all his strength and ability to lead them to the right path, but their welcome was in the form of threats to injure him. Prophet Noah was sure that the threat was not a joke. Therefore, Prophet Noah really prayed that he and his followers would be saved by Allah from this threat."
		   },
		   {
			"id": 3051,
			"surah": 26,
			"ayat": 119,
			"tafsir": "Allah granted Noah's prayer and ordered him and the believers to build a large ship that could transport them all, along with their necessities and equipment. Prophet Noah and his followers began to build ships. His people were astonished and amazed to see what he was doing. They didn't know what Noah was doing. His people considered Noah and the believers, especially those who helped build the ship, to have gone mad. Everyone who passed near Prophet Noah made the ship mock and ridicule his deeds. Allah's command for Noah to build a ship and the attitude of Noah's people is explained in His words: \"And build the ship under the supervision and guidance of Our revelation, and do not talk to Me about the wrongdoers. In fact, they will be drowned. \" And he (Noah) began to build ships. Every time the leader of his people walked past him, they jeered at him. He (Noah) said, \"If you ridicule us, then we (also) will ridicule you as you ridicule (us). Then later you will know who will be overwritten by a humiliating punishment and (who) will be overwritten by eternal punishment.\" (Hud\/11: 37-39). The ridicule was answered by Prophet Noah by reminding them of Allah's punishment that will befall on unbelievers who do not heed the call of His messenger. If they always behave like that, then the doom will come soon. At the time of receiving the doom and calamity, they will regret it forever. However, regret is of no use anymore because all the doors of repentance have been closed for them. Allah reminded Prophet Noah not to serve these wrongdoers anymore, because their faith could no longer be relied upon, and it was Allah's decree to destroy them. Prophet Noah and those who believed with him had tried earnestly to carry out God's command to build the ship. After it was finished, came the moments promised by Allah, namely destroying the disbelievers and saving the believers. At that moment, the earth emitted water from all around and overflowed, like the overflow of water boiling in a cooking cauldron. In a short time, the water has submerged the earth's surface. At that time, Allah ordered Prophet Noah to order the believers to board the ship with the necessary equipment. Allah also ordered them to bring their pets, a male and a female each, so they could breed later after the typhoons and floods stopped. According to some commentators, the only family of Noah who joined the ship was a believing wife and three sons, namely Sam, Ham and Yafits. Thus Prophet Noah began to sail by mentioning the name of Allah, wading through floods like the sea, crossing waves that towered like mountains."
		   },
		   {
			"id": 3052,
			"surah": 26,
			"ayat": 120,
			"tafsir": "In the Qur'an it is described how big the wave was and how Prophet Noah tried to save his infidel son. He called him to board the ship with the believers. However, he ignored the invitation so that the son of Noah drowned with the other unbelievers. The story is mentioned in the word of God: And the ship sailed and carried them into the waves like the mountains. And Noah called his son, when he (the child) was in a remote place, \"O my son! Get on (to the ship) with us and do not be with the disbelievers.\" He (his son) replied, \"I will seek refuge in a mountain that can save me from the flood!\" (Nuh) said, \"There is nothing that protects from Allah's torment today except Allah, the Most Merciful.\" And the waves become a barrier between the two; then he (the child) is one of those who drowned. (Hud\/11: 42-43). Prophet Noah's ship sailed in a direction unknown to its passengers. Only Allah knows its purpose. At God's appointed time, the typhoon stopped and the flood receded, as if the water had been swallowed up by the earth. Prophet Noah's ship was stranded on a hilltop called Judi. Most commentators are of the opinion that Mount Judi is located in Southern Armenia which borders Mesopotamia which is famous for Mount Arafat. With the end of the typhoon and the great flood, and the anchoring of Noah's ship safely on Mount Judi, it means that Allah has kept His promise. He saved the believers, who followed Noah's call, and destroyed the disbelievers, who ignored his call. After the ship was anchored, Prophet Noah remembered his son who had drowned. He asked for safety for his son because he was part of his family. However, Allah reminded Prophet Noah that his son was no longer his family because he had become an infidel. Allah said: And Noah begged his Lord, saying, \"O my Lord, indeed my child is one of my family, and Your promise must be true. You are the most just judge.\" He (Allah) said, \"O Nuh! Indeed he is not one of your family, because his actions are really not good, therefore do not ask Me for something that you do not know (the essence). I advise you so that (you) are not among the ignorant.\" .\" (Hud\/11: 45-46). Those who believed with Prophet Noah who survived the typhoon and flood then multiplied, up to today's humans. Among them there are believers and some are unbelievers. There are those who are punished in this world so that they perish, and some are saved. Some are happy and some are miserable, some are rich and some are poor. Allah said: It was said, \"O Nuh! Come down safely and full of blessings from Us, for you and for all the people (believers) who are with you. And there are people whom We give pleasure (in the life of the world), then they will be punished We are sore.\" (Hud\/11: 48)."
		   },
		   {
			"id": 3053,
			"surah": 26,
			"ayat": 121,
			"tafsir": "After explaining the story of Prophet Noah and his people, the destruction that was experienced by those who denied the messenger's call and the victory that was obtained by those who believed, Allah then directed His words to the Prophet Muhammad and the Muslims. Allah reminds that the events above should be an example or a lesson. Mankind should believe in Prophet Muhammad and accept his call. If they deny it, then the same thing can happen to them. Allah is able to carry out His threat if He wills. However, Allah still gives opportunities to mankind, because He is Most Gracious and Most Merciful."
		   },
		   {
			"id": 3054,
			"surah": 26,
			"ayat": 122,
			"tafsir": "After explaining the story of Prophet Noah and his people, the destruction that was experienced by those who denied the messenger's call and the victory that was obtained by those who believed, Allah then directed His words to the Prophet Muhammad and the Muslims. Allah reminds that the events above should be an example or a lesson. Mankind should believe in Prophet Muhammad and accept his call. If they deny it, then the same thing can happen to them. Allah is able to carry out His threat if He wills. However, Allah still gives opportunities to mankind, because He is Most Gracious and Most Merciful."
		   },
		   {
			"id": 3055,
			"surah": 26,
			"ayat": 123,
			"tafsir": "This verse explains that Allah sent Prophet Hud as to the people of 'Ad but they denied and denied his call. 'Ad is the name of a people, taken from the name of their ancestor named 'ad. 'ad was one of the descendants of Sam bin Nuh. The Prophet Hud himself was one of the descendants of 'ad, namely Hud bin Abdullah bin Rabah bin Khulud bin 'ad. That is why in this verse the Prophet Hud is called the brother of the 'ad people, which means that the Prophet Hud was one of the members of the 'ad people. The 'ad lived in al-Ahqaf, which is now known as Sahara al-Ahqaf. Now this area is one part of the southern kingdom of Saudi Arabia. Al-Ahqaf is located north of Hadramaut, northeast of Yemen, south of Nejed and west of Oman. Now the place is also named ar-Rab' al-Khali which means \"empty place\" because it is indeed an empty place, not inhabited by people. On maps it is usually written Rub' al-Khali, that's wrong, the correct one is Rab' not Rub'. The 'ad originally believed in monotheism, the religion their ancestors had followed and which was in accordance with human nature. However, after their empire expanded and grew due to the conquest of other nations around it, they became arrogant and worshiped images. The statues that are worshiped are statues of their leaders, which were originally made only to honor and remember their services. However, over time they worshiped the statue. There are three statues that they worship, namely Saba', Samud, and Haba. To return them to the true religion, Allah sent an apostle to them, namely Prophet Hud, who was also one of their citizens."
		   },
		   {
			"id": 3056,
			"surah": 26,
			"ayat": 124,
			"tafsir": "This verse explains that Allah sent Prophet Hud as to the people of 'Ad but they denied and denied his call. 'Ad is the name of a people, taken from the name of their ancestor named 'ad. 'ad was one of the descendants of Sam bin Nuh. The Prophet Hud himself was one of the descendants of 'ad, namely Hud bin Abdullah bin Rabah bin Khulud bin 'ad. That is why in this verse the Prophet Hud is called the brother of the 'ad people, which means that the Prophet Hud was one of the members of the 'ad people. The 'ad lived in al-Ahqaf, which is now known as Sahara al-Ahqaf. Now this area is one part of the southern kingdom of Saudi Arabia. Al-Ahqaf is located north of Hadramaut, northeast of Yemen, south of Nejed and west of Oman. Now the place is also named ar-Rab' al-Khali which means \"empty place\" because it is indeed an empty place, not inhabited by people. On maps it is usually written Rub' al-Khali, that's wrong, the correct one is Rab' not Rub'. The 'ad originally believed in monotheism, the religion their ancestors had followed and which was in accordance with human nature. However, after their empire expanded and grew due to the conquest of other nations around it, they became arrogant and worshiped images. The statues that are worshiped are statues of their leaders, which were originally made only to honor and remember their services. However, over time they worshiped the statue. There are three statues that they worship, namely Saba', Samud, and Haba. To return them to the true religion, Allah sent an apostle to them, namely Prophet Hud, who was also one of their citizens."
		   },
		   {
			"id": 3057,
			"surah": 26,
			"ayat": 125,
			"tafsir": "The Prophet Hud called on them to worship Allah and fear Him, and carry out His commands and stay away from His prohibitions. In surahh Hud\/11: 50-54 it is explained that the Prophet Hud asked his people to worship Allah and not worship statues, because there is no god but Allah. This means that nothing creates, provides sustenance, gives life and death, has power, raises from the grave and has divine attributes, except Allah. The worship of these statues is an act that they invented themselves, not based on information from the scriptures and the slightest concrete evidence. Hud also stated that he was the true apostle of Allah. Everything he said came from God. The Prophet Hud explained that he did not expect a reward in his work calling people to the monotheistic religion. His reward is solely from Allah, namely the reward he hopes for later in the hereafter. Prophet Hud called on his people to seek forgiveness and repent to Allah. If they do so, Allah will forgive their sins, send down rain that will make their land more fertile, and increase their sustenance. In addition, Allah will make them stronger, both physically and in power. Prophet Hud reminded them to stop their sinful acts and seek God's forgiveness. And (Hud said), \"O my people! Ask forgiveness from your Lord and then repent to Him, He will surely send down very heavy rain, He will add strength to your strength, and do not turn to be sinners.\" (Hud\/11: 52). The 'ad did not heed the Prophet Hud's call, they even stated that the Prophet Hud did not bring any truth in his preaching. They emphasized that they would not leave idol worship, and did not believe the Prophet Hud's call. Allah said: They (the 'Ad) said, \"O Hud! You have not brought us any clear evidence, and we will not abandon our worship because of your words and we will not believe you. (Hud\/11: 53). They accused that the Prophet Hud had been seized with insanity by their statues. Allah said: We only say that some of our worshipers have afflicted you with insanity.\" (Hud\/11: 54)."
		   },
		   {
			"id": 3058,
			"surah": 26,
			"ayat": 126,
			"tafsir": "The Prophet Hud called on them to worship Allah and fear Him, and carry out His commands and stay away from His prohibitions. In surahh Hud\/11: 50-54 it is explained that the Prophet Hud asked his people to worship Allah and not worship statues, because there is no god but Allah. This means that nothing creates, provides sustenance, gives life and death, has power, raises from the grave and has divine attributes, except Allah. The worship of these statues is an act that they invented themselves, not based on information from the scriptures and the slightest concrete evidence. Hud also stated that he was the true apostle of Allah. Everything he said came from God. The Prophet Hud explained that he did not expect a reward in his work calling people to the monotheistic religion. His reward is solely from Allah, namely the reward he hopes for later in the hereafter. Prophet Hud called on his people to seek forgiveness and repent to Allah. If they do so, Allah will forgive their sins, send down rain that will make their land more fertile, and increase their sustenance. In addition, Allah will make them stronger, both physically and in power. Prophet Hud reminded them to stop their sinful acts and seek God's forgiveness. And (Hud said), \"O my people! Ask forgiveness from your Lord and then repent to Him, He will surely send down very heavy rain, He will add strength to your strength, and do not turn to be sinners.\" (Hud\/11: 52). The 'ad did not heed the Prophet Hud's call, they even stated that the Prophet Hud did not bring any truth in his preaching. They emphasized that they would not leave idol worship, and did not believe the Prophet Hud's call. Allah said: They (the 'Ad) said, \"O Hud! You have not brought us any clear evidence, and we will not abandon our worship because of your words and we will not believe you. (Hud\/11: 53). They accused that the Prophet Hud had been seized with insanity by their statues. Allah said: We only say that some of our worshipers have afflicted you with insanity.\" (Hud\/11: 54)."
		   },
		   {
			"id": 3059,
			"surah": 26,
			"ayat": 127,
			"tafsir": "The Prophet Hud called on them to worship Allah and fear Him, and carry out His commands and stay away from His prohibitions. In surahh Hud\/11: 50-54 it is explained that the Prophet Hud asked his people to worship Allah and not worship statues, because there is no god but Allah. This means that nothing creates, provides sustenance, gives life and death, has power, raises from the grave and has divine attributes, except Allah. The worship of these statues is an act that they invented themselves, not based on information from the scriptures and the slightest concrete evidence. Hud also stated that he was the true apostle of Allah. Everything he said came from God. The Prophet Hud explained that he did not expect a reward in his work calling people to the monotheistic religion. His reward is solely from Allah, namely the reward he hopes for later in the hereafter. Prophet Hud called on his people to seek forgiveness and repent to Allah. If they do so, Allah will forgive their sins, send down rain that will make their land more fertile, and increase their sustenance. In addition, Allah will make them stronger, both physically and in power. Prophet Hud reminded them to stop their sinful acts and seek God's forgiveness. And (Hud said), \"O my people! Ask forgiveness from your Lord and then repent to Him, He will surely send down very heavy rain, He will add strength to your strength, and do not turn to be sinners.\" (Hud\/11: 52). The 'ad did not heed the Prophet Hud's call, they even stated that the Prophet Hud did not bring any truth in his preaching. They emphasized that they would not leave idol worship, and did not believe the Prophet Hud's call. Allah said: They (the 'Ad) said, \"O Hud! You have not brought us any clear evidence, and we will not abandon our worship because of your words and we will not believe you. (Hud\/11: 53). They accused that the Prophet Hud had been seized with insanity by their statues. Allah said: We only say that some of our worshipers have afflicted you with insanity.\" (Hud\/11: 54)."
		   },
		   {
			"id": 3060,
			"surah": 26,
			"ayat": 128,
			"tafsir": "Hud questioned the custom of his people to build buildings on hilltops or in every street solely to display their greatness, grandeur, and wealth. Why don't they build it based on benefits and other positive goals. The 'ad indeed has had a high civilization according to the size of his era. They have been able to establish a strong country, areas and cities that are orderly, along with magnificent buildings. The construction was not for a good cause, but solely to show their wealth. There is no historian who can confirm the heyday of the 'ad' kingdom. Some estimate that the kingdom of the 'ad was as old as the Babylonian empire, which is about 2000 years before Christ. However, this is not in accordance with reality because the Prophet Hud was sent to the ad people before the Prophet Abraham was sent to Babylon, namely during the time of Nebuchadnezzar."
		   },
		   {
			"id": 3061,
			"surah": 26,
			"ayat": 129,
			"tafsir": "This verse explains Hud's warning to his people who build palaces and strong fortresses with the intention of wanting to live forever in this world, when in fact only Allah is Almighty. History proves that 'ad was able to build companies, dig for metals in the earth, and make canals for regular irrigation. With regular irrigation, their land becomes fertile so that their prosperity increases. They built the city of Iram with tall and majestic pillars as the capital of their kingdom. Its founder was named Shaddad bin 'ad, one of their kings. Around this city, they built strong fortifications to defend it from enemy attacks. The prosperity and power that they have makes them arrogant and arrogant. They think that their condition will last forever. They disobeyed Allah by worshiping idols and doing whatever they wanted. Allah said: So as for the people of 'Ad, they were arrogant on earth without (paying heed to) the truth and they said, \"Who is more powerful than us?\" Do they not see that it is Allah who created them. He is greater in strength than them? And they have denied Our signs. (Fussilat\/41: 15)."
		   },
		   {
			"id": 3062,
			"surah": 26,
			"ayat": 130,
			"tafsir": "This verse describes the behavior of the ad people who are rude and cruel. When torturing enemies, they do it cruelly without the slightest sense of mercy. They are endowed with a strong, tall, and mighty body. Their dispositions also match those of that mighty body. With their existing strength, they attacked other countries until they reached Syria and Iraq. In war, they crack down on and treat their enemies cruelly."
		   },
		   {
			"id": 3063,
			"surah": 26,
			"ayat": 131,
			"tafsir": "Seeing this attitude, Prophet Hud reminded them to be pious and to serve Allah. Prophet Hud reminded them of the blessings that Allah had bestowed upon them. Therefore, let them be grateful for that blessing so that Allah will add more favors to them and have a higher value."
		   },
		   {
			"id": 3064,
			"surah": 26,
			"ayat": 132,
			"tafsir": "Seeing this attitude, Prophet Hud reminded them to be pious and to serve Allah. Prophet Hud reminded them of the blessings that Allah had bestowed upon them. Therefore, let them be grateful for that blessing so that Allah will add more favors to them and have a higher value."
		   },
		   {
			"id": 3065,
			"surah": 26,
			"ayat": 133,
			"tafsir": "Among the blessings bestowed by Allah on the people of 'Ad are livestock that they can use, and offspring that can continue the generations and continue their ideals. They are also blessed with beautiful gardens, where plants are very useful for them. Likewise the water that can irrigate the earth as a result of the irrigation that they have made all with God's help."
		   },
		   {
			"id": 3066,
			"surah": 26,
			"ayat": 134,
			"tafsir": "Among the blessings bestowed by Allah on the people of 'Ad are livestock that they can use, and offspring that can continue the generations and continue their ideals. They are also blessed with beautiful gardens, where plants are very useful for them. Likewise the water that can irrigate the earth as a result of the irrigation that they have made all with God's help."
		   },
		   {
			"id": 3067,
			"surah": 26,
			"ayat": 135,
			"tafsir": "Prophet Hud told them that all that was obtained was a blessing from Allah. He is worried that the countless blessings that they have obtained will be revoked or terminated, as a punishment from Allah for their denial and arrogance. Are they not afraid that something like this will happen? According to the Sunnah of Allah, He will increase the favors of those who are grateful for His blessings and will punish those who deny them."
		   },
		   {
			"id": 3068,
			"surah": 26,
			"ayat": 136,
			"tafsir": "This verse explains that the 'ad people still did not heed the Prophet Hud's call, they even said, \"In our opinion it is the same whether you give a warning or not, we remain in our position. We no longer want to hear your words, and will not back down a bit from our point of view.\""
		   },
		   {
			"id": 3069,
			"surah": 26,
			"ayat": 137,
			"tafsir": "Furthermore, they said that the religion they professed was the religion of their ancestors which had been passed down to them. They believe they will not be punished for following the religion of their ancestors. In another verse it is explained that Hud challenged his people who were increasingly dissenting by urging them to make efforts to kill him together. Hud also told them to include the gods they worshiped, if they really believed in the ability of those gods to do anything they wanted. It was as if Hud was saying to them, \"Join all of you with the gods that you worship to kill me, and carry out the killing right now, don't postpone it any longer. I'm not the least bit afraid of being killed because I put my trust in Allah, my God and your God who actually. Whatever creatures that exist on this earth are always guarded, cared for, and controlled by Allah and His words are always true and straight.\" The challenge Hud put forward to his people was proof that he was an apostle sent by Allah. Had he not been an apostle, he would not have dared to make such a challenge to his people who were stronger in body and more cruel in nature."
		   },
		   {
			"id": 3070,
			"surah": 26,
			"ayat": 138,
			"tafsir": "Furthermore, they said that the religion they professed was the religion of their ancestors which had been passed down to them. They believe they will not be punished for following the religion of their ancestors. In another verse it is explained that Hud challenged his people who were increasingly dissenting by urging them to make efforts to kill him together. Hud also told them to include the gods they worshiped, if they really believed in the ability of those gods to do anything they wanted. It was as if Hud was saying to them, \"Join all of you with the gods that you worship to kill me, and carry out the killing right now, don't postpone it any longer. I'm not the least bit afraid of being killed because I put my trust in Allah, my God and your God who actually. Whatever creatures that exist on this earth are always guarded, cared for, and controlled by Allah and His words are always true and straight.\" The challenge Hud put forward to his people was proof that he was an apostle sent by Allah. Had he not been an apostle, he would not have dared to make such a challenge to his people who were stronger in body and more cruel in nature."
		   },
		   {
			"id": 3071,
			"surah": 26,
			"ayat": 139,
			"tafsir": "This verse explains that the people of 'ad remained disobedient and did not heed the Prophet Hud's call. In another of his words, Prophet Hud threatened his people by saying that if they persisted in their denial, they would be destroyed by Allah and replace them with other people, who would rule and become the forerunners of future generations. While they will not be able to bring the slightest harm to Allah. Allah said: So if you turn away, then indeed, I have conveyed to you what is my duty as an apostle to you. And my Lord will replace you with another people, while you cannot bring Him the slightest harm. Verily, my Lord is the Sustainer of all things.\" (Hud\/11: 57). Among these 'ad there were those who believed in Prophet Hud, but most of them remained in denial. These 'ad who did not believe were destroyed by Allah by bringing a wind that was very cold, until they died lying in bed, their cities and countries collapsed and were buried in the ground, as Allah said: As for the people of 'ad, they were destroyed by a very cold typhoon, Allah caused the wind to fall on them for seven nights and eight days continuously, then you saw the people of 'ad at that time dead lying like empty (rotted) palm tree trunks. So did you see anyone who was still left among them? (Al-haqqah\/69: 6- 8). The people who do not believe and are destroyed by Allah are called 'd al-la ('ad the first). As for those who believe and are saved by Allah together with Prophet Hud are called 'ad ats-saniyah ('ad second). Among those who believed there were those who moved with the Prophet Hud to the south, namely Hadramaut. Until now in that area there is still a city called Medina Qabri Hud, which is located east of the city of Tariem, one of the largest cities in the Hadramaut. In Medina Qabri Hud there is a grave named Qabri Hud, which is enshrined until now, to be proof of the truth of the story of Hud mentioned in the Qur'an. Even though the land of the 'ad people was buried under the ground as a result of Allah's punishment, there are still signs that the place was once inhabited by highly cultured humans. In the Al-Qur'an there are many verses that instruct people to travel the earth to pay attention to the former settlements of people who have been destroyed by Allah, among them the Hud, to serve as a lesson. In the 20th century there came expeditions led by Western scholars, among them led by H. St. John Philby, who was able to organize an expedition to ar-Rub' al-Khali with the permission of the King of Saudi Arabia, Abdul Aziz Alu Su'ud. He wrote a book called The Heart of Arabia. A Dutch scholar, Van der Mulen, also led an expedition around ar-Rab' al-Khali, and wrote a book called Hadramaut. The story of Prophet Hud and his people is only mentioned in the Qur'an, not found in other Divine books. In the story of the Hud people there is a lesson for Muslims, because those who were destroyed were those who did not believe."
		   },
		   {
			"id": 3072,
			"surah": 26,
			"ayat": 140,
			"tafsir": "Allah explains in this verse that the God Muhammad is the Almighty God in taking vengeance from the disobedient, and His mercy is bestowed on His believing servants."
		   },
		   {
			"id": 3073,
			"surah": 26,
			"ayat": 141,
			"tafsir": "This verse explains that the Samud people have denied the apostle sent to them, namely Prophet Saleh (al-A'raf\/7: 73-79). Prophet Saleh was one of the descendants of a man named samud. In other words, Prophet Saleh and the Samud people both came from Samud descent. According to one history, Samud is 'ad's biological son, while according to another history, Samud is 'ad's cousin. Even though there are such differences, it can be determined that between the Samud and the 'ad people still have a close relationship. samud was the son of Aus bin Aram bin Sam bin Nuh. The Samud live in the city of hijr (Mada'in salih) up to Wadil Qura, which is a place located between Hejaz and Syam, in the southeast of Madyan country. Their legacy is still present in this area, which in general can show how their power used to be and how much prosperity they have achieved. The period of their lives after the period of the 'ad people and the sending of Prophet Saleh to the Samud people was before the sending of Prophet Ibrahim to the Babylonians (see Samud vocabulary in this Tafsir)."
		   },
		   {
			"id": 3074,
			"surah": 26,
			"ayat": 142,
			"tafsir": "Nabi Saleh called on the Samud people to return to the religion of monotheism and fear of Allah. At first they believed in Allah, then became disbelievers and worshiped the idols they had associated with Him. To return them to the monotheistic religion, Allah sent Prophet Saleh to them. Prophet Saleh called on his people to fear Allah, carry out orders and leave His prohibitions, and acknowledge that Prophet Saleh was a messenger sent by Allah to them. In surahh Hud it is explained that Prophet Saleh called on his people to believe in the monotheistic religion. The point of his preaching is to worship Allah in the sense that only Allah must be worshiped, not the statues they make. To strengthen his preaching, Prophet Saleh stated that there is no god but Allah who created them, provided sustenance, gave life and death, and made them merchants, shepherds, businessmen, and prospers of the earth, as Allah said: And to the Samud (We sent ) their brother, Saleh. He said, \"O my people! Worship Allah, there is no god for you but Him. He has created you from the earth (soil) and made you prosperous, therefore ask forgiveness from Him, then repent to Him. Indeed, my Lord is very near (mercy) Him) and allow (the prayer of His servant)\". (Hud\/11: 61). Prophet Saleh explained the reason, namely that Allah had created them from the earth, namely from the ground. This is something real to them, they can't deny it. Prophet Saleh also said that Allah had made them the prosperity of the earth. This is a reality for them too. They have indeed prospered the earth by utilizing water sources, building irrigation which functions to regulate the distribution of water, until their land becomes fertile, their crops grow and bear fruit, and their livestock live well. They have also removed metals from the soil that are beneficial to companies and commerce. In this way, they have cultivated and prospered the earth, and this is something they actually live out every day. Nabi Saleh explained that he would not ask them for any wages. He only expects a reward from Allah who sent him."
		   },
		   {
			"id": 3075,
			"surah": 26,
			"ayat": 143,
			"tafsir": "Nabi Saleh called on the Samud people to return to the religion of monotheism and fear of Allah. At first they believed in Allah, then became disbelievers and worshiped the idols they had associated with Him. To return them to the monotheistic religion, Allah sent Prophet Saleh to them. Prophet Saleh called on his people to fear Allah, carry out orders and leave His prohibitions, and acknowledge that Prophet Saleh was a messenger sent by Allah to them. In surahh Hud it is explained that Prophet Saleh called on his people to believe in the monotheistic religion. The point of his preaching is to worship Allah in the sense that only Allah must be worshiped, not the statues they make. To strengthen his preaching, Prophet Saleh stated that there is no god but Allah who created them, provided sustenance, gave life and death, and made them merchants, shepherds, businessmen, and prospers of the earth, as Allah said: And to the Samud (We sent ) their brother, Saleh. He said, \"O my people! Worship Allah, there is no god for you but Him. He has created you from the earth (soil) and made you prosperous, therefore ask forgiveness from Him, then repent to Him. Indeed, my Lord is very near (mercy) Him) and allow (the prayer of His servant)\". (Hud\/11: 61). Prophet Saleh explained the reason, namely that Allah had created them from the earth, namely from the ground. This is something real to them, they can't deny it. Prophet Saleh also said that Allah had made them the prosperity of the earth. This is a reality for them too. They have indeed prospered the earth by utilizing water sources, building irrigation which functions to regulate the distribution of water, until their land becomes fertile, their crops grow and bear fruit, and their livestock live well. They have also removed metals from the soil that are beneficial to companies and commerce. In this way, they have cultivated and prospered the earth, and this is something they actually live out every day. Nabi Saleh explained that he would not ask them for any wages. He only expects a reward from Allah who sent him."
		   },
		   {
			"id": 3076,
			"surah": 26,
			"ayat": 144,
			"tafsir": "Nabi Saleh called on the Samud people to return to the religion of monotheism and fear of Allah. At first they believed in Allah, then became disbelievers and worshiped the idols they had associated with Him. To return them to the monotheistic religion, Allah sent Prophet Saleh to them. Prophet Saleh called on his people to fear Allah, carry out orders and leave His prohibitions, and acknowledge that Prophet Saleh was a messenger sent by Allah to them. In surahh Hud it is explained that Prophet Saleh called on his people to believe in the monotheistic religion. The point of his preaching is to worship Allah in the sense that only Allah must be worshiped, not the statues they make. To strengthen his preaching, Prophet Saleh stated that there is no god but Allah who created them, provided sustenance, gave life and death, and made them merchants, shepherds, businessmen, and prospers of the earth, as Allah said: And to the Samud (We sent ) their brother, Saleh. He said, \"O my people! Worship Allah, there is no god for you but Him. He has created you from the earth (soil) and made you prosperous, therefore ask forgiveness from Him, then repent to Him. Indeed, my Lord is very near (mercy) Him) and allow (the prayer of His servant)\". (Hud\/11: 61). Prophet Saleh explained the reason, namely that Allah had created them from the earth, namely from the ground. This is something real to them, they can't deny it. Prophet Saleh also said that Allah had made them the prosperity of the earth. This is a reality for them too. They have indeed prospered the earth by utilizing water sources, building irrigation which functions to regulate the distribution of water, until their land becomes fertile, their crops grow and bear fruit, and their livestock live well. They have also removed metals from the soil that are beneficial to companies and commerce. In this way, they have cultivated and prospered the earth, and this is something they actually live out every day. Nabi Saleh explained that he would not ask them for any wages. He only expects a reward from Allah who sent him."
		   },
		   {
			"id": 3077,
			"surah": 26,
			"ayat": 145,
			"tafsir": "Nabi Saleh called on the Samud people to return to the religion of monotheism and fear of Allah. At first they believed in Allah, then became disbelievers and worshiped the idols they had associated with Him. To return them to the monotheistic religion, Allah sent Prophet Saleh to them. Prophet Saleh called on his people to fear Allah, carry out orders and leave His prohibitions, and acknowledge that Prophet Saleh was a messenger sent by Allah to them. In surahh Hud it is explained that Prophet Saleh called on his people to believe in the monotheistic religion. The point of his preaching is to worship Allah in the sense that only Allah must be worshiped, not the statues they make. To strengthen his preaching, Prophet Saleh stated that there is no god but Allah who created them, provided sustenance, gave life and death, and made them merchants, shepherds, businessmen, and prospers of the earth, as Allah said: And to the Samud (We sent ) their brother, Saleh. He said, \"O my people! Worship Allah, there is no god for you but Him. He has created you from the earth (soil) and made you prosperous, therefore ask forgiveness from Him, then repent to Him. Indeed, my Lord is very near (mercy) Him) and allow (the prayer of His servant)\". (Hud\/11: 61). Prophet Saleh explained the reason, namely that Allah had created them from the earth, namely from the ground. This is something real to them, they can't deny it. Prophet Saleh also said that Allah had made them the prosperity of the earth. This is a reality for them too. They have indeed prospered the earth by utilizing water sources, building irrigation which functions to regulate the distribution of water, until their land becomes fertile, their crops grow and bear fruit, and their livestock live well. They have also removed metals from the soil that are beneficial to companies and commerce. In this way, they have cultivated and prospered the earth, and this is something they actually live out every day. Nabi Saleh explained that he would not ask them for any wages. He only expects a reward from Allah who sent him."
		   },
		   {
			"id": 3078,
			"surah": 26,
			"ayat": 146,
			"tafsir": "Prophet Saleh reminded them of God's blessings that had been bestowed on them, namely: 1. They lived safely in their country, free from enemy disturbances, and obtained happiness and peace in life. 2. They have fertile agricultural land, many livestock, and have water sources that can be used to make regular irrigation canals. They live as farmers, herders, traders, and metal diggers from the ground. Therefore, their land becomes beautiful, filled with plants that delight the eyes of those who look at it. Some of them even say that their country is actually the paradise that God promised. 3. They were given the ability to carve a rocky mountain to be used as a place to live. Those are the various favors of Allah that have been bestowed on the Samud people. They should be grateful for the blessings that God has given them, but they are getting more arrogant day by day. They feel that happiness and enjoyment is only because of their own efforts, not because of God's grace. Therefore, they do not believe in the Last Day. The real life according to them is to live in this world and they want to be eternal in this world. The Samud people no longer think about what their fate will be, if at one time, Allah suddenly takes away all their happiness and prosperity and exchanges it for a terrible calamity. All that could be done by God because of their own denial and arrogance. This verse implies how with the provision of a strong mind, humans can carve mountain rocks to be used as dwellings, as was done by the Samud people. At this time, the technology of sculpting tools has developed and is used by humans to meet their needs, among others, to cut and split hard mountain rocks. These tools are fully powered by machines or robots. Even humans have been able to create super-advanced sculpting technologies where objects are cut or split with a laser beam. The result is very smooth and precise. With this latest tool, even very hard granite rocks are easy to split or cut. That is the product of the human mind."
		   },
		   {
			"id": 3079,
			"surah": 26,
			"ayat": 147,
			"tafsir": "Prophet Saleh reminded them of God's blessings that had been bestowed on them, namely: 1. They lived safely in their country, free from enemy disturbances, and obtained happiness and peace in life. 2. They have fertile agricultural land, many livestock, and have water sources that can be used to make regular irrigation canals. They live as farmers, herders, traders, and metal diggers from the ground. Therefore, their land becomes beautiful, filled with plants that delight the eyes of those who look at it. Some of them even say that their country is actually the paradise that God promised. 3. They were given the ability to carve a rocky mountain to be used as a place to live. Those are the various favors of Allah that have been bestowed on the Samud people. They should be grateful for the blessings that God has given them, but they are getting more arrogant day by day. They feel that happiness and enjoyment is only because of their own efforts, not because of God's grace. Therefore, they do not believe in the Last Day. The real life according to them is to live in this world and they want to be eternal in this world. The Samud people no longer think about what their fate will be, if at one time, Allah suddenly takes away all their happiness and prosperity and exchanges it for a terrible calamity. All that could be done by God because of their own denial and arrogance. This verse implies how with the provision of a strong mind, humans can carve mountain rocks to be used as dwellings, as was done by the Samud people. At this time, the technology of sculpting tools has developed and is used by humans to meet their needs, among others, to cut and split hard mountain rocks. These tools are fully powered by machines or robots. Even humans have been able to create super-advanced sculpting technologies where objects are cut or split with a laser beam. The result is very smooth and precise. With this latest tool, even very hard granite rocks are easy to split or cut. That is the product of the human mind."
		   },
		   {
			"id": 3080,
			"surah": 26,
			"ayat": 148,
			"tafsir": "Prophet Saleh reminded them of God's blessings that had been bestowed on them, namely: 1. They lived safely in their country, free from enemy disturbances, and obtained happiness and peace in life. 2. They have fertile agricultural land, many livestock, and have water sources that can be used to make regular irrigation canals. They live as farmers, herders, traders, and metal diggers from the ground. Therefore, their land becomes beautiful, filled with plants that delight the eyes of those who look at it. Some of them even say that their country is actually the paradise that God promised. 3. They were given the ability to carve a rocky mountain to be used as a place to live. Those are the various favors of Allah that have been bestowed on the Samud people. They should be grateful for the blessings that God has given them, but they are getting more arrogant day by day. They feel that happiness and enjoyment is only because of their own efforts, not because of God's grace. Therefore, they do not believe in the Last Day. The real life according to them is to live in this world and they want to be eternal in this world. The Samud people no longer think about what their fate will be, if at one time, Allah suddenly takes away all their happiness and prosperity and exchanges it for a terrible calamity. All that could be done by God because of their own denial and arrogance. This verse implies how with the provision of a strong mind, humans can carve mountain rocks to be used as dwellings, as was done by the Samud people. At this time, the technology of sculpting tools has developed and is used by humans to meet their needs, among others, to cut and split hard mountain rocks. These tools are fully powered by machines or robots. Even humans have been able to create super-advanced sculpting technologies where objects are cut or split with a laser beam. The result is very smooth and precise. With this latest tool, even very hard granite rocks are easy to split or cut. That is the product of the human mind."
		   },
		   {
			"id": 3081,
			"surah": 26,
			"ayat": 149,
			"tafsir": "Prophet Saleh reminded them of God's blessings that had been bestowed on them, namely: 1. They lived safely in their country, free from enemy disturbances, and obtained happiness and peace in life. 2. They have fertile agricultural land, many livestock, and have water sources that can be used to make regular irrigation canals. They live as farmers, herders, traders, and metal diggers from the ground. Therefore, their land becomes beautiful, filled with plants that delight the eyes of those who look at it. Some of them even say that their country is actually the paradise that God promised. 3. They were given the ability to carve a rocky mountain to be used as a place to live. Those are the various favors of Allah that have been bestowed on the Samud people. They should be grateful for the blessings that God has given them, but they are getting more arrogant day by day. They feel that happiness and enjoyment is only because of their own efforts, not because of God's grace. Therefore, they do not believe in the Last Day. The real life according to them is to live in this world and they want to be eternal in this world. The Samud people no longer think about what their fate will be, if at one time, Allah suddenly takes away all their happiness and prosperity and exchanges it for a terrible calamity. All that could be done by God because of their own denial and arrogance. This verse implies how with the provision of a strong mind, humans can carve mountain rocks to be used as dwellings, as was done by the Samud people. At this time, the technology of sculpting tools has developed and is used by humans to meet their needs, among others, to cut and split hard mountain rocks. These tools are fully powered by machines or robots. Even humans have been able to create super-advanced sculpting technologies where objects are cut or split with a laser beam. The result is very smooth and precise. With this latest tool, even very hard granite rocks are easy to split or cut. That is the product of the human mind."
		   },
		   {
			"id": 3082,
			"surah": 26,
			"ayat": 150,
			"tafsir": "In this verse it is explained that the Prophet Saleh continued to carry out his duties as the messenger of Allah. He called on his people to fear Allah and follow the religion he conveyed. Prophet Saleh also invited them to do things that were pleasing to Allah and beneficial to their lives in this world and in the hereafter, namely worshiping Allah, who had bestowed these blessings upon them. Nabi Saleh reminded them to no longer obey their leaders who always do evil, disobedience and damage to this earth."
		   },
		   {
			"id": 3083,
			"surah": 26,
			"ayat": 151,
			"tafsir": "In this verse it is explained that the Prophet Saleh continued to carry out his duties as the messenger of Allah. He called on his people to fear Allah and follow the religion he conveyed. Prophet Saleh also invited them to do things that were pleasing to Allah and beneficial to their lives in this world and in the hereafter, namely worshiping Allah, who had bestowed these blessings upon them. Nabi Saleh reminded them to no longer obey their leaders who always do evil, disobedience and damage to this earth."
		   },
		   {
			"id": 3084,
			"surah": 26,
			"ayat": 152,
			"tafsir": "In this verse it is explained that the Prophet Saleh continued to carry out his duties as the messenger of Allah. He called on his people to fear Allah and follow the religion he conveyed. Prophet Saleh also invited them to do things that were pleasing to Allah and beneficial to their lives in this world and in the hereafter, namely worshiping Allah, who had bestowed these blessings upon them. Nabi Saleh reminded them to no longer obey their leaders who always do evil, disobedience and damage to this earth."
		   },
		   {
			"id": 3085,
			"surah": 26,
			"ayat": 153,
			"tafsir": "Everything that Prophet Saleh presented to his people, in the form of proofs of the truth of da'wah, they could not deny. Even their hearts acknowledged the truth conveyed to them, but it was their souls that had been corrupted which caused them to deny the Prophet Saleh's call. Therefore, they said to Nabi Saleh, \"O Saleh, you are suggesting something to us that aims to make us leave the religion of our forefathers, and follow the religion that you brought. The ways you convey religion are very interesting and fascinate us, as if -will you have bewitched us. Actually you have been mad and affected by magic, because our god has inflicted madness on you, so it is no longer appropriate for us to hear your words and accept your invitation.\""
		   },
		   {
			"id": 3086,
			"surah": 26,
			"ayat": 154,
			"tafsir": "The Samud people still do not believe in Prophet Saleh's apostleship because according to them, he is an ordinary human being like them too. The apostles sent by Allah should not be ordinary humans, but angels or creatures that are different from them. The messenger must be able to do something miraculous and strange, where humans are not able to do it. Therefore, they asked Prophet Saleh to bring a miracle as proof of his apostleship, or to show that he was really a prophet sent by Allah to them. Allah fulfilled their wish by bringing a she-camel as a miracle for Prophet Saleh. They were forbidden to disturb the camel, and let him eat and drink as he pleased. Prophet Saleh threatened them by saying that they would soon be punished by Allah if they disturbed the camel. According to the commentators, the miraculous aspects of the camel are: 1. The camel came out of the rock, while the other camels did not. 2. The sources of drinking water for the inhabitants are divided in half between the camels and the inhabitants of the country. On the day the camel drank, residents were not allowed to take water. To meet the needs of drinking water, they are allowed to milk the camel. When it is the turn of the people to fetch water, the camels do not come to drink water there. 3. On the day the camel drank, the other animals did not come to that place. The extraordinary nature of the camel is a clear testament to Saleh's apostleship. They will be destroyed by Allah, if they disobey His commands regarding the camel. They ignored Prophet Saleh's prohibition so that they would not touch and disturb the camel, they even wanted to prove the truth of Prophet Saleh's words. Therefore, they wanted to kill him and challenge what had been threatened against them. Prophet Saleh said that they would be destroyed by Allah after three days had passed because of the act of killing the camel."
		   },
		   {
			"id": 3087,
			"surah": 26,
			"ayat": 155,
			"tafsir": "The Samud people still do not believe in Prophet Saleh's apostleship because according to them, he is an ordinary human being like them too. The apostles sent by Allah should not be ordinary humans, but angels or creatures that are different from them. The messenger must be able to do something miraculous and strange, where humans are not able to do it. Therefore, they asked Prophet Saleh to bring a miracle as proof of his apostleship, or to show that he was really a prophet sent by Allah to them. Allah fulfilled their wish by bringing a she-camel as a miracle for Prophet Saleh. They were forbidden to disturb the camel, and let him eat and drink as he pleased. Prophet Saleh threatened them by saying that they would soon be punished by Allah if they disturbed the camel. According to the commentators, the miraculous aspects of the camel are: 1. The camel came out of the rock, while the other camels did not. 2. The sources of drinking water for the inhabitants are divided in half between the camels and the inhabitants of the country. On the day the camel drank, residents were not allowed to take water. To meet the needs of drinking water, they are allowed to milk the camel. When it is the turn of the people to fetch water, the camels do not come to drink water there. 3. On the day the camel drank, the other animals did not come to that place. The extraordinary nature of the camel is a clear testament to Saleh's apostleship. They will be destroyed by Allah, if they disobey His commands regarding the camel. They ignored Prophet Saleh's prohibition so that they would not touch and disturb the camel, they even wanted to prove the truth of Prophet Saleh's words. Therefore, they wanted to kill him and challenge what had been threatened against them. Prophet Saleh said that they would be destroyed by Allah after three days had passed because of the act of killing the camel."
		   },
		   {
			"id": 3088,
			"surah": 26,
			"ayat": 156,
			"tafsir": "The Samud people still do not believe in Prophet Saleh's apostleship because according to them, he is an ordinary human being like them too. The apostles sent by Allah should not be ordinary humans, but angels or creatures that are different from them. The messenger must be able to do something miraculous and strange, where humans are not able to do it. Therefore, they asked Prophet Saleh to bring a miracle as proof of his apostleship, or to show that he was really a prophet sent by Allah to them. Allah fulfilled their wish by bringing a she-camel as a miracle for Prophet Saleh. They were forbidden to disturb the camel, and let him eat and drink as he pleased. Prophet Saleh threatened them by saying that they would soon be punished by Allah if they disturbed the camel. According to the commentators, the miraculous aspects of the camel are: 1. The camel came out of the rock, while the other camels did not. 2. The sources of drinking water for the inhabitants are divided in half between the camels and the inhabitants of the country. On the day the camel drank, residents were not allowed to take water. To meet the needs of drinking water, they are allowed to milk the camel. When it is the turn of the people to fetch water, the camels do not come to drink water there. 3. On the day the camel drank, the other animals did not come to that place. The extraordinary nature of the camel is a clear testament to Saleh's apostleship. They will be destroyed by Allah, if they disobey His commands regarding the camel. They ignored Prophet Saleh's prohibition so that they would not touch and disturb the camel, they even wanted to prove the truth of Prophet Saleh's words. Therefore, they wanted to kill him and challenge what had been threatened against them. Prophet Saleh said that they would be destroyed by Allah after three days had passed because of the act of killing the camel."
		   },
		   {
			"id": 3089,
			"surah": 26,
			"ayat": 157,
			"tafsir": "(157-159) This verse explains that the Samud people wanted to prove the truth of Prophet Saleh's words, then they killed the camel. However, after they slaughtered the camel, especially after seeing signs that Allah's punishment was coming, they regretted it. Especially when their earth was shaken by an earthquake and accompanied by lightning and thunderbolts which caused their houses to be razed to the ground. In the Al-Qur'an there are verses that explain the punishments that destroy them. There are verses which explain that they were destroyed by sa'iqah (lightning) (Fussilat\/41: 17 and ad-dariyat\/51: 44). While other verses mention rajfah (shaking the earth very hard) (al-A'raf\/7: 78). In other verses it is called saihah (a very loud voice from the sky) (Hud\/11: 67; al-Hijr\/15: 83; and al-Qamar\/54: 31). There are also those who say that they were destroyed by Tagiyah (an extraordinary incident) (al-Haqqah\/69: 5). These verses are not contradictory because they are destroyed by lightning (Sa'iqah). As for the very loud shaking of the earth (rajfah), a loud sound from the sky (saihah), and extraordinary events (tagiyah) are symptoms and characteristics of lightning. The lightning was so great that it shook the earth and made a very loud sound. All this destroyed them and this was an extraordinary incident. In the twinkling of an eye, they had become motionless bodies, dead and slumped in their homes. Then they disappeared from the surface of the earth, nothing was seen except their place of residence, as if they had never lived and were in that place. Because they have been destroyed by Allah, then in history they are one of the Arab nations who have been destroyed (al-'Arab al-Ba'idah). Prophet Saleh and the believers were saved by Allah from that doom. They fled to Ramallah, a city in Palestine. In this city there is the grave of Prophet Saleh which is still known today. However, there are those who say that Prophet Saleh's grave is in Yemen, and there are also those who think that it is in Jordan. According to Ibn Khaldun, Prophet Saleh called his people to the religion of Allah for twenty years and he died at the age of fifty-eight. The lands of the Samud people and the buildings they erected are still there. Western scholars have visited this place a lot. They have written the remains of the Samud people and the residential houses they carved from the rocks. Among them is CM Daughty who wrote a book entitled Arabia Desserta. When the Prophet passed the villages of the Samud people on his expedition trip, namely Tabuk, he said to his companions: You do not enter the villages of those who have been punished, but by crying, if not by crying, then do not enter their villages, so that you will not be punished as it has befallen them. (History of ash-Shaikhan from Ibn 'Umar). Their remains and traces are enshrined in the Qur'an to serve as a lesson. Many verses of the Qur'an instruct people to travel on earth, to pay attention to the remains and traces of people who have been destroyed by Allah, because of their disobedience to His commands, like the Samud people. Truly Allah does good to all human beings, His punishment is very severe and His mercy is very great."
		   },
		   {
			"id": 3090,
			"surah": 26,
			"ayat": 158,
			"tafsir": "see verse 157"
		   },
		   {
			"id": 3091,
			"surah": 26,
			"ayat": 159,
			"tafsir": "see verse 157"
		   },
		   {
			"id": 3092,
			"surah": 26,
			"ayat": 160,
			"tafsir": "In this verse it is explained that the Prophet Lut's people had denied the Prophet Lut's call that was sent by Allah to them. The Prophet Lut called on them to fear Allah, the Lord who created them all. Prophet Lut was the son of Haran bin Terah, brother of Prophet Abraham. Therefore, Lut is the nephew of Prophet Abraham. Lut believed in what his uncle, Ibrahim, said in the word of God: So Lot confirmed (the prophethood of Abraham). And he (Ibrahim) said, \"Indeed I must move to (the place ordered by) my Lord; indeed, He is the Most Mighty, the Most Wise.\" (al-'Ankabut\/29: 26). Prophet Lut lived with Prophet Ibrahim in the city of Ur, then moved with him to Palestine and visited Egypt. From Egypt he returned to Palestine with Ibrahim. They then separated, Prophet Lut went to Sodom, while Ibrahim remained in Palestine. The city of Sodom was located in what is now Jordan, on the shore of Lut's Buhairah (lake). The Bhairah of Lot is in the southern part of the Dead Sea. So the city of Sodom is not far from Baitul Makdis. (See \"Lut\" vocabulary)."
		   },
		   {
			"id": 3093,
			"surah": 26,
			"ayat": 161,
			"tafsir": "In this verse it is explained that the Prophet Lut's people had denied the Prophet Lut's call that was sent by Allah to them. The Prophet Lut called on them to fear Allah, the Lord who created them all. Prophet Lut was the son of Haran bin Terah, brother of Prophet Abraham. Therefore, Lut is the nephew of Prophet Abraham. Lut believed in what his uncle, Ibrahim, said in the word of God: So Lot confirmed (the prophethood of Abraham). And he (Ibrahim) said, \"Indeed I must move to (the place ordered by) my Lord; indeed, He is the Most Mighty, the Most Wise.\" (al-'Ankabut\/29: 26). Prophet Lut lived with Prophet Ibrahim in the city of Ur, then moved with him to Palestine and visited Egypt. From Egypt he returned to Palestine with Ibrahim. They then separated, Prophet Lut went to Sodom, while Ibrahim remained in Palestine. The city of Sodom was located in what is now Jordan, on the shore of Lut's Buhairah (lake). The Bhairah of Lot is in the southern part of the Dead Sea. So the city of Sodom is not far from Baitul Makdis. (See \"Lut\" vocabulary)."
		   },
		   {
			"id": 3094,
			"surah": 26,
			"ayat": 162,
			"tafsir": "Residents of the city of Sodom (Sadum) are very bad manners. They worshiped idols in addition to worshiping God. Therefore, the Prophet Lut called on them to worship Allah alone, fear Him, and follow the teachings he brought. As was the case with Prophet Noah, Prophet Hud, and Prophet Saleh, Prophet Lut also conveyed to his people that he was a messenger who was truly sent to convey the religion of Allah. He did not expect any reward from them in return for the call he had made. He only expects a reward from Allah who has sent him like the other prophets."
		   },
		   {
			"id": 3095,
			"surah": 26,
			"ayat": 163,
			"tafsir": "Residents of the city of Sodom (Sadum) are very bad manners. They worshiped idols in addition to worshiping God. Therefore, the Prophet Lut called on them to worship Allah alone, fear Him, and follow the teachings he brought. As was the case with Prophet Noah, Prophet Hud, and Prophet Saleh, Prophet Lut also conveyed to his people that he was a messenger who was truly sent to convey the religion of Allah. He did not expect any reward from them in return for the call he had made. He only expects a reward from Allah who has sent him like the other prophets."
		   },
		   {
			"id": 3096,
			"surah": 26,
			"ayat": 164,
			"tafsir": "Residents of the city of Sodom (Sadum) are very bad manners. They worshiped idols in addition to worshiping God. Therefore, the Prophet Lut called on them to worship Allah alone, fear Him, and follow the teachings he brought. As was the case with Prophet Noah, Prophet Hud, and Prophet Saleh, Prophet Lut also conveyed to his people that he was a messenger who was truly sent to convey the religion of Allah. He did not expect any reward from them in return for the call he had made. He only expects a reward from Allah who has sent him like the other prophets."
		   },
		   {
			"id": 3097,
			"surah": 26,
			"ayat": 165,
			"tafsir": "Prophet Lut gave a warning to his people, who always had homosexual relations, and left their wives. They commit homosexual acts in public, in meeting halls witnessed by many people. Their actions were considered to encourage others to do as they did. Allah said: And (remember the story of) Lot, when he said to his people, \"Why do you do fahisyah (abominable) deeds, when you see them (abominable immoral acts)?\" Why do you go to men to (fulfill) lust (you), not (go to) women? Indeed, you are a people who do not know (the result of your actions). (an-Naml\/27: 54-55). Besides practicing homosexuality, Prophet Lut's people also robbed and robbed the property of passers-by and carried trade goods. Same-sex practices (homosexuals and lesbians) are strictly prohibited by Islam. This practice is very unhealthy. This deviant sexual behavior causes many new diseases, such as AIDS and herpes. Both of these diseases were unknown several generations ago. But at present, both diseases have spread widely and rapidly. Homosexual practices, in addition to other deviant sexual behaviors, such as changing partners or practicing prostitution, are the most common ways of spreading the AIDS virus. This disease is mostly (90%) spread by means of deviant sexual behavior. Several other ways of transmitting AIDS are by means of blood transfusions that have been contaminated with the AIDS virus and the use of unsterile needles. Meanwhile, transmission from mother to fetus is not too large, which is below 10%. In a hadith, the Prophet Muhammad said: The act of adultery never occurs in a people, so they do it openly, unless they will be overwritten by infectious diseases and other diseases that did not exist in the community before. (History of Ibn Majah from Ibn Umar) From the hadith above, it can be seen that when humans start to engage in abnormal sexual behavior, new diseases will appear that have never existed before, and spread among humans. At present, we only understand what this hadith means, which was spoken by the Prophet Muhammad about 1400 years ago."
		   },
		   {
			"id": 3098,
			"surah": 26,
			"ayat": 166,
			"tafsir": "Prophet Lut gave a warning to his people, who always had homosexual relations, and left their wives. They commit homosexual acts in public, in meeting halls witnessed by many people. Their actions were considered to encourage others to do as they did. Allah said: And (remember the story of) Lot, when he said to his people, \"Why do you do fahisyah (abominable) deeds, when you see them (abominable immoral acts)?\" Why do you go to men to (fulfill) lust (you), not (go to) women? Indeed, you are a people who do not know (the result of your actions). (an-Naml\/27: 54-55). Besides practicing homosexuality, Prophet Lut's people also robbed and robbed the property of passers-by and carried trade goods. Same-sex practices (homosexuals and lesbians) are strictly prohibited by Islam. This practice is very unhealthy. This deviant sexual behavior causes many new diseases, such as AIDS and herpes. Both of these diseases were unknown several generations ago. But at present, both diseases have spread widely and rapidly. Homosexual practices, in addition to other deviant sexual behaviors, such as changing partners or practicing prostitution, are the most common ways of spreading the AIDS virus. This disease is mostly (90%) spread by means of deviant sexual behavior. Several other ways of transmitting AIDS are by means of blood transfusions that have been contaminated with the AIDS virus and the use of unsterile needles. Meanwhile, transmission from mother to fetus is not too large, which is below 10%. In a hadith, the Prophet Muhammad said: The act of adultery never occurs in a people, so they do it openly, unless they will be overwritten by infectious diseases and other diseases that did not exist in the community before. (History of Ibn Majah from Ibn Umar) From the hadith above, it can be seen that when humans start to engage in abnormal sexual behavior, new diseases will appear that have never existed before, and spread among humans. At present, we only understand what this hadith means, which was spoken by the Prophet Muhammad about 1400 years ago."
		   },
		   {
			"id": 3099,
			"surah": 26,
			"ayat": 167,
			"tafsir": "The people of Sodom did not heed the Prophet Lut's call, they even threatened to kill and expel Lut and those who believed from their land. Their disobedience was increasing day by day and they challenged Prophet Lut to bring about the doom that was threatened."
		   },
		   {
			"id": 3100,
			"surah": 26,
			"ayat": 168,
			"tafsir": "The Prophet Lut told his people that he was free from the actions of his people and really hated those actions. The Prophet Lut was sure that no matter what threats his people gave him, they would not be able to harm him, because everything was from Allah and according to His will."
		   },
		   {
			"id": 3101,
			"surah": 26,
			"ayat": 169,
			"tafsir": "The Prophet Lut prayed to Allah so that he and his family would be released from the punishment that would befall his people due to their heinous deeds. He also asked to be kept away from the punishment of Allah, both in this world and in the hereafter."
		   },
		   {
			"id": 3102,
			"surah": 26,
			"ayat": 170,
			"tafsir": "Allah granted the Prophet Lut's prayer by bringing havoc to his rebellious people. Allah saved Lut and his family except his disobedient wife. In this verse it is not explained what happened before the catastrophe befell the Prophet Lut's people. However, in another surahh it is explained that before the punishment came, Allah sent the Prophet Lut an angel disguised as a handsome young man, to destroy them. Before coming to them, the angel stopped first at Ibrahim's house. Allah said: He (Ibrahim) said, \"What is your important business, O Messengers?\" (They) replied, \"Surely we were sent to a people who sinned.\" (al-hijr\/15: 57-58). After the angels in the form of handsome youths arrived at Prophet Lut's house, the people of Sodom then came to his house. They intended to commit a heinous act with the guests of the Prophet Lut. Prophet Lut tried to prohibit them from doing so by offering his daughters (dwelling women of the city) to marry them. Prophet Lut told them that his daughters were sacred to them and he asked not to touch his guests. The Prophet Lut reproached them by saying that there was no one who had any sense among them. Allah's Word: And his people immediately came to him. And they have always committed heinous deeds. Lut said, \"O my people! These are my daughters (country), they are purer to you, so fear Allah and do not dishonor my (name) against my guest. Is there not one of you who is clever?\" (Hud\/11: 78). The people of Sodom rejected Prophet Lut's offer by saying that they did not have the slightest desire for his daughters. They still disobey. Then the angels introduced themselves to Prophet Lut and said that they were sent by God to destroy the rebellious inhabitants of Sodom. The inhabitants of Sodom will not be able to do anything against Prophet Lut. When the people of Sodom invaded the house of Prophet Lut, Allah made them unable to see Prophet Lut and the angels. Then Allah ordered the Prophet Lut to leave the city of Sodom at night, together with his family, apart from his wife because he would be destroyed along with the people of Sodom. God commanded that when leaving Sodom, not one of them looked back. Then they carried out the order. Allah said: They (the angels) said, \"O Lut! Indeed we are the messengers of your Lord, they will not be able to disturb you, so go with your family at the end of the night and none of you will look back, except your wife. Surely he (also) will be overwritten (torture) that befell them. Verily the time of torment for them is at dawn. Isn't dawn near?\" (Hud\/11: 81)."
		   },
		   {
			"id": 3103,
			"surah": 26,
			"ayat": 171,
			"tafsir": "Allah granted the Prophet Lut's prayer by bringing havoc to his rebellious people. Allah saved Lut and his family except his disobedient wife. In this verse it is not explained what happened before the catastrophe befell the Prophet Lut's people. However, in another surahh it is explained that before the punishment came, Allah sent the Prophet Lut an angel disguised as a handsome young man, to destroy them. Before coming to them, the angel stopped first at Ibrahim's house. Allah said: He (Ibrahim) said, \"What is your important business, O Messengers?\" (They) replied, \"Surely we were sent to a people who sinned.\" (al-hijr\/15: 57-58). After the angels in the form of handsome youths arrived at Prophet Lut's house, the people of Sodom then came to his house. They intended to commit a heinous act with the guests of the Prophet Lut. Prophet Lut tried to prohibit them from doing so by offering his daughters (dwelling women of the city) to marry them. Prophet Lut told them that his daughters were sacred to them and he asked not to touch his guests. The Prophet Lut reproached them by saying that there was no one who had any sense among them. Allah's Word: And his people immediately came to him. And they have always committed heinous deeds. Lut said, \"O my people! These are my daughters (country), they are purer to you, so fear Allah and do not dishonor my (name) against my guest. Is there not one of you who is clever?\" (Hud\/11: 78). The people of Sodom rejected Prophet Lut's offer by saying that they did not have the slightest desire for his daughters. They still disobey. Then the angels introduced themselves to Prophet Lut and said that they were sent by God to destroy the rebellious inhabitants of Sodom. The inhabitants of Sodom will not be able to do anything against Prophet Lut. When the people of Sodom invaded the house of Prophet Lut, Allah made them unable to see Prophet Lut and the angels. Then Allah ordered the Prophet Lut to leave the city of Sodom at night, together with his family, apart from his wife because he would be destroyed along with the people of Sodom. God commanded that when leaving Sodom, not one of them looked back. Then they carried out the order. Allah said: They (the angels) said, \"O Lut! Indeed we are the messengers of your Lord, they will not be able to disturb you, so go with your family at the end of the night and none of you will look back, except your wife. Surely he (also) will be overwritten (torture) that befell them. Verily the time of torment for them is at dawn. Isn't dawn near?\" (Hud\/11: 81)."
		   },
		   {
			"id": 3104,
			"surah": 26,
			"ayat": 172,
			"tafsir": "After the promised time arrived, God rained down on the people of Sodom with stones of petrified clay, and their land was turned upside down by God. Thus, the inhabitants of the city of Sodom and its city were destroyed. Allah said: So when Our decision came, We overturned the land of the people of Lut, and We showered them with stones from the burning ground, marked by your Lord. And the torment is not far from the wrongdoer. (Hud\/11: 82-83). Not long after the Prophet Lut's people were destroyed, their country was then flooded. Recently, the remains of the city of Sodom have been found, namely on the coast of Buairah Lut, in the southern part of the Dead Sea (al-Bahrul Mayyit). The Prophet Lut and his followers moved to Zoar, an old city in Canaan."
		   },
		   {
			"id": 3105,
			"surah": 26,
			"ayat": 173,
			"tafsir": "After the promised time arrived, God rained down on the people of Sodom with stones of petrified clay, and their land was turned upside down by God. Thus, the inhabitants of the city of Sodom and its city were destroyed. Allah said: So when Our decision came, We overturned the land of the people of Lut, and We showered them with stones from the burning ground, marked by your Lord. And the torment is not far from the wrongdoer. (Hud\/11: 82-83). Not long after the Prophet Lut's people were destroyed, their country was then flooded. Recently, the remains of the city of Sodom have been found, namely on the coast of Buairah Lut, in the southern part of the Dead Sea (al-Bahrul Mayyit). The Prophet Lut and his followers moved to Zoar, an old city in Canaan."
		   },
		   {
			"id": 3106,
			"surah": 26,
			"ayat": 174,
			"tafsir": "This verse explains that Allah saved Prophet Lut and his family, except for his wife, and destroyed those rebellious people. This is clear evidence of the truth of Prophet Lut as an apostle sent by God to the people of Sodom. However, very few people pay attention to the signs of God's greatness and power, so that very few of them believe in and follow His messengers."
		   },
		   {
			"id": 3107,
			"surah": 26,
			"ayat": 175,
			"tafsir": "Allah is the Lord who has the right to be worshiped and is very severe in His vengeance on His servants who disobey. He is Most Merciful to His servants, and His affection is constant, never ending."
		   },
		   {
			"id": 3108,
			"surah": 26,
			"ayat": 176,
			"tafsir": "This verse explains that the people of Madyan, who are also called the Madyan tribe, have denied the Prophet Shuaib who called them to fear Allah by carrying out His commands and abandoning His prohibitions. In this verse it is explained that the actions of the people of Madyan are tantamount to denying the apostles, because to deny an apostle is tantamount to denying all the apostles sent by God. According to Ibn Kasir, the people of Madyan and Aikah are one tribe. Only in the Qur'an are they sometimes described as residents of Madyan and sometimes referred to as residents of Aikah. The Madyan tribe is a tribe that inhabits the area around the Gulf of Aqabah and the area to the north. Madyan is the eponym of their ancestor, Madyan. Madyan was one of the sons of Prophet Abraham. Their life at that time was prosperous. They are happy, and domiciled as merchants. The largest city in the Madyan area is also named Madyan. This city is located in the middle of the Madyan area on the east coast of the Red Sea parallel to Tabuk. What is meant by the population of Aikah in the verse above is the population of Madyan. Some commentators are of the opinion that the Prophet Shuaib was sent after the Prophet Musa. Some others say the opposite, namely before the sending of Prophet Musa."
		   },
		   {
			"id": 3109,
			"surah": 26,
			"ayat": 177,
			"tafsir": "This verse explains that the people of Madyan, who are also called the Madyan tribe, have denied the Prophet Shuaib who called them to fear Allah by carrying out His commands and abandoning His prohibitions. In this verse it is explained that the actions of the people of Madyan are tantamount to denying the apostles, because to deny an apostle is tantamount to denying all the apostles sent by God. According to Ibn Kasir, the people of Madyan and Aikah are one tribe. Only in the Qur'an are they sometimes described as residents of Madyan and sometimes referred to as residents of Aikah. The Madyan tribe is a tribe that inhabits the area around the Gulf of Aqabah and the area to the north. Madyan is the eponym of their ancestor, Madyan. Madyan was one of the sons of Prophet Abraham. Their life at that time was prosperous. They are happy, and domiciled as merchants. The largest city in the Madyan area is also named Madyan. This city is located in the middle of the Madyan area on the east coast of the Red Sea parallel to Tabuk. What is meant by the population of Aikah in the verse above is the population of Madyan. Some commentators are of the opinion that the Prophet Shuaib was sent after the Prophet Musa. Some others say the opposite, namely before the sending of Prophet Musa."
		   },
		   {
			"id": 3110,
			"surah": 26,
			"ayat": 178,
			"tafsir": "Shuaib called the inhabitants of Madyan, as the previous prophets had done. He explained to them that his job was not to seek worldly wealth, power, or gain. Therefore, he will not take any reward from them for his call. His reward will be given to Allah who has sent him. In surahh Hud\/11 it is also explained that Shuaib invites his people to worship only Allah. Allah said: And to the (people of) Madyan (We sent) their brother, Shuaib. He said, \"O my people! Worship Allah, there is no god for you but Him. (Hud\/11: 84)."
		   },
		   {
			"id": 3111,
			"surah": 26,
			"ayat": 179,
			"tafsir": "Shuaib called the inhabitants of Madyan, as the previous prophets had done. He explained to them that his job was not to seek worldly wealth, power, or gain. Therefore, he will not take any reward from them for his call. His reward will be given to Allah who has sent him. In surahh Hud\/11 it is also explained that Shuaib invites his people to worship only Allah. Allah said: And to the (people of) Madyan (We sent) their brother, Shuaib. He said, \"O my people! Worship Allah, there is no god for you but Him. (Hud\/11: 84)."
		   },
		   {
			"id": 3112,
			"surah": 26,
			"ayat": 180,
			"tafsir": "And I do not ask for anything in return either in the form of material or services to you for that invitation, my reward is none other than the Lord of all the worlds. With no reward, the Prophet Sy'aib has no interest except for their benefit."
		   },
		   {
			"id": 3113,
			"surah": 26,
			"ayat": 181,
			"tafsir": "Besides associating partners with Allah in something else, the people of Madyan also commit sins and commit other crimes, including: 1. Reducing the scales and measures when selling and asking for more when buying. 2. Lowering the price of goods so that they can buy those goods at very low prices. 3. Making trouble and mischief on earth. This verse explains that Shuaib called on his people to stop the crimes they used to do. They are called upon to perfect measures and weights both when selling and buying. Reducing or increasing measures and weights is an act that harms other people. That means making mischief on earth. Shuaib reminded his people that lawful wealth is better for them, because they are people who have a good life. Allah says: The remainder (which is lawful) from Allah is better for you if you are believers. And I am not a guardian over you.\" (Hud\/11: 86). What is meant by the remaining profit from Allah (baqiyyatullah) is a lawful profit in trade after perfecting the measure and scales. Syuaib reminded that the evil deeds they did were contrary to provisions set by Allah for all His creatures. Therefore, they are asked to stop these actions, and fear Allah's punishment that will be inflicted on those who commit crimes. It is He who created everything that exists, including them. He created from nothing to nothing to bring about benefit on earth. Allah has created people who have strength and abilities that are stronger and bigger than them, and have more wealth and wealth, like the Hud people who they once said were a people who are more strong and mighty of them. Because of the tyranny and evil of the ancient peoples, Allah punishes and befalls it's a big disaster for them."
		   },
		   {
			"id": 3114,
			"surah": 26,
			"ayat": 182,
			"tafsir": "Besides associating partners with Allah in something else, the people of Madyan also commit sins and commit other crimes, including: 1. Reducing the scales and measures when selling and asking for more when buying. 2. Lowering the price of goods so that they can buy those goods at very low prices. 3. Making trouble and mischief on earth. This verse explains that Shuaib called on his people to stop the crimes they used to do. They are called upon to perfect measures and weights both when selling and buying. Reducing or increasing measures and weights is an act that harms other people. That means making mischief on earth. Shuaib reminded his people that lawful wealth is better for them, because they are people who have a good life. Allah says: The remainder (which is lawful) from Allah is better for you if you are believers. And I am not a guardian over you.\" (Hud\/11: 86). What is meant by the remaining profit from Allah (baqiyyatullah) is a lawful profit in trade after perfecting the measure and scales. Syuaib reminded that the evil deeds they did were contrary to provisions set by Allah for all His creatures. Therefore, they are asked to stop these actions, and fear Allah's punishment that will be inflicted on those who commit crimes. It is He who created everything that exists, including them. He created from nothing to nothing to bring about benefit on earth. Allah has created people who have strength and abilities that are stronger and bigger than them, and have more wealth and wealth, like the Hud people who they once said were a people who are more strong and mighty of them. Because of the tyranny and evil of the ancient peoples, Allah punishes and befalls it's a big disaster for them."
		   },
		   {
			"id": 3115,
			"surah": 26,
			"ayat": 183,
			"tafsir": "Besides associating partners with Allah in something else, the people of Madyan also commit sins and commit other crimes, including: 1. Reducing the scales and measures when selling and asking for more when buying. 2. Lowering the price of goods so that they can buy those goods at very low prices. 3. Making trouble and mischief on earth. This verse explains that Shuaib called on his people to stop the crimes they used to do. They are called upon to perfect measures and weights both when selling and buying. Reducing or increasing measures and weights is an act that harms other people. That means making mischief on earth. Shuaib reminded his people that lawful wealth is better for them, because they are people who have a good life. Allah says: The remainder (which is lawful) from Allah is better for you if you are believers. And I am not a guardian over you.\" (Hud\/11: 86). What is meant by the remaining profit from Allah (baqiyyatullah) is a lawful profit in trade after perfecting the measure and scales. Syuaib reminded that the evil deeds they did were contrary to provisions set by Allah for all His creatures. Therefore, they are asked to stop these actions, and fear Allah's punishment that will be inflicted on those who commit crimes. It is He who created everything that exists, including them. He created from nothing to nothing to bring about benefit on earth. Allah has created people who have strength and abilities that are stronger and bigger than them, and have more wealth and wealth, like the Hud people who they once said were a people who are more strong and mighty of them. Because of the tyranny and evil of the ancient peoples, Allah punishes and befalls it's a big disaster for them."
		   },
		   {
			"id": 3116,
			"surah": 26,
			"ayat": 184,
			"tafsir": "Besides associating partners with Allah in something else, the people of Madyan also commit sins and commit other crimes, including: 1. Reducing the scales and measures when selling and asking for more when buying. 2. Lowering the price of goods so that they can buy those goods at very low prices. 3. Making trouble and mischief on earth. This verse explains that Shuaib called on his people to stop the crimes they used to do. They are called upon to perfect measures and weights both when selling and buying. Reducing or increasing measures and weights is an act that harms other people. That means making mischief on earth. Shuaib reminded his people that lawful wealth is better for them, because they are people who have a good life. Allah says: The remainder (which is lawful) from Allah is better for you if you are believers. And I am not a guardian over you.\" (Hud\/11: 86). What is meant by the remaining profit from Allah (baqiyyatullah) is a lawful profit in trade after perfecting the measure and scales. Syuaib reminded that the evil deeds they did were contrary to provisions set by Allah for all His creatures. Therefore, they are asked to stop these actions, and fear Allah's punishment that will be inflicted on those who commit crimes. It is He who created everything that exists, including them. He created from nothing to nothing to bring about benefit on earth. Allah has created people who have strength and abilities that are stronger and bigger than them, and have more wealth and wealth, like the Hud people who they once said were a people who are more strong and mighty of them. Because of the tyranny and evil of the ancient peoples, Allah punishes and befalls it's a big disaster for them."
		   },
		   {
			"id": 3117,
			"surah": 26,
			"ayat": 185,
			"tafsir": "Even though Shuaib had warned his people, they still denied and disbelieved. In fact, they denounced Shuaib and underestimated God's threat that was conveyed to them by stating that: first, Shuaib was one of those who was enchanted, who said and did things only based on imagination and wishful thinking. Syuaib is an ordinary human being like them, does not have any advantages over them, and he is even a person whose mind is damaged. They denied Shuaib, and did not believe in the slightest that he was the apostle of Allah who was sent to them. Therefore, they denied the Prophet Shuaib, prevented others from coming to him, and threatened those who believed in him. However, Shuaib continued to advise and remind them. Shuaib is a prophet who is very good at arguing with his people. His arguments and arguments are very strong, so that the mufasir called him Khathib al-Anbiya' (speech expert among the prophets). However, the people of Madyan remained disobedient and denied Shuaib's appeal. Sometimes they said they didn't understand what he was saying, even though the call was clear and obvious. Sometimes they say that Shuaib is weak, as if they think that strength is the measure of truth and justice. Sometimes they threatened to kill Shuaib, and expel his believing followers from the country if Shuaib and those who believed did not return to their religion. The Shuaib people also reminded the people that they would lose money if they followed the Shuaib religion because it forbade them to reduce the measure and weight. They were amazed at Shuaib who forbade them to worship the worship of their ancestors, and do what they liked with their property. They reproached Shuaib about the mistakes he had made. They sneered at the prayers that Syuaib did. Allah said: They said, \"O Shuaib! Was it your religion that told you to leave what our ancestors worshiped or forbade us to manage our property the way we wanted? In fact, you are a very kind and intelligent person.\" (Hud\/11: 87). They said, \"O Shuaib! We do not understand much about what you are saying, while in reality we see you as a weakling among us. If it were not for your family, we would have stoned you, while you are not someone who is influential in society. we.\" (Hud\/11: 91). Second, if Shuaib is truly a prophet and messenger of Allah, then he is asked to send down to them (the Shuaib's) lumps from the sky, as he has threatened. The attitude of the Shuaib people is the same as the attitude of the Quraysh when they opposed the Prophet Muhammad so that he would emit water from the earth for them, bring a beautiful garden and dates and grapes, bring doom by dropping pieces from the sky that fell on them, or bring a house of gold etc. (Read surahh al-Isra'\/17: 90-93)."
		   },
		   {
			"id": 3118,
			"surah": 26,
			"ayat": 186,
			"tafsir": "Even though Shuaib had warned his people, they still denied and disbelieved. In fact, they denounced Shuaib and underestimated God's threat that was conveyed to them by stating that: first, Shuaib was one of those who was enchanted, who said and did things only based on imagination and wishful thinking. Syuaib is an ordinary human being like them, does not have any advantages over them, and he is even a person whose mind is damaged. They denied Shuaib, and did not believe in the slightest that he was the apostle of Allah who was sent to them. Therefore, they denied the Prophet Shuaib, prevented others from coming to him, and threatened those who believed in him. However, Shuaib continued to advise and remind them. Shuaib is a prophet who is very good at arguing with his people. His arguments and arguments are very strong, so that the mufasir called him Khathib al-Anbiya' (speech expert among the prophets). However, the people of Madyan remained disobedient and denied Shuaib's appeal. Sometimes they said they didn't understand what he was saying, even though the call was clear and obvious. Sometimes they say that Shuaib is weak, as if they think that strength is the measure of truth and justice. Sometimes they threatened to kill Shuaib, and expel his believing followers from the country if Shuaib and those who believed did not return to their religion. The Shuaib people also reminded the people that they would lose money if they followed the Shuaib religion because it forbade them to reduce the measure and weight. They were amazed at Shuaib who forbade them to worship the worship of their ancestors, and do what they liked with their property. They reproached Shuaib about the mistakes he had made. They sneered at the prayers that Syuaib did. Allah said: They said, \"O Shuaib! Was it your religion that told you to leave what our ancestors worshiped or forbade us to manage our property the way we wanted? In fact, you are a very kind and intelligent person.\" (Hud\/11: 87). They said, \"O Shuaib! We do not understand much about what you are saying, while in reality we see you as a weakling among us. If it were not for your family, we would have stoned you, while you are not someone who is influential in society. we.\" (Hud\/11: 91). Second, if Shuaib is truly a prophet and messenger of Allah, then he is asked to send down to them (the Shuaib's) lumps from the sky, as he has threatened. The attitude of the Shuaib people is the same as the attitude of the Quraysh when they opposed the Prophet Muhammad so that he would emit water from the earth for them, bring a beautiful garden and dates and grapes, bring doom by dropping pieces from the sky that fell on them, or bring a house of gold etc. (Read surahh al-Isra'\/17: 90-93)."
		   },
		   {
			"id": 3119,
			"surah": 26,
			"ayat": 187,
			"tafsir": "Even though Shuaib had warned his people, they still denied and disbelieved. In fact, they denounced Shuaib and underestimated God's threat that was conveyed to them by stating that: first, Shuaib was one of those who was enchanted, who said and did things only based on imagination and wishful thinking. Syuaib is an ordinary human being like them, does not have any advantages over them, and he is even a person whose mind is damaged. They denied Shuaib, and did not believe in the slightest that he was the apostle of Allah who was sent to them. Therefore, they denied the Prophet Shuaib, prevented others from coming to him, and threatened those who believed in him. However, Shuaib continued to advise and remind them. Shuaib is a prophet who is very good at arguing with his people. His arguments and arguments are very strong, so that the mufasir called him Khathib al-Anbiya' (speech expert among the prophets). However, the people of Madyan remained disobedient and denied Shuaib's appeal. Sometimes they said they didn't understand what he was saying, even though the call was clear and obvious. Sometimes they say that Shuaib is weak, as if they think that strength is the measure of truth and justice. Sometimes they threatened to kill Shuaib, and expel his believing followers from the country if Shuaib and those who believed did not return to their religion. The Shuaib people also reminded the people that they would lose money if they followed the Shuaib religion because it forbade them to reduce the measure and weight. They were amazed at Shuaib who forbade them to worship the worship of their ancestors, and do what they liked with their property. They reproached Shuaib about the mistakes he had made. They sneered at the prayers that Syuaib did. Allah said: They said, \"O Shuaib! Was it your religion that told you to leave what our ancestors worshiped or forbade us to manage our property the way we wanted? In fact, you are a very kind and intelligent person.\" (Hud\/11: 87). They said, \"O Shuaib! We do not understand much about what you are saying, while in reality we see you as a weakling among us. If it were not for your family, we would have stoned you, while you are not someone who is influential in society. we.\" (Hud\/11: 91). Second, if Shuaib is truly a prophet and messenger of Allah, then he is asked to send down to them (the Shuaib's) lumps from the sky, as he has threatened. The attitude of the Shuaib people is the same as the attitude of the Quraysh when they opposed the Prophet Muhammad so that he would emit water from the earth for them, bring a beautiful garden and dates and grapes, bring doom by dropping pieces from the sky that fell on them, or bring a house of gold etc. (Read surahh al-Isra'\/17: 90-93)."
		   },
		   {
			"id": 3120,
			"surah": 26,
			"ayat": 188,
			"tafsir": "The expression of this verse is Shuaib's answer to the denial and challenge of his people by saying that he was not sent to make them believe by instilling faith in their hearts. He is also not in charge of reckoning their deeds, as well as punishing and inflicting punishment on them. His job is only to convey the religion of Allah to his people. As for making a person a believer, reckoning human actions, and inflicting punishment is the right of Allah alone, because He is the Almighty and knows better about all human actions."
		   },
		   {
			"id": 3121,
			"surah": 26,
			"ayat": 189,
			"tafsir": "Because the people of Madyan remained disobedient, Shuaib threatened them by ordering them to wait for the punishment that Allah would bring. At the time promised by God, a terrible disaster came upon them. On that day, they felt the scorching heat that was very suffocating. There is nothing that can help them from such a situation, whether in the form of shelter, or drinking water, and so on. Therefore, they went out into the field and took shelter under a cool cloud. In such circumstances, Allah's punishment descended in the form of a powerful bolt of lightning that came out of the cloud, with a loud sound, and caused the earth to shake. They all fell to death with their faces face down to the ground. Their situation was like the situation of Prophet Saleh's people who were afflicted by Allah's punishment before. As for the Prophet Shuaib and those who believed, Allah saved them from that doom."
		   },
		   {
			"id": 3122,
			"surah": 26,
			"ayat": 190,
			"tafsir": "All the incidents contained in the story of Shuaib and his people, namely the destruction of the people of Madyan who ignored Shuaib's call and the rescue of believers from lightning strikes and earthquakes, are proof of the truth of Shuaib as Allah's messenger. Even so, the polytheists of Mecca and humans who did not want to take lessons from it, still did not believe in the Prophet Muhammad."
		   },
		   {
			"id": 3123,
			"surah": 26,
			"ayat": 191,
			"tafsir": "This verse explains that God who guides human beings to the right path, who can elevate human beings to a place of glory and praise, is the God who is just, the most severe in His requirements, and the most eternal is His mercy towards believers."
		   },
		   {
			"id": 3124,
			"surah": 26,
			"ayat": 192,
			"tafsir": "In these verses it is explained that the Al-Qur'an which was revealed to Muhammad is the holy book that comes from God Almighty. Was revealed to Muhammad gradually by the intercession of Jibril, the angel in charge of bringing revelations to the apostles. The Qur'an was instilled in Muhammad's heart, meaning that the Qur'an was recited by Jibril in such a way that the Prophet Muhammad fully understood its meaning and intent. With such understanding and understanding, the Prophet Muhammad easily conveyed it to his people and his people also easily accepted it. For example, when surahh al-An'am, whose verses totaled 165 verses and surahh Yusuf, which consisted of 111 verses, were revealed at once, the Prophet immediately accepted and memorized them. This is proof that the Qur'an was thrust into the heart of the Prophet by an angel with his tongue. Allah explained that the Qur'an was revealed in clear and fluent Arabic and beautiful language style. In it there are also verses that challenge the polytheists of Mecca to make other verses like the verses of the Al-Qur'an, if they do not believe that the Al-Qur'an was sent down from Allah and was only made by Muhammad. Alone. However, they were unable to match it, not even by composing a single surah that was as eloquent and beautiful in style as the language of the Qur'an. Thus, there was no longer any reason for those Meccan polytheists to say that the Al-Qur'an was only Muhammad's creation. Strictly speaking, even though the Al-Qur'an was revealed in Arabic, namely their own language, they were unable to match its verses. If Muhammad could make the Koran, of course according to logic, they could also make it, because they are both Arabs and both speak Arabic. They understand the verses of the Al-Qur'an, know the beauty of the style of language, and believe that the Al-Qur'an does not originate from humans. They know very well the limits of human ability, but they still do not want to believe in it because of their arrogance and denial that are ingrained and rooted in them."
		   },
		   {
			"id": 3125,
			"surah": 26,
			"ayat": 193,
			"tafsir": "In these verses it is explained that the Al-Qur'an which was revealed to Muhammad is the holy book that comes from God Almighty. Was revealed to Muhammad gradually by the intercession of Jibril, the angel in charge of bringing revelations to the apostles. The Qur'an was instilled in Muhammad's heart, meaning that the Qur'an was recited by Jibril in such a way that the Prophet Muhammad fully understood its meaning and intent. With such understanding and understanding, the Prophet Muhammad easily conveyed it to his people and his people also easily accepted it. For example, when surahh al-An'am, whose verses totaled 165 verses and surahh Yusuf, which consisted of 111 verses, were revealed at once, the Prophet immediately accepted and memorized them. This is proof that the Qur'an was thrust into the heart of the Prophet by an angel with his tongue. Allah explained that the Qur'an was revealed in clear and fluent Arabic and beautiful language style. In it there are also verses that challenge the polytheists of Mecca to make other verses like the verses of the Al-Qur'an, if they do not believe that the Al-Qur'an was sent down from Allah and was only made by Muhammad. Alone. However, they were unable to match it, not even by composing a single surah that was as eloquent and beautiful in style as the language of the Qur'an. Thus, there was no longer any reason for those Meccan polytheists to say that the Al-Qur'an was only Muhammad's creation. Strictly speaking, even though the Al-Qur'an was revealed in Arabic, namely their own language, they were unable to match its verses. If Muhammad could make the Koran, of course according to logic, they could also make it, because they are both Arabs and both speak Arabic. They understand the verses of the Al-Qur'an, know the beauty of the style of language, and believe that the Al-Qur'an does not originate from humans. They know very well the limits of human ability, but they still do not want to believe in it because of their arrogance and denial that are ingrained and rooted in them."
		   },
		   {
			"id": 3126,
			"surah": 26,
			"ayat": 194,
			"tafsir": "In these verses it is explained that the Al-Qur'an which was revealed to Muhammad is the holy book that comes from God Almighty. Was revealed to Muhammad gradually by the intercession of Jibril, the angel in charge of bringing revelations to the apostles. The Qur'an was instilled in Muhammad's heart, meaning that the Qur'an was recited by Jibril in such a way that the Prophet Muhammad fully understood its meaning and intent. With such understanding and understanding, the Prophet Muhammad easily conveyed it to his people and his people also easily accepted it. For example, when surahh al-An'am, whose verses totaled 165 verses and surahh Yusuf, which consisted of 111 verses, were revealed at once, the Prophet immediately accepted and memorized them. This is proof that the Qur'an was thrust into the heart of the Prophet by an angel with his tongue. Allah explained that the Qur'an was revealed in clear and fluent Arabic and beautiful language style. In it there are also verses that challenge the polytheists of Mecca to make other verses like the verses of the Al-Qur'an, if they do not believe that the Al-Qur'an was sent down from Allah and was only made by Muhammad. Alone. However, they were unable to match it, not even by composing a single surah that was as eloquent and beautiful in style as the language of the Qur'an. Thus, there was no longer any reason for those Meccan polytheists to say that the Al-Qur'an was only Muhammad's creation. Strictly speaking, even though the Al-Qur'an was revealed in Arabic, namely their own language, they were unable to match its verses. If Muhammad could make the Koran, of course according to logic, they could also make it, because they are both Arabs and both speak Arabic. They understand the verses of the Al-Qur'an, know the beauty of the style of language, and believe that the Al-Qur'an does not originate from humans. They know very well the limits of human ability, but they still do not want to believe in it because of their arrogance and denial that are ingrained and rooted in them."
		   },
		   {
			"id": 3127,
			"surah": 26,
			"ayat": 195,
			"tafsir": "In these verses it is explained that the Al-Qur'an which was revealed to Muhammad is the holy book that comes from God Almighty. Was revealed to Muhammad gradually by the intercession of Jibril, the angel in charge of bringing revelations to the apostles. The Qur'an was instilled in Muhammad's heart, meaning that the Qur'an was recited by Jibril in such a way that the Prophet Muhammad fully understood its meaning and intent. With such understanding and understanding, the Prophet Muhammad easily conveyed it to his people and his people also easily accepted it. For example, when surahh al-An'am, whose verses totaled 165 verses and surahh Yusuf, which consisted of 111 verses, were revealed at once, the Prophet immediately accepted and memorized them. This is proof that the Qur'an was thrust into the heart of the Prophet by an angel with his tongue. Allah explained that the Qur'an was revealed in clear and fluent Arabic and beautiful language style. In it there are also verses that challenge the polytheists of Mecca to make other verses like the verses of the Al-Qur'an, if they do not believe that the Al-Qur'an was sent down from Allah and was only made by Muhammad. Alone. However, they were unable to match it, not even by composing a single surah that was as eloquent and beautiful in style as the language of the Qur'an. Thus, there was no longer any reason for those Meccan polytheists to say that the Al-Qur'an was only Muhammad's creation. Strictly speaking, even though the Al-Qur'an was revealed in Arabic, namely their own language, they were unable to match its verses. If Muhammad could make the Koran, of course according to logic, they could also make it, because they are both Arabs and both speak Arabic. They understand the verses of the Al-Qur'an, know the beauty of the style of language, and believe that the Al-Qur'an does not originate from humans. They know very well the limits of human ability, but they still do not want to believe in it because of their arrogance and denial that are ingrained and rooted in them."
		   },
		   {
			"id": 3128,
			"surah": 26,
			"ayat": 196,
			"tafsir": "This verse explains that the Al-Qur'an which was revealed to the Prophet Muhammad has been implied in Allah's books which were revealed to His earlier messengers. In another verse Allah says: And (remember) when Isa son of Maryam said, \"O Children of Israel! Truly I am Allah's messenger to you, who confirmed the book (which came down) before me, namely the Torah and gave good tidings with an apostle who will come after me , whose name is Ahmad (Muhammad).\" (as-saff\/61: 6). In addition to the indications of the coming down of the Qur'an in the books revealed to the earlier apostles, there have also been prophecies about the Prophet Muhammad's coming. Even though the current Torah has been interfered with by human hands, some have been added, subtracted, and so on, but there are still verses that explain the coming of the Prophet Muhammad as the last messenger and bringing the perfect Shari'a. Allah's Word: (That is) those who follow the Messengers, Prophets who are unlettered (ill read and write) whose (names) they find written in the Torah and the Gospel that they have, who order them to do what is right and prevent what is wrong , and who makes lawful everything that is good for them and prohibits everything that is bad for them, and frees them from the burdens and shackles that were on them. As for those who believe in him, honor him, help him and follow the bright light that was sent down to him (the Qur'an), they are the lucky ones. (al-A'raf\/7: 157)"
		   },
		   {
			"id": 3129,
			"surah": 26,
			"ayat": 197,
			"tafsir": "This verse explains that apart from being reported in the Torah and the Bible, the arrival and prophethood of Muhammad was also confirmed by the Jewish scholars living in Medina at that time. They say that actually there are hints or statements about the Prophet Muhammad in the Torah and the Bible. Therefore, many Meccan polytheists who went to Medina met Jewish scholars to ask for news about the Prophet Muhammad. Ats-sa'labi explained from Ibn 'Abbas that the polytheists of Mecca once sent envoys to Medina to meet the Jewish priests to inquire about Muhammad. They replied, \"This is the time of its coming,\" and they named its characteristics."
		   },
		   {
			"id": 3130,
			"surah": 26,
			"ayat": 198,
			"tafsir": "In this verse it is explained that even though the proofs of Muhammad's prophethood have been explained in previous books, and this has been acknowledged by the Jewish scholars, and known by the polytheists of Mecca from the Jewish leaders, the polytheists will not believe, no matter what book or scripture is presented to them. It was as if Allah denounced their attitude by saying, \"We have sent down the Al-Qur'an in clear Arabic and a beautiful style of language to someone from the Arab nation, to be precise from the influential Quraysh tribe in Mecca, and they already know also from the Jews in Medina about Muhammad's prophethood, but they still do not believe. So if the Qur'an were revealed to someone from a non-Arab group who is not fluent in Arabic, but by Allah's will that person can recite it fluently to those polytheists of Mecca, they will not also believe in him. On the other hand, if something like that happens, it is an extraordinary incident.\" This verse is entertainment that can reassure and soothe Muhammad's heart which has been troubled by the attitude of polytheists who always challenge and deny his appeals."
		   },
		   {
			"id": 3131,
			"surah": 26,
			"ayat": 199,
			"tafsir": "In this verse it is explained that even though the proofs of Muhammad's prophethood have been explained in previous books, and this has been acknowledged by the Jewish scholars, and known by the polytheists of Mecca from the Jewish leaders, the polytheists will not believe, no matter what book or scripture is presented to them. It was as if Allah denounced their attitude by saying, \"We have sent down the Al-Qur'an in clear Arabic and a beautiful style of language to someone from the Arab nation, to be precise from the influential Quraysh tribe in Mecca, and they already know also from the Jews in Medina about Muhammad's prophethood, but they still do not believe. So if the Qur'an were revealed to someone from a non-Arab group who is not fluent in Arabic, but by Allah's will that person can recite it fluently to those polytheists of Mecca, they will not also believe in him. On the other hand, if something like that happens, it is an extraordinary incident.\" This verse is entertainment that can reassure and soothe Muhammad's heart which has been troubled by the attitude of polytheists who always challenge and deny his appeals."
		   },
		   {
			"id": 3132,
			"surah": 26,
			"ayat": 200,
			"tafsir": "This verse explains that Allah has instilled into the hearts of the Meccan polytheists who denied the ability to understand the verses of the Qur'an and feel the beauty of its style of language. Thus, they believe that the Qur'an came from God, not man-made. However, they deny the Qur'an, and deny the prophet who brought it. Their denial grew stronger, unshakable by anything. The desire to deny the Prophet and challenge him caused them to commit sinful acts, and they would only stop when the doom had befallen them. In another verse Allah says: And they deny it because of their tyranny and arrogance, even though their hearts believe in (the truth) of it. So see how the end of those who do damage. (an-Naml\/27: 14)."
		   },
		   {
			"id": 3133,
			"surah": 26,
			"ayat": 201,
			"tafsir": "This verse explains that Allah has instilled into the hearts of the Meccan polytheists who denied the ability to understand the verses of the Qur'an and feel the beauty of its style of language. Thus, they believe that the Qur'an came from God, not man-made. However, they deny the Qur'an, and deny the prophet who brought it. Their denial grew stronger, unshakable by anything. The desire to deny the Prophet and challenge him caused them to commit sinful acts, and they would only stop when the doom had befallen them. In another verse Allah says: And they deny it because of their tyranny and arrogance, even though their hearts believe in (the truth) of it. So see how the end of those who do damage. (an-Naml\/27: 14)."
		   },
		   {
			"id": 3134,
			"surah": 26,
			"ayat": 202,
			"tafsir": "In such circumstances, without them realizing it, doom will come to them suddenly and it is not known where it came from. Only then did they realize what they had done so far. They complain and hope that the coming of the punishment will be postponed, so that they can do good deeds, have faith, and obey Allah and His Messenger. Even though they already know that Allah will not grant their request, they try to ask, just to reduce the pain of punishment they are currently experiencing."
		   },
		   {
			"id": 3135,
			"surah": 26,
			"ayat": 203,
			"tafsir": "In such circumstances, without them realizing it, doom will come to them suddenly and it is not known where it came from. Only then did they realize what they had done so far. They complain and hope that the coming of the punishment will be postponed, so that they can do good deeds, have faith, and obey Allah and His Messenger. Even though they already know that Allah will not grant their request, they try to ask, just to reduce the pain of punishment they are currently experiencing."
		   },
		   {
			"id": 3136,
			"surah": 26,
			"ayat": 204,
			"tafsir": "This verse explains that the polytheists of Mecca once mocked the Prophet Muhammad by asking when the promised punishment would befall them. Their question was answered by Allah through this verse by saying, \"Do they ask to hasten the coming of the punishment that We promised?\" Actually they do not need to ask when the punishment that God threatens to come. They paid enough attention to the calamity that had befallen the ancient peoples who had denied the apostles sent by God to them. Even though the people of the past were a people who were valiant and had the ability to prosper their country, but none of them was able to escape Allah's punishment."
		   },
		   {
			"id": 3137,
			"surah": 26,
			"ayat": 205,
			"tafsir": "Ibn Abi Hatim quoted a history about the asbab nuzul of this verse from Abu Yahdham that the Messenger of Allah looked confused, then his friends asked him what was the reason for his confusion. Rasulullah replied that he saw his enemies after he died from his own people, then verse 205 of surahh asy-Syu'ara' was revealed, and the confusion of the Apostle finally disappeared. Through these verses, Allah warns the polytheists of Mecca about His punishment by saying, \"O polytheists, do you want to experience the fate of the previous peoples? They have been given the pleasures of life, bodily strength, and the ability to prosper their country. They think that the happiness, prosperity, and power obtained can prevent them from Allah's punishment. The reality is not so. They still feel a very painful punishment. That punishment is so painful as if they had never felt happiness and pleasure in the world.\" Allah says: On the day when they see the Day of Judgment (because of the great atmosphere), they feel as if they only (for a moment) stay (in the world) in the evening or morning. (an-Nazi'at\/79: 46)."
		   },
		   {
			"id": 3138,
			"surah": 26,
			"ayat": 206,
			"tafsir": "Ibn Abi Hatim quoted a history about the asbab nuzul of this verse from Abu Yahdham that the Messenger of Allah looked confused, then his friends asked him what was the reason for his confusion. Rasulullah replied that he saw his enemies after he died from his own people, then verse 205 of surahh asy-Syu'ara' was revealed, and the confusion of the Apostle finally disappeared. Through these verses, Allah warns the polytheists of Mecca about His punishment by saying, \"O polytheists, do you want to experience the fate of the previous peoples? They have been given the pleasures of life, bodily strength, and the ability to prosper their country. They think that the happiness, prosperity, and power obtained can prevent them from Allah's punishment. The reality is not so. They still feel a very painful punishment. That punishment is so painful as if they had never felt happiness and pleasure in the world.\" Allah says: On the day when they see the Day of Judgment (because of the great atmosphere), they feel as if they only (for a moment) stay (in the world) in the evening or morning. (an-Nazi'at\/79: 46)."
		   },
		   {
			"id": 3139,
			"surah": 26,
			"ayat": 207,
			"tafsir": "Ibn Abi Hatim quoted a history about the asbab nuzul of this verse from Abu Yahdham that the Messenger of Allah looked confused, then his friends asked him what was the reason for his confusion. Rasulullah replied that he saw his enemies after he died from his own people, then verse 205 of surahh asy-Syu'ara' was revealed, and the confusion of the Apostle finally disappeared. Through these verses, Allah warns the polytheists of Mecca about His punishment by saying, \"O polytheists, do you want to experience the fate of the previous peoples? They have been given the pleasures of life, bodily strength, and the ability to prosper their country. They think that the happiness, prosperity, and power obtained can prevent them from Allah's punishment. The reality is not so. They still feel a very painful punishment. That punishment is so painful as if they had never felt happiness and pleasure in the world.\" Allah says: On the day when they see the Day of Judgment (because of the great atmosphere), they feel as if they only (for a moment) stay (in the world) in the evening or morning. (an-Nazi'at\/79: 46)."
		   },
		   {
			"id": 3140,
			"surah": 26,
			"ayat": 208,
			"tafsir": "This verse explains that Allah will not destroy a city or country, except after the messengers were sent to them who delivered good news, warnings or promises, and threats. The apostles also conveyed lessons to them and showed them the straight path to safety and happiness. By sending the apostles, it means that Allah has shown compassion for His servants who want to follow the straight path that has been laid out. Those who reject the teachings of the apostles mean that they have wronged themselves and are willing to accept Allah's punishment. They are punished not because Allah is unjust to them, but because they deny the blessings He has bestowed upon them by worshiping something other than Him. Allah said: But We will not torment before We send an apostle. (al-Isra'\/17: 15). And the word of Allah: And your Lord will not destroy the lands, before He sends an apostle in his capital who reads Our verses to them; and never (also) did We destroy (the inhabitants of) the land; unless the people commit injustice. (al-Qasas\/28: 59)."
		   },
		   {
			"id": 3141,
			"surah": 26,
			"ayat": 209,
			"tafsir": "This verse explains that Allah will not destroy a city or country, except after the messengers were sent to them who delivered good news, warnings or promises, and threats. The apostles also conveyed lessons to them and showed them the straight path to safety and happiness. By sending the apostles, it means that Allah has shown compassion for His servants who want to follow the straight path that has been laid out. Those who reject the teachings of the apostles mean that they have wronged themselves and are willing to accept Allah's punishment. They are punished not because Allah is unjust to them, but because they deny the blessings He has bestowed upon them by worshiping something other than Him. Allah said: But We will not torment before We send an apostle. (al-Isra'\/17: 15). And the word of Allah: And your Lord will not destroy the lands, before He sends an apostle in his capital who reads Our verses to them; and never (also) did We destroy (the inhabitants of) the land; unless the people commit injustice. (al-Qasas\/28: 59)."
		   },
		   {
			"id": 3142,
			"surah": 26,
			"ayat": 210,
			"tafsir": "This verse refutes the accusations of the Meccan polytheists who said that the Prophet Muhammad was a sorcerer and fortune-teller. Allah says that the Qur'an is not a prediction or magic that comes from Satan who received and heard the words of an angel while conveying Allah's revelation to the Messenger of Allah. There are three things that show that the Qur'an is not from Satan, namely: 1. The contents of the Qur'an are contrary to Satan's will. Satan tries to get people to do things that will keep them away from Allah's guidance, while the Qur'an commands people to do what is right and prevent what is wrong. 2. Satan himself does not want to accept the Qur'an, let alone convey it to others. 3. Satan is kept away from hearing the Al-Qur'an which the Angel Gabriel delivered to Muhammad, or listening to the Al-Qur'an being read by God's servants because the Qur'an is guarded by Allah from satan."
		   },
		   {
			"id": 3143,
			"surah": 26,
			"ayat": 211,
			"tafsir": "This verse refutes the accusations of the Meccan polytheists who said that the Prophet Muhammad was a sorcerer and fortune-teller. Allah says that the Qur'an is not a prediction or magic that comes from Satan who received and heard the words of an angel while conveying Allah's revelation to the Messenger of Allah. There are three things that show that the Qur'an is not from Satan, namely: 1. The contents of the Qur'an are contrary to Satan's will. Satan tries to get people to do things that will keep them away from Allah's guidance, while the Qur'an commands people to do what is right and prevent what is wrong. 2. Satan himself does not want to accept the Qur'an, let alone convey it to others. 3. Satan is kept away from hearing the Al-Qur'an which the Angel Gabriel delivered to Muhammad, or listening to the Al-Qur'an being read by God's servants because the Qur'an is guarded by Allah from satan."
		   },
		   {
			"id": 3144,
			"surah": 26,
			"ayat": 212,
			"tafsir": "This verse refutes the accusations of the Meccan polytheists who said that the Prophet Muhammad was a sorcerer and fortune-teller. Allah says that the Qur'an is not a prediction or magic that comes from Satan who received and heard the words of an angel while conveying Allah's revelation to the Messenger of Allah. There are three things that show that the Qur'an is not from Satan, namely: 1. The contents of the Qur'an are contrary to Satan's will. Satan tries to get people to do things that will keep them away from Allah's guidance, while the Qur'an commands people to do what is right and prevent what is wrong. 2. Satan himself does not want to accept the Qur'an, let alone convey it to others. 3. Satan is kept away from hearing the Al-Qur'an which the Angel Gabriel delivered to Muhammad, or listening to the Al-Qur'an being read by God's servants because the Qur'an is guarded by Allah from satan."
		   },
		   {
			"id": 3145,
			"surah": 26,
			"ayat": 213,
			"tafsir": "This verse prohibits the Prophet Muhammad and his followers from worshiping gods other than Allah. They were ordered to worship God Almighty, sincere in obedience and submission to Him. Worshiping other gods besides worshiping Allah is the cause of a person being overwritten by the punishment of hell."
		   },
		   {
			"id": 3146,
			"surah": 26,
			"ayat": 214,
			"tafsir": "Allah ordered the Prophet Muhammad to convey religion to his relatives, and convey Allah's promises and threats to those who deny and associate partners with Him. Al-Bukhari, Muslim, and other narrators narrated from Abu Hurairah that he said, \"When this verse was revealed, the Messenger of Allah then summoned the Quraysh to gather on Mount Safa. Some of them came alone, and some sent their representatives After gathering, the Messenger of Allah preached, 'O Quraysh, save yourselves from the fires of hell. Indeed, I have no ability to harm you nor benefit you. O all Bani Ka'ab bin Lu'ai, save yourself from the fires of hell. then in fact I do not have the ability to harm you nor can I benefit you. Hi Bani Qusai, save yourself from the fires of hell. Truly I do not have the ability to harm you nor can I benefit you. Hi Bani Abdul Manaf, save yourself from the fires of hell. Truly I do not have the ability to harm you nor benefit you, know me can only contact my best friend in this world.\" This verse was revealed at the beginning of the arrival of Islam, when the Prophet Muhammad began to carry out his da'wah. He was first commanded by Allah to call his closest family. After that, it gradually appealed to the surrounding community, and finally to all humans."
		   },
		   {
			"id": 3147,
			"surah": 26,
			"ayat": 215,
			"tafsir": "Allah ordered the Prophet Muhammad to be friendly and humble to those who had just believed and accepted his call, never to be arrogant, so that their hearts would be attracted, the affection of fellow believers would be established, and they would also love him. Thus, preaching should always be done with humility and good ethics. Allah said: So by the grace of Allah you (Muhammad) treat them gently. If you had been tough and rough-hearted, they would have distanced themselves from around you. Therefore forgive them and ask forgiveness for them, and consult with them in this matter. Then, when you have made up your mind, put your trust in Allah. Indeed, Allah loves those who put their trust. (ali 'Imran \/ 3: 159)"
		   },
		   {
			"id": 3148,
			"surah": 26,
			"ayat": 216,
			"tafsir": "Allah gave instructions to the Prophet Muhammad in carrying out his da'wah, that is, if close family members and close relatives do not heed his call, let him tell them that he is free from their disobedience and disobedience. Allah threatens their attitudes and actions with a very painful punishment in return for their actions. No one can escape Allah's punishment on the Hereafter. Wealth, children and family are no longer of the slightest use to escape Allah's punishment. Only those who approach Allah with faith and good deeds can be spared from Allah's punishment."
		   },
		   {
			"id": 3149,
			"surah": 26,
			"ayat": 217,
			"tafsir": "Then Allah ordered the Prophet Muhammad if he had carried out Allah's order to convey His religion to the people of Mecca, but they did not heed the call, then he should put his trust and surrender all matters to Him. Only Allah is able to defend the Prophet from all the tricks of the enemy, and help him from all kinds of disasters that will befall him. Only Allah bestows mercy, and knows all the deeds and movements of His servants. Allah saw the Prophet when performing the Tahajud prayers, bowing, prostrating, and leading those who prostrate.\" The word \"sujud\" in this verse means those who pray. Allah calls those who pray with those who prostrate to show that it is at the time of prostration that a servant is closest to his Lord. Allah explained to the Prophet Muhammad that He is All-Hearing all his words and conversations, and All-Knowing of the Prophet's deeds, whether they are stated or not, and He knows all that is in his heart Allah Almighty gave him the fairest revenge."
		   },
		   {
			"id": 3150,
			"surah": 26,
			"ayat": 218,
			"tafsir": "Then Allah ordered the Prophet Muhammad if he had carried out Allah's order to convey His religion to the people of Mecca, but they did not heed the call, then he should put his trust and surrender all matters to Him. Only Allah is able to defend the Prophet from all the tricks of the enemy, and help him from all kinds of disasters that will befall him. Only Allah bestows mercy, and knows all the deeds and movements of His servants. Allah saw the Prophet when performing the Tahajud prayers, bowing, prostrating, and leading those who prostrate.\" The word \"sujud\" in this verse means those who pray. Allah calls those who pray with those who prostrate to show that it is at the time of prostration that a servant is closest to his Lord. Allah explained to the Prophet Muhammad that He is All-Hearing all his words and conversations, and All-Knowing of the Prophet's deeds, whether they are stated or not, and He knows all that is in his heart Allah Almighty gave him the fairest revenge."
		   },
		   {
			"id": 3151,
			"surah": 26,
			"ayat": 219,
			"tafsir": "Then Allah ordered the Prophet Muhammad if he had carried out Allah's order to convey His religion to the people of Mecca, but they did not heed the call, then he should put his trust and surrender all matters to Him. Only Allah is able to defend the Prophet from all the tricks of the enemy, and help him from all kinds of disasters that will befall him. Only Allah bestows mercy, and knows all the deeds and movements of His servants. Allah saw the Prophet when performing the Tahajud prayers, bowing, prostrating, and leading those who prostrate.\" The word \"sujud\" in this verse means those who pray. Allah calls those who pray with those who prostrate to show that it is at the time of prostration that a servant is closest to his Lord. Allah explained to the Prophet Muhammad that He is All-Hearing all his words and conversations, and All-Knowing of the Prophet's deeds, whether they are stated or not, and He knows all that is in his heart Allah Almighty gave him the fairest revenge."
		   },
		   {
			"id": 3152,
			"surah": 26,
			"ayat": 220,
			"tafsir": "Then Allah ordered the Prophet Muhammad if he had carried out Allah's order to convey His religion to the people of Mecca, but they did not heed the call, then he should put his trust and surrender all matters to Him. Only Allah is able to defend the Prophet from all the tricks of the enemy, and help him from all kinds of disasters that will befall him. Only Allah bestows mercy, and knows all the deeds and movements of His servants. Allah saw the Prophet when performing the Tahajud prayers, bowing, prostrating, and leading those who prostrate.\" The word \"sujud\" in this verse means those who pray. Allah calls those who pray with those who prostrate to show that it is at the time of prostration that a servant is closest to his Lord. Allah explained to the Prophet Muhammad that He is All-Hearing all his words and conversations, and All-Knowing of the Prophet's deeds, whether they are stated or not, and He knows all that is in his heart Allah Almighty gave him the fairest revenge."
		   },
		   {
			"id": 3153,
			"surah": 26,
			"ayat": 221,
			"tafsir": "Allah explains the customs and beliefs of the Jahiliyyah Arabs in the form of questions to humans so that they can judge by distinguishing between the truth of revelation and the lies of soothsayers. The question is: O people, will I declare to you all a news which if you know it will benefit you and purify your obedience and submission to Allah, in solving world problems, in distinguishing and judging the truth of Allah's saints and friends. satan's friend and to whom the devil goes back and forth trying to find and listen to the cry of some news. Then Allah Himself answered the question by stating how the devils convey whispers to the fortuneteller and how the fortuneteller conveys these whispers to people who come to him, namely: 1. The demons come repeatedly to people who like lied, lied, committed many sinful acts, and claimed to be a fortune teller. Satan whispers to them meaningless thoughts and fantasies that generally do not correspond to reality. 2. Satan also whispers to the fortune-tellers the information he is looking for, then they convey to people who come to them as a result of his predictions. The results of the prediction are believed to be true by those who believe in them. These verses seem to tell people to compare the process of conveying revelations to the Prophet Muhammad and its contents with the process of conveying the whispers of Satan to fortune-tellers, who then convey them to people who believe in the predictions. By comparing revelation and prophecy, they will clearly see the difference. Revelation is not just whispers that have no meaning, but is a guide for humans who want to live happily in this world and the hereafter. Revelation can be proven true, both in terms of logic, noble character, and in terms of customs, while predictions are not the case. Forecasting is not the same as the right mind, especially when viewed from the side of noble character and good habits. The one who conveys Allah's revelations is the Archangel Gabriel, and the recipient is the Prophet Muhammad, a person who can be trusted and known for good character. As for fortune-tellers, most of them are liars and liars, have no good morals, and are disliked by society, claiming to be fortune-tellers after receiving whispers from Satan. This verse rejects the accusations of the Meccan polytheists who allege that the Qur'an which was revealed to the Prophet Muhammad was not something true, but came from whispers of Satan. Allah cleared the good name of His Messenger from the various accusations that they fabricated, by stating that the Al-Qur'an which was revealed to Muhammad was Allah's revelation which was conveyed to him by the angel Gabriel, not from Satan. Visiting fortune-tellers is part of the customs and beliefs of the Jahiliyyah Arabs. Usually they go to fortune-tellers to ask about something they don't know, such as about the fate of the future, their daughter's mate, the estimated results of the business they will try, and so on. In addition, fortune-tellers sometimes functioned as healers treating all kinds of ailments. What fortune-tellers predict is usually not true. If what is predicted does happen, it is just a coincidence. The Messenger of Allah has warned that going to a fortune teller is a sin, as expressed in a hadith: Whoever goes to a fortune teller and asks something, his forty nights of prayer will not be accepted (History of Ahmad and Muslim from safiyyah). Whoever goes to a fortune teller or a shaman, and he believes in what is said, then he has disbelieved in what was revealed to the Prophet Muhammad. (History of Ahmad and al-hakim from Abu Hurairah)"
		   },
		   {
			"id": 3154,
			"surah": 26,
			"ayat": 222,
			"tafsir": "Allah explains the customs and beliefs of the Jahiliyyah Arabs in the form of questions to humans so that they can judge by distinguishing between the truth of revelation and the lies of soothsayers. The question is: O people, will I declare to you all a news which if you know it will benefit you and purify your obedience and submission to Allah, in solving world problems, in distinguishing and judging the truth of Allah's saints and friends. satan's friend and to whom the devil goes back and forth trying to find and listen to the cry of some news. Then Allah Himself answered the question by stating how the devils convey whispers to the fortuneteller and how the fortuneteller conveys these whispers to people who come to him, namely: 1. The demons come repeatedly to people who like lied, lied, committed many sinful acts, and claimed to be a fortune teller. Satan whispers to them meaningless thoughts and fantasies that generally do not correspond to reality. 2. Satan also whispers to the fortune-tellers the information he is looking for, then they convey to people who come to them as a result of his predictions. The results of the prediction are believed to be true by those who believe in them. These verses seem to tell people to compare the process of conveying revelations to the Prophet Muhammad and its contents with the process of conveying the whispers of Satan to fortune-tellers, who then convey them to people who believe in the predictions. By comparing revelation and prophecy, they will clearly see the difference. Revelation is not just whispers that have no meaning, but is a guide for humans who want to live happily in this world and the hereafter. Revelation can be proven true, both in terms of logic, noble character, and in terms of customs, while predictions are not the case. Forecasting is not the same as the right mind, especially when viewed from the side of noble character and good habits. The one who conveys Allah's revelations is the Archangel Gabriel, and the recipient is the Prophet Muhammad, a person who can be trusted and known for good character. As for fortune-tellers, most of them are liars and liars, have no good morals, and are disliked by society, claiming to be fortune-tellers after receiving whispers from Satan. This verse rejects the accusations of the Meccan polytheists who allege that the Qur'an which was revealed to the Prophet Muhammad was not something true, but came from whispers of Satan. Allah cleared the good name of His Messenger from the various accusations that they fabricated, by stating that the Al-Qur'an which was revealed to Muhammad was Allah's revelation which was conveyed to him by the angel Gabriel, not from Satan. Visiting fortune-tellers is part of the customs and beliefs of the Jahiliyyah Arabs. Usually they go to fortune-tellers to ask about something they don't know, such as about the fate of the future, their daughter's mate, the estimated results of the business they will try, and so on. In addition, fortune-tellers sometimes functioned as healers treating all kinds of ailments. What fortune-tellers predict is usually not true. If what is predicted does happen, it is just a coincidence. The Messenger of Allah has warned that going to a fortune teller is a sin, as expressed in a hadith: Whoever goes to a fortune teller and asks something, his forty nights of prayer will not be accepted (History of Ahmad and Muslim from safiyyah). Whoever goes to a fortune teller or a shaman, and he believes in what is said, then he has disbelieved in what was revealed to the Prophet Muhammad. (History of Ahmad and al-hakim from Abu Hurairah)"
		   },
		   {
			"id": 3155,
			"surah": 26,
			"ayat": 223,
			"tafsir": "Allah explains the customs and beliefs of the Jahiliyyah Arabs in the form of questions to humans so that they can judge by distinguishing between the truth of revelation and the lies of soothsayers. The question is: O people, will I declare to you all a news which if you know it will benefit you and purify your obedience and submission to Allah, in solving world problems, in distinguishing and judging the truth of Allah's saints and friends. satan's friend and to whom the devil goes back and forth trying to find and listen to the cry of some news. Then Allah Himself answered the question by stating how the devils convey whispers to the fortuneteller and how the fortuneteller conveys these whispers to people who come to him, namely: 1. The demons come repeatedly to people who like lied, lied, committed many sinful acts, and claimed to be a fortune teller. Satan whispers to them meaningless thoughts and fantasies that generally do not correspond to reality. 2. Satan also whispers to the fortune-tellers the information he is looking for, then they convey to people who come to them as a result of his predictions. The results of the prediction are believed to be true by those who believe in them. These verses seem to tell people to compare the process of conveying revelations to the Prophet Muhammad and its contents with the process of conveying the whispers of Satan to fortune-tellers, who then convey them to people who believe in the predictions. By comparing revelation and prophecy, they will clearly see the difference. Revelation is not just whispers that have no meaning, but is a guide for humans who want to live happily in this world and the hereafter. Revelation can be proven true, both in terms of logic, noble character, and in terms of customs, while predictions are not the case. Forecasting is not the same as the right mind, especially when viewed from the side of noble character and good habits. The one who conveys Allah's revelations is the Archangel Gabriel, and the recipient is the Prophet Muhammad, a person who can be trusted and known for good character. As for fortune-tellers, most of them are liars and liars, have no good morals, and are disliked by society, claiming to be fortune-tellers after receiving whispers from Satan. This verse rejects the accusations of the Meccan polytheists who allege that the Qur'an which was revealed to the Prophet Muhammad was not something true, but came from whispers of Satan. Allah cleared the good name of His Messenger from the various accusations that they fabricated, by stating that the Al-Qur'an which was revealed to Muhammad was Allah's revelation which was conveyed to him by the angel Gabriel, not from Satan. Visiting fortune-tellers is part of the customs and beliefs of the Jahiliyyah Arabs. Usually they go to fortune-tellers to ask about something they don't know, such as about the fate of the future, their daughter's mate, the estimated results of the business they will try, and so on. In addition, fortune-tellers sometimes functioned as healers treating all kinds of ailments. What fortune-tellers predict is usually not true. If what is predicted does happen, it is just a coincidence. The Messenger of Allah has warned that going to a fortune teller is a sin, as expressed in a hadith: Whoever goes to a fortune teller and asks something, his forty nights of prayer will not be accepted (History of Ahmad and Muslim from safiyyah). Whoever goes to a fortune teller or a shaman, and he believes in what is said, then he has disbelieved in what was revealed to the Prophet Muhammad. (History of Ahmad and al-hakim from Abu Hurairah)"
		   },
		   {
			"id": 3156,
			"surah": 26,
			"ayat": 224,
			"tafsir": "This verse explains that poets at that time were often followed by people who were astray and deviated from the straight path and tended to do destructive things. Whereas the followers of the Prophet Muhammad were not like that. They worship a lot, especially prayers and always be ascetic."
		   },
		   {
			"id": 3157,
			"surah": 26,
			"ayat": 225,
			"tafsir": "This verse explains the misguided paths that have been taken by poets in composing their poetry, namely: 1. The poets compose poetry without a clear purpose. Sometimes they praise something they once disapproved of, glorify something they once despised, and confess something they once denied the truth of. This proves that their goal in writing poetry is not to find the truth or to state something that is true. In compiling these verses, they only depended on imagination. The more their fantasies and dreams, the better the poetry they make. The poet's fallacy is only followed by misguided people, and will not be followed by people who like to seek the truth. 2. The poets often said what they did not. They suggest that humans are generous and generous, but they themselves are miserly and miserly. They often compose poems to offend other people's honor, such as criticizing, insulting, and so on, for any small reason. On the other hand, they often glorify and praise someone for small reasons. Such are the characteristics of poets who are reproached by God. However, there are also poets who are good-natured and quite knowledgeable. His poetry encourages the enthusiasm of others to do good, and contains wisdom, advice, and lessons. Among them is the poetry of Umayyah bin Abi as-salt, as follows: From 'Amr bin ash-Syirid, from his father, that he said, \"One day I took the Messenger of Allah on his back, so he asked me, 'Have you memorized some of the verses Umayyah bin Abi as-salt? I replied, 'Yes. The Messenger of Allah said, 'Read it immediately. So I recited one stanza. The Messenger of Allah said, 'Read it immediately. So I recited one more verse. The Messenger of Allah said, 'Continue. I continued until one hundred stanzas.\" (Muslim history) The Prophet's attitude towards Umayyah bin Abi as-salt's poetry shows that he liked poetry and poets, as long as the poet is a person who has morals, has lofty aspirations, and his poems contain many points of wisdom. Unlike the poets and poems whose characteristics are mentioned in the previous verses (verses 221-226). Such poets and poems were denounced and prohibited by the Prophet."
		   },
		   {
			"id": 3158,
			"surah": 26,
			"ayat": 226,
			"tafsir": "This verse explains the misguided paths that have been taken by poets in composing their poetry, namely: 1. The poets compose poetry without a clear purpose. Sometimes they praise something they once disapproved of, glorify something they once despised, and confess something they once denied the truth of. This proves that their goal in writing poetry is not to find the truth or to state something that is true. In compiling these verses, they only depended on imagination. The more their fantasies and dreams, the better the poetry they make. The poet's fallacy is only followed by misguided people, and will not be followed by people who like to seek the truth. 2. The poets often said what they did not. They suggest that humans are generous and generous, but they themselves are miserly and miserly. They often compose poems to offend other people's honor, such as criticizing, insulting, and so on, for any small reason. On the other hand, they often glorify and praise someone for small reasons. Such are the characteristics of poets who are reproached by God. However, there are also poets who are good-natured and quite knowledgeable. His poetry encourages the enthusiasm of others to do good, and contains wisdom, advice, and lessons. Among them is the poetry of Umayyah bin Abi as-salt, as follows: From 'Amr bin ash-Syirid, from his father, that he said, \"One day I took the Messenger of Allah on his back, so he asked me, 'Have you memorized some of the verses Umayyah bin Abi as-salt? I replied, 'Yes. The Messenger of Allah said, 'Read it immediately. So I recited one stanza. The Messenger of Allah said, 'Read it immediately. So I recited one more verse. The Messenger of Allah said, 'Continue. I continued until one hundred stanzas.\" (Muslim history) The Prophet's attitude towards Umayyah bin Abi as-salt's poetry shows that he liked poetry and poets, as long as the poet is a person who has morals, has lofty aspirations, and his poems contain many points of wisdom. Unlike the poets and poems whose characteristics are mentioned in the previous verses (verses 221-226). Such poets and poems were denounced and prohibited by the Prophet."
		   },
		   {
			"id": 3159,
			"surah": 26,
			"ayat": 227,
			"tafsir": "This verse explains that good and useful poetry and poets are those who have the following characteristics: 1. Faith in Allah. 2. Do good deeds. 3. Mention and glorify the name of Allah, thus increasing the stability of his faith in His greatness and oneness. 4. Encouraging believers to wage jihad, upholding Allah's religion, escaping from the persecution of those who are hostile to them and His religion. It was narrated by Ibn Jarir ath-Tabari and Ibn Abi Syaibah that when the verse above was revealed, Hassan bin Scythe, 'Abdullah bin Rawahah, and Ka'ab bin Malik came to the Prophet. They are in a state of crying and feeling sorry for themselves because they are among the poets. So the Prophet recited this verse (asy-Syu'ara'\/26: 227) to them. Since the beginning of this surahh, Allah has explained the arguments of reason about His power and greatness through the stories of the previous prophets and their people who were able to comfort the Prophet who was upset because of the attitude of his people. The stories also explain the proofs of the truth of the prophets sent by Him, the difference between fortunetellers and the Messenger of Allah, comparing bad poets and poets to praiseworthy poets and poets. This surahh closes with a stern warning addressed to those who oppose Allah's religion that they will one day know their place of return, which is hell, the pain of which is unimaginably painful."
		   }
	]
}
