{
	"tafseer": [
		{
			"id": 2856,
			"surah": 25,
			"ayat": 1,
			"tafsir": "In this verse Allah praises Himself by sending down the Qur'an to the Prophet Muhammad, whom he calls \"His servant\" to serve as a warning to the universe (humans and jinns). With praise for Himself because He sent down the Qur'an to the Prophet Muhammad, it can be understood that the Qur'an is a book that is very important and has a very high value in the sight of Allah, because the Al-Qur'an is a guide and life guidelines for His creatures that He glorifies, namely humans, while other creations both in the heavens and on earth are for the benefit of humans themselves. In this verse Allah does not mention the Al-Qur'an but al-Furqan because the Qur'an is the difference between right and wrong between guidance and misguidance. The Qur'an was revealed to all mankind during the time of the Prophet Muhammad and afterward until the Day of Judgment, because the prophets before Muhammad saw were only sent to his people while the Prophet Muhammad was sent to humans at all times and in all places. Likewise, Allah does not mention the name of Muhammad or His Messenger but calls \"His servant\" because he wants to glorify Him with that title. A human being who truly enslaves himself to Allah confesses His oneness and power, obeys and obediently carries out His commands always makes His guidance the guideline of his life, loves Allah essentially more than anything in this world, that is the true servant of Allah, servant of Allah contained in this surahh al-Furqan. In other verses Allah mentions the Prophet Muhammad with the title \"His servant\" as His words: Glory be to (Allah), who has traveled His servant (Muhammad) at night from the Grand Mosque to the Aqsa Mosque which We have blessed around him . (al-Isra'\/17: 1) And His word: And verily when the servant of Allah (Muhammad) stood worshiping Him (carrying out prayers), they (jins) were crowding around him. (al-Jin\/72: 19) And His words: Praise be to Allah who has sent down the Book (the Qur'an) to His servants and He has not made it crooked. (al-Kahf\/18: 1) After Allah mentions Himself Who sent down al-Furqan to His servants, then He characterizes Himself that He is the owner of the heavens and the earth and has power over both, sends and manages it according to the wisdom of wisdom- It is in accordance with the interests and benefits of each of His creations. Allah also stated that He had no children as alleged by the Christians, the Jews and the polytheists, as stated in His word: And the Jews said, \"Uzair son of Allah,\" and the Christians said, \" Christ the son of God.\" Those were the words that came out of their mouths. They imitated the words of the former disbelievers. Allah cursed them; how did they turn around? (at-Taubah\/9: 30) And His words: So ask (Muhammad) to them (the Meccans), \"Are the daughters for your Lord while they are the sons?\" or did We create angels in the form of women while they witnessed (it)? Remember, among their lies they actually said, \"God had a son.\" And really, they are total liars. Did He (Allah) choose daughters over sons? (as-shaffat\/37: 149-153) Furthermore, Allah stated again that He is not partnered with others in His power, only He is worthy of worship and it is Him alone that humans must ask for something, not as done by humans who have gone astray who worship His creatures like worshiping humans, idols and other objects. Then Allah also stated that He is the Creator of everything according to His wisdom and arranges it according to His will and Knowledge. In short, everything in nature, both in the heavens and on earth, is His creation. He is the Creator, there is no Creator besides Him, there is no partner for Him who is worthy of worship, all are under His rule and subject to the sunnah and regulations that He has established. Never imagine or cross the minds of humans that He has children or has allies."
		   },
		   {
			"id": 2857,
			"surah": 25,
			"ayat": 2,
			"tafsir": "In this verse Allah praises Himself by sending down the Qur'an to the Prophet Muhammad, whom he calls \"His servant\" to serve as a warning to the universe (humans and jinns). With praise for Himself because He sent down the Qur'an to the Prophet Muhammad, it can be understood that the Qur'an is a book that is very important and has a very high value in the sight of Allah, because the Al-Qur'an is a guide and life guidelines for His creatures that He glorifies, namely humans, while other creations both in the heavens and on earth are for the benefit of humans themselves. In this verse Allah does not mention the Al-Qur'an but al-Furqan because the Qur'an is the difference between right and wrong between guidance and misguidance. The Qur'an was revealed to all mankind during the time of the Prophet Muhammad and afterward until the Day of Judgment, because the prophets before Muhammad saw were only sent to his people while the Prophet Muhammad was sent to humans at all times and in all places. Likewise, Allah does not mention the name of Muhammad or His Messenger but calls \"His servant\" because he wants to glorify Him with that title. A human being who truly enslaves himself to Allah confesses His oneness and power, obeys and obediently carries out His commands always makes His guidance the guideline of his life, loves Allah essentially more than anything in this world, that is the true servant of Allah, servant of Allah contained in this surahh al-Furqan. In other verses Allah mentions the Prophet Muhammad with the title \"His servant\" as His words: Glory be to (Allah), who has traveled His servant (Muhammad) at night from the Grand Mosque to the Aqsa Mosque which We have blessed around him . (al-Isra'\/17: 1) And His word: And verily when the servant of Allah (Muhammad) stood worshiping Him (carrying out prayers), they (jins) were crowding around him. (al-Jin\/72: 19) And His words: Praise be to Allah who has sent down the Book (the Qur'an) to His servants and He has not made it crooked. (al-Kahf\/18: 1) After Allah mentions Himself Who sent down al-Furqan to His servants, then He characterizes Himself that He is the owner of the heavens and the earth and has power over both, sends and manages it according to the wisdom of wisdom- It is in accordance with the interests and benefits of each of His creations. Allah also stated that He had no children as alleged by the Christians, the Jews and the polytheists, as stated in His word: And the Jews said, \"Uzair son of Allah,\" and the Christians said, \" Christ the son of God.\" Those were the words that came out of their mouths. They imitated the words of the former disbelievers. Allah cursed them; how did they turn around? (at-Taubah\/9: 30) And His words: So ask (Muhammad) to them (the Meccans), \"Are the daughters for your Lord while they are the sons?\" or did We create angels in the form of women while they witnessed (it)? Remember, among their lies they actually said, \"God had a son.\" And really, they are total liars. Did He (Allah) choose daughters over sons? (as-shaffat\/37: 149-153) Furthermore, Allah stated again that He is not partnered with others in His power, only He is worthy of worship and it is Him alone that humans must ask for something, not as done by humans who have gone astray who worship His creatures like worshiping humans, idols and other objects. Then Allah also stated that He is the Creator of everything according to His wisdom and arranges it according to His will and Knowledge. In short, everything in nature, both in the heavens and on earth, is His creation. He is the Creator, there is no Creator besides Him, there is no partner for Him who is worthy of worship, all are under His rule and subject to the sunnah and regulations that He has established. Never imagine or cross the minds of humans that He has children or has allies."
		   },
		   {
			"id": 2858,
			"surah": 25,
			"ayat": 3,
			"tafsir": "Allah explains in this verse that the idols worshiped by disbelievers do not have the slightest meaning, and do not have the slightest attribute of perfection, and even the characteristics possessed by idols are merely the characteristics of sheer deficiencies. It is very strange the way of thinking of people who make idols as gods, worship them and ask for help from them. Among the disgraceful characteristics of idols are: a. These idols cannot create anything, while the one who deserves to be worshiped is Allah, the Creator. b. The idols themselves were made by the worshippers. How stupid are humans who worship their own creations that are lower in degree than themselves. c. The idols are powerless and do not have the energy to carry out an action, cannot bring any benefit to themselves, let alone to their worshipers, cannot defend themselves, let alone to defend and help others. Of course, there is no point in worshiping images of such a nature. d. These idols cannot turn on or off or gather people to account for their deeds. As for himself, the idol cannot give life because it turns out that he is still an inanimate object, let alone giving life to other people. These are the characteristics of the idols worshiped by the polytheists of Mecca. Why don't they worship Allah who has the perfect nature of the One and Only God, Almighty over all things."
		   },
		   {
			"id": 2859,
			"surah": 25,
			"ayat": 4,
			"tafsir": "The disbelievers say that the Qur'an is not a book sent down by Allah. The Al-Qur'an is just a lie concocted by Muhammad and in making the Qur'an he was assisted by a group of people of the book who have believed. According to them, Muhammad always met with the group of people of the book and they taught him the stories about the previous peoples, then Muhammad compiled the stories in Arabic with good editorial composition. It was narrated that these verses were revealed about Nadr bin al-Haris and the people who helped Muhammad were Addas the slave Khuwatih bin Abdul Uzza, Yasar slave al-A'la bin al-Khadrami and Abu Fukaihah ar-Rumi. Originally they were adherents of the Jewish religion who were good at reading the Torah and told many stories about the history of the ancient people. Then they converted to Islam and had a lot of contact with the Prophet Muhammad. That is why Nadr bin Haris dared to make these false accusations. So Allah rejected the accusation and said that those who made the false accusations were unjust and lied. It is clear that the accusation is fabricated because the Qur'an itself with its verses has challenged the Arabs to make a surahh that is as fasahah and balagah as a surah from the Qur'an. If they don't succeed, surely the Qur'an was not made by Muhammad but was really a revelation from Allah. It is mentioned in His word: And if you doubt (the Qur'an) that We sent down to Our servant (Muhammad), then make a surah like it and invite your helpers besides Allah, if you are people of truth . (al-Baqarah\/2: 23) Since none of them can answer the challenge even though they have tried their best, it is true that the Qur'an is not man-made but a revelation from Allah. But since there is no way for them to go against the Qur'an, they look for various excuses to belie it and they make reports like the one mentioned above."
		   },
		   {
			"id": 2860,
			"surah": 25,
			"ayat": 5,
			"tafsir": "The disbelievers said that the Qur'an was just the tales of the ancients which they wrote down in books, and the Prophet Muhammad asked the Jews to copy and read to him so that he could memorize them morning and evening. After memorizing it, he read it to his friends and followers as the Qur'an that descended from the sky. How dare they invent something that never happened to the Prophet Muhammad. If so, surely his friends would know about it and surely they would no longer believe in him. Even though the Prophet Muhammad was known to them since his childhood as the most trusted, honest and never lying. Is it possible that someone who has been like this since childhood will deceive those who are loyal to him and preach nonsense. (6) Because the disbelievers made unreasonable accusations too far, while they had been challenged in such a way and could not answer the challenge, Allah ordered the Prophet Muhammad to declare to them emphatically that the Qur'an and it is not what they accuse. The Qur'an was truly sent down by Allah who knows all the secrets hidden in the heavens and the earth. Therefore, there are in it Shari'a laws and regulations that are very good and in a language that has a very high literary value so that none of them can imitate it. The Qur'an contains many things that cannot be known except by Allah, the Most Knowledgeable. Indeed, Allah, who sent down the Qur'an, is Most Forgiving and Merciful to His servants. Actually they should be grateful and grateful for His mercy and compassion for them by sending down the Qur'an as a guide and guide them to the right path. But they remained disobedient and disobedient and opposed His teachings. Had it not been for His mercy and compassion, a painful punishment would have been inflicted upon them."
		   },
		   {
			"id": 2861,
			"surah": 25,
			"ayat": 6,
			"tafsir": "Because the disbelievers made unreasonable accusations too far, while they had been challenged in such a way and could not answer the challenge, Allah ordered the Prophet Muhammad to declare to them emphatically that the Qur'an is not as they accuse. The Qur'an was truly sent down by Allah who knows all the secrets hidden in the heavens and the earth. Therefore, there are in it Shari'a laws and regulations that are very good and in a language that has a very high literary value so that none of them can imitate it. The Qur'an contains many things that cannot be known except by Allah, the Most Knowledgeable. Indeed, Allah, who sent down the Qur'an, is Most Forgiving and Merciful to His servants. Actually they should be grateful and grateful for His mercy and compassion for them by sending down the Qur'an as a guide and guide them to the right path. But they remained disobedient and disobedient and opposed His teachings. Had it not been for His mercy and compassion, a painful punishment would have been inflicted upon them."
		   },
		   {
			"id": 2862,
			"surah": 25,
			"ayat": 7,
			"tafsir": "The disbelievers say that it is impossible for Muhammad to become an Apostle because there are no signs in him that he was appointed as an Apostle. He is just an ordinary person like them, even if you look at how his life has increased, it is clear that he lied, preaching himself as an Apostle because he is the same as them, even as a human, he is lower in position and poorer than them. These criticisms can be summed up as follows: 1. They said, \"Why did Muhammad eat and drink like an ordinary human and there is not the slightest advantage over us, it would be impossible for him to have a relationship with God. People who can relate to God are only people -people whose souls are pure and high so they don't care about eating and drinking anymore.\" 2. Why wasn't an angel sent down with him who could prove his apostleship and help him in giving warnings and instructions to people. 3. Why did Muhammad go to the market to make a living like ordinary people? Where lies the advantage that he was appointed by Allah as an Apostle. 4. Why doesn't Allah just send down treasures from the sky to him so that he can devote all his attention to preaching to spread his religion, so that he no longer has to go to the market to buy and sell to make a living. 5. Or why not give him a large garden whose produce can cover his needs. After they gave up because all their offers were rejected by Muhammad, there was no other way for them except to accuse him of being a person who was enchanted so that he could no longer distinguish between good and bad. According to them people like that do not deserve to be trusted let alone to be appointed by Allah as a Prophet."
		   },
		   {
			"id": 2863,
			"surah": 25,
			"ayat": 8,
			"tafsir": "The disbelievers say that it is impossible for Muhammad to become an Apostle because there are no signs in him that he was appointed as an Apostle. He is just an ordinary person like them, even if you look at how his life has increased, it is clear that he lied, preaching himself as an Apostle because he is the same as them, even as a human, he is lower in position and poorer than them. These criticisms can be summed up as follows: 1. They said, \"Why did Muhammad eat and drink like an ordinary human and there is not the slightest advantage over us, it would be impossible for him to have a relationship with God. People who can relate to God are only people -people whose souls are pure and high so they don't care about eating and drinking anymore.\" 2. Why wasn't an angel sent down with him who could prove his apostleship and help him in giving warnings and instructions to people. 3. Why did Muhammad go to the market to make a living like ordinary people? Where lies the advantage that he was appointed by Allah as an Apostle. 4. Why doesn't Allah just send down treasures from the sky to him so that he can devote all his attention to preaching to spread his religion, so that he no longer has to go to the market to buy and sell to make a living. 5. Or why not give him a large garden whose produce can cover his needs. After they gave up because all their offers were rejected by Muhammad, there was no other way for them except to accuse him of being a person who was enchanted so that he could no longer distinguish between good and bad. According to them people like that do not deserve to be trusted let alone to be appointed by Allah as a Prophet."
		   },
		   {
			"id": 2864,
			"surah": 25,
			"ayat": 9,
			"tafsir": "In this verse Allah ordered the Prophet and his people to pay attention to the criticisms raised by the disbelievers. By paying attention to these criticisms it is clear that they have run out of reasons and explanations to reject the Prophet Muhammad's call to monotheism and abandon their misleading worships. They were unable to reject the reasons and evidence put forward by the Prophet Muhammad in the form of verses from the Qur'an and others. They are unable to answer the challenge of making one surah that has the same value as one surah in the Qur'an, both in terms of content, meaning and literature. Therefore they shifted their criticism to the Prophet Muhammad himself. This happens a lot to people whose hujjah has been defeated. For this reason, Allah did not immediately answer these criticisms and ordered to show them so that it would be clear to everyone that they had been thrown into a corner because they had indeed strayed from the right path."
		   },
		   {
			"id": 2865,
			"surah": 25,
			"ayat": 10,
			"tafsir": "As entertainment for the Prophet who was always humiliated and humiliated by the disbelievers, Allah explained that if He wanted, He would surely give him gardens that were better than what the infidels asked for and would also give him palaces. the most majestic and beautiful. That is very easy for Allah but that is not what He wants. Allah wants the Messenger to carry His message as an ordinary human being who becomes a follow-up and role model for his people in fighting for an ideal, fighting for truth and exalting God's sentence. Apart from this very hard struggle, the Prophet had to think about his personal needs and wishes. That's how an Apostle should be an example and role model. If the Prophet Muhammad was a rich man who had gardens and palaces and abundant treasuries, surely the value of his struggle would not be that great and certainly would not be emulated by his followers in the future. What is the meaning of a palace, what is the meaning of gardens and what is the meaning of an abundant treasury when one is dealing with His Creator, the Almighty, the Most Rich and the Most Mighty? Thus the Prophet Muhammad was pleased with his situation. even though he is poor, weak and receives various insults and ridicule from his people, he is happy and happy because he is carrying out a holy task from his Lord. Once he said, \"O my Lord, whatever happens to me and no matter how hard my suffering is, I will still be happy as long as You are pleased with me.\""
		   },
		   {
			"id": 2866,
			"surah": 25,
			"ayat": 11,
			"tafsir": "In this verse, Allah confirms again that those disbelievers have strayed far from the true path, and they even deny the coming of the Day of Judgment, the Day of Judgment in which all human deeds will be rewarded fairly. Good deeds are rewarded with multiple rewards, bad deeds are rewarded with a painful punishment. They belie the Day of Judgment so that they act arbitrarily against the weak, commit injustice, therefore Allah threatens them with the blazing fires of hell due to their denial and disobedience, due to their evil deeds in this world."
		   },
		   {
			"id": 2867,
			"surah": 25,
			"ayat": 12,
			"tafsir": "When those disbelievers have been herded into hell, it is as if hell is watching them from afar, a roar is heard with anger at the sight of those infidels, as if hell is a hungry lion seeing its prey approaching it. Ibn Munzir and Ibn Jarir narrated that Ubaid bin Umair said, \"Indeed, Hell's voice roared so that the angels and prophets trembled at the sound of their joints, so that Prophet Abraham fell to his knees and said, \"O my Lord, there is nothing I ask for today except my safety.\" You can imagine how terrible the situation was at that time and how terrible the torment they would receive and how hard the suffering they would feel at that time."
		   },
		   {
			"id": 2868,
			"surah": 25,
			"ayat": 13,
			"tafsir": "If they are thrown into a narrow place in hell with their hands shackled there they will exclaim \"Woe to me! Why did I previously ignore the guidance that Allah sent down through His Messenger, why did I argue and reject it? I really am a wretched person. .\""
		   },
		   {
			"id": 2869,
			"surah": 25,
			"ayat": 14,
			"tafsir": "At that time it was said to them not to say that word (woe to me) just once. Say that word many times because what they see and experience is only one kind of torment that will be inflicted on them. Many more kinds of torment they will suffer. Therefore, shout out many times, indeed they will be overtaken by terrible and great torments."
		   },
		   {
			"id": 2870,
			"surah": 25,
			"ayat": 15,
			"tafsir": "Allah commanded the Prophet Muhammad to tell the disbelievers whether such great and terrible punishment is better than heaven which is full of favors and mercy which is provided for the believers who are pious. They live in it forever. Heaven was made for them because they believe in Allah and His Messenger and obey and obediently carry out His commands and stay away from all His prohibitions."
		   },
		   {
			"id": 2871,
			"surah": 25,
			"ayat": 16,
			"tafsir": "In that heaven they are given what they ask for and they want in the form of clothing, food and drink and all the pleasures that humans in this world cannot imagine. Apart from that they are always in the pleasure of the Divine and this is a spiritual blessing that is incomparable, because it is the pleasure of the Divine that creates a sense of serenity and happiness in the heart of every servant of Allah as stated in His word. Allah says, \"This is when the righteous will benefit from their righteousness. They will have gardens beneath which rivers flow, they will abide therein forever. Allah is pleased with them and they are pleased with Him. That is a great victory. \" (al-Ma'idah\/5: 119) Thus Allah's promise to His faithful and pious servants and Allah's promise will certainly be fulfilled."
		   },
		   {
			"id": 2872,
			"surah": 25,
			"ayat": 17,
			"tafsir": "On the Day of Judgment the polytheists will be gathered together with their idols. Then God put questions to the idols. Is it true that they formerly in the world ordered them to worship it so that they have strayed from the true path, associating partners with Allah with that idol so that they deny the teachings of Allah and the teachings of His Messenger. Among the idols worshiped by the disbelievers included several angels, Prophet Isa and Uzair. They were very surprised and amazed to hear these questions because they never ordered people to worship them, in fact they always called for monotheism, worshiping Allah without associating Him with anything. In this verse, it is mentioned that Allah's question was specifically presented to Prophet Isa, namely His words: And (remember) when Allah said, \"O Isa, son of Maryam! Were you the one who said to people, \"Take me and my mother as two gods besides Allah? \" (Isa) replied, \"Glory to You, it is not fitting for me to say what is not mine. If I had said it, You would have known it. You know what is in me and I do not know what is in You. Indeed, You are the Knower of all that is unseen.\" (al-Ma'idah \/ 5: 116)"
		   },
		   {
			"id": 2873,
			"surah": 25,
			"ayat": 18,
			"tafsir": "Spontaneously they answered God's questions that they did not expect to be raised in the slightest. They answered in unison, \"Glory to You, O our Lord, it is not proper for us to take protection other than You. This is our belief because no one has the right to be worshiped and taken as a protector except you. How can we order others to worship besides You while that is the case?\" contrary to our beliefs and faith. Maybe You, O Lord, we have bestowed on them Your favors and mercy so that they will be grateful to You, but they use these favors and graces to satisfy their lusts, so that they are immersed in pleasures and delights. Finally they forget You and fall into the abyss of error and cannot be helped anymore and are included in the class of those who perish.\""
		   },
		   {
			"id": 2874,
			"surah": 25,
			"ayat": 19,
			"tafsir": "Allah directs His word to those polytheists. You have heard the answers of the people you worship. It is clear now that it was not they who led you astray, they never commanded you to worship them. So it is you who are inventing worship besides Me. Now you will never escape My torment and no one can help you. You have wronged yourselves by inventing worship besides Me, and the fate of those who have wronged themselves by worshiping other than Me, I will surely enter into a painful and severe torment."
		   },
		   {
			"id": 2875,
			"surah": 25,
			"ayat": 20,
			"tafsir": "In this verse Allah explains to the Prophet Muhammad that the previous messengers also ate and drank like him. The criticisms of the disbelievers against him really hurt Muhammad's heart, these criticisms were not merely criticisms, they even contained insults that greatly demeaned him even though he was a Messenger who was glorified by Allah. So to console and relieve the inner pressure that the Prophet Muhammad was suffering from because of the criticism and humiliation, Allah revealed to him that He had never sent a messenger before as desired by the Meccan infidels. All the Apostles he sent were human beings who were not free from their human nature, but needed food and drink, still trying to make ends meet in accordance with His words in other verses. And We did not send (messengers) before you (Muhammad), but men whom We gave revelations to them, so ask those who are knowledgeable, if you do not know. And We did not make them (the apostles) a body that does not eat food and they do not (also) live eternally. (al-Anbiya'\/21: 7-8) So the difference between humans as messengers and humans in general lies in personal excellence, high morals, purity of heart and sincerity in carrying out their duties, because of that Allah's revelation was sent down to him and strengthened by miracles which no human can match it let alone defeat it. So the ridicule and criticism of the disbelievers was very far from its target, it was not natural for the Prophet Muhammad to be hurled at him. If they really want to overturn the truth they bring, then they shouldn't come up with such criticisms. They have been challenged to match the miracle given to them by Allah which is to make just one short surahh that is equal in value to the short surah of the Qur'an. But they are powerless and unable to make it even though they are already included in the class of people who are smart and have high literature. Only hatred and envy had darkened their consciences and the fear of losing influence and position had filled them with anger. Because of that they are still challenging even though in their hearts they have realized their mistake. Then Allah also explained that humans are tested with various tests. Each human being is given the freedom to decide whether he will be steadfast and patient in facing the test or will he turn away from the truth because he cannot bear the anger and envy in his heart. Allah made some people as Prophets and Messengers, bearers of His Lord's message, some others He made kings and rulers who ruled over other humans, some others He made rich and strong, poor and weak and so on. People who use their minds and minds, especially those who believe will not be affected by differences in levels, degrees, wealth and position, but they will still accept the right and reject the wrong regardless of where the truth comes from, whether the truth comes from a head of state or a minister or from a lowly person has no influence whatsoever. Ali bin Abi Talib once said, \"Pay attention to what is said and do not pay attention to who is saying it.\" The poor are tested for their fortitude in the face of their deprivation, unlike the rich who can enjoy various kinds of physical pleasures with their wealth. The Meccan infidels were tested for the purity of their hearts by giving the gift of the apostleship to the Prophet Muhammad, while he was an ordinary person among them, not from rich people or from a clan leader who had great influence. All humans are tested for their mental strength in the face of differences and gaps between various groups in society. Whoever wins in the face of the test is the one who will get the happiness of life both in this world and in the hereafter. In a hadith narrated by Imam Muslim, Rasulullah SAW said: \"Look at people who are lower in rank than you, and don't look at people who are higher than you, because looking at people who are higher will lead you to lower the value of the favors that Allah has bestowed. to you.\" (Muslim history) Such is the test that Allah gives to His servants, and He knows best which of His servants is steadfast and patient in facing the test so that he is among those who pass and win. He will give the best possible reward to the winners and will inflict torment on the losers who because of their impatience and because of their arrogance have disobeyed the favors He has given them."
		   },
		   {
			"id": 2876,
			"surah": 25,
			"ayat": 21,
			"tafsir": "People who do not believe in the resurrection or deny the Day of Judgment, where they will be brought before Allah to be judged for all their deeds in the world, with arrogance ask why angels were not sent down to them as witnesses to the truth of Muhammad as a prophet, to dispel doubts. them about the truth of the revelation revealed to him. If it is difficult to implement, why don't they just see God who will explain to them that Muhammad was really sent by Him to deliver good news and give a warning. If that happened, they said they would believe in Muhammad. Such words are nothing but because of their own arrogance, and because of their tyranny by denying a messenger of God. They completely ignored the real miracles that the Prophet had shown them. Any reasonable person would be astonished to hear their words and regard them as the words of an unreasonable person. If Allah grants that wish, they still will not believe in Allah and His Messenger, as stated in the word of Allah: And even though We really send down angels to them, and people who have died speak to them and We collect them (also) in before them everything (that they desire), they will not also believe, unless Allah wills. But most of them do not know (the meaning of truth). (al-An'am\/6: 111) 21. This verse explains another reason made up by the polytheists of Mecca because of their reluctance to believe in the Prophet Muhammad. And those who do not expect to meet Us in the Hereafter because of their denial of the existence of the Last Day, or because of their fear of it, they say, \"Why are not the angels sent down to us in a manifest form, who inform us about the truth of the Prophet Muhammad, or why do we not see our Lord? with our eyes which also tell us about the truth of the Prophet Muhammad.\" These requests are clearly far-fetched, the same as what the Children of Israel did before. This clearly comes from their hearts full of envy. Indeed, they have been arrogant because they are seduced by their desires. They think that they are more noble, either because of their wealth or their position in society. And they really have exceeded the limit in committing tyranny. Thus if the heart has been covered by disbelief, all the truth that exists in front, even though it was already brightly lit, they were not ignored at all."
		   },
		   {
			"id": 2877,
			"surah": 25,
			"ayat": 22,
			"tafsir": "This verse describes the condition of disbelievers and polytheists when they meet angels in the afterlife. The angels they want as messengers in this world, or as witnesses of the truth of Muhammad's prophethood, they will meet in the afterlife. However, the meeting was not as they expected because they would not hear any good news from the angels, either forgiveness from their sins, or orders to enter heaven. They only hear words that are very hurtful, namely hijran mahjuran, which means \"(heaven) is unlawful and unlawful for them\". The angel's speech was considered very painful, because Arabs usually say it when they get into trouble. As for the believers, they are welcomed by the angels who come to meet them and give them the good news of entering heaven. This is described in the word of God: Indeed, those who say, \"Our Lord is Allah,\" then they strengthen their stand, then the angels will come down to them (saying), \"Do not be afraid and do not grieve ; and be happy with (acquiring) the paradise that has been promised to you.\" (Fussilat\/41: 30)"
		   },
		   {
			"id": 2878,
			"surah": 25,
			"ayat": 23,
			"tafsir": "In this verse, Allah explains the causes of the misfortunes and losses of the disbelievers. Allah will show all the good deeds they have done while living in the world, such as friendship, helping people who are suffering, giving donations to relieve natural disasters, providing assistance to hospitals and orphans, freeing or redeeming prisoners, and so on. No matter how good they are, they will not get anything in return from Allah. They can only look at the goodness without being able to benefit in the slightest. Their goodness is then made by Allah like dust flying in the sky because it is not based on true faith in Allah. They could only sit pensively filled with regret. That is what they feel as a result of their disbelief and pride."
		   },
		   {
			"id": 2879,
			"surah": 25,
			"ayat": 24,
			"tafsir": "In contrast to the fate of the people mentioned above, those who believe become residents of heaven in the hereafter. They get a place to live that is much better than the residence of the polytheists in the world which they always make a symbol of grandeur and luxury. Heaven masters' residence was the most comfortable resting place. The pleasures in this world are only temporary because they can only be felt during one's life in this world and pleasures can be deceiving, as stated in the word of God. Every soul shall taste death. And only on the Day of Judgment will your reward be given in full. Whoever is kept away from hell and put into heaven, indeed, he will gain victory. The life of the world is but deceptive pleasure. (ali 'Imran\/3: 185)."
		   },
		   {
			"id": 2880,
			"surah": 25,
			"ayat": 25,
			"tafsir": "In this verse, Allah ordered Muhammad to explain to his people the enormity of the Day of Judgment. At that time, the sky will split open, and all the celestial bodies that are in it will be destroyed like flying mist, due to the collision of the planets and stars which no longer orbit according to their respective provisions, as explained in the word of Allah: And the sky also opened, there are several doors, and the mountains are run so that they become mirages. (an-Naba'\/78: 19-20) When the heavens split open; and when the stars fall scattered; and when the seas are made overflowing; and when the graves are dismantled; (then) every soul will know what has been done and what (it) neglected. (al-Infithar\/82: 1-5) On that terrible day, angels descended in waves carrying books containing records of all the deeds of Allah's servants that they witnessed and recorded while in the world. These books became evidence when they were judged by Allah in Padang Mahsyar. According to scientists, this verse, like many other verses in the Qur'an, confirms the existence of astronomical events of extraordinary awesomeness that will occur on the Day of Judgment. Everything points to the overall breakdown and destruction of the system that connects the parts of the universe. Including the total change in position, form, and connections between elements in this universe. A final picture and a total change that does not only occur on earth, but also includes all the heavenly bodies in this universe. The stars 'fall down, collide with each other, because of the destruction (loss of) gravity, the sky is split and the planets clash and scatter. The white mist depicts all the trillions of celestial bodies, as if they look like fog. At that time these celestial objects \"jumped\" out of the sky as if pushed from within by a huge pressure that forced them out of the sky \"balloon\". Stars, planets and other celestial bodies are like small and light dust which has no power whatsoever. The balance and order between the components of the system in the universe at that time no longer existed. The heavenly bodies collided with each other and exploded. It could be that even the white mist is the clouds that have accumulated from the vapors produced from the explosions."
		   },
		   {
			"id": 2881,
			"surah": 25,
			"ayat": 26,
			"tafsir": "In this verse it is explained that the true and true kingdom on the Day of Judgment belongs to Allah, while the kingdoms that have existed in this world are not eternal. To whom does the kingdom today?\" Belongs to Allah, the One and Only, the Most Conqueror. (al-Mu'min\/40: 16) As the owner of the true kingdom, Allah is Most Gracious, Most Compassionate, and Most Just when judging His servants, especially who believe and obediently carry out His commands. On the other hand, for disbelievers, the Hereafter is a very difficult day, because the gods they worship cannot provide intercession or help. The various difficulties they face make them despair. faced by the disbelievers is described in the Qur'an: And if every unjust person (had) everything that is on earth, he would have redeemed himself with it, and they would hide their regrets when they had witnessed the punishment. among them fairly, and they are not wronged.(Yunus\/10: 54)"
		   },
		   {
			"id": 2882,
			"surah": 25,
			"ayat": 27,
			"tafsir": "On that day, the wrongdoers will bite their fingers in regret for having neglected their obligations while living in this world. Arrogantly, they have turned away from the truth that Allah's messenger brought them. They weep bitterly regretting themselves if they used to live in the world when they followed the Prophet's invitation to the straight path that led to the salvation of the world and the hereafter. They said regretfully, \"If only I had followed Muhammad in the world before, together with him heading the right path. If I had been able to hold back my pride so that I sincerely embraced Islam, I would not have felt this difficulty.\" It's just a shame that regret is no longer useful. They regretted that they were looking for friends in the wrong way. This is great accident and destruction. \"If I had not made so and so a close friend of mine, surely he could not have led me astray.\" Indeed, what plunges humans into accidents and misguidance is sometimes the devil himself or a devil in human form, such as an Arab polytheist named Ubay bin Khalaf. 'Uqbah bin Abi Mu'aith's friendship with Ubay bin Khalaf was very influential for him. 'Uqbah bin Abi Mu'aith often attended the recitation of the Prophet Muhammad so that he became a good acquaintance. One day, he invited the Prophet Muhammad to eat at his house. At that time, the Prophet did not want to eat unless 'Uqbah bin Abi Mu'aith wanted to convert to Islam, then 'Uqbah read two sentences of creed. But a friend of 'Uqbah bin Abi Mu'aith named Ubay bin Khalaf was not happy and angry with him. 'Uqbah bin Abi Mu'aith then said that he converted to Islam only pretending. Ubay bin Khalaf ordered that 'Uqbah bin Abi Mu'aith spit in the face of the Prophet Muhammad. He then did this when he was praying at Dar an-Nadwah, near Baitullah. 'Uqbah bin Abi Mu'aith obeyed what his friend wanted. Thus the result of friendship with people who are not good will bring bad results as well. The Prophet Muhammad gave guidelines to always look for good friends or close friends. His words: Someone will follow the behavior of his friends, so pay attention to who your friends are. (History of Abu Dawud and at-Tirmidhi from Abu Hurairah) And the words of Rasulullah saw: The parable of a good and a bad sitting partner is like a carrier of castor oil and a blacksmith. The carrier of kasturi oil is sometimes you receive or buy oil from it. And at least you get a good smell from it. As for the blacksmith, sometimes he burns your clothes (because of his flames) or you encounter an unpleasant smell.\" (Narrated by ash-Syaikhan from Abu Musa al-Asy'ari)."
		   },
		   {
			"id": 2883,
			"surah": 25,
			"ayat": 28,
			"tafsir": "On that day, the wrongdoers will bite their fingers in regret for having neglected their obligations while living in this world. Arrogantly, they have turned away from the truth that Allah's messenger brought them. They weep bitterly regretting themselves if they used to live in the world when they followed the Prophet's invitation to the straight path that led to the salvation of the world and the hereafter. They said regretfully, \"If only I had followed Muhammad in the world before, together with him heading the right path. If I had been able to hold back my pride so that I sincerely embraced Islam, I would not have felt this difficulty.\" It's just a shame that regret is no longer useful. They regretted that they were looking for friends in the wrong way. This is great accident and destruction. \"If I had not made so and so a close friend of mine, surely he could not have led me astray.\" Indeed, what plunges humans into accidents and misguidance is sometimes the devil himself or a devil in human form, such as an Arab polytheist named Ubay bin Khalaf. 'Uqbah bin Abi Mu'aith's friendship with Ubay bin Khalaf was very influential for him. 'Uqbah bin Abi Mu'aith often attended the recitation of the Prophet Muhammad so that he became a good acquaintance. One day, he invited the Prophet Muhammad to eat at his house. At that time, the Prophet did not want to eat unless 'Uqbah bin Abi Mu'aith wanted to convert to Islam, then 'Uqbah read two sentences of creed. But a friend of 'Uqbah bin Abi Mu'aith named Ubay bin Khalaf was not happy and angry with him. 'Uqbah bin Abi Mu'aith then said that he converted to Islam only pretending. Ubay bin Khalaf ordered that 'Uqbah bin Abi Mu'aith spit in the face of the Prophet Muhammad. He then did this when he was praying at Dar an-Nadwah, near Baitullah. 'Uqbah bin Abi Mu'aith obeyed what his friend wanted. Thus the result of friendship with people who are not good will bring bad results as well. The Prophet Muhammad gave guidelines to always look for good friends or close friends. His words: Someone will follow the behavior of his friends, so pay attention to who your friends are. (History of Abu Dawud and at-Tirmidhi from Abu Hurairah) And the words of Rasulullah saw: The parable of a good and a bad sitting partner is like a carrier of castor oil and a blacksmith. The carrier of kasturi oil is sometimes you receive or buy oil from it. And at least you get a good smell from it. As for the blacksmith, sometimes he burns your clothes (because of his flames) or you encounter an unpleasant smell.\" (Narrated by ash-Syaikhan from Abu Musa al-Asy'ari)."
		   },
		   {
			"id": 2884,
			"surah": 25,
			"ayat": 29,
			"tafsir": "In this verse it is explained that the disbelievers said, \"Someone has led me astray from the teachings of the Qur'an and from believing in Muhammad after the instructions came to me.\" It is Satan's habit to deceive people and turn them away from the truth and does not want to help people who have been led astray."
		   },
		   {
			"id": 2885,
			"surah": 25,
			"ayat": 30,
			"tafsir": "In this verse, the Messenger of Allah complained to Allah by saying, \"O my Lord, indeed my people have made this Qur'an something that should not be ignored. They do not believe in it, do not pay attention to its promises and warnings. In fact, they turn away from it and refuse to follow Then Allah ordered His messenger to be patient and steadfast in dealing with his people."
		   },
		   {
			"id": 2886,
			"surah": 25,
			"ayat": 31,
			"tafsir": "Allah has made for every prophet an enemy of satan and evil people who always sneer at the sanctity of religion and despise the guidance brought to them by the apostles. Therefore, Allah advised the Prophet not to give up or feel alone in facing challenges like that, because Allah is sufficient as a guide and helper. In accordance with the word of Allah: And thus for every prophet We made an enemy consisting of human and jinn devils, some of them whispered to others beautiful words as a deception. (al-An'am\/6: 112)"
		   },
		   {
			"id": 2887,
			"surah": 25,
			"ayat": 32,
			"tafsir": "The disbelievers and the Jews ask why the Qur'an was not revealed to Muhammad in one fell swoop, like Allah's previous books, namely the Torah to Moses and the Psalms to David. Allah rejected their questions and explained why the Qur'an was revealed gradually. The Qur'an was revealed gradually so that Allah would make it easier and strengthen the heart of the Prophet Muhammad. Allah says: And the Qur'an (We sent it down) gradually so that you (Muhammad) read it to people slowly and We sent it down gradually. (al-Isra'\/17: 106) The gradual revelation of the Qur'an does contain many lessons, including: 1. The Prophet Muhammad often met the angel Gabriel so he received lots of advice to increase enthusiasm, patience, and fortitude in fulfill his message. 2. Because the Prophet Muhammad could not read and write (ummi), if the Al-Qur'an were sent down all at once, it would be difficult for him to memorize it. 3. So that the memorization is more stable, perfect, and avoids all mistakes. 4. If the Al-Qur'an were sent down all at once, the Shari'a would have been sent down all at once. This is sure to cause a lot of trouble. However, because of its gradual decline, the Shari'a was implemented gradually so that it was easy to implement, both for the Prophet and his followers. 5. Because the revelation of the Qur'an has a lot to do with the reasons for its revelation, such as various questions, events or incidents, its gradual revelation made a more lasting impression on the hearts of friends because they could live it event by event. 6. If the Al-Qur'an was revealed gradually, they were not able to imitate the Al-Qur'an even in one verse, especially if it was revealed all at once. 7. Some of the Islamic sharia law came down according to the development of the Muslims at that time. Then after they grow smarter and have a firmer faith, then Islamic law is implemented which is more perfect with the verses of the Al-Qur'an that were revealed later. If the Al-Qur'an were revealed all at once, this would not have happened."
		   },
		   {
			"id": 2888,
			"surah": 25,
			"ayat": 33,
			"tafsir": "In this verse, Allah told the Prophet Muhammad that He would not allow those disbelievers to come to the Prophet carrying something false that they concocted to tarnish his apostleship. Allah will only bring to the Prophet a truth to refute their accusations and give the best explanation. Things like this are also in the word of Allah: Actually, We throw the right (truth) to the wrong (not right) then that right destroys it, then immediately (the wrong) disappears. (al-Anbiya'\/21: 18)"
		   },
		   {
			"id": 2889,
			"surah": 25,
			"ayat": 34,
			"tafsir": "This verse explains that those who are led to Hell by dragging their faces with chains and shackles, are the people in the worst places and the most misguided ways. The Prophet Muhammad was commanded by Allah to say these words to the disbelievers who put forward some strange characteristics to tarnish his apostleship, with the intention that he was telling them to make comparisons between those who are guided and who are in the dark. error. In accordance with the word of Allah: And indeed we or you (the polytheists), must be in the truth or in a clear error. (Saba'\/34: 24) It is also mentioned in the hadith of Rasulullah saw: People will be gathered on the Day of Judgment into three groups, one group walking, another group driving, and another group walking with their faces. The Prophet was asked, \"How do they walk with their faces?\" He replied, \"Indeed, God who can walk them with his two feet can also walk them with his face. Remember, they keep their faces from sharp and thorny objects.\" (History of at-Tirmidhi from Abu Hurairah). What is meant here is that angels drag the faces of disbelievers into hell."
		   },
		   {
			"id": 2890,
			"surah": 25,
			"ayat": 35,
			"tafsir": "This verse explains that Allah has sent down the Torah to the Prophet Musa just as the Qur'an was revealed to the Prophet Muhammad. He has also made Harun, his brother, accompany him as a wazir (helper) who is always consulted for his opinion. In another verse it is explained that Aaron was seconded to Moses as a prophet. This is not contradictory because even though Aaron is a prophet, in the field of law he follows the law of Moses and follows His instructions. Then Allah explained that Musa and Harun were ordered to convey His message to Pharaoh with the assurahnce that the final victory would be on their side."
		   },
		   {
			"id": 2891,
			"surah": 25,
			"ayat": 36,
			"tafsir": "Then Allah ordered Musa and Harun to go and preach to Pharaoh and his people who had denied the signs of the oneness of Allah found in the universe. After they had fulfilled their duty, namely conveying their message gently, it turned out that Pharaoh's attitude remained unchanged, so Allah destroyed them. As mentioned in the word of Allah: Allah has destroyed them, and for those who disbelieve will receive (fate) similar to that. (Muhammad\/47: 10). With this incident, Allah comforted the Prophet Muhammad and taught him to be patient, because he was not the first prophet to be denied by his people."
		   },
		   {
			"id": 2892,
			"surah": 25,
			"ayat": 37,
			"tafsir": "Likewise, Allah had destroyed the people of Noah who had denied the apostles. After Prophet Noah fulfilled his treatise by conveying da'wah to his people, but only a few believed in him, Allah then drowned them with a typhoon and a great flood which destroyed all humans and animals except those in Noah's ship. Allah made this event a lesson for mankind so that they always remember and be grateful for the blessings of Allah who has saved them from the disasters that threaten. This is in accordance with the word of Allah: Verily, when the water rises (up to the mountain), We bring your (ancestors) into the ship, so that We make it (the incident) as a warning for you and so that ears that want to hear it pay attention. (al-haqqah\/69: 11-12). Then Allah explained the consequences of those who denied the Prophet's message with His words that He had prepared for the unjust people a painful punishment. This verse contains a warning to the Quraysh so that they should not deny Muhammad's prophethood because it is very likely that they too will be punished like the previous people who had denied His messengers."
		   },
		   {
			"id": 2893,
			"surah": 25,
			"ayat": 38,
			"tafsir": "This verse explains that Allah has destroyed the people of 'ad, the people of Nabi Hud, with a wind that blew with a very large force and was very cold, destroyed the Samud people, the people of Nabi Saleh, with a loud roar, and also destroyed the people of Rass who were in the land of Yamamah who killed the prophet. The same fate has befallen the following generations as a result of their defiance."
		   },
		   {
			"id": 2894,
			"surah": 25,
			"ayat": 39,
			"tafsir": "In this verse, Allah explains that the story of the ancient people was told by the prophet to the polytheists as an image or parable, and explained to them the arguments for the oneness of Allah. However, it turns out that they continuously deny and deny it so that Allah destroys them to pieces. Allah then ordered Muhammad to remind the polytheists of Mecca to take lessons from these events. They always passed the places of the people who had been destroyed during their trade trips, namely the former areas of the people of Lut and Samud when they went to Sham, and the former areas of the people of 'ad (Ahqaf) which they passed when they went to Yemen."
		   },
		   {
			"id": 2895,
			"surah": 25,
			"ayat": 40,
			"tafsir": "In fact, the polytheists of Mecca often passed through the land of Sodom, which was once rained down on with stones and the former residence of the Prophet Lut, which was known for its homosexual acts. Did they not witness the ruins as a punishment for denying a messenger of God. Then Allah explained that the main reason that closed the eyes of their hearts to the causes of the punishment was not because they did not see, but because they did not believe in the existence of a resurrection day on the Day of Judgment, after they died."
		   },
		   {
			"id": 2896,
			"surah": 25,
			"ayat": 41,
			"tafsir": "In this verse, Allah confirmed to the Prophet Muhammad that the disbelievers always mocked him by saying, \"Is this the person who was sent as a messenger?\" That was the ridicule of the disbelievers whenever they saw the Prophet Muhammad."
		   },
		   {
			"id": 2897,
			"surah": 25,
			"ayat": 42,
			"tafsir": "The words of the polytheists that Muhammad had almost led them astray from his offerings had they not been diligent and patient in worshiping him, shows that the Prophet Muhammad had conveyed his da'wah in earnest accompanied by real arguments. The Prophet also showed various miracles so that they almost left the religion of their ancestors and entered Islam. Their words also showed that there was a great contradiction in their hearts, from one side they ridiculed the Prophet, and from the other side they felt worried that they would be influenced by the Prophet's preaching which was very strong and logical. Furthermore, this verse explains that they will know who has gone astray when they see the doom. According to history, this verse is related to what Abu Jahl did every time he met the Prophet. The same method was used by the former people to Allah's apostles as stated in Allah's word: And indeed, some of the apostles before you (Muhammad) were made fun of, so that punishment descended on those who mocked it in return for their ridicule. (al-An'am\/6: 10)"
		   },
		   {
			"id": 2898,
			"surah": 25,
			"ayat": 43,
			"tafsir": "Ibn 'Abbas ra said, \"People in the Age of Jahiliyyah used to worship a white stone for several periods. However, if he saw another worship that was better, then he left the white stone and chose a second worship that was better according to the size of his desires. In connection with that, this verse was sent down.\" In this verse, Allah denounces the Meccan infidels who deify their desires so that they become the basis for all their religious affairs. They do not listen to clear arguments and clear explanations. Allah advised Muhammad not to think too much about their attitude, because he was not assigned to make them realize that they have faith forever, especially if they do not want to break free from the shackles of their desires and follow the instructions to the truth. Allah says that Muhammad is not a caretaker and guarantor for them. The Prophet's obligation was only to convey the treatise. This is in accordance with the word of God: You are not the one who has power over them. (al-Gasyiyah\/88: 22)"
		   },
		   {
			"id": 2899,
			"surah": 25,
			"ayat": 44,
			"tafsir": "In this verse, Allah advised the Prophet Muhammad not to assume that most polytheists listened to the verse and understood the truth contained in the verse so that they could practice his instructions to do good deeds and improve their morals. Allah reminds us of this because they are like livestock, they are even more astray. When compared to cattle, animals are subject to their masters, who are felt to love them, know who has done good and who has done evil to them, can look for a place where there is grass for their food and drinking water, and if they know they will return to their stables at night, it is different. once with the polytheists themselves. They don't want to know the Creator and Giver of sustenance, they don't feel the various favors bestowed upon them by God. Musyrik people do not feel deceived by Satan, who always looks good at the seduction of his lust. The stupidity of livestock is limited only to themselves, but their stupidity spreads to cause various slander and destruction and hinders others from the path of truth, to the point of causing division and war among human beings. Even though these animals do not know monotheism and prophethood, they are not against it, in contrast to the polytheists who deny monotheism because of their arrogance and bigotry towards wrong teachings inherited from their ancestors. Cattle animals do not waste the instincts that God has given them. It is different with the polytheists, they are endowed with good reason and instinct from birth, but they waste their common sense to distinguish what is good and what is not. In the verse it is stated that most of them do not hear or understand the truth. It is true that there are a few among them who acknowledge the truth, but are unable to follow it for fear of losing their position."
		   },
		   {
			"id": 2900,
			"surah": 25,
			"ayat": 45,
			"tafsir": "In this verse, Allah commands His messengers to pay attention to His creation, how He lengthens and shortens the shadows of every object exposed to sunlight, from sunrise to sunset. God deliberately made heat from the sun's rays. If He had willed, He would have made the shadows permanent, not moving. Allah makes the shadows lengthen or shorten to be used by humans as a measure of time, such as in Egypt using a tool called al-Misallat to measure the time during the day and determine the seasons throughout the year. Since time immemorial, the Arabs have also used a tool called al-Mazawil to determine prayer times with shadows. They can ensure that it is time for Zuhur when the shadow of the needle has moved from west to east, and it is time for Asr when the shadow of every object standing has matched it. Only Imam Abu Hanifah is of the opinion that the shadow must be twice the length of the object itself. So it is clear that according to this verse, Allah made the shadows of the sun as a time indicator."
		   },
		   {
			"id": 2901,
			"surah": 25,
			"ayat": 46,
			"tafsir": "Then Allah removes the shadows slowly as the sun sets little by little. According to scientists, this verse speaks of the precise order of the universe. This verse describes the function of movement and the \"length\" of the shadows that move from morning, noon, and evening. Lengthening the shadow of an object in physics is the event of decreasing the angle of incidence of light and shortening the length of the shadow due to the greater angle of incidence of light. We often encounter these events in our daily lives. In the morning, the shadows of objects exposed to sunlight falling on the earth will appear long. The later in the day and until the position of the sun is at the culmination point, the shadow will appear to be getting shorter. On the other hand, when the sun begins to shift westward until late afternoon, you will see that the shadows are getting longer again. This happens because the angle of incidence of sunlight becomes smaller again. What happens when the long shadows stay the same or don't change? This is an extraordinary event. In simple terms, it can be interpreted that the position of the sun and the earth remains unchanged, so the sun will shine on the earth continuously. This means that the earth's surface (which is bright) will experience a heating process. The surface temperature will continue to increase as long as the irradiation lasts. Seawater will bubble and boil. If this continues for a long time, the earth will burn and be destroyed due to increased temperatures. While the surface of the earth that is not facing the sun, will experience the opposite process, which is experiencing extraordinary cooling. Perhaps the sea surface would freeze, and life would die. Temperature extremes in these two hemispheres may lead to the extinction of life. Doomsday? Wallahu a'lam. Allah is Almighty over all His creation. The long and short events or the west and east directions of the shadows relative to the position of the sun can be a time indication for humans who are on earth. The disappearance of the shadows occurring slowly is as simple a description as the events of a slow setting sun. The second thing that can be obtained is that the verse above has indicated that there will be a rotation of the earth on its axis. The verse below can also be used for such indications. And the sun goes where its circulation. Such is the decree of (Allah) the Almighty, the All-Knowing. And We have determined the place of rotation for the moon, so that (after it reaches the last place of circulation) it returns like the form of old bunches. It is not possible for the sun to overtake the moon and for the night to precede the day. Each circulates in its orbit. (Yasin\/36: 38-40). The verse above can also be used to show the existence of order in the universe. The last sentence of the verse clearly states it. The same thing can also be found in surahh al-Anbiya'\/21: 33, az-Zumar\/39: 5, and ar-Rahman\/55: 1-5. In surahh Yasin\/36: 38-40 above it is stated that the sun revolves around its trajectory. Modern astronomy proves the truth of this statement of the Qur'an. As is known, the sun is located on the outer side of the disk of the Milky Way galaxy. This galaxy is disk-shaped, which has a radius of about 10 kiloparsecs. If calculated in the mil dimension, it is equal to 2 with 17 zeros. Astronomical research shows that the Milky Way galaxy makes rotations on its axis (revolution), and one revolution takes 250 million years. Because the sun is in the outer disk of this galaxy, the sun also circulates according to the orbit of the outer side of the disk of the galaxy. The word yasbahun found in surahh Yasin\/36: 40, is more appropriate when translated by swimming, rather than circulating. Because, in modern astronomy, this space is not completely empty, but is filled and filled with sub-atomic particles known as neutrinos. So all celestial bodies in this universe are actually 'swimming on neutrino waves. Regarding the earth's rotation, the data shows that the earth rotates on its axis at a speed of 1,670 km per hour. This speed is close to the speed of bullets released from modern weapons, which is 1,800 km per hour. So you can imagine, how fast the earth's rotation. What makes this fast rotation is not a small and light object like a bullet, but an object with a very large size and mass. The speed of the earth's orbit about the sun is about 60 times the speed of a bullet, which is about 108,000 km per hour. At this speed, an airplane will be able to circle the earth in 22 minutes. The exact rotation that causes day and night to occur on this earth is confirmed by the verse below. It is not possible for the sun to overtake the moon and for the night to precede the day. Each circulates in its orbit. (Yasin\/36: 40)"
		   },
		   {
			"id": 2902,
			"surah": 25,
			"ayat": 47,
			"tafsir": "Allah then mentions His second power, which is to make the night useful for humans like the benefits of clothes that cover the body. Allah also causes deep sleep for humans so that it is as if they are dead, because a person is not conscious at all while sleeping, and his limbs stop working except for the heart and several other organs. Thus, he can rest perfectly as in the word of Allah: And it is He who makes you sleep at night. (al-An'am\/6: 60). Allah holds the life of (a person) at the time of his death and the life of (a person) who has not died when he sleeps. (az-Zumar\/39: 42) Allah made the day for trying and doing activities. Just as sleeping at night is likened to dying, so waking up during the day is likened to waking up again from death. Likewise, humans, after their life span in this world ends and dies, will be resurrected after their death, to be judged by Allah for everything they have done while living in this world."
		   },
		   {
			"id": 2903,
			"surah": 25,
			"ayat": 48,
			"tafsir": "The third power of Allah is He who blows the wind as a herald of good news, especially for farmers that the rain which is His mercy will soon fall. He is also the one who sends down very clear rainwater to clean the body and clothes, especially for drinking and other purposes."
		   },
		   {
			"id": 2904,
			"surah": 25,
			"ayat": 49,
			"tafsir": "In this verse, Allah explains that rain is sent down to fertilize dead and barren lands or lands. With rain water too, Allah gives water to most of His creatures, such as livestock and humans. In another verse it is explained: And you see the earth is dry, then when We send down water (rain) on it, the earth will live and become fertile and grow various kinds of beautiful pairs (plants). (al-hajj\/22: 5) And His words: So pay attention to the traces of Allah's mercy, how Allah revives the earth after death (dry). Indeed, it means that He will definitely (power) bring the dead back to life. (ar-Rum\/30: 50) According to scientists, from the verse above two things can be discussed, namely: 1.Regarding the occurrence of rain 2.Regarding the indication that rainwater brings life, so that it can \"...bring life with it a land that die...\" Regarding the occurrence of rain, the story begins with water flowing along a creek that will join with other tributaries to form a much larger river, which eventually flows into the sea. While water flows through streams and rivers, some of it evaporates in the heat of the sun (turns into gas) but most of it continues to flow down to the sea. It is in this sea that the next process of evaporation or evaporation takes place. All water that evaporates, whether it comes from streams, rivers or the sea, forms water vapor in the atmosphere. This vapor rises and cools as it reaches the higher atmosphere. If there is a lot of gas in the atmosphere, this water vapor will condense into a group of gases called clouds. If the clouds are blown by the wind so that they gather together, and rise upwards so that they reach a higher part of the atmosphere, the water vapor will turn into ice drops. As the clouds get colder due to the lower atmospheric temperature, the water solidifies (ice) and falls, initially as tiny ice drops, which usually melt before reaching the ground. Thus, water drops will fall to earth as rain. (See also ar-Ra'd\/13: 17; an-Naml\/27: 60; al-'Ankabut\/29: 63; Luqman\/31: 34; as-Sajdah\/32: 27; Fathir\/35: 27; az-Zumar\/39: 21; Qaf\/50: 9-11)."
		   },
		   {
			"id": 2905,
			"surah": 25,
			"ayat": 50,
			"tafsir": "This verse explains that actually Allah has arranged the rain to fall in turns for humans. Sometimes it comes down day or night, sometimes it is intended to water the ground of a people who have just performed the Istisqa prayer, sometimes it is turned away from people who have committed a lot of iniquity and disobedience. All of this is for the purpose of humans taking lessons from it, and so that they understand that it is God who regulates the turn of the rain just as he regulates the circulation of the stars and planets in outer space. Rainwater is not only falling which is regulated by turns, but the shape and condition as well. Sometimes that water freezes if the temperature goes below zero and is an ice cube. Then when heated it turns into liquid, and when heated it turns into vapor. Water is an element that is present in all living things, in plants, animals and humans, as in the word of Allah: And We created all living things from water. (al-Anbiya'\/21: 30) All of this should be food for thought for humans in order to be grateful for God's blessings. However, most people are reluctant to even deny these blessings."
		   },
		   {
			"id": 2906,
			"surah": 25,
			"ayat": 51,
			"tafsir": "This verse makes it clear that had Allah willed, He would have sent a messenger to each land, who would give a warning. However, Allah sent Muhammad as the Seal of Prophets to all mankind, as Allah says: Say (Muhammad), \"O people! Truly I am Allah's Messenger to all of you.\" (al-A'raf\/7: 158) And We did not send you (Muhammad), but to all mankind as a bearer of glad tidings and as a warner. (Saba'\/34: 28) If other prophets were sent to certain people, then Allah sent the Prophet Muhammad as a messenger to all mankind as a bearer of good news and a warning. Therefore, the miracles given to the Prophet Muhammad are no longer temporary in nature, which are only appropriate for a certain people and place. However, he was given the universal Al-Qur'an, the values contained in it are suitable to be applied wherever and whenever."
		   },
		   {
			"id": 2907,
			"surah": 25,
			"ayat": 52,
			"tafsir": "The Prophet Muhammad was commanded by Allah to convey his message in earnest, carry out jihad and struggle with wisdom, patience, fortitude, and not be afraid or afraid of the enemy. The Prophet saw must be sure that Allah will help, so that victory is in his hands and the believers. In this verse, Allah forbade the Prophet Muhammad to follow the disbelievers who invited him to compromise with them in matters of religion. He must remain firm and consistent in carrying out da'wah and jihad in spreading the Qur'an. In language, jihad is trying really hard, if necessary by sacrificing anything, property or life. Jihad can be carried out in a state of war or peace. In a state of war, jihad is carried out with qital, namely fighting in the way of Allah. While jihad in peace can be carried out in the fields of economy, education, culture, and others. Verse 52 is included in the group of Makkiyyah verses, revealed before the migration in a state of peace. So jihad here is more emphasized on the seriousness of carrying out da'wah, education, and social efforts to improve people's conditions. Allah promises those who strive in earnest will always be guided to the straight path. Allah says: And those who strive for (seek our pleasure), We will show them Our paths. And indeed, Allah is with those who do good. (al-'Ankabut\/29: 69)"
		   },
		   {
			"id": 2908,
			"surah": 25,
			"ayat": 53,
			"tafsir": "This verse contains the fourth sign of Allah's power, namely He who allows two kinds of water to flow side by side, one fresh and fresh, while the other is salty and bitter, as happens in the mouths of large rivers. However, even though they are close together, the taste of the water does not mix as if there is a wall separating the two, so that one does not spoil the taste of the other. Although according to the eyes of the two seas are mixed, in reality the fresh water is separated from the salty by Allah's power as in His word: He let two seas flow which (later) both met, between the two there is a boundary that is not exceeded by each -respectively. (ar-Rahman\/55: 19-20). According to scientists, Allah has created a separator for sea and river water, even though the river water falls swiftly from a high place. This barzakh (separator) functions to prevent the two waters from erasing each other's characteristics. The salty and fresh seas are as if there is already a dividing wall between the two, so they don't get mixed up. Man can make his choice because both salt and fresh water are useful. In 1873, British oceanographers (with the Challenger ship) discovered differences in the characteristics of the sea in terms of salt content, temperature, types of fish\/animals, and so on. Each type of water groups by itself in a certain way, separate from other types of water however far it flows. The water of the Amazon River, which flows swiftly into the Atlantic for up to 200 miles, is still fresh. The springs in the Persian Gulf have their own unique fish and each does not live except in its location. The two seas referred to are the oceans which fill about  of the earth and the rivers that are accommodated by the land and which emit springs and large rivers which then flow into the oceans. Barzakh (separator) is a water reservoir that is in the earth and the channels in the earth that prevent sea water from mixing with river water so that it does not turn it salty. The state of salt water that penetrates or flows from the ocean to the rocks near the coast, but it does not mix with fresh water that penetrates or flows into the sea from the mainland. The position of the river flow is higher than sea level, allowing relatively little fresh water to penetrate the salty sea water but not to mix completely. Another related verse is: He let two seas flow which (then) both met, between the two of them there is a boundary which neither of them exceeded. (ar-Rahman\/55: 19-20)."
		   },
		   {
			"id": 2909,
			"surah": 25,
			"ayat": 54,
			"tafsir": "The fifth sign of Allah's power, namely He who created man from sperm. He then made humans have offspring and musaharah (perbesanan) or family relationships as a result of the marriage of biological children to other people, so that family terms emerged, such as son-in-law, brother-in-law, mother-in-law, and so on. Allah's Word: Wasn't he just a drop of sperm that was shed (into the womb), then (the semen) became something that was attached, then Allah created it and perfected it, then He made from it a male and a female pair. (al-Qiyamah\/75: 37-39) Allah created a very beautiful human being whose body structure is equipped with five senses, perfected with reason and the ability to think. Humans are also given all the facilities so that everything that is on the surface of the earth is reserved for them. Allah's Word: Do you not see that Allah has subjected what is in the heavens and what is in the earth to your (interests) and perfected His favors for you physically and mentally. (Luqman\/31: 20 In terms of science, some of the verses related to the verse above are: And did those who disbelieve see that the heavens and the earth were both one solid, then We separated them. And We made of them from water is everything that lives. So why do they not believe. (al-Anbiya'\/21: 30). And Allah has created all kinds of animals from water, so some of them walk on their bellies and some walk on two legs while some walk on four legs. Allah creates what He wills, verily Allah is Almighty over all things. (an-Nur\/24: 45). The three verses above indicate a close relationship between water and the existence of life. 1. Water is suspected to be very close to living things. Humans and most animals originate from sperm fluid. 2. All life begins from water. Water here is more accurately interpreted as the sea. This chemical chain is believed to start from the depths of the ocean . It is suspected that it was in the sea that life began because the atmospheric conditions at that time had not yet developed into an area habitable for living things. From this description, the role of water for life is very clear, starting from the existence of living things on earth (originating from the depths of the sea), for their survival (water is needed for the formation of organs and carrying out organ functions), and starting life (especially for the group of animals \"water particularly those derived from sperm)."
		   },
		   {
			"id": 2910,
			"surah": 25,
			"ayat": 55,
			"tafsir": "This verse explains that the polytheists worship gods other than Allah, namely statues and idols that do not benefit them. They worship it only to follow their desires and continue the traditions of their ancestors, and leave the worship of Allah who created them and has bestowed various pleasures. In addition, they have done evil by helping satan in his actions against Allah, His messenger and the believers, as described in His word: And their companions (pagans and wicked people) help the devils in misleading. (al-A'raf\/7: 202) The word dhahir in another verse is defined as a helper. Some interpreters interpret it as humiliating or useless so that the meaning of the verse becomes: And those who disbelieve in their Lord's sight are very despicable and vain."
		   },
		   {
			"id": 2911,
			"surah": 25,
			"ayat": 56,
			"tafsir": "Why did the polytheists help Satan to commit disobedience to Allah, even though He has sent His Messenger to give good news to those who believe and do good deeds, and warn them. They also knew that the apostle was sent to bring good tidings and warn. How stupid are those who are against the apostle."
		   },
		   {
			"id": 2912,
			"surah": 25,
			"ayat": 57,
			"tafsir": "Allah ordered the Prophet to explain to his people that even though he was sent for their safety, he did not take any advantage for himself personally. He did not ask for the slightest reward from them in conveying this treatise, except for people who willingly want to do good deeds to get closer to Allah, by giving alms or voluntary assistance, that is what is good for him."
		   },
		   {
			"id": 2913,
			"surah": 25,
			"ayat": 58,
			"tafsir": "This verse instructs people to put their trust in Allah, the Eternal Living and not to die, God calls on all the worlds, surrenders to Him, and is patient in all calamities that befall him. It is God who gives sufficiency to humans, who conveys to the goal of happiness. Humans are also ordered to glorify Allah by praising Him, purifying Him from all partners, children, wives, and all inappropriate characteristics, as the polytheists accuse Him of. Allah's command to put his trust in Him does not mean that humans do not need to try anymore, or that they do not need to think about the causes that gave rise to that effort, but the meaning is that humans surrender to Allah everything they have worked for. In this verse, Allah commands to put your trust only in Him, the Living One, because all creatures will die, so it is not proper to put your trust in anyone other than Allah. Only Allah is the Eternal Life, who knows all the deeds and sins of His servants and is able to repay their deeds. Good deeds are rewarded, and bad deeds are punished."
		   },
		   {
			"id": 2914,
			"surah": 25,
			"ayat": 59,
			"tafsir": "In this verse it is explained that Allah created the heavens, the earth and what is between them within six days. The word yaum is usually translated as \"day\", but the \"day\" in this verse is not a 24-hour day, but yaum is defined as \"time\". Then Allah resided on the 'Throne (see surahh al-A'raf\/7: 54). Every believer believes that Allah is One, eternally alive, who created the heavens, the earth and everything between them in six periods. Allah is Most Gracious because His mercy and gifts are very great for humans, both those who believe and those who do not. Those who have faith should know the characteristics of Allah, because this will increase the stability of their faith. For those who do not know His characteristics, you should ask people who really know about religious matters. Allah said: So ask people who are knowledgeable, if you do not know. (an-Nahl\/16: 43; See also surahh al-Anbiya'\/21: 7) At the time of the Prophet, if there were problems related to religion, friends could ask him directly. After the Prophet died, Muslims should ask the scholars who studied religious affairs."
		   },
		   {
			"id": 2915,
			"surah": 25,
			"ayat": 60,
			"tafsir": "After explaining how great the gifts and favors He bestowed upon them, Allah also explained the attitude of the disbelievers who should be grateful and thankful, but they did the opposite. When those who worship other than Allah are ordered to prostrate to the Most Merciful God, they answer, \"Who is the Most Merciful God?\" Their question was like the question the Children of Israel asked Musa when he said, \"Verily I am a messenger from Rabbul 'alamin.\" The Children of Israel asked, \"Who is the Rabbul 'alamin?\" The polytheists in their rebuttal said, \"Shall we prostrate to God who is said to be Most Merciful, but we do not know him at all?\" The command to prostrate makes them disbelieve and far from the faith. It was narrated by adh-ahhaq that the Prophet Muhammad and his companions prostrated when they finished reading this verse, because it is one of the verses that were circumcised to prostrate for their readers and listeners. His prostration is called prostration of recitations. There are 15 verses that are circumcised in prostration of recitations, two of which are in surahh al-Hajj and the other 13 are scattered in surahhs al-A'raf, ar-Ra'd, an-Nahl, al-Isra' , Maryam, al-Furqan, an-Naml, as-Sajdah, sad, Fussilat, an-Najm, al-Insyiqaq, and al-'Alaq. What is in the surahh sad is not only prostration of recitations, but also prostration of gratitude. After Allah explained the attitude of the disbelievers who distanced themselves from prostration to Him, He explained the attitude of the people's refusal to prostrate, they even grew stubborn and turned away from their Lord."
		   },
		   {
			"id": 2916,
			"surah": 25,
			"ayat": 61,
			"tafsir": "Glory be to Allah who made countless stars in the sky. Allah also made the sun shine brightly and the moon shine. According to scientists, in discussing celestial bodies, the Qur'an has also distinguished stars from planets. Stars are celestial bodies that emit light. Meanwhile, the planets only reflect the light received from the stars. Thus, stars have a source of light, while planets do not (See Yunus\/10: 5 and al-Hijr\/15: 16)."
		   },
		   {
			"id": 2917,
			"surah": 25,
			"ayat": 62,
			"tafsir": "Allah is also the one who makes the night and day alternate so that it becomes a lesson for those who always remember His favors and meditate on the wonders of His creation. Thus, the urge arises to be grateful for the blessings of Allah. If the night and day did not alternate, and the sun continued to shine, this would undoubtedly create a feeling of boredom or boredom and tiredness for not being able to rest at night. Likewise, if the night continues without being interspersed with sunlight, it will surely bring damage to the creatures that need it. The alternation of day and night provides an opportunity to make up for deficiencies in sunnah worship, that is, if someone due to busy work during the day does not have time to pray or read the wird, then it can be carried out at night, as stated in an authentic hadith: Verily Allah stretches out his hands Him at night so that those who sin during the day may repent and reach out His hand during the day so that those who sin can repent during the night, until the sun rises from its setting. (Muslim history from Abu Musa). It is narrated that Umar bin Khaththab once prayed Duha for a long time. When he was reprimanded by a friend, he replied that he had left some of the wirid today, due to being busy, so he intended to make up for the lack by praying the Duha prayer, then he read this verse 62. Night, day, sun and moon are the four favors of Allah. God created the night so that humans can rest due to the darkness of the night. Day was created by Allah with the rising of the sun to work. Allah created the sun and the moon, each having its own axis and orbit. Tirelessly, and never still, everything is constantly circulating. Alternation of day with night can only be a change from light to dark. However, psychologically, the change from light to dark has a completely different mood from that during the day. Various experiments have been carried out to observe how the psychological influence on night workers. Psychosomatic symptoms (physical symptoms caused by psychological causes) were observed, ranging from only nausea to rather severe mental depression. This is only a short-term effect on human physical and psychological. Long-term effects can have a more severe effect. Therefore, God outlines the night to rest and the day to work. So working at night which is called overtime is contrary to human nature as outlined by God. This condition is not surprising because during the day the earth gets exposure to visible light, begins to shift to yellow at sunset, shifts to infra-red during Isha prayers, to ultraviolet when the night is late, and approaches dangerous gamma waves closer to dawn. . This exposure causes humans to suffer psychosomatic if they don't rest and are forced to work."
		   },
		   {
			"id": 2918,
			"surah": 25,
			"ayat": 63,
			"tafsir": "The qualities of a servant of Allah, the Most Compassionate, are explained from this verse 63 and in the following verses. These qualities can all be summed up into 9 characteristics which if a Muslim possesses, he will gain the pleasure of Allah in this world and in the hereafter, and will be placed in a high and noble position, namely in the Na'im heaven. These characteristics are: First: When they walk, their attitude and simplicity are visible, they are far from arrogance, their steps are steady, regular, and not artificial with the intention of attracting people's attention or to show who they are. That is the nature and attitude of a believer when he walks. Allah said: And do not walk this earth arrogantly. (al-Isra'\/17: 37) Second: If someone says something inappropriate or obscene towards them, they don't reply with similar words. However, they answered with good words, and contained advice and hope that they would be guided by Allah, the Most Gracious, Most Compassionate, and Merciful. Likewise with the Prophet's attitude when he was attacked and insulted with harsh words, he remained tolerant and continued to sympathize with these immoral people. Al-Hasan al-Basri explains that the believers are always open-minded, and never say harsh words. If impolite words are spoken to them, they are not emotional and do not reply with impolite words either. Maybe there are people who think that such traits and attitudes show weakness and lack of self-esteem, because it's normal for someone who acts impolite to be reciprocated with impolite behavior. However, if you think deeply about it, it will surely bring prolonged strife and strife. Every believer must prevent protracted disputes and enmity. One of the most appropriate and effective ways to eradicate it is to repay bad actions with good actions so that people who commit bad actions will feel ashamed and realize that they have done something unnatural. This kind of attitude is explained by God in His word: And good is not the same as evil. Reject (the evil) in a better way, so that the person with whom you have enmity will be like a loyal friend. And (these good qualities) will not be awarded except to people who are patient and will not be bestowed except to people who have great luck. (Fussilat\/41: 34-35). Such are the characteristics and attitudes of believers when they are in the daytime where they always remember fellow servants of Allah."
		   },
		   {
			"id": 2919,
			"surah": 25,
			"ayat": 64,
			"tafsir": "Third: Then Allah also explains their attitudes and characteristics when dealing with God the Creator of nature at night. When the night is quiet, people are lulled by deep sleep, they perform the Tahajud prayer and stand facing God Almighty. They leave the pleasures and comforts of sleep, they imbibe with all their soul and body how enjoyable and serene it is to worship God. They pray the Tahajud night prayers as the Prophet did because by praying at night their souls become pure and clean. Their faith increases, the belief becomes firm that there is no God but Him, His mercy and compassion are Most Extensive covering all His creatures. It was there that they begged and prayed earnestly and humbly to be forgiven for their sins and mistakes and to be bestowed with His mercy and pleasure. After performing the prayers that night, then they go to sleep with a happy feeling full of trust and piety. Ibn 'Abbas said, \"Whoever prays two cycles of prayer or more after the Isha prayer means he has been praying all night.\" In another verse, Allah also explains the characteristics of the believers who pray this night: Their stomachs are far from their beds, they pray to their Lord with fear and hope, and they spend part of the sustenance We have given them. (as-Sajdah\/32: 16). And His words: (Are you people(64) Third: Then Allah also explains their attitudes and characteristics when dealing with God the Creator of nature at night. When the night is quiet, humans are lulled by deep sleep, they perform Tahajud prayers and standing facing God Almighty. They leave the pleasures and comforts of sleep, they imbibe with all their soul and body how enjoyable and serene it is to munajat with God. They perform the Tahajud prayers at night as the Prophet did because by praying at night their souls become pure and clean. Their faith increases, the belief becomes firm that there is no God but Him, His mercy and compassion is Most Wide covering all His creatures. It is there that they beg and pray fervently and humbly so that their sins and mistakes are forgiven and grace is bestowed and His pleasure. After performing the prayers that night, then they went to sleep with a feeling of full happiness h tawakal and piety. Ibn 'Abbas said, \"Whoever prays two cycles of prayer or more after the Isha prayer means he has been praying all night.\" In another verse, Allah also explains the characteristics of the believers who pray this night: Their stomachs are far from their beds, they pray to their Lord with fear and hope, and they spend part of the sustenance We have given them. (as-Sajdah\/32: 16). And His word: (Are you polytheists who are luckier) or people who worship at night prostrating and standing, for fear of the hereafter and hoping for the mercy of their Lord? (az-Zumar\/39: 9). And His word: \"They sleep very little at night; and at the end of the night they ask forgiveness (of Allah).\" (adz-dzariyat\/51: 1718) g polytheists who are more fortunate) or is it the person who worships at night prostrating and standing, for fear of the (punishment) of the hereafter and hoping for the mercy of his Lord? (az-Zumar\/39: 9). And His word: \"They sleep very little at night; and at the end of the night they ask forgiveness (of Allah).\" (adz-dzariyat\/51: 1718)"
		   },
		   {
			"id": 2920,
			"surah": 25,
			"ayat": 65,
			"tafsir": "Fourth: They always remember the Hereafter and the day of reckoning. They believe that all human deeds will be accounted for on that day, the good ones will be rewarded multiplied, and the bad ones will be rewarded accordingly. When they pray with God at night, they picture in their minds how terrible the atmosphere at that time is as if they really see how fierce the fires of hell are always waiting for the rebellious servants of God to become their prey and food. At that time their tears flowed and they begged earnestly to God to be freed from the painful torments of hellfire. People who have such a strong belief in the hereafter will certainly use the opportunity to live in this world to do as many good deeds as possible and will not commit evil deeds because they believe that their actions will be rewarded with painful punishments. No matter how good a regulation is made by humans and how strict the supervision is in its implementation, humans who are not aware of Allah's supervision can escape the bondage of these regulations and laws. However, a man of faith, if there were no rules and laws, would not have committed a single crime, because he is aware that even though he could be free from punishment in this world, he would not be able to escape punishment in the hereafter. It is this awareness and conviction that is firmly planted in the heart of every Muslim who has earned the nickname \"servant of Allah, the Most Merciful.\" This verse explains how a believer is really afraid of falling into the torments of hell because the torments are very painful and terrible. Hell is the worst place prepared for God's servants who deny and disobey. The disbelievers remained in it forever, suffering various torments. Even though their skins have been scorched by fire and the heat of the fires of hell has penetrated into their flesh and bones, they still live to feel the torment as stated in His words: Verily, those who disbelieve in Our signs, We will one day put it in hell. Whenever their skins are charred, We replace them with other skins, so that they may taste the punishment. Indeed, Allah is Mighty, Most Wise. (an-Nisa'\/4: 56)."
		   },
		   {
			"id": 2921,
			"surah": 25,
			"ayat": 66,
			"tafsir": "Fourth: They always remember the Hereafter and the day of reckoning. They believe that all human deeds will be accounted for on that day, the good ones will be rewarded multiplied, and the bad ones will be rewarded accordingly. When they pray with God at night, they picture in their minds how terrible the atmosphere at that time is as if they really see how fierce the fires of hell are always waiting for the rebellious servants of God to become their prey and food. At that time their tears flowed and they begged earnestly to God to be freed from the painful torments of hellfire. People who have such a strong belief in the hereafter will certainly use the opportunity to live in this world to do as many good deeds as possible and will not commit evil deeds because they believe that their actions will be rewarded with painful punishments. No matter how good a regulation is made by humans and how strict the supervision is in its implementation, humans who are not aware of Allah's supervision can escape the bondage of these regulations and laws. However, a man of faith, if there were no rules and laws, would not have committed a single crime, because he is aware that even though he could be free from punishment in this world, he would not be able to escape punishment in the hereafter. It is this awareness and conviction that is firmly planted in the heart of every Muslim who has earned the nickname \"servant of Allah, the Most Merciful.\" This verse explains how a believer is really afraid of falling into the torments of hell because the torments are very painful and terrible. Hell is the worst place prepared for God's servants who deny and disobey. The disbelievers remained in it forever, suffering various torments. Even though their skins have been scorched by fire and the heat of the fires of hell has penetrated into their flesh and bones, they still live to feel the torment as stated in His words: Verily, those who disbelieve in Our signs, We will one day put it in hell. Whenever their skins are charred, We replace them with other skins, so that they may taste the punishment. Indeed, Allah is Mighty, Most Wise. (an-Nisa'\/4: 56)."
		   },
		   {
			"id": 2922,
			"surah": 25,
			"ayat": 67,
			"tafsir": "Fifth: Another good characteristic of believers is that they are not extravagant or miserly in spending their wealth, but still maintain a balance between the two bad traits. Extravagance will inevitably lead to the destruction of property and the destruction of society. Someone who is extravagant even though his personal and family needs have been met by living in luxury, will still squander his wealth on other pleasures, such as gambling, playing women, drinking, and so on. Thus, he destroys himself and the people around him. In fact, the wealth that God has entrusted to him must be properly cared for so that it can be of benefit to himself, his family and society. Miserliness and stinginess will also lead to loss and damage. A miserly person always tries to accumulate wealth even though he himself lives as a poor person and he doesn't want to spend his money for the benefit of society. If it's for the sake of himself and his family, he feels reluctant to spend money, let alone for the benefit of other people. Thus, the wealth will be piled up in one or several humans who are greedy and greedy. People who are like this are threatened by Allah with the fires of hell as mentioned in His word: Woe to every slanderer and detractor, who collects wealth and counts it, he (man) thinks that his wealth can make him eternal. Never! Surely he will be thrown into (hell) Hutamah. (al-Humazah\/104: 1-4). Such is the nature of the believer in spending his wealth. He is not extravagant so that he does not think about tomorrow, nor is he miserly so that he torments himself because he wants to accumulate wealth. It is the balance between the two kinds of despicable nature that is always maintained and maintained. If he is rich, he can help his people according to his wealth, and if he is poor, he can control his desires by living simply. Yazid bin Abi Habib said, \"That is the nature of the companions of the Prophet Muhammad. They did not eat for luxury and enjoy delicious food, they did not dress to boast about beauty. However, they ate just to cover their hunger. and to strengthen the body because they want to worship carrying out God's commands. They dress simply to cover their genitals and protect their bodies from the wind and heat. 'Abdul Malik bin Marwan, when he married Fatima (his daughter) to 'Umar bin 'Abdul 'Aziz, asked future son-in-law, \"How do you provide for my child?\" Umar replied, \"I choose the good of the two bad traits\" (meaning the good nature of the two bad traits, namely wasteful and miserly). Then he recited this verse."
		   },
		   {
			"id": 2923,
			"surah": 25,
			"ayat": 68,
			"tafsir": "Sixth: In this verse, Allah explains again the characteristics of the servant of Allah, the Most Gracious, the Most Merciful, that is, he does not worship other than Allah, and does not associate anything with Him. He really adheres to pure monotheism. If he worships, then his worship is only for Allah, and if he does good deeds, his actions are for Allah and not because of him or to be praised by others. When he prays, his prayers are really offered directly to God's presence, not through intermediaries. He fully believes that only God can answer his prayers. They do not kill anyone because they realize that a person's soul belongs to him. He may not be killed except with rights that have been determined by Allah, such as apostasy or killing people without rights. They will not commit adultery because they realize that adultery is a grave sin, an act which is highly condemned and displeased by Allah. By maintaining the purity of monotheism which is the basis of aqidah, a person will have a clean soul, clear mind, and cannot be swayed by misleading beliefs. By staying away from killing without rights, he will be cleansed from unjust acts and the community will be cleansed from chaos. The rights of every member of society will be properly maintained so that they can really enjoy security and peace. By protecting oneself from adultery, one will be cleansed from filth and the society will be cleansed from disturbances and lineage disturbances that cause various difficulties and instability. In connection with this, in a hadith the Prophet explained: 'Abdullah bin Mas'ud said, \"I asked the Messenger of Allah, 'What is the greatest sin? The Messenger of Allah replied,' You make a match for Allah even though He created you. I asked also, 'What other sin? Rasulullah replied,' The sin of killing your child because he is afraid (poor) because he will eat with you. Then I asked again, 'What other sin? Rasulullah replied,' The sin of adultery with your neighbor's wife. Allah revealed this verse to confirmed the words of the Prophet Muhammad. (Al-Bukhari and Muslim) Then Allah threatens those who commit these sins with a very harsh threat, namely hell on the Day of Judgment as recompense for all the sins they have committed in the world. In fact, Allah will multiply their punishment for the great sin they have committed. They will be cast into hell and will remain there. Besides suffering physical torment such as very hot drinks that burn their throats and intestines, they also suffer mental or spiritual torment, because they are always humiliated and always regret their mistakes in the past."
		   },
		   {
			"id": 2924,
			"surah": 25,
			"ayat": 69,
			"tafsir": "Sixth: In this verse, Allah explains again the characteristics of the servant of Allah, the Most Gracious, the Most Merciful, that is, he does not worship other than Allah, and does not associate anything with Him. He really adheres to pure monotheism. If he worships, then his worship is only for Allah, and if he does good deeds, his actions are for Allah and not because of him or to be praised by others. When he prays, his prayers are really offered directly to God's presence, not through intermediaries. He fully believes that only God can answer his prayers. They do not kill anyone because they realize that a person's soul belongs to him. He may not be killed except with rights that have been determined by Allah, such as apostasy or killing people without rights. They will not commit adultery because they realize that adultery is a grave sin, an act which is highly condemned and displeased by Allah. By maintaining the purity of monotheism which is the basis of aqidah, a person will have a clean soul, clear mind, and cannot be swayed by misleading beliefs. By staying away from killing without rights, he will be cleansed from unjust acts and the community will be cleansed from chaos. The rights of every member of society will be properly maintained so that they can really enjoy security and peace. By protecting oneself from adultery, one will be cleansed from filth and the society will be cleansed from disturbances and lineage disturbances that cause various difficulties and instability. In connection with this, in a hadith the Prophet explained: 'Abdullah bin Mas'ud said, \"I asked the Messenger of Allah, 'What is the greatest sin? The Messenger of Allah replied,' You make a match for Allah even though He created you. I asked also, 'What other sin? Rasulullah replied,' The sin of killing your child because he is afraid (poor) because he will eat with you. Then I asked again, 'What other sin? Rasulullah replied,' The sin of adultery with your neighbor's wife. Allah revealed this verse to confirmed the words of the Prophet Muhammad. (Al-Bukhari and Muslim) Then Allah threatens those who commit these sins with a very harsh threat, namely hell on the Day of Judgment as recompense for all the sins they have committed in the world. In fact, Allah will multiply their punishment for the great sin they have committed. They will be cast into hell and will remain there. Besides suffering physical torment such as very hot drinks that burn their throats and intestines, they also suffer mental or spiritual torment, because they are always humiliated and always regret their mistakes in the past."
		   },
		   {
			"id": 2925,
			"surah": 25,
			"ayat": 70,
			"tafsir": "In these verses, Allah explains that those who commit sinful acts as mentioned in the verse above, then repent with true repentance, return to faith, and always do good deeds, their evil deeds will be replaced with good and the reward is multiplied because Allah is Most Forgiving, Most Gracious and Most Merciful. According to some commentators, the replacement of evil sins with good rewards is to erase all sins that have been done in the past because of true repentance, then the good deeds done after repenting are multiplied in reward so that they can erase the sins that have been committed before. Other commentators say that Allah gives the repentant person a reward equal to the amount of sin he has committed. Then he repents and does good deeds, then the good deeds will be rewarded double as well. So the person who repents gets two good things, namely his previous sins are erased and then he is also given a reward equal to the number of sins he has committed. In a hadith, it is narrated that: From Abu thawil Syathab al-Mamdud, he faced the Prophet and asked, \"What do you think about a person who commits all sins, there is no sin unless he commits it. Is his repentance accepted? The Prophet replied, \" Have you converted to Islam? He replied, I myself testify that there is no god but Allah, the One and only God and He has no partner. And you are the messenger of Allah.\" The Prophet said, \"Yes, that's right. You do good and leave bad. Then Allah will make for you the good of everything.\" He asked again, \"All my mistakes are forgiven?\" \"Yes,\" replied the Prophet. ) Then Allah states that repentance that is accepted must be accompanied by good deeds. Repentance begins with regret for the evil deeds that have been carried out, and stops from doing immorality, accompanied by good deeds to prove that repentance is true repentance and is done sincerely -really (nasuha)."
		   },
		   {
			"id": 2926,
			"surah": 25,
			"ayat": 71,
			"tafsir": "In these verses, Allah explains that those who commit sinful acts as mentioned in the verse above, then repent with true repentance, return to faith, and always do good deeds, their evil deeds will be replaced with good and the reward is multiplied because Allah is Most Forgiving, Most Gracious and Most Merciful. According to some commentators, the replacement of evil sins with good rewards is to erase all sins that have been done in the past because of true repentance, then the good deeds done after repenting are multiplied in reward so that they can erase the sins that have been committed before. Other commentators say that Allah gives the repentant person a reward equal to the amount of sin he has committed. Then he repents and does good deeds, then the good deeds will be rewarded double as well. So the person who repents gets two good things, namely his previous sins are erased and then he is also given a reward equal to the number of sins he has committed. In a hadith, it is narrated that: From Abu thawil Syathab al-Mamdud, he faced the Prophet and asked, \"What do you think about a person who commits all sins, there is no sin unless he commits it. Is his repentance accepted? The Prophet replied, \" Have you converted to Islam? He replied, I myself testify that there is no god but Allah, the One and only God and He has no partner. And you are the messenger of Allah.\" The Prophet said, \"Yes, that's right. You do good and leave bad. Then Allah will make for you the good of everything.\" He asked again, \"All my mistakes are forgiven?\" \"Yes,\" replied the Prophet. ) Then Allah states that repentance that is accepted must be accompanied by good deeds. Repentance begins with regret for the evil deeds that have been carried out, and stops from doing immorality, accompanied by good deeds to prove that repentance is true repentance and is done sincerely -really (nasuha)."
		   },
		   {
			"id": 2927,
			"surah": 25,
			"ayat": 72,
			"tafsir": "Seventh: In this verse, Allah explains that one of the characteristics of a servant of Allah, the Most Compassionate, is that he does not want to and never commits perjury. When passing in front of people who like to say things that are not good and have no benefit at all, he left without joining them. He realized that a believer is not worthy of serving people who waste their precious time on nonsense, especially if that time is used to talk about things that lead to sinful acts such as gossiping about people or accusing innocent people and others and so on. Swearing falsely is strictly prohibited in Islam, because when swearing it, someone has lied and has not stated the truth. There are so many people who commit perjury to defend people who are not right so that people can usurp or have other people's rights and commit injustice. In fact, if he does not participate in the oath, of course those rights will be real and clear, and there will be no injustice or deprivation of rights. As a believer, he must stand on the right side and must feel responsible for upholding justice and eradicating injustice. Umar bin Khaththab was very angry with people who committed perjury and he once whipped a person who perjured 40 times, smeared his face with black, shaved all his head of hair, and then paraded him in the middle of the market. The character and attitude of these praiseworthy servants of Allah are described by Allah in His word: And when they hear bad words, they turn away from them and say, \"To us our deeds and to you our deeds, may you be safe, we don't want to (associate) with stupid people.\" (al-Qasas\/28: 55)."
		   },
		   {
			"id": 2928,
			"surah": 25,
			"ayat": 73,
			"tafsir": "Eighth: In this verse, Allah explains the nature of His servants, that is, they can respond to a warning given by Allah if they hear the warning. Their hearts are always open to receive advice and lessons, their minds are always contemplating Allah's verses to be understood and practiced, so that their faith and belief increases that the teachings that Allah has given them are truly teachings of high value and quality, teachings which is undeniably true. It is not surprising that they are very fanatical about this teaching, because they really believe in its goodness. There is a very big difference between them and the polytheists who are also fanatical about their worship. Their fanaticism is blind fanaticism because they do not want to accept the truth even though it is clear and obvious that the creed they hold is wrong and contrary to common sense. No matter how strong and clear the reasons put forward to them about the untruths of their understanding they will not want to accept it because their hearts are closed and their eyes are blind to think about what is right and what is wrong."
		   },
		   {
			"id": 2929,
			"surah": 25,
			"ayat": 74,
			"tafsir": "Ninth: Among the characteristics of God's servants is that they always pray and ask Him to be blessed with pious and good offspring. His wife and children are truly heartwarming and soothing because their family consists of people who are pious and fear God. Thus, there will be more and more servants of Allah, the Most Gracious, the Most Merciful, on this earth. In addition, they pray to Allah so that their descendants become people who are completely pious, become callers for people to be pious, and become leaders for those who are pious. This is the light of faith that has filled their hearts and illuminated them with guidance and guidance so that they are eager for more and more pious people who receive guidance. Their desire for their children and grandchildren to become leaders for pious people is not because they want a high position or absolute power, but solely because of their sincere desire for the world's population to be filled with people who believe and are pious. It is also intended that their children and grandchildren will continue their struggle to uphold justice and truth. Thus, even though they themselves have died, they still receive the reward for the struggle of their children and grandchildren in accordance with the words of the Prophet: \"When a person dies, all his deeds are cut off except from three kinds: alms that can be used by people, knowledge left behind that can be taken benefits by others after his death, a pious child who always prays for him.\" (Muslim history from Abu Hurairah). These are the nine good qualities possessed by the servants of Allah, the Most Merciful. If someone has these characteristics, then they are entitled to get that nickname. People who get nicknames will surely be loved by Allah and in the hereafter will receive gifts and graces that are very noble and great."
		   },
		   {
			"id": 2930,
			"surah": 25,
			"ayat": 75,
			"tafsir": "In these two verses, Allah explains the rewards and gifts that will be given to the \"servants of Allah, the Most Merciful\", servants of Allah who have perfect qualities and noble morals thanks to their patience and tenacity in obeying all of Allah's commands. , thanks to their patience and tenacity against their passions in staying away from all His prohibitions. They are placed in the most noble and high place in heaven. They were greeted by the angels with greetings in honor of them. This is illustrated in God's word: \"While the angels enter their places from all doors; (while saying), 'Peace be upon you because of your patience. Then how delicious is the place of the end.\" (ar-Ra'd\/13: 23-24). Then Allah explained that the gifts and favors they received were eternal gifts and favors that never stop. There is no doubt that that place is the best place to live and the best place to live."
		   },
		   {
			"id": 2931,
			"surah": 25,
			"ayat": 76,
			"tafsir": "In these two verses, Allah explains the rewards and gifts that will be given to the \"servants of Allah, the Most Merciful\", servants of Allah who have perfect qualities and noble morals thanks to their patience and tenacity in obeying all of Allah's commands. , thanks to their patience and tenacity against their passions in staying away from all His prohibitions. They are placed in the most noble and high place in heaven. They were greeted by the angels with greetings in honor of them. This is illustrated in God's word: \"While the angels enter their places from all doors; (while saying), 'Peace be upon you because of your patience. Then how delicious is the place of the end.\" (ar-Ra'd\/13: 23-24). Then Allah explained that the gifts and favors they received were eternal gifts and favors that never stop. There is no doubt that that place is the best place to live and the best place to live."
		   },
		   {
			"id": 2932,
			"surah": 25,
			"ayat": 77,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to tell the disbelievers that because of their disbelief, arrogance, and arrogance, Allah will not care about them in the least. They will never get the gift given to those who believe, they will even get the appropriate reward, namely the hell of Hell. They will be thrown into it and get torture that cannot be described how painful it is and will last forever in that hell."
		   }
	]
}
