{
    "kisah": {
	"nabi": [
	    {
		"no": 1,
                "name_id": "Nabi Adam AS",
		"name_eng": "Prophet Adam AS",
		"arab": "آدم عَلَیهِ‌ السَّلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Nabi-Adam.png",
		"isi": "Kisah Nabi Adam menceritakan terciptanya manusia pertama yang kelak akan menghuni bumi. Nabi Adam tercipta dari tanah dan Allah memuliakannya dengan memberi pengetahuan tentang semesta. Adam diberi banyak pengetahuan yang akan menjadi Mukjizatnya.<br><br>Wujud Nabi Adam diciptakan sempurna serta lengkap. Tapi Nabi Adam memiliki tinggi tubuh yang berbeda dengan manusia saat ini. Tinggi badannya mencapai 60 hasta atau sekitar 18 meter. Sangat tinggi dibanding kondisi tubuh manusia pada umumnya. Jadi bisa menjelaskan juga kenapa Kabah sangat tinggi dan besar pintu masuknya. Para nabi setelah Nabi Adam juga pasti memiliki postur tubuh yang hampir mirip.<br><br>Mukjizat pengetahuan yang dimiliki Nabi Adam diterangkan pula dalam Alquran, “Dan Dia mengajarkan kepada Adam nama-nama (benda) seluruhnya” (QS Al Baqarah : 31). Dalam Alquran juga diceritakan tentang penciptaan Nabi Adam dan Siti Hawa. Tentang bagaimana sampai mereka diturunkan ke bumi dan memiliki anak-anak.<br><br>Kisah Nabi Adam mengandung banyak pelajaran berharga. Terutama tentang nilai ketaatan kepada Yang Maha Kuasa. Mulai dari kisah Nabi Adam dan Siti Hawa di langit. Hingga kisah mereka di bumi beserta anak-anaknya. Nilai ketaatan seorang hamba pada Sang Pencipta banyak terkandung di dalam ceritanya.\n\n<h4>Asal Mula Penciptaan Nabi Adam</h4>\nDikisahkan dalam kitab suci Alquran bahwa Allah bercakap-cakap dengan malaikat. Allah memberi tahu malaikat bahwa akan ada penciptaan makhluk yang dinamai manusia.<br><br>Manusia akan mengemban tugas sebagai Khalifah di bumi.  Malaikat protes, tidak setuju dengan hal yang direncanakan. Malaikat yakin kalau manusia hanya akan membawa bencana bagi bumi. Mereka akan membuat kerusakan, permusuhan, juga pertumpahan darah. Malaikat merasa keberadaan dirinya saja sudah lebih cukup sebagai ciptaan Allah. Karena mereka senantiasa bertasbih, memuji, dan mengagungkan Allah.<br><br>Allah berfirman bahwa Dia mengetahui apa-apa yang tidak diketahui oleh malaikat.  Seperti kita ketahui, manusia itu tercipta dari saripati tanah. Demikian juga yang diceritakan dalam Alquran surat  As Sajdah ayat 7-9 :<br><br><i>Yang memperindah segala sesuatu yang Dia ciptakan dan yang memulai penciptaan manusia dari tanah (7), kemudian Dia menjadikan keturunannya dari sari pati air yang hina (air mani)(8). Kemudian Dia menyempurnakannya dan meniupkan roh (ciptaan)-Nya ke dalam (tubuh)nya dan Dia menjadikan pendengaran, penglihatan dan hati bagimu, (tetapi) sedikit sekali kamu bersyukur (9). Q.S. As Sajdah ayat 7 – 9.</i><br><br>Surat ini menceritakan bahwa Allah mengetahui hal yang gaib dan nyata. Dia menciptakan wujud sempurna manusia dari tanah. Dia juga menciptakan keturunan manusia dari air mani. Kemudian ditiupkan roh untuk menghidupkan. Dia juga yang menciptakan pendengaran, penglihatan dan hati.<br><br>Setelah Nabi Adam diciptakan, Allah memberi perintah pada malaikat dan iblis untuk bersujud padanya. Walaupun para malaikat diciptakan dari cahaya, mereka taat pada perintah Allah. Para malaikat kemudian bersujud pada Nabi Adam.<br><br>Lain halnya dengan iblis, ia merasa derajatnya lebih tinggi dari Nabi Adam dan menolak untuk bersujud. Iblis memang diciptakan dari api itu sebabnya ia tidak mau bersujud pada Nabi Adam. Adam yang diciptakan dari tanah dianggap lebih hina kemuliaannya oleh iblis.<br><br>Surat Al Baqarah ayat 34 menjelaskan hal ini, “Sujudlah kamu kepada Adam, maka sujudlah mereka kecuali iblis, ia enggan dan takabur dan ia termasuk golongan orang-orang yang kafir.”<br><br>Kelancangan iblis membangkang membuat Allah sangat murka. Iblis telah durhaka, dan hukumannya adalah keluar dari surga. Iblis yang sombong bukannya bertobat dengan hukuman yang diberikan. Ia malah mengeluarkan sumpah akan menggoda Nabi Adam dan keturunannya agar sesat. Iblis ingin manusia menemani dirinya di neraka. Nabi Adam dianugerahi usia yang panjang oleh Allah.<br><br>Banyak riwayat yang menceritakan bahwa Nabi Adam diberi usia hingga 1000 tahun. Namun, dalam hadits yang diriwayatkan Abu Hurairah diceritakan kalau Nabi Adam pernah memberikan umurnya sejumlah 40 tahun untuk Nabi Dawud. Pada saat itu Nabi Adam kagum dengan cahaya yang berkilau di antara matanya. Kemudian ia bertanya pada Allah tentang manusia itu. Allah menjawab bahwa manusia itu salah satu keturunan Adam, umat akhir zaman.  Adam bertanya mengenai umur Daud, dan Allah menjawab bahwa Dia memberikan 60 tahun padanya. Nabi Adam lalu meminta Allah untuk menambahkan 40 tahun umur Daud yang dikurangi dari umurnya.\n\n<h4>Nabi Adam dan Siti Hawa Turun ke Bumi</h4>\nNabi Adam memiliki segalanya di surga. Adam bisa mengambil dan menikmati apa saja yang ada di dalamnya. Walaupun begitu Adam merasa kesepian. Kodratnya sebagai manusia yang butuh ada manusia lain muncul. Adam menginginkan teman untuk menemani hari-harinya.<br><br>Mengetahui Adam yang kesepian, Allah akhirnya menciptakan Hawa. Hawa diciptakan dari tulang rusuk Nabi Adam ketika sedang tidur. Nabi sangat senang dengan kehadiran Hawa. Hasratnya sebagai manusia yang butuh pasangan jadi terjawab. Allah mengizinkan Adam dan Hawa untuk menikmati apa saja yang ada di dalam surga, terkecuali pohon Khuldi.<br><br><i>Allah berfirman, “Wahai Adam, tinggallah Engkau dan istrimu di surga ini. dan makanlah makanan-makanan yang banyak lagi baik dimana saja yang kamu sukai, dan janganlah kamu mendekati pohon ini, yang menyebabkan kamu termasuk orang-orang yang zalim.”</i><br><br>Pohon khuldi adalah pohon pengetahuan hal yang baik dan jahat. Ada maksud tertentu dari larangan yang Allah berikan pada Adam dan Hawa. Mengetahui larangan Allah, setan memanfaatkan hal ini untuk menggoda keimanan Adam dan Hawa. Sesuai dengan tekadnya untuk menggoda manusia sepanjang masa. Setan kemudian berbisik pada Adam dan Hawa tentang keistimewaan pohon Khuldi. Kisah ini  tertulis di  Alquran surat Thaha ayat 120 :<br><br><i>“Wahai Adam, maukah aku tunjukkan kepadamu pohon keabadian (khuldi) dan kerajaan yang tidak akan binasa?”</i><br><br>demikian iblis membujuk mereka. Khuldi sendiri merupakan nama pemberian iblis. Iblis menghasut Adam dan Hawa dengan mengatakan maksud Allah melarang mereka. Bahwa Allah disebutkan oleh iblis tidak mau membuat Adam dan Hawa kekal. Iblis dengan penuh semangat merayu mereka untuk memakan buah terlarang.<br><br>Adam dan Hawa yang dilengkapi dengan napsu sebagai manusia akhirnya tergoda. Rayuan iblis berhasil menggoyahkan keimanan mereka dan jadi tidak taat pada Allah. Ketika Adam dan Hawa memakan buah Khuldi sesuatu yang memalukan terjadi. Nabi Adam dan Hawa  menyadari kalau tubuh mereka jadi telanjang. Selain itu, Adam juga merasakan sakit perut yang hebat. Adam baru merasakan rasa ingin buang hajat, dan ia kebingungan.<br><br>Surga adalah tempat suci, apa sepantasnya mengotorinya? Demikian yang ada dalam pikiran Adam. Allah kemudian menyindirnya atas keinginan tersebut. Sekaligus juga menyindir tentang ketidaktaatannya. Surat Al A’raf ayat 22-23 menceritakan kejadian ini.<br><br>Dalam surat ini Allah mengingatkan akan larangannya pada Adam. Juga mengingatkan Adam akan peringatan-Nya tentang kebusukan setan. Adam kemudian memohon ampun dan bertaubat pada Allah.<br><br>Diceritakan Hawa digoda iblis dalam wujudnya yang berupa ular. Namun, tidak dijelaskan siapa dahulu yang memakan buah terlarang itu. ada yang meyakini Khuldi adalah pohon apel yang diambil dari bumi. Karena itu Khuldi disebut memiliki sifat bumi atau tanah, yaitu sifat dasar tanah. Tanah disebut sebagai tempat yang pantas untuk membuang kotoran. Buah Khuldi bisa membangkitkan hawa nafsu, dan membuat lupa diri.<br><br>Allah melarang Adam memakan buahnya karena bisa membuat dirinya jadi kotor. Kotor dalam artian napsunya ternoda dan mempengaruhi sifat dasar manusia yang penuh dengan ketidakpuasan. Bisa dikatakan pohon Khuldi diciptakan sebagai cobaan bagi Adam dan Hawa. Ujian dari ketaatan seorang hamba pada penciptanya. Namun terlepas dari itu semua, Allah memang menakdirkan manusia untuk turun ke bumi dan menjadi pemimpin di tempat itu. Manusia diciptakan bukan dengan maksud untuk pemimpin di surga. Meskipun Adam dan Hawa telah bertaubat, Allah tetap memberikan hukuman pada mereka dengan turun ke bumi.<br><br><i>“Turunlah kalian dari surga menuju bumi. Dan kalian akan menjadi musuh satu sama lain. kalian akan memiliki tempat tinggal di bumi sampai batas waktu tertentu.” Qs. Al A’raf 24-25.</i><br><br>Nabi Adam dan Hawa tidak diturunkan pada tempat yang sama. Nabi Adam diturunkan di puncak bukit Sri Pada di daerah Srilanka. Sedangkan Hawa diturunkan di daerah Arab. Mereka berdua bingung dan sedih karena diturunkan terpisah. Namun, Adam dan Hawa yakin satu sama lainnya akan saling bertemu lagi.<br><br>Lalu setelah 40 hari mereka pun dipertemukan kembali oleh Allah di Jabal Rahmah. Nabi Adam dan Hawa memulai kehidupan baru sebagai manusia biasa. Diceritakan mereka diturunkan ke bumi dengan membawa dosa atas ketidaktaatannya di surga. Disebutkan pula Allah menghukum Adam akan bersusah payah untuk mencari nafkah. Hawa dihukum akan merasakan sakit pada saat melahirkan anak-anak. Sedangkan ular yang menggoda mereka dihukum berjalan dengan perut selamanya di bumi. Dosa yang pada akhirnya menjadi takdir bagi manusia. Kaum laki-laki dengan kewajiban menafkahi, dan kaum wanita berkewajiban mengurus anak-anaknya.<br><br>Adam dan Hawa kemudian belajar bercocok tanam juga cara bertahan hidup di bumi. Mereka juga melahirkan anak-anaknya. Allah memperlihatkan kuasanya dengan memberi mereka anak sepasang-sepasang. Setiap Hawa mengandung pasti melahirkan anak kembar. Peristiwa Nabi Adam dan Hawa yang melanggar perintah Allah membuktikan sesuatu. Bahwa tidak ada yang akan didapat dari ketidaktaatan pada Allah selain dari keburukan. Hal ini sekaligus menjadi pengingat bagi kita umat manusia di seluruh muka bumi.\n\n<h4>Kisah Kehidupan Nabi Adam dan Hawa di Bumi</h4>\nAda cerita menarik dari peristiwa turunnya Nabi Adam dan Hawa ke bumi. Diceritakan mereka turun ke bumi dengan memakai dedaunan untuk menutupi tubuhnya. Ketika berada di bumi dedaunan itu jadi kering dan kemudian rontok. Dipercaya segala wewangian yang tercium di Hindia berasal dari daun-daun tersebut. Adam dan Hawa menjalani kehidupan sebagai manusia biasa setelah bertemu.<br><br>Allah kemudian memberikan 8 pasang lembu, 2 pasang kambing, dan 2 pasang domba pada keduanya. Allah mengajarkan pada mereka untuk memerah susu hewan-hewan itu. Susu tersebut kemudian bisa mereka minum.  Allah juga memberi perintah pada Adam untuk menggunakan bulu-bulu hewan itu sebagai pakaian. Adam dan Hawa sadar kenikmatan dunia sudah tidak ada lagi, mereka pun menangis sedih. Dari air mata mereka, tumbuh lah kacang tanah dan kacang hijau.<br><br>Adam lalu menyadari kesulitannya untuk mengetahui waktu-waktu beribadah. Ia lalu mengadu pada Allah tentang masalahnya ini. Allah kemudian memberi seekor ayam putih sebesar unta dari surga. Ketika para malaikat di surga bertasbih, ayam putih itu ikut bertasbih (berkokok) di bumi. Berkat ayam putih itu Adam jadi mengetahui waktu-waktu beribadah di bumi.<br><br>Untuk melindungi mereka dari panas dan dingin, Adam lalu menebang pohon-pohon. Kayunya ia pakai untuk membangun rumah. Adam juga membuat sumur untuk mengambil air. Allah kemudian menurunkan 21 lampiran tentang hukum haram dan halal memakan dagingbinatang tertentu.<br><br>Kemudian diturunkan pula 29 huruf hijaiyyah, dan manusia tidak dapat mengurangi atau menambah hurufnya. Ketentuan Allah ini sangat jelas dan tidak ada yang bisa mengubahnya. Adam lalu belajar huruf-huruf itu untuk bisa membaca lampiran yang diturunkan Allah.<br><br>Hawa kemudian merasakan proses mengandung. Ia terkejut ketika janin dalam perutnya bergerak-gerak. Hawa tidak yakin darimana tempatnya yang bergerak di perutnya itu akan keluar. Ketika waktu melahirkan tiba, Hawa merasakan proses sakitnya. Hawa melahirkan anak kembar, Habil dan Layutsa.<br><br>Waktu mengandung anak yang kedua pun tiba. Hawa melahirkan anak kembar Qabil dan Iqlima. Sepasang anak laki-laki dan perempuan selalu dilahirkan olehnya. Diceritakan Hawa melahirkan dan mengandung sejumlah 20 bilangan. Setiap melahirkan pasti sepasang, laki-laki dan perempuan.<br><br>Diceritakan juga anak yang dikandung hawa sebanyak 200 orang. Semua dilahirkan kembar kecuali Syits yang memiliki Nur Musthafa Shallalahu’alaihi wa sallam di keningnya. Dikisahkan juga anak cucu Nabi Adam bertambah terus hingga 40 ribu orang laki-laki dan perempuan. Pada saat anak cucu Adam berkembang banyak terjadilah pertengkaran dan pertikaian. Maka Allah memberinya tongkat dari surga untuk mendidik mereka yang membangkang.\n\n<h4>Kisah Habil dan Qabil</h4>\nAnak kembar Nabi Adam yang pertama adalah Habil dan Layutsa. Sedangkan anak kembar kedua adalah Qabil dan Iqlima. Kembaran Habil diceritakan memiliki paras yang kurang menarik. Sedangkan Iqlima kembaran  dari Qabil sangat cantik.<br><br>Pada saat itu Adam diperintahkan oleh Allah untuk menikahkan anak-anaknya secara silang. Jadi tidak boleh anak dari Adam menikah dengan kembarannya sendiri. ketika Adam hendak menikahkan Habil dengan Iqlimiya, Qabil mengajukan protes. Qabil merasa lebih berhak atas diri Iqlimiya karena dia adalah saudara kembarnya.<br><br>Qabil tertarik pada kembarannya sendiri karena kecantikannya. Allah kemudian memerintahkan Habil dan Qabil untuk berkurban melalui Nabi Adam. Kurban yang diterima Allah akan menentukan siapa yang berhak atas Iqlimiya.  Qabil yang seorang petani dan sombong memilih seikat gandum yang jelek untuk berkurban. Sedangkan Qabil yang peternak mengurbankan kambing muda dan gemuk. Setelah keduanya berkurban, Allah kemudian menurunkan cahaya putih dan mengangkat kambing dari Habil.<br><br>Berarti Habil yang ikhlas berkurban berhak atas diri Iqlimiya. Qabil marah, dan tak ingin Habil menikahi kembarannya. Setan memanfaatkan kemarahan Qabil dan membujuknya untuk memukul Habil. Qabil yang dikuasai amarah lalu memukul Habil. Habil tidak memberikan perlawanan karena tidak ingin menjadi masalah besar. Celakanya, pukulan Qabil membuat Habil terbunuh. Qabil takut dan bingung, ia tidak tahu cara menyembunyikan Habil yang telah tak bernyawa.<br><br>Qabil mencoba membuang Habil ke laut, tapi ombak selalu membawa kembali tubuh Habil ke tepi pantai. Akhirnya Qabil mohon ampun pada Allah dan menyesali perbuatannya. Tiba-tiba Qabil melihat burung gagak di pohon. Satu burung gagaknya telah mati entah karena apa. Gagak yang masih hidup membawa gagak mati turun. Burung itu lalu mematuki tanah hingga berlubang dan mendorong gagak mati ke dalamnya. Qabil mengerti sekarang, ia pun meniru cara burung tersebut untuk mengubur Habil. Cerita Habil dan Qabil ini merupakan pembunuhan pertama di bumi. Kisah Nabi Adam ternyata mengandung banyak nasehat untuk umat manusia. Tentang ketaatan dan ketergantungan manusia sebagai hamba kepada Allah. sekaligus juga tentang kebesaran Allah yang selalu memberi kemudahan manusia ketika meminta pertolongan.\n\n<h4>Kisah Wafatnya Nabi Adam</h4>\nNabi-nabi merupakan orang-orang dengan kualitas rohani yang luar biasa. Namun sebagaimana umumnya manusia, secara fisik mereka memiliki keterbatasan-keterbatasan. Mereka makan, minum, istirahat, dan juga meninggal dunia. Sifat-sifat manusiawi ini pula yang dimiliki Nabi Adam 'alaihissalam. Beliau didiciptakan oleh Allah sebagai manusia pertama, lalu bersama sang istri Hawa hidup di bumi dengan batas usia yang sudah ditetapkan.<br><br>Nabi Adam dianugerahi karunia bisa merasakan detik-detik akhir masa hidupnya. Sehingga ketika ajal itu hendak datang, Nabi Adam tampak seperti telah mempersiapkan semuanya. Nabi Adam memulainya dengan mengajukan permintaan terakhir kepada putra-putranya, yakni ingin memakan buah surga. Permintaan ini sulit bila harus dimaknai secara harfiah, karena di alam dunia yang serbafana ini buah surga mustahil ditemukan. Surga hanya ada di alam akhirat.<br><br>Sebab itulah, ada ulama yang menafsirkan bahwa permintaan akan buah surga merupakan isyarat bahwa Nabi Adam tengah dilanda rindu akan kebahagiaan surgawi yang pernah beliau tinggali sebelum turun ke bumi. Inilah sinyal bahwa kawafatan beliau semakin dekat. Meski demikian, sebagai anak berbakti, para putra Nabi Adam tetap berangkat mencarikan buah surga.<br><br>Namun, tak jauh usai meninggalkan sang ayah, perjalanan mereka dihadang oleh sejumlah lelaki.<br><i>“Wahai anak-anak Adam, apa yang kalian cari? Atau apa yang kalian mau? Dan ke mana kalian pergi?”</i><br>Mereka menjawab, <i>“Bapak kami sakit, beliau ingin makan buah dari Surga.”</i><br><i>“Pulanglah, karena ketetapan untuk bapak kalian telah tiba, ”</i><br>pinta para lelaki itu yang ternyata adalah para malaikat yang sedang menjelma manusia. Di tangan mereka sudah tersedia kafan, wewangian, serta sejumlah perangkat yang lazim diperlukan untuk menggali kubur: kapak, cangkul, dan sekop.<br><br>Saat para malaikat itu datang, Hawa melihat dan mengenali mereka, maka ia pun berlindung kepada Nabi Adam.<br><i>“Menjauhlah dariku. Aku pernah melakukan kesalahan karenamu. Biarkan aku dengan malaikat Tuhanku”</i><br>kata Nabi Adam kepada Hawa.<br><br>Para malaikatlah yang mencabut nyawa Nabi Adam, lantas memandikannya, mengkafaninya, memberinya wewangian, menyiapkan liang lahad, juga menshalatinya. Selanjutnya mereka turun ke kuburnya, memasukkan jenazah Adam ke dalam, lalu mereka meletakkan bata di atasnya. Usai naik ke atas kubur, mereka pun menimbunnya dengan batu.<br><br>Mereka berseru, \"Wahai anak cucu Adam, ini adalah sunnah kalian.\"<br><br>Rupanya Nabi Adam mempersiapkan pelajaran berharga bagi generasi berikutnya tentang bagaimana semestinya memperlakukan orang meninggal. Manusia tak hanya dihormati ketika masih hidup tapi juga saat mereka mati. Standar penghormatan pun tak berlebihan. Tak ada prosesi pembakaran mayat, mutilasi tubuh, menempeli jenazah dengan perhiasan, atau semacamnya. Namun, semua pelajaran tersebut cukup menggambarkan bahwa manusia itu pada dasarnya mulia, namun kehidupan duniawinya pasti berujung fana. Dari tanah kembali ke tanah.",
                "isi_eng": "The story of Prophet Adam tells of the creation of the first humans who would later inhabit the earth. Prophet Adam was created from soil and Allah glorified him by giving him knowledge about the universe. Adam was given a lot of knowledge which would become a miracle. <br><br>The form of Prophet Adam was created perfect and complete. But Prophet Adam had a different height than humans today. His height reached 60 cubits or around 18 meters. Very high compared to the condition of the human body in general. So this can also explain why the Kaaba is so tall and has a large entrance. The prophets after Prophet Adam also certainly had almost similar body postures.<br><br>The miracle of knowledge possessed by the Prophet Adam is also explained in the Koran, \"And He taught Adam the names (things) of all\" (QS Al Baqarah: 31). The Koran also tells about the creation of the Prophet Adam and Siti Hawa. About how they came to be sent down to earth and had children.<br><br>The story of Prophet Adam contains many valuable lessons. Especially about the value of obedience to the Almighty. Starting from the story of Prophet Adam and Siti Hawa in the sky. Until their story on earth and their children. The value of a servant's obedience to the Creator is contained a lot in the story.\n\n<h4>The Origin of the Creation of the Prophet Adam</h4>\nIt is told in the holy book of the Qur'an that Allah spoke with the angels. Allah told the angels that there would be the creation of a creature called man.<br><br>Man will carry out the task of being a Caliph on earth. The angels protested, disagreeing with what was planned. The angels were convinced that humans would only bring disaster to the earth. They would cause damage, hostility, and bloodshed. The angels felt that their own existence was enough as Allah's creation. Because they always glorify, praise, and glorify Allah.<br><br>Allah said that He knows things that the angels do not know. As we know, humans are created from the essence of the earth. This is also told in the Qur'an, Surah As Sajdah, verses 7-9:<br><br><i>The one who beautified everything that He created and who started the creation of humans from earth (7), then He made their offspring from the essence of lowly water (semen)(8). Then He perfected it and breathed His spirit (creation) into its (body) and He made hearing, sight and heart for you, (but) you were very little grateful (9). Q.S. As Sajdah verses 7 – 9.</i><br><br>This surah tells us that Allah knows the unseen and the real. He created the perfect human form from earth. He also created human offspring from semen. Then breathe in the spirit to revive it. He also created hearing, sight and heart.<br><br>After Prophet Adam was created, Allah ordered the angels and devils to prostrate to him. Even though angels were created from light, they obey God's commands. The angels then prostrated themselves to Prophet Adam. <br><br>Unlike the devil, he felt his rank was higher than Prophet Adam and refused to prostrate. The devil was created from fire, that's why he didn't want to bow down to Prophet Adam. Adam, who was created from clay, was considered inferior in glory by the devil.<br><br>Surah Al Baqarah verse 34 explains this, \"Prostrate yourself to Adam, then bow down to them except the devil, he is reluctant and arrogant and he is among those who those who disbelieve.\"<br><br>The devil's audacity to disobey made Allah very angry. Satan has disobeyed, and his punishment is to leave heaven. The arrogant devil instead of repenting with the punishment given. He even vowed to tempt Prophet Adam and his descendants to go astray. The devil wants humans to accompany him in hell. Prophet Adam was given a long life by Allah.<br><br>Many traditions tell that Prophet Adam was given an age of up to 1000 years. However, in the hadith narrated by Abu Hurairah, it is said that the Prophet Adam once gave his life of 40 years to the Prophet Dawud. At that time, the Prophet Adam was amazed by the light that shone between his eyes. Then he asked Allah about the human. Allah replied that the human was one of Adam's descendants, the people of the end times. Adam asked about David's age, and Allah replied that He gave him 60 years. Prophet Adam then asked Allah to add 40 years to David's age that were subtracted from his age.\n\n<h4>Prophet Adam and Siti Hawa Descended to Earth</h4>\nProphet Adam had everything in heaven. Adam could take and enjoy anything in it. Even so, Adam felt lonely. His nature as a human being who needed other humans emerged. Adam wanted a friend to accompany his days.<br><br>Knowing that Adam was lonely, Allah finally created Eve. Eve was created from the rib of Prophet Adam while he was sleeping. The Prophet was very happy with Eve's presence. His desire as a human being who needed a partner was answered. Allah allowed Adam and Eve to enjoy everything in Paradise, except the Khuldi tree.<br><br><i>Allah said, “O Adam, dwell you and your wife in Paradise, and eat plenty of food. and good wherever you wish, and do not approach this tree, lest you be among the wrongdoers.”</i><br><br>The tree of khuldi is the tree of knowledge of good and evil. There is a specific purpose from the prohibition that Allah gave to Adam and Eve. Knowing Allah's prohibition, Satan took advantage of this to tempt Adam and Eve's faith. In accordance with his determination to tempt humans throughout time. Satan then whispered to Adam and Eve about the specialness of the Khuldi tree. This story is written in Quran Surah Thaha verse 120:<br><br><i>\"O Adam, shall I show you the tree of eternity (khuldi) and a kingdom that will not be destroyed?\"</i><br><br>thus the devil tempted them . Khuldi itself is the name given by the devil. The devil incited Adam and Eve by saying that God's intention was to forbid them. That God was mentioned by the devil did not want to make Adam and Eve eternal. The devil eagerly seduced them to eat the forbidden fruit.<br><br>Adam and Eve who was equipped with lust as a human was finally tempted. The devil's seduction succeeded in shaking their faith and they became disobedient to Allah. When Adam and Eve ate the fruit of Khuldi something shameful happened. Prophet Adam and Eve realized that their bodies were naked. In addition, Adam also felt a great stomachache. Adam just felt the urge to defecate, and he was confused. <br><br>Heaven is a holy place, is it right to dirty it? That was what was in Adam's mind. Allah then teased him about this desire. At the same time also alludes to his disobedience. Surah Al A'raf verses 22-23 relate this incident.<br><br>In this letter Allah reminds Adam of His prohibition. Also reminds Adam of His warning about the corruption of Satan. Adam then begged forgiveness and repented to Allah.<br><br>It is said that Eve was tempted by the devil in the form of a snake. However, it is not explained who first ate the forbidden fruit. Some believe that Khuldi is an apple tree taken from the earth. Therefore, Khuldi is said to have the nature of the earth or soil, namely the basic nature of the soil. The soil is said to be a suitable place to dispose of waste. Khuldi fruit can arouse lust, and make you forget yourself.<br><br>Allah forbade Adam to eat its fruit because it could make him dirty. Dirty in the sense that his lust is tainted and affects the basic nature of humans who are full of dissatisfaction. It can be said that the Khuldi tree was created as a test for Adam and Eve. A test of a servant's obedience to his creator. However, apart from all that, Allah did indeed predestinate humans to come down to earth and become leaders in that place. Humans were not created with the intention of being leaders in heaven. Even though Adam and Eve had repented, Allah still punished them by coming down to earth.<br><br><i>“Go down from heaven to earth. And you will be enemies to each other. You will have a place to live on earth for a certain time.” Qs. Al A’raf 24-25.</i><br><br>Prophet Adam and Eve were not sent down to the same place. Prophet Adam was sent down on the top of Sri Pada hill in Sri Lanka. While Eve was sent down in the Arab region. They were both confused and sad because they were sent down separately. However, Adam and Eve were sure that they would meet again.<br><br>Then after 40 days they were reunited by Allah on Jabal Rahmah. Prophet Adam and Eve began a new life as ordinary humans. It is said that they were sent down to earth carrying sins for their disobedience in heaven. It is also said that Allah punished Adam to struggle to earn a living. Eve was punished to feel pain when giving birth to children. While the snake that tempted them was punished to walk on its belly forever on earth. Sins that ultimately became the destiny of humans. Men are obliged to provide for their children, and women are obliged to take care of their children.<br><br>Adam and Eve then learned to farm and survive on earth. They also gave birth to their children. God showed his power by giving them pairs of children. Every time Eve was pregnant, she would give birth to twins. The incident of Prophet Adam and Eve who violated God's command proves something. That there is nothing to be gained from disobedience to God other than evil. This is also a reminder for us humans throughout the face of the earth.\n\n<h4>The Story of the Life of Prophet Adam and Eve on Earth</h4>\nThere is an interesting story from the event of the descent of Prophet Adam and Eve to earth. It is said that they descended to earth wearing leaves to cover their bodies. When they were on earth, the leaves dried up and then fell off. It is believed that all the fragrances that can be smelled in the Indies came from these leaves. Adam and Eve lived as ordinary humans after they met.<br><br>Allah then gave them 8 pairs of cows, 2 pairs of goats, and 2 pairs of sheep. Allah taught them to milk the animals. They could then drink the milk. Allah also gave Adam the command to use the fur of the animals as clothing. Adam and Eve realized that the pleasures of the world were no longer there, and they cried sadly. From their tears, peanuts and green beans grew.<br><br>Adam then realized his difficulty in knowing the times of worship. He then complained to Allah about this problem. Allah then gave a white chicken the size of a camel from heaven. When the angels in heaven glorified Allah, the white chicken also glorified (crowed) on earth. Thanks to the white chicken, Adam came to know the times of worship on earth.<br><br>To protect them from the heat and cold, Adam then cut down trees. He used the wood to build a house. Adam also made a well to get water. Allah then revealed 21 appendices regarding the laws of haram and halal eating the meat of certain animals.<br><br>Then 29 hijaiyyah letters were revealed, and humans cannot reduce or add letters. Allah's provisions are very clear and nothing can change them. Adam then learned the letters so he could read the attachments sent down by Allah. <br><br>Eve then experienced the process of conceiving. He was surprised when the fetus in his stomach moved. Hawa wasn't sure where the moving place in her stomach would come from. When the time to give birth arrived, Eve felt the pain. Eve gave birth to twins, Abel and Layutsa.<br><br>The time to be pregnant with her second child arrived. Hawa gave birth to twins Qabil and Iqlima. A pair of boys and girls are always born to him. It is said that Eve gave birth and was pregnant with 20 children. Every time a pair is born, a boy and a girl are born. <br><br>It is also said that 200 children were conceived by Eve. All were born twins except Syits who had Nur Musthafa Shallalahu'alaihi wa sallam on his forehead. It is also said that Prophet Adam's children and grandchildren continued to grow to 40 thousand men and women. When Adam's children and grandchildren were growing up, there were many fights and disputes. So Allah gave him a rod from heaven to educate those who were disobedient.\n\n<h4>The story of Habil and Qabil</h4>\nThe first twin sons of Prophet Adam were Habil and Layutsa. Meanwhile, the second twins are Qabil and Iqlima. Habil's twin is said to have a less attractive appearance. Meanwhile, Iqlima, Qabil's twin, is very beautiful.<br><br>At that time, Adam was ordered by Allah to intermarry his children. So Adam's child cannot marry his own twin. When Adam was about to marry Abel to Iqlimiya, Qabil protested. Qabil felt more entitled to Iqlimiya because she was his twin.<br><br>Qabil was attracted to his own twin because of her beauty. Allah then ordered Habil and Qabil to make a sacrifice through the Prophet Adam. The sacrifice accepted by Allah would determine who would have the right to Iqlimiya . Qabil, a farmer and arrogant, chose a bad sheaf of wheat to sacrifice. While Qabil, a breeder, sacrificed a young and fat goat. After both of them sacrificed, Allah then sent down a white light and lifted the goat from Abel.<br><br>Meaning Abel who was sincere sacrifice is entitled to Iqlimiya. Qabil was angry, and did not want Habil to marry his twin. Satan took advantage of Qabil's anger and persuaded him to hit Habil. Qabil, who was overcome by anger, then hit Habil. Habil did not fight back because he did not want to become a big problem. Unfortunately, Qabil's blow made Habil was killed. Qabil was afraid and confused, he did not know how to hide the lifeless Habil.<br><br>Qabil tried to throw Habil into the sea, but the waves always brought Habil's body back to the shore. Finally, Qabil asked for forgiveness from Allah and regretted his actions. Suddenly Qabil saw a crow on a tree. One of his crows had died for some reason. The crow that was still alive brought the dead crow down. The bird then pecked at the ground until it made a hole and pushed the dead crow into it. Qabil understood now, and he imitated the method. the bird to bury Abel. The story of Abel and Qabil is the first murder on earth. The story of the Prophet Adam turns out to contain a lot of advice for mankind. About the obedience and dependence of humans as servants to Allah. as well as about the greatness of Allah who always makes it easy for humans when they ask help.\n\n<h4>The Story of the Death of Prophet Adam</h4>\nThe prophets were people with extraordinary spiritual qualities. However, like most humans, they had physical limitations. They ate, drank, rest, and also die. These human qualities are also possessed by Prophet Adam 'alaihissalam. He was created by Allah as the first human, then together with his wife Eve lived on earth with a predetermined age limit.<br><br>Prophet Adam was given the gift of being able to feel the seconds- the last seconds of his life. So when death was about to come, Prophet Adam seemed to have prepared everything. Prophet Adam began by making a final request to his sons, namely to eat the fruit of heaven. This request is difficult to interpret literally, because in nature This ephemeral world, the fruit of heaven is impossible to find. Heaven only exists in the afterlife.<br><br>Therefore, there are scholars who interpret that the request for the fruit of heaven is a sign that the Prophet Adam was longing for the heavenly happiness that he had lived in before down to earth. This is a sign that his death is approaching. However, as dutiful sons, the sons of Prophet Adam still set out to find the fruits of heaven.<br><br>However, not long after leaving their father, their journey was blocked by a number of men.<br><i>\"O sons Adam, what are you looking for? Or what do you want? And where are you going?”</i><br>They said, <i>“Our father is sick, he wants to eat from Paradise.”</i> <br><i>“Go home, for the time has come for your fathers,”</i><br>asked the men, who turned out to be angels in human form. In their hands were already shrouds, perfumes, and a number of the usual tools needed for digging a grave: an axe, a hoe, and a shovel.<br><br>When the angels came, Eve saw and recognized them, so she took refuge with the Prophet Adam.<br><i>“Get away from me . I have made mistakes because of you. Leave me with the angels of my Lord\"</i><br>said Prophet Adam to Eve.<br><br>It is the angels who took the life of Prophet Adam, then bathed him, shrouded him, perfumed him, prepared a grave, and prayed for him. Then they went down to his grave, put Adam's body in, and then they put bricks on top of it. After climbing onto the grave, they covered it with stones.<br><br>They called out, \"O children of Adam, this is your sunnah.\"<br><br>Apparently Prophet Adam prepared a valuable lesson for the next generation about how to treat the dead. Humans are not only respected when they are alive but also when they die. The standard of respect is not excessive. There is no cremation process, body mutilation, adorning the corpse with jewelry, or the like. However, all of these lessons are enough to illustrate that humans are basically noble, but their worldly life will definitely end in mortality. From the earth back to the earth."
	    },
            {
                "no": 2,
                "name_id": "Nabi Idris AS",
		"name_eng": "Prophet Idris AS",
		"arab": "ادريس عَلَیهِ‌ السَّلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/idris.png",
                "isi": "Nabi Idris merupakan salah satu nabi yang mewariskan banyak pengetahuan dan masih berguna hingga saat ini. Kenabiannya perlu diimani oleh umat Islam sebagai bentuk taqwa atas perintah Allah SWT. Secara garis keturunan Nabi Idris memiliki jarak enam generasi dari Nabi Adam AS.<br><br>Urutannya adalah :<br>1. Adam<br>2. Syits<br>3. Anusy<br>4. Qinan<br>5. Mihlail<br>6. Yarid<br>7. Nabi Idris<br><br>Nama Idris berasal dari kata ‘Darasa’ yang berarti belajar. Sebab, Nabi Idris dikenal sebagai sosok yang sangat senang belajar dan suka mengkaji fenomena alam semesta. Nabi Idris juga dikenal dengan nama Akhnukh bin Yarid. Dia dilahirkan dari seorang perempuan bernama Iqlima. Selama 345 tahun Nabi Idris hidup di dunia, dia diutus oleh Allah SWT untuk berdakwah di Irak Kuno (Babilonia) dan Mesir (Memphis). Berikut kisah Nabi Idris selengkapnya. Nabi Idris adalah manusia pertama yang menerima wahyu lewat Malaikat Jibril ketika dirinya menginjak usia 82 tahun.\n\n<h4>Silsilah Nabi Idris</h4>\nNabi Idris merupakan keturunan Adam yang pertama kali menerima wahyu dari Allah SWT setelah Adam dan Syits. Hal itu tertera dalam QS. Maryam:56-57,<br><i>Dan ceritakanlah (hai Muhammad) kepada mereka, kisah Idris (yang tersebut) di dalam Al Qur’an. Sesungguhnya ia adalah seorang yang sangat membenarkan dan seorang nabi. Dan Kami telah mengangkatnya ke martabat yang tinggi.</i><br><br>Namun demikian, ada beberapa perbedaan pendapat mengenai riwayat Nabi Idris apakah dia hidup sebelum Nabi Nuh ataukah sesudahnya. Ilmuwan seperti Ibnu Katsir, Ath-Thabari, Ibnu Ishaq, Ibnu Jarir, Asy-Syaukani, hingga As-Suyuthi menjelaskan bahwa Nabi Idris  hidup sebelum Nabi Nuh. Hal itu berdasarkan nasab bahwa nama asli Nabi Idris adalah Khonukh yang merupakan nenek moyang Nabi Nuh.<br><br>Hal itu juga diperkuat dengan QS. Maryam: 58 :<br><i>“Mereka itulah orang-orang yang Allah telah beri nikmat, yaitu kalangan para nabi dari keturunan Adam, dan dari orang yang Kami angkat bersama Nuh dari keturunan Ibrahim dan Israil, dan dari orang-orang yang Kami beri petunjuk dan telah Kami pilih. Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyangka dengan bersujud dan menangis.”</i><br><br>Ayat tersebut  mengisahkan silsilah keturunannya. Nabi Idris termasuk keturunan Nabi Adam, tidak ikut bersama Nabi Nuh dalam perahu. Dengan demikian, Nabi Idris urutannya sebelum Nabi Nuh.\n\n<h4>Nabi Idris Berdakwah di Babilonia hingga Mesir</h4>\nPada mulanya, Nabi Idris diutus oleh Allah SWT untuk menyebarkan agama di Babilonia, Irak Kuno. Nabi Idris sendiri merupakan sosok yang rajin beribadah dan beramal salih seperti halnya yang diceritakan dalam buku Nabi Idris. Namun, akhirnya dia berhijrah ke Mesir lantaran penduduk Babilonia tidak bisa menerima apa yang diajarkan Nabi Idris.<br><br>Dalam kehidupan sehari-hari, Nabi Idris dikenal sebagai orang yang gemar bertasbih kepada Allah. Dia juga selalu melakukan perbuatan baik seperti belajar, menulis, dan menjahit. Keterampilan-keterampilan itu perlahan-lahan dia ajarkan kepada kaumnya.\n\n<h4>Nabi Idris Pandai Ilmu Perbintangan</h4>\nPengetahuan Nabi Idris sangat luas karena dia rajin mengkaji dan mempelajari banyak hal, termasuk segala hal yang diajarkan Allah SWT kepada Nabi Adam. Selain itu, Nabi Idris juga sangat tertarik dengan fenomena-fenomena alam yang terjadi di muka bumi. Oleh sebab itulah, banyak yang bertanya kepadanya apabila terjadi fenomena alam tertentu. Nabi Idris sering menjadi rujukan terhadap suatu permasalahan.<br><br>Nabi Idris dikenal sebagai ahli perbintangan. Dia adalah orang yang pertama kali memanfaatkan rasi bintang sebagai penunjuk arah, waktu yang tepat untuk bercocok tanam, hingga memperkirakan kondisi cuaca. Nabi Idris juga memiliki keterkaitan dengan bangsa Sumeria. Sebab, beberapa penelitian membuktikan bangsa Sumeria juga mempelajari ilmu perbintangan untuk mengetahui waktu bercocok tanam yang baik. Misalnya, rasi bintang Taurus yang dipercaya sebagai masa awal musim semi dan cocok untuk menanam. Sementara, rasi bintang Virgo digunakan sebagai waktu yang tepat untuk melakukan panen.\n\n<h4>Nabi Idris Jadi Manusia Pertama yang Bisa Membuat Pakaian</h4>\nSebelum Nabi Idris terlahir di dunia, manusia sebelumnya terbiasa membuat dan memakai kulit binatang sebagai pakaian. Nabi Idris diberikan Allah mukjizat berupa orang pertama yang bisa menjahit kulit binatang menjadi baju layak pakai. Saat ada waktu luang, Nabi Ibrahim menjahit pakaian lalu diberikan kepada kaum fakir miskin.\n\n<h4>Nabi Idris Jadi Manusia Pertama yang Bisa Menulis</h4>\nNabi Idris juga dikenal sebagai manusia pertama yang bisa menulis menggunakan pena. Bahkan, para ilmuwan pernah menemukan beberapa potongan naskah kuno yang diklaim berkaitan dengan Nabi Idris. Naskah itu bernama Kitab Henokh. Salah satu kisah dalam kitab itu adalah tentang peradaban tertua di bumi Lemuria, Atlantis yang hilang ditelan bumi. Selain itu, prediksi tentang banjir besar yang akan terjadi di muka bumi. Para ilmuwan itu menduga Kitab Henokh tersebut ditulis oleh Nabi Idris.\n\n<h4>Kisah Nabi Idris Merasakan Mati dan Hidup Lagi</h4>\nPada suatu malam, Nabi Idris kedatangan tamu seorang pria. Dia membawa sangat banyak buah-buahan. Nabi Idris tidak sadar, pria tersebut adalah Malaikat Izroil yang menyamar. Nabi Idris menawarkan makanan itu kepada Izroil, namun ditolak. Pada akhirnya, mereka berbincang-bincang dan berjalan-jalan melihat pemandangan sekitar.<br><br>Setelah empat hari bersama dan sudah cukup akrab, Nabi Idris mulai curiga dengan sang tamu. Sebab, tamu itu tidak menyentuh jamuannya sama sekali. Nabi Idris lantas  mengajukan pertanyaan karena diliputi rasa penasaran.<br><br><i>“Sebenarnya siapa kamu?”</i> tanya Nabi Idris.<br><i>“Maaf Ya Nabi Allah. Aku sebenarnya adalah Malaikat Izroil,”</i> jawab sang malaikat.<br><br>Tentu saja Nabi Idris terkejut mendengarnya, sebab Malaikat Izroil bertugas mencabut nyawa manusia.<br><br><i>“Kau sudah empat hari bersamaku. Apakah kau sedang bertugas untuk mencabut nyawa makhluk di dunia ini?”</i><br><i>“Wahai Idris, selama empat hari ini memang banyak sekali nyawa yang telah kucabut. Roh makhluk-makhluk itu bagaikan hidangan di hadapanku. Kuambil mereka bagaikan seseorang sedang menyuap makanan.”</i><br><i>“Lantas apa maksud kedatanganmu kemari? Apakah kau ingin mencabut nyawaku?”</i><br>Malaikat Izroil menggeleng.<br><i>“Tidak, Ya Idris. Kedatanganku memang untuk mengunjungimu karena saya rindu dan Allah telah memberikan izin.”</i><br><br>Setelah percakapan itu, Nabi Idris membuat satu permintaan. Dia ingin Malaikat Izroil mencabut nyawanya, kemudian menghidupkannya kembali. Nabi Idris penasaran dengan rasa sakratul maut yang konon sangat dahysat sakitnya. Namun, permintaan itu tidak segera dituruti oleh Malaikat Izroil. Sebab, segala hal yang dia lakukan hanya atas perintah Allah SWT.<br><br><i>“Saya tidak mencabut nyawa seseorang selain atas izin Allah,”</i> kata Malaikat Izroil.<br><br>Namun, Allah SWT pada akhirnya mengabulkan permintaan Nabi Idris. Seketika, Malaikat Izroil pun mencabut nyawa Nabi Idris. Melihat sahabatnya kesakitan sedemikian rupa, Malaikat Izroil menangis. Setelah mati, Allah menghidupkan kembali Nabi Idris.<br><br>Nabi Idris lantas menangis sejadi-jadinya. Dia tidak bisa membayangkan apabila manusia-manusia lain mengalami sakaratul maut yang terasa sakit seperti dirinya. Rasanya sungguh dahsyat, tidak bisa diungkapkan dengan kata-kata. Nabi Idris pun merasa tidak tega apabila ada umatnya yang harus merasakan sengsara di ujung hidup dan mati.",
                "isi_eng": "Prophet Idris is one of the prophets who passed down a lot of knowledge and is still useful today. Muslims need to believe in his prophethood as a form of piety at the command of Allah SWT. In terms of lineage, Prophet Idris has a distance of six generations from the Prophet Adam.<br><br>The order is:<br>1. Adam<br>2. Syits<br>3. Anusy<br>4. Qinan<br>5. Mihlail<br>6. Yarid<br>7. Prophet Idris<br><br>The name Idris comes from the word 'Darasa' which means learning. Because, Prophet Idris is known as someone who really likes learning and likes studying the phenomena of the universe. Prophet Idris is also known as Akhnukh bin Yarid. He was born to a woman named Iqlima. During the 345 years that Prophet Idris lived in the world, he was sent by Allah SWT to preach in Ancient Iraq (Babylonia) and Egypt (Memphis). The following is the complete story of Prophet Idris. Prophet Idris was the first human being to receive revelation through the Angel Gabriel when he was 82 years old.\n\n<h4>Prophet Idris' lineage</h4>\nProphet Idris was a descendant of Adam who first received revelation from Allah SWT after Adam and Syits . This is stated in QS. Maryam:56-57,<br><i>And tell them (O Muhammad) the story of Idris (that one) in the Qur'an. Indeed, he was a very righteous man and a prophet. And We have raised him to a high dignity.</i><br><br>However, there are several differences of opinion regarding the history of Prophet Idris whether he lived before Prophet Noah or after. Scientists such as Ibnu Katsir, Ath-Thabari, Ibnu Ishaq, Ibnu Jarir, Asy-Syaukani, and As-Suyuthi explained that Prophet Idris lived before Prophet Noah. This is based on the nasab that the real name of the Prophet Idris was Khonukh who was the ancestor of the Prophet Noah.<br><br>This is also confirmed by the QS. Maryam: 58 :<br><i>\"Those are the people whom Allah has given favor to, namely among the prophets from the descendants of Adam, and from those whom We raised with Noah from the descendants of Abraham and Israel, and from those who We have given guidance and We have chosen. When the verses of Allah, the Most Gracious, are recited to them, then they prostrate themselves and weep.\"</i><br><br>The verse tells the genealogy of his descendants. Prophet Idris, a descendant of Prophet Adam, did not accompany Prophet Noah in the boat. Thus, Prophet Idris came before Prophet Nuh.\n\n<h4>Prophet Idris preached in Babylonia to Egypt</h4>\nAt first, Prophet Idris was sent by Allah SWT to spread religion in Babylonia, Ancient Iraq. Prophet Idris himself was a figure who diligently worshiped and did good deeds as told in the book Prophet Idris. However, in the end he emigrated to Egypt because the people of Babylonia could not accept what Prophet Idris taught. <br><br>In everyday life, Prophet Idris was known as a person who liked to glorify Allah. She also always does good deeds such as studying, writing, and sewing. He slowly taught these skills to his people.\n\n<h4>Prophet Idris was good at Astrology</h4>\nProphet Idris' knowledge was very broad because he diligently studied and studied many things, including everything taught by Allah SWT to Prophet Adam. Apart from that, Prophet Idris was also very interested in natural phenomena that occurred on earth. For this reason, many people ask him if certain natural phenomena occur. Prophet Idris is often a reference for problems.<br><br>Prophet Idris is known as an astrologer. He was the first person to use the constellations as a guide, the right time to plant crops, and to predict weather conditions. Prophet Idris also has a connection with the Sumerian nation. Because, several studies prove that the Sumerian nation also studied astronomy to find out when to plant crops. good. For example, the constellation Taurus is believed to be the beginning of spring and is suitable for planting. Meanwhile, the constellation Virgo is used as the right time to harvest.\n\n<h4>Prophet Idris Becomes the First Human to Make Clothes </h4>\nBefore Prophet Idris was born into the world, humans were used to making and wearing animal skins as clothing. Prophet Idris was given a miracle by Allah in the form of the first person who could sew animal skins into clothes that were fit to wear. When he had free time, Prophet Ibrahim sewed clothes then given to the poor.\n\n<h4>Prophet Idris Becomes the First Human Being Who Can Write</h4>\nProphet Idris is also known as the first human being who can write using a pen. In fact, scientists have found several pieces of ancient manuscripts which is claimed to be related to the Prophet Idris. The manuscript is called the Book of Enoch. One of the stories in the book is about the oldest civilization on earth Lemuria, Atlantis that was lost swallowed by the earth. In addition, it predicts a great flood that will occur on earth. The scientist suspects that the Book of Enoch was written by the Prophet Idris.\n\n<h4>The Story of the Prophet Idris Who Experienced Death and Life Again</h4>\nOne night, the Prophet Idris was visited by a male guest. He brought a lot of fruit. The Prophet Idris was unaware that the man was the Angel Izroil in disguise. The Prophet Idris offered the food to Izroil, but he refused. In the end, they chatted and walked around looking at the surrounding scenery.<br><br>After four days together and being quite close, the Prophet Idris began to suspect the guest. Because, the guest did not touch his meal at all. The Prophet Idris then asked a question because he was filled with curiosity.<br><br><i>\"Actually, who are you?\"</i> asked the Prophet Idris.<br><i>\"Excuse me, O Prophet of Allah. I am actually the Angel Izroil,” the angel replied. <br><br>Of course Prophet Idris was surprised to hear that, because Angel Izroil is tasked with taking human lives. <br><br><i>“You have been with me for four days. Are you on duty to take the lives of creatures in this world?” </i><br><i>“O Idris, during these four days I have indeed taken many lives. The souls of those creatures are like a dish in front of me. I take them as if someone is feeding them food.” </i><br><i>“Then what is the purpose of your coming here? Do you want to take my life?” </i><br>Angel Izroil shook his head. <br><i>“No, O Idris. I came to visit you because I miss you and Allah has given me permission.” </i><br><br>After that conversation, Prophet Idris made one request. He wanted Angel Izroil to take his life, then bring him back to life. Prophet Idris was curious about the sacred feeling of death which was said to be very painful. However, Angel Izroil did not immediately comply with this request. Because, everything he did was only on the orders of Allah SWT.<br><br><i>\"I do not take anyone's life except with Allah's permission,\"</i> said Angel Izroil.<br><br>However, Allah SWT ultimately granted Prophet Idris' request. Instantly, the Angel Izroil took the life of Prophet Idris. Seeing his friend in such pain, Angel Izroil cried. After death, Allah brought Prophet Idris back to life.<br><br>Prophet Idris then cried uncontrollably. He couldn't imagine if other humans experienced death as painful as he did. The feeling is really powerful, it can't be expressed in words. Prophet Idris also felt that he could not bear it if his people had to experience misery on the edge of life and death."
            },
            {
                "no": 3,
                "name_id": "Nabi Nuh AS",
		"name_eng": "Prophet Noah  AS",
		"arab": "نوح عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Nuh.png",
                "isi": "Mukjizat dan Kisah Nabi Nuh – Setiap kisah Nabi yang diajarkan saat menempuh pendidikan atau pada saat diceritakan oleh orang tua pasti akan selalu terdengar menyenangkan. Kisah Nabi dan Rasul yang sering diceritakan ketika masih sekolah biasanya terdiri dari 25 nabi dan rasul. Selain menyenangkan, kisah para Nabi dan Rasul selalu memiliki nilai-nilai yang akan sangat bermanfaat bagi kehidupan sehari-hari. Bahkan, bisa menambah pahala untuk diri kita sendiri.<br><br>Hampir semua orang pasti sudah mengetahui kisah Nabi yang terselamtkan dari banjir bandang yang cukup besar dengan membuat perahu. Bukan hanya dirinya saja yang diselematkam, tetapi para umatnya dan hewan-hewan juga diselamatkan oleh Nabi Nuh AS.<br><br>Namun, bagi mereka yang tidak mengikuti perintah dari Nabi Nuh AS akan tenggelam bersama banjir bandang yang telah direncanakan oleh Allah S.W.T. Anak dari Nabi Nuh AS juga tak mempercayai akan datangnya musibah banjir bandang, hingga akhirnya dirinya harus tenggelam bersama banjir bandang itu.<br><br>Nabi Nuh AS sangat dikenal dengan kesabarannya walaupun sudah dibenci oleh banyak orang, Keteguhan, ketabahan, dan kesabaran hati dari Nabi Nuh AS sudah sangat teruji karena beliau sudah berdakwah selama 950 tahun untuk mengenal Allah lebih dalam lagi. Berkat kesabaran dan keteguhan hatinya dalam mengenal Allah walaupun sudah tertimpa berbagai macam musibah, Nabi Nuh AS memperoleh gelar ulul azmi.<br><br>Gelar ulul azmi adalah gelar yang diberikan kepada Nabi dan Rasul yang memiliki kesabaran dan ketabahan yang luar biasa. Kisah Nabi Nuh AS sudah dijelaskan dala  Al-Quran Surat Al-Ankabut ayat 14:<br><br>وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَلَبِثَ فِيْهِمْ اَلْفَ سَنَةٍ اِلَّا خَمْسِيْنَ عَامًاۗ فَاَخَذَهُمُ الطُّوْفَانُ وَهُمْ ظٰلِمُوْنَ<br><br><i>Dan sesungguhnya Kami telah mengutus Nuh kepada kaumnya, maka ia tinggal di antara mereka seribu tahun kurang lima puluh tahun. Maka mereka ditimpa banjir besar, dan mereka adalah orang-orang yang zalim.</i>\n\n<h4>Kisah Nabi Nuh AS saat Berdakwah</h4>\nDiutusnya Nabi Nuh AS oleh Allah pada saat terjadi kekosongan di antara dua rasul (fatrah) yang jika dibiarkan begitu saja ajaran-ajaran agama yang sudah dibawa Nabi sebelumnya akan dilupakan oleh para manusia. Apabila ajaran agama itu sudah ditinggalkan, maka para manusia kembali melakukan berbagai macam dosa, seperti melakukan maksiat, melakukan kemungkaran, dan meninggalkan amalan kebaikan.<br><br>Pada masa fatrah itu, Nabi Nuh AS mendapatkan wahyu kenabian dari Allah untk memberikan ajaran agama Islam. Pada saat itu, kaum Nabi Nuh AS tidak menyembah Allah melainkan yang disembah adalah patung berhala yang dibuat oleh tangan para manusia atau para kaum Nabi Nuh AS.<br><br>Patung-patung yang telah dibuat dan disembah itu dipercaya oleh mereka akan memberikan banyak sekali kebaikan dan manfaat, dan mereka juga percaya bahwa patung berhala dapat menolak segala macam hal-hal buruk di kemudian hari.<br><br>Berdasarkan kepercayaan kaum Nabi Nuh AS pada saat itu, patung berhala yang telah dibuat dan nama patung-patung itu berasal dari nama para ulama yang hidup di masa sebelumnya. Mereka membuat dan memberikan nama berdasarkan nama ulama terdahulu dengan alasan untuk mengenang jasa para ulama tersebut dan semangat ibadah umat terdahulu. Nama patung berhala yang dibuat oleh kaum Nabi Nuh AS yang belum mengenal Allah, seperti Wadd, dan Suda, Yatuq dan Nasr.<br><br>Pada masa-masa kondisi suatu kaum sedang mempercayai patung berhala itu Nabi Nuh AS diutus oleh Allah untuk meyakinkan para kaum itu agar mengikuti ajaran Allah dan tidak menyembah patung berhala. Nabi Nuh AS memiliki kemampuan yangcukup luar biasa ketika beragumentasi dengan orang lain. Hal ini dikarenakan Nabi Nuh AS memiliki akal yang cerdas dan kemampuan bicara yang santun, baik, dan sabar dalam beradu argumentasi.<br><br>Nabi Nuh AS yang sudah diutus oleh Allah selalu berusaha untuk meyakinkan kaumnya agar tidak lagi menyembah patung berhala dan menagajak kaumnya untuk kembali kepada ajaran Allah. Nabi Nuh AS tidak pernah menyerah untuk menyadarkan kaumnya dan ia selalu mencari berbagai macam cara seperti melakukan dakwah. Namun, kaumnya yang tidak taat itu menolak ajakan Nabi Nuh AS. Hal ini terkandung di dalam Al-Quran Surat Al-A’raf ayat 59:<br><br>لَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اِنِّيْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ<br><br><i>Sesungguhnya Kami telah mengutus Nuh kepada kaumnya, lalu ia berkata: “Wahai kaumku sembahlah Allah, sekali-kali tak ada Tuhan bagimu selain-Nya. Sesungguhnya (kalau kamu tidak menyembah Allah), aku takut kamu akan ditimpa azab pada hari yang besar (kiamat).</i><br><br>Dakwah-dakwah Nabi Nuh AS berupa ajakan kaumnya untuk melihat dan merasakan segala hal yang ada di muka bumi ini merupakan ciptaan Allah, mulai dari matahari, bulang, dan bintang-bintang. Tak hanya itu, tumbuh-tumbuhan, hewan, dan air yang mengalir yang dapat dinikmati dan dirasakan oleh manusia termasuk ciptaan Allah. Perubahan siang dan malam serta hal-hal yang ada di muka bumi adalah bukti nyata bahwa Allah itu benar-benar ada dan Tuhan yang harus disembah bukan patung berhala yang disembah.<br><br>Bukan hanya memberikan bukti akan tanda kebesaran Allah, Nabi Nuh AS juga memberikan dakwah bahwa setiap amalan perbuatan yang dilakukan oleh manusia akan ada ganjarannya dari Allah. Apabila amalan perbuatan yang dilakukan berupa kebaikan dan menaati perintah Allah, maka manusia akan mendapatkan surga. Sementara itu, jika amalan perbuatan yang dilakukan berupa keburukan atau tidak menjalan perintah Allah, maka ganjarannya adalah neraka.<br><br>Kesabaran, ketabahan, dan keteguhan hati Nabi Nuh AS dalam menyebarkan ajaran agama Allah melalui dakwah selalu ditolak oleh sebagian besar dari kaum Nabi Nuh AS. Meskipun, banyak yang menolak ajaran Allah, tetapi masih ada manusia yang menerima ajakan Nabi Nuh AS untuk mengikuti ajaran Allah.<br><br>Selama 950 tahun, Nabi Nuh AS selalu melakukan dakwah agar kaumnya tidak berjalan di jalan yang sesat yang bisa merugikan diri sendiri karena diberikan azab oleh Allah. Ajakan-ajakan beliau dalam dakwahnya selalu berhubungan dengan tidak menyembah patung berhala dan kembali menyembah Allah Yang Maha Esa. Dengan mengajak kaumnya untuk menyembah Allah, maka Nabi Nuh AS sangat berharap agar kaumnya kembali ke jalan yang benar dan terang.<br><br>Selain itu, Nabi Nuh AS juga mengajarkan kepada kaumnya untuk selalu saling menyayangi dan saling tolong menolong. Beliau juga sangat berjuang dengan keras agar sifat sombong yang dimiliki oleh manusia dengan kedudukan yang cukup tinggi itu agar menghilangkan sifat-sifat buruk itu dan digantinya dengan memberikan kasih sayang.<br><br>Namun, perjuangan yang telah dilakukan dengan kesabaran dan ketabahan yang telah dilakukan Nabi Nuh AS untuk menyadarkan kaumnya kembali ke jalan yang benar dan terang ternyata tetap tidak berhasil. Mayoritas kaumnya tidak percaya dengan ajakan dari Nabi Nuh AS untuk menyembah Allah dan beriman kepada Allah. Hanya ada beberapa manusia saja yang ingin menerima ajakan dari Nabi Nuh AS dan itupun tidak sampai seratus manusia.\n\n<h4>Nabi Nuh AS Membuat Kapal</h4>\nSetelah berjuang untuk menyadarkan kaumnya agar tidak lagi menyembah patung berhala selama ratusan tahun, bahkan hampir seribu tahun, Nabi Nuh AS mendapatkan perintah dari Allah agar segera membuat kapal yang sangat besar yang bisa menampung manusia (para pengikutnya) dan hewan. Mereka yang menerima ajakan Nabi Nuh AS mulai membuat kapal besar yang telah diperintahkan oleh Allah dengan mengumpulkan bahan-bahan yang dibutuhkan dalam pembuatan kapal.<br><br>Mereka yang membuat kapal memilih tempat yang jauh dari keramaian masyarakat dan jauh dari kota. Mereka sangat bersemangat dalam membuat kapal ini, sehingga siang dan malam digunakan untuk menyelesaikan kapal besar yang telah diperintahkan oleh Allah. Alasan Nabi Nuh AS untuk membuat kapal jauh dari kota dan keramaian agar para mansyarakat tidak banyak yang tahu dan Nabi Nuh AS bersama manusia yang menerima ajakannya dapat mengerjakan pembuatan kapal dengan tenang.<br><br>Meskipun Nabi Nuh AS sudah berusaha untuk menjauh dari keramaian dan berharap tak ada gangguan dari orang lain, tetapi pembuatan kapal akhirnya terlihat oleh para manusia yang tidak menerima ajakan Nabi Nuh AS. Mereka menghina dan mengejek pembuatan kapal besar yang telah diperintahkan oleh Allah. Kalimat-kalimat ejekan dan hinaan yang diungkapkan oleh kaum yang tidak taat kepada ajaran Allah hanya dibalas dengan santai oleh Nabi Nuh AS, “Untuk kalian yang menghina dan mengejek kami akan tiba waktunya jika kalian akan diberikan azab oleh Allah atas amalan perbuatan yang telah kalian buat.”<br><br>Meskipun Nabi Nuh AS mendapatkan hinaan dan ejekan dari mereka, tetapi beliau tetap melanjutkan pembuatan kapal besar yang sudah diperintahkan Allah. Nabi Nuh AS dan para pengikutnya tetap semangat dalam mengerjakan kapal besar, hingga pada akhirnya kapal besar itu berhasil dibuat dan mereka pun sangat senang karena sudah berhasil menjalankan perintah Allah.\n\n<h4>Banjir Bandang</h4>\nKetika mereka yang menghina Nabi Nuh AS dan pengikutnya membuat kapal, sebenarnya Nabi Nuh AS sudah memberitahu kepada mereka kaum kafir bahwa akan ada banjir bandang yang sangat besar yang bisa menenggelamkan seluruh manusia. Namun, kaum kafir itu tetap tidak percaya apa yang dikatakan oleh Nabi Nuh AS. Bahkan, anak dari beliau juga tidak percaya dengan apa yang dikatakan oleh ayahnya dan lebih memilih untuk menjadi kaum kafir karena bisikan syaitan dan hasutan dari kaum kafir itu.<br><br>Kapal yang sudah selesai dibuat oleh Nabi Nuh AS dan para pengikutnya, kemudian Nabi Nuh AS menerima wahyu dari Allah, “Siap-siaplah engkau dengan kapalmu, bila tiba perintah-Ku dan terlihat tangda-tanda daripada-Ku maka segeralah angkut bersamamu di dalam kapalmu dan kerabatmu dan bawalah dua pasang dari setiap jenis makhluk yang ada di atas bumi dan berlayarlah dengan izin-Ku.<br><br>Setelah mendapatkan wahyu dari Allah, Nabi Nuh AS menunggu suatu hari akan tiba yaitu hari di mana hujan akan turun dengan sangat lebat dan banjir bandang akan tiba. Sebelum hari banjir bandang itu tiba, Nabi Nuh AS mengajak pengikutnya untuk bersiap-siap agar segera naik ke kapal. Hingga tibalah waktunya hujan turun dengan sangat deras dan air pun mulai menggenangi daratan yang rendah terlebih dahulu.<br><br>Perlahan-lahan air yang sudah menggenangi dataran rendah mulai meninggi dan menuju ke dataran tinggi. Hingga pada akhirnya air bah itu sudah mulai menggenangi seluruh daratan dan hanya orang-orang mukmin dan pasangan makhluk hidup saja yang ada di kapal Nabi Nuh AS saja yang berhasil selamat dari air bah yang menenggelamkan seluruh daratan. Kapal Nabi Nuh AS mulai berlayar yang diiringi dengan<br><i>“Bismillahi Majraha wa mursaha”</i><br>melewati air bah itu dan saat berlayar terlihat para orang-orang kafir yang berusaha untuk menyelematkan diri agar tidak terbawa air lebih jauh.<br><br>Ketika sedang berlayar di tengah-tengah air bah, Nabi Nuh AS melihat puteranya yang bernama Kan’an timbul tenggelam karena menerima azab dari Allah atas amalan perbuatan yang sudah dilakukan. Nabi Nuh AS sangat bersedih dengan kepergian anaknya yang meninggal dalam keadaa kafir, tidak beriman, dan belum mengenal Allah.<br><br>Banjir bandang yang sudah membinasakan kaum kafir dan zalim kepada hukum Allah, mulai mengalami surut, air yang tadinya banyak, tiba-tiba sudah surut dengan cepat karena diserap oleh bumi. Setelah air bah atau banjir bandang yang sudah surut, kapal Nabi Nuh AS mulai berhenti di atas bukit “Judie”. Kemudian para orang-orang mukmin dan makhluk hidup lainnya mulai turun dari kapal yang besar itu dan mereka selamat dari air bah<br><br>Kisah Nabi Nuh AS yang di mana air bah membinasakan seluruh kaum kafir terkandung di dalam  Al-Quran Surat Yunus ayat 73:<br><i>فَكَذَّبُوْهُ فَنَجَّيْنٰهُ وَمَنْ مَّعَهٗ فِى الْفُلْكِ وَجَعَلْنٰهُمْ خَلٰۤىِٕفَ وَاَغْرَقْنَا الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَاۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِيْنَ</i><br><i>Kemudian mereka mendustakannya (Nuh), lalu Kami selamatkan dia dan orang yang bersamanya di dalam kapal, dan Kami jadikan mereka itu khalifah dan Kami tenggelamkan orang yang mendustakan ayat-ayat Kami. Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.</i>",
                "isi_eng": "Miracles and the Story of Prophet Noah - Every story of the Prophet that is taught during education or when told by parents will always sound fun. The story of the Prophet and Apostles that is often told when still in school usually consists of 25 prophets and apostles. In addition to being fun, the stories of the Prophets and Apostles always have values ​​that will be very useful for everyday life. In fact, it can increase our own rewards. <br><br>Almost everyone must have known the story of the Prophet who was saved from a fairly large flash flood by making a boat. Not only was he saved, but his people and animals were also saved by Prophet Noah AS. <br><br>However, for those who do not follow the orders of Prophet Noah AS will drown with the flash flood that has been planned by Allah SWT. The son of Prophet Nuh AS also did not believe that the flash flood disaster would come, until finally he had to drown with the flash flood. <br><br>Prophet Nuh AS was very well known for his patience even though he was hated by many people. The steadfastness, fortitude and patience of Prophet Nuh AS have been very tested because he has been preaching for 950 years to know Allah more deeply. Thanks to his patience and steadfastness in knowing Allah even though he had been hit by various kinds of calamities, Prophet Nuh AS obtained the title of ulul azmi.<br><br>The title of ulul azmi is a title given to Prophets and Apostles who have extraordinary patience and fortitude. The story of Prophet Nuh AS has been explained in the Al-Quran Surah Al-Ankabut verse 14:<br><br>وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَلَبِثَ فِيْهِمْ اَلْفَ سَنَةٍ اِلَّا خَمْسِيْنَ عَامًاۗ And verily We sent Noah to his people, and he remained among them a thousand years minus fifty. Then the great flood struck them, and they were wrongdoers.</i>\n\n<h4>The Story of Prophet Noah AS when Preaching</h4>\nProphet Noah AS was sent by Allah at a time when there was a gap between the two messengers (fatrah) which if left alone, the religious teachings that had been brought by the previous Prophet would be forgotten by mankind. When religious teachings are abandoned, people return to committing various kinds of sins, such as committing immoralities, committing evil deeds, and abandoning good deeds.<br><br>During the fatrah, Prophet Nuh AS received a prophetic revelation from Allah to provide the teachings of the Islamic religion. At that time, the people of Prophet Nuh AS did not worship Allah but instead they worshiped idols made by the hands of humans or the people of Prophet Nuh AS.<br><br>The statues that had been made and worshiped were believed by them to provide a lot of goodness and benefits, and they also believed that idol statues could ward off all kinds of bad things in the future.<br><br>Based on the beliefs of Prophet Nuh AS at that time, the idol statues that had been made and their names The statues come from the names of scholars who lived in previous times. They create and give names based on the names of previous scholars for the reason of remembering the services of these scholars and the spirit of worship of the previous people. The name of the idol statue made by the people of Prophet Noah AS who did not know Allah, such as Wadd, and Suda, Yatuq and Nasr.<br><br>At a time when a people were believing in idol statues, Prophet Noah AS was sent by Allah to convince the people to follow the teachings of Allah and not worship idol statues. Prophet Noah AS had quite extraordinary abilities when arguing with others. This is because Prophet Noah AS had an intelligent mind and the ability to speak politely, well, and patiently in arguing.<br><br>Prophet Noah AS who had been sent by Allah always tried to convince his people not to worship idol statues anymore and invited his people to return to the teachings of Allah. Prophet Noah AS never gave up on making his people aware and he always looked for various ways such as doing da'wah. However, his disobedient people rejected Prophet Noah AS's invitation. This is contained in the Al-Quran Surah Al-A'raf verse 59:<br><br>لَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اِنِّيْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ<br><br><i>Verily We have sent Noah to his people, then he said: \"O my people, worship Allah, there is no god for you but Him. Indeed, (if you do not worship Allah), I am afraid that punishment will befall you on the great day (Doomsday).</i><br><br>The preaching of Prophet Nuh AS took the form of an invitation to his people to see and feel everything on this earth which is Allah's creation, starting from the sun, moon and stars. Not only that, there are plants, animals and flowing water at is enjoyed and felt by humans, including God's creation. Changes in day and night and the things that exist on earth are clear evidence that God really exists and God must be worshiped, not idols who are worshiped.<br><br>Not only does it provide evidence of the signs of God's greatness, the Prophet Nuh AS also preached that every action carried out by humans will be rewarded by Allah. If the deeds carried out are good and obey God's commands, then humans will get heaven. Meanwhile, if the deeds carried out are bad or do not carry out Allah's commands, then the reward will be hell.<br><br>The patience, fortitude and determination of the Prophet Nuh AS in spreading the teachings of Allah's religion through da'wah were always rejected by the majority of people. the people of Prophet Noah AS. Although many reject the teachings of Allah, there are still people who accept the invitation of Prophet Nuh AS to follow the teachings of Allah.<br><br>For 950 years, Prophet Nuh AS always carried out preaching so that his people would not walk on the wrong path which could be detrimental. themselves because they were punished by Allah. His invitations in his preaching were always related to not worshiping idols and returning to worshiping Allah Almighty. By inviting his people to worship Allah, Prophet Nuh AS really hoped that his people would return to the right path and bright.<br><br>In addition, Prophet Nuh AS also taught his people to always love and help each other. He also fought very hard so that the arrogant nature possessed by humans with a fairly high position would eliminate these traits. bad traits and replaced them with giving love.<br><br>However, the struggle that had been carried out with patience and steadfastness that had been carried out by Prophet Nuh AS to make his people aware of returning to the right and bright path turned out to be unsuccessful. The majority of his people did not believe in the invitation from Prophet Nuh AS to worship Allah and believe in Allah. There were only a few people who wanted to accept the invitation from Prophet Nuh AS and even then it was less than a hundred people.\n\n<h4>Prophet Nuh AS Made a Ship </h4>\nAfter struggling to make his people aware so that they no longer worship idols for hundreds of years, even almost a thousand years, Prophet Nuh AS received an order from Allah to immediately make a very large ship that could accommodate humans (his followers) and animals. Those who accepted the invitation of Prophet Nuh AS began to make a large ship that had been ordered by Allah by collecting the materials needed in making the ship.<br><br>Those who made the ship chose a place far from the crowds of people and far from the city. They very enthusiastic in making this ship, so that day and night were used to complete the large ship that had been ordered by Allah. The reason Prophet Noah AS built the ship far from the city and the crowds was so that not many people would know and Prophet Noah AS and the people who accepted his invitation could work on building the ship in peace.<br><br>Although Prophet Noah AS had tried to stay away from the crowd and hoping that there would be no disturbance from other people, but the making of the ship was finally seen by humans who did not accept the invitation of Prophet Nuh AS. They insulted and mocked the making of the great ship that had been ordered by Allah. The sentences of mockery and insults expressed by the people who disobedience to the teachings of Allah was only responded to casually by Prophet Nuh AS, \"For those of you who insult and mock us, the time will come when you will be punished by Allah for the deeds you have done.\" <br><br>Although Prophet Nuh The US received insults and ridicule from them, but he continued to build the large ship that Allah had ordered. Prophet Nuh AS and his followers remained enthusiastic in working on the big ship, until finally the big ship was successfully built and they were very happy because they had succeeded in carrying out Allah's orders.\n\n<h4>Flash Flood</h4>\nWhen they were the ones who insulting Prophet Nuh AS and his followers who built ships, in fact Prophet Nuh AS had told the infidels that there would be a very big flash flood that could drown all humans. However, the disbelievers still did not believe what the Prophet Nuh AS said. In fact, his son also did not believe what his father said and preferred to become an infidel because of the whispers of Satan and incitement from the infidels.<br><br>The ship that was completed by Prophet Nuh AS and his followers, Then Prophet Nuh AS received a revelation from Allah, \"Get ready with your ship, when My command comes and you see signs from Me then immediately take with you in the ship you and your relatives and bring two pairs of every kind of creature that is on the earth and sail with My permission.<br><br>After receiving revelation from Allah, Prophet Nuh AS waited for a day to come, namely the day when rain would fall very heavily and a flash flood would arrive. Before the day of the flash flood arrived, Prophet Nuh AS invited his followers to get ready to immediately board the ship. Until the time came when the rain fell very heavily and the water began to flood the lowlands first.<br><br>Slowly the water that had flooded the lowlands began to rise and head towards the highlands. Until finally the flood began to flood the entire land and only the believers and the pairs of living creatures on the ship of Prophet Nuh AS managed to survive the flood that drowned the entire land. Prophet Nuh AS's ship began to sail accompanied by <br><i>\"Bismillahi Majraha wa mursaha\"</i><br>through the flood waters and as it sailed, he saw unbelievers who were trying to save themselves so as not to be carried further by the water. <br><br>While sailing in the midst of the flood waters, Prophet Nuh AS saw his son, Kan'an, drown because he received punishment from Allah for the deeds he had done. Prophet Nuh AS was very saddened by the loss of his son, who died while being a disbeliever, not a believer, and not yet knowing Allah. <br><br>The flash flood which had destroyed the disbelievers and those who were unjust to Allah's law, began to recede, the water which was previously abundant, suddenly receded quickly because it was absorbed by the earth. After the flood or flash flood had receded, the Prophet Noah's ship AS began to stop on the \"Judie\" hill. Then the believers and other living creatures began to get off the big ship and they were saved from the flood. The story of Prophet Noah (AS) where the flood destroyed all the unbelievers is contained in the Quran, Surah Yunus, verse 73: <br><i>And Allah said to him, \"O my people, and I will make you happy.\" Then they denied him (Noah), so We saved him and those with him in the ship, and We made them successors, and We drowned those who denied Our signs. So pay attention to the outcome of those who were warned.</i>"
            },
            {
                "no": 4,
                "name_id": "Nabi Hud AS",
                "name_eng": "Prophet Hud  AS",
                "arab": "هد عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Hud.png",
                "isi": "Nabi Hud Alaihissalam merupakan salah satu dari 25 Nabi utusan Allah Ta’ala yang menerima wahyu untuk dirinya sendiri. Nabi Hud ‘alaihissalam yang merupakan nabi ke-empat ini berasal dari bangsa Arab, tepatnya suku ‘Ad. Diriwayatkan dari Abu Dzar, nabi-nabi lain yang berasal dari bangsa Arab selain Nabi Hud ‘alaihissalam adalah, Nabi Saleh ‘alaihissalam, Nabi Syu’aib ‘alaihissalam, dan Nabi Muhammad Shallallahu ‘alaihi wa sallam.<br><br>Sejak kecil Nabi Hud ‘alaihissalam dikenal sebagai sosok yang memiliki perilaku sangat terpuji diantaranya, jujur, amanah, berbudi pekerti luhur, bekerja keras, serta sangat bijaksana dan ramah dalam bergaul dengan kawan-kawan sepantaran di sekelilingnya.<br><br>Kisah tentang kehidupan dan perjalanan dakwah Nabi Hud ‘alaihissalam sendiri banyak disebutkan di dalam  Al-Qur’an. Nama “Hud” bahkan diabadikan sebagai nama salah satu surat di Al-Qur’an, yakni surat ke-sebelas. Seperti diriwayatkan dalam Al-Qur’an Surat Hud ayat 50 yang menyebutkan tentang Nabi Hud ‘alaihissalam dan kaum ‘Ad.<br><br><i>“Dan kepada kaum ‘Ad (Kami utus) saudara mereka, Hud. Dia berkata, ‘Wahai kaumku! Sembahlah Allah, tidak ada tuhan bagimu selain Dia. (Selama ini) kamu hanyalah mengada-ada.’”</i> (Q.S. Hud ayat 50).<br><br><i>“Wahai kaumku! Aku tidak meminta imbalan kepadamu atas (Seruanku) ini. Imbalanku hanyalah dari Allah yang telah menciptakanku. Tidakkah kamu mengerti?”</i> (Q.S. Hud ayat 51).<br><br>Semasa hidupnya Nabi Hud ‘alaihissalam menempati sebuah daerah yang disebut dengan Al-Ahqaf, tepatnya di sebelah utara Hadramaut, berada diantara Yaman dan Oman. Hadramaut adalah sebuah daerah yang sangat indah karena memiliki tanah yang subur.<br><br>Banyak hasil pertanian yang tumbuh dengan baik dari tanah subur Hadramaut. Selain diyakini sebagai tanah kelahiran Nabi Hud ‘alaihissalam, Hadramaut juga diyakini sebagai daerah dimana Nabi Saleh AS dilahirkan.<br><br>Bukan hanya menyimpan fakta sebagai tanah kelahiran Nabi Hud ‘alaihissalam dan Nabi Saleh ‘alaihissalam, tetapi Hadramaut juga menyimpan keistimewaan lain yaitu terdapat bangunan suci umat Islam yang disebut dengan Qabr Hud (Makam Hud). Di dekat Qabr Hud terdapat sebuah masjid yang selalu ramai dikunjungi peziarah, terutama pada tanggal 11 Sya’ban.<br><br>Sejarah Nabi Hud ‘alaihissalam sangat erat kaitannya dengan kaum ‘Ad yaitu kaum yang hidup di zaman Nabi Hud ‘alaihissalam dan merupakan kaum tertua setelah dibinasakannya kaum yang dzolim kepada Nabi Nuh ‘alaihissalam.<br><br>Diriwayatkan, Nabi Hud ‘alaihissalam adalah cucu dari Nabi Nuh ‘alaihissalam atau bisa disebut juga merupakan keturunan dari Sam bin Nuh (kaum ‘Ad). Kaum ‘Ad yang hidup di zaman Nabi Hud ‘alaihissalam dikenal sebagai kaum yang hidup dengan amat nyaman dan sejahtera. Kehidupan mereka makmur karena dilimpahi dengan ladang pertanian yang terhampar subur nan hijau, hewan ternak yang sehat dan banyak, serta aliran air yang melimpah dan segar. Selain itu, perawakan tubuh kaum ‘Ad juga diketahui besar dan kuat sehingga sangat menguntungkan mereka dalam bekerja sehari-harinya.<br><br>Namun kenikmatan dan berbagai berkah yang dilimpahkan kepada kaum ‘Ad tidak serta merta membuat mereka bersyukur dan menyembah Allah Ta’ala. Kaum ‘Ad tidak mengenal Allah Ta’ala sebagai Tuhan mereka, sama seperti yang dilakukan oleh kaum sebelum mereka (kaum Nabi Nuh). Mereka menyembah patung buatan mereka sendiri dan diberi nama dengan Shamud dan Alhattar.\n\n<h4>Perjalanan Dakwah Nabi Hud</h4>\nTarget utama dari dakwah yang dilakukan oleh Nabi Hud ‘alaihissalam adalah Kaum ‘Ad yang bermukim di sekitar tempat tinggal Nabi Hud ‘alaihissalam, yaitu di Al-Ahqaf. Tugas Nabi Hud ‘alaihissalam untuk menyerukan ajaran agar menyembah Allah Ta’ala dan menghindari perbuatan musyrik. Kaum ‘Ad dikenal menyembah patung berhala yang mereka buat sendiri. Seperti ditunjukkan dalam Al-Qur’an Surat Hud ayat 52:<br><br><i>“Dan (Hud berkata), ‘Wahai kaumku! Mohonlah ampunan kepada Tuhanmu lalu bertobatlah kepada-Nya, niscaya Dia menurunkan hujan yang sangat deras, Dia akan menambahkan kekuatan di atas kekuatanmu, dan janganlah kamu berpaling menjadi orang yang berdosa.’”</i> (Q.S. Hud ayat 52).\n\n<h4>Kisah Nabi Hud Diutus sebagai Penolong bagi Kaum ‘Ad</h4>\nKeringat dan usaha tiada henti yang diperjuangkan oleh Nabi Hud ‘alaihissalam dalam menyerukan kebaikan kepada kaum ‘Ad selain diabadikan ke dalam  Al-Qur’an surat Hud, juga diabadikan dalam surat Asy-Syu’ara ayat 128-135.<br><br>Nabi Hud ‘alaihissalam menyeru kepada kaum ‘Ad untuk meninggalkan patung berhala yang mereka sembah dan beralih menyembah kepada Allah Ta’ala. Nabi Hud ‘alaihissalam pun menunjukkan bukti-bukti kekuasaan dan keesaan Allah Ta’ala kepada kaum ‘Ad agar mereka dapat memilih ke jalan yang benar.<br><br>Namun kaum ‘Ad sama sekali tidak mempercayai Nabi Hud ‘alaihissalam dan tidak mau meninggalkan sesembahan mereka. Bahkan kaum ‘Ad menuduh Nabi Hud ‘alaihissalam sudah terkena penyakit gila.<br><br><i>“Mereka (kaum ‘Ad) berkata, ‘Wahai Hud! Engkau tidak mendatangkan suatu bukti yang nyata kepada kami, dan kami tidak akan meninggalkan sesembahan kami karena perkataanmu dan kami tidak akan mempercayaimu, kami hanya mengatakan bahwa sebagian sesembahan kami telah menimpakan penyakit gila atas dirimu.’ Dia (Hud) menjawab, ‘Sesungguhnya aku bersaksi kepada Allah dan saksikanlah bahwa aku berlepas diri dari apa yang kamu persekutukan.’”</i> (Q.S. Hud ayat 54).\n\n<h4>Balasan Azab Kepada Kaum ‘Ad yang Ingkar</h4>\nBuntut dari perilaku kaum ‘Ad yang tamak dan sombong serta menentang Nabi Hud ‘alaihissalam, maka Allah Ta’ala memberikan peringatan kepada mereka berupa kekeringan yang panjang. Musibah kekeringan yang menimpa kaum ‘Ad ini sempat membuat mereka resah dan khawatir. Mereka takut pertanian mereka gagal panen sehingga menyebabkan kelaparan. Celah tersebut yang dimanfaatkan oleh Nabi Hud ‘alaihissalam untuk meyakinkan kaum ‘Ad agar meninggalkan berhala dan berpaling untuk bertaubat dan menyembah Allah Ta’ala.<br><br>Namun perkataan Nabi Hud ‘alaihissalam benar-benar tidak dihiraukan sama sekali oleh mereka. Sesuai yang tertuang dalam Al-Qur’an surat Al-A’raf ayat 70:<br><i>“Mereka berkata, ‘Apakah kedatanganmu kepada kami, agar kami hanya menyembah kepada Allah saja dan meninggalkan apa yang biasa disembah oleh nenek moyang kami? Maka buktikanlah ancamanmu kepada kami, jika kamu benar!’”</i> (Q.S. Al-A’raf ayat 70).<br><br>Akibat dari keras kepalanya kaum ‘Ad yang terus menerus menentang Nabi Hud ‘alaihissalam dan menyekutukan Allah Ta’ala, maka selanjutnya Allah menunjukkan kuasa-Nya dengan mendatangkan gumpalan awan hitam nan pekat. Para kaum ‘Ad berseru gembira karena mengira awan tersebut adalah pertanda datangnya hujan yang akan menyelamatkan ladang dan pertanian mereka dari kekeringan.<br><br>Namun, di tengah sorak sorai kaum ‘Ad yang berbahagia atas kedatangan awan tersebut, Nabi Hud ‘alaihissalam memberi peringatan bahwa awan hitam yang datang bukanlah pertanda baik akan turunnya hujan. Melainkan pertanda buruk akan datangnya azab dari Allah Ta’ala kepada kaum ‘Ad karena telah menyekutukan Allah Ta’ala. Tetapi sekali lagi peringatan yang disampaikan oleh Nabi Hud ‘alaihissalam tidak dihiraukan oleh mereka. Kaum ‘Ad tetap tidak mau mempercayai segala perkataan dan meminta bukti atas peringatan Nabi Hud ‘alaihissalam.<br><br>Hingga akhirnya Allah Ta’ala sebagai sang Kuasa benar-benar menjatuhkan azab kepada kaum ‘Ad dengan datangnya angin topan secara dahsyat. Angin topan tersebut langsung merobohkan dan menyapu apa saja yang ada seperti rumah, bangunan, berhala, ladang, hewan ternak, dan berbagai harta benda lainnya milik kaum ‘Ad.<br><br>Angin topan kencang tersebut akhirnya mampu membinasakan kaum ‘Ad beserta berhala-berhala yang mereka sembah. Saking dahsyatnya, diriwayatkan bahwa angin yang berlangsung selama delapan hari tujuh malam tersebut telah menghancurkan segalanya seperti serbuk. Kisah tentang angin topan yang menimpa kaum ‘Ad diceritakan dalam surat Al-Haqqah ayat 6-8:<br><br><i>“Sedangkan Kaum ‘Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin. Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus menerus; maka kamu melihat Kaum ‘Ad pada waktu itu mati bergelimpangan, seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka?”</i> (Q.S. Al-Haqqah ayat 6-8).<br><br>Lalu ketika terjadi bencana angin topan dahsyat yang menimpa kaum ‘Ad, apakah yang terjadi kepada Nabi Hud ‘alaihissalam dan para pengikutnya? Tentu saja mereka diselamatkan oleh Allah Ta’ala. Nabi Hud ‘alaihissalam dan para pengikutnya tetap berdiam di rumah tanpa merasakan sedikitpun bahaya dari angin topan tersebut. Setelah kejadian yang menimpa kaum ‘Ad, akhirnya Nabi Hud ‘alaihissalam dan para pengikutnya berpindah ke daerah Hadramaut untuk menetap di sana hingga beliau menghembuskan nafas terakhirnya.",
                "isi_eng": "Prophet Hud Alaihissalam was one of the 25 prophets sent by Allah Ta'ala who received revelations for himself. Prophet Hud 'alaihissalam, who is the fourth prophet, came from the Arab people, specifically the 'Ad tribe. Narrated from Abu Dzar, other prophets from the Arab nation besides Prophet Hud 'alaihissalam were, Prophet Saleh 'alaihissalam, Prophet Syu'aib 'alaihissalam, and Prophet Muhammad sallallaahu 'alaihi wa sallam.<br><br>Since childhood Prophet Hud 'alaihissalam is known as a figure who has very commendable behavior, including being honest, trustworthy, having noble character, working hard, and being very wise and friendly. in hanging out with friends of the same age around him.<br><br>The story of the life and missionary journey of the Prophet Hud 'alaihissalam himself is mentioned a lot in the Qur'an. The name \"Hud\" was even immortalized as the name of one of the letters in the Koran, namely the eleventh letter. As narrated in the Qur'an, Surah Hud, verse 50, which mentions the Prophet Hud 'alaihissalam and the people of 'Ad.<br><br><i>\"And to the people of 'Ad (We sent) their brother, Hud. He said, 'O my people! Worship Allah, there is no god for you but Him. (All this time) you are just making things up.'”</i> (Q.S. Hud verse 50).<br><br><i>“O my people! I do not ask you in return for this (My Call). My reward is only from Allah who created me. Don't you understand?\"</i> (Q.S. Hud verse 51).<br><br>During his lifetime the Prophet Hud 'alaihissalam occupied an area called Al-Ahqaf, precisely to the north of Hadramaut, between Yemen and Oman. Hadramaut is a very beautiful area because it has fertile soil.<br><br>Many agricultural products grow well from the fertile soil of Hadramaut. Apart from being believed to be the birthplace of the Prophet Hud 'alaihissalam, Hadramaut is also believed to be the area where the Prophet Saleh AS was born.<br><br>Not only does it hold the fact that it is the birthplace of the Prophet Hud 'alaihissalam and the Prophet Saleh 'alaihissalam, but Hadramaut also holds other privileges namely, there is a sacred building for Muslims called Qabr Hud (Hud Tomb). Near Qabr Hud there is a mosque which is always crowded with pilgrims, especially on the 11th of Sha'ban.<br><br>The history of the Prophet Hud 'alaihissalam is very closely related to the 'Ad people, namely the people who lived in the time of the Prophet Hud 'alaihissalam and is the oldest race after the destruction of the people who were unjust to Prophet Nuh 'alaihissalam. <br><br>It is narrated that Prophet Hud 'alaihissalam was the grandson of Prophet Nuh 'alaihissalam or could also be called a descendant of Sam bin Nuh (the 'Ad race). The race 'Ad who lived in the time of Prophet Hud 'alaihissalam were known as a people who lived very comfortably and prosperously. Their lives were prosperous because they were abundant with fertile and green agricultural fields, healthy and abundant livestock, and abundant and fresh water.Apart from that, the bodies of the 'Ad people are also known to be large and strong, which is very beneficial for them in their daily work. <br><br>However, the pleasures and various blessings bestowed on the 'Ad people do not necessarily make them grateful and worship Allah Ta 'ala. The 'Ad people did not recognize Allah Ta'ala as their God, just as did the people before them (the people of Prophet Noah). They worshiped statues made by themselves and were named Shamud and Alhattar.\n\n<h4>Prophet Hud's Da'wah Journey</h4>\nThe main target of the da'wah carried out by Prophet Hud 'alaihissalam was the 'Ad people who lived around the place lived the Prophet Hud 'alaihissalam, namely in Al-Ahqaf. The task of the Prophet Hud 'alaihissalam was to preach the teachings to worship Allah Ta'ala and avoid idolatrous acts. The 'Ad were known to worship idols that they made themselves. As shown in the Qur'an, Surah Hud verse 52:<br><br><i>\"And (Hud said), 'O my people! Ask your Lord for forgiveness and then repent to Him, surely He will send down very heavy rain, He will add strength to your strength, and do not turn to be a sinner.'”</i> (Q.S. Hud verse 52).\n \n<h4>The story of Prophet Hud being sent as a helper for the 'Ad</h4>\nThe sweat and endless efforts fought by Prophet Hud 'alaihissalam in calling for goodness to the people of 'Ad, apart from being enshrined in the Al-Qur'an in the letter Hud, it is also enshrined in the letter Asy-Syu'ara verses 128-135.<br><br>The Prophet Hud 'alaihissalam called on the people of 'Ad to leave idol statues that they worshiped and turned to worship Allah Ta'ala. Prophet Hud 'alaihissalam also showed evidence of the power and oneness of Allah Ta'ala to the people of 'Ad so that they could choose the right path.<br><br>But the people of 'Ad did not believe in Prophet Hud 'alaihissalam at all and did not want to abandon their offerings. Even the people of 'Ad accused the Prophet Hud 'alaihissalam of being mad.<br><br><i>\"They (the people of 'Ad) said, 'O Hud! You have not brought us any clear evidence, and we will not abandon our gods because of your words and we will not believe you, we only say that some of our gods have afflicted you with madness.’ He (Hud) said, ‘Indeed I bear witness to Allah and bear witness that I am free from what you associate with others.’”</i> (Q.S. Hud verse 54).\n\n<h4>Reply to the Punishment of the Disobedient ‘Ad</h4>\nAs a result of the greedy and arrogant behavior of the ‘Ad people and their opposition to Prophet Hud ‘alaihissalam, Allah Ta’ala gave them a warning in the form of a long drought. The drought that befell the ‘Ad people made them restless and worried. They were afraid that their crops would fail, leading to famine. This gap was exploited by the Prophet Hud 'alaihissalam to convince the people of 'Ad to abandon idols and turn to repent and worship Allah Ta'ala.<br><br>However, the words of the Prophet Hud 'alaihissalam were completely ignored by them. As stated in the Qur'an, Surah Al-A'raf verse 70:<br><i>\"They said, 'Did you come to us so that we would only worship Allah and leave what our ancestors used to worship? So prove your threat to us, if you are truthful!'\"</i> (Q.S. Al-A'raf verse 70).<br><br>As a result of the stubbornness of the people of 'Ad who continued to oppose the Prophet Hud 'alaihissalam and associate partners with Allah Ta'ala, then Allah showed His power by bringing a thick black cloud. The 'Ad people cried out happily because they thought the cloud was a sign of the coming rain which would save their fields and agriculture from drought. However, amidst the cheers of the 'Ad people who were happy about the arrival of the cloud, the Prophet Hud 'alaihissalam warned that the coming black clouds were not a good sign that the rain would fall. But it is a bad sign that punishment will come from Allah Ta'ala to the people of 'Ad because they have associated partners with Allah Ta'ala. But once again the warning given by the Prophet Hud 'alaihissalam was ignored by them. The 'Ad people still did not want to believe everything they said and asked for proof of the warnings of the Prophet Hud 'alaihissalam. <br><br>Until finally Allah Ta'ala as the Almighty truly inflicted punishment on the 'Ad people with the arrival of a powerful typhoon. The typhoon immediately tore down and swept away everything that existed such as houses, buildings, idols, fields, livestock and various other possessions belonging to the 'Ad people.<br><br>The strong typhoon was finally able to destroy the 'Ad people and the idols they worshipped. It was so powerful, it is said that the wind that lasted for eight days and seven nights destroyed everything like powder. The story of the typhoon that hit the 'Ad people is told in Surah Al-Haqqah verses 6-8:<br><br><i>\"As for the 'Ad people, they were destroyed by a very cold typhoon. Allah inflicted this wind on them for seven nights and eight days continuously; then you saw the people of 'Ad at that time lying dead, like empty (decayed) palm tree trunks. So do you see anyone remaining among them?”</i> (Q.S. Al-Haqqah verse 6-8). <br><br>Then when a terrible typhoon struck the people of 'Ad, what happened to Prophet Hud 'alaihissalam and his followers? Of course they were saved by Allah Ta'ala. Prophet Hud 'alaihissalam and his followers remained at home without feeling the slightest danger from the typhoon. After the incident that happened to the 'Ad people, finally the Prophet Hud 'alaihissalam and his followers moved to the Hadramaut area to live there until he breathed his last breath."
            },
            {
                "no": 5,
                "name_id": "Nabi Sholeh AS",
                "name_eng": "Prophet Sholeh AS",
                "arab": "شوله عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Sholeh.png",
                "isi": "Apakah kalian mengetahui sesungguhnya ada berapa jumlah Nabi dan Rasul? Nabi dan Rasul jumlahnya sangat banyak sekali. Total terdapat 124 ribu Nabi dan 312 Rasul. Namun dalam Islam kita hanya diwajibkan untuk mengetahui dan mempelajari 25 Nabi dan Rasul. Lalu apakah perbedaan antara Nabi dan Rasul?<br><br>Secara bahasa, Nabi diartikan sebagai hamba Allah SWT yang menerima wahyu melalui malaikat Jibril untuk dirinya sendiri. Nabi merupakan manusia biasa seperti kita, hanya saja Nabi diberikan kelebihan dan amanah untuk mengingatkan orang di sekitarnya dan keturunannya agar memiliki perilaku baik dan menyembah Allah.<br><br>Nabi berasal dari istilah kata ‘Naba’ yang memiliki pengertian “dari tempat yang tinggi”. Sedangkan Rasul adalah hamba Allah SWT yang menerima wahyu dari Allah SWT melalui malaikat Jibril untuk dirinya sendiri dan umatnya. Semua Rasul adalah merupakan Nabi. Tetapi tidak semua Nabi adalah Rasul.<br><br>Nah, apakah penjelasan mengenai perbedaan antara Nabi dan Rasul cukup mudah untuk dipahami? Tentu mudah bukan. Nah, bagi kalian yang ingin mengetahui lebih dalam tentang Nabi dan Rasul, berikut akan diulas mengenai salah satu dari 25 Nabi yang wajib untuk diketahui bagi umat muslim. Pembahasan kali ini mengenai kisah salah satu Nabi, yaitu Nabi Saleh AS.\n\n<h4>Sejarah Nabi Saleh</h4>\nNabi Saleh Alaihissalam (keselamatan atasnya) merupakan salah satu dari 25 Nabi utusan Allah SWT yang menerima wahyu untuk dirinya sendiri. Nabi Saleh AS merupakan nabi ke-lima yang diutus untuk menyebarkan ajaran menyembah Allah SWT setelah kehancuran kaum ‘Ad yang hidup di zaman Nabi Hud AS.<br><br>Beberapa ulama meriwayatkan jika Nabi Saleh AS memiliki seorang ayahanda bernama Ubaid. Nabi Saleh AS diangkat oleh Allah SWT sebagai seorang Nabi pada tahun 2100 SM.<br><br>Apabila diruntutkan maka silsilah dari Nabi Saleh yaitu Saleh bin Ubaid bin Masih bin Ubaid bin Hadir bin Tsamud bin Atsir bin Aram/Iram bin Sem/Sam bin Nuh.<br><br>Jadi dapat disimpulkan jika Nabi Saleh AS masih memiliki darah keturunan dari Nabi Nuh AS. Nabi Saleh AS berasal dari bangsa Arab, tepatnya suku Tsamud. Diriwayatkan dari Abu Dzar, nabi-nabi lain yang berasal dari bangsa Arab selain Nabi Saleh AS adalah Nabi Syu’aib AS, Nabi Hud AS, dan Nabi Muhammad SAW.<br><br>Nabi Saleh AS adalah nabi yang diutus setelah Nabi Hud AS dan sebelum Nabi Ibrahim AS. Semasa hidupnya, Nabi Saleh AS menetap di daerah Arab Utara tepatnya di Al-Hijr. Selama di Al-Hijr, Nabi Saleh AS merupakan salah satu orang yang sangat dihormati dan dijunjung tinggi oleh penduduk Al-Hijr, yaitu kaum Tsamud.<br><br>Kaum Tsamud sangat pandai dalam hal memahat batu terutama batu-batu pegunungan. Hal tersebut dikarenakan daerah Hadramaut yang merupakan tempat tinggal kaum Tsamud adalah pegunungan. Sesuai dengan firman Allah SWT dalam Al-Qur’an surat Al-Fajr ayat 9:<br><br><i>“Dan (terhadap) kaum Tsamud yang memotong batu-batu besar di lembah.”</i> (Q.S. Al-Fajr ayat 9).\n\n<h4>Perjalanan Dakwah Nabi Saleh</h4>\nKaum Tsamud yang menjadi target dakwah dari Nabi Saleh AS adalah kaum yang menyambung hidup mereka melalui bercocok tanam, arsitektur, dan berternak. Kemampuan yang dimiliki kaum Tsamud di bidang arsitektur sangatlah mengagumkan.<br><br>Mereka memahat bukit berbatu yang banyak ditemukan di Al-Hijr menjadi bangunan indah nan megah. Sedangkan pada hamparan tanah yang datar mereka membangun istana-istana. Bukit-bukit batu yang dipahat oleh kaum Tsamud membentuk bangunan-bangunan rumah yang mereka tinggali dengan gaya khas peninggalan Yunani dan Romawi Kuno.\n\n<h4>Kaum Tsamud yang Ingkar Kepada Nabi Saleh AS</h4>\nPada saat itu diketahui kaum Tsamud menyembah berhala sesuai yang dilakukan secara turun temurun oleh nenek moyang mereka. Awalnya kaum Tsamud sangat menghormati Nabi Saleh AS karena mereka menaruh harapan pada beliau untuk meneruskan tradisi kaum Tsamud, yaitu menyembah berhala.<br><br>Namun ketika Nabi Saleh AS mulai menyampaikan ajakan untuk menyembah Allah SWT dan bertakwa kepada-Nya, maka kaum Tsamud menjadi kecewa dan murka. Mereka mulai memusuhi Nabi Saleh AS karena beliau meminta untuk meninggalkan sesembahan berhala yang sudah menjadi bagian dari tradisi mereka secara turun-temurun.<br><br>Selain memiliki kebiasaan menyembah berhala, tabiat lainnya yang dimiliki oleh kaum Tsamud adalah angkuh dan sombong. Mereka seringkali meremehkan dan memandang rendah kaum lainnya.<br><br>Bahkan dalam kesehariannya mereka selalu berbuat maksiat seperti, berzina dan mabuk-mabukkan. Gaya hidup kaum Tsamud tersebut telah menyimpang jauh dari ajaran Allah SWT.<br><br>Oleh karena alasan tersebutlah Allah SWT mengangkat Saleh menjadi nabi dan ditugaskan untuk berdakwah kepada kaum Tsamud. Seperti yang difirmankan oleh Allah SWT dalam Al-Qur’an surat Al-A’raf ayat 73:<br><br><i>“Dan kepada kaum Tsamud, (Kami utus) saudara mereka Saleh. Dia berkata, ‘Wahai kaumku! Sembahlah Allah! Tidak ada Tuhan (sembahan) bagimu selain Dia. Sesungguhnya telah datang kepadamu bukti yang nyata dari Tuhanmu. Ini (seekor) unta betina dari Allah sebagai tanda untukmu. Biarkanlah ia makan di bumi Allah, janganlah disakiti, nanti akibatnya kamu akan mendapatkan siksaan yang pedih.’”</i> (Q.S. Al-A’raf ayat 73).<br><br>Ketika Nabi Saleh AS mulai menyeru kepada kaum Tsamud tentang ajaran tauhid untuk menyembah Allah SWT semata, maka kaum Tsamud terbelah menjadi dua kelompok yang saling bertentangan.<br><br>Kelompok pertama yaitu yang mengikuti Nabi Saleh AS dipimpin oleh Junda’ bin Amru bin Mahlab bin Lubaid bin Jawwas. Junda’ bin Amru adalah salah satu tokoh pemuka di kaum Tsamud.<br><br>Sedangkan kelompok yang menentang Nabi Saleh AS dipimpin oleh Dzu’ab bin Amru bin Lubaid Al-Habbab dan Rabbab bin Sha’r bin Julmas. Dzu’ab dan Rabbab bahkan menghalang-halangi ketika Nabi Saleh AS hendak mengajak sepupunya yaitu Junda’ bin Syihab untuk mengikuti ajarannya.<br><br>Kelompok penentang yang diketuai oleh Dzu’ab dan Rabbab berpendapat bahwa Nabi Saleh AS terkena sihir. Mereka tidak terima dengan ajaran yang dibawa oleh Nabi Saleh AS.<br><br>Selain itu Nabi Saleh AS juga dianggap sebagai penipu karena mereka tidak percaya apabila utusan Allah SWT adalah manusia biasa sama seperti mereka, sehingga mereka menuntut mukjizat sebagai bukti kerasulannya.\n\n<h4>Unta Betina yang Keluar dari Batu Sebagai Salah Satu Mukjizat Nabi Saleh AS</h4>\nDijelaskan oleh para mufassir bahwa sebagai bukti kerasulan Nabi Saleh AS, kaum Tsamud menantang beliau untuk dapat mengeluarkan seekor unta betina yang sedang hamil 10 bulan dari sebuah batu besar yang ditunjuk oleh mereka.<br><br>Nabi Saleh AS pun menyanggupi permintaan kaum Tsamud tersebut dan mulai berdoa kepada Allah SWT. Kemudian dengan kuasa Allah SWT, dari permukaan batu yang dipukul oleh tangan Nabi Saleh AS keluarlah unta betina dengan ciri-ciri sama persis seperti yang disebutkan oleh kaum Tsamud. Unta tersebut dikenal dengan sebutan “Unta Betina Allah”.<br><br>Maka terperanjatlah mereka. Kejadian mukjizat tersebut membuat sebagian dari kaum Tsamud yang menyaksikannya menjadi pengikut Nabi Saleh AS. Namun ada pula yang masih pada pendiriannya untuk menentang Nabi Saleh AS. Maka bersabdalah Nabi Saleh AS:<br><br><i>“Hai kaumku, inilah unta betina dari Allah sebagai mukjizat (yang menunjukkan) kebenaran untukmu, sebab itu biarlah dia makan di bumi Allah, dan janganlah kamu mengganggunya dengan gangguan apapun yang akan menyebabkan kamu ditimpa azab yang dekat.”</i> (Q.S. Hud ayat 64).<br><br><i>“Dan janganlah kamu sentuh unta betina itu dengan sesuatu kejahatan, yang menyebabkan kamu akan ditimpa oleh azab hari yang besar,”</i> (Q.S. Asy-Syu’ara ayat 156).<br><br>Seperti yang diriwayatkan dalam Al-Qur’an, Nabi Saleh AS berpesan kepada umatnya untuk tidak berbuat jahat kepada Unta Betina Allah. Bahkan Nabi Saleh AS mengizinkan kaumnya untuk memerah dan mengkonsumsi susu unta tersebut secara bergantian.<br><br>Namun hal tersebut tidak serta merta membuat mereka bersyukur dan berterimakasih. Para penentang Nabi Saleh AS bahkan tidak suka akan kehadiran unta tersebut karena dianggap meminum banyak air di sumber mata air milik mereka.\n\n<h4>Terbunuhnya Unta Betina Allah</h4>\nPara kaum Tsamud yang menentang Nabi Saleh AS merasa kesal karena banyak ternak mereka yang kekurangan air.<br><br>Mereka menganggap kehadiran unta betina hanya menambah beban mereka karena menghabiskan jatah air di sumber mata air. Mereka pun segera memikirkan rencana jahat untuk membunuh unta betina tersebut.<br><br>Diantara orang-orang yang berencana melakukan pembunuhan terhadap Unta Betina Allah, terdapat dua wanita yang menjadi provokator rencana tersebut. Dua wanita tersebut adalah Shaduq binti Mahya bin Zuhair Al-Mukhtar dan ‘Unaizah binti Ghunaim bin Mijlaz.<br><br>‘Unaizah merupakan istri dari Dzu’ab, salah satu pemimpin kelompok penentang Nabi Saleh AS. ‘Unaizah dan Dzu’ab memiliki 4 orang anak perempuan dan membentuk perjanjian dengan Qudar bin Salif untuk dapat memilih salah satu anaknya apabila berhasil membunuh unta betina.<br><br>Shaduq pun melakukan hal yang sama, yaitu menawarkan dirinya sendiri pada Mishra’ bin Mahraj bin Mahya apabila Mishra’ mampu membunuh unta tersebut.<br><br>Qudar dan Mishra’ yang tergiur dengan tawaran kedua wanita tersebut pun bertekad penuh untuk membunuh unta betina dengan mengajak 7 pemuda yang lain.<br><br>Mereka mengawasi ketika unta betina sedang minum air di mata air, lalu secara kilat memanah betis unta tersebut sembari menikam bagian perut unta dengan menggunakan pedang. Dengan begitu terbunuhlah Unta Betina Allah yang merupakan mukjizat milik Nabi Saleh AS.\n\n<h4>Azab yang Mendatangi Kaum Tsamud yang Ingkar dan Keji</h4>\nNabi Saleh AS sangat sedih ketika mendapati bahwa Unta Betina Allah telah dibunuh oleh kelompok penentangnya. Nabi Saleh AS pun segera mengingatkan para pembunuh unta agar segera bertaubat atau azab yang pedih akan datang.<br><br>Namun mereka justru meremehkan peringatan dari Nabi Saleh AS bahkan menantang agar azab segera diturunkan. Maka Nabi Saleh AS pun berpesan kepada mereka untuk bersuka ria selama 3 hari sebelum datangnya azab. Seperti yang diriwayatkan dalam Al-Qur’an surat Hud ayat 65:<br><br><i>“Maka mereka menyembelih unta itu, kemudian dia (Salih) berkata, ‘Bersukarialah kamu semua di rumahmu selama tiga hari. Itu adalah janji yang tidak dapat didustakan.’” </i> (Q.S. Hud ayat 65).<br><br>Perbuatan mereka membunuh unta tersebut adalah suatu pelanggaran terhadap larangan Nabi Saleh AS. Oleh sebab itu Allah SWT menjatuhkan kepada mereka hukuman yaitu membatasi hidup mereka hanya dalam tempo tiga hari, maka sebagai ejekan mereka disuruh bersuka ria selama tiga hari itu.<br><br>Pada hari pertama sebelum datangnya azab yang menewaskan pembunuh unta dan para kaum Tsamud yang ingkar, wajah mereka berubah warna menjadi kuning. Pada hari kedua, wajah mereka menjadi merah. Dan pada hari ketiga, wajah mereka menjadi berwarna hitam.<br><br>Diriwayatkan oleh Ibnu Katsir, pada hari keempat setelah matahari terbit maka datanglah azab Allah SWT yang dahsyat kepada kaum Tsamud yang ingkar. Azab yang diterima oleh mereka adalah terdengarnya suara keras dari langit dan terjadilah gempa bumi yang dahsyat sekali. Para pembunuh unta dan kelompok penentang Nabi Saleh AS pun mati bergelimpangan di rumah mereka masing-masing.<br><br>Diceritakan bahwa tidak ada satupun kelompok penentang Nabi Saleh AS yang selamat, kecuali Kalbah binti As-Salq. Kalbah adalah seorang budak perempuan yang pada saat azab terjadi melarikan diri ke arah perkampungan Arab lalu menceritakan kejadian azab tersebut kepada penduduk di sana.<br><br>Kalbah diberi minum oleh salah satu warga perkampungan tersebut. Namun setelah minum, Kalba langsung tewas seketika. Begitulah azab Allah SWT.<br><br>Sedangkan Nabi Saleh AS dan para pengikutnya yang beriman kepada Allah SWT selamat dari kejadian tersebut.<br><br>Meskipun tidak diceritakan dalam Al-Qur’an mengenai kehidupan Nabi Saleh AS dan pengikutnya setelah kejadian yang menimpa kaum Tsamud, namun terdapat sumber yang mengatakan bahwa mereka berpindah ke daerah Ramlah di Kawasan Palestina.",
                "isi_eng": "Do you know how many prophets and apostles there are? There are a great many prophets and apostles. In total, there are 124 thousand prophets and 312 apostles. However, in Islam we are only required to know and study 25 prophets and apostles. So what is the difference between a prophet and an apostle?<br><br>In terms of language, a prophet is defined as a servant of Allah SWT who receives revelation through the angel Gabriel for himself. A prophet is an ordinary human being like us, except that a prophet is given the advantage and mandate to remind people around him and his descendants to behave well and worship Allah.<br><br>A prophet comes from the term 'Naba' which means \"from a high place\". While an apostle is a servant of Allah SWT who receives revelation from Allah SWT through the angel Gabriel for himself and his people. All apostles are prophets. But not all prophets are apostles.<br><br>Well, is the explanation of the difference between a prophet and an apostle easy enough to understand? Of course it's easy, right? Well, for those of you who want to know more about the Prophets and Apostles, here will be reviewed one of the 25 Prophets that must be known for Muslims. This discussion is about the story of one of the Prophets, namely the Prophet Saleh AS.\n\n<h4>History of Prophet Saleh</h4>\nProphet Saleh Alaihissalam (peace be upon him) is one of the 25 prophets sent by Allah SWT who received revelation for himself. Prophet Saleh AS was the fifth prophet sent to spread the teachings of worshiping Allah SWT after the destruction of the 'Ad people who lived during the time of Prophet Hud AS.<br><br>Some scholars narrate that Prophet Saleh AS had a father named Ubaid. Prophet Saleh AS was appointed by Allah SWT as a prophet in 2100 BC.<br><br>If traced, the genealogy of Prophet Saleh is Saleh bin Ubaid bin Masih bin Ubaid bin Hadir bin Tsamud bin Atsir bin Aram/Iram bin Shem/Sam bin Nuh.<br><br>So it can be concluded that Prophet Saleh AS still has the blood of Prophet Noah AS. Prophet Saleh AS came from the Arab nation, precisely the Tsamud tribe. Narrated from Abu Dzar, other prophets from the Arabs besides Prophet Saleh AS were Prophet Syu'aib AS, Prophet Hud AS, and Prophet Muhammad SAW.<br><br>Prophet Saleh AS was the prophet sent after Prophet Hud AS and before Prophet Ibrahim AS. During his lifetime, Prophet Saleh AS lived in the North Arabian region, precisely in Al-Hijr. While in Al-Hijr, Nabi Saleh AS was one of the people who was highly respected and held in high esteem by the people of Al-Hijr, namely the Thamud people. <br><br>The Thamud people were very clever at carving stone, especially mountain stones. This is because the Hadramaut area, where the Thamud lived, is mountainous. In accordance with the word of Allah SWT in the Al-Qur'an surah Al-Fajr verse 9:<br><br><i>\"And (against) the Thamud who cut large stones in the valley.\"</i> (Q.S. Al-Fajr verse 9).\n\n<h4>Prophet Saleh's Da'wah Journey</h4>\nThe Thamud people who were the target of the Prophet Saleh's da'wah were people who made a living through farming, architecture, and animal husbandry. The skills possessed by the Thamud people in the field of architecture were very impressive.<br><br>They carved the rocky hills found in Al-Hijr into beautiful and magnificent buildings. While on the flat land they built palaces. The rock hills carved by the Thamud people formed the houses they lived in with a distinctive style of ancient Greek and Roman heritage.\n\n<h4>The Thamudites Who Disobeyed Prophet Saleh AS</h4>\nAt that time it was known that the Thamud people worshipped idols as their ancestors had done for generations. Initially, the Thamud people greatly respected the Prophet Saleh AS because they had high hopes for him to continue the tradition of the Thamud people, namely worshiping idols. <br><br>However, when the Prophet Saleh AS began to convey the invitation to worship Allah SWT and be pious to Him, the Thamud people became disappointed and angry. They began to be hostile to the Prophet Saleh AS because he asked them to abandon the idol worship that had been part of their tradition for generations. <br><br>In addition to having the habit of worshiping idols, another characteristic possessed by the Thamud people was arrogance and conceit. They often belittled and looked down on other people. <br><br>Even in their daily lives they always committed sins such as committing adultery and getting drunk. The lifestyle of the Thamud people has deviated far from the teachings of Allah SWT. <br><br>For this reason, Allah SWT appointed Saleh as a prophet and assigned him to preach to the Thamud people. As stated by Allah SWT in the Al-Qur'an surah Al-A'raf verse 73:<br><br><i>\"And to the Thamud, (We sent) their brother Saleh. He said, 'O my people! Worship Allah! There is no god (worship) for you but Him. Indeed, a clear proof has come to you from your Lord. This is (a) female camel from Allah as a sign for you. Let him eat on Allah's earth, do not harm him, or you will receive a painful punishment as a result.'\"</i> (Q.S. Al-A'raf verse 73).<br><br>When Prophet Saleh AS began to call the Thamud people about the teachings of monotheism to worship Allah SWT alone, the Thamud people were divided into two opposing groups.<br><br>The first group, namely those who followed Prophet Saleh AS was led by Junda' bin Amru bin Mahlab bin Lubaid bin Jawwas. Junda' bin Amru was one of the leading figures in the Thamud people.<br><br>While the group that opposed Prophet Saleh AS was led by Dzu'ab bin Amru bin Lubaid Al-Habbab and Rabbab bin Sha'r bin Julmas. Dzu'ab and Rabbab even obstructed when Prophet Saleh AS wanted to invite his cousin, Junda' bin Syihab, to follow his teachings.<br><br>The opposing group headed by Dzu'ab and Rabbab argued that Prophet Saleh AS was affected by magic. They did not accept the teachings brought by Prophet Saleh AS. <br><br>Apart from that, Prophet Saleh AS was also considered a fraud because they did not believe that the messenger of Allah SWT was an ordinary human being like them, so they demanded miracles as proof of his apostolate.\n\n<h4>A female camel came out of a rock as one of the miracles of the Prophet Saleh AS</h4>\nIt is explained by the commentators that as proof of the apostleship of Prophet Saleh AS, the Thamud people challenged him to be able to remove a 10-month pregnant female camel from a large rock that they pointed to. <br><br>Prophet Saleh AS agreed to the Thamud people's request and began to pray to Allah SWT. Then with the power of Allah SWT, from the surface of the rock that was hit by the hand of Prophet Saleh AS, a female camel emerged with exactly the same characteristics as those mentioned by the Thamud people. The camel was known as the \"Female Camel of Allah\". <br><br>So they were shocked. This miraculous event made some of the Thamud people who witnessed it become followers of Prophet Saleh AS. However, there were also those who still held their ground to oppose Prophet Saleh AS. So the Prophet Saleh AS said:<br><br><i>\"O my people, this is a she-camel from Allah as a miracle (which shows) the truth for you, therefore let it feed on Allah's earth, and do not disturb it with any disturbance that will cause you to suffer imminent punishment.\"</i> (Q.S. Hud verse 64).<br><br><i>\"And do not touch the she-camel with anything evil, which will cause you to suffer befallen by the punishment of a great day,\"</i> (Q.S. Asy-Syu'ara verse 156).<br><br>As narrated in the Qur'an, Prophet Saleh AS advised his people not to do evil to Allah's Female Camel. Even Prophet Saleh AS allowed his people to milk and consume camel milk in turn. <br><br>However, this did not necessarily make them grateful and grateful. The opponents of Prophet Saleh AS did not even like the presence of the camel because it was considered to drink a lot of water from their water source.\n\n<h4>The Killing of Allah's Female Camel</h4>\nThe Thamud people who opposed Prophet Saleh AS were upset because many of their livestock lacked water.<br><br>They considered the presence of the she-camel only added to their burden because it used up the water quota at the spring. They immediately thought of an evil plan to kill the she-camel.<br><br>Among the people who planned to kill the She-camel of Allah, there were two women who were the provocateurs of the plan. The two women were Shaduq bint Mahya bin Zuhair Al-Mukhtar and ‘Unaizah bint Ghunaim bin Mijlaz.<br><br>‘Unaizah was the wife of Dzu’ab, one of the leaders of the group opposing Prophet Saleh AS. ‘Unaizah and Dzu’ab had 4 daughters and made a pact with Qudar bin Salif to be able to choose one of his children if he managed to kill the she-camel.<br><br>Shaduq did the same thing, which was to offer himself to Mishra’ bin Mahraj bin Mahya if Mishra’ was able to kill the camel.<br><br>Qudar and Mishra’ who were tempted by the offer of the two women were fully determined to kill the she-camel by inviting 7 other young men.<br><br>They watched as the she-camel was drinking water at the spring, then quickly shot arrows at the camel’s calf while stabbing the camel’s stomach using a sword. Thus the She-camel of Allah was killed which was a miracle belonging to Prophet Saleh AS.\n\n<h4>The Doom that Comes to the Disobedient and Vile Thamud</h4>\nProphet Saleh AS was very sad when he discovered that the Female Camel of Allah had been killed by a group of his opponents. Prophet Saleh AS immediately warned the camel killers to immediately repent or a painful punishment would come. <br><br>However, they actually ignored the warning from Prophet Saleh AS and even challenged them to immediately reduce their punishment. So Prophet Saleh AS advised them to rejoice for 3 days before the punishment came. As narrated in the Qur'an, Surah Hud verse 65:<br><br><i>\"So they slaughtered the camel, then he (Salih) said, 'Rejoice all of you in your homes for three days. That is a promise that cannot be denied.'\" </i> (Q.S. Hud verse 65).<br><br>Their act of killing the camel was a violation of the prohibition of the Prophet Saleh AS. Therefore, Allah SWT imposed a punishment on them, namely limiting their lives to only three days, so as a mockery they were told to rejoice for those three days.<br><br>On the first day before the punishment that killed the camel killers and the people Thamud who disbelieved, their faces turned yellow. On the second day, their faces turned red. And on the third day, their faces turned black.<br><br>Narrated by Ibn Kathir, on the fourth day after sunrise, there came Allah SWT's terrible punishment for the Thamud people who disbelieved. The punishment they received was a loud sound from the sky and a terrible earthquake. The camel killers and the group opposing Prophet Saleh AS died lying in their respective homes.< br><br>It is said that not a single group of Prophet Saleh's opponents survived, except Kalbah bint As-Salq. Kalbah was a female slave who, when the punishment occurred, ran away to the Arab village and then told the residents there about the incident of the punishment. <br><br>Kalbah was given a drink by one of the residents of the village. However, after drinking, Kalba died instantly. That is the punishment of Allah SWT.<br><br>Meanwhile, Prophet Saleh AS and his followers who believed in Allah SWT survived this incident.<br><br>Even though it is not told in the Qur'an about the life of Prophet Saleh AS and his followers after the incident that happened to the Thamud people, however, there are sources who say that they moved to the Ramlah area in the Palestinian Territory."
            },
            {
                "no": 6,
                "name_id": "Nabi Ibrahim AS",
                "name_eng": "Prophet Abraham AS",
                "arab": "ابراهيم عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ibrahim.png",
                "isi": "Mengetahui kisah Nabi Ibrahim dapat menjadi salah satu cara agar dapat meneladani sifat baik beliau. Kisahnya diabadikan dalam Al-Quran sebagai pelajaran dan pengajaran lengkap dengan cerita dari kaumnya. Bahkan tidak jarang menampakkan azab terhadap para penentang di masa itu.<br><br>Kisah nabi keenam yang mendapatkan julukan sebagai bapak para nabi sebab dari beliau lahir para pejuang di jalan Allah SWT yang ditujukan pada kaum di masanya.\n\n<h4>Orang Tua Nabi Ibrahim</h4>\nDinukil dari buku karya Syaikh Muhammad bin Ahmad bin Ilyas (1448-1522) berjudul Kisah Penciptaan dan Tokoh-tokoh Sepanjang Zaman, menyebutkan bahwa Zar merupakan pamannya. Sedangkan untuk ibunya bernama Layutsa yakni seorang wanita yang menyembunyikan keimanannya.<br><br>Ceritanya terdiri dari beberapa versi, menurut salah satu sumber Nabi Ibrahim dilahirkan di sebuah kampung bernama Barzakh. Tepatnya terletak di daerah Damaskus yakni sebuah gua yang sangat terkenal. Dikatakan apabila berdoa di dalamnya maka semua pengharapannya akan dikabulkan.\n\n<h4>Kelahiran Nabi Ibrahim</h4>\nSebelum kelahiran Nabi Ibrahim, para ahli nujum memberitahukan kepada Raja Namrud bahwa pada 1889-1956 M akan lahir seorang anak lak-laki yang akan membinasakannya kelak. Oleh sebab itu ia memerintahkan prajurit untuk mencari nya supaya yang diramalkan tidak menjadi kenyataan.<br><br>Lantas anak laki-laki yang lahir di tahun itu dibunuh bahkan para lelaki dilarang menggauli istrinya bahkan setiap rumah dijaga oleh para pegawai istana. Beberapa waktu setelahnya dukunnya memberitahukan bahwa waktu kelahiran dari pembahasanya kelak sudah sangat dekat.\n\n<h4>Keanehan Saat Kelahirannya</h4>\nKetika masa melahirkan sudah dekat, ibu Ibrahim masuk ke dalam gua agar tidak diketahui oleh pengawal kerajaan agar anak yang dikandungnya selamat. Wajah mungilnya saat itu memancarkan cahaya tepat pada keningnya. Saat itulah terjadi berbagai keanehan di wilayah tersebut.<br><br>Berhala yang mulanya kokoh berdiri, tiba-tiba berjatuhan, balkon gedung Namrud ambruk, dan mahkota jatuh dari kepalanya. Selanjutnya ibu Ibrahim menutup pintu gua untuk melindunginya supaya tidak sampai ditemukan oleh orang-orang yang berniat jahat.\n\n<h4>Kehidupan Ibrahim Setelah Dilahirkan</h4>\nTepatnya satu minggu setelah di gua, ibu Ibrahim mendapati putranya sedang meminum susu dari ibu jari, sedangkan madu dan keju pada jari lainnya. setelah itu ditinggalkannya dan kembali lagi tepat 1 tahun. Pertumbuhannya terbilang lebih pesat jika dibandingkan dengan anak seusianya.<br><br>Setiap bulannya Ibrahim tumbuh layaknya anak berusia 1 tahun, ketika keluar dari gua ditaksir usianya layaknya anak berusia 12 tahun. Saat itu Ibrahim kecil sedang mencari Tuhannya dengan menafakuri kejadian besar seperti matahari terbit, gunung, laut, dan sebagainya.\n\n<h4>Proses Perjalanannya Mencari Tuhan</h4>\nSesaat setelah keluarnya dari gua, Ibrahim berusaha mencari Tuhannya dengan berbagai cara. Hal ini diabadikan dalam Al-Quran yang terdapat pada beberapa surah khusus. tujuannya adalah sebagai rekam jejak dan pelajaran bagi manusia agar mengetahui seberapa besar kekuasaan Allah SWT.<br><br>Hanya saja saat pencariannya, Ibrahim menemukan fakta bahwa yang ia anggap besar tidak bertahan lama dan pada saat itu muncul anggapan jika ada lebih berkuasa. Dalam ayat Al-Quran disebutkan “Sesungguhnya jika Tuhan tidak memberikan petunjuk maka aku termasuk orang sesat”\n\n<h4>Awal Mula Dakwah Nabi Ibrahim</h4>\nSemasa remaja, Ibrahim sering bertanya kepada ayahnya mengenai Tuhan yang sesungguhnya. Pada saat itu ia menyedari kesia-siaan adanya patung. Oleh sebab itu keinginan untuk menyedarkan kaumnya semakin kuat dan akhirnya mengambil jalan untuk berdakwah.<br><br>Sewaktu mendapati ayahnya tidak mau meninggalkan menyembah berhala, kesedihan menghampiri dirinya. Meski sudah mengingatkannya secara berulang namun ternyata pendiriannya sangat kukuh. Sampai pada akhirnya, Allah memberikan hukuman untuk orang-orang kafir.\n\n<h4>Ibrahim Memperingatkan Kaumnya</h4>\nSaat saat itu masyarakat di Bait Al-Maqdis mayoritas penduduknya masih menyembah berhala. Namun kenyataan pahit harus diterimanya, bahwa pembuat semua patung tersebut adalah ayahnya sendiri. Bentuknya sendiri sangat banyak salah satunya personifikasi dari rasi bintang.<br><br>Dalam berdakwah, ada banyak halangan dan rintangan yang harus dihadapinya. Termasuk menerima pelbagai penolakan dari kaumnya sendiri sehingga tetap menyembah patung. Mereka Menganggap bahawa kepercayaan turun temurun lebih kuat daripada ajaran Ibrahim AS.\n\n<h4>Firman Allah SWT Tentang Penolakan Dakwah Nabi Ibrahim AS</h4>\nDakwah yang beliau sampaikan ditolak mentah-mentah oleh masyarakat sekitar bahkan tidak jarang mereka juga melakukan tindak kekerasan. Salah satu alasannya yang termaktub dalam Q.S Al-Anbiya: membahas mengenai “Kami mendapati bapak-bapak kami menyembahnya”.<br><br>Meskipun terus mendapatkan penolakan namun, Ibrahim tetap menyebarkan ajaran tauhid yakni mengesakan Allah kepada masyarakat. seiring berjalannya waktu mulai datang satu per satu orang menyatakan keimanannya. Hanya saja sebagian masih secara sembunyi-sembunyi karena takut.\n\n<h4>Perselisih Ibrahim AS dengan Raja Namrud</h4>\nKetakutan Raja Namrud mengenai kematiannya, semakin menghantui tatkala mendengar ada ajaran baru yang dibawa oleh Ibrahim AS. Selama sisa hidupnya, ia terus mencari cara agar ramalan yang dahulu pernah didengarnya tidak menjadi kenyataan menggunakan strategi ancaman.<br><br>Awal perselisihan antara Ibrahim dan Namrud terjadi ketika utusan Allah tersebut meruntuhkan segala patung terkecuali yang paling besar. Hal ini dijelaskan dalam Q.S Al-Anbiya yang intinya terkait jawaban atas pertanyaan kaumnya jika ajaran tauhid itu benar adanya dan ia dapat membuktikannya.\n\n<h4>Akhir Hayat Nabi Ibrahim</h4>\nPerjalanan dakwah Nabi Ibrahim harus terhenti dan digantikan oleh putranya. Pada waktu itu Beliau sedang duduk di teras rumahnya dan mengetahui kedatangan seorang lelaki tua dengan wajah lusuh sambil memegang tongkat, iapun mempersilakan untuk masuk kemudian menjamunya.<br><br>Tanpa disangka lelaki tua itu adalah malaikat Izrail. Setelah satu tahun berlalu, Izrail datang kembali dengan wujud tampan. Namun sempat terjadi tawar menawar ketika akan mencabut nyawa Nabi Ibrahim AS. hal in bahan membuat malaikat harus Menyampaikan pesanan kepada Allah SWT.\n\n<h4>Tubuhnya Tidak Hangus Terbakar Api</h4>\nKeberanian Nabi Ibrahim menentang Namrud, membuat raja itu murka karena selain takut ramalan di masa lalunya terwujud juga pengikutnya semakin berkurang. dengan demikian harta kekayaannya juga tidak melimpah ruah seperti sedia kala. Guna mencegahnya maka ia melakukan berbagai cara.<br><br>Termasuk salah satunya dengan membakar Nabi Ibrahim di api menyala. Fakta mengejutkannya, ternyata tubuh Nabi Allah tidak tersentuh api sama sekali bahkan dikatakan rasanya dingin. Kejadian ini diabadikan dalam Q.S Al-Anbiya ayat 69 yang sekarang sering dijadikan salah satu ayat ruqyah.\n\n<h4>Dapat Mengeluarkan Madu dari Jarinya</h4>\nSaat masih kecil, Ibrahim ditinggal oleh ibunya di dalam gua sendirian karena menghindari terjadinya pertumpahan darah. Ibunya pun mengunjungi tidak sering, namun anehnya dari jari putranya dapat mengeluarkan madu. Sedangkan bagian lainnya terdapat keju sehingga nutrisi tetap terpenuhi.<br><br>Meski terlihat kekurangan asupan, nabi Ibrahim kecil dapat tumbuh lebih pesat jika dibandingkan dengan anak usia sebayanya. Bahkan ketika keluar gua, usianya sudah terlihat layaknya 12 tahun. Keajaiban ini tidak dimiliki semua Nabi, karena Allah menurunkan keajaiban sesuai kebutuhan.\n\n<h4>Menghidupkan Makhluk yang sudah Mati</h4>\nKejadian ini diabadikan dalam salah satu surah yakni Al-Baqarah ayat 260 yang mengesahkan bahawa pada saat itu Nabi Ibrahim belum mempercayai tentang keesaan Allah. Akhirnya diperlihatkan bagaimana cara menghidupkan makhluk mati yang tentunya tidak bisa dilakukan manusia normal.<br><br>Dalam Q.S Al-Baqarah diceritakan bahawa Allah memerintahkan Ibrahim untuk mencincang tubuh burung kemudian meletakkannya di atas bukit. Selanjutnya Beliau harus memanggilnya dan kejadian ajaib berlangsung. Makhluk tersebut hidup kembali sehingga dapat terbang menghampirinya.",
                "isi_eng": "Knowing the story of the Prophet Abraham can be one way to emulate his good qualities. His story is immortalized in the Koran as a lesson and teaching complete with stories from his people. In fact, it was not uncommon to see punishment for opponents at that time.<br><br>The story of the sixth prophet who was nicknamed the father of the prophets because from him the warriors in the path of Allah SWT were born, aimed at the people of his time.\n\n<h4>Parents of Prophet Ibrahim</h4>\nQuoted from the book by Sheikh Muhammad bin Ahmad bin Ilyas (1448-1522) entitled The Story of Creation and Characters Throughout the Ages, it states that Zar was his uncle. While his mother was named Layutsa, a woman who hid her faith.<br><br>The story consists of several versions, according to one source the Prophet Ibrahim was born in a village called Barzakh. It is precisely located in the Damascus area, namely a very famous cave. It is said that if you pray in it, all your hopes will be granted.\n\n<h4>The Birth of Prophet Ibrahim</h4>\nBefore the birth of Prophet Ibrahim, astrologers told King Namrud that in 1889-1956 AD a son would be born who would destroy him in the future. Therefore he ordered the soldiers to look for him so that what was predicted would not come true. <br><br>Then the boys born that year were killed and men were forbidden to have sex with their wives, even every house was guarded by palace officials. Some time later the shaman informed him that the time of birth of his future companion was very close.\n\n<h4>The Oddity of His Birth</h4>\nWhen the time of delivery was near, Ibrahim's mother entered the cave so that the royal guards would not find out so that the child she was carrying would be safe. Her tiny face at that time radiated light right on her forehead. That was when various strange things happened in the area.<br><br>The idols that were originally standing strong suddenly fell, the balcony of the Namrud building collapsed, and the crown fell from her head. Then Ibrahim's mother closed the cave door to protect her from being found by people with evil intentions.\n\n<h4>Abraham's Life After Birth</h4>\nExactly one week after being in the cave, Ibrahim's mother found her son drinking milk from his thumb, while honey and cheese from his other fingers. After that he left and came back exactly 1 year later. His growth is considered more rapid compared to children his age. <br><br>Every month Ibrahim grows like a 1 year old child, when he comes out of the cave his age is estimated to be like a 12 year old child. At that time, little Ibrahim was looking for his God by observing major events such as the sunrise, mountains, sea, and so on.\n\n<h4>The Process of His Journey to Find God</h4>\nShortly after leaving the cave, Ibrahim tried to find his God in various ways. This is immortalized in the Quran which is found in several special chapters. The purpose is as a track record and lesson for humans to know how great the power of Allah SWT is.<br><br>It's just that during his search, Ibrahim found the fact that what he considered great did not last long and at that time the assumption arose that there was someone more powerful. In the verse of the Quran it is stated \"Indeed if God does not give guidance then I am among those who are astray\"\n\n<h4>The Beginning of the Prophet Ibrahim's Da'wah</h4>\nAs a teenager, Ibrahim often asked his father about the real God. At that moment he realized the futility of statues. Therefore, the desire to awaken his people became stronger and he finally took the path of preaching. <br><br>When he found that his father did not want to abandon worshiping idols, sadness came over him. Even though he had reminded him repeatedly, it turned out that his stance was very firm. Until in the end, Allah gave punishment to the disbelievers.\n\n<h4>Ibrahim Warns His People</h4>\nAt that time, the majority of people in Bait Al-Maqdis still worshiped idols. However, he had to accept the bitter reality that the maker of all these statues was his own father. There are many forms, one of which is the personification of the constellations.<br><br>In preaching, there are many obstacles and obstacles that must be faced. Including receiving various rejections from his own people so that he continued to worship statues. They consider that the beliefs passed down from generation to generation are stronger than the teachings of Abraham AS.\n\n<h4>The Word of Allah SWT Concerning Rejection of the Da'wah of Prophet Ibrahim AS</h4>\nThe preaching that he conveyed was rejected outright by the surrounding community, and not infrequently they also committed acts of violence. One of the reasons is stated in Q.S Al-Anbiya: discussing \"We found our fathers worshiping it\". <br><br>Despite continuing to receive rejection, Ibrahim continued to spread the teachings of monotheism, namely the oneness of Allah, to the community. As time went by, people began to come one by one to declare their faith. It's just that some still do it secretly because they are afraid.\n\n<h4>The dispute between Ibrahim AS and King Nimrod</h4>\nKing Namrud's fear of his death, increasingly haunted him when he heard that there was a new teaching brought by Ibrahim AS. For the rest of his life, he continued to look for ways so that the prophecy he had heard before would not come true using a strategy of threats. <br><br>The beginning of the dispute between Ibrahim and Namrud occurred when the messenger of Allah tore down all the statues except the largest one. This is explained in Q.S Al-Anbiya which is essentially related to the answer to the question of his people if the teaching of monotheism is true and he can prove it.\n\n<h4>The End of the Life of Prophet Ibrahim</h4>\nProphet Ibrahim's missionary journey had to stop and was replaced by his son. At that time he was sitting on the porch of his house and knew the arrival of an old man with a shabby face holding a stick, he invited him to come in and then entertained him. <br><br>Unexpectedly the old man was the angel Izrail. After a year had passed, Izrail came back with a handsome form. However, there was a bargaining when he was going to take the life of Prophet Ibrahim AS. This made the angel have to convey the order to Allah SWT.\n\n<h4>His body was not burned by the fire</h4>\nThe courage of Prophet Ibrahim to oppose Namrud, made the king furious because in addition to being afraid of the prophecy in his past coming true, his followers were also decreasing. Thus his wealth was not as abundant as before. In order to prevent it, he did various ways. <br><br>Including one of them by burning Prophet Ibrahim in a burning fire. The surprising fact is, it turns out that the body of the Prophet of Allah was not touched by the fire at all, it was even said to feel cold. This incident is immortalized in Q.S Al-Anbiya verse 69 which is now often used as one of the ruqyah verses.\n\n<h4>Can Eject Honey from His Fingers</h4>\nWhen he was little, Ibrahim was left alone in a cave by his mother to avoid bloodshed. His mother did not visit often, but strangely from her son's finger honey could come out. While the other parts contained cheese so that nutrition was still met. <br><br>Although it seemed like he lacked intake, the little prophet Ibrahim was able to grow faster when compared to children his age. Even when he came out of the cave, he already looked like he was 12 years old. This miracle was not possessed by all prophets, because Allah sent down miracles according to need.\n\n<h4>Bringing Dead Creatures to Life</h4>\nThis incident is immortalized in one of the suras, namely Al-Baqarah verse 260, which confirms that at that time the Prophet Ibrahim did not believe in the oneness of Allah. Finally it was shown how to bring dead creatures to life which of course normal humans cannot do.<br><br>In Q.S Al-Baqarah it is said that Allah ordered Ibrahim to chop up the bird's body and then place it on a hill. Next He had to call him and a miraculous event took place. The creature came back to life so it could fly to him."
            },
            {
                "no": 7,
                "name_id": "Nabi Ismail AS",
                "name_eng": "Prophet Ishmael AS",
                "arab": "اسماعيل عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ismail.png",
                "isi": "Bagi setiap umat muslim setiap satu tahun sekali pasti akan merayakan hari kurban atau dikenal dengan Idul Adha. Pada hari ini, umat muslim akan menyembeli hewan kurban berupa sapi atau kambing atau unta.  Dibalik terjadinya Idul Adha terdapat kisah dari dua orang Nabi yang di mana mereka berdua memiliki hubungan pertalian darah, yaitu ayah dan anak. Dalam kisah Nabi dan Rasul ini, Nabi Ibrahim AS adalah ayah dari Nabi Ismail AS, hubungan mereka berdua patut dicontoh oleh umat muslim terutama saat menjalankan perintah Allah.<br><br>Kisah tentang terjadinya idul adha ini selalu menarik untuk dibahas setiap tahunnya terutama pada saat perayaan kurban. Selain itu, kisah dari Nabi Ibrahim AS dan Nabi Ismail AS juga memiliki banyak sekali nilai-nilai atau pelajaran hidup yang bisa kita ambil dan digunakan dalam kehidupan sehari-hari, sehingga amalan baik kita bisa bertambah.<br><br>Berbicara tentang kisah Nabi Ismail AS tak bisa dilepaskan dari Nabi Ibrahim AS yang merupakan ayah kandungnya terutama kisah yang berkaitan dengan munculnya Hari Raya Kurban (idul adha). Adanya kisah dari Nabi Ismail AS dan Nabi Ibrahim AS menunjukkan bahwa betapa besarnya rasa cinta rasa cinta anak kepada anakanya. Nabi Ismail AS yang merupakan anak dari Nabi Ibrahim sudah siap menerima agar dirinya disembelih seperti apa yang diperintahkan oleh Allah.\n\n<h4>Kisah Nabi Ismail : Hijrah Menuju ke Mekkah</h4>\nSiti Sarah adalah istri pertama dari Nabi Ibrahim AS, tetapi pernikahan mereka berdua belum dikaruniai buah hati. Pada saat itu, usia dari Nabi Ibrahim AS dan Siti Sarah sudah terbilang memasuki usia lanjut. Siti Sarah yang menyadari akan hal itu, kemudian memberikan izin kepada Nabi Ibrahim AS untuk menikah lagi bersama dengan siti Hajar.<br><br>Nabi Ibrahim AS selalu memohon kepada Allah agar diberikan sang buah hati. Doa dari beliau pun dikabulkan oleh Allah. Pernikahan bersama dengan Siti Hajar dikaruniai satu buah hati laki-laki yang diberi nama Ismail. Nama yang diberikan itu mengandung arti yang sangat dalam (menurut bahasa Ibrani), yaitu Isma berarti mendengar dan El berarti Allah, jadi Ismail adalah Allah Maha Mendengar. Nabi Ibrahim AS memberikan nama Ismail karena Allah sudah mendengar dan mengabulkan permohonannya.<br><br>Nabi Ibrahim AS melakukan hijrah ke  Mekah atas dasar perintah Allah. Beliau melakukan hijrah bersama dengan istri kedua yang bernama Siti Hajar dan anaknya Nabi Ismail AS. Perintah dari Allah ini muncul karena Nabi Ibrahim mengambil keputusan setelah melihat istri pertamanya kurang senang dengan kebahagiaan yang dirasakan oleh Nabi Ibrahim AS dan Siti Hajar.<br><br>Hijrah ke Mekah ini dilakukan dengan menaiki unta dan setelah sampai di Mekah mereka mulai mencari tempat untuk berteduh. Ditemukanlah sebuah pohon yang bisa digunakan untuk tempat berteduh, pohon itu adalah pohon dauhah dan mereka pun segera turun dari unta.<br><br>Nabi Ibrahim AS mulai meninggalkan istri beserta anaknya di bawah pohon dauhah. Sebenarnya Nabi Ibrahim AS tidak tega untuk meninggalkan istri dan anaknya di tempat yang sangat sunyi dan sepi itu, tetapi semua ini karena perintah Allah, sehingga Nabi Ibrahim AS tidak ingin melanggarnya.<br><br>Sebelum pergi meninggalkan istri dan anaknya, nabi Ibrahim berpesan kepada istrinya, “Tetap Bertakwalah kepada Allah yang telah menentukan kehendak-kehendak-Nya. Percayalah kepada kekuasaan dan rahmat-Nya. Dialah yang memberikan perintah kepadaku untuk membawamu (istri) ke sini.<br><br>Dialah yang akan memberikan perlindungan di tempat yang sunyi ini. Seandainya bukan karena perintah dan Wahyu dari Allah, aku sama tidak tega untuk meninggalkan kamu bersama anakku yang aku cintai. Percayalah wahai Hajar bahwa Allah tidak akan menelantarkan kalian berdua tanpa perlindungan-Nya. Rahmat dan berkah-Nya akan selalu turun untuk selamanya, insya Allah.”<br><br>Siti Hajar hanya membawa bekal air minum seadanya dan beberapa biji buah kurma. Hati Siti Hajar merasa tenang setelah mendengarkan pesan dari Nabi Ibrahim AS. Di tempat sunyi itu, Siti Hajar mulai berdoa kepada Allah agar selalu diberikan perlindungan agar mampu bertahan di tempat yang gersang dan tandus itu.\n\n<h4>Kisah Nabi Ismail : Menemukan Air Zamzam</h4>\nDi tempat yang sunyi dan tidak ada orang selain Siti Hajar dan anaknya, Ismail harus merasa kesepian, hingga Ismail selalu menangis ketika sedang merasakan haus. Dengan penuh kasih sayang, Siti Hajar menyusui putranya ketika sedang haus. Namun, setelah satu hari berada di tempat sunyi itu, Siti Hajar mulai merasakan kesedihan karena melihat ketersediaan buah kurma dan perbekalan air sudah mulai habis. Ketika sedih, Siti Hajar selalu berharap agar ada orang lain yang melintas di tempat sunyi itu dan membantu dirinya dan putranya.<br><br>Hingga pada suatu waktu, putranya Ismail tak berhenti-hentinya menangis karena air susu Siti Hajar tidak bisa keluar, sehingga rasa haus dari Ismail tak segera hilang. Semakin kencang tangisan dari Ismail, Siti Hajar semakin bingung harus melakukan apalagi agar rasa haus Ismail segera hilang dan tangisannya mulai menghilang.<br><br>Untuk menenangkan Ismail, Siti Hajar mulai pergi ke Bukit Safa dan terpaksa meninggalkan Ismail di atas pasir. Siti Hajar berharap ketika sampai di Bukit Safa menemukan air agar rasa haus putranya hilang. Ketika sampai di Bukit Safa, Siti Hajar tidak menemukan air yang bisa diminum untuk putranya.<br><br>Kemudian, beliau berlari untuk pergi ke Bukit Marwah dan di bukit itu, tetap tidak ada air yang bisa diminum. Bukan hanya sekali, Siti Hajar bolak-balik ke Bukit Safa terus ke Bukit Marwah sebanyak tujuh kali, tetapi tetap tidak ditemukan air yang bisa diminum dan Siti Hajar merasa sia-sia karena tidak menemukan air.<br><br>Siti hajar kembali menuju Ismail dengan penuh rasa bingung dan cemas karena tidak menemukan air. Namun, Allah berkehendak lain dan menolong Siti Hajar melalui malaikat Jibril yang mengubah wujudnya menjadi manusia, kemudian Malaikat Jibril menghentakkan kaki dengan mengucapkan “Zamzam!  Zamzam!” hingga keluarlah air yang cukup banyak dan menyebar dan membentuk seperti telaga kecil.<br><br>Setelah malaikat Jibril pergi, Siti Hajar langsung meminum air  zamzam untuk menghilangkan rasa hausnya. Tak hanya itu, Siti Hajar merasa kenyang setelah meminum air zamzam itu dan kemudian beliau menyusui putranya, Ismail. Setelah mendapatkan semua kenikmatan yang bisa dirasakan oleh Siti Hajar dan putranya, Siti Hajar tak henti-hentinya berterima kasih kepada Allah.<br><br>Air zamzam itu memberikan banyak sekali manfaat bukan hanya untuk Siti Hajar dan Ismail saja, tetapi kepada banya orang, seperti rombongan suku Jurhum yang pada saat itu merasakan rasa haus dan bingung mencari sumber air. Seiring dengan berjalannya waktu, semakin banyak orang yang mulai tinggal di dekat air zamzam itu, sehingga tempat yang tadinya sepi dan sunyi perlahan-lahan mulai ramai dan Siti Hajar tidak merasakan kesepian.<br><br>Ismail putra dari Nabi Ibrahim dan Siti Hajar mulai bertambah umur dan ia membantu ibunya untuk menggembalakan kambing dan biri-biri ke Padang Arafah. Hingga akhirnya Siti Hajar dan Ismail kehidupannya semakin baik, sejahtera, dan aman. Siti Hajar, Ismail dan orang-orang Mekah menjaga kesucian air zamzam yang sangat suci dan dengan air zamzam kehidupan masyarakat mekah semakin menuju kebahagiaan. Adanya air zamzam menunjukkan akan kasih sayang Allah kepada Siti Hajar dan Ismail.\n\n<h4>Kisah Nabi Ismail : Perintah Untuk Menyembelih Ismail</h4>\nPada sautu waktu, Nabi Ibrahim AS sangat ingin bertemu Siti Hajar dan Ismail dan beliau meminta izin kepada Siti Sarah untuk pergi menemui Siti Hajar dan Ismail. Setelah mendapatkan izin dari Siti Sarah, Nabi Ibarahim AS mulai beranjak pergi ke tempat di mana beliau meninggalkan istri dan anaknya di tempat yang sunyi dan sepi.<br><br>Sesampainya di tempat yang dituju, Nabi Ibrahim AS terkejut karena tempat yang dulunya sepi, kini sudah ramai dan dihuni oleh banyak orang serta kehidupan dari istri dan putranya semakin baik dan sejahtera. Siti Hajar yang melihat kedatangan dari Nabi Ibrahim AS sangat senang dan bahagia sekali karena setelah sekian lama tak bertemu.<br><br>Begitu juga dengan Nabi Ibrahim AS sangat senang ketika bertemu dengan putra dan istrinya dan beliau pun langsung memohon maaf karena harus meninggalkan istri dan putranya, “Wahai, istri dan anakku, maafkanlah aku. Selama ini, aku tidak pernah melihat keadan kalian karena harus berdakwah untuk menyebarluaskan kebenaran kepada penduduk di sana.”<br><br>Nabi Ibrahim yang terlalu lelah setelah melakukan perjalanan jauh mulai mengistirahatkan dirinya di Masy’aril Haram (sekarang Musdalifah). Nabi Ibrahim AS yang tertidur pulas mendapatkan mimpi berupa perintah untuk menyembelih putranya, Ismail sebagai kurban kepada Allah.<br><br>Setelah mendapatkan mimpi itu, Nabi Ibrahim AS segera terbangun dari tidurnya dan berpikir sangat lama sambil berusaha mengartikan maksud dari mimpi menyembeli putranya. Hingga sampai pagi hari, Nabi Ibrahim AS tidak bisa memejamkan matanya dan terus berusaha untuk mengartikan mimpinya itu, kemudian beliau ingin sekali bercerita kepada istrinya dan putranya, tetapi takut menambah rasa cemas dan khawatir kepada istrinya dan putranya.<br><br>Setelah selesai melakukan aktivitas di pagi hari dan malam pun tiba, Nabi Ibrahim AS segera tidur untuk mengistrirahatkan tubuhnya. Saat tidur itu, Nabi Ibrahim AS mulai bermimpi mendapatkan perintah untuk menyembelih putranya, “wahai, Ibrahim. Sembelihlah Ismail untuk berkurban kepada Allah S.W.T. Sembelihlah Ismail sebagai kurban untuk Allah S.W.T!” Perintah untuk menyembelih itu membuat Nabi Ibrahim AS sangat bingung hingga keringat membasahi keningnya. Hati Nabi Ibrahim AS pun mulai merasa resah dan gelisah, sehingga beliau mengambil air wudhu dan salat.<br><br>Setelah dua kali bermimpi berupa perintah untuk menyembelih, Nabi Ibrahim AS masih menerima untuk menyembelih putranya yang ketiga kali. Pada mimpi ketiga itu, Nabi Ibrahim AS mulai yakin bahwa perintah untuk menyembelih itu merupakan perintah dari Allah. Setelah berpikir panjang dan penuh dengan keyakinan, Nabi Ibrahim AS tetap akan menyembeli putranya, Ismail walaupun setan sudah menggodanya bahwa perintah itu adalah salah.<br><br>Nabi Ibrahim pun memaggil putranya dan mulai berbicara, “anakku, Ismai, ayah sangat berharap agar engkau selalu sabar dan tabah menerima perintah Allah.” Ismail pun sanga ikhlas dan sabar untuk menerima semua perintah itu, “ayah, apa pun perintah Allah, katakan saja! Saya akan tetap sabar dan tabah dan sebagai hamba Allah semua perintahnya harus dilaksanakan. Jelaskanlah, perintah itu dan saya akan sabar untuk mendengarkannya.”<br><br>Setelah mendengar semua penjelasan dari ayahnya, Ismail tetap mempelihatkan kesabaran dan ketabahan. Namun, istrinya, Siti Hajar sangat terkejut setelah mendengar semua perintah Allah yang diberitahukan lewat mimpi Nabi Ibrahim AS. Siti Hajar pun menangis mengeluarkan air mata hingga membasahi pipinya dan hanya bisa memeluk erat putra tercintanya sebelum disembelih.<br><br>Siti Hajar  hanya bisa menangis karena jika perintah dari Allah, ia tidak akan bisa menolaknya dan akan tetap melaksanakan segala perintah Allah. Keesokan harinya, Siti Hajar harus melepaskan putranya untuk dibawa Nabi Ibrahim AS ke suatu tempat untuk melaksanakan perintah Allah.<br><br>Di perjalanan menuju tempat yang dituju, Nabi Ibrahim AS dan Ismail mendapatkan banyak godaan dari iblis agar tidak melaksanakan perintah Allah. Namun, dengan penuh keyakinan mereka berdua tetap melanjutkan ke tempat untuk menyembeli Ismail. Setelah sampai di tempat tujuan, Bukit Malaikat Nabi Ibrahim AS tidak tega untuk menyembelih anaknya, sehingga beliau menutup wajah Ismail.<br><br>Ketika Nabi Ibrahim AS ingin melaksanakan perintah Allah, kemudian datanglah malaikat Jibril yang diutus oleh Allah untuk mencegah agar proses penyembelihan itu tidak terjadi. Setelah itu, malaikat Jibril mengganti Ismail dengan seekor kambing dan memerintahkan kepada Nabi Ibrahim AS, “untuk menjadikan hari ini sebagai hari raya bagi kalian berdua dan sedekahkanlah sebagian dari daging kambing itu kepada fakir miskin..”<br><br>Kisah tentang perintah untuk menyembelih Ismail ini terkandung di dalam Al-Quran Surat As-Shaffat ayat 102-107:<br><br>فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعْىَ قَالَ يَٰبُنَىَّ إِنِّىٓ أَرَىٰ فِى ٱلْمَنَامِ أَنِّىٓ أَذْبَحُكَ فَٱنظُرْ مَاذَا تَرَىٰ ۚ قَالَ يَٰٓأَبَتِ ٱفْعَلْ مَا تُؤْمَرُ ۖ سَتَجِدُنِىٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰبِرِينَ. فَلَمَّآ أَسْلَمَا وَتَلَّهُۥ لِلْجَبِينِ. وَنَٰدَيْنَٰهُ أَن يَٰٓإِبْرَٰهِيمُ. قَدْ صَدَّقْتَ ٱلرُّءْيَآ ۚ إِنَّا كَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ. إِنَّ هَٰذَا لَهُوَ ٱلْبَلَٰٓؤُا۟ ٱلْمُبِينُ. وَفَدَيْنَٰهُ بِذِبْحٍ عَظِيمٍ.<br><br><i>Maka ketika anak itu sampai (pada umur sanggup) berusaha bersama-sama Ibrahim, Ibrahim berkata: Hai anakku sesungguhnya aku melihat dalam mimpi bahwa aku menyembelihmu. Maka pikirkanlah apa pendapatmu! Ia menjawab, Hai bapakku, kerjakanlah apa yang diperintahkan kepadamu; Insya Allah kamu akan mendapatiku termasuk orang-orang yang sabar.</i><br><br>Tatkala keduanya telah berserah diri dan Ibrahim membaringkan anaknya atas pelipis (nya), (nyatalah kesabaran keduanya). Dan Kami panggillah dia: Hai Ibrahim, sesungguhnya kamu telah membenarkan mimpi itu, sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya ini benar-benar suatu ujian yang nyata. Dan Kami tebus anak itu dengan seekor sembelihan yang besar.",
                "isi_eng": "For every Muslim, once a year they will definitely celebrate the day of sacrifice or known as Eid al-Adha. On this day, Muslims will slaughter sacrificial animals in the form of cows, goats or camels. Behind the occurrence of Eid al-Adha there is a story of two prophets where they both have a blood relationship, namely father and son. In the story of the Prophet and Apostle, Prophet Ibrahim AS is the father of Prophet Ismail AS, their relationship should be emulated by Muslims, especially when carrying out Allah's commands. <br><br>The story of the occurrence of Eid al-Adha is always interesting to discuss every year, especially during the celebration of sacrifice. In addition, the story of Prophet Ibrahim AS and Prophet Ismail AS also has many values ​​or life lessons that we can take and use in everyday life, so that our good deeds can increase. <br><br>Talking about the story of Prophet Ismail AS cannot be separated from Prophet Ibrahim AS who is his biological father, especially the story related to the emergence of the Eid al-Adha (Eid al-Adha). The story of Prophet Ismail AS and Prophet Ibrahim AS shows how great the love of a child for his child is. Prophet Ismail AS who was the son of Prophet Ibrahim was ready to accept that he was slaughtered as ordered by Allah.\n\n<h4>The story of Prophet Ismail: Hijrah to Mecca</h4>\nSiti Sarah was the first wife of Prophet Ibrahim AS, but their marriage had not been blessed with children. At that time, the age of Prophet Ibrahim AS and Siti Sarah was already considered to be entering old age. Siti Sarah who realized this, then gave permission to Prophet Ibrahim AS to remarry with Siti Hajar. <br><br>Prophet Ibrahim AS always asked Allah to be given a child. His prayer was granted by Allah. The marriage with Siti Hajar was blessed with a baby boy named Ismail. The name given has a very deep meaning (according to Hebrew), namely Isma means hearing and El means Allah, so Ismail is Allah the All-Hearing. Prophet Ibrahim AS gave the name Ismail because Allah had heard and granted his request. <br><br>Prophet Ibrahim AS migrated to Mecca based on Allah's command. He migrated with his second wife named Siti Hajar and his son Prophet Ismail AS. This order from Allah emerged because Prophet Ibrahim made a decision after seeing that his first wife was not happy with the happiness felt by Prophet Ibrahim AS and Siti Hajar. <br><br>The migration to Mecca was carried out by riding a camel and after arriving in Mecca they started looking for a place to take shelter. They found a tree that could be used as a shelter, the tree was a dauhah tree and they immediately got off the camels. <br><br>Prophet Ibrahim AS began to leave his wife and children under the dauhah tree. Actually, Prophet Ibrahim AS did not have the heart to leave his wife and children in such a very quiet and deserted place, but all this was because of Allah's command, so Prophet Ibrahim AS did not want to violate it. <br><br>Before leaving his wife and children, Prophet Ibrahim advised his wife, \"Stay fearful of Allah who has determined His will. Trust in His power and mercy. He was the one who gave me the order to bring you (wife) here.<br><br>He is the one who will provide protection in this quiet place. If it were not for the command and revelation from Allah, I would not have the heart to leave you with my beloved son. Believe me, O Hajar, that Allah will not abandon you both without His protection. His mercy and blessings will always descend forever, God willing.”<br><br>Siti Hajar only brought a supply of drinking water and a few dates. Siti Hajar's heart felt calm after listening to the message from Prophet Ibrahim AS. In that quiet place, Siti Hajar began to pray to Allah to always be given protection so that she could survive in that arid and barren place.\n\n<h4>The story of Prophet Ismail: Finding Zamzam Water</h4>\nIn a quiet place with no one but Siti Hajar and her son, Ismail had to feel lonely, so Ismail always cried when he was thirsty. With great affection, Siti Hajar breastfed her son when he was thirsty. However, after one day in that quiet place, Siti Hajar began to feel sad because she saw that the availability of dates and water supplies had started to run out. When she was sad, Siti Hajar always hoped that someone else would pass by that quiet place and help her and her son. <br><br>Until one time, her son Ismail kept crying because Siti Hajar's milk could not come out, so Ismail's thirst did not go away immediately. The louder Ismail cried, the more confused Siti Hajar was about what to do so that Ismail's thirst would go away and his crying would start to disappear. <br><br>To calm Ismail down, Siti Hajar started going to Safa Hill and was forced to leave Ismail on the sand. Siti Hajar hoped that when she arrived at Safa Hill she would find water so that her son's thirst would go away. When she arrived at Safa Hill, Siti Hajar did not find drinkable water for her son. <br><br>Then, she ran to go to Marwah Hill and on that hill, there was still no drinkable water. Not just once, Siti Hajar went back and forth to Bukit Safa and then to Bukit Marwah seven times, but still couldn't find any drinkable water and Siti Hajar felt it was a waste because she couldn't find water.<br><br>Siti Hajar returned to Ismail full of confusion and anxiety because she couldn't find water. However, Allah had other plans and helped Siti Hajar through the angel Gabriel who changed her form to human form, then the angel Gabriel stomped his feet saying \"Zamzam! Zamzam!” until quite a lot of water came out and spread and formed like a small lake.<br><br>After the angel Gabriel left, Siti Hajar immediately drank Zamzam water to quench her thirst. Not only that, Siti Hajar felt full after drinking the Zamzam water and then she breastfed her son, Ismail. After getting all the pleasures that Siti Hajar and her son could feel, Siti Hajar never stopped thanking Allah. <br><br>Zamzam water provided many benefits not only for Siti Hajar and Ismail, but also for many people, such as the Jurhum tribe who at that time felt thirsty and were confused about looking for a water source. As time went by, more and more people began to live near the Zamzam water, so that the place that was previously quiet and quiet slowly began to become busy and Siti Hajar did not feel lonely.<br><br>Ismail, the son of the Prophet Ibrahim and Siti Hajar, began to get older and he helped his mother to herd goats and sheep to the Field of Arafah. Until finally Siti Hajar and Ismail's lives became better, more prosperous and safer. Siti Hajar, Ismail and the people of Mecca maintain the sanctity of the very holy Zamzam water and with Zamzam water the lives of the people of Mecca are increasingly moving towards happiness. The presence of Zamzam water shows Allah's love for Siti Hajar and Ismail.\n\n<h4>The Story of Prophet Ismail: The Order to Slaughter Ismail</h4>\nOnce upon a time, Prophet Ibrahim AS really wanted to meet Siti Hajar and Ismail and he asked permission from Siti Sarah to go and meet Siti Hajar and Ismail. After getting permission from Siti Sarah, Prophet Ibrahim AS started to go to the place where he left his wife and son in a quiet and deserted place. <br><br>Arriving at the destination, Prophet Ibrahim AS was surprised because the place that used to be deserted, was now crowded and inhabited by many people and the lives of his wife and son were getting better and more prosperous. Siti Hajar who saw the arrival of Prophet Ibrahim AS was very happy and very happy because after a long time they had not met. <br><br>Likewise, Prophet Ibrahim AS was very happy when he met his son and wife and he immediately apologized for having to leave his wife and son, \"O my wife and son, forgive me. During this time, I have never seen your condition because I have to preach to spread the truth to the people there.”<br><br>Prophet Ibrahim who was too tired after a long journey began to rest in Masy’aril Haram (now Musdalifah). Prophet Ibrahim AS who was fast asleep had a dream in the form of an order to slaughter his son, Ismail as a sacrifice to Allah.<br><br>After having the dream, Prophet Ibrahim AS immediately woke up from his sleep and thought for a very long time while trying to interpret the meaning of the dream of slaughtering his son. Until morning, Prophet Ibrahim AS could not close his eyes and continued to try to interpret his dream, then he really wanted to tell his wife and son, but was afraid of increasing his wife and son's anxiety and worry.<br><br>After finishing his activities in the morning and night came, Prophet Ibrahim AS immediately went to sleep to rest his body. While sleeping, Prophet Ibrahim AS began to dream of getting an order to slaughter his son, “O, Ibrahim. Slaughter Ismail as a sacrifice to Allah SWT. Slaughter Ismail as a sacrifice for Allah SWT!\" The order to slaughter made Prophet Ibrahim AS very confused until sweat soaked his forehead. Prophet Ibrahim AS's heart began to feel restless and anxious, so he performed ablution and prayed. <br><br>After dreaming twice in the form of an order to slaughter, Prophet Ibrahim AS still accepted to slaughter his son for the third time. In the third dream, Prophet Ibrahim AS began to believe that the order to slaughter was an order from Allah. After thinking long and hard and full of conviction, Prophet Ibrahim AS would still slaughter his son, Ismail even though Satan had tempted him that the order was wrong. <br><br>Prophet Ibrahim then called his son and began to speak, \"My son, Ismai, father really hopes that you will always be patient and steadfast in accepting Allah's orders.\" Ismail was also very sincere and patient in accepting all the orders, \"Father, whatever Allah's order is, just say it! I will remain patient and steadfast and as a servant of Allah all his orders must be carried out. Explain the command and I will be patient to listen to it.”<br><br>After hearing all the explanations from his father, Ismail still showed patience and fortitude. However, his wife, Siti Hajar was very surprised after hearing all the commands of Allah that were told through the dream of Prophet Ibrahim AS. Siti Hajar cried, tears wetting her cheeks and could only hug her beloved son tightly before being slaughtered.<br><br>Siti Hajar could only cry because if the command was from Allah, she would not be able to refuse it and would still carry out all of Allah's commands. The next day, Siti Hajar had to let go of her son to be taken by Prophet Ibrahim AS to a place to carry out Allah's command.<br><br>On the way to the destination, Prophet Ibrahim AS and Ismail received many temptations from the devil so that they would not carry out Allah's command. However, with full confidence they both continued to the place to slaughter Ismail. After arriving at their destination, Prophet Ibrahim AS's Angel Hill did not have the heart to slaughter his son, so he covered Ismail's face.<br><br>When Prophet Ibrahim AS wanted to carry out Allah's orders, then the angel Gabriel came who was sent by Allah to prevent the slaughtering process from happening. After that, the angel Gabriel replaced Ismail with a goat and ordered Prophet Ibrahim AS, \"to make this day a holiday for both of you and give some of the goat's meat to the poor.\"<br><br>The story of the order to slaughter Ismail is contained in the Al-Quran Surah As-Saffat verses 102-107:<br><br>فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعْىَ قَالَ يَٰبُنَىَّ إِنِّىٓ أَرَىٰ فِى ٱلْمَنَامِ أَنِّىٓ أَذْبَحُكَ فَٱنظُرْ مَاذَا تَرَىٰ ۚ قَالَ يَٰٓأَبَتِ ٱفْعَلْ مَا تُؤْمَرُ ۖ سَتَجِدُنِىٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰبِرِينَ. فَلَمَّآ أَسْلَمَا وَتَلَّهُۥ لِلْجَبِينِ. وَنَٰدَيْنَٰهُ أَن يَٰٓإِبْرَٰهِيمُ. قَدْ صَدَّقْتَ ٱلرُّءْيَآ ۚ إِنَّا كَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ. إِنَّ هَٰذَا لَهُوَ ٱلْبَلَٰٓؤُا۟ ٱلْمُبِينُ. وَفَدَيْنَٰهُ بِذِبْحٍ عَظِيمٍ.<br><br><i>So when the child reached (at the age of being able) to try together with Ibrahim, Ibrahim said: O my son, indeed I saw in a dream that I was slaughtering you. So think about what you think! He answered, O my father, do what you are commanded; God willing, you will find me among those who are patient.</i><br><br>When both of them had surrendered and Ibrahim laid his son on (his) temple, (the patience of both of them was evident). And We called to him: O Ibrahim, verily you have justified the dream, verily that is how We reward those who do good. In fact, this is truly a real test. And We redeemed the child with a large sacrifice."
            },
            {
                "no": 8,
                "name_id": "Nabi Luth AS",
                "name_eng": "Prophet Lut AS",
                "arab": "لوط عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/luth.png",
                "isi": "Berdakwah memang bukan hal yang mudah, apalagi kalau yang dihadapi adalah masyarakat yang bebal dan tak berakhlak. Itulah yang dirasakan oleh Nabi Luth, salah satu nabi utusan Allah SWT yang ditugaskan untuk berdakwah kepada kaum Sodom (sadum).<br><br>Ya, kaum Sodom merupakan kaum yang dibenci Allah SWT karena banyak melakukan kemaksiatan. Oleh sebab itu, mengajak mereka kembali ke jalan yang benar adalah hal yang sangat berat. Berikut perjalanan dakwah Nabi Luth yang penuh liku-liku.\n\n<h4>Kisah Nabi Luth Diutus Allah SWT untuk Mendakwahi Kaum Sodom</h4>\nNabi Luth lahir dan diasuh oleh pamannya yang juga utusan Allah SWT, Nabi Ibrahim. Oleh sebab itu, Nabi Luth begitu hormat dan percaya dengan semua petuah Nabi Ibrahim kendati tidak sedikit orang yang meremehkannya.<br><br>Secara silsilah, ayah Nabi Luth bernama Haran bin Thareh. Haran merupakan saudara kandung dari Nabi Ibrahim. Haran memiliki saudara kembar bernama Nahor. Dengan demikian, garis keturunannya adalah Luth bin Haran, bin Azara bin Nahor, bin Suruj bin Ra’u bin Falij bin ‘Abir bin Syalih bin Arfahsad bin Syam bin Nuh.\n\n<h4>Nabi Luth Menerima Wahyu di Palestina</h4>\nKarena begitu dekat, Nabi Luth dan Nabi Ibrahim sering mengembara jauh, melintasi daratan dan lautan. Misi mereka adalah menyebarkan ajaran agama Islam pada umat manusia. Saat mereka tiba di Palestina, Nabi Luth menerima wahyu dari Allah SWT. Dia dipilih sebagai nabi dan diutus untuk mendakwahi kaum Sodom.\n\n<h4>Nabi Luth Ditugaskan Menetap di Kota Sodom</h4>\nUsai diangkat menjadi nabi, Nabi Luth diperintahkan oleh Allah SWT untuk menetap di Kota Sodom yang terletak di perbatasan Yordania dan Palestina. Nabi Luth bertugas untuk membawa orang-orang Sodom untuk bertaubat, kembali menyembah Allah SWT, dan menjauhi segala larangan-Nya. Namun, tugas itu tak mudah lantaran Kota Sodom dikenal sebagai kota maksiat, penuh korupsi, dan angka kriminalitasnya juga tinggi.<br><br>Karena banyak dikunjungi pedagang hingga pengusaha, banyak perampokan terjadi di kota itu. Tak hanya merampas barang-barang, kaum Sodom juga tak segan membunuh. Namun, tindakan kejahatan yang paling mengerikan adalah homoseksual dan lesbian.\n\n<h4>Perjalanan Dakwah Nabi Luth di Kota Sodom</h4>\nDi Kota Sodom, Nabi Luth menikah dengan seorang perempuan bernama Wali’ah. Dari pernikahan tersebut, mereka dikaruniai dua puteri, yaitu Raitsa dan Zaghrata. Namun, perjalanan rumah tangga Nabi Luth rupanya juga tidak mulus. Istrinya menjadi musuh dalam selimut. Segala rencana dakwah Nabi Luth kerap dibocorkan kepada orang-orang.\n\n<h4>Kota Sodom Jadi Sejarah Pertama Praktik Homoseksual dan Lesbian</h4>\nKota Sodom menjadi tempat pertama kegiatan homoseksual dan lesbian. Sepanjang sejarah umat manusia, tidak ada manusia yang menjalankan praktik homoseksual maupun lesbian sebelum kaum Sodom. Pasalnya, praktik penuh maksiat ini menjadi hal yang biasa di kota Sodom. Semua orang terlibat dan tanpa malu-malu mengakuinya di muka umum. Bahkan, mereka begitu bangga dengan apa yang mereka lakukan.<br><br>Selain kerusakan moral, akhlak kaum Sodom juga sulit dibenahi. Mereka tak beragama, tidak manusiawi, dan tidak memiliki rasa belas kasih. Mereka terbiasa melakukan pencurian, perampokan, hingga pembunuhan. Pada prinsipnya, orang yang kuat akan berkuasa, sementara orang lemah menjadi korban penindasan.\n\n<h4>Nabi Luth Tidak Dihiraukan oleh Kaum Sodom</h4>\nMeskipun moral kaum Sodom sudah sangat sulit dibenahi, Nabi Luth tetap teguh. Dia tetap berupaya mengembalikan mereka ke jalan yang benar. Suatu ketika, Nabi Luth menghampiri orang-orang di kota dan menyatakan bahwa dirinya seorang nabi utusan Allah SWT.<br><br>“Apakah kamu tidak takut kepada Allah dan tidak mau menaati-Nya? Sesungguhnya, saya adalah utusan Allah SWT yang dapat dipercaya untuk kalian. Jadi takutlah kepada Allah, pertahankan tugasmu kepada-Nya, dan patuhilah aku.”<br><br>Mendengar ucapan Nabi Luth, kaum Sodom langsung mencibir. Mereka curiga Nabi Luth memiliki maksud terselubung.<br><br>“Orang ini telah memasuki kota kita lalu menyuruh kita untuk menghentikan apa yang sedang kita lakukan? Jelas, dia pasti mendapatkan sesuatu dari ini! ”<br><br>Namun, Nabi Luth segera membantahnya. “Tidak ada hadiah yang saya minta dari kalian untuk itu. Hadiah saya hanya dari Allah SWT.”<br><br>Tak berhenti di sana, Nabi Luth kemudian berdakwah tentang homoseksualitas. Nabi Luth mengingatkan mereka bahwa homoseksual maupun lesbian adalah kegiatan yang tidak bermoral.<br><br>Nabi Luth lantas berkata, “Apakah kamu mendekati laki-laki di antara dunia dan meninggalkan orang-orang yang Tuhanmu ciptakan untukmu sebagai istrimu? Tidak! Kamu adalah orang-orang yang melampaui batas!”<br>Meskipun sudah menjelaskan hingga berulang-ulang, Nabi Luth tidak dihiraukan.\n\n<h4>Nabi Luth akan Diusir dari Kota Sodom</h4>\nDalam dakwahnya, Nabi Luth tidak bosan-bosannya mengingatkan umatnya tentang hukuman berat dari Allah SWT. Dia meminta umatnya untuk segera meninggalkan praktik maksiat yang amoral dan dibenci Allah SWT. Jengah dengan aksi Nabi Luth, kaum Sodom lantas berencana untuk mengusir Nabi Luth dari Kota Sodom. Namun, sebelum itu, mereka memberikan peringatan terakhir kepada Nabi Luth. “Wahai Luth! Jika kamu tidak berhenti, kamu akan menjadi salah satu dari mereka yang diusir!”<br><br>Namun, Nabi Luth tidak gentar sedikit pun. Dia tetap mengajak kaumnya untuk beriman dan beribadah kepada Allah SWT. Selain itu, mereka juga diminta untuk meninggalkan kebiasaan yang mungkar, menjauhi maksiat, kejahatan, hingga menghindari rayuan iblis dan setan.<br><br>Nabi Luth memperingatkan kaum Sodom bahwa bahwa Allah SWT adalah pencipta manusia beserta alam sekitarnya. Allah SWT juga tidak menyukai segala amal perbuatan kaum Sodom yang tidak berperikemanusiaan.<br><br>Bahkan, Allah SWT juga akan memberi mereka ganjaran yang setimpal dengan semua amal perbuatan mereka. Allah SWT telah berjanji, barang siapa yang berbuat kebaikan dan beramal soleh akan diberi pahala dan surga di akhirat kelak. Sementara, mereka yang berbuat mungkar akan diberi balasan berupa azab dan neraka Jahanam yang sangat pedih.\n\n<h4>Nabi Luth Tetap Teguh Berdakwah Kendati Sering Diancam</h4>\nMeskipun sering diancam, Nabi Luth tetap menjalankan dakwahnya. Dia tetap meminta umatnya untuk meninggalkan perbuatan zina homoseksual dan lesbian. Sebab, kedua perbuatan itu sangat bertentangan dengan fitrah dan hati nurani manusia. Selain itu, perbuatan kaum Sodom juga sudah menyalahi hikmah dalam penciptaan yaitu lelaki dan wanita.<br><br>Nabi Luth juga menasihati kaum Sodom untuk menghormati hak milik barang masing-masing serta meninggalkan kebiasaan berupa perampasan, perampokan hingga pencurian yang selalu terjadi di antara mereka. Apalagi, tidak sedikit pula musafir yang menjadi korban. Segala perbuatan kaum Sodom akan merugikan mereka sendiri. Sebab, perbuatan itu akan menimbulkan kekacauan, ketidakamanan di dalam negeri sehingga mereka juga pasti tidak akan merasa aman dan tenteram dalam hidupnya.<br><br>Namun, tidak semudah itu membawa kaum Sodom ke jalan Allah. Mereka tetap saja bermaksiat dan melakukan kejahatan. Pada akhirnya, Nabi Luth berdoa kepada Allah agar semua kaum Sodom diazab seberat-beratnya lantaran tidak mau mengikuti jalan yang benar.\n\n<h4>Kedatangan Tiga Pemuda Tampan Beserta Azab untuk Kaum Sodom</h4>\nSetelah sekian tahun berdakwah, tidak ada seorang pun di Kota Sodom yang mau beriman kepada Allah SWT. Satu-satunya keluarga muslim di Kota Sodom adalah keluarga Nabi Luth dan tidak semuanya beragama Islam. Hanya Nabi Luth dan kedua putri yang taat dalam agama, sementara sang istri tetap tidak beriman. Karena itulah, Nabi Luth berdoa kepada Allah SWT. Dia meminta pertolongan untuk melawan kaumnya yang tidak beriman dan masih suka bermaksiat.\n\n<h4>Tiga Pemuda Tampan Jadi Incaran Kaum Sodom</h4>\nSebagai jawaban atas doa Nabi Luth, Allah SWT mengirim tiga malaikat, yang menyamar sebagai laki-laki ke rumah Nabi Ibrahim sebagai tamu. Namun, Ibrahim gagal mengenali para malaikat tersebut. Dia lantas menyiapkan hidangan untuk para tamunya, Namun, ketiga laki-laki itu menolak makanan tersebut.<br><br>Takut sekaligus penasaran, Nabi Ibrahim lantas bertanya, “Siapa kalian?”<br>Malaikat menjawab, “Jangan takut. Kami adalah para malaikat Allah. Kami telah dikirim kepada orang-orang Luth. Kami memberimu kabar gembira tentang seorang putra yang memiliki banyak pengetahuan dan kebijaksanaan.”<br><br>Nabi Ibrahim pun kini paham bahwa hukuman Allah SWT bagi kaum Sodom sudah dekat. Namun, dia juga mengkhawatirkan keselamatan Nabi Luth. Para malaikat itu pun meyakinkan Nabi Ibrahim bahwa Nabi Luth beserta keluarganya akan diselamatkan.<br><br>Ketiga malaikat itu lantas bertamu ke rumah Nabi Luth. Tentu saja Nabi Luth terkejut saat melihat ketampanan mereka. Bagaimana tidak, mereka pasti akan menjadi korban kaum Sodom. Takut diketahui kaum Sodom, Nabi Luth segera membawa mereka masuk dan menutup pintu rapat-rapat.<br><br>Nabi Luth juga berpesan kepada istri dan dua putrinya agar merahasiakan kedatangan para tamu ini. Apabila kedatangan mereka sampai tercium kaum Sodom, habislah riwayat mereka. Nabi Luth merasa tidak sanggup menghadapi kaum Sodom yang sangat bengis dan haus bermaksiat itu.<br><br>Namun, informasi tentang keberadaan tiga laki-laki tampan begitu cepat tersebar luas. Istri Nabi Luth yang memang tidak beriman langsung membocorkannya pada kaum Sodom. Itulah alasan mengapa dakwah Nabi Luth kerap gagal, sebab sang istri selalu membocorkan informasi apapun terkait dakwah Nabi Luth. Timbal baliknya, istri Nabi Luth menerima emas dan perak dari kaum Sodom.\n\n<h4>Kisah Nabi Luth Dikepung Kaum Sodom yang Ingin Bermaksiat</h4>\nApa yang dikhawatirkan oleh Nabi Luth akhirnya terjadi. Informasi tentang tiga laki-laki tampan langsung tersiar dari mulut ke mulut dengan begitu cepat. Tanpa menunggu waktu lama, mereka bergegas mendatangi rumah Nabi Luth untuk melihat para tamunya serta memuaskan hawa nafsunya. Namun, Nabi Luth tidak membuka pintu rumahnya.<br><br>“Kembalilah ke rumah masing-masing! Jangan ganggu tamu-tamuku yang datang dari jauh. Kalian sepatutnya memuliakan dan menghormatinya!” seru Nabi Luth dari dalam rumah.<br><br>Namun, seruan Nabi Luth diabaikan begitu saja. Dia kini terkepung. Untuk yang terakhir kali, Nabi Luth memperingatkan kaumnya untuk menjauhi maksiat. Sebab, Allah SWT menciptakan manusia berpasangan antara laki-laki dan perempuan untuk menjaga kelangsungan umat manusia di muka bumi ini.<br><br>Nabi Luth juga meminta kaumnya untuk kembali kepada istri-istri mereka dan tidak berbuat maksiat sebelum dilanda azab yang pedih dari Allah SWT. Namun, lagi-lagi semua upaya Nabi Luth tidak diindahkan. Mereka kian merangsek, ingin mendobrak rumah Nabi Luth dari segala penjuru.<br><br>“Sesungguhnya aku tidak mampu lagi menahan mereka agar tidak menyerbu ke dalam rumah ini.Aku tidak memiliki senjata, apalagi kekuatan fisik yang dapat melawan tindakan mereka. Aku juga tidak mempunyai keluarga atau sanak saudara yang ditakuti kaumku. Aku merasa sangat kecewa karena sebagai tuan rumah aku tidak bisa menjaga kalian dari gangguan mereka.”<br><br>Melihat ketakutan Nabi Luth, akhirnya para lelaki tampan itu mengaku pada Nabi Luth bahwa mereka adalah para malaikat Allah yang diutus untuk memberikan azab mengerikan bagi kaum Sodom. Mendengar hal itu, Nabi Luth pun tidak menyangka pertolongan Allah SWT akan datang secepat itu. Allah SWT telah memberikan jawaban atas semua doa-doanya.<br><br>Para malaikat itu lantas menunjukkan azab dari Allah SWT. Mereka meminta Nabi untuk membuka pintu rumahnya lebar-lebar agar orang-orang yang haus homoseksual itu bisa masuk. Begitu pintu dibuka, orang-orang langsung menyerbu dan berebutan untuk masuk. Namun, tiba-tiba pandangan mereka langsung gelap gulita. Mereka tidak dapat melihat apa pun. Mereka berkali-kali mengusap-usap mata, tetapi ternyata kini mereka sudah menjadi buta.<br><br>Para penyerbu rumah Nabi Luth masih dalam keadaan kacau balau berbenturan antara satu dengan lain dan berteriak-teriak seraya bertanya-tanya apa yang membuat mereka buta mendadak. Kemudian, para tamu jelmaan malaikat berseru kepada Nabi Luth agar meninggalkan segera perkampungan itu sebelum azab yang lebih besar melanda.<br><br>Nabi Luth diminta pergi secepat mungkin bersama keluarganya karena waktunya tak lama lagi. Azab itu telah tampak dan akan segera ditimpakan oleh Allah SWT. Para malaikat itu berpesan kepada Nabi Luth dan keluarganya agar melakukan perjalanan ke luar kota tanpa menoleh ke belakang.\n\n<h4>Kaum Sodom Ditimpa Azab Berupa Hujan Batu</h4>\nLewat tengah malam, Nabi Luth keluar dari rumahnya bersama istri dan dua putrinya. Mereka berjalan cepat menuju keluar kota. Sesuai petunjuk para malaikat, mereka tidak menoleh ke kanan maupun ke kiri. Namun demikian, istri Nabi Luth tetap saja bebal. Musuh dalam selimut Nabi Luth itu berjalan paling belakang. Langkahnya tidak secepat suami dan kedua anaknya.<br><br>Akan tetapi si istri yang menjadi musuh dalam selimut bagi Nabi Luth berada di belakang rombongan Nabi Luth. Dia berjalan perlahan-lahan, tidak secepat langkah suaminya. Dia meragukan kebenaran perkataan malaikat soal azab yang akan segera ditimpakan ke kaum Sodom.<br><br>Karena penasaran, dia pun menoleh ke belakang. Alhasil, azab itu kini menimpanya juga. Setelah berhasil melewati batas Kota Sodom di pagi buta, bumi tiba-tiba berguncang hebat. Kota Sodom terombang-ambing seperti lautan. Angin bertiup begitu kencang dari segala penjuru. Ada hujan lebat disertai petir, batu beterbangan yang tampak sangat mengerikan.<br><br>Sementara itu, orang-orang buta kaum Sodom yang masih kebingungan langsung berlarian. Banyak di antara mereka yang tertimbun oleh reruntuhan bangunan, termasuk istri Nabi Luth. Dia termasuk orang-orang yang sangat munafik di hadapan Allah SWT.<br><br>Setelah peristiwa itu, Nabi Luth kembali ke Sodom dan memulai hari-hari baru untuk berdakwah. Dia masih tetap bersemangat untuk membawa kaumnya ke dalam Islam. Nabi Luth tetap memegang teguh iman dan berharap agar kaumnya bisa segera melihat kesalahan jalan mereka dan kembali ke jalan Allah.<br><br>Nah, itulah penjelasan tentang kisah Nabi Luth, mulai dari diutus pertama kali untuk berdakwah pada kaum sodom sampai azab menimpa kaum ini. Sebagai umat muslim kisah Nabi Luth ini memiliki banyak pelajaran yang bisa kita ambil hikmahnya.",
                "isi_eng": "Preaching is not an easy thing, especially if you are facing a society that is ignorant and devoid of morals. That is what was felt by Prophet Lut, one of the messengers of Allah SWT who was assigned to preach to the people of Sodom (sadum). <br><br>Yes, the people of Sodom were a people hated by Allah SWT because they committed many immoralities. Therefore, getting them back on the right path is a very difficult thing. The following is the journey of Prophet Lut's preaching which is full of twists and turns.\n\n<h4>The story of Prophet Lut being sent by Allah SWT to preach to the people of Sodom</h4>\nProphet Luth was born and raised by his uncle who was also a messenger of Allah SWT, Prophet Ibrahim. Therefore, Prophet Luth was very respectful and believed in all the advice of Prophet Ibrahim even though many people underestimated him.<br><br>Genealogically, Prophet Luth's father was named Haran bin Thareh. Haran was the biological brother of Prophet Ibrahim. Haran had a twin brother named Nahor. Thus, his lineage is Luth bin Haran, bin Azara bin Nahor, bin Suruj bin Ra'u bin Falij bin 'Abir bin Syalih bin Arfahsad bin Syam bin Nuh.\n\n<h4>Prophet Luth Receives Revelation in Palestine</h4>\nBecause they were so close, Prophet Lut and Prophet Ibrahim often wandered far, across land and sea. Their mission is to spread the teachings of Islam to mankind. When they arrived in Palestine, Prophet Luth received a revelation from Allah SWT. He was chosen as a prophet and sent to preach to the Sodomites.\n\n<h4>Prophet Luth was assigned to settle in the city of Sodom</h4>\nAfter being appointed as a prophet, Prophet Luth was ordered by Allah SWT to settle in the city of Sodom which is located on the border of Jordan and Palestine. Prophet Luth was tasked with bringing the people of Sodom to repent, return to worshiping Allah SWT, and stay away from all His prohibitions. However, the task was not easy because the city of Sodom was known as a city of sin, full of corruption, and had a high crime rate.<br><br>Because it was visited by many traders and businessmen, many robberies occurred in the city. Not only did they rob goods, the Sodomites also did not hesitate to kill. However, the most terrible crime was homosexuality and lesbianism.\n\n<h4>Prophet Lut's Da'wah Journey in Sodom City</h4>\nIn the city of Sodom, Prophet Luth married a woman named Wali'ah. From this marriage, they were blessed with two daughters, namely Raitsa and Zaghrata. However, the journey of Prophet Luth's household was apparently not smooth. His wife became an enemy in disguise. All of Prophet Luth's preaching plans were often leaked to people.\n\n<h4>The City of Sodom Becomes the First Historical Site of Homosexual and Lesbian Practices</h4>\nThe city of Sodom was the first place for homosexual and lesbian activities. Throughout human history, no human had practiced homosexuality or lesbianism before the Sodomites. The reason is, this immoral practice was commonplace in the city of Sodom. Everyone was involved and shamelessly admitted it in public. In fact, they were so proud of what they did.<br><br>In addition to moral corruption, the morals of the Sodomites were also difficult to fix. They were irreligious, inhumane, and had no compassion. They were accustomed to stealing, robbing, and even murder. In principle, the strong will rule, while the weak become victims of oppression.\n\n<h4>Prophet Luth was ignored by the Sodomites</h4>\nEven though the morals of the people of Sodom were very difficult to fix, Prophet Luth remained steadfast. He continued to try to return them to the right path. One time, Prophet Luth approached the people of the city and declared that he was a prophet sent by Allah SWT.<br><br>“Do you not fear Allah and do not want to obey Him? Indeed, I am a trustworthy messenger of Allah SWT for you. So fear Allah, maintain your duty to Him, and obey me.”<br><br>Hearing Prophet Luth’s words, the people of Sodom immediately sneered. They suspected that Prophet Luth had ulterior motives.<br><br>“This man has entered our city and then told us to stop what we are doing? Clearly, he must have gotten something out of this!”<br><br>However, Prophet Luth immediately denied it. “There is no reward that I ask from you for that. My reward is only from Allah SWT.”<br><br>It did not stop there, Prophet Luth then preached about homosexuality. Prophet Luth reminded them that homosexuality and lesbianism were immoral activities.<br><br>Prophet Luth then said, \"Do you approach men among the worlds and leave those whom your Lord created for you as wives? No! You are people who exceed the limits!\"<br>Even though he had explained it repeatedly, Prophet Luth was ignored.\n\n<h4>Prophet Lut will be expelled from the city of Sodom</h4>\nIn his preaching, Prophet Luth never tired of reminding his people about the severe punishment from Allah SWT. He asked his people to immediately abandon immoral practices that were hated by Allah SWT. Fed up with Prophet Luth's actions, the people of Sodom then planned to expel Prophet Luth from the City of Sodom. However, before that, they gave a final warning to Prophet Luth. \"O Luth! If you don't stop, you will be one of those who are expelled!\" <br><br>However, Prophet Luth was not afraid at all. He continued to invite his people to believe in and worship Allah SWT. In addition, they were also asked to abandon immoral habits, stay away from immorality, evil, and avoid the temptations of the devil and Satan. <br><br>Prophet Luth warned the people of Sodom that Allah SWT is the creator of humans and the surrounding nature. Allah SWT also disliked all the inhumane deeds of the people of Sodom. <br><br>In fact, Allah SWT will also give them a reward that is commensurate with all their deeds. Allah SWT has promised, whoever does good deeds and does good deeds will be rewarded and heaven in the afterlife. Meanwhile, those who do wrong will be rewarded in the form of very painful punishment and hell.\n\n<h4>Prophet Luth Remained Steadfast in Preaching Despite Frequent Threats</h4>\nEven though he was often threatened, Prophet Luth continued to carry out his preaching. He still asks his people to abandon homosexual and lesbian adultery. Because, both actions are very contrary to human nature and conscience. Apart from that, the actions of the Sodomites also violated the wisdom in the creation of men and women. <br><br>Prophet Lut also advised the Sodomites to respect their respective property rights and abandon the habits of plundering, robbery and theft which always occurred among them. Moreover, quite a few travelers became victims. All the actions of the Sodomites would be detrimental to themselves. Because, this action will cause chaos and insecurity in the country so that they will definitely not feel safe and secure in their lives. <br><br>However, it is not that easy to bring the people of Sodom to the path of Allah. They still commit sins and commit crimes. In the end, Prophet Lut prayed to Allah that all the people of Sodom would be punished severely for not wanting to follow the right path.\n\n<h4>The Arrival of Three Handsome Young Men and the Punishment for the Sodomites</h4>\nAfter so many years of preaching, no one in Sodom City wanted to believe in Allah SWT. The only Muslim family in Sodom City was the family of Prophet Luth and not all of them were Muslim. Only Prophet Lut and his two daughters were devout in religion, while his wife remained a non-believer. For this reason, Prophet Lut prayed to Allah SWT. He asked for help to fight against his people who did not believe and still liked to commit sins.\n\n<h4>Three Handsome Young Men Become the Target of Sodomites</h4>\nIn response to the prayer of Prophet Luth, Allah SWT sent three angels, disguised as men, to the house of Prophet Ibrahim as guests. However, Ibrahim failed to recognize the angels. He then prepared a meal for his guests, but the three men refused the food.<br><br>Fearful and curious, Prophet Ibrahim then asked, “Who are you?”<br>The angels replied, “Do not be afraid. We are the angels of Allah. We have been sent to the people of Luth. We give you good news about a son who has much knowledge and wisdom.”<br><br>Prophet Ibrahim now understood that Allah SWT's punishment for the people of Sodom was near. However, he was also worried about the safety of Prophet Luth. The angels assured Prophet Ibrahim that Prophet Luth and his family would be saved.<br><br>The three angels then visited the house of Prophet Luth. Of course, Prophet Luth was surprised when he saw their handsomeness. How could they not be, they would definitely be victims of the people of Sodom. Afraid of being discovered by the Sodomites, Prophet Luth immediately brought them in and closed the door tightly. <br><br>Prophet Luth also told his wife and two daughters to keep the arrival of these guests a secret. If their arrival was known to the Sodomites, their history would be over. Prophet Luth felt unable to face the Sodomites who were very cruel and thirsty for sin. <br><br>However, information about the existence of the three handsome men spread quickly. Prophet Luth's wife, who was indeed not a believer, immediately leaked it to the Sodomites. That was the reason why Prophet Luth's preaching often failed, because his wife always leaked any information related to Prophet Luth's preaching. In return, Prophet Luth's wife received gold and silver from the Sodomites.\n\n<h4>The story of Prophet Lut being surrounded by Sodomites who wanted to commit sin</h4>\nWhat Prophet Luth feared finally happened. Information about the three handsome men spread quickly from mouth to mouth. Without waiting long, they rushed to Prophet Luth's house to see his guests and satisfy their lusts. However, Prophet Luth did not open the door of his house.<br><br>\"Go back to your respective homes! Do not disturb my guests who have come from far away. You should honor and respect them!\" shouted Prophet Luth from inside the house.<br><br>However, Prophet Luth's call was simply ignored. He was now surrounded. For the last time, Prophet Luth warned his people to stay away from sin. Because, Allah SWT created humans in pairs between men and women to maintain the continuity of humanity on this earth.<br><br>Prophet Luth also asked his people to return to their wives and not commit sins before being hit by a painful punishment from Allah SWT. However, once again all of Prophet Luth's efforts were ignored. They kept pushing forward, wanting to break into the house of Prophet Luth from all directions.<br><br>\"Indeed, I am no longer able to hold them back from storming into this house. I have no weapons, let alone physical strength that can fight their actions. I also have no family or relatives that my people fear. I feel very disappointed because as the host I cannot protect you from their disturbances.\"<br><br>Seeing the fear of Prophet Luth, finally the handsome men confessed to Prophet Luth that they were the angels of Allah who were sent to give terrible punishment to the people of Sodom. Hearing this, Prophet Luth did not expect the help of Allah SWT to come so quickly. Allah SWT had given the answer to all his prayers.<br><br>The angels then showed the punishment from Allah SWT. They asked the Prophet to open the door of his house wide so that the people who were thirsty for homosexuals could enter. As soon as the door was opened, people immediately stormed and fought to get in. However, suddenly their vision went completely dark. They could not see anything. They rubbed their eyes many times, but it turned out that they were now blind. <br><br>The invaders of Prophet Luth's house were still in a state of chaos, clashing with each other and screaming, wondering what had made them suddenly blind. Then, the guests who were incarnated as angels called out to Prophet Luth to leave the village immediately before a greater punishment struck. <br><br>Prophet Luth was asked to leave as soon as possible with his family because his time was short. The punishment had appeared and would soon be inflicted by Allah SWT. The angels told Prophet Luth and his family to travel out of town without looking back.\n\n<h4>The Sodomites were hit by the punishment of a hail of stones</h4>\nAfter midnight, Prophet Luth left his house with his wife and two daughters. They walked quickly towards the exit of the city. According to the instructions of the angels, they did not look right or left. However, Prophet Luth's wife remained stubborn. Prophet Luth's inner enemy walked at the back. Her steps were not as fast as her husband and two children. <br><br>However, the wife who was Prophet Luth's inner enemy was behind Prophet Luth's group. She walked slowly, not as fast as her husband. She doubted the truth of the angel's words about the punishment that would soon befall the people of Sodom. <br><br>Because she was curious, she looked back. As a result, the punishment now befell her too. After successfully passing the border of Sodom City in the early morning, the earth suddenly shook violently. The city of Sodom was tossed like an ocean. The wind blew so hard from all directions. There was heavy rain accompanied by lightning, flying stones that looked very scary. <br><br>Meanwhile, the blind people of Sodom who were still confused immediately ran. Many of them were buried under the rubble of buildings, including the wife of Prophet Luth. She was one of the people who were very hypocritical before Allah SWT.<br><br>After that incident, Prophet Luth returned to Sodom and started new days to preach. He was still enthusiastic about bringing his people to Islam. Prophet Luth remained steadfast in his faith and hoped that his people would soon see the error of their ways and return to the path of Allah.<br><br>Well, that is the explanation of the story of Prophet Luth, starting from being sent for the first time to preach to the people of Sodom until the punishment befell this people. As Muslims, the story of Prophet Luth has many lessons that we can learn from."
            },
            {
                "no": 9,
                "name_id": "Nabi Ishaq AS",
                "name_eng": "Prophet Isaac AS",
                "arab": "اسحق عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ishaq.png",
                "isi": "<h4>Sejarah Singkat Nabi Ishaq</h4>\nNama Ishaq atau Ishak berasal dari bahasa Ibrani Yi???q dengan arti tersenyum atau tertawa. Kata Ishaq sendiri terinspirasi dari ibunda Nabi Ishaq ‘alaihis salam. Di mana Sarah yang merupakan ibunda Ishaq pada saat itu tersenyum dengan lebar karena tidak percaya kabar gembira akan hadirnya Ishaq sebagai buah hatinya yang disampaikan oleh malaikat Jibril.<br><br>Nabi Ishaq ‘alaihis salam dilahirkan di Kota Kan’an pada tahun 1761 SM. Nabi Ishaq ‘alaihis salam adalah putra kedua dari Nabi Ibrahim ‘alaihis salam dengan Sarah setelah lahirnya Nabi Ismail ‘alaihis salam. Pada saat Nabi Ishaq ‘alaihis salam terlahir di dunia, usia Nabi Ibrahim ‘alaihis salam sudah terbilang sangat tua yaitu berumur 100 tahun. Nabi Ishaq ‘alaihis salam dilahirkan 14 tahun setelah Nabi Ismail ‘alaihis salam.<br><br>Semasa hidupnya, Nabi Ishaq ‘alaihis salam memiliki keturunan yang juga diangkat sebagai seorang nabi, yaitu Nabi Ya’qub ‘alaihis salam. Nabi Ishaq ‘alaihis salam merupakan nabi ke-sembilan yang ditugaskan berdakwah di wilayah Palestina menggantikan ayahnya yaitu Nabi Ibrahim ‘alaihis salam yang pada saat itu telah menginjak usia senja. Wilayah dakwah Nabi Ishaq ‘alaihis salam adalah di daerah Kan’an dan Syam.\n\n<h4>Tamu Nabi Ibrahim yang Mengabarkan Berita Akan Lahirnya Nabi Ishaq</h4>\nDiceritakan dalam  Al-Qur’an surat Hud ayat 69-73 bahwa suatu ketika Nabi Ibrahim ‘alaihis salam kedatangan tamu. Tamu-tamu tersebut menurut Usman Ibnu Muhaisin berjumlah empat orang, yaitu malaikat Jibril, Mikail, Israfil, dan Rafail.<br><br>Tamu tersebut memberi selamat kepada Nabi Ibrahim ‘alaihis salam. Setelah itu Nabi Ibrahim ‘alaihis salam menyuguhkan daging anak sapi yang dipanggang kepada mereka. Namun tangan mereka sama sekali tidak menjamah makanan tersebut.<br><br>Melihat hal tersebut Nabi Ibrahim ‘alaihis salam merasa curiga dan takut. Ternyata tamu-tamu asing tersebut adalah Malaikat utusan Allah Ta’ala yang datang untuk membinasakan kaum Luth.<br><br>Selain memiliki tujuan kepada kaum Luth, tamu tersebut juga bertujuan memberi kabar gembira kepada Nabi Ibrahim ‘alaihis salam akan kelahiran seorang putra yang bernama Ishaq. Sesuai yang termaktub dalam Al-Qur’an surat Hud ayat 71:<br><br><i>“Dan istrinya berdiri lalu dia tersenyum. Maka kami sampaikan kepadanya kabar gembira tentang (kelahiran) Ishaq dan setelah Ishaq (akan lahir) Ya’qub.” </i> (Q.S. Hud ayat 71).<br><br>Mengetahui kabar yang disampaikan tersebut, Sarah sangat tercengang sekaligus bahagia. Pasalnya Sarah pada saat itu sudah tua (ketika itu berusia 90 tahun) dan memiliki kondisi mandul. Namun sungguh kuasa Allah Ta’ala tiada bandingnya dan selalu memberi rahmat kepada hamba-Nya yang beriman.<br><br><i>“Demikianlah Tuhanmu memfirmankan. Sesungguhnya Dialah Yang Maha Bijaksana lagi Maha Mengetahui.”</i> (Q.S. Adz-Dzariyat ayat 30).<br><br>Kelahiran Ishaq sendiri merupakan sebuah berkah dan karunia bagi Nabi Ibrahim ‘alaihis salam. Karena Nabi Ibrahim ‘alaihis salam berharap kelak ketika dewasa Ishaq dapat diangkat sebagai nabi utusan Allah Ta’ala dan membantu dalam memerangi para penyembah berhala di Palestina.\n\n<h4>Perjalanan Dakwah Nabi Ishaq</h4>\nNabi Ishaq, ayahnya (Nabi Ibrahim ‘alaihis salam), dan anaknya (Nabi Ya’qub ‘alaihis salam) adalah orang-orang yang diberkahi dan dipuji oleh Allah Ta’ala seperti yang difirmankan Allah Ta’ala dalam Al-Qur’an surat Shaad ayat 45-47:<br><br><i>“Dan ingatlah hamba-hamba kami: Ibrahim, Ishaq, dan Ya’qub yang mempunyai perbuatan-perbuatan yang besar dan ilmu-ilmu yang tinggi. Sesungguhnya Kami telah menyucikan mereka dengan (menganugerahkan kepada mereka) akhlak yang tinggi yaitu selalu mengingatkan (manusia) pada negeri akhirat. Sesungguhnya mereka pada sisi Kami benar-benar termasuk orang-orang pilihan yang paling baik.”</i> (Q.S. Shaad ayat 45-47).<br><br>Selain Allah Ta’ala yang memberikan pujian secara langsung kepada Ibrahim, Ishaq, dan Ya’qub melalui ayat Al-Qur’an, Nabi Muhammad sallallahu alaihi wasallam pun memuji mereka melalui sabdanya:<br><br><i>“Yang mulia putra yang mulia, putra yang mulia dan putra yang mulia adalah Yusuf putra Ya’qub, putra Ishaq, putra Ibrahim.”</i> (HR. Al Bukhari dan Muslim).<br><br>Nabi Ishaq ‘alaihis salam ditugaskan untuk meneruskan dakwah Nabi Ibrahim di tanah Palestina. Beliau menyeru kepada kaum di sana untuk menyembah dan mengesakan Allah Ta’ala, mendirikan shalat, menunaikan zakat, serta mengerjakan kebajikan-kebajikan lainnya sesuai dengan apa yang diperintahkan oleh Allah Ta’ala.\n\n<h4>Pernikahan Nabi Ishaq dengan Gadis Iraq</h4>\nKetika sang ibunda telah tiada dan ayahanda-nya yaitu Nabi Ibrahim ‘alaihis salam sudah sangat tua, Nabi Ishaq ‘alaihis salam tak kunjung menikah. Hingga akhirnya Nabi Ibrahim ‘alaihis salam meminta kepada salah satu pelayannya untuk pergi ke Irak guna mencarikan calon istri dari keluarga Ibrahim untuk anaknya tersebut.<br><br>Pelayan tersebut lalu meminangkan seorang putri Betuel bin Nahor yaitu Ribka (Rifqah, Rafiqah) untuk Ishaq. Diketahui bahwa Nahor adalah saudara kandung Nabi Ibrahim ‘alaihis salam. Sehingga secara silsilah, Ribka adalah anak perempuan dari saudara sepupu Ishaq.<br><br>Akhirnya pada saat Nabi Ishaq berusia empat puluh tahun, menikahlah Ia dengan Ribka yang selanjutnya ikut dengan Nabi Ishaq untuk menetap di Palestina.\n\n<h4>Kelahiran Putra dari Nabi Ishaq</h4>\nSelepas menikahi seorang gadis Irak keturunan Ibrahim yang bernama Ribka, Nabi Ishaq ‘alaihis salam mengetahui jika Ribka ternyata memiliki kondisi mandul seperti sang ibunda terdahulu.<br><br>Namun Nabi Ishaq ‘alaihis salam dan Ribka tak pernah menyerah untuk berusaha dan memohon kepada Allah Ta’ala agar diberikan keturunan guna melanjutkan riwayat dakwah. Nabi Ishaq ‘alaihis salam selalu berdo’a dengan lembut dan penuh keyakinan kepada Allah Ta’ala agar Ribka dapat mengandung.<br><br>Dengan kebesaran dan kekuasaan Allah Ta’ala maka Ribka dapat hamil dan Nabi Ishaq ‘alaihis salam memperoleh keturunan saat beliau menginjak usia enam puluh tahun. Ribka melahirkan bayi laki-laki kembar.<br><br>Bayi laki-laki pertama diberi nama Esau (Aishu). Bentuk fisik Esau ketika pertama kali dilahirkan adalah memiliki tubuh berwarna merah dan seperti jubah berbulu (memiliki banyak bulu di sekujur tubuhnya).<br><br>Sedangkan bayi laki-laki kedua diberikan nama Ya’qub yang mana ketika dilahirkan dalam posisi memegang tumit kakaknya. Allah Ta’ala juga mengabadikan kisah kelahiran Ya’qub dalam  Al-Qur’an surat Al-Anbiya’ ayat 72:<br><br><i>“Dan Kami telah memberikan kepada-nya (Ibrahim) Ishaq dan Ya’qub, sebagai suatu anugerah (daripada Kami). Dan masing-masingnya Kami jadikan orang-orang yang saleh.”</i> (Q.S. Al-Anbiya’ ayat 72).<br><br>Saat bertumbuh dewasa, Esau dan Ya’qub memiliki ketertarikan yang cenderung bertolak belakang. Esau lebih suka mengasah kemampuannya dalam hal berburu hingga menjadi pemburu yang handal, maka ia lebih suka tinggal di padang.<br><br>Sedangkan Ya’qub lebih berperangai lemah lembut. Ia lebih suka tinggal di rumah untuk membantu ibunya memasak. Ya’qub juga suka berkemah di sekitar rumahnya.<br><br>Esau lebih disayang oleh ayahnya karena mereka memiliki kegemaran yang sama, yaitu berburu. Esau juga sering membawa hasil buruannya ke rumah untuk dimasak dan dimakan bersama keluarganya.<br><br>Sedangkan sang ibunda yaitu Ribka lebih menyayangi Ya’qub karena memiliki sifat dan sikap yang mirip dengannya, yaitu pecinta damai dan tenang.<br><br>Ketika usia Esau dan Ya’qub menginjak 15 tahun, kakek mereka yaitu Nabi Ibrahim ‘alaihis salam meninggal dunia. Nabi Ibrahim ‘alaihis salam meninggal dunia pada saat usia Nabi Ishaq ‘alaihis salam 75 tahun. Selanjutnya jasad beliau dikebumikan di Gua Makhpela di wilayah Hebron (tempat yang sama dengan makam Sarah).\n\n<h4>Putra Kembar Nabi Ishaq: Esau dan Ya’qub</h4>\nKetika merasakan bahwa fisiknya mulai melemah yang berpengaruh pula pada kemampuannya melihat, maka Nabi Ishaq ‘alaihis salam mendatangi anak kesayangannya yaitu Esau.<br><br>Ia berpesan kepada anaknya tersebut agar pergi berburu dan memasakkan makanan kesukaan Nabi Ishaq ‘alaihis salam. Hal tersebut bertujuan agar Nabi Ishaq ‘alaihis salam dapat mendoakan keberkahan bagi Esau dan anaknya tersebut dapat meneruskan dakwah yang dilakukan oleh sang ayah.<br><br>Ternyata niatan Nabi Ishaq ‘alaihis salam tersebut didengar oleh Ribka. Ribka pun menginginkan Ya’qub lah yang memperoleh doa keberkahan dari Nabi Ishaq ‘alaihis salam. Ia pun meminta Ya’qub untuk segera menghidangkan makanan kesukaan Nabi Ishaq ‘alaihis salam sebelum Esau tiba di rumah.<br><br>Karena secara fisik Esau dan Ya’qub terlihat berbeda meskipun mereka kembar, maka Ribka memakaikan pakaian Esau ke Ya’qub. Ia juga membalutkan hamparan kulit domba yang berbulu lebat ke leher dan tangan Ya’qub agar benar-benar terlihat mirip dengan Esau. Karena memang Esau memiliki bulu yang lebat di sekujur tubuhnya. Tidak seperti Ya’qub.<br><br>Setelah masakannya matang, Ya’qub yang berdandan menyerupai Esau pun datang menghadap Nabi Ishaq ‘alaihis salam. Lalu berkatalah Nabi Ishaq ‘alaihis salam:<br><br><i>“Kalau suara, suara Ya’qub, kalau tangan, tangan Esau.”</i><br><br>Setelah berkata demikian, Nabi Ishaq tidak menaruh curiga apapun akan keanehan tersebut. Ia tetap memakan dengan lahap makanan yang disajikan oleh Ya’qub. Setelah itu, Nabi Ishaq ‘alaihis salam mendoakan Ya’qub, yang Ia kira adalah Esau, agar Ia selalu diberkahi, dilingkupi dengan kebaikan, dikaruniai nikmat melimpah, diberikan rezeki yang banyak, serta menjadi tuan bagi saudara dan keturunannya.<br><br>Tidak lama setelah Nabi Ishaq selesai berdoa, Esau pun pulang kembali ke rumah. Nabi Ishaq pun kebingungan. Hingga akhirnya diketahui oleh Nabi Ishaq ‘alaihis salam dan Esau bahwasanya Ya’qub telah berpura-berpura menjadi Esau.<br><br>Esau pun sangat marah dan meminta ayahandanya membatalkan doa untuk Ya’qub. Namun doa tersebut tidak dapat ditarik kembali. Akhirnya dalam keadaan penuh emosi Esau bersumpah untuk membunuh Ya’qub apabila kelak sang ayah telah meninggal.<br><br>Mendengar sumpah Esau tersebut, Ribka pun takut dan panik. Ia bergegas menyuruh Ya’qub untuk segera pergi ke daerah Laban, Mesopotamia. Di sana Ya’qub akan tinggal bersama dengan saudara Ribka. Ya’qub sempat berpamitan dengan sang ayah ketika hendak pergi ke Mesopotamia.<br><br>Sang ayah berpesan agar Ya’qub tidak menikahi perempuan Palestina karena pada saat itu mereka adalah golongan yang tidak beriman. Sebagai solusi, Nabi Ishaq menyarankan Ya’qub untuk mencari istri dari keluarga besar Ibrahim di Mesopotamia.<br><br>Nabi Ishaq ‘alaihis salam meninggal dunia pada usia 180 tahun dan dimakamkan di Gua Makhpela bersama keluarga besarnya, yaitu Nabi Ibrahim ‘alaihis salam, Sarah, dan Ribka yang telah pergi terlebih dahulu.<br><br>Selepas kepergian sang ayah, Ya’qub kembali lagi ke Palestina setelah belasan tahun tinggal di Mesopotamia. Ia mengajak serta keluarganya yang terdiri dari dua orang istri, dua selir, dua belas anak lelaki, dan satu orang anak perempuan. Pada saat itu Ya’qub dan Esau telah berdamai kembali dan saling memaafkan.\n\n<h4>Mukjizat Allah Ta’ala kepada Nabi Ishaq</h4>\nSecara etimologi, mukjizat berasal dari bahasa arab yaitu kata “Mukjiz”. Mukjiz artinya “mengalahkan”. Sehingga Mukjizat adalah peristiwa atau luar biasa di luar akal sehat manusia yang terjadi atau dimiliki pada diri Nabi dan Rasul Allah Ta’ala.<br><br>Masing-masing dari Nabi dan Rasul memiliki mukjizatnya sendiri-sendiri sebagai bukti bahwa mereka merupakan orang istimewa pilihan Allah Ta’ala yang menerima tugas untuk menyebarkannya ajaran Allah Ta’ala.<br><br>Sihir dan mukjizat adalah dua hal yang sangat berbeda. Mukjizat hanya dimiliki oleh para Nabi dan Rasul sehingga tidak dapat ditiru oleh manusia biasa. Sedangkan sihir dapat dipelajari oleh manusia biasa.<br><br>Berikut dijelaskan mengenai mukjizat yang dianugerahkan oleh Allah Ta’ala kepada Nabi Ishaq guna membantu beliau dalam menjalankan dakwah di Palestina:<br><br>1) Atas seizin Allah Ta’ala, Nabi Ishaq ‘alaihis salam yang pada saat itu telah berusia sangat tua yakni 100 tahun dapat memiliki keturunan dengan istrinya Ribka yang memiliki kondisi mandul.<br><br>2) Keturunan dari Nabi Ishaq ‘alaihis salam adalah pencetus dari munculnya Kaum Bani Israil. Kaum Bani Israil terlahir dari para keturunan Nabi Ya’qub ‘alaihis salam. Nabi Ya’qub ‘alaihis salam memiliki nama lain Israil dan Ia merupakan keturunan dari Nabi Ishaq ‘alaihis salam. Sehingga dari garis keturunan tersebut lahirlah kaum Bani Israil dimana total telah ada 12 nabi yang diutus oleh Allah Ta’ala kepada kaum Bani Israil tersebut. Salah satu dari 12 nabi tersebut adalah Nabi Isa ‘alaihis salam.",
                "isi_eng": "<h4>A Brief History of the Prophet Ishaq</h4>\nThe name Isaac or Ishak comes from the Hebrew Yi???q which means smiling or laughing. The word Isaac itself was inspired by the mother of Prophet Isaac 'alaihis salam. Where Sarah who was Isaac's mother at that time smiled broadly because she could not believe the good news of the presence of Isaac as her child which was conveyed by the angel Gabriel. <br><br>Prophet Isaac 'alaihis salam was born in the city of Kan'an in 1761 BC. Prophet Isaac 'alaihis salam was the second son of Prophet Ibrahim 'alaihis salam with Sarah after the birth of Prophet Ismail 'alaihis salam. When Prophet Isaac 'alaihis salam was born into the world, the age of Prophet Ibrahim 'alaihis salam was already very old, namely 100 years old. Prophet Isaac 'alaihis salam was born 14 years after Prophet Ismail 'alaihis salam.<br><br>During his life, Prophet Isaac 'alaihis salam had a descendant who was also appointed as a prophet, namely Prophet Jacob 'alaihis salam. Prophet Isaac 'alaihis salam was the ninth prophet who was assigned to preach in the Palestine region replacing his father, Prophet Ibrahim 'alaihis salam who at that time had reached old age. The area of ​​​​Prophet Isaac's preaching was in the Kan'an and Sham regions.\n\n<h4>Guests of the Prophet Ibrahim who reported the news of the birth of the Prophet Ishaq</h4>\nIt is told in the Qur'an, Hud verses 69-73, that once Prophet Ibrahim 'alaihis salam received guests. According to Usman Ibn Muhaisin, the guests numbered four people, namely the angels Gabriel, Mikail, Israfil, and Rafail. <br><br>The guests congratulated Prophet Ibrahim 'alaihis salam. After that, Prophet Ibrahim 'alaihis salam served them roasted calf meat. However, their hands did not touch the food at all. <br><br>Seeing this, Prophet Ibrahim 'alaihis salam felt suspicious and afraid. It turned out that the foreign guests were angels sent by Allah Ta'ala who came to destroy the people of Luth. <br><br>In addition to having a goal for the people of Luth, the guests also aimed to give good news to Prophet Ibrahim 'alaihis salam about the birth of a son named Ishaq. As stated in the Qur'an, Surah Hud verse 71:<br><br><i>\"And his wife stood up and smiled. So we conveyed to him the good news about (the birth of) Ishaq and after Ishaq (will be born) Ya'qub.\" </i> (Q.S. Hud verse 71).<br><br>Knowing the news conveyed, Sarah was very surprised and happy. The reason was that Sarah was already old at that time (she was 90 years old at that time) and was barren. But truly the power of Allah Ta'ala is incomparable and always gives mercy to His faithful servants.<br><br><i>“Thus says your Lord. Indeed, He is the All-Wise, All-Knowing.\"</i> (Q.S. Adz-Dzariyat verse 30).<br><br>Ishaq's birth itself was a blessing and gift for the Prophet Ibrahim 'alaihis salam. Because Prophet Ibrahim 'alaihis salam hoped that when he grew up, Ishaq could be appointed as a prophet, messenger of Allah Ta'ala and help in fighting the idol worshipers in Palestine.\n\n<h4>Prophet Ishaq's Da'wah Journey</h4>\nProphet Ishaq, his father (Prophet Ibrahim 'alaihis salam), and his son (Prophet Ya'qub 'alaihis salam) were people who were blessed and praised by Allah Ta'ala as Allah Ta'ala said in the Al-Qur'an surah Shaad verse 45-47:<br><br><i>\"And remember our servants: Ibrahim, Ishaq, and Ya'qub who have great deeds and great knowledge tall. Indeed, We have purified them by (granting them) high morals, namely always reminding (people) of the land of the afterlife. Indeed, those with Us are truly among the best chosen people.\"</i> (Q.S. Shaad verse 45-47).<br><br>Apart from Allah Ta'ala who gave praise directly to Ibrahim, Ishaq, and Ya'qub through the verses of the Qur'an, the Prophet Muhammad sallallahu alaihi wasallam also praised them through his words:<br><br><i>\"The noble son, the noble son and the noble son is Yusuf son of Ya'qub, son of Ishaq, son of Ibrahim.\"</i> (HR. Al Bukhari and Muslim).<br><br>Prophet Ishaq 'alaihis salam was assigned to continue the preaching of Prophet Ibrahim in the land of Palestine. He called on the people there to worship and acknowledge Allah Ta'ala, perform prayers, pay zakat, and do other virtues in accordance with what Allah Ta'ala commanded.\n\n<h4>Prophet Ishaq's Marriage to an Iraqi Girl</h4>\nWhen his mother had passed away and his father, Prophet Ibrahim 'alaihis salam, was very old, Prophet Isaac 'alaihis salam did not get married. Until finally Prophet Ibrahim 'alaihis salam asked one of his servants to go to Iraq to find a prospective wife from Ibrahim's family for his son. <br><br>The servant then proposed a daughter of Bethuel bin Nahor, namely Ribka (Rifqah, Rafiqah) for Isaac. It is known that Nahor was the biological brother of Prophet Ibrahim 'alaihis salam. So genealogically, Ribka was the daughter of Isaac's cousin. <br><br>Finally, when Prophet Isaac was forty years old, he married Ribka who then followed Prophet Isaac to settle in Palestine.\n\n<h4>The Birth of the Son of Prophet Isaac</h4>\nAfter marrying an Iraqi girl of Abraham's descent named Rebekah, Prophet Ishaq 'alaihis salam found out that Rebekah was infertile like her previous mother. <br><br>However, Prophet Ishaq 'alaihis salam and Rebekah never gave up trying and asked Allah Ta'ala to give them offspring to continue their history of preaching. Prophet Ishaq 'alaihis salam always prayed gently and with full confidence to Allah Ta'ala so that Rebekah could conceive. <br><br>With the greatness and power of Allah Ta'ala, Rebekah was able to get pregnant and Prophet Ishaq 'alaihis salam had children when he reached the age of sixty. Rebekah gave birth to twin boys.<br><br>The first baby boy was named Esau (Aishu). Esau's physical form when he was first born was to have a red body and like a hairy cloak (having lots of hair all over his body). <br><br>While the second baby boy was given the name Ya'qub who when born was in a position holding his brother's heel. Allah Ta'ala also immortalized the story of Ya'qub's birth in the Qur'an, Surah Al-Anbiya' verse 72: <br><br><i>\"And We gave him (Abraham) Isaac and Ya'qub, as a gift (from Us). And each of them We made righteous people. \"</i> (QS. Al-Anbiya' verse 72). <br><br>When they grew up, Esau and Ya'qub had interests that tended to be opposites. Esau preferred to hone his skills in hunting to become a skilled hunter, so he preferred to live in the fields. <br><br>While Ya'qub was more gentle. He preferred to stay at home to help his mother cook. Jacob also liked to camp around his house. <br><br>Esau was more loved by his father because they had the same hobby, which was hunting. Esau also often brought his hunting results home to be cooked and eaten with his family. <br><br>While his mother, Rebekah, loved Jacob more because she had similar characteristics and attitudes to him, namely a lover of peace and calm. <br><br>When Esau and Jacob were 15 years old, their grandfather, Prophet Ibrahim 'alaihis salam, died. Prophet Ibrahim 'alaihis salam died when Prophet Ishaq 'alaihis salam was 75 years old. Furthermore, his body was buried in the Cave of Machpelah in the Hebron area (the same place as Sarah's grave).\n\n<h4>Prophet Isaac's Twin Sons: Esau and Ya'qub</h4>\nWhen he felt that his physical condition was starting to weaken which also affected his ability to see, Prophet Isaac 'alaihis salam came to his beloved son, Esau. <br><br>He told his son to go hunting and cook Prophet Isaac 'alaihis salam's favorite food. This was intended so that Prophet Isaac 'alaihis salam could pray for blessings for Esau and his son could continue the preaching carried out by his father. <br><br>It turned out that Prophet Isaac 'alaihis salam's intention was heard by Rebekah. Rebekah also wanted Jacob to be the one to receive blessings from Prophet Isaac 'alaihis salam. She also asked Jacob to immediately serve Prophet Isaac 'alaihis salam's favorite food before Esau arrived home. <br><br>Because physically Esau and Jacob looked different even though they were twins, Rebekah dressed Esau's clothes on Jacob. He also wrapped a thick sheepskin around Jacob's neck and hands to really look like Esau. Because Esau did have thick hair all over his body. Unlike Jacob.<br><br>After the food was cooked, Jacob who was dressed like Esau came to meet Prophet Isaac 'alaihis salam. Then Prophet Isaac 'alaihis salam said:<br><br><i>\"If the voice, the voice of Jacob, if the hands, the hands of Esau.\"</i><br><br>After saying that, Prophet Isaac did not suspect anything about the strangeness. He continued to eat the food served by Jacob with gusto. After that, Prophet Ishaq 'alaihis salam prayed for Jacob, who he thought was Esau, so that he would always be blessed, be surrounded by goodness, be given abundant blessings, be given abundant sustenance, and be the master of his brothers and descendants. Not long after Prophet Ishaq finished praying, Esau returned home. Prophet Ishaq was confused. Until finally it was discovered by the Prophet Ishaq 'alaihis salam and Esau that Jacob had been pretending to be Esau. <br><br>Esau was very angry and asked his father to cancel the prayer for Ya'qub. However, this prayer cannot be withdrawn. Finally, in a state of emotion, Esau vowed to kill Jacob when his father died. <br><br>Hearing Esau's oath, Rebekah was afraid and panicked. He hurriedly told Ya'qub to immediately go to the Laban area, Mesopotamia. There Ya'qub will live with Rebekah's brother. Jacob had time to say goodbye to his father when he was about to go to Mesopotamia. <br><br>His father advised Jacob not to marry a Palestinian woman because at that time they were a group of non-believers. As a solution, Prophet Isaac advised Jacob to find a wife from Ibrahim's extended family in Mesopotamia. <br><br>Prophet Isaac 'alaihis salam died at the age of 180 and was buried in the Cave of Machpelah with his extended family, namely Prophet Ibrahim 'alaihis salam, Sarah, and Rebekah who had left first. <br><br>After his father's departure, Jacob returned to Palestine after living in Mesopotamia for dozens of years. He brought his family consisting of two wives, two concubines, twelve sons, and one daughter. At that time Jacob and Esau had reconciled and forgiven each other.\n\n<h4>The Miracle of Allah Ta'ala to Prophet Isaac</h4>\nEtymologically, miracles come from the Arabic word \"Mukjiz\". Mukjiz means \"to defeat\". So a miracle is an event or extraordinary beyond human reason that occurs or is possessed by the Prophets and Messengers of Allah Ta'ala. <br><br>Each of the Prophets and Messengers has their own miracles as proof that they are special people chosen by Allah Ta'ala who receive the task of spreading the teachings of Allah Ta'ala. <br><br>Magic and miracles are two very different things. Miracles are only possessed by the Prophets and Messengers so they cannot be imitated by ordinary people. While magic can be learned by ordinary people.<br><br>The following explains the miracles bestowed by Allah Ta'ala to Prophet Isaac to help him in carrying out da'wah in Palestine:<br><br>1) With the permission of Allah Ta'ala, Prophet Isaac 'alaihis salam who at that time was very old, namely 100 years old, was able to have children with his wife Ribka who was infertile.<br><br>2) The descendants of Prophet Isaac 'alaihis salam were the initiators of the emergence of the Bani Israel. The Bani Israel were born from the descendants of Prophet Jacob 'alaihis salam. Prophet Jacob 'alaihis salam had another name, Israel, and he was a descendant of Prophet Isaac 'alaihis salam. So from this lineage, the Bani Israel were born, where in total there were 12 prophets sent by Allah Ta'ala to the Bani Israel. One of the 12 prophets was the Prophet Isa 'alaihis salam."
            },
            {
                "no": 10,
                "name_id": "Nabi Yaqub AS",
                "name_eng": "Prophet Jacob AS",
                "arab": "يعقوب عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yaqub.png",
                "isi": "Di dalam Islam setiap kisah nabi dan rasul selalu dipenuhi dengan ujian atau cobaan yang diberikan oleh Allah. Dengan ujian dan cobaan itu, maka membuktikan bahwa Allah sangat sayang dan cinta kepada hambanya. Adanya cobaan dan ujian dalam kisah nabi dan rasul membuktikan juga bahwa nabi dan rasul dalam Islam selalu penuh dengan kesabaran dalam menjalani kehidupannya.<br><br>Jika berbicara tentang kesabaran yang ada pada nabi rasul sangat banyak dan salah satu nabi yang memiliki kesabaran yang cukup tinggi adalah Nabi Ya’qub A.S. Kisah beliau menggambarkan sosok manusia yang tetap tabah walaupun sudah menghadapi berbagai macam cobaan, salah satunya adalah mendapatkan perlakuan tidak baik dari kakaknya.\n\n<h4>Masa Kecil Nabi Ya’qub</h4>\nNabi Ya’qub A.S adalah seorang anak dari ayah bernama Nabi Ishak A.S dan Ibu bernama Rafiqah serta beliau merupakan cucu dari Nabi Ibrahim A.S. Nabi Ya’qub A.S memiliki saudara kembar yang bernama Ish. Oleh sebab itu orang tua dari Nabi Ya’qub A.S sangat berharap agar anak kembarnya bisa mengikuti jejak kakeknya, Nabi Ibrahin A.S.<br><br>Supaya bisa bisa mengamalkan perbuatan kebaikan dan dapat menyebarkannya seperti kakeknya, maka Nabi Ishak A.S mulai memberikan pelajaran agama serta memberikan nasihat-nasihat kepada kedua putra kembarnya. Beliau akan selalu mengusahakan dirinya untuk memberikan pelajaran agama dan nasihat kepada kedua putranya dalam kondisi apapun. Hal-hal yang selalu diajarakan adalah hal-hal yang dapat membuat kehidupan menjadi lebih tenang dan damai, sehingga harus menjauhi sifat iri, dengki, maksiat, dan permusuhan. Hal ini beliau lakukan supaya kedua putranya selalu beriman kepada Allah dan menjadi hamba yang selalu bertawakal kepada-Nya.<br><br>Namun, harapan dari Nabi Ishak A.S untuk memiliki anak-anak yang taat untuk menjalankan perintah Allah ternyata tidak sesuai karena putranya yang bernama Ish memiliki sifat yang tidak mengamalkan kebaikan, seperti iri, dengki, sombong, dan senang sekali pamer. Akan tetapi, putra Nabi Ishak A.S yang bernama Ya’qub memiliki sifat yang sangat berbeda dengan saudara kembarnya itu, sifat-sifat yang dimiliki Ya’qub sangat mencerminkan kebaikan, seperti tidak sombong, tidak bermaksiat, dan sangat lemah lembut.<br><br>Perbedaan sifat yang saling bertolak belakang itu membuat mereka saling bertengkar ketika beranjak ke usia remaja. Ya’qub ini memiliki sifat mengalah dan kakaknya, Ish selalu merasa paling benar serta tidak mau mengalah kepada adiknya walaupun sedang dalam keadaan bersalah. Ya’qub pun tak pernah melawan kakaknya dan ia tetap sabar serta selalu mendoakan kakanya agar kembali ke jalan yang baik dan benar di kemudian hari.<br><br>Nabi Ishak A.S berpesan kepada kedua putranya, “wahai, anakku. Kalian harus tetap beriman dan takwa kepada Allah serta selalu menjalankan perintah-Nya dan menjauhi larangan-Nya. Kita sebagai hamba Allah harus selalu melakukan perbuatan baik kepada sesama manusia serta harus membantu fakir miskin. Hal itu harus dilakukan karena dianjurkan oleh Allah.”<br><br>Ya’qub menjawab nasihat itu dengan sopan, tetapi kakaknya, Ish tidak mengeluarkan ucapan sedikitpun setelah mendengarkan nasihat dari ayahnya. Nabi Ishak A.S yang melihat respon dari putranya, Ish hanya bisa tersenyum saja. Melihat sifat dan perilaku kedua putranya, Nabi Ishak A.S dan istrinya mulai berpikir bahwa yang lebih pas untuk mewariskan ajaran agama Allah adalah Ya’qub. Hal ini dikarenakan Ya’qub mempunyai sifat-sifat yang sudah mencerminkan seseorang yang saleh dan setiap perbuatannya selalu terpuji. Sifat saleh dan perbuatan terpuji ini tak pernah dimiliki oleh Ish.<br><br>Semakin beranjak dewasa, pertengkaran antara Ish dan Ya’qub semakin sering terjadi, kakak dari Ya’qub selalu mengejek adiknya dan sudah berkali-kali adiknya tidak membalas ejekan itu dan selalu sabar ketika sedang diejek. Hingga pada suatu waktu, Ya;qub mulai merasa resah dan bilang kepada Nabi Ishak A.S bahwa kakanya sudah mengejeknya.<br><br>Mendengar cerita dari Ya’qub, Ish mulai diberikan nasihat oleh Nabi Ishak A.S. Setelah melihat kebiasaan buruk Ish yang tak kunjung berubah, Nabi Ishak A.S dan istrinya berencana untuk segera menikahkan Ish. Dengan menikah, diharapkan sifat dan perilaku Ish dapat berubah ke arah yang lebih baik. Ish pun menikah dengan perempuan yang dipercaya oleh dirinya.<br><br>Namun, sifat dan perilaku Ish kepada Ya’qub tetap sama dan tidak berubah walaupun sudah hidup berumah tangga. Ya’qub yang menrima ejekan, hinaan, dan ancaman dari kakanya, mulai menceritakan hal ini kepada ayahnya. Nabi Ishak A.S. Sang ayah yang mendengar cerita dari Ya’qub mulai memohon kepada Allah dan berdoa, “Semoga engkau bisa mewarisi sifat kenabian yang kumiliki, anakku dan aku berdoa semoga engkau kelak akan menurunkan beberapa nabi dan raja dari garis keterunanmu, anakku.”\n\n<h4>Perjalanan Menuju Irak</h4>\nMeskipun sudah diberi nasihat berkali-kali, Ish tetap tidak menyukai Ya’qub dan selalu mengejek dan menganiaya Ya’qub. Melihat peristiwa itu terus berlangsung, Nabi Ishak A.S berkeinginan untuk menitipkan Ya’qub kepada saudara istrinya dengan tujuan agar Ish tidak bisa mengganggu, mengejek, dan menganiaya adiknya, Ya’qub. Nabi Ishak A.S mulai menceritakan idenya ini kepada istrinya bahwa Ya’qub akan dititipkan kepada Syekh Labban yang merupakan saudara dari istrinya. Tempat tinggal dari Syekh Labban ada di Faddan A’ram (Irak).<br><br>Ya’qub adalah seorang anak yang taat kepada kedua orang tua. Ya’qub yang mendengar saran ini pun mengikuti arahan dari Nabi Ishak A.S. Meskipun pindah ke Irak, tetapi orang tua dari Ya’qub selalu berpesan, “semoga di sana kamu bisa belajar ilmu agama pada pamanmu.” Selain itu, Nabi Ishak A.S berpesan bahwa harus berhati-hati ketika menyusuri dari jalan menuju Irak.<br><br>Setelah selesai shalat Subuh, Ya’qub mulai bergegas menuju Irak untuk tinggal di rumah paman Syekh Labban, ia membawa bekal dan pakaian tidak begitu banyak serta diletakkan di dalam kantung. Orang tua dari Ya’qub pun mengantarkan anaknya sampai pintu depan rumah. Ketika berpamitan, Ya’qub diamanatkan oleh ayahnya agar memberikan surat kepada Syekh Labban.<br><br>Perjalanan yang dilalui Ya’qub ini merupakan gurun pasir dan sahara yang sangat luas, sehingga beberapa kali Ya’qub perlu mengistirahatkan dirinya agar tidak terlalu lelah. Perjalanan menuju ke Irak juga dilakukan pada malam hari sedangkan pada siang hari digunakan untuk beristirahat. Ketika beristirahat dan merasa perlu mengisi energi, maka Ya’qub mulai membuka perbekalannya dan memakannya.<br><br>Ya’qub yang percaya bahwa bisa sampai ke Faddan A’ram (Irak). Berkat rasa percaya itulah muncul rasa sabar dan tabah bahwa perjalanan melewati gurun pasir dan sahara yang luas merupakan ujian pertama yang diberikan oleh Allah. Ya’qub yang mulai merasakan kalau dirinya sangat lelah, mulai mencari tempat yang nyaman untuk beristirahat dan agar bisa tertidur pulas.<br><br>Ketika tidur karena sangat lelah, Ya’qub bermimpi bahwa kehidupan di masa depan penuh dengan rezeki dan kehidupannya penuh dengan kedamaian, mulai dari keluarga hingga anak cucu dan mampu mendirikan kerajaan yang cukup besar yang sejahtera.<br><br>Setelah bangun dari tidur dan mimpinya, Ya’qub bersiap-siap untuk melanjutkan perjalanannya Faddan A’ram (Irak). Di tengah perjalanan itu, beliau terus-terusan berpikir arti dan makna dari mimpinya tadi.<br><br>Selang beberapa lama berpikir tentang arti dan makna dari mimpi itu terdengar suara yang muncul di kedua telinganya, “wahai putra Ishak. Janganlah engkau merasa takut dan kaget. Aku adalah malaikat Jibril yang sudah diutus oleh Allah S.W.T untuk menyampaikan wahyu kepadamu, Ya’qub. Wahai Ya’qub, ketahuilah! Mulai saat ini Allah S.W.T sudah mengangkat dirimu sebagai seorang nabi dan rasul. Sebarkanlah setiap kebenaran kepada seluruh umat manusia supaya menyembah dan bertakwa kepada Tuhan Yang Maha Esa, dan Allah akan mewariskan Baitul Maqdis, kehidupan bahagia, dan kerajaan yang sangat besar untuk dirimu dan keturunanmu.”<br><br>Rasa lelah yang ada pada diri Nabi Ya’qub A.S mulai menghilang setelah bermimpi memiliki kehidupan yang tentram dan damai dan menerima wahyu dari Allah. Tak hanya rasa lelah yang hilang, tetapi Nabi Ya’qub A.S seperti mendapatkan energi baru untuk melanjutkan perjalanan ke Fadda A’ram (Irak). Tenaga yang seperti penuh kembali membuat Nabi Ya’qub A.S berjalan dengan cepat agar sampai ke tempat tujuan segera mungkin.\n\n<h4>Sampai di Rumah Syekh Labban</h4>\nSetelah melakukan perjalanan selama beberapa hari, akhirnya Nabi Ya’qub A.S sampai di depan pintu gerbang Faddan A’ram (Irak) dan beliau sangat senang karena perjalanannya tidak menjadi sia-sia. Selain itu, ketika melihat kesibukan yang dilakukan oleh masyarakat di Irak, Nabi Ya’qub A.S sangat merasa senang.<br><br>Ketika menuju ke rumah pamannya, Nabi Ya’qub A.S diantar oleh putri pamannya yang bernama Rahil dan setelah sampai di rumah pamannya, surat dari Nabi Ishak A.S segera diberikan kepada pamannya, Syekh Labban. Surat itu berisi tentang keinginan Nabi Ishak A.S untuk menjodohkan anaknya dengan salah satu putri dari Syekh Labban.<br><br>Namun, Syekh Labban memberikan syarat jika Nabi Ya’qub A.S ingin menikahi salah satu putrinya. Syekh Labban menyampaikan syaratnya berupa harus menjadi penggembala kambing selama tujuh tahun dan hal itu menjadi mas kawin untuk pernikahannya nanti. Ketika ditanya, putri yang ingin dinikahinya, Nabi Ya’qub A.S menjawab bahwa ia ingin menikahi Rahil. Namun, Syekh Labban menjelaskan bahwa hal itu tidak bisa terjadi apabila kamu (Nabi Ya’qub A.S) tidak menikahinya kakaknya, Laya terlebih dahulu.<br><br>Pada saat itu, hukum adat melarang jika adik melangkahi kakak perempuannya untuk menikah lebih dulu.<br><br>Setelah mendengar pernyataan dari Syekh Labban, Nabi Ya’qub A.S pun menyetujui semua persyaratan yang telah diberikan oleh ayah dari Laya dan Rahil. Nabi Ya’qub A.S berdoa kepada Allah untuk memohon agar keinginan ayah dan ibunya untuk menikah putri Syekh Labban dapat terpenuhi. “Ya Allah Yang Maha Agung, aku mohon kabulkan keinginan ayah dan ibu hamba. Berikanlah aku kekuatan semala menjalani ujian dan kuatkan iman hamba. Sesungguhnya hanya kepada Engkaulah kami meminta pertolongan dan Engkau Maha Mengetahui hal-hal gaib.”<br><br>Setelah melewati ujian menggembala kambing selama tujuh tahun, Nabi Ya’qub A.S menikahi putri dari Syekh Labban, Laya. Pernikahan putranya dengan putri dari Syekh Labban terdengar oleh Nabi Ishak A.S dan istrinya dan mereka yang mendengar kabar itu merasa bahagia.<br><br>Setelah berhasil melewati ujian pertama, yaitu menikahi Laya. Nabi Ya’qub A.S mulai mempersiapkan dirinya untuk melewati ujian kedua yaitu menggembala kambing dan menikahi Rahil yang merupakan putri kedua dari Syekh Labban. Ujian kedua pun berhasil dilewati oleh Nabi Ya’qub A.S.\n\n<h4>Nabi Ya’qub A.S Memiliki 4 Orang Istri</h4>\nKedua putri dari Syekh Labban sangat bahagia setelah menikah dengan Nabi Ya’qub A.S dan mereka berdua saling bercerita tentang kebaikan sang suami ketika sang suami tidak berada di rumah. Mereka berdua yang sudah merasakan kebaikan dari Nabi Ya’qub A.S ini sangat ingin untuk membalaskan kebaikan sang suami. Namun, mereka belum tahu hadiah apa yang cocok untuk membalaskan kebaikannya itu.<br><br>Setelah berpikir cukup panjang, Rahil pun ingat bahwa mereka memiliki dua orang pembantu yang memiliki wajah yang cantik. Dua pembantu itu bernama Balhah dan Zulfah. Laya dan Rahil akhirnya sepakat untuk menikahkan Nabi Ya’qub A.S dengan kedua pembantu itu. Setelah mereka sepakat dengan keputusan itu, kemudian menyampaikannya kepada ayahnya, Syekh Labban. Mendengar keinginan mereka berdua untuk menikahkan Nabi Ya’qub A.S dengan kedua pembantu putrinya membuat beliau terkejut.<br><br>Setelah mendapatkan persetujuan dari Laya, Rahil, dan Syekh Labban, Nabi Ya’qub A.S menikah dengan kedua pembantunya. Setelah pernikahan itu berhasil, Laya dan Rahil merasa sangat bahagia karena bisa memberikan hadiah kepada suami tercintanya.<br><br>Dari keempat istri tercintanya, Nabi Ya’qub A.S memiliki 12 orang anak. Istri pertama, Laya dikaruniai enam orang anak, yaitu Syam’un, Rawbin, Lewi, Yahuda, Yazakir, dan Zabulan. Istri kedua, Rahil dikaruniai dua orang anak, yaitu Benyamin dan Yusuf. Istri ketiga, Zulfa dikaruniai dua orang anak, yaitu Kan dan Asyar. Istri keempat dikaruniai dua orang anak, yaitu Daan dan Naftali.",
                "isi_eng": "In Islam, every story of a prophet and apostle is always filled with tests or trials given by Allah. With these tests and trials, it proves that Allah is very affectionate and loves his servants. The existence of trials and tests in the stories of prophets and apostles also proves that prophets and apostles in Islam are always full of patience in living their lives.<br><br>If we talk about patience, there are many prophets and one of the prophets who had quite high patience was Prophet Ya'qub AS. His story describes a human figure who remained steadfast even though he had faced various trials, one of which was getting bad treatment from his brother.\n\n<h4>The Childhood of the Prophet Ya'qub</h4>\nProphet Ya'qub AS was a son of a father named Prophet Ishak AS and a mother named Rafiqah and he was the grandson of Prophet Ibrahim AS. Prophet Ya'qub AS had a twin brother named Ish. Therefore, the parents of Prophet Ya'qub AS really hoped that their twins could follow in the footsteps of their grandfather, Prophet Ibrahim AS.<br><br>In order to be able to practice good deeds and be able to spread them like his grandfather, Prophet Ishak AS began to provide religious lessons and advice to his two twin sons. He would always try to provide religious lessons and advice to his two sons in any condition. The things that are always taught are things that can make life more calm and peaceful, so that one must avoid envy, jealousy, sin, and hostility. He did this so that his two sons would always believe in Allah and become servants who always put their trust in Him. <br><br>However, the hope of Prophet Isaac AS to have children who were obedient to carry out Allah's commands turned out to be untrue because his son named Ish had a nature that did not practice goodness, such as being jealous, envious, arrogant, and very fond of showing off. However, the son of Prophet Isaac AS named Ya'qub had a very different nature from his twin brother, the nature possessed by Ya'qub very much reflected goodness, such as not being arrogant, not committing sins, and being very gentle. <br><br>The differences in nature that were opposite to each other made them fight each other when they became teenagers. Ya'qub had a nature of giving in and his older brother, Ish always felt he was the most right and did not want to give in to his younger brother even though he was in a state of guilt. Jacob never fought his brother and he remained patient and always prayed for his brother to return to the good and right path in the future. <br><br>Prophet Isaac AS advised his two sons, \"O my sons. You must remain faithful and devoted to Allah and always carry out His commands and avoid His prohibitions. We as servants of Allah must always do good deeds to fellow human beings and must help the poor. This must be done because it is recommended by Allah.\" <br><br>Jacob answered the advice politely, but his brother, Ish did not say a word after listening to his father's advice. Prophet Isaac AS who saw the response from his son, Ish could only smile. Seeing the nature and behavior of his two sons, Prophet Isaac AS and his wife began to think that the one who was more appropriate to pass on the teachings of Allah's religion was Jacob. This is because Jacob has characteristics that reflect a pious person and every action he does is always commendable. This pious nature and commendable deeds were never possessed by Ish. <br><br>As he grew older, the quarrels between Ish and Ya'qub became more frequent, Ya'qub's older brother always teased his younger brother and many times his younger brother did not return the taunts and was always patient when being teased. Until one time, Ya'qub began to feel restless and told Prophet Isaac AS that his older brother had teased him. <br><br>Hearing the story from Ya'qub, Ish began to be given advice by Prophet Isaac AS. After seeing Ish's bad habits that never changed, Prophet Isaac AS and his wife planned to marry Ish immediately. By getting married, it was hoped that Ish's nature and behavior could change for the better. Ish married a woman he trusted. <br><br>However, Ish's nature and behavior towards Ya'qub remained the same and did not change even though they were married. Ya'qub who received taunts, insults, and threats from his older brother, began to tell his father about this. Prophet Isaac A.S. The father, who heard the story from Ya'qub, began to ask Allah and pray, \"Hopefully you can inherit the prophetic qualities that I have, my son and I pray that in the future you will inherit several prophets and kings from your lineage, my son.\"\n\n<h4>Journey to Iraq</h4>\nDespite being given advice many times, Ish still did not like Ya'qub and always mocked and abused Ya'qub. Seeing the incident continue to take place, Prophet Isaac AS wanted to entrust Ya'qub to his wife's brother so that Ish could not disturb, mock, and abuse his younger brother, Ya'qub. Prophet Isaac AS began to tell his wife about his idea that Ya'qub would be entrusted to Sheikh Labban who was his wife's brother. Sheikh Labban's residence was in Faddan A'ram (Iraq).<br><br>Ya'qub was a child who was obedient to both parents. Ya'qub who heard this advice followed the direction of Prophet Isaac AS. Even though he moved to Iraq, Ya'qub's parents always advised him, \"Hopefully there you can learn religious knowledge from your uncle.\" In addition, Prophet Isaac AS advised that one must be careful when walking along the road to Iraq. <br><br>After finishing the Subuh prayer, Ya'qub began to rush to Iraq to stay at the house of Sheikh Labban's uncle, he brought provisions and clothes that were not too much and put them in a bag. Ya'qub's parents also accompanied their son to the front door of the house. When saying goodbye, Ya'qub was instructed by his father to give a letter to Sheikh Labban. <br><br>The journey that Ya'qub went through was a very wide desert and Sahara, so that several times Ya'qub needed to rest himself so as not to be too tired. The journey to Iraq was also done at night while during the day it was used to rest. When resting and feeling the need to recharge, Ya'qub began to open his provisions and eat them. <br><br>Ya'qub who believed that he could reach Faddan A'ram (Iraq). Thanks to that sense of trust, a sense of patience and steadfastness emerged that the journey through the vast desert and Sahara was the first test given by Allah. Jacob, who began to feel very tired, began to look for a comfortable place to rest and so that he could sleep soundly. <br><br>While sleeping because he was very tired, Jacob dreamed that his future life would be full of sustenance and his life would be full of peace, starting from his family to his grandchildren and being able to establish a fairly large and prosperous kingdom. <br><br>After waking up from his sleep and dream, Jacob prepared to continue his journey to Faddan A'ram (Iraq). In the middle of the journey, he continued to think about the meaning of his dream. <br><br>After thinking for a while about the meaning of the dream, a voice sounded in his ears, \"O son of Isaac. Do not be afraid and surprised. I am the angel Gabriel who has been sent by Allah SWT to convey revelation to you, Jacob. O Jacob, know! From now on Allah SWT has appointed you as a prophet and apostle. Spread every truth to all mankind so that they worship and fear Almighty God, and Allah will bequeath Baitul Maqdis, a happy life, and a very large kingdom for you and your descendants.\"<br><br>The feeling of tiredness that existed in Prophet Ya'qub AS began to disappear after dreaming of having a peaceful and peaceful life and receiving revelations from Allah. Not only did the tiredness disappear, but Prophet Ya'qub AS seemed to have gained new energy to continue his journey to Fadda A'ram (Iraq). His energy seemed to be full again, making Prophet Ya'qub AS walk quickly in order to reach his destination as soon as possible.\n\n<h4>Arrived at Sheikh Labban's House</h4>\nAfter traveling for several days, finally Prophet Ya'qub AS arrived at the gate of Faddan A'ram (Iraq) and he was very happy because his journey was not in vain. In addition, when he saw the busyness of the people in Iraq, Prophet Ya'qub AS was very happy.<br><br>When heading to his uncle's house, Prophet Ya'qub AS was accompanied by his uncle's daughter named Rahil and after arriving at his uncle's house, a letter from Prophet Isaac AS was immediately given to his uncle, Sheikh Labban. The letter contained the desire of Prophet Isaac AS to match his son with one of Sheikh Labban's daughters.<br><br>However, Sheikh Labban gave a condition if Prophet Ya'qub AS wanted to marry one of his daughters. Sheikh Labban conveyed the condition that he had to be a goat herder for seven years and that would be the dowry for his future marriage. When asked which daughter he wanted to marry, Prophet Ya'qub AS answered that he wanted to marry Rahil. However, Sheikh Labban explained that it could not happen if you (Prophet Ya'qub AS) did not marry her sister, Laya first. <br><br>At that time, customary law prohibited a younger sibling from stepping over her older sister to marry first. <br><br>After hearing the statement from Sheikh Labban, Prophet Ya'qub AS agreed to all the conditions given by Laya and Rahil's father. Prophet Ya'qub AS prayed to Allah to ask that his father and mother's wishes to marry Sheikh Labban's daughter be fulfilled. \"O Allah the Almighty, I beg you to grant the wishes of my father and mother. Give me strength during the test and strengthen my faith. Indeed, only to You do we ask for help and You are All-Knowing of the unseen.\" <br><br>After passing the test of herding goats for seven years, Prophet Ya'qub AS married Sheikh Labban's daughter, Laya. The marriage of his son with the daughter of Sheikh Labban was heard by Prophet Isaac AS and his wife and those who heard the news were happy.<br><br>After successfully passing the first test, which was marrying Laya. Prophet Ya'qub AS began to prepare himself to pass the second test, which was herding goats and marrying Rahil who was the second daughter of Sheikh Labban. The second test was also successfully passed by Prophet Ya'qub AS.\n\n<h4>Prophet Ya'qub A.S. Had 4 Wives</h4>\nThe two daughters of Sheikh Labban were very happy after marrying Prophet Ya'qub AS and they both told each other about their husband's kindness when he was not at home. The two of them who had felt the kindness of Prophet Ya'qub AS really wanted to repay their husband's kindness. However, they did not know what gift was suitable to repay his kindness. <br><br>After thinking for a long time, Rahil remembered that they had two maids who had beautiful faces. The two maids were named Balhah and Zulfah. Laya and Rahil finally agreed to marry Prophet Ya'qub AS to the two maids. After they agreed with the decision, they then conveyed it to their father, Sheikh Labban. Hearing their desire to marry Prophet Ya'qub AS to his two daughters' maids surprised him. <br><br>After getting approval from Laya, Rahil, and Sheikh Labban, Prophet Ya'qub AS married his two maids. After the marriage was successful, Laya and Rahil felt very happy because they could give gifts to their beloved husbands.<br><br>From his four beloved wives, Prophet Ya'qub AS had 12 children. The first wife, Laya was blessed with six children, namely Syam'un, Rawbin, Lewi, Yahuda, Yazakir, and Zabulan. The second wife, Rahil was blessed with two children, namely Benyamin and Yusuf. The third wife, Zulfa was blessed with two children, namely Kan and Asyar. The fourth wife was blessed with two children, namely Daan and Naftali."
            },
            {
                "no": 11,
                "name_id": "Nabi Yusuf AS",
                "name_eng": "Prophet Joseph AS",
                "arab": "يوسف عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yusuf.png",
                "isi": "<h4>Kisah Lengkap Nabi Yusuf AS</h4>\n\n<h4>Kelahiran dan Nasab Nabi Yusuf</h4>\n<p>Nabi Yusuf ‘alaihissalām adalah putra Nabi Ya‘qub ‘alaihissalām yang bergelar Israel. Beliau adalah cucu Nabi Ishaq dan cicit Nabi Ibrahim ‘alaihissalām. Nabi Yusuf berasal dari keluarga para nabi yang dimuliakan Allah dan lahir di wilayah Kan‘an (Palestina).</p>\n<p>Sejak kecil, Nabi Yusuf telah menampakkan keistimewaan. Ia dikenal memiliki akhlak yang lembut, hati yang bersih, kecerdasan yang tinggi, serta wajah yang sangat tampan. Allah telah memilih dan menyiapkan Nabi Yusuf untuk memikul tugas kenabian sejak usia dini.</p>\n\n<h4>Mimpi Nabi Yusuf dan Awal Ujian Hidup</h4>\n<p>Ketika masih kecil, Nabi Yusuf bermimpi melihat sebelas bintang, matahari, dan bulan bersujud kepadanya. Mimpi ini sangat membekas di hatinya sehingga ia menceritakannya kepada ayahnya.</p>\n<p><i>“Wahai ayahku, sesungguhnya aku bermimpi melihat sebelas bintang, matahari dan bulan; kulihat semuanya bersujud kepadaku.”</i><br>(QS. Yusuf: 4)</p>\n<p>Nabi Ya‘qub memahami bahwa mimpi tersebut bukan mimpi biasa, melainkan pertanda bahwa Yusuf akan memperoleh kedudukan yang mulia dan kenabian. Ia pun menasihati Yusuf agar tidak menceritakan mimpi itu kepada saudara-saudaranya karena khawatir timbul rasa dengki dan permusuhan.</p>\n\n<h4>Kedengkian Saudara-Saudara Nabi Yusuf</h4>\n<p>Saudara-saudara Nabi Yusuf merasa iri dan cemburu karena ayah mereka lebih menyayangi Yusuf dan adiknya, Bunyamin. Kedengkian itu perlahan berubah menjadi kebencian yang mendalam.</p>\n<p>Mereka bermusyawarah untuk menyingkirkan Nabi Yusuf agar perhatian ayah mereka hanya tertuju kepada mereka.</p>\n<p><i>“Bunuhlah Yusuf atau buanglah dia ke suatu negeri.”</i><br>(QS. Yusuf: 9)</p>\n<p>Akhirnya mereka membawa Nabi Yusuf pergi dan melemparkannya ke dalam sumur di tempat yang jauh. Setelah itu, mereka kembali kepada ayahnya dengan membawa baju Yusuf yang dilumuri darah palsu, mengaku bahwa Yusuf telah dimakan serigala. Nabi Ya‘qub tidak mempercayai sepenuhnya cerita itu, namun beliau bersabar dan menyerahkan urusannya kepada Allah.</p>\n\n<h4>Diselamatkan dan Dijual sebagai Budak</h4>\n<p>Allah tidak membiarkan Nabi Yusuf binasa di dalam sumur. Ia diselamatkan oleh kafilah dagang yang sedang melintas dan kemudian dijual sebagai budak dengan harga yang murah.</p>\n<p>Allah menakdirkan Nabi Yusuf dibeli oleh seorang pejabat Mesir yang dikenal sebagai Al-‘Aziz.</p>\n<p><i>“Dan orang Mesir yang membelinya berkata kepada istrinya: ‘Berikanlah kepadanya tempat yang baik.’”</i><br>(QS. Yusuf: 21)</p>\n<p>Di rumah tersebut, Nabi Yusuf tumbuh dewasa. Allah menganugerahinya ilmu, hikmah, dan akhlak yang luhur.</p>\n\n<h4>Ujian Godaan dan Fitnah</h4>\n<p>Ketika Nabi Yusuf telah dewasa, istri Al-‘Aziz tergoda oleh ketampanannya dan berusaha mengajaknya berbuat maksiat. Nabi Yusuf menolak dengan tegas dan memilih berlindung kepada Allah.</p>\n<p><i>“Aku berlindung kepada Allah.”</i><br>(QS. Yusuf: 23)</p>\n<p>Walaupun Nabi Yusuf tidak bersalah, ia difitnah dan akhirnya dipenjara demi menjaga nama baik keluarga pejabat tersebut. Nabi Yusuf lebih memilih penjara daripada bermaksiat kepada Allah.</p>\n\n<h4>Kehidupan Nabi Yusuf di Penjara</h4>\n<p>Di dalam penjara, Nabi Yusuf tetap menunjukkan akhlak yang mulia. Ia membantu sesama tahanan dan berdakwah kepada tauhid. Allah memberinya kemampuan menafsirkan mimpi.</p>\n<p>Nabi Yusuf menafsirkan mimpi dua orang tahanan dengan tepat dan mengajak mereka untuk menyembah Allah Yang Maha Esa.</p>\n\n<h4>Tafsir Mimpi Raja Mesir</h4>\n<p>Raja Mesir bermimpi melihat tujuh sapi gemuk dimakan oleh tujuh sapi kurus serta tujuh bulir gandum hijau dan tujuh bulir gandum kering. Tidak ada seorang pun yang mampu menafsirkan mimpi tersebut.</p>\n<p>Akhirnya Nabi Yusuf dipanggil untuk menafsirkannya. Ia menjelaskan bahwa Mesir akan mengalami tujuh tahun masa subur, kemudian tujuh tahun masa paceklik, serta memberikan solusi pengelolaan hasil panen.</p>\n<p>Tafsir Nabi Yusuf terbukti benar. Raja pun membebaskannya dan membersihkan namanya dari segala tuduhan.</p>\n\n<h4>Nabi Yusuf Menjadi Penguasa Mesir</h4>\n<p>Nabi Yusuf diangkat menjadi pejabat tinggi yang mengelola perbendaharaan Mesir. Ia memimpin dengan penuh keadilan, kejujuran, dan kebijaksanaan.</p>\n<p><i>“Sesungguhnya engkau hari ini berkedudukan tinggi lagi dipercaya.”</i><br>(QS. Yusuf: 54)</p>\n<p>Di masa paceklik, rakyat dari berbagai negeri datang ke Mesir untuk membeli makanan, termasuk saudara-saudara Nabi Yusuf.</p>\n\n<h4>Pertemuan Kembali dengan Keluarga</h4>\n<p>Setelah melalui rangkaian peristiwa, Nabi Yusuf akhirnya memperkenalkan dirinya kepada saudara-saudaranya. Ia tidak membalas kejahatan mereka, melainkan memaafkan dengan lapang dada.</p>\n<p><i>“Pada hari ini tidak ada cercaan terhadap kalian.”</i><br>(QS. Yusuf: 92)</p>\n<p>Nabi Yusuf kemudian mempertemukan kembali ayahnya, Nabi Ya‘qub, serta seluruh keluarganya. Mimpi masa kecil Nabi Yusuf pun terwujud.</p>\n<p><i>“Wahai ayahku, inilah ta’bir mimpiku dahulu.”</i><br>(QS. Yusuf: 100)</p>\n\n<h4>Akhir Kehidupan dan Wafat Nabi Yusuf</h4>\n<p>Setelah menjalani kehidupan yang penuh ujian dan kemuliaan, Nabi Yusuf wafat di Mesir dalam keadaan beriman dan bertakwa.</p>\n<p>Doa beliau yang terkenal menggambarkan akhir hidupnya:</p>\n<p><i>“Wafatkanlah aku dalam keadaan muslim dan gabungkanlah aku dengan orang-orang saleh.”</i><br>(QS. Yusuf: 101)</p>\n\n<h4>11. Pelajaran dari Kisah Nabi Yusuf</h4>\n<p>Kisah Nabi Yusuf mengajarkan kesabaran dalam menghadapi ujian, pentingnya menjaga kesucian diri, keindahan memaafkan, keyakinan bahwa rencana Allah selalu terbaik, dan bahwa kemuliaan akan datang setelah kesulitan.</p>",
                "isi_eng": ""
            },
            {
                "no": 12,
                "name_id": "Nabi Syu'aib AS",
                "name_eng": "Prophet Syu'aib AS",
                "arab": "صعيب عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/syuaib.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 13,
                "name_id": "Nabi Ayyub AS",
                "name_eng": "Prophet Ayyub AS",
                "arab": "أيوب عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ayyub.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 14,
                "name_id": "Nabi Dzulkifli AS",
                "name_eng": "Prophet Dzulkifli AS",
                "arab": "ذول الكفل عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/dzulkifli.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 15,
                "name_id": "Nabi Musa AS",
                "name_eng": "Prophet Moses AS",
                "arab": "موسى عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/musa.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 16,
                "name_id": "Nabi Harun AS",
                "name_eng": "Prophet Aaron AS",
                "arab": "هارون عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/harun.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 17,
                "name_id": "Nabi Daud AS",
                "name_eng": "Prophet David AS",
                "arab": "داود عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/daud.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 18,
                "name_id": "Nabi Sulaiman AS",
                "name_eng": "Prophet Solomon AS",
                "arab": "سليمان عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/sulaiman.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 19,
                "name_id": "Nabi Ilyas AS",
                "name_eng": "Prophet Elias AS",
                "arab": "الياس عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ilyas.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 20,
                "name_id": "Nabi Ilyasa' AS",
                "name_eng": "Prophet Elisha AS",
                "arab": "إليسا عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ilyasa.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 21,
                "name_id": "Nabi Yunus AS",
                "name_eng": "Prophet Jonah AS",
                "arab": "يونس عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yunus.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 22,
                "name_id": "Nabi Zakariya AS",
                "name_eng": "Prophet Zachariah AS",
                "arab": "زكريا عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/zakaria.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 23,
                "name_id": "Nabi Yahya AS",
                "name_eng": "Prophet Yahya AS",
                "arab": "يحيى عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yahya.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 24,
                "name_id": "Nabi Isa AS",
                "name_eng": "Prophet Isa(Jesus) AS",
                "arab": "عيسى عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/isa.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 25,
                "name_id": "Nabi Muhammad ﷺ",
                "name_eng": "Prophet Muhammad ﷺ",
                "arab": "محمد ﷺ",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Rasulullah.png",
                "isi": "",
                "isi_eng": ""
            }
		],
        "lain": [
            {
                "no": 1,
                "judul": "",
                "judul_eng": "",
                "gambar": "",
                "isi": "",
                "isi_eng": ""
            }
        ]
	}
}
