{
    "kisah": {
        "nabi": [
            {
                "no": 1,
                "name_id": "Nabi Adam AS",
			    "name_eng": "Prophet Adam AS",
			    "arab": "آدم عَلَیهِ‌ السَّلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Nabi-Adam.png",
                "isi": "Kisah Nabi Adam menceritakan terciptanya manusia pertama yang kelak akan menghuni bumi. Nabi Adam tercipta dari tanah dan Allah memuliakannya dengan memberi pengetahuan tentang semesta. Adam diberi banyak pengetahuan yang akan menjadi Mukjizatnya.<br><br>Wujud Nabi Adam diciptakan sempurna serta lengkap. Tapi Nabi Adam memiliki tinggi tubuh yang berbeda dengan manusia saat ini. Tinggi badannya mencapai 60 hasta atau sekitar 18 meter. Sangat tinggi dibanding kondisi tubuh manusia pada umumnya. Jadi bisa menjelaskan juga kenapa Kabah sangat tinggi dan besar pintu masuknya. Para nabi setelah Nabi Adam juga pasti memiliki postur tubuh yang hampir mirip.<br><br>Mukjizat pengetahuan yang dimiliki Nabi Adam diterangkan pula dalam Alquran, “Dan Dia mengajarkan kepada Adam nama-nama (benda) seluruhnya” (QS Al Baqarah : 31). Dalam Alquran juga diceritakan tentang penciptaan Nabi Adam dan Siti Hawa. Tentang bagaimana sampai mereka diturunkan ke bumi dan memiliki anak-anak.<br><br>Kisah Nabi Adam mengandung banyak pelajaran berharga. Terutama tentang nilai ketaatan kepada Yang Maha Kuasa. Mulai dari kisah Nabi Adam dan Siti Hawa di langit. Hingga kisah mereka di bumi beserta anak-anaknya. Nilai ketaatan seorang hamba pada Sang Pencipta banyak terkandung di dalam ceritanya.\n\n<h4>Asal Mula Penciptaan Nabi Adam</h4>\nDikisahkan dalam kitab suci Alquran bahwa Allah bercakap-cakap dengan malaikat. Allah memberi tahu malaikat bahwa akan ada penciptaan makhluk yang dinamai manusia. Manusia akan mengemban tugas sebagai Khalifah di bumi.  Malaikat protes, tidak setuju dengan hal yang direncanakan. Malaikat yakin kalau manusia hanya akan membawa bencana bagi bumi. Mereka akan membuat kerusakan, permusuhan, juga pertumpahan darah. Malaikat merasa keberadaan dirinya saja sudah lebih cukup sebagai ciptaan Allah. Karena mereka senantiasa bertasbih, memuji, dan mengagungkan Allah.<br><br>Allah berfirman bahwa Dia mengetahui apa-apa yang tidak diketahui oleh malaikat.  Seperti kita ketahui, manusia itu tercipta dari saripati tanah. Demikian juga yang diceritakan dalam Alquran surat  As Sajdah ayat 7-9.<i>Yang memperindah segala sesuatu yang Dia ciptakan dan yang memulai penciptaan manusia dari tanah (7), kemudian Dia menjadikan keturunannya dari sari pati air yang hina (air mani)(8). Kemudian Dia menyempurnakannya dan meniupkan roh (ciptaan)-Nya ke dalam (tubuh)nya dan Dia menjadikan pendengaran, penglihatan dan hati bagimu, (tetapi) sedikit sekali kamu bersyukur (9). Q.S. As Sajdah ayat 7 – 9.<i/>\n\nSurat ini menceritakan bahwa Allah mengetahui hal yang gaib dan nyata. Dia menciptakan wujud sempurna manusia dari tanah. Dia juga menciptakan keturunan manusia dari air mani. Kemudian ditiupkan roh untuk menghidupkan. Dia juga yang menciptakan pendengaran, penglihatan dan hati. Setelah Nabi Adam diciptakan, Allah memberi perintah pada malaikat dan iblis untuk bersujud padanya. Walaupun para malaikat diciptakan dari cahaya, mereka taat pada perintah Allah. Para malaikat kemudian bersujud pada Nabi Adam. Lain halnya dengan iblis, ia merasa derajatnya lebih tinggi dari Nabi Adam dan menolak untuk bersujud. Iblis memang diciptakan dari api itu sebabnya ia tidak mau bersujud pada Nabi Adam. Adam yang diciptakan dari tanah dianggap lebih hina kemuliaannya oleh iblis. Surat Al Baqarah ayat 34 menjelaskan hal ini, “Sujudlah kamu kepada Adam, maka sujudlah mereka kecuali iblis, ia enggan dan takabur dan ia termasuk golongan orang-orang yang kafir.”\nKelancangan iblis membangkang membuat Allah sangat murka. Iblis telah durhaka, dan hukumannya adalah keluar dari surga. Iblis yang sombong bukannya bertobat dengan hukuman yang diberikan. Ia malah mengeluarkan sumpah akan menggoda Nabi Adam dan keturunannya agar sesat. Iblis ingin manusia menemani dirinya di neraka. Nabi Adam dianugerahi usia yang panjang oleh Allah. Banyak riwayat yang menceritakan bahwa Nabi Adam diberi usia hingga 1000 tahun. Namun, dalam hadits yang diriwayatkan Abu Hurairah diceritakan kalau Nabi Adam pernah memberikan umurnya sejumlah 40 tahun untuk Nabi Dawud. Pada saat itu Nabi Adam kagum dengan cahaya yang berkilau di antara matanya. Kemudian ia bertanya pada Allah tentang manusia itu. Allah menjawab bahwa manusia itu salah satu keturunan Adam, umat akhir zaman.  Adam bertanya mengenai umur Daud, dan Allah menjawab bahwa Dia memberikan 60 tahun padanya. Nabi Adam lalu meminta Allah untuk menambahkan 40 tahun umur Daud yang dikurangi dari umurnya.\n\n<h4>Nabi Adam dan Siti Hawa Turun ke Bumi</h4>\nNabi Adam memiliki segalanya di surga. Adam bisa mengambil dan menikmati apa saja yang ada di dalamnya. Walaupun begitu Adam merasa kesepian. Kodratnya sebagai manusia yang butuh ada manusia lain muncul. Adam menginginkan teman untuk menemani hari-harinya. Mengetahui Adam yang kesepian, Allah akhirnya menciptakan Hawa. Hawa diciptakan dari tulang rusuk Nabi Adam ketika sedang tidur. Nabi sangat senang dengan kehadiran Hawa. Hasratnya sebagai manusia yang butuh pasangan jadi terjawab. Allah mengizinkan Adam dan Hawa untuk menikmati apa saja yang ada di dalam surga, terkecuali pohon Khuldi. Allah berfirman, “Wahai Adam, tinggallah Engkau dan istrimu di surga ini. dan makanlah makanan-makanan yang banyak lagi baik dimana saja yang kamu sukai, dan janganlah kamu mendekati pohon ini, yang menyebabkan kamu termasuk orang-orang yang zalim.”\nPohon khuldi adalah pohon pengetahuan hal yang baik dan jahat. Ada maksud tertentu dari larangan yang Allah berikan pada Adam dan Hawa. Mengetahui larangan Allah, setan memanfaatkan hal ini untuk menggoda keimanan Adam dan Hawa. Sesuai dengan tekadnya untuk menggoda manusia sepanjang masa. Setan kemudian berbisik pada Adam dan Hawa tentang keistimewaan pohon Khuldi. Kisah ini  tertulis di  Alquran surat Thaha ayat 120, “Wahai Adam, maukah aku tunjukkan kepadamu pohon keabadian (khuldi) dan kerajaan yang tidak akan binasa?” demikian iblis membujuk mereka. Khuldi sendiri merupakan nama pemberian iblis. Iblis menghasut Adam dan Hawa dengan mengatakan maksud Allah melarang mereka. Bahwa Allah disebutkan oleh iblis tidak mau membuat Adam dan Hawa kekal. Iblis dengan penuh semangat merayu mereka untuk memakan buah terlarang. Adam dan Hawa yang dilengkapi dengan napsu sebagai manusia akhirnya tergoda. Rayuan iblis berhasil menggoyahkan keimanan mereka dan jadi tidak taat pada Allah. Ketika Adam dan Hawa memakan buah Khuldi sesuatu yang memalukan terjadi. Nabi Adam dan Hawa  menyadari kalau tubuh mereka jadi telanjang. Selain itu, Adam juga merasakan sakit perut yang hebat. Adam baru merasakan rasa ingin buang hajat, dan ia kebingungan. Surga adalah tempat suci, apa sepantasnya mengotorinya? Demikian yang ada dalam pikiran Adam. Allah kemudian menyindirnya atas keinginan tersebut. Sekaligus juga menyindir tentang ketidaktaatannya. Surat Al A’raf ayat 22-23 menceritakan kejadian ini. Dalam surat ini Allah mengingatkan akan larangannya pada Adam. Juga mengingatkan Adam akan peringatan-Nya tentang kebusukan setan. Adam kemudian memohon ampun dan bertaubat pada Allah.\nDiceritakan Hawa digoda iblis dalam wujudnya yang berupa ular. Namun, tidak dijelaskan siapa dahulu yang memakan buah terlarang itu. ada yang meyakini Khuldi adalah pohon apel yang diambil dari bumi. Karena itu Khuldi disebut memiliki sifat bumi atau tanah, yaitu sifat dasar tanah. Tanah disebut sebagai tempat yang pantas untuk membuang kotoran. Buah Khuldi bisa membangkitkan hawa nafsu, dan membuat lupa diri. Allah melarang Adam memakan buahnya karena bisa membuat dirinya jadi kotor. Kotor dalam artian napsunya ternoda dan mempengaruhi sifat dasar manusia yang penuh dengan ketidakpuasan. Bisa dikatakan pohon Khuldi diciptakan sebagai cobaan bagi Adam dan Hawa. Ujian dari ketaatan seorang hamba pada penciptanya. Namun terlepas dari itu semua, Allah memang menakdirkan manusia untuk turun ke bumi dan menjadi pemimpin di tempat itu. Manusia diciptakan bukan dengan maksud untuk pemimpin di surga. Meskipun Adam dan Hawa telah bertaubat, Allah tetap memberikan hukuman pada mereka dengan turun ke bumi.\n*“Turunlah kalian dari surga menuju bumi. Dan kalian akan menjadi musuh satu sama lain. kalian akan memiliki tempat tinggal di bumi sampai batas waktu tertentu.” Qs. Al A’raf 24-25*\nNabi Adam dan Hawa tidak diturunkan pada tempat yang sama. Nabi Adam diturunkan di puncak bukit Sri Pada di daerah Srilanka. Sedangkan Hawa diturunkan di daerah Arab. Mereka berdua bingung dan sedih karena diturunkan terpisah. Namun, Adam dan Hawa yakin satu sama lainnya akan saling bertemu lagi. Lalu setelah 40 hari mereka pun dipertemukan kembali oleh Allah di Jabal Rahmah. Nabi Adam dan Hawa memulai kehidupan baru sebagai manusia biasa. Diceritakan mereka diturunkan ke bumi dengan membawa dosa atas ketidaktaatannya di surga. Disebutkan pula Allah menghukum Adam akan bersusah payah untuk mencari nafkah. Hawa dihukum akan merasakan sakit pada saat melahirkan anak-anak. Sedangkan ular yang menggoda mereka dihukum berjalan dengan perut selamanya di bumi. Dosa yang pada akhirnya menjadi takdir bagi manusia. Kaum laki-laki dengan kewajiban menafkahi, dan kaum wanita berkewajiban mengurus anak-anaknya. Adam dan Hawa kemudian belajar bercocok tanam juga cara bertahan hidup di bumi. Mereka juga melahirkan anak-anaknya. Allah memperlihatkan kuasanya dengan memberi mereka anak sepasang-sepasang. Setiap Hawa mengandung pasti melahirkan anak kembar. Peristiwa Nabi Adam dan Hawa yang melanggar perintah Allah membuktikan sesuatu. Bahwa tidak ada yang akan didapat dari ketidaktaatan pada Allah selain dari keburukan. Hal ini sekaligus menjadi pengingat bagi kita umat manusia di seluruh muka bumi. Sebagai Nabi dan manusia pertama yang diciptakan Allah, terdapat berbagai kisah dakwah yang dilakukan oleh Nabi Adam AS yang dapawt kamu pelajari melalui buku Manusia & Nabi Pertama di Bumi: Nabi Adam AS.\n\n<h4>Kisah Kehidupan Nabi Adam dan Hawa di Bumi</h4>\nAda cerita menarik dari peristiwa turunnya Nabi Adam dan Hawa ke bumi. Diceritakan mereka turun ke bumi dengan memakai dedaunan untuk menutupi tubuhnya. Ketika berada di bumi dedaunan itu jadi kering dan kemudian rontok. Dipercaya segala wewangian yang tercium di Hindia berasal dari daun-daun tersebut. Adam dan Hawa menjalani kehidupan sebagai manusia biasa setelah bertemu. Allah kemudian memberikan 8 pasang lembu, 2 pasang kambing, dan 2 pasang domba pada keduanya. Allah mengajarkan pada mereka untuk memerah susu hewan-hewan itu. Susu tersebut kemudian bisa mereka minum.  Allah juga memberi perintah pada Adam untuk menggunakan bulu-bulu hewan itu sebagai pakaian. Adam dan Hawa sadar kenikmatan dunia sudah tidak ada lagi, mereka pun menangis sedih. Dari air mata mereka, tumbuh lah kacang tanah dan kacang hijau. Adam lalu menyadari kesulitannya untuk mengetahui waktu-waktu beribadah. Ia lalu mengadu pada Allah tentang masalahnya ini. Allah kemudian memberi seekor ayam putih sebesar unta dari surga. Ketika para malaikat di surga bertasbih, ayam putih itu ikut bertasbih (berkokok) di bumi. Berkat ayam putih itu Adam jadi mengetahui waktu-waktu beribadah di bumi. Untuk melindungi mereka dari panas dan dingin, Adam lalu menebang pohon-pohon. Kayunya ia pakai untuk membangun rumah. Adam juga membuat sumur untuk mengambil air. Allah kemudian menurunkan 21 lampiran tentang hukum haram dan halal memakan dagingbinatang tertentu. Kemudian diturunkan pula 29 huruf hijaiyyah, dan manusia tidak dapat mengurangi atau menambah hurufnya. Ketentuan Allah ini sangat jelas dan tidak ada yang bisa mengubahnya. Adam lalu belajar huruf-huruf itu untuk bisa membaca lampiran yang diturunkan Allah. Hawa kemudian merasakan proses mengandung. Ia terkejut ketika janin dalam perutnya bergerak-gerak. Hawa tidak yakin darimana tempatnya yang bergerak di perutnya itu akan keluar. Ketika waktu melahirkan tiba, Hawa merasakan proses sakitnya. Hawa melahirkan anak kembar, Habil dan Layutsa. Waktu mengandung anak yang kedua pun tiba. Hawa melahirkan anak kembar Qabil dan Iqlima. Sepasang anak laki-laki dan perempuan selalu dilahirkan olehnya. Diceritakan Hawa melahirkan dan mengandung sejumlah 20 bilangan. Setiap melahirkan pasti sepasang, laki-laki dan perempuan.\nDiceritakan juga anak yang dikandung hawa sebanyak 200 orang. Semua dilahirkan kembar kecuali Syits yang memiliki Nur Musthafa Shallalahu’alaihi wa sallam di keningnya. Dikisahkan juga anak cucu Nabi Adam bertambah terus hingga 40 ribu orang laki-laki dan perempuan. Pada saat anak cucu Adam berkembang banyak terjadilah pertengkaran dan pertikaian. Maka Allah memberinya tongkat dari surga untuk mendidik mereka yang membangkang.\n\n<h4>Kisah Habil dan Qabil</h4>\nAnak kembar Nabi Adam yang pertama adalah Habil dan Layutsa. Sedangkan anak kembar kedua adalah Qabil dan Iqlima. Kembaran Habil diceritakan memiliki paras yang kurang menarik. Sedangkan Iqlima kembaran  dari Qabil sangat cantik. Pada saat itu Adam diperintahkan oleh Allah untuk menikahkan anak-anaknya secara silang. Jadi tidak boleh anak dari Adam menikah dengan kembarannya sendiri. ketika Adam hendak menikahkan Habil dengan Iqlimiya, Qabil mengajukan protes. Qabil merasa lebih berhak atas diri Iqlimiya karena dia adalah saudara kembarnya. Qabil tertarik pada kembarannya sendiri karena kecantikannya. Allah kemudian memerintahkan Habil dan Qabil untuk berkurban melalui Nabi Adam. Kurban yang diterima Allah akan menentukan siapa yang berhak atas Iqlimiya.  Qabil yang seorang petani dan sombong memilih seikat gandum yang jelek untuk berkurban. Sedangkan Qabil yang peternak mengurbankan kambing muda dan gemuk. Setelah keduanya berkurban, Allah kemudian menurunkan cahaya putih dan mengangkat kambing dari Habil. Berarti Habil yang ikhlas berkurban berhak atas diri Iqlimiya. Qabil marah, dan tak ingin Habil menikahi kembarannya. Setan memanfaatkan kemarahan Qabil dan membujuknya untuk memukul Habil. Qabil yang dikuasai amarah lalu memukul Habil. Habil tidak memberikan perlawanan karena tidak ingin menjadi masalah besar. Celakanya, pukulan Qabil membuat Habil terbunuh. Qabil takut dan bingung, ia tidak tahu cara menyembunyikan Habil yang telah tak bernyawa. Qabil mencoba membuang Habil ke laut, tapi ombak selalu membawa kembali tubuh Habil ke tepi pantai. Akhirnya Qabil mohon ampun pada Allah dan menyesali perbuatannya. Tiba-tiba Qabil melihat burung gagak di pohon. Satu burung gagaknya telah mati entah karena apa. Gagak yang masih hidup membawa gagak mati turun. Burung itu lalu mematuki tanah hingga berlubang dan mendorong gagak mati ke dalamnya. Qabil mengerti sekarang, ia pun meniru cara burung tersebut untuk mengubur Habil. Cerita Habil dan Qabil ini merupakan pembunuhan pertama di bumi. Kisah Nabi Adam ternyata mengandung banyak nasehat untuk umat manusia. Tentang ketaatan dan ketergantungan manusia sebagai hamba kepada Allah. sekaligus juga tentang kebesaran Allah yang selalu memberi kemudahan manusia ketika meminta pertolongan.\n\n<h4>Kisah Wafatnya Nabi Adam</h4>\nNabi-nabi merupakan orang-orang dengan kualitas rohani yang luar biasa. Namun sebagaimana umumnya manusia, secara fisik mereka memiliki keterbatasan-keterbatasan. Mereka makan, minum, istirahat, dan juga meninggal dunia. Sifat-sifat manusiawi ini pula yang dimiliki Nabi Adam 'alaihissalam. Beliau didiciptakan oleh Allah sebagai manusia pertama, lalu bersama sang istri Hawa hidup di bumi dengan batas usia yang sudah ditetapkan.  Nabi Adam dianugerahi karunia bisa merasakan detik-detik akhir masa hidupnya. Sehingga ketika ajal itu hendak datang, Nabi Adam tampak seperti telah mempersiapkan semuanya. Nabi Adam memulainya dengan mengajukan permintaan terakhir kepada putra-putranya, yakni ingin memakan buah surga. Permintaan ini sulit bila harus dimaknai secara harfiah, karena di alam dunia yang serbafana ini buah surga mustahil ditemukan. Surga hanya ada di alam akhirat. Sebab itulah, ada ulama yang menafsirkan bahwa permintaan akan buah surga merupakan isyarat bahwa Nabi Adam tengah dilanda rindu akan kebahagiaan surgawi yang pernah beliau tinggali sebelum turun ke bumi. Inilah sinyal bahwa kawafatan beliau semakin dekat. Meski demikian, sebagai anak berbakti, para putra Nabi Adam tetap berangkat mencarikan buah surga.\nNamun, tak jauh usai meninggalkan sang ayah, perjalanan mereka dihadang oleh sejumlah lelaki. “Wahai anak-anak Adam, apa yang kalian cari? Atau apa yang kalian mau? Dan ke mana kalian pergi? ”   Mereka menjawab, “Bapak kami sakit, beliau ingin makan buah dari Surga. ”   “Pulanglah, karena ketetapan untuk bapak kalian telah tiba, ” pinta para lelaki itu yang ternyata adalah para malaikat yang sedang menjelma manusia. Di tangan mereka sudah tersedia kafan, wewangian, serta sejumlah perangkat yang lazim diperlukan untuk menggali kubur: kapak, cangkul, dan sekop. Saat para malaikat itu datang, Hawa melihat dan mengenali mereka, maka ia pun berlindung kepada Nabi Adam.   “Menjauhlah dariku. Aku pernah melakukan kesalahan karenamu. Biarkan aku dengan malaikat Tuhanku tabâraka wa ta'âlâ, ” kata Nabi Adam kepada Hawa. Para malaikatlah yang mencabut nyawa Nabi Adam, lantas memandikannya, mengkafaninya, memberinya wewangian, menyiapkan liang lahad, juga menshalatinya. Selanjutnya mereka turun ke kuburnya, memasukkan jenazah Adam ke dalam, lalu mereka meletakkan bata di atasnya. Usai naik ke atas kubur, mereka pun menimbunnya dengan batu. Mereka berseru, \"Wahai anak cucu Adam, ini adalah sunnah kalian.\"   Rupanya Nabi Adam mempersiapkan pelajaran berharga bagi generasi berikutnya tentang bagaimana semestinya memperlakukan orang meninggal. Manusia tak hanya dihormati ketika masih hidup tapi juga saat mereka mati. Standar penghormatan pun tak berlebihan. Tak ada prosesi pembakaran mayat, mutilasi tubuh, menempeli jenazah dengan perhiasan, atau semacamnya. Namun, semua pelajaran tersebut cukup menggambarkan bahwa manusia itu pada dasarnya mulia, namun kehidupan duniawinya pasti berujung fana. Dari tanah kembali ke tanah.\nKisah ini bisa kita jumpai salah satunya dari uraian Syekh Umar Sulaiman Abdullah al-Asyqar dalam kitab Shahîhul Qishash an-Nabawî yang mendasarkan cerita pada hadits sebagai berikut:\nعَنْ عُتَيٍّ ، قَالَ : رَأَيْتُ شَيْخًا بِالْمَدِينَةِ يَتَكَلَّمُ ، فَسَأَلْتُ عَنْهُ ، فَقَالُوا : هَذَا أُبَيُّ بْنُ كَعْبٍ ، فَقَالَ : إِنَّ آدَمَ لَمَّا حَضَرَهُ الْمَوْتُ قَالَ لِبَنِيهِ : أَيْ بَنِيَّ إِنِّي أَشْتَهِي مِنْ ثِمَارِ الْجَنَّةِ ، فَذَهَبُوا يَطْلُبُونَ لَهُ ، فَاسْتَقْبَلَتْهُمُ الْمَلاَئِكَةُ وَمَعَهُمْ أَكْفَانُهُ وَحَنُوطُهُ ، وَمَعَهُمُ الْفُؤُوسُ وَالْمَسَاحِي وَالْمَكَاتِلُ ، فَقَالُوا لَهُمْ : يَا بَنِي آدَمَ ، مَا تُرِيدُونَ ؟ وَمَا تَطْلُبُونَ ؟ أَوْ مَا تُرِيدُونَ ؟ وَأَيْنَ تَذْهَبُونَ ؟ قَالُوا : أَبُونَا مَرِيضٌ فَاشْتَهَى مِنْ ثِمَارِ الْجَنَّةِ ، قَالُوا لَهُمْ : ارْجِعُوا فَقَدْ قُضِيَ قَضَاءُ أَبِيكُمْ   فَجَاؤُوا ، فَلَمَّا رَأَتْهُمْ حَوَّاءُ عَرَفَتْهُمْ ، فَلاَذَتْ بِآدَمَ ، فَقَالَ : إِلَيْكِ إِلَيْكِ عَنِّي فَإِنِّي إِنَّمَا أُوتِيتُ مِنْ قِبَلِكِ ، خَلِّي بَيْنِي وَبَيْنَ مَلاَئِكَةِ رَبِّي - تَبَارَكَ وَتَعَالَى - فَقَبَضُوهُ ، وَغَسَّلُوهُ وَكَفَّنُوهُ وَحَنَّطُوهُ ، وَحَفَرُوا لَهُ وَأَلْحَدُوا لَهُ ، وَصَلَّوْا عَلَيْهِ ، ثُمَّ دَخَلُوا قَبْرَهُ فَوَضَعُوهُ فِي قَبْرِهِ وَوَضَعُوا عَلَيْهِ اللَّبِنَ ، ثُمَّ خَرَجُوا مِنَ الْقَبْرِ ، ثُمَّ حَثَوْا عَلَيْهِ التُّرَابَ ، ثُمَّ قَالُوا : يَا بَنِي آدَمَ هَذِهِ سُنَّتُكُمْ   \nHadits ini diriwayatkan oleh Abdullah bin Imam Ahmad dalam Zawaidul Musnad (5/136). Ibnu Katsir menyebut sanad hadits ini shahih kepada Ubay bin Kaab (Al-Bidayah wan Nihayah, 1/98). Al-Haitsami juga mengatakan bahwa hadits tersebut diriwayatkan oleh Abdullah bin Ahmad. Rawi-rawinya tergolong rawi shahih, kecuali Uttiy bin Dhamurah. Dia adalah rawi tsiqah (Majmauz Zawaid, 8/199).   Hadits ini meskipun mauqûf (sanadnya tidak sampai pada Nabi ﷺ) melainkan hanya pada Ubay bin Ka’ab, tetapi menurut  Syekh Umar Sulaiman al-Asyqar mempunyai kekuatan hadits marfû’ (sanadnya bersambung ke Rasulullah) karena tak mungkin hal itu keluar dari pendapat pribadi. Wallahu a’lam.",
                "isi_eng": "The story of Prophet Adam tells the story of the creation of the first human being who would later inhabit the earth. Prophet Adam was created from the ground and Allah honored him by giving him knowledge about the universe. Adam was given a lot of knowledge that would become his Miracle.\n\nThe form of Prophet Adam was created perfect and complete. But Prophet Adam had a different height from humans today. His height reached 60 cubits or about 18 meters. Very tall compared to the condition of human bodies in general. So it can also explain why the Kaaba is very tall and its entrance is large. The prophets after Prophet Adam must also have had almost similar body postures.\n\nThe miracle of knowledge possessed by Prophet Adam is also explained in the Quran, \"And He taught Adam the names (of things) of all things\" (QS Al Baqarah: 31). The Quran also tells about the creation of Prophet Adam and Siti Hawa. About how they were sent down to earth and had children.\n\nThe story of Prophet Adam contains many valuable lessons. Especially about the value of obedience to the Almighty. Starting from the story of Prophet Adam and Siti Hawa in the sky. To the story of them on earth with their children. The value of a servant's obedience to the Creator is contained in many stories.\n\n<h4>The Origin of the Creation of Prophet Adam</h4>\nIt is narrated in the holy book of the Quran that Allah conversed with angels. Allah told angels that there would be the creation of creatures named humans. Humans would carry out the task of being Caliphs on earth. Angels protested, disagreed with what was planned. Angels were sure that humans would only bring disaster to the earth. They would cause damage, enmity, and bloodshed. Angels felt that their existence alone was more than enough as God's creation. Because they always glorified, praised, and glorified Allah.\nAllah said that He knows what the angels do not know. As we know, humans were created from the essence of the earth. Likewise, what is told in the Quran, Surah As Sajdah, verses 7-9.\n*Who beautified everything He created and who began the creation of humans from the earth (7), then He made his descendants from the essence of a lowly fluid (semen) (8). Then He perfected it and breathed into it His spirit (creation) and He made for you hearing, sight and hearts, (but) little do you give thanks (9). Q.S. As Sajdah verses 7 – 9*\nThis chapter tells that Allah knows the unseen and the visible. He created the perfect form of man from dust. He also created human offspring from semen. Then the spirit was breathed into him to give life. He is also the one who created hearing, sight and hearts. After Prophet Adam was created, Allah commanded the angels and the devil to prostrate to him. Although the angels were created from light, they obeyed the command of Allah. The angels then prostrated to Prophet Adam. The case was different with the devil, he felt his degree was higher than the Prophet Adam and refused to prostrate. The devil was indeed created from fire that is why he did not want to prostrate to the Prophet Adam. Adam who was created from dust was considered more inferior in glory by the devil. Surah Al Baqarah verse 34 explains this, \"Prostrate yourselves to Adam, and they prostrate themselves except Iblis, he was reluctant and arrogant and he was among the disbelievers.\" Iblis's arrogance in defiance made Allah very angry. Iblis had disobeyed, and his punishment was to be expelled from heaven. The arrogant Iblis did not repent of the punishment given. Instead, he swore that he would tempt Prophet Adam and his descendants to go astray. Iblis wanted humans to accompany him in hell. Prophet Adam was granted a long life by Allah. Many narrations tell us that Prophet Adam was given a life of up to 1000 years. However, in the hadith narrated by Abu Hurairah, it is told that Prophet Adam once gave his life of 40 years to Prophet Dawud. At that time Prophet Adam was amazed by the light that shone between his eyes. Then he asked Allah about the man. Allah replied that the man was one of Adam's descendants, the people of the end times. Adam asked about David's age, and Allah replied that He gave him 60 years. Prophet Adam then asked God to add 40 years to David's age which was subtracted from his age.\n\n<h4>Prophet Adam and Siti Hawa Descended to Earth</h4>\nProphet Adam has everything in heaven. Adam can take and enjoy whatever is in it. Even so, Adam felt lonely. His nature as a human being needs other humans to appear. Adam wants a friend to accompany his days. Knowing that Adam was lonely, God finally created Eve. Eve was created from the rib of Prophet Adam while he was sleeping. The Prophet was very happy with Eve's presence. His desire as a human being who needs a partner is answered. God allows Ad and Eve to enjoy everything in heaven, except the Khuldi tree. Allah said, \"O Adam, dwell you and your wife in this garden. and eat abundantly and good food wherever you like, and do not approach this tree, lest you be among the wrongdoers.\" The Khuldi tree is the tree of knowledge of good and evil. There is a specific purpose behind the prohibition that Allah gave to Adam and Eve. Knowing Allah's prohibition, Satan took advantage of this to tempt Adam and Eve's faith. In accordance with his determination to tempt humans throughout time. Satan then whispered to Adam and Eve about the specialness of the Khuldi tree. This story is written in the Qur'an, Surah Thaha, verse 120,\"O Adam, shall I show you the tree of eternity (khuldi) and a kingdom that will not be destroyed?\" thus the devil enticed them. Khuldi itself is the name given by the devil. The devil incited Adam and Eve by saying Allah's intention in forbidding them. That Allah was mentioned by the devil as not wanting to make Adam and Eve eternal. The devil passionately seduced them to eat the forbidden fruit. Adam and Eve, who were equipped with human desires, were finally tempted. The devil's seduction succeeded in shaking their faith and they made them disobedient to Allah. When Adam and Eve ate the Khuldi fruit something embarrassing happened. Prophets Adam and Eve realized that their bodies had become naked. Apart from that, Adam also felt severe stomach pain. Adam just felt the urge to defecate, and he was confused. Heaven is a holy place, is it right to pollute it? That's what Adam had in mind. Allah then insinuated him for this desire. At the same time, he also satirizes his disobedience. Surah Al A'raf verses 22-23 tell of this incident. In this letter, Allah reminds Adam of his prohibition. Also reminding Adam of His warning about Satan's corruption. Adam then asked for forgiveness and repented to Allah.\nIt is said that Eve was tempted by the devil in the form of a snake. However, it is not explained who first ate the forbidden fruit. some believe Khuldi is an apple tree taken from the earth. Therefore, Khuldi is said to have the nature of earth or soil, namely the basic nature of soil. Soil is said to be a suitable place to dispose of waste. Khuldi fruit can arouse lust and make you forget yourself. Allah forbade Adam from eating its fruit because it could make him dirty. Dirty in the sense that his lust is tainted and affects the basic nature of humans which is full of dissatisfaction. It can be said that the Khuldi tree was created as a test for Adam and Eve. A test of a servant's obedience to his creator. But apart from all that, Allah did indeed predestinate humans to come down to earth and become leaders in that place. Humans were not created with the intention of being leaders in heaven. Even though Adam and Eve had repented, Allah still punished them by coming down to earth.\n*\"Go down from heaven to earth. And you will be enemies to each other. You will have a place to live on earth for a certain time.\" Qs. Al A'raf 24-25*\nProphet Adam and Eve were not sent down to the same place. Prophet Adam was sent down on the top of Sri Pada hill in the Sri Lanka area. While Eve was sent down in the Arab area. They were both confused and sad because they were sent down separately. However, Adam and Eve were sure that they would meet again. Then after 40 days, they were reunited by Allah at Jabal Rahmah. Prophet Adam and Eve began a new life as ordinary humans. It is said that they were sent down to earth carrying sins for their disobedience in heaven. It is also said that Allah punished Adam by struggling to earn a living. Eve was punished by feeling pain when giving birth to children. While the snake that tempted them was punished by walking on its stomach forever on earth. Sins that ultimately became the destiny of humans. Men are obliged to provide for their children, and women are obliged to take care of their children. Adam and Eve then learned to farm and how to survive on earth. They also gave birth to their children. Allah showed His power by giving them children in pairs. Every time Eve was pregnant, she gave birth to twins. The incident of Prophet Adam and Eve who violated Allah's command proves something. That there is nothing that will be obtained from disobeying Allah other than evil. This is also a reminder for us humans throughout the face of the earth. As the first Prophet and human being created by Allah, there are various stories of preaching carried out by Prophet Adam AS which you can learn about through the book Human & First Prophet on Earth: Prophet Adam AS.\n\n<h4>The Story of the Life of Prophet Adam and Eve on Earth</h4>\nThere is an interesting story about the descent of Prophet Adam and Eve to earth. It is said that they came down to earth with use leaves to cover their bodies. When on earth the leaves become dry and then fall off. It is believed that all the fragrances smelled in the Indies come from these leaves. Adam and Eve lived as ordinary humans after meeting. Allah then gave them 8 pairs of cows, 2 pairs of goats, and 2 pairs of sheep. Allah taught them to milk the animals. They could then drink the milk. Allah also gave Adam the command to use the animal's fur as clothing. Adam and Eve realized that the pleasures of the world were no longer there, they cried sadly. From their tears, peanuts and green beans grew. Adam then realized his difficulty in knowing the times of worship. He then complained to Allah about this problem. Allah then gave a white chicken the size of a camel from heaven. When the angels in heaven glorified Allah, the white chicken also glorified Allah (crowed) on earth. Thanks to the white chicken, Adam learned the times of worship on earth. To protect them from heat and cold, Adam then cut down trees. He used the wood to build a house. Adam also made a well to get water. Allah then revealed 21 appendices regarding the haram and halal laws for eating the meat of certain animals. Then 29 hijaiyyah letters were revealed, and humans cannot reduce or add letters to them. Allah's provisions are very clear and nothing can change them. Adam then learned the letters so he could read the attachment that Allah had sent down. Eve then experienced the process of becoming pregnant. He was surprised when the fetus in his stomach moved. Hawa wasn't sure where the moving place in her stomach would come from. When the time to give birth arrived, Eve felt the pain. Eve gave birth to twins, Abel and Layutsa. The time to conceive the second child has arrived. Hawa gave birth to twins Qabil and Iqlima. A pair of boys and girls are always born to him. It is said that Eve gave birth and was pregnant with 20 numbers. Every time a pair is born, a boy and a girl are born. It is also said that 200 children were conceived by Eve. All were born twins except Syits who had Nur Musthafa Shallalahu'alaihi wa sallam on his forehead. It is also said that the children of Prophet Adam continued to grow to 40 thousand men and women. When Adam's children grew, there were many quarrels and conflicts. So Allah gave him a stick from heaven to educate those who were disobedient.\n\n<h4>The Story of Habil and Qabil</h4>\nThe first twin children of Prophet Adam were Habil and Layutsa. While the second twin children were Qabil and Iqlima. Habil's twin is said to have an unattractive face. While Iqlima, Qabil's twin, was very beautiful. At that time Adam was ordered by Allah to marry his children cross-breed. So Adam's children were not allowed to marry their own twins. When Adam was about to marry Habil to Iqlimiya, Qabil protested. Qabil felt more entitled to Iqlimiya because she was his twin. Qabil was attracted to his own twin because of her beauty. Allah then ordered Habil and Qabil to make a sacrifice through Prophet Adam. The sacrifice accepted by Allah would determine who was entitled to Iqlimiya. Qabil, a farmer and arrogant, chose a bad sheaf of wheat to sacrifice. While Qabil, a breeder, sacrificed a young and fat goat. After both of them sacrificed, Allah then sent down a white light and lifted the goat from Habil. This meant that Habil, who sincerely sacrificed, had the right to Iqlimiya. Qabil was angry and did not want Habil to marry his twin. Satan took advantage of Qabil's anger and persuaded him to hit Habil. Qabil, who was overcome by anger, then hit Habil. Habil did not put up any resistance because he did not want to become a big problem. Unfortunately, Qabil's blow killed Habil. Qabil was afraid and confused, he did not know how to hide Habil who was dead. Qabil tried to throw Habil into the sea, but the waves always brought Habil's body back to the shore. Finally, Qabil asked Allah for forgiveness and regretted his actions. Suddenly, Qabil saw a crow in a tree. One of his crows had died for some reason. The crow that was still alive brought the dead crow down. The bird then pecked the ground until it made a hole and pushed the dead crow into it. Qabil understood now, he also imitated the bird's way to bury Habil. The story of Habil and Qabil is the first murder on earth. The story of the Prophet Adam turns out to contain a lot of advice for mankind. About the obedience and dependence of humans as servants to Allah. as well as about the greatness of Allah who always makes it easy for humans when asking for help.\n\n<h4>The Story of the Death of the Prophet Adam</h4>\nProphets are people with extraordinary spiritual qualities. However, like most humans, they have physical limitations. They eat, drink, rest, and also die. These human traits were also possessed by the Prophet Adam 'alaihi sallam. He was created by Allah as the first human, then together with his wife Eve lived on earth with a predetermined age limit. The Prophet Adam was given the gift of being able to feel the final moments of his life. So when death was about to come, the Prophet Adam seemed to have prepared everything. The Prophet Adam began by making a final request to his sons, namely to eat the fruit of heaven. This request is difficult to interpret literally, because in this ephemeral world, the fruit of heaven is impossible to find. Heaven only exists in the afterlife. For this reason, there are scholars who interpret that the request for the fruit of heaven is a sign that the Prophet Adam was longing for the heavenly happiness that he had lived in before coming down to earth. This is a sign that his death is getting closer. However, as dutiful sons, the sons of the Prophet Adam still set out to find the fruit of heaven. However, not long after leaving their father, their journey was blocked by a number of men. “O children of Adam, what are you looking for? Or what do you want? And where are you going?” They replied, “Our father is sick, he wants to eat fruit from Paradise.” “Go home, because the decree for your father has come,” requested the men who turned out to be angels in human form. In their hands were already available shrouds, perfumes, and a number of tools commonly needed to dig a grave: axes, hoes, and shovels. When the angels came, Eve saw and recognized them, so she took refuge with Prophet Adam. “Get away from me. I have made a mistake because of you. Leave me with the angels of my Lord tabâraka wa ta'âlâ,” said Prophet Adam to Eve. It was the angels who took Prophet Adam's life, then washed him, shrouded him, perfumed him, prepared the grave, and prayed for him. Then they went down to his grave, put Adam's body in, then they placed bricks on top of it. After climbing onto the grave, they covered it with stones. They called out, \"O children of Adam, this is your sunnah.\" Apparently, Prophet Adam prepared a valuable lesson for the next generation about how to treat the dead. Humans are not only respected when they are alive but also when they die. The standard of respect is not excessive. There is no cremation procession, body mutilation, adorning the corpse with jewelry, or the like. However, all of these lessons are enough to illustrate that humans are basically noble, but their worldly life will definitely end in mortality. From the earth, back to the earth. We can find this story in one of the descriptions of Sheikh Umar Sulaiman Abdullah al-Asyqar in the book Shahîhul Qishash an-Nabawî which bases the story on the following hadith:\nعَنْ عُتَيٍّ ، قَالَ : رَأَيْتُ شَيْخًا بِالْمَدِينَةِ يَتَكَلَّمُ ، فَسَأَلْتُ عَنْهُ ، فَقَالُوا : هَذَا أُبَيُّ بْنُ كَعْبٍ ، فَقَالَ : إِنَّ آدَمَ لَمَّا حَضَرَهُ الْمَوْتُ قَالَ لِبَنِيهِ : أَيْ بَنِيَّ إِنِّي أَشْتَهِي مِنْ ثِمَارِ الْجَنَّةِ ، فَذَهَبُوا يَطْلُبُونَ لَهُ ، فَاسْتَقْبَلَتْهُمُ الْمَلاَئِكَةُ وَمَعَهُمْ أَكْفَانُهُ وَحَنُوطُهُ ، وَمَعَهُمُ الْفُؤُوسُ وَالْمَسَاحِي وَالْمَكَاتِلُ ، فَقَالُوا لَهُمْ : يَا بَنِي آدَمَ ، مَا تُرِيدُونَ ؟ وَمَا تَطْلُبُونَ ؟ أَوْ مَا تُرِيدُونَ ؟ وَأَيْنَ تَذْهَبُونَ ؟ قَالُوا : أَبُونَا مَرِيضٌ فَاشْتَهَى مِنْ ثِمَارِ الْجَنَّةِ ، قَالُوا لَهُمْ : ارْجِعُوا فَقَدْ قُضِيَ قَضَاءُ أَبِيكُمْ   فَجَاؤُوا ، فَلَمَّا رَأَتْهُمْ حَوَّاءُ عَرَفَتْهُمْ ، فَلاَذَتْ بِآدَمَ ، فَقَالَ : إِلَيْكِ إِلَيْكِ عَنِّي فَإِنِّي إِنَّمَا أُوتِيتُ مِنْ قِبَلِكِ ، خَلِّي بَيْنِي وَبَيْنَ مَلاَئِكَةِ رَبِّي - تَبَارَكَ وَتَعَالَى - فَقَبَضُوهُ ، وَغَسَّلُوهُ وَكَفَّنُوهُ وَحَنَّطُوهُ ، وَحَفَرُوا لَهُ وَأَلْحَدُوا لَهُ ، وَصَلَّوْا عَلَيْهِ ، ثُمَّ دَخَلُوا قَبْرَهُ فَوَضَعُوهُ فِي قَبْرِهِ وَوَضَعُوا عَلَيْهِ اللَّبِنَ ، ثُمَّ خَرَجُوا مِنَ الْقَبْرِ ، ثُمَّ حَثَوْا عَلَيْهِ التُّرَابَ ، ثُمَّ قَالُوا : يَا بَنِي آدَمَ هَذِهِ سُنَّتُكُمْ   \nThis hadith was narrated by Abdullah bin Imam Ahmad in Zawaidul Musnad (5/136). Ibn Kathir called the chain of transmission of this hadith sahih to Ubay bin Kaab (Al-Bidayah wan Nihayah, 1/98). Al-Haithami also said that the hadith was narrated by Abdullah bin Ahmad. Its narrators are classified as sahih narrators, except for Uttiy bin Dhamurah. He is a trustworthy narrator (Majmauz Zawaid, 8/199). Although this hadith is mauqûf (its chain of transmission does not reach the Prophet ﷺ) but only to Ubay bin Ka’ab, according to Sheikh Umar Sulaiman al-Ashqar it has the strength of a marfû’ hadith (its chain of transmission continues to the Messenger of Allah) because it is impossible for it to come out of personal opinion. By Allah, He knows best."
            },
            {
                "no": 2,
                "name_id": "Nabi Idris AS",
			    "name_eng": "Prophet Idris AS",
			    "arab": "ادريس عَلَیهِ‌ السَّلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/idris.png",
                "isi": "Nabi Idris merupakan salah satu nabi yang mewariskan banyak pengetahuan dan masih berguna hingga saat ini. Kenabiannya perlu diimani oleh umat Islam sebagai bentuk taqwa atas perintah Allah SWT. Secara garis keturunan Nabi Idris memiliki jarak enam generasi dari Nabi Muhammad. Urutannya adalah :\n1. Adam\n2. Syits\n3. Anusy\n4. Qinan\n5.Mihlail\n6. Yarid\n7. Nabi Idris\nNama Idris berasal dari kata ‘Darasa’ yang berarti belajar. Sebab, Nabi Idris dikenal sebagai sosok yang sangat senang belajar dan suka mengkaji fenomena alam semesta. Nabi Idris juga dikenal dengan nama Akhnukh bin Yarid. Dia dilahirkan dari seorang perempuan bernama Iqlima. Selama 345 tahun Nabi Idris hidup di dunia, dia diutus oleh Allah SWT untuk berdakwah di Irak Kuno (Babilonia) dan Mesir (Memphis). Berikut kisah Nabi Idris selengkapnya. Nabi Idris adalah manusia pertama yang menerima wahyu lewat Malaikat Jibril ketika dirinya menginjak usia 82 tahun.\n\n<h4>Silsilah Nabi Idris</h4>\nNabi Idris merupakan keturunan Adam yang pertama kali menerima wahyu dari Allah SWT setelah Adam dan Syits. Hal itu tertera dalam QS. Maryam:56-57.\n*“Dan ceritakanlah (hai Muhammad) kepada mereka, kisah Idris (yang tersebut) di dalam Al Qur’an. Sesungguhnya ia adalah seorang yang sangat membenarkan dan seorang nabi. Dan Kami telah mengangkatnya ke martabat yang tinggi.*\nNamun demikian, ada beberapa perbedaan pendapat mengenai riwayat Nabi Idris apakah dia hidup sebelum Nabi Nuh ataukah sesudahnya. Ilmuwan seperti Ibnu Katsir, Ath-Thabari, Ibnu Ishaq, Ibnu Jarir, Asy-Syaukani, hingga As-Suyuthi menjelaskan bahwa Nabi Idris  hidup sebelum Nabi Nuh. Hal itu berdasarkan nasab bahwa nama asli Nabi Idris adalah Khonukh yang merupakan nenek moyang Nabi Nuh. Hal itu juga diperkuat dengan QS. Maryam: 58 :\n*“Mereka itulah orang-orang yang Allah telah beri nikmat, yaitu kalangan para nabi dari keturunan Adam, dan dari orang yang Kami angkat bersama Nuh dari keturunan Ibrahim dan Israil, dan dari orang-orang yang Kami beri petunjuk dan telah Kami pilih. Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyangka dengan bersujud dan menangis.”*\nAyat tersebut  mengisahkan silsilah keturunannya. Nabi Idris termasuk keturunan Nabi Adam, tidak ikut bersama Nabi Nuh dalam perahu. Dengan demikian, Nabi Idris urutannya sebelum Nabi Nuh.\n\n<h4>Nabi Idris Berdakwah di Babilonia hingga Mesir</h4>\nPada mulanya, Nabi Idris diutus oleh Allah SWT untuk menyebarkan agama di Babilonia, Irak Kuno. Nabi Idris sendiri merupakan sosok yang rajin beribadah dan beramal salih seperti halnya yang diceritakan dalam buku Nabi Idris. Namun, akhirnya dia berhijrah ke Mesir lantaran penduduk Babilonia tidak bisa menerima apa yang diajarkan Nabi Idris. Dalam kehidupan sehari-hari, Nabi Idris dikenal sebagai orang yang gemar bertasbih kepada Allah. Dia juga selalu melakukan perbuatan baik seperti belajar, menulis, dan menjahit. Keterampilan-keterampilan itu perlahan-lahan dia ajarkan kepada kaumnya.\n\n<h4>Nabi Idris Pandai Ilmu Perbintangan</h4>\nPengetahuan Nabi Idris sangat luas karena dia rajin mengkaji dan mempelajari banyak hal, termasuk segala hal yang diajarkan Allah SWT kepada Nabi Adam. Selain itu, Nabi Idris juga sangat tertarik dengan fenomena-fenomena alam yang terjadi di muka bumi. Oleh sebab itulah, banyak yang bertanya kepadanya apabila terjadi fenomena alam tertentu. Nabi Idris sering menjadi rujukan terhadap suatu permasalahan. Nabi Idris dikenal sebagai ahli perbintangan. Dia adalah orang yang pertama kali memanfaatkan rasi bintang sebagai penunjuk arah, waktu yang tepat untuk bercocok tanam, hingga memperkirakan kondisi cuaca. Nabi Idris juga memiliki keterkaitan dengan bangsa Sumeria. Sebab, beberapa penelitian membuktikan bangsa Sumeria juga mempelajari ilmu perbintangan untuk mengetahui waktu bercocok tanam yang baik. Misalnya, rasi bintang Taurus yang dipercaya sebagai masa awal musim semi dan cocok untuk menanam. Sementara, rasi bintang Virgo digunakan sebagai waktu yang tepat untuk melakukan panen.\n\n<h4>Nabi Idris Jadi Manusia Pertama yang Bisa Membuat Pakaian</h4>\nSebelum Nabi Idris terlahir di dunia, manusia sebelumnya terbiasa membuat dan memakai kulit binatang sebagai pakaian. Nabi Idris diberikan Allah mukjizat berupa orang pertama yang bisa menjahit kulit binatang menjadi baju layak pakai. Saat ada waktu luang, Nabi Ibrahim menjahit pakaian lalu diberikan kepada kaum fakir miskin.\n\n<h4>Nabi Idris Jadi Manusia Pertama yang Bisa Menulis</h4>\nNabi Idris juga dikenal sebagai manusia pertama yang bisa menulis menggunakan pena. Bahkan, para ilmuwan pernah menemukan beberapa potongan naskah kuno yang diklaim berkaitan dengan Nabi Idris. Naskah itu bernama Kitab Henokh. Salah satu kisah dalam kitab itu adalah tentang peradaban tertua di bumi Lemuria, Atlantis yang hilang ditelan bumi. Selain itu, prediksi tentang banjir besar yang akan terjadi di muka bumi. Para ilmuwan itu menduga Kitab Henokh tersebut ditulis oleh Nabi Idris.\n\n<h4>Kisah Nabi Idris Merasakan Mati dan Hidup Lagi</h4>\nPada suatu malam, Nabi Idris kedatangan tamu seorang pria. Dia membawa sangat banyak buah-buahan. Nabi Idris tidak sadar, pria tersebut adalah Malaikat Izroil yang menyamar. Nabi Idris menawarkan makanan itu kepada Izroil, namun ditolak. Pada akhirnya, mereka berbincang-bincang dan berjalan-jalan melihat pemandangan sekitar. Setelah empat hari bersama dan sudah cukup akrab, Nabi Idris mulai curiga dengan sang tamu. Sebab, tamu itu tidak menyentuh jamuannya sama sekali. Nabi Idris lantas  mengajukan pertanyaan karena diliputi rasa penasaran.\n“Sebenarnya siapa kamu?” tanya Nabi Idris.\n“Maaf Ya Nabi Allah. Aku sebenarnya adalah Malaikat Izroil,” jawab sang malaikat.\nTentu saja Nabi Idris terkejut mendengarnya, sebab Malaikat Izroil bertugas mencabut nyawa manusia. “Kau sudah empat hari bersamaku. Apakah kau sedang bertugas untuk mencabut nyawa makhluk di dunia ini?”\n“Wahai Idris, selama empat hari ini memang banyak sekali nyawa yang telah kucabut. Roh makhluk-makhluk itu bagaikan hidangan di hadapanku. Kuambil mereka bagaikan seseorang sedang menyuap makanan.”\n“Lantas apa maksud kedatanganmu kemari? Apakah kau ingin mencabut nyawaku?”\nMalaikat Izroil menggeleng. “Tidak, Ya Idris. Kedatanganku memang untuk mengunjungimu karena saya rindu dan Allah telah memberikan izin.”\nSetelah percakapan itu, Nabi Idris membuat satu permintaan. Dia ingin Malaikat Izroil mencabut nyawanya, kemudian menghidupkannya kembali. Nabi Idris penasaran dengan rasa sakratul maut yang konon sangat dahysat sakitnya. Namun, permintaan itu tidak segera dituruti oleh Malaikat Izroil. Sebab, segala hal yang dia lakukan hanya atas perintah Allah SWT.\n“Saya tidak mencabut nyawa seseorang selain atas izin Allah,” kata Malaikat Izroil.\nNamun, Allah SWT pada akhirnya mengabulkan permintaan Nabi Idris. Seketika, Malaikat Izroil pun mencabut nyawa Nabi Idris. Melihat sahabatnya kesakitan sedemikian rupa, Malaikat Izroil menangis. Setelah mati, Allah menghidupkan kembali Nabi Idris.\nNabi Idris lantas menangis sejadi-jadinya. Dia tidak bisa membayangkan apabila manusia-manusia lain mengalami sakaratul maut yang terasa sakit seperti dirinya. Rasanya sungguh dahsyat, tidak bisa diungkapkan dengan kata-kata. Nabi Idris pun merasa tidak tega apabila ada umatnya yang harus merasakan sengsara di ujung hidup dan mati.",
                "isi_eng": "Prophet Idris is one of the prophets who passed down a lot of knowledge and is still useful today. Muslims need to believe in his prophethood as a form of piety at the command of Allah SWT. In terms of lineage, the Prophet Idris has a distance of six generations from the Prophet Muhammad. The order is :\n1. Adam\n2. Syits\n3. Anusy\n4. Qinan\n5. Mihlail\n6. Yarid\n7. Prophet Idris\nThe name Idris comes from the word 'Darasa' which means learning. Because, Prophet Idris is known as someone who really likes learning and likes studying the phenomena of the universe. Prophet Idris is also known as Akhnukh bin Yarid. He was born to a woman named Iqlima. During the 345 years that Prophet Idris lived in the world, he was sent by Allah SWT to preach in Ancient Iraq (Babylonia) and Egypt (Memphis). The following is the complete story of Prophet Idris. Prophet Idris was the first human to receive revelation through the Angel Gabriel when he was 82 years old.\n\n<h4>Prophet Idris' lineage</h4>\nProphet Idris is a descendant of Adam who was the first to receive revelation from Allah SWT after Adam and Syits. This is stated in QS. Maryam:56-57.\n*“And tell them (O Muhammad) the story of Idris (that) in the Qur'an. Indeed, he was a very righteous man and a prophet. And We have raised him to a high dignity.*\nHowever, there are several differences of opinion regarding the history of Prophet Idris whether he lived before Prophet Noah or after. Scientists such as Ibnu Katsir, Ath-Thabari, Ibnu Ishaq, Ibnu Jarir, Asy-Syaukani, and As-Suyuthi explained that Prophet Idris lived before Prophet Noah. This is based on the nasab that the real name of the Prophet Idris was Khonukh who was the ancestor of the Prophet Noah. This is also reinforced by QS. Maryam: 58 :\n*\"Those are the people whom Allah has given favor to, namely among the prophets from the descendants of Adam, and from those whom We adopted with Noah from the descendants of Abraham and Israel, and from those whom We have guided and We have chosen. When the verses of Allah, the Most Gracious, are recited to them, they prostrate themselves and weep.\"*\nThe verse tells of his genealogy. Prophet Idris, a descendant of Prophet Adam, did not accompany Prophet Noah in the boat. Thus, Prophet Idris was ranked before Prophet Noah.\n\n<h4>Prophet Idris Preached in Babylon to Egypt</h4>\nAt first, Prophet Idris was sent by Allah SWT to spread religion in Babylon, Ancient Iraq. Prophet Idris himself was a figure who diligently worshiped and did good deeds as told in the book Prophet Idris. However, in the end he emigrated to Egypt because the Babylonian people could not accept what the Prophet Idris taught. In everyday life, Prophet Idris is known as a person who likes to glorify Allah. She also always does good deeds such as studying, writing, and sewing. He slowly taught these skills to his people.\n\n<h4>Prophet Idris was good at Astrology</h4>\nProphet Idris' knowledge was very broad because he diligently studied and studied many things, including everything taught by Allah SWT to Prophet Adam. In addition, Prophet Idris was also very interested in natural phenomena that occurred on earth. Therefore, many asked him if a certain natural phenomenon occurred. Prophet Idris was often a reference for a problem. Prophet Idris was known as an expert in astronomy. He was the first person to use the constellations as a guide, the right time to plant crops, and to predict weather conditions. Prophet Idris also has a connection with the Sumerian nation. Because, several studies prove that the Sumerian nation also studied astronomy to find out the right time to plant crops. good. For example, the constellation Taurus is believed to be the beginning of spring and is suitable for planting. Meanwhile, the constellation Virgo is used as the right time to harvest.\n\n<h4>Prophet Idris Was the First Human to Make Clothes</h4>\nBefore Prophet Idris was born, humans were used to making and wearing animal skins as clothing. Prophet Idris was given a miracle by Allah in the form of the first person who could sew animal skins into clothes that were fit to wear. When he had free time, Prophet Ibrahim sewed clothes and then gave them to the poor.\n\n<h4>Prophet Idris Was the First Human to Write</h4>\nProphet Idris was also known as the first human who could write using a pen. In fact, scientists have found several pieces of ancient manuscripts that are claimed to be related to Prophet Idris. The manuscript is called the Book of Enoch. One of the stories in the book is about the oldest civilization on earth, Lemuria, Atlantis that was lost swallowed by the earth. In addition, there is a prediction about a great flood that will occur on earth. The scientists suspect that the Book of Enoch was written by Prophet Idris.\n\n<h4>The Story of Prophet Idris Experiencing Death and Life Again</h4>\nOne night, Prophet Idris was visited by a male guest. He brought a lot of fruits. Prophet Idris did not realize that the man was the Angel Izroil in disguise. Prophet Idris offered the food to Izroil, but he refused. In the end, they chatted and walked around looking at the surrounding scenery. After four days together and having become quite close, Prophet Idris began to suspect the guest. This was because the guest did not touch his meal at all. Prophet Idris then asked a question because he was filled with curiosity.\n\"Who are you actually?\" asked Prophet Idris.\n\"Excuse me, O Prophet of Allah. I am actually the Angel Izroil,\" replied the angel.\nOf course Prophet Idris was surprised to hear this, because the Angel Izroil was tasked with taking human lives. \"You have been with me for four days. Are you on duty to take the lives of creatures in this world?”\n“O Idris, during these four days I have indeed taken many lives. The souls of those creatures are like a dish in front of me. I take them as if someone is feeding them food.”\n“Then what is the purpose of your coming here? Do you want to take my life?”\nAngel Izroil shook his head. “No, O Idris. I came to visit you because I miss you and Allah has given me permission.”\nAfter that conversation, Prophet Idris made one request. He wanted Angel Izroil to take his life, then bring him back to life. Prophet Idris was curious about the agony of death which is said to be very painful. However, Angel Izroil did not immediately comply with the request. Because, everything he did was only by order of Allah SWT.\n“I do not take someone's life except with Allah's permission,” said Angel Izroil.\nHowever, Allah SWT eventually granted Prophet Idris' request. Instantly, the Angel Izroil took the life of Prophet Idris. Seeing his friend in such pain, Angel Izroil cried. After death, Allah brought Prophet Idris back to life.\nProphet Idris then cried uncontrollably. He couldn't imagine if other humans experienced death as painful as he did. The feeling is really powerful, it can't be expressed in words. Prophet Idris also felt that he could not bear it if his people had to experience misery on the edge of life and death."
            },
            {
                "no": 3,
                "name_id": "Nabi Nuh AS",
			    "name_eng": "Prophet Noah  AS",
			    "arab": "نوح عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Nuh.png",
                "isi": "Mukjizat dan Kisah Nabi Nuh – Setiap kisah Nabi yang diajarkan saat menempuh pendidikan atau pada saat diceritakan oleh orang tua pasti akan selalu terdengar menyenangkan. Kisah Nabi dan Rasul yang sering diceritakan ketika masih sekolah biasanya terdiri dari 25 nabi dan rasul. Selain menyenangkan, kisah para Nabi dan Rasul selalu memiliki nilai-nilai yang akan sangat bermanfaat bagi kehidupan sehari-hari. Bahkan, bisa menambah pahala untuk diri kita sendiri.\nHampir semua orang pasti sudah mengetahui kisah Nabi yang terselamtkan dari banjir bandang yang cukup besar dengan membuat perahu. Bukan hanya dirinya saja yang diselematkam, tetapi para umatnya dan hewan-hewan juga diselamatkan oleh Nabi Nuh AS.\nNamun, bagi mereka yang tidak mengikuti perintah dari Nabi Nuh AS akan tenggelam bersama banjir bandang yang telah direncanakan oleh Allah S.W.T. Anak dari Nabi Nuh AS juga tak mempercayai akan datangnya musibah banjir bandang, hingga akhirnya dirinya harus tenggelam bersama banjir bandang itu.\nNabi Nuh AS sangat dikenal dengan kesabarannya walaupun sudah dibenci oleh banyak orang, Keteguhan, ketabahan, dan kesabaran hati dari Nabi Nuh AS sudah sangat teruji karena beliau sudah berdakwah selama 950 tahun untuk mengenal Allah lebih dalam lagi. Berkat kesabaran dan keteguhan hatinya dalam mengenal Allah walaupun sudah tertimpa berbagai macam musibah, Nabi Nuh AS memperoleh gelar ulul azmi. Gelar ulul azmi adalah gelar yang diberikan kepada Nabi dan Rasul yang memiliki kesabaran dan ketabahan yang luar biasa. Kisah Nabi Nuh AS sudah dijelaskan dala  Al-Quran Surat Al-Ankabut ayat 14:\nوَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَلَبِثَ فِيْهِمْ اَلْفَ سَنَةٍ اِلَّا خَمْسِيْنَ عَامًاۗ فَاَخَذَهُمُ الطُّوْفَانُ وَهُمْ ظٰلِمُوْنَ\n*Dan sesungguhnya Kami telah mengutus Nuh kepada kaumnya, maka ia tinggal di antara mereka seribu tahun kurang lima puluh tahun. Maka mereka ditimpa banjir besar, dan mereka adalah orang-orang yang zalim.*\n\n<h4>Kisah Nabi Nuh AS saat Berdakwah</h4>\nDiutusnya Nabi Nuh AS oleh Allah pada saat terjadi kekosongan di antara dua rasul (fatrah) yang jika dibiarkan begitu saja ajaran-ajaran agama yang sudah dibawa Nabi sebelumnya akan dilupakan oleh para manusia. Apabila ajaran agama itu sudah ditinggalkan, maka para manusia kembali melakukan berbagai macam dosa, seperti melakukan maksiat, melakukan kemungkaran, dan meninggalkan amalan kebaikan.\nPada masa fatrah itu, Nabi Nuh AS mendapatkan wahyu kenabian dari Allah untk memberikan ajaran agama Islam. Pada saat itu, kaum Nabi Nuh AS tidak menyembah Allah melainkan yang disembah adalah patung berhala yang dibuat oleh tangan para manusia atau para kaum Nabi Nuh AS.\nPatung-patung yang telah dibuat dan disembah itu dipercaya oleh mereka akan memberikan banyak sekali kebaikan dan manfaat, dan mereka juga percaya bahwa patung berhala dapat menolak segala macam hal-hal buruk di kemudian hari.\nBerdasarkan kepercayaan kaum Nabi Nuh AS pada saat itu, patung berhala yang telah dibuat dan nama patung-patung itu berasal dari nama para ulama yang hidup di masa sebelumnya. Mereka membuat dan memberikan nama berdasarkan nama ulama terdahulu dengan alasan untuk mengenang jasa para ulama tersebut dan semangat ibadah umat terdahulu. Nama patung berhala yang dibuat oleh kaum Nabi Nuh AS yang belum mengenal Allah, seperti Wadd, dan Suda, Yatuq dan Nasr.\nPada masa-masa kondisi suatu kaum sedang mempercayai patung berhala itu Nabi Nuh AS diutus oleh Allah untuk meyakinkan para kaum itu agar mengikuti ajaran Allah dan tidak menyembah patung berhala. Nabi Nuh AS memiliki kemampuan yangcukup luar biasa ketika beragumentasi dengan orang lain. Hal ini dikarenakan Nabi Nuh AS memiliki akal yang cerdas dan kemampuan bicara yang santun, baik, dan sabar dalam beradu argumentasi.\nNabi Nuh AS yang sudah diutus oleh Allah selalu berusaha untuk meyakinkan kaumnya agar tidak lagi menyembah patung berhala dan menagajak kaumnya untuk kembali kepada ajaran Allah. Nabi Nuh AS tidak pernah menyerah untuk menyadarkan kaumnya dan ia selalu mencari berbagai macam cara seperti melakukan dakwah. Namun, kaumnya yang tidak taat itu menolak ajakan Nabi Nuh AS. Hal ini terkandung di dalam Al-Quran Surat Al-A’raf ayat 59:\nلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اِنِّيْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ\n*Sesungguhnya Kami telah mengutus Nuh kepada kaumnya, lalu ia berkata: “Wahai kaumku sembahlah Allah, sekali-kali tak ada Tuhan bagimu selain-Nya. Sesungguhnya (kalau kamu tidak menyembah Allah), aku takut kamu akan ditimpa azab pada hari yang besar (kiamat).*\nDakwah-dakwah Nabi Nuh AS berupa ajakan kaumnya untuk melihat dan merasakan segala hal yang ada di muka bumi ini merupakan ciptaan Allah, mulai dari matahari, bulang, dan bintang-bintang. Tak hanya itu, tumbuh-tumbuhan, hewan, dan air yang mengalir yang dapat dinikmati dan dirasakan oleh manusia termasuk ciptaan Allah. Perubahan siang dan malam serta hal-hal yang ada di muka bumi adalah bukti nyata bahwa Allah itu benar-benar ada dan Tuhan yang harus disembah bukan patung berhala yang disembah.\nBukan hanya memberikan bukti akan tanda kebesaran Allah, Nabi Nuh AS juga memberikan dakwah bahwa setiap amalan perbuatan yang dilakukan oleh manusia akan ada ganjarannya dari Allah. Apabila amalan perbuatan yang dilakukan berupa kebaikan dan menaati perintah Allah, maka manusia akan mendapatkan surga. Sementara itu, jika amalan perbuatan yang dilakukan berupa keburukan atau tidak menjalan perintah Allah, maka ganjarannya adalah neraka.\nKesabaran, ketabahan, dan keteguhan hati Nabi Nuh AS dalam menyebarkan ajaran agama Allah melalui dakwah selalu ditolak oleh sebagian besar dari kaum Nabi Nuh AS. Meskipun, banyak yang menolak ajaran Allah, tetapi masih ada manusia yang menerima ajakan Nabi Nuh AS untuk mengikuti ajaran Allah.\nSelama 950 tahun, Nabi Nuh AS selalu melakukan dakwah agar kaumnya tidak berjalan di jalan yang sesat yang bisa merugikan diri sendiri karena diberikan azab oleh Allah. Ajakan-ajakan beliau dalam dakwahnya selalu berhubungan dengan tidak menyembah patung berhala dan kembali menyembah Allah Yang Maha Esa. Dengan mengajak kaumnya untuk menyembah Allah, maka Nabi Nuh AS sangat berharap agar kaumnya kembali ke jalan yang benar dan terang.\nSelain itu, Nabi Nuh AS juga mengajarkan kepada kaumnya untuk selalu saling menyayangi dan saling tolong menolong. Beliau juga sangat berjuang dengan keras agar sifat sombong yang dimiliki oleh manusia dengan kedudukan yang cukup tinggi itu agar menghilangkan sifat-sifat buruk itu dan digantinya dengan memberikan kasih sayang.\nNamun, perjuangan yang telah dilakukan dengan kesabaran dan ketabahan yang telah dilakukan Nabi Nuh AS untuk menyadarkan kaumnya kembali ke jalan yang benar dan terang ternyata tetap tidak berhasil. Mayoritas kaumnya tidak percaya dengan ajakan dari Nabi Nuh AS untuk menyembah Allah dan beriman kepada Allah. Hanya ada beberapa manusia saja yang ingin menerima ajakan dari Nabi Nuh AS dan itupun tidak sampai seratus manusia.\n\n<h4>Nabi Nuh AS Membuat Kapal</h4>\nSetelah berjuang untuk menyadarkan kaumnya agar tidak lagi menyembah patung berhala selama ratusan tahun, bahkan hampir seribu tahun, Nabi Nuh AS mendapatkan perintah dari Allah agar segera membuat kapal yang sangat besar yang bisa menampung manusia (para pengikutnya) dan hewan. Mereka yang menerima ajakan Nabi Nuh AS mulai membuat kapal besar yang telah diperintahkan oleh Allah dengan mengumpulkan bahan-bahan yang dibutuhkan dalam pembuatan kapal.\nMereka yang membuat kapal memilih tempat yang jauh dari keramaian masyarakat dan jauh dari kota. Mereka sangat bersemangat dalam membuat kapal ini, sehingga siang dan malam digunakan untuk menyelesaikan kapal besar yang telah diperintahkan oleh Allah. Alasan Nabi Nuh AS untuk membuat kapal jauh dari kota dan keramaian agar para mansyarakat tidak banyak yang tahu dan Nabi Nuh AS bersama manusia yang menerima ajakannya dapat mengerjakan pembuatan kapal dengan tenang.\nMeskipun Nabi Nuh AS sudah berusaha untuk menjauh dari keramaian dan berharap tak ada gangguan dari orang lain, tetapi pembuatan kapal akhirnya terlihat oleh para manusia yang tidak menerima ajakan Nabi Nuh AS. Mereka menghina dan mengejek pembuatan kapal besar yang telah diperintahkan oleh Allah. Kalimat-kalimat ejekan dan hinaan yang diungkapkan oleh kaum yang tidak taat kepada ajaran Allah hanya dibalas dengan santai oleh Nabi Nuh AS, “Untuk kalian yang menghina dan mengejek kami akan tiba waktunya jika kalian akan diberikan azab oleh Allah atas amalan perbuatan yang telah kalian buat.”\nMeskipun Nabi Nuh AS mendapatkan hinaan dan ejekan dari mereka, tetapi beliau tetap melanjutkan pembuatan kapal besar yang sudah diperintahkan Allah. Nabi Nuh AS dan para pengikutnya tetap semangat dalam mengerjakan kapal besar, hingga pada akhirnya kapal besar itu berhasil dibuat dan mereka pun sangat senang karena sudah berhasil menjalankan perintah Allah.\n\n<h4>Banjir Bandang</h4>\nKetika mereka yang menghina Nabi Nuh AS dan pengikutnya membuat kapal, sebenarnya Nabi Nuh AS sudah memberitahu kepada mereka kaum kafir bahwa akan ada banjir bandang yang sangat besar yang bisa menenggelamkan seluruh manusia. Namun, kaum kafir itu tetap tidak percaya apa yang dikatakan oleh Nabi Nuh AS. Bahkan, anak dari beliau juga tidak percaya dengan apa yang dikatakan oleh ayahnya dan lebih memilih untuk menjadi kaum kafir karena bisikan syaitan dan hasutan dari kaum kafir itu.\nKapal yang sudah selesai dibuat oleh Nabi Nuh AS dan para pengikutnya, kemudian Nabi Nuh AS menerima wahyu dari Allah, “Siap-siaplah engkau dengan kapalmu, bila tiba perintah-Ku dan terlihat tangda-tanda daripada-Ku maka segeralah angkut bersamamu di dalam kapalmu dan kerabatmu dan bawalah dua pasang dari setiap jenis makhluk yang ada di atas bumi dan berlayarlah dengan izin-Ku.\nSetelah mendapatkan wahyu dari Allah, Nabi Nuh AS menunggu suatu hari akan tiba yaitu hari di mana hujan akan turun dengan sangat lebat dan banjir bandang akan tiba. Sebelum hari banjir bandang itu tiba, Nabi Nuh AS mengajak pengikutnya untuk bersiap-siap agar segera naik ke kapal. Hingga tibalah waktunya hujan turun dengan sangat deras dan air pun mulai menggenangi daratan yang rendah terlebih dahulu.\nPerlahan-lahan air yang sudah menggenangi dataran rendah mulai meninggi dan menuju ke dataran tinggi. Hingga pada akhirnya air bah itu sudah mulai menggenangi seluruh daratan dan hanya orang-orang mukmin dan pasangan makhluk hidup saja yang ada di kapal Nabi Nuh AS saja yang berhasil selamat dari air bah yang menenggelamkan seluruh daratan. Kapal Nabi Nuh AS mulai berlayar yang diiringi dengan “Bismillahi Majraha wa mursaha” melewatia air bah itu dan saat berlayar terlihat para orang-orang kafir yang berusaha untuk menyelematkan diri agar tidak terbawa air lebih jauh.\nKetika sedang berlayar di tengah-tengah air bah, Nabi Nuh AS melihat puteranya yang bernama Kan’an timbul tenggelam karena menerima azab dari Allah atas amalan perbuatan yang sudah dilakukan. Nabi Nuh AS sangat bersedih dengan kepergian anaknya yang meninggal dalam keadaa kafir, tidak beriman, dan belum mengenal Allah.\nBanjir bandang yang sudah membinasakan kaum kafir dan zalim kepada hukum Allah, mulai mengalami surut, air yang tadinya banyak, tiba-tiba sudah surut dengan cepat karena diserap oleh bumi. Setelah air bah atau banjir bandang yang sudah surut, kapal Nabi Nuh AS mulai berhenti di atas bukit “Judie”. Kemudian para orang-orang mukmin dan makhluk hidup lainnya mulai turun dari kapal yang besar itu dan mereka selamat dari air bah.\nKisah Nabi Nuh AS yang di mana air bah membinasakan seluruh kaum kafir terkandung di dalam  Al-Quran Surat Yunus ayat 73:\nفَكَذَّبُوْهُ فَنَجَّيْنٰهُ وَمَنْ مَّعَهٗ فِى الْفُلْكِ وَجَعَلْنٰهُمْ خَلٰۤىِٕفَ وَاَغْرَقْنَا الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَاۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِيْنَ\n*Kemudian mereka mendustakannya (Nuh), lalu Kami selamatkan dia dan orang yang bersamanya di dalam kapal, dan Kami jadikan mereka itu khalifah dan Kami tenggelamkan orang yang mendustakan ayat-ayat Kami. Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.*\n",
                "isi_eng": "Miracles and the Story of Noah - Every story of the Prophet that is taught during education or when told by parents will always sound fun. The stories of the Prophets and Apostles that are often told when still in school usually consist of 25 prophets and apostles. In addition to being fun, the stories of the Prophets and Apostles always have values ​​that will be very useful for everyday life. In fact, it can increase our own rewards.\nAlmost everyone must have known the story of the Prophet who was saved from a fairly large flash flood by making a boat. Not only was he saved, but his people and animals were also saved by Prophet Nuh AS.\nHowever, those who do not follow the orders of Prophet Nuh AS will drown with the flash flood that was planned by Allah S.W.T. The son of the Prophet Nuh AS also did not believe that the flash flood disaster would come, so in the end he had to drown with the flash flood.\nProphet Nuh AS is very well known for his patience even though he is hated by many people. The steadfastness, fortitude and patience of Prophet Nuh AS have been very tested because he has been preaching for 950 years to know Allah more deeply. Thanks to his patience and steadfastness in knowing Allah even though he had been hit by various kinds of calamities, Prophet Nuh AS earned the title of ulul azmi. The title Ulul Azmi is a title given to Prophets and Apostles who have extraordinary patience and fortitude. The story of Prophet Nuh AS has been explained in the Al-Quran, Surah Al-Ankabut verse 14:\nوَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَلَبِثَ فِيْهِمْ اَلْفَ سَنَةٍ اِلَّا خَمْسِيْنَ عَامًاۗ فَاَخَذَهُمُ الطُّوْفَانُ وَهُمْ ظٰلِمُوْنَ\n*And indeed We sent Noah to his people, so he lived among them a thousand years or less fifty years. So they were hit by a great flood, and they were unjust people.*\n\n<h4>The story of Prophet Nuh AS while preaching</h4>\nThe sending of Prophet Nuh AS by Allah at a time when there was a vacancy between the two messengers (fatrah) which if left alone the religious teachings that had been brought by the previous Prophet would forgotten by humans. When religious teachings are abandoned, then humans return to committing various kinds of sins, such as committing immoralities, committing evil deeds, and abandoning good deeds.\nDuring the fatrah, Prophet Nuh AS received a prophetic revelation from Allah to provide the teachings of the Islamic religion. At that time, the people of Prophet Noah (AS) did not worship Allah but instead worshipped idols made by the hands of humans or the people of Prophet Noah (AS). They believed that the idols that had been made and worshipped would provide many good things and benefits. , and they also believe that idol statues can ward off all kinds of bad things in the future. Based on the beliefs of the people of Prophet Noah at that time, the idol statues that had been made and the names of the statues came from the names of the scholars who lived in previous period. They made and gave names based on the names of previous scholars with the reason to commemorate the services of these scholars and the spirit of worship of previous people. The names of the idol statues made by the people of Prophet Nuh AS who did not know Allah, such as Wadd, and Suda, Yatuq and Nasr .\nAt the time when a people believed in idols, Prophet Nuh AS was sent by Allah to convince the people to follow Allah's teachings and not worship idols. Prophet Nuh AS had an extraordinary ability when arguing with other people. This is because Prophet Nuh AS had an intelligent mind and the ability to speak politely, well and patiently in arguing.\nProphet Nuh AS who was sent by Allah always tried to convince his people to no longer worship idols and invited his people to return to Allah's teachings. Prophet Nuh AS never gave up on awakening his people and he always looked for various ways such as preaching. However, his disobedient people rejected Prophet Nuh AS's invitation. This is contained in the Al-Quran, Surah Al-A'raf verse 59:\nلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اِنِّيْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ\n*Indeed, We sent Noah to his people, and he said: O my people, worship Allah, there is no god for you but Him. Indeed (if you do not worship Allah), I am afraid that punishment will befall you on the great day (Doomsday).*\nThe preaching of Prophet Nuh AS was in the form of an invitation to his people to see and feel everything on the face of this earth is God's creation, starting from the sun, moon, and stars. Not only that, plants, animals, and flowing water that can be enjoyed and felt by humans are included in God's creation. The change of day and night and the things on the face of the earth are real evidence that God really exists and God is the one who must be worshiped, not the idols that are worshiped.\nNot only did he provide evidence of the signs of Allah's greatness, Prophet Nuh AS also preached that every action carried out by humans will be rewarded by Allah. If the deeds carried out are good and obey God's commands, then humans will get heaven. Meanwhile, if the deeds carried out are bad or do not carry out Allah's commands, then the reward will be hell.\nThe patience, fortitude and determination of Prophet Nuh AS in spreading the teachings of Allah's religion through da'wah were always rejected by the majority of Prophet Nuh AS. Even though many people reject Allah's teachings, there are still people who accept the invitation of Prophet Nuh AS to follow Allah's teachings.\nFor 950 years, Prophet Nuh AS always preached so that his people would not walk on the wrong path which could harm themselves because they would be punished. by Allah. His invitations in his preaching were always related to not worshiping idols and returning to worshiping Allah Almighty. By inviting his people to worship Allah, Prophet Nuh AS really hoped that his people would return to the right and bright path. In addition, Prophet Nuh AS also taught his people to always love and help each other. He also struggled very hard so that The arrogant nature possessed by humans with a high enough position so that they can eliminate these bad traits and replace them with giving love. However, the struggle that was carried out with patience and steadfastness that was carried out by Prophet Nuh AS to make his people aware of returning to the right path true and clear it still did not work. The majority of his people did not believe in the invitation from Prophet Noah AS to worship Allah and believe in Allah. There were only a few people who wanted to accept the invitation from Prophet Noah AS and even then it was not even a hundred people.\n\n<h4>Prophet Noah AS Makes a Ship</h4>\nAfter struggling to make his people aware so that they no longer worship idols for hundreds of years, even almost a thousand years, Prophet Noah AS received an order from Allah to immediately make a very large ship that could accommodate humans (his followers) and animals. Those who accepted Prophet Noah AS's invitation began to make the large ship that had been ordered by Allah by collecting the materials needed to make the ship.\nThose who made the ship chose a place far from the crowds and far from the city. They were very enthusiastic in making this ship, so that day and night were used to complete the large ship that had been ordered by Allah. The reason Prophet Noah AS made the ship far from the city and the crowds was so that not many people would know and Prophet Noah AS and the humans who accepted his invitation could work on making the ship in peace.\nAlthough Prophet Noah AS had tried to stay away from the crowds and hoped that there would be no disturbance from other people, the making of the ship was finally seen by humans who did not accept Prophet Noah AS's invitation. They insulted and mocked the making of the large ship that had been ordered by Allah. The mocking and insulting words uttered by the people who did not obey the teachings of Allah were only replied to casually by Prophet Nuh AS, \"For those of you who insult and mock us, the time will come when you will be punished by Allah for the deeds you have done.\" Although Prophet Nuh AS received insults and ridicule from them, he continued to build the large ship that Allah had ordered. Prophet Nuh AS and his followers remained enthusiastic in working on the large ship, until finally the large ship was successfully built and they were very happy because they had succeeded in carrying out Allah's command.\n\n<h4>Flash Flood</h4>\nWhen those who insulted Prophet Nuh AS and his followers made the ship, Prophet Nuh AS had actually told the infidels that there would be a very large flash flood that could drown all humans. However, the infidels still did not believe what Prophet Nuh AS said. In fact, his son also did not believe what his father said and preferred to become an infidel because of the whispers of the devil and the instigation of the infidels.\nThe ship that had been completed was made by Prophet Nuh AS and his followers, then Prophet Nuh AS received a revelation from Allah, \"Get ready with your ship, when My command comes and signs from Me are seen, then immediately carry with you in the ship you and your relatives and bring two pairs of each type of creature who is on the earth and sail with My permission.\nAfter receiving a revelation from Allah, Prophet Nuh AS waited for a day to come, namely a day when the rain would fall very heavily and a flash flood would arrive. Before the day of the flash flood arrived, Prophet Nuh AS invited his followers to get ready to immediately board the ship. Until the time came when the rain fell very heavily and the water began to inundate the lowlands first.\nSlowly the water that had inundated the lowlands began to rise and head towards the highlands. Until finally the flood waters had begun to inundate the entire land and only the believers and living creature partners on the ship of the Prophet Noah AS managed to survive the flood which drowned the entire land. The ship of Prophet Nuh AS began to sail accompanied by \"Bismillahi Majraha wa mursaha\" through the flood waters and as it sailed, he saw infidels trying to save themselves so as not to be carried further by the water. Prophet Nuh AS was very saddened by the loss of his son, who died while being a disbeliever, not a believer, and not yet knowing Allah.\nThe flash flood which had destroyed the infidels and those who were unjust to Allah's law, began to recede, the water which was previously abundant, suddenly receded quickly because it was absorbed by the earth. After the flood or flash flood had receded, the Prophet Noah's ship AS began to stop on the \"Judie\" hill. Then the believers and other living creatures began to descend from the large ship and they survived the flood.\nThe story of the Prophet Nuh AS, where the flood destroyed all the unbelievers, is contained in the Al-Quran, Surah Yunus verse 73:\nفَكَذَّبُوْهُ فَنَجَّيْنٰهُ وَمَنْ مَّعَهٗ فِى الْفُلْكِ وَجَعَلْنٰهُمْ خَلٰۤىِٕفَ وَاَغْرَقْنَا الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَاۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِيْنَ\n*Then they lied about him (Noah), then We saved him and those with him in the ship, and We made them caliphs and We drowned those who belied Our verses. So pay attention to the outcome of those who were warned.*\n"
            },
            {
                "no": 4,
                "name_id": "Nabi Hud AS",
                "name_eng": "Prophet Hud  AS",
                "arab": "هد عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Hud.png",
                "isi": "Nabi Hud Alaihissalam merupakan salah satu dari 25 Nabi utusan Allah Ta’ala yang menerima wahyu untuk dirinya sendiri. Nabi Hud ‘alaihissalam yang merupakan nabi ke-empat ini berasal dari bangsa Arab, tepatnya suku ‘Ad. Diriwayatkan dari Abu Dzar, nabi-nabi lain yang berasal dari bangsa Arab selain Nabi Hud ‘alaihissalam adalah, Nabi Saleh ‘alaihissalam, Nabi Syu’aib ‘alaihissalam, dan Nabi Muhammad Shallallahu ‘alaihi wa sallam.\nSejak kecil Nabi Hud ‘alaihissalam dikenal sebagai sosok yang memiliki perilaku sangat terpuji diantaranya, jujur, amanah, berbudi pekerti luhur, bekerja keras, serta sangat bijaksana dan ramah dalam bergaul dengan kawan-kawan sepantaran di sekelilingnya.\nKisah tentang kehidupan dan perjalanan dakwah Nabi Hud ‘alaihissalam sendiri banyak disebutkan di dalam  Al-Qur’an. Nama “Hud” bahkan diabadikan sebagai nama salah satu surat di Al-Qur’an, yakni surat ke-sebelas. Seperti diriwayatkan dalam Al-Qur’an Surat Hud ayat 50 yang menyebutkan tentang Nabi Hud ‘alaihissalam dan kaum ‘Ad.\n*“Dan kepada kaum ‘Ad (Kami utus) saudara mereka, Hud. Dia berkata, ‘Wahai kaumku! Sembahlah Allah, tidak ada tuhan bagimu selain Dia. (Selama ini) kamu hanyalah mengada-ada.’” (Q.S. Hud ayat 50).*\n*“Wahai kaumku! Aku tidak meminta imbalan kepadamu atas (Seruanku) ini. Imbalanku hanyalah dari Allah yang telah menciptakanku. Tidakkah kamu mengerti?” (Q.S. Hud ayat 51).*\nSemasa hidupnya Nabi Hud ‘alaihissalam menempati sebuah daerah yang disebut dengan Al-Ahqaf, tepatnya di sebelah utara Hadramaut, berada diantara Yaman dan Oman. Hadramaut adalah sebuah daerah yang sangat indah karena memiliki tanah yang subur.\nBanyak hasil pertanian yang tumbuh dengan baik dari tanah subur Hadramaut. Selain diyakini sebagai tanah kelahiran Nabi Hud ‘alaihissalam, Hadramaut juga diyakini sebagai daerah dimana Nabi Saleh AS dilahirkan.\nBukan hanya menyimpan fakta sebagai tanah kelahiran Nabi Hud ‘alaihissalam dan Nabi Saleh ‘alaihissalam, tetapi Hadramaut juga menyimpan keistimewaan lain yaitu terdapat bangunan suci umat Islam yang disebut dengan Qabr Hud (Makam Hud). Di dekat Qabr Hud terdapat sebuah masjid yang selalu ramai dikunjungi peziarah, terutama pada tanggal 11 Sya’ban.\nSejarah Nabi Hud ‘alaihissalam sangat erat kaitannya dengan kaum ‘Ad yaitu kaum yang hidup di zaman Nabi Hud ‘alaihissalam dan merupakan kaum tertua setelah dibinasakannya kaum yang dzolim kepada Nabi Nuh ‘alaihissalam.\nDiriwayatkan, Nabi Hud ‘alaihissalam adalah cucu dari Nabi Nuh ‘alaihissalam atau bisa disebut juga merupakan keturunan dari Sam bin Nuh (kaum ‘Ad). Kaum ‘Ad yang hidup di zaman Nabi Hud ‘alaihissalam dikenal sebagai kaum yang hidup dengan amat nyaman dan sejahtera.\nKehidupan mereka makmur karena dilimpahi dengan ladang pertanian yang terhampar subur nan hijau, hewan ternak yang sehat dan banyak, serta aliran air yang melimpah dan segar. Selain itu, perawakan tubuh kaum ‘Ad juga diketahui besar dan kuat sehingga sangat menguntungkan mereka dalam bekerja sehari-harinya.\nNamun kenikmatan dan berbagai berkah yang dilimpahkan kepada kaum ‘Ad tidak serta merta membuat mereka bersyukur dan menyembah Allah Ta’ala. Kaum ‘Ad tidak mengenal Allah Ta’ala sebagai Tuhan mereka, sama seperti yang dilakukan oleh kaum sebelum mereka (kaum Nabi Nuh). Mereka menyembah patung buatan mereka sendiri dan diberi nama dengan Shamud dan Alhattar.\n\n<h4>Perjalanan Dakwah Nabi Hud</h4>\nTarget utama dari dakwah yang dilakukan oleh Nabi Hud ‘alaihissalam adalah Kaum ‘Ad yang bermukim di sekitar tempat tinggal Nabi Hud ‘alaihissalam, yaitu di Al-Ahqaf. Tugas Nabi Hud ‘alaihissalam untuk menyerukan ajaran agar menyembah Allah Ta’ala dan menghindari perbuatan musyrik. Kaum ‘Ad dikenal menyembah patung berhala yang mereka buat sendiri. Seperti ditunjukkan dalam Al-Qur’an Surat Hud ayat 52.\n*“Dan (Hud berkata), ‘Wahai kaumku! Mohonlah ampunan kepada Tuhanmu lalu bertobatlah kepada-Nya, niscaya Dia menurunkan hujan yang sangat deras, Dia akan menambahkan kekuatan di atas kekuatanmu, dan janganlah kamu berpaling menjadi orang yang berdosa.’” (Q.S. Hud ayat 52).*\n\n<h4>Kisah Nabi Hud Diutus sebagai Penolong bagi Kaum ‘Ad</h4>\nKeringat dan usaha tiada henti yang diperjuangkan oleh Nabi Hud ‘alaihissalam dalam menyerukan kebaikan kepada kaum ‘Ad selain diabadikan ke dalam  Al-Qur’an surat Hud, juga diabadikan dalam surat Asy-Syu’ara ayat 128-135.\nNabi Hud ‘alaihissalam menyeru kepada kaum ‘Ad untuk meninggalkan patung berhala yang mereka sembah dan beralih menyembah kepada Allah Ta’ala. Nabi Hud ‘alaihissalam pun menunjukkan bukti-bukti kekuasaan dan keesaan Allah Ta’ala kepada kaum ‘Ad agar mereka dapat memilih ke jalan yang benar.\nNamun kaum ‘Ad sama sekali tidak mempercayai Nabi Hud ‘alaihissalam dan tidak mau meninggalkan sesembahan mereka. Bahkan kaum ‘Ad menuduh Nabi Hud ‘alaihissalam sudah terkena penyakit gila.\n*“Mereka (kaum ‘Ad) berkata, ‘Wahai Hud! Engkau tidak mendatangkan suatu bukti yang nyata kepada kami, dan kami tidak akan meninggalkan sesembahan kami karena perkataanmu dan kami tidak akan mempercayaimu, kami hanya mengatakan bahwa sebagian sesembahan kami telah menimpakan penyakit gila atas dirimu.’ Dia (Hud) menjawab, ‘Sesungguhnya aku bersaksi kepada Allah dan saksikanlah bahwa aku berlepas diri dari apa yang kamu persekutukan.’” (Q.S. Hud ayat 54).*\n\n<h4>Balasan Azab Kepada Kaum ‘Ad yang Ingkar</h4>\nBuntut dari perilaku kaum ‘Ad yang tamak dan sombong serta menentang Nabi Hud ‘alaihissalam, maka Allah Ta’ala memberikan peringatan kepada mereka berupa kekeringan yang panjang. Musibah kekeringan yang menimpa kaum ‘Ad ini sempat membuat mereka resah dan khawatir.\nMereka takut pertanian mereka gagal panen sehingga menyebabkan kelaparan. Celah tersebut yang dimanfaatkan oleh Nabi Hud ‘alaihissalam untuk meyakinkan kaum ‘Ad agar meninggalkan berhala dan berpaling untuk bertaubat dan menyembah Allah Ta’ala.\nNamun perkataan Nabi Hud ‘alaihissalam benar-benar tidak dihiraukan sama sekali oleh mereka. Sesuai yang tertuang dalam Al-Qur’an surat Al-A’raf ayat 70.\n*“Mereka berkata, ‘Apakah kedatanganmu kepada kami, agar kami hanya menyembah kepada Allah saja dan meninggalkan apa yang biasa disembah oleh nenek moyang kami? Maka buktikanlah ancamanmu kepada kami, jika kamu benar!’” (Q.S. Al-A’raf ayat 70).*\nAkibat dari keras kepalanya kaum ‘Ad yang terus menerus menentang Nabi Hud ‘alaihissalam dan menyekutukan Allah Ta’ala, maka selanjutnya Allah menunjukkan kuasa-Nya dengan mendatangkan gumpalan awan hitam nan pekat.\nPara kaum ‘Ad berseru gembira karena mengira awan tersebut adalah pertanda datangnya hujan yang akan menyelamatkan ladang dan pertanian mereka dari kekeringan.\nNamun, di tengah sorak sorai kaum ‘Ad yang berbahagia atas kedatangan awan tersebut, Nabi Hud ‘alaihissalam memberi peringatan bahwa awan hitam yang datang bukanlah pertanda baik akan turunnya hujan.\nMelainkan pertanda buruk akan datangnya azab dari Allah Ta’ala kepada kaum ‘Ad karena telah menyekutukan Allah Ta’ala. Tetapi sekali lagi peringatan yang disampaikan oleh Nabi Hud ‘alaihissalam tidak dihiraukan oleh mereka. Kaum ‘Ad tetap tidak mau mempercayai segala perkataan dan meminta bukti atas peringatan Nabi Hud ‘alaihissalam.\nHingga akhirnya Allah Ta’ala sebagai sang Kuasa benar-benar menjatuhkan azab kepada kaum ‘Ad dengan datangnya angin topan secara dahsyat. Angin topan tersebut langsung merobohkan dan menyapu apa saja yang ada seperti rumah, bangunan, berhala, ladang, hewan ternak, dan berbagai harta benda lainnya milik kaum ‘Ad.\nAngin topan kencang tersebut akhirnya mampu membinasakan kaum ‘Ad beserta berhala-berhala yang mereka sembah. Saking dahsyatnya, diriwayatkan bahwa angin yang berlangsung selama delapan hari tujuh malam tersebut telah menghancurkan segalanya seperti serbuk. Kisah tentang angin topan yang menimpa kaum ‘Ad diceritakan dalam surat Al-Haqqah ayat 6-8.\n*“Sedangkan Kaum ‘Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin. Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus menerus; maka kamu melihat Kaum ‘Ad pada waktu itu mati bergelimpangan, seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka?” (Q.S. Al-Haqqah ayat 6-8).*\nLalu ketika terjadi bencana angin topan dahsyat yang menimpa kaum ‘Ad, apakah yang terjadi kepada Nabi Hud ‘alaihissalam dan para pengikutnya? Tentu saja mereka diselamatkan oleh Allah Ta’ala.\nNabi Hud ‘alaihissalam dan para pengikutnya tetap berdiam di rumah tanpa merasakan sedikitpun bahaya dari angin topan tersebut. Setelah kejadian yang menimpa kaum ‘Ad, akhirnya Nabi Hud ‘alaihissalam dan para pengikutnya berpindah ke daerah Hadramaut untuk menetap di sana hingga beliau menghembuskan nafas terakhirnya.\n",
                "isi_eng": "Prophet Hud Alaihissalam is one of the 25 prophets sent by Allah Ta'ala who received revelation for himself. Prophet Hud 'alaihissalam who is the fourth prophet came from the Arab nation, precisely the tribe of 'Ad. Narrated from Abu Dzar, other prophets from the Arabs besides Prophet Hud 'alaihissalam were, Prophet Saleh 'alaihissalam, Prophet Syu'aib 'alaihissalam, and Prophet Muhammad sallallaahu 'alaihi wa sallam.\nSince childhood, Prophet Hud 'alaihissalam was known as a figure who had very commendable behavior, including being honest, trustworthy, having noble character, working hard, and being very wise and friendly in socializing with friends of the same age around him.\nThe story of the life and journey of the Prophet Hud 'alaihissalam himself is mentioned a lot in the Qur'an. The name \"Hud\" is even immortalized as the name of one of the chapters in the Qur'an, namely the eleventh chapter. As narrated in the Qur'an, Surah Hud verse 50 which mentions the Prophet Hud 'alaihissalam and the people of 'Ad.\n*“And to the people of 'Ad (We sent) their brother, Hud. He said, 'O my people! Worship Allah, there is no god for you but Him. (All this time) you were just making things up.'” (Q.S. Hud verse 50).*\n*“O my people! I do not ask you in return for this (My Call). My reward is only from Allah who created me. Don't you understand?” (Q.S. Hud verse 51).*\nDuring his lifetime, Prophet Hud 'alaihissalam occupied an area called Al-Ahqaf, precisely to the north of Hadramaut, between Yemen and Oman. Hadramaut is a very beautiful area because it has fertile soil.\nMany agricultural products grow well from the fertile soil of Hadramaut. Apart from being believed to be the birthplace of the Prophet Hud 'alaihissalam, Hadramaut is also believed to be the area where the Prophet Saleh AS was born.\nNot only does it hold the fact as the birthplace of Prophet Hud 'alaihissalam and Prophet Saleh 'alaihissalam, but Hadramaut also holds another specialty, namely the existence of a holy building for Muslims called Qabr Hud (Hud's Tomb). Near Qabr Hud there is a mosque that is always crowded with pilgrims, especially on the 11th of Sha'ban.\nThe history of Prophet Hud 'alaihissalam is very closely related to the 'Ad people, namely the people who lived in the time of Prophet Hud 'alaihissalam and were the oldest people after the destruction of the people who were unjust to Prophet Nuh 'alaihissalam.\nIt is reported that the Prophet Hud 'alaihissalam was the grandson of the Prophet Nuh 'alaihissalam or it could also be said that he was a descendant of Sam bin Nuh (the people of 'Ad). The 'Ad people who lived in the time of the Prophet Hud 'alaihissalam were known as a people who lived very comfortably and prosperously.\nTheir lives are prosperous because they are blessed with fertile and green agricultural fields, healthy and abundant livestock, and abundant and fresh water flows. Apart from that, the body shape of the 'Ad people is also known to be large and strong, which is very beneficial for them in their daily work.\nHowever, the pleasures and various blessings bestowed upon the people of 'Ad do not necessarily make them grateful and worship Allah Ta'ala. The 'Ad people did not recognize Allah Ta'ala as their God, just as did the people before them (the people of Prophet Noah). They worshiped statues they made themselves and named them Shamud and Alhattar.\n\n<h4>Prophet Hud's Journey of Preaching</h4>\nThe main target of the da'wah carried out by Prophet Hud 'alaihissalam was the 'Ad people who lived around where Prophet Hud 'alaihissalam lived, namely in Al-Ahqaf. The task of the Prophet Hud 'alaihissalam was to preach the teachings to worship Allah Ta'ala and avoid idolatrous acts. The 'Ad were known to worship idols that they made themselves. As shown in the Al-Qur'an Surah Hud verse 52.\n*“And (Hud said), 'O my people! Ask your Lord for forgiveness and then repent to Him, surely He will send down very heavy rain, He will add strength to your strength, and do not turn to be a sinner.'” (Q.S. Hud verse 52).*\n\n<h4>The story of the Prophet Hud being sent as a helper to the 'Ad people</h4>\nThe sweat and endless efforts fought by the Prophet Hud 'alaihissalam in calling for goodness to the 'Ad people, apart from being enshrined in the Al-Qur'an, Surah Hud, are also immortalized in Surah Asy-Syu'ara verses 128-135.\nThe Prophet Hud 'alaihissalam called on the people of 'Ad to leave the idols they worshiped and turn to worship Allah Ta'ala. The Prophet Hud 'alaihissalam also showed evidence of the power and oneness of Allah Ta'ala to the people of 'Ad so that they could choose the right path.\nHowever, the people of 'Ad did not believe in the Prophet Hud 'alaihissalam at all and did not want to abandon their god. Even the 'Ad people accused the Prophet Hud 'alaihissalam of being mad.\n*“They (the people of ‘Ad) said, ‘O Hud! You have not brought us any clear proof, and we will not abandon our gods because of what you say, nor will we believe you, we only say that some of our gods have afflicted you with madness.’ He (Hud) said, ‘I bear witness to Allah, and bear witness that I am free from what you associate with others.’” (Q.S. Hud verse 54).*\n\n<h4>Punishment Reply to the 'Ad Who Disobey</h4>\nAs a result of the greedy and arrogant behavior of the 'Ad people and their opposition to Prophet Hud 'alaihissalam, Allah Ta'ala gave them a warning in the form of a long drought. The drought disaster that befell the 'Ad people made them restless and worried.\nThey are afraid that their crops will fail, causing famine. This loophole was exploited by the Prophet Hud 'alaihissalam to convince the people of 'Ad to abandon idols and turn to repent and worship Allah Ta'ala.\nBut the words of Prophet Hud 'alaihissalam were completely ignored by them. As stated in the Qur'an, Al-A'raf verse 70.\n*\"They said, 'Did you come to us, so that we worship Allah alone and abandon what our ancestors used to worship? So prove your threat to us, if you are right!'” (Q.S. Al-A'raf verse 70).*\nAs a result of the stubbornness of the 'Ad people who continuously opposed the Prophet Hud 'alaihissalam and associated partners with Allah Ta'ala, then Allah then showed His power by bringing thick, black clouds.\nThe people of 'Ad shouted happily because they thought the cloud was a sign of the coming rain which would save their fields and agriculture from drought.\nHowever, amidst the cheers of the 'Ad people who were happy about the arrival of the cloud, Prophet Hud 'alaihis salaam gave a warning that the black cloud that was coming was not a good sign that it would rain.\nBut it is a bad sign that punishment will come from Allah Ta'ala to the people of 'Ad because they have associated partners with Allah Ta'ala. But once again the warning given by the Prophet Hud 'alaihissalam was ignored by them. The 'Ad people still do not want to believe everything they say and ask for proof of the warnings of the Prophet Hud 'alaihissalam.\nUntil finally Allah Ta'ala as the Almighty truly punished the people of 'Ad with the arrival of a terrible hurricane. The hurricane immediately destroyed and swept away everything there was such as houses, buildings, idols, fields, livestock, and various other possessions belonging to the people of 'Ad.\nThis strong typhoon was finally able to destroy the 'Ad people and the idols they worshipped. It was so powerful, it is said that the wind that lasted for eight days and seven nights destroyed everything like powder. The story of the typhoon that hit the people of 'Ad is told in Surah Al-Haqqah verses 6-8.\n*\"As for the people of 'Ad, they were destroyed by a very cold typhoon. Allah inflicted this wind on them for seven nights and eight days continuously; then you saw the people of 'Ad at that time lying dead, like empty (decayed) palm tree trunks. So do you see anyone left among them?” (Q.S. Al-Haqqah verse 6-8).*\nThen when the terrible hurricane disaster struck the people of ‘Ad, what happened to Prophet Hud ‘alaihissalam and his followers? Of course they were saved by Allah Ta’ala.\nProphet Hud 'alaihissalam and his followers remained at home without feeling the slightest danger from the typhoon. After the incident that happened to the 'Ad people, finally the Prophet Hud 'alaihissalam and his followers moved to the Hadramaut area to live there until he breathed his last breath.\n"
            },
            {
                "no": 5,
                "name_id": "Nabi Sholeh AS",
                "name_eng": "Prophet Sholeh AS",
                "arab": "شوله عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Sholeh.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 6,
                "name_id": "Nabi Ibrahim AS",
                "name_eng": "Prophet Abraham AS",
                "arab": "ابراهيم عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ibrahim.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 7,
                "name_id": "Nabi Ismail AS",
                "name_eng": "Prophet Ishmael AS",
                "arab": "اسماعيل عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ismail.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 8,
                "name_id": "Nabi Luth AS",
                "name_eng": "Prophet Lut AS",
                "arab": "لوط عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/luth.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 9,
                "name_id": "Nabi Ishaq AS",
                "name_eng": "Prophet Isaac AS",
                "arab": "اسحق عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ishaq.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 10,
                "name_id": "Nabi Yaqub AS",
                "name_eng": "Prophet Jacob AS",
                "arab": "يعقوب عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yaqub.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 11,
                "name_id": "Nabi Yusuf AS",
                "name_eng": "Prophet Joseph AS",
                "arab": "يوسف عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yusuf.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 12,
                "name_id": "Nabi Syu'aib AS",
                "name_eng": "Prophet Syu'aib AS",
                "arab": "صعيب عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/syuaib.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 13,
                "name_id": "Nabi Ayyub AS",
                "name_eng": "Prophet Ayyub AS",
                "arab": "أيوب عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ayyub.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 14,
                "name_id": "Nabi Dzulkifli AS",
                "name_eng": "Prophet Dzulkifli AS",
                "arab": "ذول الكفل عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/dzulkifli.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 15,
                "name_id": "Nabi Musa AS",
                "name_eng": "Prophet Moses AS",
                "arab": "موسى عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/musa.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 16,
                "name_id": "Nabi Harun AS",
                "name_eng": "Prophet Aaron AS",
                "arab": "هارون عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/harun.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 17,
                "name_id": "Nabi Daud AS",
                "name_eng": "Prophet David AS",
                "arab": "داود عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/daud.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 18,
                "name_id": "Nabi Sulaiman AS",
                "name_eng": "Prophet Solomon AS",
                "arab": "سليمان عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/sulaiman.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 19,
                "name_id": "Nabi Ilyas AS",
                "name_eng": "Prophet Elias AS",
                "arab": "الياس عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ilyas.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 20,
                "name_id": "Nabi Ilyasa' AS",
                "name_eng": "Prophet Elisha AS",
                "arab": "إليسا عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/ilyasa.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 21,
                "name_id": "Nabi Yunus AS",
                "name_eng": "Prophet Jonah AS",
                "arab": "يونس عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yunus.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 22,
                "name_id": "Nabi Zakariya AS",
                "name_eng": "Prophet Zachariah AS",
                "arab": "زكريا عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/zakaria.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 23,
                "name_id": "Nabi Yahya AS",
                "name_eng": "Prophet Yahya AS",
                "arab": "يحيى عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/yahya.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 24,
                "name_id": "Nabi Isa AS",
                "name_eng": "Prophet Isa(Jesus) AS",
                "arab": "عيسى عليه السلام",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/isa.png",
                "isi": "",
                "isi_eng": ""
            },
            {
                "no": 25,
                "name_id": "Nabi Muhammad ﷺ",
                "name_eng": "Prophet Muhammad ﷺ",
                "arab": "محمد ﷺ",
                "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/Rasulullah.png",
                "isi": "",
                "isi_eng": ""
            }
        ],
        "lain": [
            {
                "no": 1,
                "judul": "",
                "judul_eng": "",
                "gambar": "",
                "isi": "",
                "isi_eng": ""
            }
        ]
    }
}
