{
    "nabi" : [
        {
            "no" : 1,
            "kategori": "Kisah Nabi",
            "judul": "Kisah Nabi Adam Bertawasul pada Nabi Muhammad ﷺ",
            "isi": "Tawasul secara bahasa berasal dari kata wasilah yang berarti perantara. Menurut Sayyid Muhammad bin Alawi al-Maliki wasilah adalah setiap sesuatu yang dijadikan Allah Swt sebagai sebab untuk lebih bisa dekat dengan-Nya sekaligus perantara untuk terkabulnya hajat. Ada kisah Nabi Adam bertawasul pada Nabi Muhammad.<br><br>Sebelum itu, mari kita simak firman Allah Swt dalam Al-Qur’an surah al-Maidah ayat 35:<br><br>يَاأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُوا فِي سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ<br><br><i>Wahai orang-orang yang beriman! Bertakwalah kepada Allah dan carilah wasilah (jalan) untuk mendekatkan diri kepada-Nya, dan berjihadlah (berjuanglah) di jalan-Nya, agar kamu beruntung.</i><br><br>Pada hakikatnya, esensi dari tawasul sendiri adalah berdoa kepada Allah Swt dengan menggunakan perantara. Tujuan dari doa adalah Allah Swt karena Ialah satu-satunya dzat yang berhak dimintai pertolongan. Sementara, sesuatu yang dijadikan media  bertawasul -bisa nabi, orang shalih, maupun amal perbuatan- hanyalah  perantara untuk mendekatkan diri kita kepada Allah Swt sehingga doa yang kita panjatkan bisa diijabah.<br><br>Tawasul sudah ada sejak dahulu kala, bahkan sebelum manusia turun ke muka bumi. Ada sebuah kisah tentang tawasul yang dilakukan oleh manusia pertama Nabi Adam a.s saat beliau masih ada di dalam surga. Kisah ini disebutkan dalam sebuah hadis yang diriwayatkan Imam al-Hakim dalam kitab al-Mustadrak-nya. Bunyi hadisnya adalah sebagai berikut:<br><br>عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ” لَمَّا اقْتَرَفَ آدَمُ الْخَطِيئَةَ قَالَ: يَا رَبِّ أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ لَمَا غَفَرْتَ لِي، فَقَالَ اللَّهُ: يَا آدَمُ، وَكَيْفَ عَرَفْتَ مُحَمَّدًا وَلَمْ أَخْلُقْهُ؟ قَالَ: يَا رَبِّ، لِأَنَّكَ لَمَّا خَلَقْتَنِي بِيَدِكَ وَنَفَخْتَ فِيَّ مِنْ رُوحِكَ رَفَعْتُ رَأْسِي فَرَأَيْتُ عَلَىَ قَوَائِمِ الْعَرْشِ مَكْتُوبًا لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ فَعَلِمْتُ أَنَّكَ لَمْ تُضِفْ إِلَى اسْمِكَ إِلَّا أَحَبَّ الْخَلْقِ إِلَيْكَ، فَقَالَ اللَّهُ: صَدَقْتَ يَا آدَمُ، إِنَّهُ لَأَحَبُّ الْخَلْقِ إِلَيَّ ادْعُنِي بِحَقِّهِ فَقَدْ غَفَرْتُ لَكَ وَلَوْلَا مُحَمَّدٌ مَا خَلَقْتُكَ<br><br>Dalam hadis itu diceritakan bahwa tatkala nabi Adam a.s menyesali perbuatannya yang telah terbujuk rayuan iblis, nabi Adam segera bertaubat kepada Allah Swt. Beliau meminta ampun dengan menyebut nama nabi Muhammad ﷺ sebagai wasilah, padahal nabi Muhammad waktu itu belum lahir ke dunia. Nabi Adam berucap :<br><br><i>“Wahai Tuhanku, dengan derajat yang ada pada Muhammad, aku meminta kepada-Mu agar engkau memafkan aku.”</i><br><br>Allah Swt lantas bertanya:<br><br><i>“Wahai Adam darimana engkau mengetahui Muhammad sementara Aku belum menciptakannya?”</i><br><br>Nabi Adam a.s menjawab bahwa ia mengetahui nama Nabi Muhammad ﷺ tatkala Allah Swt baru saja menciptakan Nabi Adam dan meniupkan ruh kedalamnya. Saat itu  Nabi Adam melihat tiang-tiang penyangga Arsy yang bertuliskan <i>La ilaha illallah Muhammadur Rasulullah.</i><br><br><i>“Wahai Tuhanku, ketika Engkau menciptakan aku, dan Engkau meniupkan ruh-Mu kepadaku, aku mengangkat kepalaku dan aku melihat pada tiang-tiang penyangga arsy terdapat tulisan Laa ilaha illa Allah Muhammad rasulullah. Dari sana aku paham bahwa Engkau tak mungkin menyadarkan nama-Mu dengan sesuatu yang lain kecuali sesuatu itu merupakan makhluk yang paling dicintai disisi-Mu.”</i><br><br>Nabi Adam berhasil mendapat ampunan Allah Swt berkat tawasul yang ia lakukan kepada nabi Muhammad ini. Allah Swt membenarkan nabi Adam dan menerima taubat beliau.<br><br><i>“Engkau benar wahai Adam. Sesungguhnya Muhammad adalah makhluk yang paling aku cintai. Engkau berdoa kepadaku dengan kedudukan yang ada padanya maka aku sungguh telah mengampunimu. Seandainya tidak ada Muhammad niscaya aku tidak akan menciptakanmu.”</i><br><br>Selain Imam al-Hakim hadis ini juga diriwayatkan oleh beberapa ulama lainnya seperti Imam as-Suyuthi dalam kitab al- Khashaish an-Nubuwwah, Imam al-Qashthalani dalam Syarh al- Mawahib ad-Diniyyah, dan Imam as-Subki dalam kitab Syifa’u as-Saqam. Mereka semua menganggap hadis ini merupakan hadis yang shahih.<br><br>Begitulah kisah tentang tawasul yang dilakukan nabi Adam as kepada nabi Muhammad ﷺ. Seperti yang dikatakan oleh Sayyid Muhammad Alawi al-Maliki diatas bahwa tawasul merupakan salah satu jalan untuk dikabulkannya hajat dan sarana untuk mendekatkan diri kita kepada Allah Swt. Sebagai umatnya, kita seharusnya lebih dianjurkan untuk melakukan tawasul kepada junjungan kita nabi Muhammad ﷺ. Hal ini dibenarkan selagi cara yang kita lakukan berada dalam jalur kebenaran yakni hanya menjadikan nabi Muhammad ﷺ sebagai perantara, sementara tempat meminta hanya kepada Allah Swt semata. Wallahu A’lam."
        }
    ]
}
