{
    "version": 1,
    "lain": [
        {
            "no" : 1,
            "kategori": "Kisah Lain",
            "judul": "Kisah Dzulqarnain dalam Al-Quran, Raja yang Saleh dan Bijaksana",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/rajaDzulkarnain.png",
            "isi": "<h4>Kisah Dzulqarnain dalam Al-Quran, Raja yang Saleh dan Bijaksana</h4>\nCerita umat terdahulu sering dikisahkan dalam Al-Qur’an. Hal itu tidak lain bertujuan agar umat manusia mangembil ibrah dari kejadian masa lalu. Salah satu kisah orang saleh di masa lalu yang diceritakan Al-Quran adalah kisah Dzulqarnain. Ia diceritakan dalam Al-Quran sebagai sosok pengembara yang kuat, bijaksana, dan selalu menyeru kepada kebaikan. Rangkaian cerita Dzulqarnain ini bisa kita temukan dalam surah Al-Kahfi ayat 83-101.<br><br>Asbabun nuzul ayat ini berkenaan dengan pertanyaan dari pendeta Yahudi kepada Nabi. Mereka berskutu dengan orang Quraisy untuk menguji kenabian Rasulullah SAW. Mereka mengajukan pertanyaan perihal para pemuda yang hilang, roh, dan seorang pengembara yang telah menjelajahi wilayah Timur dan Barat. Semua pertanyaan itu dijawab oleh Allah melalui firman-Nya, dan ayat ini pun turun untuk menjawab pertanyaan mereka mengenai sosok pengembara itu yang disebut Dzulqarnain.<br><br><h4>Seorang Raja yang Saleh</h4>\nAl-Quran tidak memberikan secara detail identitas Dzulqarnain tersebut serta lokasi tinggalnya. Penjelasan dari para ulama tafsir pun berbeda-beda. Kebanyakan ulama berpendapat bahwa Dzulqarnain adalah seorang raja karena merujuk pada hadis yang bersumber dari Ibnu Ishaq.<br><br>Beberapa pendapat terdahulu mengatakan bahwa Dzulqarnain ini adalah Iskandar Al-Maqduni (Alexander dari Makedonia). Ada juga yang berpendapat bahwa ia adalah raja dari Himyar karena penyebutan Dzu. Namun dua pendapat pertama banyak dikritik dan tertolak karena bersanad lemah. Pendapat terakhir yang kuat mengatakan bahwa Dzulqarnain adalah raja dari Persia yang bernama Koresy (539-560 SM) seperti yang dikatakan Ibn ‘Asyur.<br><br>Terlepas dari berbagai macam perbedaan pendapat mengenai identitas Dzulqarnain, sifat-sifat mulianya perlu kita ulas. At-Thabari mengutip pendapat dari Atsar sebagaimana pula yang dikutip Hifnawi dari Hamid Utsman bahwa Sayyidina Ali pernah ditanya perihal Dzulqarnain, apakah ia seorang nabi ataukah malaikat? Lantas Ali pun menjawab “Bukan ini (nabi), dan bukan itu (malaikat), ia adalah seorang hamba yang saleh, yang menyeru kaumnya kepada Allah ta’ala, lalu mereka melukai kepalanya, kemudian ia menyeru lagi, namun mereka melukai kepalanya (yang sebelah lagi).” Jami’ al-Bayan (16/8), Al-Nuhas fi Ma’ani Al-Qur’an (4/283).<br><br>Menurut Ibnu Katsir Dzulqrnain adalah seorang raja yang adil dan bijaksana yang telah menjelajahi bumi bagian Timur dan Barat. Ia adalah seroang mukmin penyebar agama Allah, mempunyai banyak keajaiban atas kuasa Allah SWT. Ia mengajak penduduk negeri-negeri yang ditaklukkannya untuk beriman kepada Allah. Bidayah wa an-Nihayah (1/493).<br><br><h4>Diberikan Kelebihan Ilmu dan Kekuatan Menjelajah Bumi Allah</h4>\nSuatu ketika dalam perjalanannya ia sampai di belahan bumi bagian Barat dan ia mendapati suatu kaum. Lalu Allah pun mengilhami Dzulqarnain apakah akan menghukum mereka siksaan atau berbuat baik. Karena Dzulqarnain diberikan Allah ketajaman siyasah syar’iyyah, ia pun membuat dua keputusan pada kaum tersebut. Pada kaum yang berbuat kerusakan akan dihukum dan dikembalikan kepada Tuhannya, di mana mereka akan diazab dengan sangat pedih.<br><br>Adapun yang beriman dan beramal saleh, ia akan mendapatkan balasan yang baik, dan mereka akan mendapatkan kemudahan-kemudahan. Cerita ini termaktub dalam surah Al-Kahfi: 85-88 menunjukkan kebijaksanaan Dzulqarnain dalam membuat keputusan sesuai syara’ serta ketaqwaannya dalam menjalankan perintah Allah SWT.<br><br>Dzulqarnain kemudian melanjutkan perjalanan di bagian bumi lain yang dalam al-Quran disebut Baina al-Saddain (suatu wilayah di antara dua gunung yang sama tingginya). Di sana ia bertemu bertemu suatu kaum yang hidup ketakutan karena terancam suatu kelompok yang bernama Ya’juj dan Ma’juj sepeti yang diterangkan al-Quran surah Al-Kahfi ayat 94.<br><br>Menurut Al-Alusy Ya’juj dan Ma’juj adalah orang-orang yang membuat kerusakan di muka bumi, negeri kami, dengan membunuh dan merampas makanan apapun yang ada di muka bumi Ruh al-Ma’any (26/39). Kaum yang teraniaya tersebut mengeluhkan perihal Ya’juj dan Ma’juj tersebut kepada Dzulqarnain dan memintanya untuk membuatkan dinding pembatas antara mereka. Dzulqarnain pun akhirnya mengabulkan permintaan kaum tersebut. Hal ini semata-mata karena sifat luhurnya yang ingin memperbaiki kerusakan di muka bumi, dan sebagai bentuk rasa syukur kepada Allah atas kekuasaan yang diberikan kepadanya seperti yang telah diabadikan Allah dalam surah Al-Kahfi: 95-97.<br><br>Allah memberikan kekuasaan kepada Dzulqarnain untuk membuatkan tembok penghalang menggunakan teknologi dan pengetahuan. Tembok penghalang tersebut terbuat dari besi yang dipanaskan dengan api yang mendidih. Dengan pengetahuan tersebut tembok yang sudah jadi sangatlah kuat sehingga Ya’juj dan Ma’juj tidak bisa keluar ataupun melubanginya sampai hari kiamat nanti dan bumi menjadi debu. Mereka tidak bisa menuju negeri lain, karena tembok tersebut adalah jalan satu-satunya Futuh al-Ilahiyah (3/49).<br><br>Meskipun Dzulqarnain telah berhasil membuat proyek besar tersebut, tidak lantas kemudian hatinya menjadi congkak dan sombong karena ilmu dan kekuasaan. Justru ia merasa rendah hati karena ia tidak mau upah meski ia ditawari imbalan yang mahal. Ia merasa bahwa segala ilmu, kekuatan, dan kekuasaan yang ia miliki hanya milik Allah semata, dan akan hancur atas kehendak Allah. Hal ini seperti yang difirmankan Allah dalam surah Al-Kahfi ayat 98-101 bahwa semua kekuatan yang di bumi akan musnah pada hari di mana sangkakala ditiupkan.\n"
        }
    ]
}
