{
    "version": 1,
    "nabi" : [
        {
            "no" : 1,
            "kategori": "Kisah Nabi",
            "judul": "Kisah Nabi Adam Bertawasul pada Nabi Muhammad ﷺ",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/tawasulnabiadam.png",
            "isi": "<h4>Kisah Nabi Adam Bertawasul pada Nabi Muhammad ﷺ</h4>\nTawasul secara bahasa berasal dari kata wasilah yang berarti perantara. Menurut Sayyid Muhammad bin Alawi al-Maliki wasilah adalah setiap sesuatu yang dijadikan Allah Swt sebagai sebab untuk lebih bisa dekat dengan-Nya sekaligus perantara untuk terkabulnya hajat. Ada kisah Nabi Adam bertawasul pada Nabi Muhammad.<br><br>Sebelum itu, mari kita simak firman Allah Swt dalam Al-Qur’an surah al-Maidah ayat 35:<br><br>يَاأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُوا فِي سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ<br><br><i>Wahai orang-orang yang beriman! Bertakwalah kepada Allah dan carilah wasilah (jalan) untuk mendekatkan diri kepada-Nya, dan berjihadlah (berjuanglah) di jalan-Nya, agar kamu beruntung.</i><br><br>Pada hakikatnya, esensi dari tawasul sendiri adalah berdoa kepada Allah Swt dengan menggunakan perantara. Tujuan dari doa adalah Allah Swt karena Ialah satu-satunya dzat yang berhak dimintai pertolongan. Sementara, sesuatu yang dijadikan media  bertawasul -bisa nabi, orang shalih, maupun amal perbuatan- hanyalah  perantara untuk mendekatkan diri kita kepada Allah Swt sehingga doa yang kita panjatkan bisa diijabah.<br><br>Tawasul sudah ada sejak dahulu kala, bahkan sebelum manusia turun ke muka bumi. Ada sebuah kisah tentang tawasul yang dilakukan oleh manusia pertama Nabi Adam a.s saat beliau masih ada di dalam surga. Kisah ini disebutkan dalam sebuah hadis yang diriwayatkan Imam al-Hakim dalam kitab al-Mustadrak-nya. Bunyi hadisnya adalah sebagai berikut:<br><br>عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ” لَمَّا اقْتَرَفَ آدَمُ الْخَطِيئَةَ قَالَ: يَا رَبِّ أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ لَمَا غَفَرْتَ لِي، فَقَالَ اللَّهُ: يَا آدَمُ، وَكَيْفَ عَرَفْتَ مُحَمَّدًا وَلَمْ أَخْلُقْهُ؟ قَالَ: يَا رَبِّ، لِأَنَّكَ لَمَّا خَلَقْتَنِي بِيَدِكَ وَنَفَخْتَ فِيَّ مِنْ رُوحِكَ رَفَعْتُ رَأْسِي فَرَأَيْتُ عَلَىَ قَوَائِمِ الْعَرْشِ مَكْتُوبًا لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ فَعَلِمْتُ أَنَّكَ لَمْ تُضِفْ إِلَى اسْمِكَ إِلَّا أَحَبَّ الْخَلْقِ إِلَيْكَ، فَقَالَ اللَّهُ: صَدَقْتَ يَا آدَمُ، إِنَّهُ لَأَحَبُّ الْخَلْقِ إِلَيَّ ادْعُنِي بِحَقِّهِ فَقَدْ غَفَرْتُ لَكَ وَلَوْلَا مُحَمَّدٌ مَا خَلَقْتُكَ<br><br>Dalam hadis itu diceritakan bahwa tatkala nabi Adam a.s menyesali perbuatannya yang telah terbujuk rayuan iblis, nabi Adam segera bertaubat kepada Allah Swt. Beliau meminta ampun dengan menyebut nama nabi Muhammad ﷺ sebagai wasilah, padahal nabi Muhammad waktu itu belum lahir ke dunia. Nabi Adam berucap :<br><br><i>“Wahai Tuhanku, dengan derajat yang ada pada Muhammad, aku meminta kepada-Mu agar engkau memafkan aku.”</i><br><br>Allah Swt lantas bertanya:<br><br><i>“Wahai Adam darimana engkau mengetahui Muhammad sementara Aku belum menciptakannya?”</i><br><br>Nabi Adam a.s menjawab bahwa ia mengetahui nama Nabi Muhammad ﷺ tatkala Allah Swt baru saja menciptakan Nabi Adam dan meniupkan ruh kedalamnya. Saat itu  Nabi Adam melihat tiang-tiang penyangga Arsy yang bertuliskan <i>La ilaha illallah Muhammadur Rasulullah.</i><br><br><i>“Wahai Tuhanku, ketika Engkau menciptakan aku, dan Engkau meniupkan ruh-Mu kepadaku, aku mengangkat kepalaku dan aku melihat pada tiang-tiang penyangga arsy terdapat tulisan Laa ilaha illa Allah Muhammad rasulullah. Dari sana aku paham bahwa Engkau tak mungkin menyadarkan nama-Mu dengan sesuatu yang lain kecuali sesuatu itu merupakan makhluk yang paling dicintai disisi-Mu.”</i><br><br>Nabi Adam berhasil mendapat ampunan Allah Swt berkat tawasul yang ia lakukan kepada nabi Muhammad ini. Allah Swt membenarkan nabi Adam dan menerima taubat beliau.<br><br><i>“Engkau benar wahai Adam. Sesungguhnya Muhammad adalah makhluk yang paling aku cintai. Engkau berdoa kepadaku dengan kedudukan yang ada padanya maka aku sungguh telah mengampunimu. Seandainya tidak ada Muhammad niscaya aku tidak akan menciptakanmu.”</i><br><br>Selain Imam al-Hakim hadis ini juga diriwayatkan oleh beberapa ulama lainnya seperti Imam as-Suyuthi dalam kitab al- Khashaish an-Nubuwwah, Imam al-Qashthalani dalam Syarh al- Mawahib ad-Diniyyah, dan Imam as-Subki dalam kitab Syifa’u as-Saqam. Mereka semua menganggap hadis ini merupakan hadis yang shahih.<br><br>Begitulah kisah tentang tawasul yang dilakukan nabi Adam as kepada nabi Muhammad ﷺ. Seperti yang dikatakan oleh Sayyid Muhammad Alawi al-Maliki diatas bahwa tawasul merupakan salah satu jalan untuk dikabulkannya hajat dan sarana untuk mendekatkan diri kita kepada Allah Swt. Sebagai umatnya, kita seharusnya lebih dianjurkan untuk melakukan tawasul kepada junjungan kita nabi Muhammad ﷺ. Hal ini dibenarkan selagi cara yang kita lakukan berada dalam jalur kebenaran yakni hanya menjadikan nabi Muhammad ﷺ sebagai perantara, sementara tempat meminta hanya kepada Allah Swt semata. Wallahu A’lam."
        },
        {
           "no" : 2,
            "kategori": "Kisah Nabi",
            "judul": "Pertemuan & Pertemanan Nabi Idris AS dengan Malaikat Maut",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/nabiidris%26malaikatmaut.png",
            "isi": "<h4>Pertemuan & Pertemanan Nabi Idris AS dengan Malaikat Maut</h4>\nDikisahkan bahwa Nabi Idris AS adalah seorang nabi yang luar biasa tekun dalam beribadah. Setiap harinya, amalan saleh beliau naik ke langit dalam jumlah yang sangat besar, hingga membuat para malaikat kagum, termasuk Malaikat Maut (Izrail). Karena rasa rindu dan takjubnya, Malaikat Maut memohon izin kepada Allah SWT untuk turun ke bumi dalam wujud manusia guna menemui dan menjalin persahabatan dengan beliau.<br><br>Malaikat maut :<i>Ya Allah…. izinkan aku menemui nabimu nabi Idris, aku ingin mengunjunginya</i><br><br>Mendengar do’a sang malaikat maut, Allah Yang Maha Kuasa mengizinkan malaikat maut mengunjungi nabi yang dirindukannya itu.<br><br>Setelah mendaptkan izin dari Allah, malaikat maut datang menemui nabi Idris dalam wujud seorang laki-laki. Ketika malaikat maut datang, nabi Idris sedang megerjakan shooim ad dahr (puasa satu tahun). Menjelang berbuka puasa, malaikat maut mengetuk pintu rumah nabi Idris dengan membawa makanan surga.<br><br>Malaikat maut: <i>tok tok tok… tok tok tok (suara malaikat maut mengetuk pintu)</i><br><br>Nabi Idris: <i>Masuklah… mari ikut makan bersamaku</i><br><br>Mendengar ajakan nabi Idris untuk makan, laki-laki itu hanya diam, dia tidak mau makan. Laki-laki itu lebih memilih duduk di dekat nabi idris tanpa memakan apapun. Setelah nabi idris selesai makan, nabi Idris hendak beribadah kepada Allah.<br><br>Nabi Idris: <i>Aku hendak beribadah kepada Allah, apakah kamu mau ikut bersamaku beribadah kepada Allah ?</i><br><br>Mendengar ajakan nabi Idris, laki-laki itu hanya diam tanpa megatakan sepatah kata. Karena laki-laki itu hanya diam, nabi Idris tidak memaksanya untuk ikut ibadah. Laki-laki itu lebih memilih duduk di dekat nabi Idris hingga nabi idris selesai ibadah. Ketika terbit fajar nabi Idris terkejut melihat laki-laki itu masih duduk di dekatnya.<br><br>Nabi Idris: <i>Siapa kau sebenarnya ? kenapa tidak mengatakan sepatah katapun ? dan kenapa kau mau menungguku hingga aku selesai ibadah ?</i><br><br>Mendengar pertanyaan nabi Idris, laki-laki itu hanya diam dan tetap tidak mengatakan apapun.<br><br>Nabi Idris: <i>Baiklah, jika kau tidak mau mengatakannya.  Hai, kau. Apakah kau mau ikut berjalan bersamaku agar aku merasa bahagia ?</i><br><br>Malaikat maut: <i>Ya</i><br><br>Kemudian mereka berdiri dan berjalan cukup jauh hingga mereka tiba di sebuah sawah. Setelah mereka tiba di sebuah sawah laki-laki itu bertanya kepada nabi Idris.<br><br>Malaikat maut: <i>Apakah kamu mengizinkan aku mengambil beberapa tangkai tanaman ini untuk kita makan bersama ?</i><br><br>Nabi Idris: <i>Subhaanallah…. kemarin kamu tidak mau makan makanan halal dan sekarang kamu ingin makan makanan haram.</i><br><br>Setelah nabi Idris dan laki-laki itu berjalan bersama selama 4 hari, nabi Idris melihat laki-laki yang bersamanya itu tidak seperti manusia pada umunya. Karena merasa curiga, nabi Idris bertanya kepada laki-laki itu<br><br>Nabi Idris: <i>Siapa kamu ?</i><br><br>Malaikat maut: <i>Aku malaikat maut</i><br><br>Nabi Idris: <i>Apakah kamu yang mencabut banyak nyawa ?</i><br><br>Malaikat maut: <i>Ya</i><br><br>Nabi Idris: <i>Sudah 4 hari kamu bersamaku, apakah kamu telah mencabut nyawa seseorang ?</i><br><br>Malaikat maut: <i>Ya, aku telah mencabut banyak nyawa. Nyawa makhluk ciptaan Allah dihadapanku seperti makanan. Aku akan memakannya seperti halnya kamu makan</i><br><br>Nabi Idris: <i>Kamu datang kesini untuk apa ? Untuk berkunjung atau untuk mencabut nyawa ?</i><br><br>Malaikat maut: <i>Aku datang kesini hendak berkunjung, atas izin Allah</i><br><br>Nabi Idris: <i>Wahai malaikat maut, aku punya keinginan !</i><br><br>Malaikat maut: <i>Apa keinginanmu ?</i><br><br>Nabi Idris: <i>Aku ingin kau mencabut nyawaku kemudian Allah menghidupkanku supaya aku lebih bersungguh-sungguh beribadah kepada Allah setelah aku merasakan pahitnya mati</i><br><br>Malaikat maut: <i>Sesungguhnya aku tidak bisa mencabut nyawa seseorang kecuali atas izin Allah SWT</i><br><br>Kemudian Allah memberi wahyu kepada malaikat maut untuk mencabut nyawa nabi Idris saat itu juga. Setelah nabi Idris meninggal, malaikat maut menangis dan memohon kepada Allah dan meminta kepada-Nya supaya menghidupkan nabi Idris yang sudah dianggap sebagai saudaranya. Allah mendengar dan mengabulkan do’a malaikat maut. Nabi Idris hidup kembali.<br><br>Malaikat maut: <i>Wahai saudaraku, bagaimana ? kamu menemukan pahitnya mati ?</i><br><br>Nabi Idris: <i>Jika seekor hewan dikuliti/dilepas kulitnya sedang hewan itu dalam keadaan hidup, maka pahitnya mati seribu kali lebih sakit dari itu</i><br><br>Malaikat maut: <i>Aku mencabut nyawamu dengan sangat halus. Tidak pernah aku mencabut nyawa seseorang seperti aku mencabut nyawamu</i><br><br>Nabi Idris: <i>Wahai malaikat maut, aku punya keinginan lain. Aku ingin melihat neraka jahanam, dan aku akan beribadah kepada Allah setelah aku benar-benar melihat segala siksaan dan rantai-rantai dan segala sesuatu yang ada di dalam neraka.</i><br><br>Malaikat maut: <i>Bagaimana aku bisa pergi ke neraka jahanam bersamamu tanpa izin dari Allah ?</i><br><br>Seketika itu datang wahyu dari Allah supaya malaikat maut pergi pergi ke neraka bersama nabi Idris. Setelah mendapatkan izin dari Allah, malaikat maut dan nabi Idris pergi ke neraka. Mereka melihat segala sesuatu yang diciptakan Allah  untuk musuh-musuhnya-Nya. Diantaranya rantai-rantai dan belenggu-belenggu, ular-ular, kalajengking, aspal, buah zaqum, dan air yang mendidih. Setelah mengelilingi neraka, malaikat maut dan nabi Idris keluar dari neraka dan menyatakan keinginannya kepada malaikat maut.<br><br>Nabi Idris: <i>Wahai malaikat maut, aku punya keinginan lain. Aku ingin pergi ke surga, sehingga aku bisa melihat segala sesuatu yang ada di dalamnya yang diciptakan Allah untuk hambanya supaya aku bisa menambah ketaatanku kepada Allah.</i><br><br>Malaikat maut: <i>Bagaimana aku bisa pergi ke surga bersamamu tanpa izin dari Allah ?</i><br><br>Seketika itu datang wahyu dari Allah supaya malaikat maut pergi ke surga bersama nabi Idris. Setelah mendapat izin dari Allah keduanya pergi ke surga dan ketika sampai di surga mereka berhenti di pintu surga. Nabi Idris melihat segala sesuatu yang ada di surga dari depan pintu surga diantaranya, kenikmatan yang melimpah, kerajaan-kerajaan yang besar, pemberian yang agung, pepohonan, buah-buahan, dan tumbuhan yang lainnya.<br><br>Nabi Idris: <i>Wahai saudaraku, aku telah menyicipi pahitnya mati dan aku telah melihat keadaan neraka jahim dan segala sesuatu yang menakutkan di dalamnya. Apakah kau bisa menanyakan kepada Allah, bolehkah aku masuk ke surga dan meminum airnya sehingga hilang pahitnya kematian dan segala sesuatu yang menakutkan dari neraka jahim.</i><br><br>Malaikat maut: <i>Baiklah, aku akan mencoba meminta izin kepada Allah. Apakah kau boleh masuk surga atau tidak.</i><br><br>Setelah meminta izin kepada Allah, nabi Idris diperbolehkan masuk ke surga bersama malaikat maut. Mereka mengelilingi surga dan menyaksikan segala keindahan yang ada di surga beserta kenikmatan-kenikmatannya.<br><br>Malaikat maut: <i>Wahai saudaraku, sudah saatnya kita keluar dari surga. Mari, kita harus segera pergi.</i><br><br>Nabi Idris: <i>Oh ya, mari kita pergi dari sini</i><br><br>Sebelum nabi Idris meninggalkan surga, dia meninggalkan sandalnya di bawah pohon-pohon surga. Dia meminta izin kepada malaikat maut untuk kembali ke surga dengan alasan mengambil sandalnya yang telah tertinggal di bawah pepohonan surga.<br><br>Nabi Idris: <i>Wahai saudaraku, sandalku tertinggal di bawah pepohonan surga. Bolehkah aku kembali ke surga untuk mengambilnya ?</i><br><br>Malaikat maut: <i>Ya, jangan lama-lama. Aku akan menunggumu di depan pintu surga</i><br><br>Setelah mendapat izin dari malaikat maut untuk mengambil sandal yang tertinggal, nabi Idris masuk kembali ke surga dan tidak mau meninggalkan surga.<br><br>Malaikat maut: <i>Hai, Idris….. keluarlah (kata malaikat maut sambil menjerit-jerit)</i><br><br>Nabi Idris: <i>Tidak, aku tidak mau keluar dari surga ini. Karena Allah telah bersabda bahwa setiap yang bernyawa pasti merasakan mati. Dan aku telah merasakannya. Allah juga bersabda bahwa tidak ada seorangpun diantara kamu yang tidak mendatangi neraka. Dan aku telah mendatangi neraka. Allah juga bersabda yang artinya mereka tidak akan dikeluarkan darinya (surga). Dan sekarang aku sudah berada di surga. Oleh karena itu, siapa yang akan mengeluarkan aku dari surga ?</i><br><br>Mendengar perkataan nabi Idris, Allah SWT memberikan wahyu kepada malaikat maut. Kata Allah, “Tinggalkanlah Idris wahai malaikat maut. Sesungguhnya aku telah menetapkan sejak zaman azali (zaman dimana Allah belum menciptakan apa-apa) bahwa Idris adalah penghuni surga.<br><br>Demikianlah kisah nabi Idris AS dan malaikat maut. Jika kita memabaca kisah ini, kita bisa menyimpulkan bahwa nabi Idris adalah nabi Allah yang lebih pandai dari malaikat maut. Bahkan malaikat maut menganggapnya sebagai saudara yang selalu dirindukannya. Malaikat maut sangat menyayangi nabi Idris karena amalnya nabi Idris yang begitu luar biasa. Saking sayangnya kepada nabi Idris, malaikat maut begitu halus mencabut nyawa nabi Idris ketika nabi Idris meminta nyawanya dicabut. Walaupun malaikat maut mencabut nyawa nabi Idris dengan sangat halus, nabi Idris tetap merasa kesakitan. Bahkan nabi Idris megatakan bahwa rasa sakitnya 1000 kali lebih sakit daripada seekor hewan yang dikuliti/dilepas kulitnya sedang hewan itu dalam keadaan hidup.\n"
        }
    ]
}
