{
    "version": 2,
    "sahabat": [
        {
            "no" : 1,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah Ular yang Menggigit Abu Bakar dan Ingin Bertemu Nabi Muhammad ﷺ",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/abubakardigigitular.png",
            "isi": "<h4>Kisah Ular yang Menggigit Abu Bakar dan Ingin Bertemu Nabi Muhammad ﷺ</h4>\nDalam perjalanan Hijrah dari Makkah ke Madinah, Rasulullah ﷺ dan Sayyidina Abu Bakr Siddique RA memutuskan untuk berteduh di sebuah gua bernama Gua Tsur. Di sini mereka bersembunyi selama tiga hari.<br><br>Sayyidina Abu Bakar RA bersabda, sebagaimana diriwayatkan oleh Sayyidina Umar ibn Khattab RA, “Aku bersumpah demi Allah bahwa kamu (Nabi) tidak akan memasuki gua sebelum aku melakukannya, karena jika ada sesuatu di dalamnya, aku akan diserang oleh itu, dan bukan kamu.”<br><br>Sebelum Nabi Muhammad ﷺ memasuki gua, Abu Bakar dengan sigapnya mengecek dan juga menutup lubang-lubang yang ada di gua. Hal ini dilakukannya agar Nabi Muhammad ﷺ terhindar dari binatang buas.<br><br>Di dalam gua, mereka sepakat untuk bergantian berjaga. Dalam tidurnya, Nabi Muhammad ﷺ melabuhkan kepalanya di pangkuan sang sahabat. Di dalam gua yang dingin dan remang-remang, tiba-tiba ada seekor ular yang mendesis keluar dari salah satu lubang yang belum ditutup oleh Abu Bakar .Abu Bakar r.a menatapnya dengan waspada, ingin sekali ia menarik kedua kakinya untuk menjauh dari hewan berbisa ini. Namun, keinginan itu dienyahkannya dari benak, tak ingin ia mengganggu tidur Rasulullah ﷺ. Bagaimana mungkin, ia tega membangunkan kekasih Allah SWT itu.<br><br>Kemudian Abu Bakar r.a menutup lubang itu dengan salah satu kakinya, lalu ular itu menggigit pergelangan kakinya, tetapi kakinya tetap saja tak bergerak sedikitpun Dalam hening, sekujur tubuh Abu Bakar r.a menjadi terasa panas, ketika bisa ular yang menggigitnya telah menjalar cepat di dalam aliran darahnya. Abu Bakar r.a tak kuasa menahan isak tangis ketika rasa sakit itu tak tertahankan lagi. Tanpa sengaja, air matanya menetes mengenai pipi Rasulullah ﷺ yang tengah berbaring.<br><br>Rasulullah ﷺ terbangun dan berkata,<br><br><i>“Wahai hamba Allah, apakah engkau menangis karena menyesal mengikuti perjalanan ini?”</i><br><br><i>“Tentu saja tidak, saya ridha dan ikhlas mengikutimu kemana pun,”</i><br><br>jawab Abu Bakar r.a.<br><br><i>“Lalu mengapakah, engkau meluruhkan air mata?”</i><br><br>bertanya Rasulullah ﷺ dengan bersahaja.<br><br><i>“Seekor ular, baru saja menggigit saya, wahai Rasulullah ﷺ, dan bisanya menjalar begitu cepat ke dalam tubuhku.”</i><br><br>Lalu kemudian Nabi Muhammad ﷺ berbicara kepada sang ular yang telah menggigit Abu Bakar itu,<br><br><i>” Wahai ular Tahu tidak Kamu? Jangankan daging, atau kulit Abu Bakar, rambut Abu Bakar pun haram Kamu makan?”</i><br><br>Dialog Rasulullah dengan sang Ular itu didengar pula oleh Abu Bakar as-Shidiq, berkat mukjizat Beliau.<br><br><i>“Ya, hamba mengerti Ya Rasulullah, bahkan sejak ribuan tahun yang lalu ketika Allah SWT telah mengatakan ‘Barang siapa memandang kekasih- Ku, Muhammad, fi ainil mahabbah atau dengan mata kecintaan. Aku anggap cukup untuk menggelar dia ke surga firdaus,”</i> kata sang ular yang menggigit Abu Bakar itu.<br><br><i>“Ya Rabb, beri aku kesempatan yang begitu cemerlang dan indah. “Aku (ular) ingin memandang wajah kekasih-Mu fi ainal mahabbah,”</i> lanjut sang ular.<br><br>Apa kata Allah SWT Tuhan Semesta Alam?<br><br><i>“Silakan pergi ke gua Tsur, tunggu disana, kekasihKu akan datang pada waktunya,”</i> jawab Allah SWT.<br><br><i>“Ribuan tahun aku telah menunggu disini. Aku digodok oleh kerinduan untuk jumpa Engkau, Muhammad. Tapi sekarang ditutup oleh kaki Abu Bakar, maka kugigitlah dia. Aku tidak ada urusan dengan Abu Bakar, aku ingin ketemu Engkau, Wahai Nabi Muhammad ﷺ.”</i> Jawab sang Ular dari gua Tsur.<br><br><i>“Lihatlah ini. Lihatlah wajahku,”</i><br><br>kata Rasulullah ﷺ. Dan sang ular dari gua Tsur yang telah menggigit Abu Bakar pun memandang wajah Nabi Muhammad ﷺ penuh dengan rasa cinta dan rindu.<br><br>Selanjutnya tanpa perlu menunggu waktu lama, dengan penuh kasih sayang, Rasulullah meraih pergelangan kaki Abu Bakar r.a. Dengan mengagungkan nama Allah SWT Sang pencipta semesta, Nabi Muhammad ﷺ mengusap bekas gigitan itu dengan ludahnya. Maha suci Allah SWT, seketika rasa sakit itu hilang tak berbekas.\n"
        }
    ]
}
