
{
    "version": 7,
    "sahabat": [
        {
            "no" : 1,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah Ular yang Menggigit Abu Bakar dan Ingin Bertemu Nabi Muhammad ﷺ",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/abubakardigigitular.png",
            "isi": "<h4>Kisah Ular yang Menggigit Abu Bakar dan Ingin Bertemu Nabi Muhammad ﷺ</h4>\nDalam perjalanan Hijrah dari Makkah ke Madinah, Rasulullah ﷺ dan Sayyidina Abu Bakr Siddique RA memutuskan untuk berteduh di sebuah gua bernama Gua Tsur. Di sini mereka bersembunyi selama tiga hari.<br><br>Sayyidina Abu Bakar RA bersabda, sebagaimana diriwayatkan oleh Sayyidina Umar ibn Khattab RA, “Aku bersumpah demi Allah bahwa kamu (Nabi) tidak akan memasuki gua sebelum aku melakukannya, karena jika ada sesuatu di dalamnya, aku akan diserang oleh itu, dan bukan kamu.”<br><br>Sebelum Nabi Muhammad ﷺ memasuki gua, Abu Bakar dengan sigapnya mengecek dan juga menutup lubang-lubang yang ada di gua. Hal ini dilakukannya agar Nabi Muhammad ﷺ terhindar dari binatang buas.<br><br>Di dalam gua, mereka sepakat untuk bergantian berjaga. Dalam tidurnya, Nabi Muhammad ﷺ melabuhkan kepalanya di pangkuan sang sahabat. Di dalam gua yang dingin dan remang-remang, tiba-tiba ada seekor ular yang mendesis keluar dari salah satu lubang yang belum ditutup oleh Abu Bakar .Abu Bakar r.a menatapnya dengan waspada, ingin sekali ia menarik kedua kakinya untuk menjauh dari hewan berbisa ini. Namun, keinginan itu dienyahkannya dari benak, tak ingin ia mengganggu tidur Rasulullah ﷺ. Bagaimana mungkin, ia tega membangunkan kekasih Allah SWT itu.<br><br>Kemudian Abu Bakar r.a menutup lubang itu dengan salah satu kakinya, lalu ular itu menggigit pergelangan kakinya, tetapi kakinya tetap saja tak bergerak sedikitpun Dalam hening, sekujur tubuh Abu Bakar r.a menjadi terasa panas, ketika bisa ular yang menggigitnya telah menjalar cepat di dalam aliran darahnya. Abu Bakar r.a tak kuasa menahan isak tangis ketika rasa sakit itu tak tertahankan lagi. Tanpa sengaja, air matanya menetes mengenai pipi Rasulullah ﷺ yang tengah berbaring.<br><br>Rasulullah ﷺ terbangun dan berkata,<br><br><i>“Wahai hamba Allah, apakah engkau menangis karena menyesal mengikuti perjalanan ini?”</i><br><br><i>“Tentu saja tidak, saya ridha dan ikhlas mengikutimu kemana pun,”</i><br><br>jawab Abu Bakar r.a.<br><br><i>“Lalu mengapakah, engkau meluruhkan air mata?”</i><br><br>bertanya Rasulullah ﷺ dengan bersahaja.<br><br><i>“Seekor ular, baru saja menggigit saya, wahai Rasulullah ﷺ, dan bisanya menjalar begitu cepat ke dalam tubuhku.”</i><br><br>Lalu kemudian Nabi Muhammad ﷺ berbicara kepada sang ular yang telah menggigit Abu Bakar itu,<br><br><i>” Wahai ular Tahu tidak Kamu? Jangankan daging, atau kulit Abu Bakar, rambut Abu Bakar pun haram Kamu makan?”</i><br><br>Dialog Rasulullah dengan sang Ular itu didengar pula oleh Abu Bakar as-Shidiq, berkat mukjizat Beliau.<br><br><i>“Ya, hamba mengerti Ya Rasulullah, bahkan sejak ribuan tahun yang lalu ketika Allah SWT telah mengatakan ‘Barang siapa memandang kekasih- Ku, Muhammad, fi ainil mahabbah atau dengan mata kecintaan. Aku anggap cukup untuk menggelar dia ke surga firdaus,”</i> kata sang ular yang menggigit Abu Bakar itu.<br><br><i>“Ya Rabb, beri aku kesempatan yang begitu cemerlang dan indah. “Aku (ular) ingin memandang wajah kekasih-Mu fi ainal mahabbah,”</i> lanjut sang ular.<br><br>Apa kata Allah SWT Tuhan Semesta Alam?<br><br><i>“Silakan pergi ke gua Tsur, tunggu disana, kekasihKu akan datang pada waktunya,”</i> jawab Allah SWT.<br><br><i>“Ribuan tahun aku telah menunggu disini. Aku digodok oleh kerinduan untuk jumpa Engkau, Muhammad. Tapi sekarang ditutup oleh kaki Abu Bakar, maka kugigitlah dia. Aku tidak ada urusan dengan Abu Bakar, aku ingin ketemu Engkau, Wahai Nabi Muhammad ﷺ.”</i> Jawab sang Ular dari gua Tsur.<br><br><i>“Lihatlah ini. Lihatlah wajahku,”</i><br><br>kata Rasulullah ﷺ. Dan sang ular dari gua Tsur yang telah menggigit Abu Bakar pun memandang wajah Nabi Muhammad ﷺ penuh dengan rasa cinta dan rindu.<br><br>Selanjutnya tanpa perlu menunggu waktu lama, dengan penuh kasih sayang, Rasulullah meraih pergelangan kaki Abu Bakar r.a. Dengan mengagungkan nama Allah SWT Sang pencipta semesta, Nabi Muhammad ﷺ mengusap bekas gigitan itu dengan ludahnya. Maha suci Allah SWT, seketika rasa sakit itu hilang tak berbekas.\n"
        },
        {
            "no" : 2,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah mimpi Abu Bakar As Siddiq melihat matahari dan bulan di dalam kamarnya",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/mimpiabubakar.png",
            "isi": "<h4>Kisah mimpi Abu Bakar Al Siddiq melihat matahari dan bulan di dalam kamarnya</h4>\nSyaikh al-Ushfuri dalam Mawaidz al-Ushfuriyah menuliskan bahwa keislaman Abu Bakar diawali dari mimpi. Ketika berada di Syam (kini Syiria), ia bermimpi melihat matahari dan bulan di dalam kamarnya. Lalu matahari dan bulan itu direngkuh dengan kedua tangannya. Ia mendekap keduaya erat-erat. Tak hanya itu, dengan surbannya, matahari dan bulan diikat agar tidak pergi.<br><br>Tatkala Abu Bakar terbangun, ia buru-buru pergi untuk mendatangai seorang pendeta Nasrani yang masih beriman dengan agama tauhid untuk bertanya ihwal mimpinya. Di hadapan sang pendeta, Abu Bakar menceritakan secara lengkap mimpi yang dialaminya. Kemudian Abu Bakar memintanya untuk memberikan tafsir mimpi tersebut.<br><br>Abu Bakar ditanya, <i>“Kamu dari mana?”</i><br><br>Abu Bakar menjawab, <i>“Mekah”</i><br><br>Pendeta itu bertanya lagi, <i>“Dari suku apa?”</i><br><br>Abu Bakar menjawab, <i>“Dari suku Taymin”</i><br><br>Tak hanya itu, sang pendeta kembali bertanya kepada Abu Bakar, <i>“Apa pekerjaanmu?”.</i><br><br>Abu Bakar menyahut, <i>“Berdagang”</i>.<br><br>Usai melancarkan sekian pertanyaan, pendeta itu berujar, <i>“Pada masamu ini akan datang seorang seorang laki-laki keturunan Bani Hasyim yang bernama Muhammad al-Amin. Ia bermarga Hasyim dan akan menjadi nabi akhir zaman”. “Kalau tidak ada beliau, niscaya Allah tidak akan menciptakan langit dan bumi. Termasuk apa saja yang ada pada keduanya. Tanpanya, Allah juga tidak akan pernah menciptakan Nabi Adam, para nabi dan rasul. Muhammad itu pemimpin para nabi dan rasul. Ia adalah nabi terakhir. Kamu akan masuk agama Islam yang dibawanya”. “Kelak kamu akan menjadi orang kepercayaannya sekaligus bakal menjadi pengganti kepemimpinannya. Inilah makna mimpimu itu”, pungkas sang pendeta. “Aku mendapatkan informasi ihwa ciri-ciri dan sifat-sifat Muhammad di dalam kitab Taurat, Injil, dan Zabur. Sungguh, aku sendiri sudah mengikuti agamanya. Hanya saja aku menyembunyikannya”</i>.<br><br>Usai mendengar penjelasan sang pendeta tentang sifat-sifat Nabi SAW, Abu Bakar luluh hatinya dan merasa rindu untuk bertemu dengan Nabi SAW di Mekah. Sesampainya di Mekah, Abu Bakar tak membuang waktu, ia langsung mencari Nabi SAW dan ia berhasil bertemu.<br><br>Sejak pertemuan itu, Abu Bakar jadi kian cinta kepada Nabi SAW dan tidak pernah ingin berpisah. Kondisi hati Abu Bakar seperti itu berlangsung cukup lama.<br><br>Hingga suatu hari Nabi SAW bertanya kepada Abu Bakar, <i>“Wahai Abu Bakar setiap hari kamu mengunjungiku. Seringkali juga kamu duduk bersamaku. Namun mengapa kamu tidak masuk Islam?”</i><br><br>Abu Bakar menjawab, <i>“Jika kamu benar seorang nabi, tentu kamu memiliki suatu mukjizat”</i><br><br>Nabi SAW menjawab, <i>“Apakah belum cukup untukmu mukjizat yang kamu alami dalam mimpimu ketika kamu berada di Syam. Kemudian mimpimu itu ditafsirkan oleh seorang pendeta Nasrani yang juga sudah menyatakan keislamannya?”</i><br><br>Lalu seusai mendengar sabda Nabi SAW itu, Abu Bakar berikrar, <i>“Aku bersaksi bahwa tidak ada Tuhan selain Allah dan kamu adalah utusan Allah”</i><br><br>Inilah keteladanan Abu Bakar al-Shiddiq sang ahli ibadah. Ia tinggi keyakinannya, benar mimpinya, dan sangat berhati-hati dalam setiap pengambilan keputusannya.\n"
        },
        {
            "no" : 3,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah Sahabat Abu Bakar dan Kafir Quraisy saat Peristiwa Isra’ Mi’raj",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/abubakardanqurais.png",
            "isi": "<h4>Kisah Sahabat Abu Bakar dan Kafir Quraisy saat Peristiwa Isra’ Mi’raj</h4>\nPeristiwa yang sangat bersejarah dalam Islam yakni Isra’ dan Mi’raj. Di dalamnya banyak sekali kejadian luar biasa yang tidak bisa dinalar oleh akal, misalnya, perjalanan yang sangat jauh dan panjang hanya dilalui oleh Nabi Muhammad SAW dengan tempo waktu yang sangat singkat.<br><br>Mustahil seseorang itu bisa percaya dan iman kepada Rasulullah jika tidak berdasarkan dari keimanan, termasuk setiap sesuatu yang disampaikannya dalam peristiwa Isra' dan Mi'raj.<br><br>Benar memang, bahwa peristiwa itu tidak bisa diterima akal sehat, namun iman yang kuat akan selalu percaya dan membenarkannya. Dari sinilah kisah sahabat Abu Bakar mendapatkan gelar as-Siddiq (orang yang paling benar).<br><br>Kisah ini berawal ketika orang-orang kafir Quraisy hendak mencemooh dan mengolok-olok Nabi Muhammad SAW kepadanya. Mereka bertujuan agar Abu Bakar merasa malu telah percaya dan iman kepada ajaran yang dibawa olehnya. Sesampainya di rumah Abu Bakar, mereka sampaikan kisah perjalanan Rasulullah dari Makkah ke Baitul Maqdis dengan tempo waktu yang sangat singkat.<br><br>Mendengar berita itu, Abu Bakar tidak langsung membenarkan dan tidak pula mengingkari, ia justru bertanya, <i>“Apakah Rasulullah benar berkata demikian?”</i><br><br><i>“Iya,”</i> Jawab mereka. Orang-orang kafir Quraisy terus mendebat dan mengatakan bahwa Abu Bakar tidak waras karena telah percaya pada sesuatu yang tidak masuk akal.<br><br>Akan tetapi, dengan tegas dan penuh keyakinan, Abu Bakar langsung mengatakan kepada mereka,<br><br> أَنَا صَدَقْتُهُ فِي خَبَرِ السَّمَاءِ فَكَيْفَ أُكَذِّبُهُ فِي ذَلِكَ، مَادَامَ قَالَ فَقَدْ صَدَقَ<br><br>Artinya:<i> “Sungguh saya telah membenarkannya perihal khabar langit (Mi’raj), maka bagaimana mungkin saya mengingkarinya dalam peristiwa itu (Isra’). Selama (Rasulullah) berkata, maka sungguh dia benar.”</i><br><br>Jawaban sahabat Abu Bakar di atas dijadikan gambaran oleh para ulama tafsir, bahwa iman yang benar adalah iman yang tidak mempertanyakan apa yang dilakukan oleh pembawa risalah, semua percaya dan iman padanya, sekalipun tidak masuk akal. (Syekh Mutawalli, Tafsir wa Khawathirul Umam lisy Sya’rawi, [Darul Imam, 1997), juz I, halaman 2707).<br><br>Demikian gambaran keimanan Sayyidina Abu Bakar as-Shiddiq. Ia menjadi orang pertama yang iman akan adanya Isra’. Bahkan sebelum khabar tentang Mi’raj diceritakan kepadanya, ia langsung percaya, sebagaimana jawabannya di atas. Keimanan Sayyidina Abu Bakar.<br><br>Sayyidina Abu Bakar memang menjadi satu-satunya sahabat Rasulullah yang selalu mendampingi perjuangan dakwah Rasulullah sejak ia diangkat menjadi nabi. Bahkan ketika orang kafir Quraisy hendak membunuhnya, Abu Bakar adalah satu-satunya sahabat yang pergi mendampinginya.\n"
        },
        {
            "no" : 4,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah Pengumpulan Al-Quran di Masa Khalifah Abu Bakar As Shiddiq",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/abubakardanquran.png",
            "isi": "<h4>Kisah Pengumpulan Al-Quran di Masa Khalifah Abu Bakar As Shiddiq</h4>\nDi antara peristiwa yang paling mengguncang umat Islam di masa kekhalifahan Abu Bakar adalah wafatnya para penghafal Al-Quran dalam pertempuran Yamamah.<br><br>Kondisi tersebut membuat Umar bin Khaththab Radhiyallahu Anhu khawatir. Para shahabat telah berpencar ke berbagai pelosok untuk menyampaikan dakwah Islam. Mati syahid menjadi idaman mereka semua. Sementara Al-Quran tersimpan di dalam dada mereka.<br><br>Sehingga, kematian mereka secara tidak langsung menjadi penyebab hilangnya Al-Quran. Bertolak dari pemikiran itu, Umar pun bergegas menemui Abu Bakar untuk bermusyawarah dengannya dalam hal pengumpulan Al-Quran dalam satu mushaf.<br><br>Pada awalnya Abu Bakar Ash-Shiddiq tidak menyetujui usulan Umar tersebut, dengan alasan Nabi Shallallahu Alaihi wa Sallam tidak pernah melakukan itu. Bagaimana mungkin dia melangkahi Nabi.<br><br>Namun Umar tidak lekas menyerah, dia terus berusaha meyakinkan Abu Bakar dan menjelaskan berbagai sisi positif dari upaya pengumpulan Al-Quran tersebut. Sampai akhirnya Abu Bakar pun tercerahkan dan bersedia menerima usulan Umar itu.<br><br>Sang penulis wahyu, Zaid bin Tsabit menceritakan situasi genting tersebut:<br><br>Abu Bakar mengirimi aku berita tentang kematian pasukan Islam di Yamamah. Ternyata Umar bin Khaththab sedang bersamanya.<br><br>Abu Bakar bercerita padaku, Umar datang kepadaku sambil mengatakan, <i>“Sesungguhnya perang Yamamah telah merenggut nyawa para penghafal Al-Quran, aku khawatir akan lebih banyak lagi para penghafal Al-Quran yang meninggal dalam peperangan berikutnya. Dengan demikian, Al-Quran akan hilang bersamaan dengan wafatnya mereka. Maka aku menyarankan agar engkau segera memerintahkan upaya pengumpulan Al-Quran.”</i><br><br>Abu Bakar berkata, <i>“Bagaimana mungkin engkau melakukan sesuatu yang tidak pernah dilakukan oleh Rasulullah Shallallahu Alaihi wa Sallam?”</i><br><br>Umar menjawab, <i>“Demi Allah, upaya tersebut merupakan sesuatu yang baik.”</i><br><br>Umar tak berhenti berusaha meyakinkanku, hingga akhirnya Allah Ta’ala membukakan hatiku untuk itu. Aku pun jadi menyetujui pandangan Umar tersebut.<br><br>Zaid melanjutkan ceritanya,<br><br>Abu Bakar lalu berkata padaku, <i>“Engkau adalah pemuda cerdas yang tidak pernah kami ragukan. Engkau juga penulis wahyu untuk Rasulullah Shallallahu Alaihi wa Sallam. Maka telusuri dan kumpulkanlah Al-Quran.”</i><br><br>Aku (Zaid) katakan, <i>“Demi Allah, kalau mereka menugaskan padaku untuk memindahkan salah satu gunung, tidak akan lebih berat daripada perintah untuk mengumpulkan Al-Quran.”</i><br><br>Aku (Zaid) pun bertanya kepadanya (Abu Bakar), <i>“Bagaimana mungkin kalian melakukan sesuatu yang belum pernah dilakukan oleh Rasulullah Shallallahu Alaihi wa Sallam?”</i><br><br>Abu Bakar menjawab, <i>“Demi Allah, upaya tersebut merupakan sesuatu yang baik.”</i><br><br>Abu Bakar terus berusaha membujukku, sampai akhirnya Allah Ta’ala membukakan hatiku sebagaimana sebelumnya telah membukakan hati Abu Bakar dan Umar Radhiyallahu Anhuma.<br><br>Aku pun mulai menelusuri keberadaan lembaran mushaf Al-Quran. Aku kumpulkan Al-Quran dari yang tertulis di pelepah kurma dan lempengan batu putih serta dari hafalan para shahabat, sampai aku mendapatkan akhir surat At-Taubah dari Abu Khuzaimah Al-Anshari yang tidak saya dapatkan dari orang lain seorang pun.<br><br>Seluruh lembaran Al-Quran kemudian disimpan di rumah Abu Bakar sampai dia meninggal dunia. Kemudian disimpan oleh Umar selama dia hidup, selanjutnya disimpan oleh Hafshah binti Umar Radhiyallahu Anhuma.<br><br>Ali bin Abi Thalib Radhiyallahu Anhu berkata, <i>“Orang yang paling besar jasanya dalam pembuatan mushaf adalah Abu Bakar. Dialah yang pertama kali mengumpulkan Al-Quran dalam satu mushaf.”</i><br><br>Demikian dikutip dari buku 10 Shahabat yang Dijanjikan Masuk Surga karya Abdus Sattar Asy-Syaikh. [Abu Syafiq/BersamaDakwah]\n"
        }
    ]
}
