{
    "version": 4,
    "sahabat": [
        {
            "no" : 1,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah Ular yang Menggigit Abu Bakar dan Ingin Bertemu Nabi Muhammad ﷺ",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/abubakardigigitular.png",
            "isi": "<h4>Kisah Ular yang Menggigit Abu Bakar dan Ingin Bertemu Nabi Muhammad ﷺ</h4>\nDalam perjalanan Hijrah dari Makkah ke Madinah, Rasulullah ﷺ dan Sayyidina Abu Bakr Siddique RA memutuskan untuk berteduh di sebuah gua bernama Gua Tsur. Di sini mereka bersembunyi selama tiga hari.<br><br>Sayyidina Abu Bakar RA bersabda, sebagaimana diriwayatkan oleh Sayyidina Umar ibn Khattab RA, “Aku bersumpah demi Allah bahwa kamu (Nabi) tidak akan memasuki gua sebelum aku melakukannya, karena jika ada sesuatu di dalamnya, aku akan diserang oleh itu, dan bukan kamu.”<br><br>Sebelum Nabi Muhammad ﷺ memasuki gua, Abu Bakar dengan sigapnya mengecek dan juga menutup lubang-lubang yang ada di gua. Hal ini dilakukannya agar Nabi Muhammad ﷺ terhindar dari binatang buas.<br><br>Di dalam gua, mereka sepakat untuk bergantian berjaga. Dalam tidurnya, Nabi Muhammad ﷺ melabuhkan kepalanya di pangkuan sang sahabat. Di dalam gua yang dingin dan remang-remang, tiba-tiba ada seekor ular yang mendesis keluar dari salah satu lubang yang belum ditutup oleh Abu Bakar .Abu Bakar r.a menatapnya dengan waspada, ingin sekali ia menarik kedua kakinya untuk menjauh dari hewan berbisa ini. Namun, keinginan itu dienyahkannya dari benak, tak ingin ia mengganggu tidur Rasulullah ﷺ. Bagaimana mungkin, ia tega membangunkan kekasih Allah SWT itu.<br><br>Kemudian Abu Bakar r.a menutup lubang itu dengan salah satu kakinya, lalu ular itu menggigit pergelangan kakinya, tetapi kakinya tetap saja tak bergerak sedikitpun Dalam hening, sekujur tubuh Abu Bakar r.a menjadi terasa panas, ketika bisa ular yang menggigitnya telah menjalar cepat di dalam aliran darahnya. Abu Bakar r.a tak kuasa menahan isak tangis ketika rasa sakit itu tak tertahankan lagi. Tanpa sengaja, air matanya menetes mengenai pipi Rasulullah ﷺ yang tengah berbaring.<br><br>Rasulullah ﷺ terbangun dan berkata,<br><br><i>“Wahai hamba Allah, apakah engkau menangis karena menyesal mengikuti perjalanan ini?”</i><br><br><i>“Tentu saja tidak, saya ridha dan ikhlas mengikutimu kemana pun,”</i><br><br>jawab Abu Bakar r.a.<br><br><i>“Lalu mengapakah, engkau meluruhkan air mata?”</i><br><br>bertanya Rasulullah ﷺ dengan bersahaja.<br><br><i>“Seekor ular, baru saja menggigit saya, wahai Rasulullah ﷺ, dan bisanya menjalar begitu cepat ke dalam tubuhku.”</i><br><br>Lalu kemudian Nabi Muhammad ﷺ berbicara kepada sang ular yang telah menggigit Abu Bakar itu,<br><br><i>” Wahai ular Tahu tidak Kamu? Jangankan daging, atau kulit Abu Bakar, rambut Abu Bakar pun haram Kamu makan?”</i><br><br>Dialog Rasulullah dengan sang Ular itu didengar pula oleh Abu Bakar as-Shidiq, berkat mukjizat Beliau.<br><br><i>“Ya, hamba mengerti Ya Rasulullah, bahkan sejak ribuan tahun yang lalu ketika Allah SWT telah mengatakan ‘Barang siapa memandang kekasih- Ku, Muhammad, fi ainil mahabbah atau dengan mata kecintaan. Aku anggap cukup untuk menggelar dia ke surga firdaus,”</i> kata sang ular yang menggigit Abu Bakar itu.<br><br><i>“Ya Rabb, beri aku kesempatan yang begitu cemerlang dan indah. “Aku (ular) ingin memandang wajah kekasih-Mu fi ainal mahabbah,”</i> lanjut sang ular.<br><br>Apa kata Allah SWT Tuhan Semesta Alam?<br><br><i>“Silakan pergi ke gua Tsur, tunggu disana, kekasihKu akan datang pada waktunya,”</i> jawab Allah SWT.<br><br><i>“Ribuan tahun aku telah menunggu disini. Aku digodok oleh kerinduan untuk jumpa Engkau, Muhammad. Tapi sekarang ditutup oleh kaki Abu Bakar, maka kugigitlah dia. Aku tidak ada urusan dengan Abu Bakar, aku ingin ketemu Engkau, Wahai Nabi Muhammad ﷺ.”</i> Jawab sang Ular dari gua Tsur.<br><br><i>“Lihatlah ini. Lihatlah wajahku,”</i><br><br>kata Rasulullah ﷺ. Dan sang ular dari gua Tsur yang telah menggigit Abu Bakar pun memandang wajah Nabi Muhammad ﷺ penuh dengan rasa cinta dan rindu.<br><br>Selanjutnya tanpa perlu menunggu waktu lama, dengan penuh kasih sayang, Rasulullah meraih pergelangan kaki Abu Bakar r.a. Dengan mengagungkan nama Allah SWT Sang pencipta semesta, Nabi Muhammad ﷺ mengusap bekas gigitan itu dengan ludahnya. Maha suci Allah SWT, seketika rasa sakit itu hilang tak berbekas.\n"
        }.
        {
            "no" : 2,
            "kategori": "Kisah Sahabat",
            "judul": "Kisah mimpi Abu Bakar Al Siddiq melihat matahari dan bulan di dalam kamarnya",
            "gambar": "https://cdn.jsdelivr.net/gh/sscorpfam/islami@main/mimpiabubakar.png",
            "isi": "<h4>Kisah mimpi Abu Bakar Al Siddiq melihat matahari dan bulan di dalam kamarnya</h4>\nSyaikh al-Ushfuri dalam Mawaidz al-Ushfuriyah menuliskan bahwa keislaman Abu Bakar diawali dari mimpi. Ketika berada di Syam (kini Syiria), ia bermimpi melihat matahari dan bulan di dalam kamarnya. Lalu matahari dan bulan itu direngkuh dengan kedua tangannya. Ia mendekap keduaya erat-erat. Tak hanya itu, dengan surbannya, matahari dan bulan diikat agar tidak pergi.<br><br>Tatkala Abu Bakar terbangun, ia buru-buru pergi untuk mendatangai seorang pendeta Nasrani yang masih beriman dengan agama tauhid untuk bertanya ihwal mimpinya. Di hadapan sang pendeta, Abu Bakar menceritakan secara lengkap mimpi yang dialaminya. Kemudian Abu Bakar memintanya untuk memberikan tafsir mimpi tersebut.<br><br>Abu Bakar ditanya, <i>“Kamu dari mana?”</i><br><br>Abu Bakar menjawab, <i>“Mekah”</i><br><br>Pendeta itu bertanya lagi, <i>“Dari suku apa?”</i><br><br>Abu Bakar menjawab, <i>“Dari suku Taymin”</i><br><br>Tak hanya itu, sang pendeta kembali bertanya kepada Abu Bakar, <i>“Apa pekerjaanmu?”.</i><br><br>Abu Bakar menyahut, <i>“Berdagang”</i>.<br><br>Usai melancarkan sekian pertanyaan, pendeta itu berujar, <i>“Pada masamu ini akan datang seorang seorang laki-laki keturunan Bani Hasyim yang bernama Muhammad al-Amin. Ia bermarga Hasyim dan akan menjadi nabi akhir zaman”. “Kalau tidak ada beliau, niscaya Allah tidak akan menciptakan langit dan bumi. Termasuk apa saja yang ada pada keduanya. Tanpanya, Allah juga tidak akan pernah menciptakan Nabi Adam, para nabi dan rasul. Muhammad itu pemimpin para nabi dan rasul. Ia adalah nabi terakhir. Kamu akan masuk agama Islam yang dibawanya”. “Kelak kamu akan menjadi orang kepercayaannya sekaligus bakal menjadi pengganti kepemimpinannya. Inilah makna mimpimu itu”, pungkas sang pendeta. “Aku mendapatkan informasi ihwa ciri-ciri dan sifat-sifat Muhammad di dalam kitab Taurat, Injil, dan Zabur. Sungguh, aku sendiri sudah mengikuti agamanya. Hanya saja aku menyembunyikannya”</i>.<br><br>Usai mendengar penjelasan sang pendeta tentang sifat-sifat Nabi SAW, Abu Bakar luluh hatinya dan merasa rindu untuk bertemu dengan Nabi SAW di Mekah. Sesampainya di Mekah, Abu Bakar tak membuang waktu, ia langsung mencari Nabi SAW dan ia berhasil bertemu.<br><br>Sejak pertemuan itu, Abu Bakar jadi kian cinta kepada Nabi SAW dan tidak pernah ingin berpisah. Kondisi hati Abu Bakar seperti itu berlangsung cukup lama.<br><br>Hingga suatu hari Nabi SAW bertanya kepada Abu Bakar, <i>“Wahai Abu Bakar setiap hari kamu mengunjungiku. Seringkali juga kamu duduk bersamaku. Namun mengapa kamu tidak masuk Islam?”</i><br><br>Abu Bakar menjawab, <i>“Jika kamu benar seorang nabi, tentu kamu memiliki suatu mukjizat”</i><br><br>Nabi SAW menjawab, <i>“Apakah belum cukup untukmu mukjizat yang kamu alami dalam mimpimu ketika kamu berada di Syam. Kemudian mimpimu itu ditafsirkan oleh seorang pendeta Nasrani yang juga sudah menyatakan keislamannya?”</i><br><br>Lalu seusai mendengar sabda Nabi SAW itu, Abu Bakar berikrar, <i>“Aku bersaksi bahwa tidak ada Tuhan selain Allah dan kamu adalah utusan Allah”</i><br><br>Inilah keteladanan Abu Bakar al-Shiddiq sang ahli ibadah. Ia tinggi keyakinannya, benar mimpinya, dan sangat berhati-hati dalam setiap pengambilan keputusannya."
        }
    ]
}
