{
	"tafseer": [
		{
			"id": 5932,
			"surah": 86,
			"ayat": 1,
			"tafsir": "In these verses and in several other verses, Allah swears by the sky, the sun, the moon and the night because there are things, forms, journeys, their rising and setting; then this miraculous and extraordinary state is proof to the thinking and observing person that there is a creator who is Almighty, there is no partner in its creation. In these verses, Allah swears by the sky and the stars that rise at night. Its light dispels darkness, and guides people the way in dark times on earth and at sea. From that star, humans can know the rainy season and other things they need in life. There are several meanings put forward by commentators regarding this star. The best opinion is that interprets it as a shining star."
		   },
		   {
			"id": 5933,
			"surah": 86,
			"ayat": 2,
			"tafsir": "In these verses and in several other verses, Allah swears by the sky, the sun, the moon and the night because there are things, forms, journeys, their rising and setting; then this miraculous and extraordinary state is proof to the thinking and observing person that there is a creator who is Almighty, there is no partner in its creation. In these verses, Allah swears by the sky and the stars that rise at night. Its light dispels darkness, and guides people the way in dark times on earth and at sea. From that star, humans can know the rainy season and other things they need in life. There are several meanings put forward by commentators regarding this star. The best opinion is that interprets it as a shining star."
		   },
		   {
			"id": 5934,
			"surah": 86,
			"ayat": 3,
			"tafsir": "In these verses and in several other verses, Allah swears by the sky, the sun, the moon and the night because there are things, forms, journeys, their rising and setting; then this miraculous and extraordinary state is proof to the thinking and observing person that there is a creator who is Almighty, there is no partner in its creation. In these verses, Allah swears by the sky and the stars that rise at night. Its light dispels darkness, and guides people the way in dark times on earth and at sea. From that star, humans can know the rainy season and other things they need in life. There are several meanings put forward by commentators regarding this star. The best opinion is that interprets it as a shining star."
		   },
		   {
			"id": 5935,
			"surah": 86,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that every person has a guardian and regulator of his needs throughout his life's journey until his death. Regarding this human guardian, there are two meanings, namely: 1. Guardians from angels who pay attention and calculate human actions, as Allah says: There is not a word that he utters but there is a guardian angel by his side who is always ready (to take notes). (Qaf\/50: 18) 1. Guardians from angels who always accompany him at all times and take care of everyday life, as Allah says: For him (man) there are angels who always take care of him in turn, from the front and behind him. They guarded it at the command of Allah. (ar-Ra'd\/13: 11) The word tariq, the name of this 86th surah, comes from the root tharaqa which basically means to strike hard enough to make a sound. Taking into account the root word that can be interpreted as 'pulsing\/beating,' hit hard. The tsaqib which comes from the word tsaqaba means to make a hole or penetrate something solid. The Qur'an seems to be directing us to an important scientific fact, namely towards what is known today as a pulsar star, which is taken from the English verb to pulse, which means to vibrate, to beat with a regular rhythm. Thus, the above surah reads or means a star that knocks at night and makes a hole. Through research by Jocelyn Bell Burnell, a doctoral student with her supervisor Antony Hewish at the University of Cambridge in 1967, it was discovered that radio signals were emitted regularly from outer space. However, at that time it was not yet known which celestial body was the source of the vibrations. Jocelyn Bell (then not yet bearing the name Burnell, her husband) tagged the recording she obtained with LGM, short for Little Green Men, because the signal was like a message coming from a transmitter delivered by intelligent life. Soon, this pulsar was interpreted to have originated from an isolated, rotating neutron star. The mass of this dying star is so dense that it is described as a teaspoon-sized pulsar material that weighs 1 billion tons, and has such great gravity. These stars, which turn into pulsars in supernova explosions, are some of the brightest and fastest moving celestial bodies in space. Some pulsars rotate 600 times per second. If this star continues to collapse, what is known as a black hole is born. If this radio telescope is connected to a loud speaker, it will sound like the sound of someone knocking on a door (ath-thariq), which comes from a star making a hole, which then becomes a black hole. Finally Allah reminds that every soul has a guard. That what Allah said before, about the stars, is haqq, then Allah's word that every soul has a guard is haqq. This verse is a warning for humans to always be aware that God is always watching."
		   },
		   {
			"id": 5936,
			"surah": 86,
			"ayat": 5,
			"tafsir": "In this verse, Allah reminds people to pay attention to what they are created from. This means that God commands man to think and pay close attention to what he is made of. In this way, he can know the power of his creator and also knows that if his creator can create him from a material that does not have the slightest signs of life, then surely it will be easier for him to bring him back to life."
		   },
		   {
			"id": 5937,
			"surah": 86,
			"ayat": 6,
			"tafsir": "In these verses, Allah explains that He created humans from the gushing water that comes out from between the backbone (as-sulb) and the breastbone of men. This statement of Allah is in response to the question in the previous verse."
		   },
		   {
			"id": 5938,
			"surah": 86,
			"ayat": 7,
			"tafsir": "In these verses, Allah explains that He created humans from the gushing water that comes out from between the backbone (as-sulb) and the breastbone of men. This statement of Allah is in response to the question in the previous verse."
		   },
		   {
			"id": 5939,
			"surah": 86,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains that He really has the power to bring humans back to life after death. Allah said: Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 79) And it is He who started creation, then repeats it again, and it is easier for Him. He has the highest nature in the heavens and on earth. And He is the Most Mighty, All-Wise. (ar-Rum\/30: 27)"
		   },
		   {
			"id": 5940,
			"surah": 86,
			"ayat": 9,
			"tafsir": "In these verses it is explained that Allah will resurrect humans on the day when all secrets are revealed, namely the Day of Resurrection. At that time, no one could escape what had been determined as a reward for their actions, namely heaven for those who did good deeds and hell for those who disobeyed and violated Allah's commands. When in the afterlife, all humans will get a reward according to their respective deeds. So, everyone will get according to the charity that has been done in the world. There is no power that can change it and no helper who can help him except the power of Allah alone, as His word: And there is no (again) for him any group that can help him other than Allah; nor will he be able to defend himself. (al-Kahf\/18: 43)"
		   },
		   {
			"id": 5941,
			"surah": 86,
			"ayat": 10,
			"tafsir": "In these verses it is explained that Allah will resurrect humans on the day when all secrets are revealed, namely the Day of Resurrection. At that time, no one could escape what had been determined as a reward for their actions, namely heaven for those who did good deeds and hell for those who disobeyed and violated Allah's commands. When in the afterlife, all humans will get a reward according to their respective deeds. So, everyone will get according to the charity that has been done in the world. There is no power that can change it and no helper who can help him except the power of Allah alone, as His word: And there is no (again) for him any group that can help him other than Allah; nor will he be able to defend himself. (al-Kahf\/18: 43)"
		   },
		   {
			"id": 5942,
			"surah": 86,
			"ayat": 11,
			"tafsir": "In this verse, Allah swears by the sky that contains rain which is what humans really hope for, because it is rain that makes barren land fertile, that makes creatures living on earth live and that makes hot air cool."
		   },
		   {
			"id": 5943,
			"surah": 86,
			"ayat": 12,
			"tafsir": "Allah swears by the earth that has plants and fruits that are very necessary for the life of humans and their livestock."
		   },
		   {
			"id": 5944,
			"surah": 86,
			"ayat": 13,
			"tafsir": "Allah confirms that His oath with the heavens and the earth states that in fact the Al-Qur'an brought by the Prophet Muhammad is truly the word of Allah which separates between the right and the wrong, and is not a joke at all. Thus, the Qur'an should be a guide for all mankind. Allah explains in the Qur'an about what is right and wrong because of the limited ability of the human mind to know."
		   },
		   {
			"id": 5945,
			"surah": 86,
			"ayat": 14,
			"tafsir": "Allah confirms that His oath with the heavens and the earth states that in fact the Al-Qur'an brought by the Prophet Muhammad is truly the word of Allah which separates between the right and the wrong, and is not a joke at all. Thus, the Qur'an should be a guide for all mankind. Allah explains in the Qur'an about what is right and wrong because of the limited ability of the human mind to know."
		   },
		   {
			"id": 5946,
			"surah": 86,
			"ayat": 15,
			"tafsir": "Allah explains that the disbelievers are planning an evil deception by saying there is no resurrection day, as Allah explains in the following verses about what they have said: And of course they will say (also), \"Life is only in this world , and we shall not be resurrected.\" (al-An'am\/6: 29) And he makes up a parable for Us and forgets its origin; he said, \"Who can give life to the bones, which are shattered?\" (Yasin\/36: 78) Sometimes this deception took the form of slander which stated that the Prophet Muhammad was a sorcerer, poet, or mad. Ultimately, they plotted to kill the Prophet Muhammad, as Allah says: And (remember), when the disbelievers (Quraish) thought of a trick against you (Muhammad) to capture and imprison you or kill you, or expel you. They devised and Allah thwarted the deception. Allah is the best avenger of deceit. (al-Anfal\/8: 30)"
		   },
		   {
			"id": 5947,
			"surah": 86,
			"ayat": 16,
			"tafsir": "This verse explains that Allah deals with their evil plan by helping His Messenger and elevating His religion."
		   },
		   {
			"id": 5948,
			"surah": 86,
			"ayat": 17,
			"tafsir": "Allah ordered the Prophet Muhammad to continue his preaching and not expect the disbelievers to be punished quickly. Allah postponed His punishment so that their sins would multiply, so that when Allah sent down His punishment later, no one would pity them anymore. Allah said: We let them have fun for a while, then We forced them (to enter) into a severe punishment. (Luqman\/31: 24)"
		   }
	]
}
