{
	"tafseer": [
		{
			"id": 4273,
			"surah": 42,
			"ayat": 1,
			"tafsir": "These two verses consist of hijaiyah letters, as they appear at the beginning of several surahhs of the Qur'an. Scholars of commentary differ on the meaning of the letters. Furthermore, you are welcome to examine this issue in the \"Al-Qur'an and its tafsir\" volume I, namely the tafsir of the first verse of surahh al-Baqarah.\""
		   },
		   {
			"id": 4274,
			"surah": 42,
			"ayat": 2,
			"tafsir": "These two verses consist of hijaiyah letters, as they appear at the beginning of several surahhs of the Qur'an. Scholars of commentary differ on the meaning of the letters. Furthermore, you are welcome to examine this issue in the \"Al-Qur'an and its tafsir\" volume I, namely the tafsir of the first verse of surahh al-Baqarah.\""
		   },
		   {
			"id": 4275,
			"surah": 42,
			"ayat": 3,
			"tafsir": "In this verse, Allah, the Almighty, the All-Wise, explains that what was revealed to the Prophet Muhammad saw, among other things, so that he would preach about monotheism to unite Allah, also about prophethood, believe in the Last Day, improve oneself with good morals and keep him away from lowly things. and despised, charity for personal and societal happiness all of that, this has also been revealed to the previous prophets. Allah's Word: And We did not send any messenger before you (Muhammad), but We revealed to him, that there is no god (who has the right to be worshiped) besides Me, so worship Me. (al-Anbiya'\/21: 25) In another verse Allah says: Verily We revealed to you (Muhammad) as We revealed to Nuh and the prophets after him, and We have revealed (too) to Abraham, Ismail, Isaac, Jacob and his children and grandchildren; Isa, Ayyub, Yunus, Aaron and Solomon. And We have given the Book of the Psalms to David. (an-Nisa'\/4: 163)"
		   },
		   {
			"id": 4276,
			"surah": 42,
			"ayat": 4,
			"tafsir": "In this verse Allah explains that it is He who controls and owns everything in the heavens and everything on earth. This shows His unlimited power. He could have done as he pleased according to His will. All that exists, must submit to Him. It is He who governs all that exists, He is Most High, there is no kingdom or power higher than Him. He is great. To Him belongs what is in the heavens and what is on earth, the creation and ownership of Allah without being limited to His creatures. He is supreme in all His affairs, laws, and providences. Glory be to Allah, there is no god but Him."
		   },
		   {
			"id": 4277,
			"surah": 42,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that because of His greatness and majesty and greatness, the sky almost cracked, fell apart, and fell. The angels always glorify Allah from all shortcomings, praise and give thanks to Him for all the blessings that have been given to them, are obedient and obedient to His commands, never commit immorality and are disobedient to Him, as Allah says: They (angels) -angels) glorify non-stop night and day. (al-Anbiya'\/21: 20) And His word: Those who are not disobedient to Allah in what He commands them and always do what they are ordered to do. (at-Tahrim\/66: 6) The angels also always ask Allah to forgive the sins of those who believe on this earth, and inspire them so that they always follow the good ways that lead to happiness. The angel is likened to a light that gives life with the heat that is in it, and gives guidance with its light. In line with what is said above the word of Allah: (Angels) who carry the Throne and (angels) around him glorify their Lord and they believe in Him and ask forgiveness for those who believe (while saying) , \"O our Lord, Your grace and knowledge encompasses everything, so forgive those who repent and follow Your way (religion) and protect them from the torments of the burning hell. (Gafir\/40 : 7) This fifth verse emphasizes that Allah is Most Forgiving, forgives the sins of everyone who returns and repents to Him with repentance nasuha. Every creature has the right to receive mercy and compassion from Him. Postponing and postponing punishment and torment against people disbelievers and those who are disobedient, is a mercy and a sign of His mercy towards them."
		   },
		   {
			"id": 4278,
			"surah": 42,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that those who associate partners with Allah and take protectors besides Him, Allah alone is in control of their deeds, and it is He who will reward them accordingly in the hereafter for all their deeds in this world. Muhammad saw was not burdened and was not tasked with supervising their actions. He was only tasked with conveying what Allah ordered him to do, as He said: So in fact your duty is only to convey it, and We are the ones who take account of (their deeds). (ar-Ra'd\/13: 40) Therefore, he does not need to be upset and feel short of breath if they still deny and do not want to believe, because after all he does not force them to believe and receive guidance, except for things Allah wills it as He says: It is not your duty (Muhammad) to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272)"
		   },
		   {
			"id": 4279,
			"surah": 42,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains that the revelation that Allah sent down to the Prophet Muhammad was in Arabic, in accordance with the language of the inhabitants of the land of Mecca and its surroundings, to make it easier for them to understand the preaching and calls and warnings that Muhammad addressed to them, as well as every apostle sent. he uses the language of his people so that it is easy to explain to them as Allah says: And We did not send any messenger, but in the language of his people, so that he could explain to them. (Ibrahim\/14: 4) Even though only the inhabitants of Mecca and its surroundings are mentioned in this verse who were the targets of the preaching and warnings of the Prophet Muhammad, this does not mean that Muhammad was sent only to Arabs. Only residents of Mecca and its surroundings were mentioned, because it was in accordance with the position of the Prophet who was domiciled in Mecca at that time, whereas in essence Muhammad was a messenger for all mankind, as Allah said: And We did not send you (Muhammad), but to all mankind. humans as heralds of glad tidings and as warners, but most humans do not know. (Saba'\/34: 28) The words of the Prophet: Abu Hurairah narrated that the Prophet said, \"By my soul which is in His power, not one of my people, both Jews and Christians, listens to me, then dies but does not believe in ( treatise) assigned to me, unless he becomes a resident of hell.\" (Muslim History) The Prophet Muhammad was not only tasked with giving warnings to the people of Mecca and the people of the surrounding countries, he was also tasked with giving warnings about the Day of Judgment. The Day of Judgment is a certain and unquestionable day, where on that day all creatures will be gathered to account for their actions in the world and be rewarded according to their actions. Verse 7 ends with an affirmation that after a very thorough examination and a very careful calculation of every creature for all its actions in this world, they are divided into two groups. A group of them are among those who are happy and are admitted to heaven, eternally therein. Because they believe in Allah and His Messenger and do good deeds in the world, it is only natural that they are blessed by Allah to enjoy eternal pleasure in heaven, as Allah says: And as for those who are happy, then (the place) in heaven; they live in it. (Hud\/11: 108) Whereas the second group, including the wretched group; they are put into the burning fires of hell, eternal in it because they were in the world still disbelieved in Allah, opposed to what was accused by our master the Prophet Muhammad saw as the word of Allah: So as for those who are miserable, then (its place) in hell, there they exhale and inhale with a groan, they will remain therein. (Hud\/11:106-107)"
		   },
		   {
			"id": 4280,
			"surah": 42,
			"ayat": 8,
			"tafsir": "In this verse Allah explains that if He wills, then all human beings will have faith so that they become one people, but the wisdom that He takes is to leave matters of faith and disbelief to each individual human being. He does not want to force all human beings to have faith, but gives them the right to choose and determine their destiny according to their own will. Blessed are those who follow the instructions of the apostle. They are always grateful to praise Allah and will be included in His mercy and woe to those who always oppose and do not want to follow the instructions of the apostle, they will be tortured in the next day and no one will help and protect them. They cannot regret anyone but themselves, as the Prophet said: Whoever gets good should praise Allah and whoever gets other than that, let him not blame but himself. (Muslim history from Abu dzarr al-Giffari) Not a few verses are in line with this verse 8. Among other things, the word of Allah: And if Allah had willed, He would have made them all follow the instructions. (al-An'am\/6: 35) And His words: And if We will, surely We will give guidance to every soul (for) it. (as-Sajdah\/32: 13)"
		   },
		   {
			"id": 4281,
			"surah": 42,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains that the polytheists of Mecca have taken a protector other than Allah to help them in matters that need help. They have gone astray, because they take creatures as protectors who cannot bring benefits or prevent disaster for themselves let alone for others. If they wanted a protector who was true and real, who could bring benefits and ward off disaster, surely they would choose Allah as their protector, God Almighty over such things, God who gives life and causes death. God will resurrect them later in the hereafter, and they should not choose a weak and powerless creature as their protector, as Allah says: Verily, whatever you call on other than Allah cannot create even a single fly, even though they unite to create it. And if the fly takes something from them, they can't get it back from the fly. As weak as those who worship and those who are worshiped. (al-hajj\/22: 73)"
		   },
		   {
			"id": 4282,
			"surah": 42,
			"ayat": 10,
			"tafsir": "Allah explains that whatever is disputed regarding religious affairs, the decision should be returned to Allah, meaning that only Allah determines what is right and what is wrong. Humans in worldly life must follow Allah's instructions in the Qur'an and the Sunnah of the Prophet, as Allah says: you believe in Allah and the Last Day. (an-Nisa'\/4: 59) Meanwhile, it is only Allah who decides human disputes in the afterlife, because no creature has power, and only Allah has power, as the word says: Owner of the Day of Judgment. (al-Fatihah\/1: 4) It is He who will determine the law on the Day of Judgment, dealing with issues between people who are in dispute. It is only there that one can know clearly who is right and who is wrong, who deserves to enter heaven and who is the resident of hell. Who has the characteristics of life and death, determines the law between two people who are in dispute, none other than Allah, God Almighty, there are no gods other than Allah who are considered and acknowledged by them. It is to Him that people put their trust and surrender so that they are spared from all the evil efforts of their enemies and whether their business is successful or not, only to Allah is everything returned, and to Him we repent for all the sins and immorality that we have committed. As He says: And to Allah all things are returned. (al-Baqarah\/2: 210)"
		   },
		   {
			"id": 4283,
			"surah": 42,
			"ayat": 11,
			"tafsir": "Allah explains that it is He who created the heavens and the earth and all that is in them, as well as the strange and miraculous things that we witness astonishingly like the vast expanse of the firmament that stretches wide above us without any pillars to support it; therefore. He is the one who deserves and deserves to be relied on in all things and asked for His help and help; not their gods who are helpless and who can do nothing. It is He who makes for human beings of their own kind their respective mate; one is betrothed to another so that offspring are born for generations to prosper this world. This also applies to livestock which eventually reproduce to fulfill life on earth. In this way, the life of beings on this earth becomes orderly and secure for them. Food that is quite nutritious, refreshing drinks and other favors that must be grateful for to achieve happiness in the world and the hereafter. All of this shows the truth and power of God. There is no one who equals Him in all respects. He is All-Hearing, He hears everything that every creature says, He is All-Seeing. Nothing is hidden from Him. He sees all the deeds of His creatures, both good and evil. There is nothing that equals His power, greatness, and wisdom. Allah created everything in pairs. This verse clearly states this. Likewise the following verses: Glory be to (Allah) who has created everything in pairs, both from what the earth grows and from themselves, as well as from what they do not know. (Yasin\/36: 36) Allah's Word: And He who spread out the earth and made mountains and rivers upon it. And in him He made all the fruits in pairs; He closes the night to the day. Indeed, in that there are signs (the greatness of Allah) for people who think (ar-Ra'd\/13: 3) And His words And everything We created in pairs so that you remember (the greatness of Allah) . (adh-dzariyat\/51: 49) According to scientific studies, not only living things have pairs, but inanimate objects also have pairs. By using the science and sophisticated equipment that exists today, it can already be known about the existence of pairs from atoms to clouds. The atom, which was thought to be the smallest and indivisible being, turns out to be a pair. Atoms consist of electrons and protons. Protons which are positively charged are surrounded by a number of negatively charged electrons. The electric charges in these two groups of particles are perfectly balanced. Plants also have partners for growth and development. Previously, humans did not know that plants also have male and female sex differences. Fruit is the final product of the reproduction of higher plants. The stage that precedes the fruit is the flower, which has both male and female organs, the stamens and pistils. When the pollen is delivered to the pistil, it will produce fruit, which then grows, until it finally ripens and releases the seeds. Therefore the whole fruit reflects the presence of both male and female organs, a fact mentioned in the Qur'an. There are plants that have stamens and pistils so that they unite in their partners; and in pollination it does not need males from other flowers. However, there are also those who only have one of them so that to produce they need a partner from another flower. Only God is unpaired."
		   },
		   {
			"id": 4284,
			"surah": 42,
			"ayat": 12,
			"tafsir": "In this verse Allah explains that it is He who owns the treasures of the heavens and the earth. Whether something is good or bad is in His hands. Whoever is bestowed with grace, no one can prevent Him. On the other hand, whoever is not given grace, no one can bring it to him. It is He who extends sustenance to whom He wills, and He also limits sustenance to whom He wills. All of that happened according to His wisdom based on His vast power and His knowledge that encompasses all things. Islam commands its adherents to work and try to make a living for their life in this world. As for the results, in accordance with Allah's wisdom, there are those who succeed in obtaining a lot of wealth as a test, but there are those who only obtain a small fortune as a trial for their life. As Abu Bakr al-Jazairi in his Tafsir Aisar at-Tafasir stated: Allah expands sustenance for anyone as a test, and narrows it down as a trial."
		   },
		   {
			"id": 4285,
			"surah": 42,
			"ayat": 13,
			"tafsir": "In this verse Allah explains that He has prescribed religion to Muhammad and his people as He has also bequeathed it to Noah and the prophets who came after him, namely Abraham, Musa and Jesus. The Shari'a that was bequeathed to the Prophet Muhammad and previous prophets have similarities in basic creeds such as belief in Allah, prophetic treatises and the belief in the Day of Judgment or the Day of Judgment. Meanwhile, the religious foundation that became the main mission of the apostles was to worship Allah SWT and not associate partners with Him. Allah said: And We did not send any messenger before you (Muhammad), but We revealed to him, that there is no god (who has the right to be worshiped) besides Me, so worship Me. (al-Anbiya'\/21: 25) While the difference that is not fundamental among the treatises of the prophets is in the field of Shari'a which is furu'iyyah. Several forms of worship and their details, according to the development of the times, the needs and benefits of mankind. Allah says: For every nation among you, We give rules and clear paths. (al-Ma'idah\/5: 48) The hadith of the Prophet narrated by Abu Hurairah reads: The Messenger of Allah said, \"I am a human being who is more important than Isa bin Maryam in this world and the hereafter.\" The companions asked, \"Why, O Messenger of Allah?\" (History of Ahmad and Muslim) Allah only mentions the names of the prophets mentioned above because their position is higher compared to other prophets who are not mentioned, have great and heavy responsibilities, and because of their fortitude in facing trials and difficulties caused by their people so that they got the nickname Ulul Azmi from Allah. By mentioning the names of Musa and Jesus, it is hoped that Jews and Christians will be aware of and interested in the religion brought by Muhammad saw, the Divine religion which has many similarities to their religion, which is clearly stated in the Torah and the Bible, especially regarding monotheism, prayer, zakat. , fasting, pilgrimage and good morals such as keeping promises, being honest, connecting hospitality, and others. Allah ordered that the religion of Islam brought by Muhammad saw be maintained and fully upheld; its followers are prohibited from arguing with each other which can lead to divisions and undermine unity. Allah's Word: Indeed, the believers are brothers, so make peace between your two brothers (who are at odds) and fear Allah so that you may receive mercy. (al-hujurat\/49: 10) And His word: And hold fast all of you to the rope (religion) of Allah, and do not be divided. (Ali 'Imran\/3: 103) It seems difficult for polytheists to embrace the religion of monotheism, namely Islam brought by Muhammad saw and let go of the religion of shirk and worship their idols which have been passed down from generation to generation from their ancestors; their power has been enshrined in the Qur'an. In fact, we found that our forefathers adhered to a religion, and we were given instructions to follow in their footsteps. (az-Zukhruf\/43: 22) Indeed, not everyone can fulfill the call to embrace Islam that was brought by Muhammad, but Allah determines His servants whom He wills and guides them so that they embrace Islam."
		   },
		   {
			"id": 4286,
			"surah": 42,
			"ayat": 14,
			"tafsir": "In this verse Allah explains that the People of the Book, both Jews and Christians, after knowing the truth of the messengers who were sent to them, then divided into several groups, as Allah describes in His word: Indeed, those who divide their religion and they become (divided) into groups, you (Muhammad) are not in the least responsible for them. (al-An'am\/6: 159) They do this because of envy and hatred between them so that conflicts arise between sects among them which are difficult to overcome and resolve. They accuse each other, the Jews are convinced of the truth of their stance and beliefs, while the opinion of the Christians is that the Jews have no stance and beliefs. Vice versa, the Jews think that the Christians have no stand, as Allah says: And the Jews said, \"The Christians have nothing (holding),\" and the Christians (too) said, \"The Jews do not have anything (handle),\" (al-Baqarah \/ 2: 113) If there had not been a prior provision from Allah regarding the postponement of vengeance and torture for those who oppose and violate Allah's commands until the time He has determined (the Day of Judgment), they will surely be destroyed in this world and no longer need to be postponed until the hereafter. Disunity among mankind is generally accepted, not only among the People of the Book, but also among the Muslims themselves. If the Ahl al-Kitab experienced many divisions in the field of faith, Islamic groups experienced many disputes in the fields of fiqh, muamalat and marriage, which caused divisions among Muslims. The command to unite must be truly realized by Muslims, because the bad impact of this division is the weakening of the unity of the Ummah so that our bargaining position in various positions and fields in the international world becomes weak. Verse 14 concludes with an affirmation that the Jews and Christians who inherited the Torah and the Bible from their ancestors, who at the time of the Prophet saw the preaching of Islamiyah, they became doubtful about the truth of their Scriptures and really shook their beliefs. This is not surprising because in addition to their belief in the Samawi Book that is not deep, they embrace religion only because they follow their ancestors."
		   },
		   {
			"id": 4287,
			"surah": 42,
			"ayat": 15,
			"tafsir": "In this verse, God ordered the Prophet Muhammad to call on his people not to be divided like the People of the Book, to unite in embracing the monotheistic religion that was pioneered by the prophets, namely the religion of Islam that he brought and so that he would remain steadfast in facing them. Never be influenced by their doubts about the true religion that has been prescribed to them. He must always emphasize his conviction that he still believes in all that God has sent down from the sky, such as the Torah, the Gospel and the Psalms, and he does not lie in the slightest. The Prophet Muhammad was also ordered to be fair between them in determining the law and so on, by not reducing or adding to what Allah has ordained for him, and will deliver what he has been ordered to convey. This verse also explains that Allah is your God and our God. He is the only one who must be worshiped, who must be trusted with understanding. There is no God but Allah. For us our deeds, whether good or bad are our responsibility, rewarded or punished, and for all of you your deeds. We will not be happy because of your good deeds and will not be hurt because of your bad deeds. Each is responsible for his deeds. In line with this verse the word of Allah: And if they (still) belie you (Muhammad), then say, \"For me is my work and for you is yours. You are not responsible for what I do and I am not responsible for what you do.\" (Yunus\/10: 41) In this way, there should be no more fighting between Muslims and polytheists, whose rights and what is right is clear. Whoever is still rebellious and does not want to believe it means he is in denial. In time it will be clear and visible who is right among the adherents of religion because Allah will gather all mankind later in the day to come, and it is there that He will make the fairest possible decision on what is in dispute, as Allah says: Say, \"Our Lord will gather all of us, then He will judge between us correctly. And He is the Most Decision-giver, All-Knowing.\" (Saba'\/34: 26) It is to Him that all humans will return after death and be accountable for all the deeds in the world. All people will receive a reward according to their respective deeds, as Allah says: So whoever does an atom's weight of good, surely he will see (reply) it, and whoever does an atom's weight of evil, surely he will see (reply) it. (az-Zalzalah\/99: 7-9) Wahbah Zuhaili in his commentary al-Munir concluded the ten commandments of Allah and their prohibitions not only for the Prophet but also for all Muslims. The ten commandments and prohibitions are: 1. The order to the Prophet to continue preaching conveys his message. 2. Istiqamah in the delivery. 3. Prohibition for the apostle not to follow the wishes of the polytheists of Mecca or the People of the Book, to follow their worship. 4. The command to believe and express faith in the heavenly books that Allah sent down. 5. An order to act fairly among Muhajirin and when dealing with disputes that occur between them. 6. The command vows that only Allah is worthy of worship, there is no other God. 7. An order to declare to the People of the Book that each is responsible for their deeds and the good and bad retribution of these deeds. 8. The command to state that there is no enmity between the prophets and the People of the Book, because the truth of Allah is clearly visible. 9. An order to state that Allah will later gather the Muslims and People of the Book in Padang Mahsyar to face Allah's judgment. 10. Only to Allah all creatures will return."
		   },
		   {
			"id": 4288,
			"surah": 42,
			"ayat": 16,
			"tafsir": "In this verse Allah explains that those who still argue against the truth of Allah's religion, even though that religion has been well accepted by society, their efforts and arguments will be in vain. They were displeased by Allah for their courage in denying the truth of Islam. They will be punished in the next day because of their arrogance in leaving a religion whose truth can be proven true. It was narrated that the Jews said to the believers, \"O believers! You all have said that taking and accepting what has been agreed upon is better than taking and accepting what has been disputed. The prophethood of Musa and his Torah has been accepted and agreed on the truth while Muhammad's prophethood is still disputed and disputed. So it is Judaism that is proper and worthy of being taken and accepted.\" To paralyze their reasoning, Allah put forward evidence that the obligation to believe in and believe in the truth of Moses was due to a miracle given to him by Allah which showed and proved his truth. Some of the miracles given to the Prophet Muhammad can be witnessed by the Jews themselves. So it is obligatory for all of us to acknowledge and believe in the prophethood of Muhammad saw."
		   },
		   {
			"id": 4289,
			"surah": 42,
			"ayat": 17,
			"tafsir": "In this verse Allah explains that He has sent down His books to His prophets, which contain undoubted truth, far from falsehood and all contain goodness. He gave orders to do justice to be a reference for determining punishment in trying people who are accused of guilt and punishing them with the punishments that have been stipulated in His Book. Allah's Word: Indeed, We have sent Our messengers with clear evidence and We have sent down with them the book and the balance (justice) so that humans can act fairly. (al-hadid\/57: 25) The conclusion of this verse encourages us to do good and justice for the happiness of the hereafter and to stay away from worldly temptations. Because it is not known when the world will end, then of course we must obey and obey the instructions of the Qur'an, always do justice among fellow human beings, practice what is commanded, always be alert to the possibility of God's call that may come suddenly. , then there is no more opportunity to do good, it will be a loss for him, and on the Day of Resurrection he will regret for wasting the opportunity that was there to do good. Word of the Prophet saw: Rasulullah saw said, \"No one dies but he regrets.\" The companions asked, What are their regrets, O Messenger of Allah?\" The Prophet replied, \"If he is a person who does good then he regrets because his goodness does not increase anymore. If he is a bad person then he regrets that he did not have time to rid himself of that evil. (History of at-Tirmidhi)"
		   },
		   {
			"id": 4290,
			"surah": 42,
			"ayat": 18,
			"tafsir": "It is narrated that once on one occasion the Prophet Muhammad mentioned the Day of Judgment and at that time there were polytheists. So they ask in a mocking tone and belie the arrival of the Doomsday, \"When is the Doomsday?\" So this verse was revealed, the history above tells us that those who do not believe in the Day of Judgment will mock the Prophet and deny him. They want the Day of Judgment to come soon to prove who is right, they or Muhammad and his companions are right? Unlike the case with the believers. Believers are afraid and anxious about the coming of the Doomsday. They don't know what will happen to him that day. They must be held accountable for their deeds in this world and receive good and bad rewards for their actions. In line with this verse the word of Allah: And those who give what they give (alms) with a heart full of fear (because they know) that they will return to their Lord. (al-Mu'minun\/23: 60) This verse concludes with the assertion that those who argue and deny the existence of the Day of Judgment are people who go astray, go the wrong way, far from the truth. Because believing in the Day of Judgment is one of the pillars of faith, denying the Day of Judgment means denying God's truth because justice is only human rights on the Day of Judgment. in God's court. People who desire the hereafter in the sense of believing in it and preparing to face it are people who have far-sighted visions, while those who deny the Day of Judgment and who think their lives end in death are people whose visions of life are narrow. They will never feel spiritual satisfaction, because they are busy pursuing worldly pleasures. One of the characteristics that distinguishes between religious teachings and human thought that has been applied by humans in this world is the belief in the afterlife or the Day of Judgment, because it can be said that the essence of faith in Allah is faith in the hereafter, a place and time where humans must be held accountable. all his deeds in the world. The news about the Day of Judgment and the resurrection of the dead must have come true. Allah is the creator of the heavens and the earth, He is also able and powerful to destroy them and revive those who have died. As Allah says: And it is He who began creation, then repeats it again, and it is easier for Him. (ar-Rum\/30: 27)"
		   },
		   {
			"id": 4291,
			"surah": 42,
			"ayat": 19,
			"tafsir": "Allah explains that He Himself always does good to His servants. He gives them useful things, keeps them away from threatening disasters, bestows sustenance on His servants who believe and disbelieve without distinction between them. Allah also broadens and narrows the sustenance for His servants whom He wants as a test for the rich in their attitude towards the poor and a test for the poor in relation to the rich, so that the relationship between one person and another will be good because they need each other. As Allah says: Are they dividing the mercy of your Lord? It is We who determine their livelihood in the life of this world, and We have exalted some of them above others by several degrees, so that some of them can take advantage of some of the others. And the mercy of your Lord is better than what they collect. (az-Zukhruf\/43: 32) It is further explained that Allah is Almighty and Mighty, He does according to His will, no one can prevent and hinder what He wills."
		   },
		   {
			"id": 4292,
			"surah": 42,
			"ayat": 20,
			"tafsir": "In this verse it is explained that whoever wants to be rewarded with his deeds and efforts, Allah will make it easy for him to do good deeds, then He will reward his deeds, one goodness with ten goodness until it is multiplied according to Allah's will. And vice versa, whoever expects from his deeds the luxuries of the world in all its forms and does not even hope for the deeds and rewards of the hereafter, Allah will give as much as has been determined for him, but he will not get the slightest reward in the hereafter because the deed is in accordance with his intention, and for each person the reward is according to his intention, as the words of the Prophet saw: That deeds are according to their intentions, and that for everyone there will be a reward according to what he intended. (Al-Bukhari and Muslim) Qatadah said, \"Indeed Allah rewards those whose deeds are intended for the hereafter other than for worldly pleasures according to his will. Allah does not reward in the hereafter to those who do deeds with the intention of obtaining worldly pleasures only.\" This is in line with the word of Allah: Whoever wants the present (worldly) life, then We will hasten for him in this (world) what We want for the person We want. Then We prepared for him (in the Hereafter) the Hell of Hell; he will enter it in a disgraceful state and expelled. And whoever desires the afterlife and strives towards it in earnest, while he believes, then those are the people whose efforts are well rewarded. (al-Isra'\/17: 18-19)"
		   },
		   {
			"id": 4293,
			"surah": 42,
			"ayat": 21,
			"tafsir": "In this verse, Allah explains that polytheists do not follow the religion of Islam that has been prescribed by Allah, but follow what is outlined by their demons, both in the form of jinn and in the form of humans. They forbid something according to their desires such as forbidding a camel with its ear cut off, and forbidding carrion, blood, gambling, and so on. Likewise things that show their error that has been done in the Age of Jahiliyyah. Even so, they are still given the opportunity to repent, because Allah has outlined one provision, namely the suspension of their punishment until the Day of Judgment. If not, they would have been destroyed, as Allah says: Even the Day of Judgment is the day that was promised to them and the Day of Judgment is more terrible and more bitter. (al-Qamar\/54: 46) They have done injustice to themselves because they have made up things that are not ordained by Allah. They will be put into hell, a place full of painful torments and the worst place to return."
		   },
		   {
			"id": 4294,
			"surah": 42,
			"ayat": 22,
			"tafsir": "In this verse Allah explains that those who are unjust look afraid, overshadowed by the consequences of the various evil deeds they have done in this world, and the punishment that is the recompense for their evil deeds that will surely befall them. Whereas those who believe in Allah and obey what He has ordered and forbidden will be entered into heaven, a place full of beautiful gardens, enjoying all the beauty and pleasures in it according to their wishes, whether in the form of food, drink, or in the form of sights that eyes have never seen, ears heard, and never crossed the human heart. All of that is a great pleasure that God has given them, which is far greater than any luxury that has ever existed in the world, as God's word: This is God's gift, given to whom He wills. And Allah has a great bounty. (al-hadid\/57: 21)"
		   },
		   {
			"id": 4295,
			"surah": 42,
			"ayat": 23,
			"tafsir": "In this verse Allah explains that what has been announced regarding the granting of gifts and pleasures and glory in the hereafter for His servants who believe and do good deeds is one good news that is conveyed in the world so that it is clear to them that this will surely come true. Furthermore, Allah ordered Muhammad to convey to his people that in carrying out the task of calling for and conveying the true religion, he did not ask for anything in return, but he only hoped that the Muslims would love him, his relatives and other Muslims. Whoever does good, obeys, and obeys the commands of Allah and His Messenger, Allah will multiply goodness to him. One good is rewarded with at least ten good deeds, up to seven hundred good deeds and even more, as a mercy and gift from Allah, as Allah says: Indeed, Allah will not wrong anyone even if it is as big as dharrah, and if there is good (as small as dharrah), surely Allah will multiply it and give a great reward from Him. (an-Nisa'\/4: 40) Allah's Word: Whoever does good will be rewarded tenfold for his deeds. (al-An'am\/6: 160) Allah says: The parable of a person who spends his wealth in the way of Allah is like a seed that grow seven stalks, on each stalk a hundred seeds. Allah multiplies for whom He wills, and Allah is All-Knowing, All-Knowing. (al-Baqarah\/2: 261) Furthermore, verse 23 closes with an explanation that Allah forgives the mistakes of His servants no matter how many and multiplies the rewards of good deeds even if they are few, because He is God, Most Forgiving, Most Grateful."
		   },
		   {
			"id": 4296,
			"surah": 42,
			"ayat": 24,
			"tafsir": "In this verse, Allah rejects the accusation by the polytheists of Mecca that Muhammad (pbuh) fabricated lies against Allah. This is a very bad deed. If Allah had willed, surely He could have locked your heart to death because of such an act, it is not done except by polytheists. But Allah's sunnah has been in effect and will continue to apply, that He always destroys and eradicates what is false and strengthens what is right and instills the essence of that right among humans in accordance with the provisions He has determined. That is why the religion brought by Muhammad saw day by day is getting stronger and more stable, more widespread, and more and more adherents. Allah is All-Knowing of everything that is stored in the heart, nothing is hidden from Him, so everything happens based on Allah's vast knowledge, covering everything. Therefore their accusations against the Prophet Muhammad who were considered to have fabricated lies about Allah were known to Him and have been proven untrue in this verse."
		   },
		   {
			"id": 4297,
			"surah": 42,
			"ayat": 25,
			"tafsir": "In this verse Allah explains that it is He who accepts the repentance of His servants, forgives sins and crimes. Sayyidina 'Ali was once asked about repentance. He replied, \"Repentance has six conditions.\" 1. Regretting the immoral acts that have been done in the past. 2. Perform obligatory worship that has been abandoned. 3. Restore the rights of people who have been unjustly taken. 4. Forcing himself to feel the bitterness of obedience as he feels the sweetness of immorality. 5. Subduing his lust in obedience as he has spoiled it by committing disobedience. 6. Crying instead of the laughter he once did. This verse closes with an explanation that Allah is Forgiving of all sins and knows everything that His servants have done, whether good or evil, then they are rewarded with rewards and punishments."
		   },
		   {
			"id": 4298,
			"surah": 42,
			"ayat": 26,
			"tafsir": "In this verse Allah explains that He always allows (prayers) those who believe and do good deeds and increase their rewards and gifts, as Allah says: And your Lord said, \"Pray to Me, I will surely approve of you. (Gafir \/40: 60) Allah said: And when My servants ask you (Muhammad) about Me, then verily I am close. I grant the request of the one who prays when he prays to Me. (al-Baqarah\/2: 186)"
		   },
		   {
			"id": 4299,
			"surah": 42,
			"ayat": 27,
			"tafsir": "In this verse Allah explains that He will not give His servants abundant sustenance, if that gift can lead them to arrogance and arrogance, as Allah says: Absolutely not! Truly, humans really transgress, when they see that they are self-sufficient. (al-'Alaq\/96: 6-7) Allah provides sustenance to His servants to a certain degree, according to His will and in accordance with His wisdom. With the nature of Allah's mercy, He still provides sustenance even though the person does not believe, even when humans forget their Lord, that's when Allah bestows even more sustenance. If they remain ungrateful and indulge in pleasure, then Allah will impose their punishment as Allah says: So when they forgot the warning given to them, We opened all doors (pleasure) for them. So that when they were happy with what had been given to them, We punished them suddenly, then they fell silent in despair. (al-An'am\/6: 44) Based on the explanation above, it can be said that a person's wealth is not an indicator that God loves him, but wealth actually becomes a touchstone for one's faith. An example of how a person's attitude towards his wealth can be seen whether he uses it to benefit himself and others, because of the involvement of other people's rights to his wealth and as a sign of gratitude to the giver of wealth, or he uses the wealth only for his own pleasure and claims that his wealth obtained through his own efforts, thus forgetting Allah who gives wealth. Allah says: And know that your wealth and your children are only a trial and verily with Allah there is a great reward. (al-Anfal\/8: 28) In this case, Karun and Pharaoh became a clear example, because their wealth and glory caused them to be arrogant to Allah. Abu Hani 'al-Khaulani said, \"I heard 'Amr bin Khurait and others say that this verse (verse 27) was revealed to the ahlusuffah (inhabitants of the porch of the Prophet's mosque in Medina); they wished to have property (which was piled up) ), they dream of the splendor of the world."
		   },
		   {
			"id": 4300,
			"surah": 42,
			"ayat": 28,
			"tafsir": "In this verse Allah explains that it is He who sends down rain from the sky, helping those who have given up hope because the water that was expected to come from the sky has not come. He is the one who gives the blessings of the rain and brings many benefits and makes the land fertile. He is the one who controls the affairs of His servants, giving them maslahat. He is the one who must be praised for the grace that has been bestowed upon them. Qatadah said, \"It is narrated that a man said to 'Umar bin al-Khaththab, \"Rain does not fall, people are desperate, O Commander of the Faithful.\" Umar replied, \"You will be blessed with rain,\" then he read this verse."
		   },
		   {
			"id": 4301,
			"surah": 42,
			"ayat": 29,
			"tafsir": "In this verse, Allah explains that some of the signs of His power and greatness are the creation of the heavens and the earth and what is spread over them, such as animals that crawl and move, including humans, jinn, and all animals with various shapes and patterns and colors. . God has the power to gather people in the next day, both those who came first and those who came later, as well as other creatures; in Padang Mahsyar then He will reward them as fairly as possible. As Allah says: And (remember) the day (when) We traveled the mountains and you will see the earth is flat and We gather them (all mankind), and We did not leave any of them. (al-Kahf\/18: 47) If we pay attention to the verse above, we feel that Allah is explaining about the existence of other living things in outer space. Before discussing the above verses, it is necessary to pay attention to the related verses below: And He has subjected everything in the heavens and what is in the earth to you, everything (as a mercy) from Him. Indeed, in that case there are indeed signs (of Allah's greatness) for people who think. (al-Jatsiyah\/45: 13) The verse above mentions the word \"subdue\". The word can be interpreted that humans can take advantage of celestial bodies, such as planets and stars. An example is the moon and the sun which have regular orbits. The regularity of this orbit is used by humans to make time markers or calendars and other things for their life needs. Another example is regarding the arrival of iron from outer space which is clearly stated in surahh al-hadid\/57: 25. It is clearly stated that Allah has created galaxies, planets and stars and other heavenly bodies, and spread on them, among other things, living things as his creations. That is, it is quite possible that He sent creation from one planet to another. Likewise with two other verses which discuss livestock sent down from space (al-An'am\/6:143 and az-Zumar\/39: 6). Koran. On August 7, 1996, researchers from NASA (United States Space Agency) announced the discovery of microscopic life on the planet Mars three billion years ago. Although many oppose this theory, the Galileo spacecraft's finding of a red sea under a layer of ice on the planet Jupiter's satellite, Europe, is very promising. In the near future, the oldest question that has always been embedded in the human mind will be answered: \"Are there living things up there? Or are we in this world the only living things in the universe?\" If there is life up there, then where can they be found. Our first guess is on the planets that are there. On the \"earths\" that exist in the galaxies that exist in the universe. This is reflected in the Qur'an in surahh ath-thalaq\/65: 12 which states, \"Allah created the seven heavens and the earth like them ......\" Thus, because there are millions of galaxies, Allah also created billions of earths, spread over universe. While the word \"earth\" used here indicates a planet that has life. By adhering to the statements of the Qur'an and the little evidence obtained by science, we come to the conclusion that extraterrestrials do exist. The next question is, will we be able to find it? Allah gives an indication in surahh Fussilat\/41: 53 \"We will show them our signs (verses) in all horizons ....\". This indication gives hope that one day we will be able to meet extraterrestrial life, including intelligent beings."
		   },
		   {
			"id": 4302,
			"surah": 42,
			"ayat": 30,
			"tafsir": "In this verse Allah explains that what befalls people in the world in the form of diseases and other disasters is the result of their own actions, the immoral acts they have committed and the sins they have committed as the words of the Prophet saw: 'Ali said, \"Would you like me to tell you about a very important verse in the Qur'an as the Prophet conveyed to us. (The Prophet recited the word of Allah) \"And whatever calamity befalls you is the result of your own hands, and Allah forgives many (of their mistakes). \"O 'Ali , I will explain this verse to you, \"Whatever calamity befalls you\" i.e. from sickness and torment or calamity in the world, \"caused by what your own hands have done\" (History of Ahmad) There is no fatigue, sickness, distress, sadness , tyranny, narrowness, even a thorn that stabs a Muslim, but with that Allah erases his sins.(Al-Bukhari History) Coming illness or disaster is caused by human activity itself. But on the other hand, illness or calamity can erase sins like the hadith above. It depends on how humans react, whether by being patient or giving up. This verse closes with the assertion that Allah forgives most of the mistakes that have been made by His servants as a great mercy that Allah has bestowed on His servants, because if not, humans will surely be destroyed according to the pile of sins they have committed. as Allah says: And if Allah punishes people for their tyranny, surely there will be nothing left by Him (on earth) even from creatures that crawl, but Allah postpones them until an appointed time. (an-Nahl\/16: 61) And His words: And if Allah were to punish people for what they have done, He would not have spared a single living moving creature on this earth, but He suspended (punishment) it, until specified time. (Fathir\/35: 45)"
		   },
		   {
			"id": 4303,
			"surah": 42,
			"ayat": 31,
			"tafsir": "In this verse Allah explains that humans will not be able to escape and will not be able to escape Allah's punishment in this world and wherever they are. They will not get a protector, because only Allah will be able to protect them from the punishment that will befall them due to the sins they have committed. They will not get a helper other than Allah if they get the punishment. Therefore, humans should stay away from immorality and not violate His orders because no one can refuse Allah's punishment, if He has imposed punishment on His servants. If human beings who live in sin are not punished in this world, do not think that it is because of someone's power or might, but because Allah wills that so that they will receive harsher and more painful punishments in the hereafter, as Allah says: times those who disbelieve think that the time limit We have given them is better for them. Indeed, the grace period that We have given them is only so that their sins will increase; and they will have a humiliating punishment. (Ali 'Imran\/3: 178)"
		   },
		   {
			"id": 4304,
			"surah": 42,
			"ayat": 32,
			"tafsir": "In this verse Allah explains that some of the signs of His power, greatness and might are that He subdued the sea for humans so that ships can sail on the sea like a large mountain or a village on the water. This verse likens ships sailing like mountains. This verse also implies that actually the mountains also move, something that is difficult for ordinary people to understand, but something that has been accepted in geology. As geologists often say, mountains actually float like ships float in the ocean. In this verse, Allah actually shows that a sailing ship is like a mountain, which is difficult for ordinary people to understand. To the layman the mountains appear to be still. The mountains (in this case as part of the continents\/continents) do in fact float above the asthenosphere and move like ships sailing (see explanation in Juz 20, An-Naml\/27: 88). As is well known, it was only in the decade of the sixties of the 20th century that the theory of continental drift, whose forerunner had started in the early 20th century, together with the theory of mid-ocean spreading as the basis for the theory of plate tectonics was discovered by scientists."
		   },
		   {
			"id": 4305,
			"surah": 42,
			"ayat": 33,
			"tafsir": "If Allah wanted the ship that was sailing to not be able to sail again, then He would hold back the wind that pushed the ship to move and sail, and the ship would remain on the surface of the water unable to move forward or backward. People who can understand and realize this are people who have a broad outlook, are patient and obedient to God's commands, always grateful for the blessings that God has bestowed upon them. The existence of disasters that occur in a place in the form of earthquakes, landslides, waves that wash away and destroy, and others are considered by some people to be just natural events that have nothing to do with the power of God. Allah's Word: And how many signs (of Allah's greatness) in the heavens and on the earth did they go through, but they turned away from it. (Yusuf\/12: 105) This verse is a continuation of the previous verse (asy-Syura\/42: 32), that after successfully floating on the water, traditional ships need wind energy as a propulsion. With the wind, sailing ships can be pushed and with it can also be controlled through the use of sails and rudders. If the wind stops, the ship practically cannot move. In the absence of wind, the sea waves will also stop."
		   },
		   {
			"id": 4306,
			"surah": 42,
			"ayat": 34,
			"tafsir": "In this verse it is explained that apart from Allah having the power to hold back the wind so that the ship cannot move from its place, He also has the power to destroy the ship by sending a hurricane which makes the sailing ship shake, the direction it takes is uncertain, it will not reach its intended target. , finally sank to the bottom of the sea due to its passengers who wallow in sin. However, this rarely happens because Allah has forgiven and forgiven most of them, so that they are safe on their way across the wide sea to their destination."
		   },
		   {
			"id": 4307,
			"surah": 42,
			"ayat": 35,
			"tafsir": "In this verse Allah explains that the things described above show His power and might; I hope those who always argue and do not want to acknowledge Allah's power can realize that the one who can benefit and bring harm is none other than Allah and if He so wills, then no one can avoid or escape from the punishment that has been determined."
		   },
		   {
			"id": 4308,
			"surah": 42,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains that the pleasures of human life, whether in the form of wealth, accumulating wealth, as well as offspring, etc., are pleasures that are meaningless and of little value because no matter how wealth is accumulated, the time to own it is limited. In time it will separate because if it is not the people who leave it, then the objects themselves will leave the humans, while the rewards and favors that are with Allah are far better than the pleasures and splendor of that world, because what is with Allah eternal and eternal, while the pleasures of the world are all mortal and will vanish. This verse closes with the assertion that eternal and everlasting pleasure is only for those who believe in Allah and His Messenger, those who put their trust in and surrender to God who has cared for and done good to them. Al-Qurthubi in his commentary quoted the history of 'Ali who said that when Abu Bakr collected wealth from the Bani Murrah he donated all the money for good because he hoped to please Allah. His actions were criticized by polytheists while unbelievers blamed his actions, so verses 36 and 37 of this surahh were revealed."
		   },
		   {
			"id": 4309,
			"surah": 42,
			"ayat": 37,
			"tafsir": "In this verse, Allah explains that those who will get eternal pleasure in the hereafter are those who stay away from big sins such as killing, adultery and stealing, and avoid things that are not justified by social status, common sense, and noble character, whether in the form of speech or deed. So do people who when their anger arises, they keep their anger silent, forgive the person who caused their anger and do not have the slightest feeling of revenge in their hearts. It is narrated that Rasulullah SAW never defended his interests except when Allah's laws were violated and humiliated. Forgiveness is a trait that is close to piety and is indeed commanded by Allah, as He says: Liberation is closer to piety. (al-Baqarah\/2: 237) And His words: Be forgiving and order people to do what is right, and do not care about those who are stupid. (al-A'raf\/7: 199)"
		   },
		   {
			"id": 4310,
			"surah": 42,
			"ayat": 38,
			"tafsir": "This verse explains that those who respond favorably to Allah's call to His religion, such as confirming and purifying His Essence from worshiping other than Him, establish fardu prayers at the perfect time to cleanse their hearts from false intentions and distance themselves from evil deeds, whether seen or unseen, always deliberating to determine attitudes in dealing with complicated and important matters, all of which will get eternal pleasure in the afterlife. In a similar verse, Allah says: And consult with them in this matter. (Ali 'Imran\/3: 159) The same goes for giving out sustenance in the way of Allah, spending it in ways that are useful and beneficial for individuals, society, homeland and nation. They will also get eternal pleasure in the hereafter. In another verse Allah says: O you who believe! Spend some of the sustenance that We have given you. (al-Baqarah\/2: 254) And His word: O you who believe! Spend some of the results of your good efforts. (al-Baqarah\/2: 267)"
		   },
		   {
			"id": 4311,
			"surah": 42,
			"ayat": 39,
			"tafsir": "In this verse, Allah explains that among the characteristics of those who will gain everlasting happiness in the hereafter are those who, when treated arbitrarily by others, will defend themselves and repay the person who wronged them, on condition that the defense self is not beyond the tyranny that befell him. In this self-defense they will receive help from Allah, as He says: Thus, and whoever repays in proportion to the (tyranny) persecution he has suffered and then he is wronged (again), surely Allah will help him. (al-hajj\/22: 60)"
		   },
		   {
			"id": 4312,
			"surah": 42,
			"ayat": 40,
			"tafsir": "In this verse, Allah explains that acts of self-defense committed by someone who is being abused by another person should be directed at the perpetrator of the abuse and be balanced with the severity of the abuse. Retaliation or excessive self-defense is not justified by religion, this is in accordance with the word of God: Whoever attacks you, then attack him in proportion to his attack on you. (al-Baqarah\/2: 194) In another verse Allah says: And if you reply, then repay with (reply) the same as the punishment that was inflicted on you. But if you are patient, indeed that is better for those who are patient. (an-Nahl\/16: 126) In the current situation, people who are abused by other people, may not be able to directly defend themselves or demand their rights from those who abuse them because of various limitations, so they can ask for help from the authorities. who can take action to defend their rights, such as the police, courts and so on. It should be reminded that one's rights must be defended, don't just remain silent when other people take away their rights. Many hadiths explain rights such as: Whoever is killed for defending his property, then he is a martyr. Whoever is killed for protecting his life, family and religion, then he is a martyr. (History of Abu Dawud and at-Tirmidhi) Even so, this verse also recommends not repaying other people's crimes, but forgiving and treating well those who do evil to us because Allah will reward those who forgive other people's mistakes, other than that forgiving others is a penance. Allah's Word: And wounds (even) have qisas (the same reply). Whoever releases his (qisas rights), then that (becomes) a penance for him. (al-Ma'idah\/5: 45) Verse 40 closes with an affirmation that God does not like unjust people who transgress in taking revenge for the crimes they have experienced."
		   },
		   {
			"id": 4313,
			"surah": 42,
			"ayat": 41,
			"tafsir": "In this verse Allah explains that a person who does something because he is defending himself from a persecution or a crime that has befallen him, there is no way to prosecute it from the side of the law and he is not guilty because he does it based on rights. But those who commit injustice, commit crimes on earth and transgress in giving vengeance, they are the ones who can be prosecuted and will receive a painful punishment and torment in the hereafter."
		   },
		   {
			"id": 4314,
			"surah": 42,
			"ayat": 42,
			"tafsir": "In this verse, Allah rejects the accusation by the polytheists of Mecca that Muhammad (pbuh) fabricated lies against Allah. This is a very bad deed. If Allah had willed, surely He could have locked your heart to death because of such an act, it is not done except by polytheists. But Allah's sunnah has been in effect and will continue to apply, that He always destroys and eradicates what is false and strengthens what is right and instills the essence of that right among humans in accordance with the provisions He has determined. That is why the religion brought by Muhammad saw day by day is getting stronger and more stable, more widespread, and more and more adherents. Allah is All-Knowing of everything that is stored in the heart, nothing is hidden from Him, so everything happens based on Allah's vast knowledge, covering everything. Therefore their accusations against the Prophet Muhammad who were considered to have fabricated lies about Allah were known to Him and have been proven untrue in this verse."
		   },
		   {
			"id": 4315,
			"surah": 42,
			"ayat": 43,
			"tafsir": "In this verse Allah explains that those who are patient and forgive the evil that others have done to themselves, while they are able to repay them, they have done something important and they are entitled to receive a great reward. It was narrated by Abu Hurairah that a man abused Abu Bakr, while the Prophet was sitting with him, smiling, there was so much abuse that Abu Bakr returned the abuse. Then the Prophet got angry and got up from his seat, then Abu Bakr followed him and said, \"O Messenger of Allah, he abused me while you were sitting (watching him), when I replied to his abuse you got angry and got up (left me).\" The Apostle then replied, \"Indeed (when you are insulted) the angel is with you to reply to that person's abuse, when you reply to the abuse, the devil is present (there), so I do not want to sit with the devil.\" Then the Apostle said, O Abu Bakr, there are 3 things that are all true, namely: 1. A servant was mistreated, then he forgave his persecutor, then he will be glorified by Allah and won over his enemy. 2. A man who gives a gift with the intention of strengthening friendship relations will be given by Allah a lot of additional sustenance. 3. Those who beg with the intention of enriching themselves will be reduced by God's sustenance."
		   },
		   {
			"id": 4316,
			"surah": 42,
			"ayat": 44,
			"tafsir": "In this verse Allah explains that what He wills must come true and no one can stop Him; otherwise what He does not will, will not happen. Whoever has been guided by Allah will not lead him astray, and whoever has been allowed to go astray by Allah, because he always does evil, no one will be able to guide him to the right path, which will help him achieve happiness and good fortune. . Allah's Word: And whoever He leads astray, then you will not find a helper who can guide him. (al-Kahf\/18: 17) When the disbelievers in the afterlife see and witness the doom in front of their eyes, they wish they could return to the world to do good and have faith. They said, \"Is there still a way for us to return to the world?\" If they were able to return to the world, they would not believe and do good, they would still violate Allah's prohibitions. This is also described by Allah in another verse with His words: And if you (Muhammad) see when they are brought to hell, they say, \"If we were returned (to the world), surely we would not deny the verses of our Lord. , and become people of faith.\" But (actually) for them the evil that they hid before was revealed. If they were returned to the world, of course they would repeat what they had been forbidden to do. They are real liars. (al-An'am\/6: 27-28)"
		   },
		   {
			"id": 4317,
			"surah": 42,
			"ayat": 45,
			"tafsir": "In this verse Allah explains that when these disbelievers are brought to hell, they are very afraid and feel humiliated because they know and believe that it is the result of the transgressions and sins they have committed, they know the greatness and power of God whom they have disobeyed. . They can't stare at the blazing fires of hell, they see it with listless eyes, just like a person who is led to be killed when he sees a shining sword that will consume his life. He would not be able to look at the sword, but he saw it with leering eyes and in a languid and stealthy vision. At that time the believers said, \"Indeed, the losers are those who have wronged themselves so that they are put in hell and do not get the slightest pleasure and eternal pleasure in heaven; they are separated from those who loved him, his friends, and his family.\" This is an incomparable loss. At the end of this verse it is explained that the disbelievers will be in endless torment. There was no way for them to escape and escape the torment."
		   },
		   {
			"id": 4318,
			"surah": 42,
			"ayat": 46,
			"tafsir": "In this verse it is explained that a person will not get help from anyone to save them from the torment that befalls them. The idols that they once worshiped in this world could not help at all, it would even be impossible to defend them and release them from the punishment that was befalling them. Verse 46 concludes with an assertion that those who are allowed to go astray by God have become their character and character, they will always commit crimes, corruption and violations against religious prohibitions; they will no longer be able to be repaired, will no longer be able to do things that are right and right in this world, and will not be able to enter Jannatun Na'im heaven in the hereafter."
		   },
		   {
			"id": 4319,
			"surah": 42,
			"ayat": 47,
			"tafsir": "Allah explains that He has ordered that humans obey and obey and accept the call of His Messenger, Allah's religion which was conveyed before the day comes when no one can hold back, refuse and hinder its arrival, namely the Day of Judgment. On that day they did not have any place to take refuge that would save them from trouble, and they could not deny the evil they had done in the world, because all of this was clearly stated in their respective practice books and tongues. and their limbs bear witness. Either way they will not be able to escape and escape the awesomeness of that day. In this connection Allah says: On that day people will say, \"Where to run?\" No! No shelter! Only to your Lord is the place to return on that day. (al-Qiyamah\/75: 10-12)"
		   },
		   {
			"id": 4320,
			"surah": 42,
			"ayat": 48,
			"tafsir": "In this verse Allah explains that if the Prophet Muhammad had fulfilled the task of conveying the treatise calling on polytheists to the truth and to the straight path, but they did not welcome and did not want to accept it and even they still refused and turned away from the truth, then let Apostle let their attitude without the need to get upset and worried. This is because the Apostle was not given the task of supervising and researching the deeds of the polytheists, but he was only given the task of conveying what Allah sent down and commanded him. If the Prophet Muhammad had carried out his obligations, then he would have been considered to have fulfilled his mission, as Allah said: So in fact your duty is only to convey it, and We are the ones who take account of (their deeds). (ar-Ra'd\/13: 40) And His words: So give a warning, because you (Muhammad) are only a warner. You are not the one who has power over them, (al-Gasyiyah\/88: 21-22) And His word also: It is not your (Muhammad) obligation to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272) Furthermore, Allah explains the character and character of humans, that is, when humans are given wealth, are blessed with the pleasures of life, physical well-being, a sense of security, they are happy and excited about these gifts, and often even cause feelings of arrogance and arrogance. But on the other hand, when poverty, disease, calamities of various kinds occur in the form of floods, fires and the consequences of the sins and immorality that they have committed, they deny all the gifts that God has given them, forget about those gifts, instead they forget to do good. Such is the nature of disbelievers and do not believe in Allah. In contrast to those who truly believe in Allah, they are grateful, believe and worship more steadily. If they do not or have not received grace, they are patient because they believe in God's provision; everything is returned to God, they conform to the word of God: And to God all things are returned. (al-Baqarah\/2: 210)"
		   },
		   {
			"id": 4321,
			"surah": 42,
			"ayat": 49,
			"tafsir": "In this verse Allah explains that it is He who created the heavens and the earth, owns, has power and does whatever He wills with what is in the heavens and on earth. Whatever He wills must manifest and come true, and what He does not will does not come true. He gives favors to whom He wills. No one can prevent what He wants, and no one can give favors to whom He does not want. It is He who created everything according to His will. It is He who gives offspring of daughters to whoever He wills, gives offspring of sons to whom He wills, and gives offspring of sons and daughters, and some He makes barren, have no offspring, all there is wisdom in that. All of this shows the omnipotence of Allah that no one can oppose Him. He does as He pleases according to His nature and no one is able to hinder Him or help arrange His will. This verse closes with one firmness, that Allah is All-Knowing who is worthy and entitled to be awarded each of the types of gifts mentioned above. He Almighty creates what He wills and does as He pleases according to His wisdom and knowledge."
		   },
		   {
			"id": 4322,
			"surah": 42,
			"ayat": 50,
			"tafsir": "In this verse Allah explains that it is He who created the heavens and the earth, owns, has power and does whatever He wills with what is in the heavens and on earth. Whatever He wills must manifest and come true, and what He does not will does not come true. He gives favors to whom He wills. No one can prevent what He wants, and no one can give favors to whom He does not want. It is He who created everything according to His will. It is He who gives offspring of daughters to whoever He wills, gives offspring of sons to whom He wills, and gives offspring of sons and daughters, and some He makes barren, have no offspring, all there is wisdom in that. All of this shows the omnipotence of Allah that no one can oppose Him. He does as He pleases according to His nature and no one is able to hinder Him or help arrange His will. This verse closes with one firmness, that Allah is All-Knowing who is worthy and entitled to be awarded each of the types of gifts mentioned above. He Almighty creates what He wills and does as He pleases according to His wisdom and knowledge."
		   },
		   {
			"id": 4323,
			"surah": 42,
			"ayat": 51,
			"tafsir": "In this verse Allah explains that Allah will not speak to His servant except in one of three ways as follows: 1. By revelation, namely Allah instills into the heart of a prophet an understanding that is beyond doubt that what he receives is from God. Such is the case with the Prophet Muhammad. His words: Truly the Qudus Spirit has breathed into the depths of my heart that someone will not die until he fully receives his sustenance and death, so fear Allah and do your best. (History of Ibn Hibban) 2. Behind the veil, namely by hearing and not seeing who is saying, but his words are heard, just as Allah spoke with the Prophet Musa, Allah's Word: And when Musa came to (munajat) at the time We have determine and God has said (directly) to him, (Moses) said, \"O my Lord, show (Yourself) to me so that I can see You.\" (Allah) said, \"You will not (be able to) see Me. (al-A'raf \/ 7: 143) 3. Sending a messenger, namely Allah sent the Angel Gabriel, then the messenger conveys revelation to whom He wills , just as Jibril came down to the Prophet Muhammad saw and to other prophets. 'Aisyah narrated that al-harith bin Hisham asked the Prophet saw, \"How does revelation come to you?\" Rasulullah saw replied, \"Sometimes revelations come to me like the sound of bell. This way is very hard for me. After he stopped, I understood what he had said; sometimes an angel manifests himself to me as a man, then he talks to me, then I understand what he is talking about.\" Said 'Aisha ra, actually I saw the Prophet when the revelation came down to him on a very cold day, then after the revelation stopped you can see that his forehead is dripping with sweat. (Al-Bukhari) This verse closes with the affirmation that Allah is Most High and Most Holy from the characteristics of His creatures. He is called according to His wisdom, talking to His servants, sometimes without good intermediaries in the form of inspiration or in the form of conversation from behind the veil."
		   },
		   {
			"id": 4324,
			"surah": 42,
			"ayat": 52,
			"tafsir": "Allah explained that just as He sent down revelations to the previous apostles, He also sent down revelations to the Prophet Muhammad in the form of the Qur'an as His mercy. Furthermore, Allah explained that Muhammad SAW, before he reached the age of forty years and was among his people, did not yet know what the Qur'an was and what faith was, and likewise did not know what the Shari'a was in detail and understanding of matters. regarding the revelations he sent down, but Allah made the Qur'an a bright light with which Allah guides the servants He wants and compares them to the true religion, namely Islam. As Allah says: And you (Muhammad) never expected that the Book (Al-Qur'an) was sent down to you, but it (sent down) as a mercy from your Lord, therefore do not ever be a helper for the disbelievers. (al-Qasas\/28: 86) And His words: Say, \"The Qur'an is a guide and a cure for those who believe. And those who do not believe in their ears there is a blockage, and (Al-Qasas\/28: 86) Qur'an) is darkness for them. (Fussilat\/41: 44) Word of Allah: Verily, this Qur'an gives instructions to the straightest (path). (al-Isra'\/17: 9) With light It is the Al-Qur'an, Allah provides guidance to the straight path, namely the true religion."
		   },
		   {
			"id": 4325,
			"surah": 42,
			"ayat": 53,
			"tafsir": "In this verse, Allah explains that the straight path is the path that has been prescribed by Allah, the owner of the heavens and the earth and the ruler of both, does as He wishes, and as a judge His decisions cannot be challenged. This verse ends with a warning that all the affairs of creatures on the Day of Judgment will be returned to Allah and not to others. So each of them is placed in a place that is appropriate for him, in heaven or in hell. Allah's Word: And to Allah belongs whatever is in the heavens and whatever is in the earth, and to Allah all matters are returned. (Ali 'Imran \/ 3: 109)"
		   }
	]
}
