{
	"tafseer": [
		{
			"id": 670,
			"surah": 5,
			"ayat": 1,
			"tafsir": "The beginning of this verse instructs every believer to fulfill the promises that have been made, both promises made by servants to Allah, as well as promises made between human beings, such as those related to marriage, trade and so on, as long as these promises do not violate the Shari'a. Allah, as mentioned in the hadith which reads: \"Every condition (bond) that is not in accordance with the Book of Allah, is null and void even though a hundred kinds of conditions.\" (History of al-Bukhari and Muslim from Aisha ra). Furthermore, this verse mentions about animals that are lawful to eat as mentioned in surahh al-Anam\/6:143 and 144, and prohibits eating ten kinds of food as mentioned in the third verse of this surahh. It is not permissible for a person who is in ihram for Hajj and Umrah or one of the two of them to hunt game animals on land, either in the forbidden lands or outside, and it is not permissible for them to eat their meat. It is not permissible for a person who is in the haraam land, even if he is not currently in ihram, to hunt wild game animals. Thus Allah determines His law according to His will for the benefit of His servants."
		   },
		   {
			"id": 671,
			"surah": 5,
			"ayat": 2,
			"tafsir": "According to the history of Ibn Juraij and Ikrimah, that a man named al-Hutam al-Bakri came to Medina on a camel carrying food. After selling the food he met the Prophet, then committed himself to Islam. After he turned away, the Prophet noticed him and said to his companions who were there: \"He came to me with a lying face and turned his back on me like a cheater.\" After al-Hutam arrived in Yamamah, then he apostatized from Islam. Next, in the month of Zulkaidah, he came out again with his camel to sell food to Mecca. When the Prophet's companions heard this news, several people from the Muhajirin and Ansar groups, prepared to go out to beat him in the middle of the road, then this second verse was revealed. 179 In the end they did not do it. In this second verse Allah explains to those who believe; five important prohibitions that may not be violated, namely: 1. Violating Allah's prohibitions, namely violating the practices and provisions set by Allah in the pilgrimage and others. 2. Violating the honor of the sacred months, namely the months of Zulkaidah, Zulhijah, Muharam and Rajab, which are prohibited in these months of fighting except in self-defence because of being attacked. 3. Interfering with hadyu animals, namely camels, oxen and the like, goats, sheep and the like which are presented to the Kaaba to get closer to Allah, are slaughtered in unclean land and their meat is given to the poor. 4. Disturbing the qalaid, namely the hadyu (sacrificial) animals, which have been put on a leash, indicating that the animal was specially prepared to be sacrificed and presented as a gift to the Kaaba. According to another opinion, this includes people who wear necklaces indicating that they want to visit the Kaaba which should not be disturbed, as did the Arabs in the days of ignorance. 5. Obstructing and disturbing people who visit Baitullah to seek Allah's bounty (provisions) such as trading and seeking His pleasure, namely performing Hajj and Umrah. According to the jumhur, those who cannot be hindered are the believers, while the disbelievers are no longer allowed to enter the forbidden land in accordance with the word of Allah: \"O you who believe, verily the polytheists are unclean (souls), because So let them not approach the Sacred Mosque after this year.\" (at-Taubah\/9:28). Furthermore, the verse explains that when tahallul is completed, it means that after completing the Hajj or Umrah pilgrimage, it is permissible to hunt outside the forbidden lands while in the forbidden lands it is still not permissible, it is forbidden to uproot the plants and disturb the animals they hunted, to abuse anyone who gets in the way. -obstruct the entry of the Masjidilharam, just as the polytheists prevent the believers from carrying out the umrah stipulated in the peace of Hudaibiyah. Then the last part of this verse obliges believers to help each other in doing good and piety, for their interests and happiness. It is forbidden to help one another in committing sins and transgressions and to command one to remain pious to Allah in order to avoid His very severe torment."
		   },
		   {
			"id": 672,
			"surah": 5,
			"ayat": 3,
			"tafsir": "In this verse, the foods that are forbidden are explained, namely: 1. Carrion, namely animals that die without being slaughtered. One of the wisdoms in the prohibition of carcasses, among other things, is that carcasses contain germs which are very harmful to health in addition to their disgusting condition. 2. Blood, namely blood flowing out of the animal's body, due to slaughter or other things. The wisdom of prohibiting blood is, among other things, because it contains germs and dirty substances from the body and is difficult to digest. 3. Pork, including all its limbs. 4. Animals slaughtered by mentioning or glorifying names other than Allah, such as calling idols. The wisdom of his illegitimacy is because he associates partners with Allah. 5. Animals suffocate to death. Many opinions explain what is meant by suffocation, namely among them dying from being tied up and so on, so that the animal dies in a helpless state. The wisdom of the forbidden is the same as the wisdom of the forbidden carcass. 6. Beaten dead animals, namely dead animals hit with hard objects or heavy objects. According to some opinions, the wisdom is forbidden because the blood does not come out, thus damaging the flesh. Apart from that, it is also because there is a prohibition on mistreating animals and it is clear that this act is considered to violate the hadith of the Prophet which reads: From Syaddad bin Aus, the Messenger of Allah, said, \"Allah obliges to do good (ihsan) for everything, if you kill, kill well, and when slaughtering, slaughter properly, one of you should sharpen his knife and not be tormented by the animal he slaughters.\" (History of Ahmad, Muslim and Ashabus-Sunan). 7. Animals that die from falling from high places are like falling from a hill into a ravine. Haram wisdom is the same as carrion. 8. Animals die from being horned by other animals. The lesson is the same as the carcass. If it is still being slaughtered then the law is halal. 9. Animals that die are pounced on by wild animals. The lesson is the same as a carcass, if it still has time to be slaughtered then it is lawful. 10. Animals slaughtered for idols, as was done by the Arabs in the days of ignorance who slaughtered animals near idols which numbered 360, are found around the Kaaba. The lesson is that it is forbidden because this act includes associating partners with Allah. Furthermore, it is explained that it is forbidden to draw fate with arrows, as was done by the Arabs during the time of ignorance, namely by taking three arrows that did not have feathers, one of the arrows was written with the words: \"Amarani rabbi\" (My God has ordered me), the second arrow is written with the words: \"Nahani rabbi\" (My God forbid me), while the third arrow is written nothing. The arrow is kept in the Kaaba. If they intend to do a big and important job, they ask the Kaaba guard to remove one of the three arrows and carry out what is written on the arrow that was taken. If an arrow is drawn and nothing is written on it, the draw is repeated. This act is prohibited because it contains shirk or superstition and superstition. In this case, according to the teachings of the Prophet Muhammad, if you want to choose one of two jobs that are equally important or choose between doing it or not, then you should perform the istikharah prayer in two cycles. If the usual lottery (qur'ah) which does not contain wickedness or superstition and superstition, it is not forbidden, such as the lottery to take one part of two piles that have been cultivated equally, who is entitled to each of the piles, then a qur'ah is held (lot). It was further explained that during the pilgrimage when the disbelievers had given up hope of defeating Islam. Therefore Muslims should not be afraid of them but should fear Allah. Furthermore, in this verse it is explained again about something that is important for the Prophet Muhammad and for all Muslims, that Allah has perfected the religion of Islam and has fulfilled His blessings, and has pleased Islam to be the religion of mankind. After this verse was recited by the Prophet, Umar cried and the Prophet asked what was causing him to cry. Umar replied, \"Something that is perfect there is nothing to look forward to except the lack.\" The Prophet confirmed Umar's words (History of Ibn Jarir and Harun bin Antarah from his father). It was narrated that this verse was revealed at Arafah on the 9th of Zulhijjah 10 H, the Friday after Asar. History has recorded: that 81 days after the revelation of this verse the Prophet Muhammad died after fulfilling his message for approximately 23 years. Indeed, Islamic teachings are perfect, even though all issues have not been detailed, but they are quite perfect with various principles of worldly and spiritual affairs. Then at the end of this verse it is explained, that people who are forced to eat food that is forbidden by Allah because of hunger without the intention of committing a sin, are permissible as long as they eat only what is needed, just to sustain life. Indeed Allah is Forgiving, Most Merciful."
		   },
		   {
			"id": 673,
			"surah": 5,
			"ayat": 4,
			"tafsir": "This verse describes two types of food that are permissible: 1. Good food, namely all kinds of food that make one want to eat it and there is no text that forbids it. As for those that already have provisions that are forbidden, then those provisions must be obeyed, as the words of the Messenger of Allah said: From Ibn Abbas said, \"The Messenger of Allah forbade eating every animal with fangs from wild animals and every animal with sharp claws from poultry.\" (History of Ahmad, Muslim, and Ashabus-Sunan). 2. Hunted animal caught by trained hunters so that the game is immediately brought to the master and will not be eaten unless given by the master. If the hunting animal eats its prey first, before being given it by its master, then its prey is unlawful to eat as carrion is unclean. Furthermore, this verse explains that it is permissible to eat the prey of a trained animal if, at the time of releasing the animal, the hunter reads basmalah. The law of reading basmalah is obligatory according to some scholars such as Abu Hanifah, according to Imam Syafii it is sunnah. Then the end of this verse explains to remain pious, that is, obey all of Allah's commands and stay away from His prohibitions, because Allah is very quick to calculate all the deeds of His servants without anything left behind and hidden for Him."
		   },
		   {
			"id": 674,
			"surah": 5,
			"ayat": 5,
			"tafsir": "This verse describes three kinds of things that are lawful for believers, namely: 1. Good food, as referred to in the fourth verse. Then it is mentioned again in this verse to reinforce the good meaning and explain that it is permissible to eat good food without changing. 2. Food of the People of the Book. The food here, according to the majority of scholars, is slaughtered by Jews and Christians because at that time they had the belief that it was unlawful to eat animals that were slaughtered by mentioning names other than Allah. As long as they still have such beliefs, then their slaughter remains halal. As for other foods such as fruits, etc., the law is returned to the first type, namely tayyibat, if it is included in the good food category it may be eaten, if not (khabais), it is unlawful to eat. As for the sacrifices of non-believers who are not members of the Book, it is forbidden to eat them. 3. It is lawful to marry free women (not slaves) and believing women and women of the People of the Book. According to some commentators what al-muhsanat meant were women who guarded their honor. Men may marry these women with the obligation to provide a living, as long as there are no other intentions in their hearts such as taking them to commit adultery and not to make them concubines. In short, believing men may marry women of the People of the Book with the conditions mentioned above. However, Muslim women cannot marry men from the People of the Book, let alone non-believers who are not from the People of the Book. Then the end of this fifth verse warns, that whoever disbelieves after believing, then all the good deeds he has done will be erased and in the hereafter he will be among the losers."
		   },
		   {
			"id": 675,
			"surah": 5,
			"ayat": 6,
			"tafsir": "This verse describes the ways of ablution. There are six pillars of wudu. Four of the pillars are mentioned in this verse, while the other two pillars are taken from other arguments. The four kinds are: 1. Washing the face, starting from the hair on the side of the face or forehead to the chin, and from the right ear to the left ear. 2. Washing both hands with clean water starting from the tips of the fingers up to the two elbows. 3. Sweeping the head, it is enough to sweep a small part of the head according to the Syafii school of thought. 184) 4. Washing the two feet starting from the toes up to the two ankles. All of that using water. While two more pillars taken from the hadith are: a. Intention, the work of the heart, and it is not mentioned in this verse but the intention is required in every worship work in accordance with the hadith: \"Verily all deeds are with intention\" (History of al-Bukhari and Muslim from 'Umar bin al-Khattab). b. Orderly, means doing the work mentioned above in the order mentioned by Allah in this verse. The order is not clearly stated in this verse, but that is how the Prophet implemented it and it is also in accordance with his words which read: Start with what Allah started. (History of an-Nasai and Jabir bin Abdillah). As for other than the six pillars, such as washing three times, gargling is the legal circumcision. The obligation of this wudu is not every time he wants to pray, but that wudu is obligatory for a person who is going to pray, if his wudu has been canceled or has not wudu, in accordance with the hadith which reads: Allah does not accept the prayer of one of you, if he has hadas until he performs wudu . (History of al-Bukhari and Muslim from Abu Hurairah). Next, Allah explains the things that require a person to take a bath, including: a. Sperm discharge; b. Jima' (having intercourse); c. Menstruation; d. postpartum; e. Wiladah (giving birth); f. Mati (people who live are obliged to wash the dead). People who are affected by one of (a) to (e) are called people who have large hadas, it is obligatory to bathe and perform ablution before praying. People who have small, only obligatory ablution only. The obligation to perform ablution is caused by: a. Something comes out from the hole for urinating and defecating; b. Touching the skin of a man and a woman who is not a mahram, between the two of them without boundaries188; c. Sleep that does not allow a person to know if wind is coming out of his rectum; d. Lost his mind because of drunkenness, madness and so on; e. Touching the genitals with the palm of the hand or touching the anal opening; f. Apostasy (leaving Islam). Furthermore, this verse explains the ways of tayammum. If someone is sick and cannot use water, or if the traveler does not find water for ablution, then he must perform tayammum with dust. The method is to place both palms on clean dirt dust and then wipe it over the face, then place both palms again on the clean dirt dust, then the left palm sweeps the right hand starting from behind the fingers and continues to the wrist until with the elbow, from the elbow down to the wrist again to complete the sweeping that has not been swept away, while the palm of the right hand which is filled with soil dust should not be disturbed to also be swept over the left hand in the same way as sweeping the right hand. That's how the Prophet did tayammum. Then the end of this verse explains that the command to perform ablution and tayammum is not to make things difficult for Muslims, but to guide them to know the ways of purification, and to perfect His blessings, so that Muslims become grateful people."
		   },
		   {
			"id": 676,
			"surah": 5,
			"ayat": 7,
			"tafsir": "In this verse Allah commands Muslims to remember His favors, namely the religious regulations that have been assigned to them. With the advent of Islam, enmity disappeared, brotherhood arose. After that, Allah reminded him of the agreement that had been made, namely the promise to obey and obey the Prophet Muhammad in both difficult and happy times, to follow all his commands and to leave all his prohibitions with full obedience and obedience. At the end of this verse, Allah commands Muslims to remain fearful of Allah, to take care not to forget His favors and not to break promises that have been made, either openly or secretly. Because Allah is All-Knowing of everything that is stored in the human heart."
		   },
		   {
			"id": 677,
			"surah": 5,
			"ayat": 8,
			"tafsir": "This verse instructs believers to carry out their deeds and work carefully, honestly and sincerely for the sake of Allah, both work related to religious affairs and work related to worldly life affairs. Because only then can they be successful and get the results or rewards they expect. In testimony, they must fairly explain what is true, regardless of who the person is, even if it will benefit the opponent and harm friends and relatives. This verse is in line with and in tune with surahh an-Nisa\/4:135, namely that they both describe someone who is fair and honest in testimony. The difference is that in this verse it is explained that the obligation to act fairly and honestly in testimony even though the testimony will harm oneself, one's mother, father and relatives, while in this verse it is explained that hatred of a people must not encourage someone to give unfair and dishonest testimony , even against opponents. Furthermore, in a broad and comprehensive manner, Allah commands those who believe to act fairly, because justice is needed in all things, to achieve and obtain peace, prosperity and happiness in this world and the hereafter. Therefore, acting justly is the closest way to achieving the goal of fearing Allah. The end of this verse states Allah's promise that those who believe who do many good deeds will be given forgiveness and a great reward. God's promise must be fulfilled as stated in His word: \"Indeed, Allah does not break promises.\" (Ali 'Imran\/3:9). Good deeds are any work that is good, useful and worth doing, both religious work such as praying and other things, as well as work such as helping the poor, sponsoring orphans and other social activities."
		   },
		   {
			"id": 678,
			"surah": 5,
			"ayat": 9,
			"tafsir": "This verse instructs believers to carry out their deeds and work carefully, honestly and sincerely for the sake of Allah, both work related to religious affairs and work related to worldly life affairs. Because only then can they be successful and get the results or rewards they expect. In testimony, they must fairly explain what is true, regardless of who the person is, even if it will benefit the opponent and harm friends and relatives. This verse is in line with and in tune with surahh an-Nisa\/4:135, namely that they both describe someone who is fair and honest in testimony. The difference is that in this verse it is explained that the obligation to act fairly and honestly in testimony even though the testimony will harm oneself, one's mother, father and relatives, while in this verse it is explained that hatred of a people must not encourage someone to give unfair and dishonest testimony , even against opponents. Furthermore, in a broad and comprehensive manner, Allah commands those who believe to act fairly, because justice is needed in all things, to achieve and obtain peace, prosperity and happiness in this world and the hereafter. Therefore, acting justly is the closest way to achieving the goal of fearing Allah. The end of this verse states Allah's promise that those who believe who do many good deeds will be given forgiveness and a great reward. God's promise must be fulfilled as stated in His word: \"Indeed, Allah does not break promises.\" (Ali 'Imran\/3:9). Good deeds are any work that is good, useful and worth doing, both religious work such as praying and other things, as well as work such as helping the poor, sponsoring orphans and other social activities."
		   },
		   {
			"id": 679,
			"surah": 5,
			"ayat": 10,
			"tafsir": "Furthermore, the verse states that disbelievers who deny Allah's verses are residents of hell. The verses of Allah mean the signs of the existence of Allah Almighty and the Qur'an. Every verse that is a great miracle for the prophethood and apostleship of Muhammad saw is a sign of the existence of Allah, the One and the Almighty. The end of the verse states that disbelievers who deny and belie His verses are the inhabitants of hell."
		   },
		   {
			"id": 680,
			"surah": 5,
			"ayat": 11,
			"tafsir": "Believers must remember the enormous favors bestowed upon them by His power, Allah has restrained and delivered them from a very dangerous crime planned by disbelievers. Many narrations tell about the cause of the revelation of this verse which generally revolves around a man from the Muharib tribe who was sent by his people to kill the Prophet Muhammad. The strongest history is corroborated by al-Hakim from Jabir's hadith, namely a man from the Muharib tribe named Gauras bin Haris came and stood before the Messenger of Allah while (drawing a sword) and saying, \"Who can defend you?\" The Messenger of Allah replied, \"Allah\" then the sword fell from his hand and was taken by Rasulullah saw while saying, \"Who can defend you?\", the man replied, \"Be the best of you who act.\" Rasulullah asked, \"Will you admit that there is no god but Allah and indeed I am His Messenger?\" The man replied, \"I promise that I will not fight you and will not join the people who will fight you.\" Then the Messenger of Allah freed him, after he returned to his people he said to them: \"I have just come to meet a man who is the best that is Rasulullah saw.\" This verse invites believers to remember the favors that will be given to them when facing people who intend to do evil, Allah restrains and delivers them from the dangers of the enemy's evil. According to some commentators what is meant by the crime in this verse is the crime of the Gauras mentioned above. Others argue that what is meant is all the crimes that were committed by infidels against the Prophet and his companions at the beginning of the birth of Islam and they were always protected by Allah. Remembering these things is very beneficial for the lives of believers, will further strengthen their faith in Allah and His power and generate enthusiasm and confidence in oneself in the face of trouble and suffering to uphold the truth. At the end of this verse, Allah commands the believers to remain fearful of Him who has shown His power in helping and protecting them from the evil of their enemies. Allah ordered the Muslims to put their trust in Him, after they had made their efforts and endeavors according to their ability, and forbade them to put their trust in other than Allah."
		   },
		   {
			"id": 681,
			"surah": 5,
			"ayat": 12,
			"tafsir": "According to history, the breaking of the promise of the Jews occurred after they were released from the clutches of the Pharaoh in Egypt, so Allah, through the intercession of the Prophet Moses, ordered them out of Egypt towards Palestine. At that time Palestine was inhabited by the Right tribe which was very powerful and arrogant. They were ordered there to wage jihad against these violent people with an agreement and Allah will help them. Allah ordered the Prophet Musa to take 12 leaders representing each of their tribes to carry out the tasks ordered by Allah. After the agreement was made, they departed, and upon arrival near the holy land of Jerusalem, the Prophet Musa ordered the 12 leaders to enter the city undercover to spy and to obtain the necessary information. (Books of Numbers xiii and xiv. See also al-Baqarah\/2:63 and its commentary). After the Jewish leaders saw the inhabitants who were strong and had great strength, they were afraid and went home and told their people the things they saw, even though they had been ordered by the Prophet Musa not to tell his people what they saw. Thus, they have broken the promise, except for two of the leaders as mentioned in verse 23 of this surah. In addition, Allah ordered them to establish prayers, pay zakat, have faith and help Allah's Apostles who would be sent after Musa, such as David, Sulayman, Zakaria, Yahya, Isa and Muhammad. Besides that, Allah also ordered them to give good loans to Allah, namely to spend their property sincerely in the way of Allah. If they are willing to carry out all of Allah's commands, surely Allah will erase their other sins and enter them into gardens beneath which rivers flow. Whoever still disbelieves and breaks his promise after that, then they are people who have strayed from the right path."
		   },
		   {
			"id": 682,
			"surah": 5,
			"ayat": 13,
			"tafsir": "This verse explains that the Jews always broke their promises, so Allah cursed them and made their hearts hard of stone, Allah also explained that they did not hesitate to change the words of Allah from the Torah which was revealed to Prophet Musa, even though Prophet Musa had taken a promise them so that they maintain and carry out its contents, but none of them carry it out as the Muslims preserved the Qur'an during the time of the Prophet Muhammad. The original Torah, according to Jewish and Christian historians, has disappeared since the Babylonian empire attacked their city, burned their temple and took the Jews who were still alive. Furthermore, Allah explained that the Jews had forgotten some of what they had been warned about, and deliberately did not do some of what they were ordered to do, because it had become their habit to disobey and break promises. According to Ibn Abbas and Mujahid, they forgot some of the original Torah. And this could have happened to the Jews after the loss of the original Torah, because they had no one to memorize it. The Torah is not the same as the Old Testament. Likewise the Bible is not the same as the New Testament. At the end of this verse, Allah warned the Prophet Muhammad that this was indeed the character and behavior of the ancient Jews towards Allah, His Books and His Messengers. Allah warned that the Prophet Muhammad, peace be upon him, would always face their various deceptions and betrayals. Don't think that the Prophet is safe because the Prophet has agreed to live peacefully side by side with them, because it is their nature to always like to oppose and break promises, except for a small number of them, like Abdullah bin Salam and his friends who have converted to Islam seriously. and they became commendable companions of the Prophet. In dealing with these people, the Prophet Muhammad should not be worried, but should forgive the mistakes they have made. Verily Allah loves those who do good."
		   },
		   {
			"id": 683,
			"surah": 5,
			"ayat": 14,
			"tafsir": "This verse explains that Allah has taken promises from people who claim to be Christians to obey and obey what Allah has ordered and forbidden and to follow His Prophets. But they deliberately forgot some of what they were warned about in the Bible, meaning they did not do some of what was warned in the Bible because the first followers of the Prophet Isa Al-Masih were ordinary people, while his loyal friends consisted of the animal hunters who were always expelled and despised by the Jews. They do not yet have the social power that is able to record and maintain what they memorize from the Bible and many of the books they write are called the Bible as explained in their holy books and church history. The end of this verse explains that because of the behavior of Christians who do not want to fulfill their promises, Allah causes division among themselves until the Day of Judgment. In the afterlife Allah will tell them all the mistakes they have made in this world, so that they can no longer escape the torment."
		   },
		   {
			"id": 684,
			"surah": 5,
			"ayat": 15,
			"tafsir": "This verse explains that the Prophet Muhammad had come to explain some of what they had hidden about Allah's Shari'a which is contained in the Torah. Among them were what the Prophet explained, such as the calculation of charity and its reward in the hereafter and the punishment of stoning, but many others were left out because they were considered not so important, such as with regard to the arrival of Muhammad as the last Prophet and his characteristics. What prompted them to hide what they knew from the Torah was because they were afraid of losing their position, influence and other things related to the world, including the feeling that they had never been separated from, namely that they were the descendants or people of the best Prophet, namely the descendants of the Prophet Muhammad. from the Prophet Isaac, while the Prophet Muhammad is a descendant of the Prophet Ismail. The condition of the Prophet Muhammad who was ummi (not good at writing and reading) added to their courage to hide what they wanted to hide, because they thought the Prophet Muhammad would not know about it, but their suspicions were off the mark when the revelation (Al-Qur'an) revealed to the Prophet who revealed it. some of what they hid was what caused many Jewish priests to convert to Islam. The stoning law that was hidden by the Jews against the Prophet Muhammad is still found today in the book of Deuteronomy xxii.22-24: A married woman or a married man is caught sleeping together, \"both of them must be put to death.\" And if those who do it \"a girl who is still a virgin, then you must bring them both out to the city gate and you stone them, so they die.\" Next, explain the meaning of the light that has come to you from Allah and the book that explains it. What is meant by light here is the Prophet Muhammad saw because he has enlightened mankind from the realm of ignorance to the realm of faith and knowledge. While what is meant by \"the book that explains\" here is the Qur'an which explains the Shari'a of Allah revealed to Muhammad and also explains the secrets of the People of the Book who like to change and hide some of the contents of the Torah and the Bible."
		   },
		   {
			"id": 685,
			"surah": 5,
			"ayat": 16,
			"tafsir": "This verse explains that by means of the Qur'an Allah guides and guides those who follow His will to the path of salvation in this world and the hereafter and brings them out of the realm of darkness into the realm of light and shows them the right path. This verse explains three types of guidance that are of great benefit, namely: a. Obeying the teachings of the Qur'an will bring humans to safety and happiness. b. Obeying the teachings of the Qur'an will free people from all kinds of errors caused by superstition and superstition. c. Complying with the Qur'an will convey human beings to the ultimate goal of religion, namely the happiness of the world and the happiness of the hereafter."
		   },
		   {
			"id": 686,
			"surah": 5,
			"ayat": 17,
			"tafsir": "In general, the Christian creed is taslis (trinity), namely the Father, the Son, and the Holy Spirit. This creed is difficult for anyone to understand properly, even by using all kinds of tafsirs given by past and present Christian scholars. Tafsir al-Manar explains that the mainstay of the Christian creed are the words found at the beginning of the Book of John. In this verse, Allah clearly explains that those who say that Allah is the Messiah, son of Maryam, have become disbelievers. Then Allah gave an excuse with signs to break the tortuous excuses of the Christians: Say, \"So who can (object) hinder the will, if Allah wants to destroy the Messiah son of Maryam along with his mother and all the people who are in all this earth?\" To Allah belongs the kingdom of the heavens and the earth and what is between them; He creates what He wills and Allah is Almighty over all things. (al-Ma'idah\/5:17)."
		   },
		   {
			"id": 687,
			"surah": 5,
			"ayat": 18,
			"tafsir": "According to the history of Ibn Ishak, Ibn Abbas narrates that the Messenger of Allah came to Numan bin Ada, Bahri bin 'Amar and Syas bin 'Adi. After a conversation took place between the Prophet and them, the Prophet finally invited them to convert to Islam and warned them with the torment of Allah, so they said, \"Don't frighten us, O Muhammad: By Allah, we are the sons of Allah and His beloved\", then come down this verse. The words of the Jews and Christians were refuted by Allah, which meant, \"Say, O Muhammad to them: if it is true that you are sons of Allah and His beloved who have special privileges more than others as you think, why does Allah torture you because of your sins in the world, as you have suffered a lot, both regarding your place of worship, your country and your kingdom, etc., because a father will not abuse his children and will not torment his lover. Therefore you are not sons -son of Allah and not also His lover who has the privileges as you think, but you are an ordinary human being and a servant of Allah like any other human being. Allah will forgive the sins of His servants for those who have the right to be forgiven and torture those who has the right to be tormented according to His will, for it is Allah who owns the kingdoms of the heavens and the earth and what is between them.\""
		   },
		   {
			"id": 688,
			"surah": 5,
			"ayat": 19,
			"tafsir": "According to the history of Ibn Ishaq, Ibn Abbas narrated sabab nuzul this verse that the Messenger of Allah invited the Jews to convert to Islam, so they refused, then Mu'adz bin Jabal, Sa'ad bin 'Ubadah, 'Uqbah bin Wahab said to them: \" O Jews, fear Allah, indeed Muhammad is a Messenger.\" Then Rafi'i bin Murairah and Wahab bin Yahuza said, \"We never said that to you, and Allah did not send down a book after Musa and did not send a messenger after him to bring good news nor to warn\", so this verse was revealed. In this verse Allah explains to the People of the Book that in fact the messenger of Allah that they are waiting for has come, according to what they know from the books given by Allah through His Messengers Moses and Jesus as Allah's Apostle who has come explains Allah's law, on the period called \"Fatrah\", namely between the Prophet Isa and the Prophet Muhammad, during which time the revelation did not come down, while much of the contents of the Torah and the Bible were obscure and not much was known; and many of which have undergone changes or been forgotten, whether intentional or unintentional. Now the Messenger of Allah, Muhammad SAW, has come, bringing good news and a warning to explain everything that is needed for worldly and hereafter life, showing the right path that must be taken by mankind, so there is no more reason for them to say that they do not know because the absence of apostles who guide and bring good news and warnings. Now the People of the Book and all mankind must take a stand. If they want to be safe and happy in this world and the hereafter, then they must believe in Muhammad, the last messenger of Allah and follow all of His instructions and commands. Whoever disobeys then he himself will bear the risk and no one else will help him. Whoever does not believe in Allah and all the messengers who were sent before, they will feel a painful punishment from Allah."
		   },
		   {
			"id": 689,
			"surah": 5,
			"ayat": 20,
			"tafsir": "In this verse, the Prophet Muhammad was ordered to remember the events that happened to Musa when he ordered his people to always remember and be grateful for God's favors in the right way. The favors of God that are grateful for will surely get additions from Him. On the other hand, the recipients of His blessings that are disbelieved are threatened with torture. Among these blessings: a. Allah has raised many prophets for the Children of Israel, such as Prophet Musa, Prophet Aaron, and others. b. Allah made the Children of Israel free to be independent, to manage their own affairs, so that with that condition it was as if they had complete sovereignty. c. Allah gave them things that had never been given to other people, for example when they were chased by Pharaoh and his army faced a stalemate, then at that time Allah split the sea so that they would be safe from Pharaoh's pursuit. But after they had passed and Pharaoh and his army followed, the road turned into the sea again, so that Pharaoh and his army drowned. Allah gave mann (sweet food like honey) and salwa (quail countrymen). And when they were in the desert (desert) in a very hot condition, Allah also sent a thick cloud to overshadow them. Those are the blessings given to them to be grateful for."
		   },
		   {
			"id": 690,
			"surah": 5,
			"ayat": 21,
			"tafsir": "After Prophet Musa reminded the Jews and explained the blessings, then ordered them to be brave in facing Allah's enemies with a promise that Allah would help them. Prophet Musa's command was that they must enter the holy land of Canaan (Palestine) and live in the land that God had promised and appointed to be their place of residence. According to the history of Ibn 'Asakir from Mu'adz bin Jabal that the holy land is between the Tigris and Furat rivers. The land is called sacred because many prophets have occupied it who always called on the religion of monotheism, so the land is clean of statues and heretical beliefs. And the Prophet Musa forbade them to apostatize from returning to worshiping idols and causing chaos in society by committing tyranny and following lust. If they do not comply with this provision they will lose, because the blessings that have been given to them will be revoked and cancelled."
		   },
		   {
			"id": 691,
			"surah": 5,
			"ayat": 22,
			"tafsir": "After Prophet Musa and his people approached the prosperous land, he ordered his people to enter the holy land and be ready to face its inhabitants. Because the people of Prophet Musa felt weak, low and afraid, they did not want to enter the holy land, they even wanted to return to Egypt because the inhabitants of the holy land were cruel and rude people. They declared to the Prophet Musa that they would not enter the holy land as long as the cruel inhabitants were still there, if the inhabitants had left the holy land, then they would enter it. (In the Book of Numbers xiii. 32-33 it is mentioned 'a land that eats up its inhabitants and is inhabited by giants). From the answers of the Prophet Musa's people, it can be concluded that they were very weak in spirit and did not have the courage. They don't want to gain happiness and achieve glory by struggling. They want to get it without a struggle. People with such attitudes and convictions will not gain glory, enjoyment, happiness and prosperity. About the fertility and prosperity of Canaan, the old land bordering the Dead Sea and Jordan in Palestine at that time and the condition of its inhabitants who were strong and mighty were acknowledged by the followers of the Prophet Musa who were sent there."
		   },
		   {
			"id": 692,
			"surah": 5,
			"ayat": 23,
			"tafsir": "After the attitude of the Prophet Musa's people was revealed in terms of entering the holy land and staying in it, two envoys from the people of Prophet Musa who were truly fearful of Allah and had been given pleasure and obtained His approval, advised their friends to immediately enter the Baitulmakdis door. .(These two pious people were Joshua son of Nun and Kalaeb son of Jefune who are told at length in Numbers 13 and 14). If they had entered it, they would surely win and be able to expel its strong inhabitants. Because the victory was obtained with God's help that has been promised, which he will surely fulfill."
		   },
		   {
			"id": 693,
			"surah": 5,
			"ayat": 24,
			"tafsir": "The advice of the two envoys could not influence his people and did not change their spirits. Therefore, after that suggestion, they repeated their words to Prophet Musa that they would never enter Canaan as long as the giants and arrogant inhabitants of that land were still there. They emphasized that if Prophet Musa still wanted to enter the land of Canaan, then let Prophet Musa alone with God's help fight the people, while they still refused to follow Moses into Canaan. Their answer shows the shallowness of their minds and their pettiness. Indeed, at first they had worshiped Allah following the Prophet Musa, then they tried to worship the calf following Samiri's invitation. Indeed, the Jews used to disobey their Prophet, sometimes even killing him."
		   },
		   {
			"id": 694,
			"surah": 5,
			"ayat": 25,
			"tafsir": "After the invitation of the Prophet Musa was not obeyed by his people, they even refused, then the Prophet Musa expressed his complaint to Allah that he could not control his people. Therefore Musa asked Allah to separate Musa and his brother on the one hand and his people on the other and asked Allah to give a fair decision. So when his wicked people are to be tortured, let Prophet Musa and his brothers be saved from that torment."
		   },
		   {
			"id": 695,
			"surah": 5,
			"ayat": 26,
			"tafsir": "The prayer of the Prophet Musa was granted by Allah and Allah stated that in fact the holy land was forbidden for them for forty years. Because of that lawlessness, they were unable to enter the pure land and were unable to inhabit it for forty years. During that time they are always in a state of confusion, not knowing the direction and destination. After that, Allah advised the Prophet Musa not to feel sad for the calamity\/torture that befell his wicked people, because for them it would be a lesson and experience. According to the opinion of most commentators, that Prophet Musa and Prophet Aaron were in the desert with the Children of Israel, but that desert for Prophet Musa and Prophet Aaron was a place of rest and increased their rank. As for the Jews who deny it is a very heavy torment. After completing the events in the barren desert of Paran, Prophet Musa and Prophet Aaron died. The purity of nature of the Children of Israel was damaged by misguidance, slavery, oppression and coercion by the kings of Egypt, so that they were misguided, cowardly and cowardly. It was ingrained in them. Therefore when Musa (a.s.) led them to truth, courage and happiness, they were still cowardly."
		   },
		   {
			"id": 696,
			"surah": 5,
			"ayat": 27,
			"tafsir": "The Prophet Muhammad was ordered to read the story of the two sons of Adam as when they sacrificed, then one sacrifice was accepted while the other sacrifice was not. The person whose sacrifice was not accepted was determined to kill his brother, while the person who was threatened replied that he surrendered to Allah, because Allah will only accept sacrifices from people who are pious. According to the narrations of Ibn Abbas, Ibn Umar and others, that Adam's son named Qabil had agricultural fields and his son named Habil had goat farms. Adam's two sons had twin sisters. At that time Allah revealed to Adam that Qabil was married to his twin brother Abel. With that marriage Qabil was unhappy and angry, his twin sister was more beautiful. Both of them wanted the beautiful sister. Finally Adam ordered Qabil and Abel to sacrifice in order to find out which of them the sacrifice would accept. Qabil sacrificed his agricultural produce and what was given was of low quality, while Abel sacrificed his good choice of goats. Allah accepted Abel's sacrifice, which means that it was Habil who was justified in marrying Qabil's twin sister. Thus, Cain's anger and jealousy increased, so that he was determined to kill his brother. The signs of the sacrifice being accepted are that the fire consumes the sacrifice until it runs out. 197) From this incident, we can learn a lesson that what is spent should not only be expected of praise and flattery but should be done sincerely so that it is accepted by God."
		   },
		   {
			"id": 697,
			"surah": 5,
			"ayat": 28,
			"tafsir": "This verse obliges us to respect the honor of the human soul and prohibits bloodshed. Then Allah explained that Abel would not reply to Cain's challenge because of his fear of Allah. Abel did not intend to answer Cain's challenge, because he considered it contrary to the characteristics of a pious person and he did not want to carry the sin of murder. The Messenger of Allah said: From Abi Bakrah, the Messenger of Allah, said, \"If two Muslims fight each other with their swords and then one kills the other, then both the one who kills and the one who is killed goes to hell. The Messenger of Allah was asked: \"The one who killed this has clear (the law) but how is it killed? Answered by the Prophet \"(Going to hell too)\" Because he also tried hard to kill his friend.\" (History of Ahmad, al-Bukhari, al-Baihaqi and al-hakim)."
		   },
		   {
			"id": 698,
			"surah": 5,
			"ayat": 29,
			"tafsir": "In this verse, Abel gave an answer to Cain that Habil surrendered to Allah and did not want to challenge him so that all sins, both Qabil's sins and other sins after that, were borne by Qabil himself. Habil based his statement on three very important things. First, that acceptable charity is only from pious people. Second, Abel would not kill people, because he was afraid of Allah and third, Abel did not fight, because he was afraid of sinning which would result in going to hell."
		   },
		   {
			"id": 699,
			"surah": 5,
			"ayat": 30,
			"tafsir": "At first Qabil was afraid to kill Abel, but his lust for anger always encouraged and deceived him, so that he had the courage to kill his brother and carried out his intention without thinking about the consequences. After that actually happened, then as a result Qabil became a loser in this world and in the hereafter. In the world he lost because he killed his pious and pious brother. And in the hereafter he will lose because he will not get the afterlife favors provided for the muttaqin. Imam as-Suddi narrated from Ibn Abbas, from Murrah bin Abdillah, and from several companions of the Prophet Muhammad that Qabil, after being deceived by his lust and determined to kill his brother, he looked for Habil and found him on a mountain herding goats, but he was sleeping. So Qabil took a large stone and then fell on him in an open place called Arak."
		   },
		   {
			"id": 700,
			"surah": 5,
			"ayat": 31,
			"tafsir": "This murder was the first to occur among the children of Adam, Qabil as a murderer did not know what to do with his brother who had been killed (Habil), while he was unhappy to see his brother's corpse lying on the ground. So Allah sent a crow to scratch the ground with its talons to show Qabil how to bury his brother's body. After Qabil witnessed what the crow had done, he understood what to do with his brother's corpse. At that time, Qabil felt his stupidity why he couldn't do like the crow, then was able to bury his brother. Because of this, Qabil deeply regretted his wrong actions. A lesson can be drawn from this event, that humans sometimes gain knowledge and experience from what has happened around them. Regret can be repentance as long as it is driven by the fear of Allah and regrets the bad consequences of his actions. The Prophet said, \"Regret is repentance.\" (History of Ahmad, al-Bukhari, al-Baihaqi and al-hakim). No one is killed unjustly but the first son of Adam gets his share of sin because he is the first to commit murder. (History of al-Bukhari and Muslim). (32) This verse explains a provision that killing one human being means killing all humans, just as preserving the life of one human means preserving the lives of all human beings. This verse shows the necessity for the unity of the Ummah and their respective obligations towards the other, namely that they must maintain the safety of life and living together and stay away from things that endanger other people. This can be felt because the needs of every human being cannot be fulfilled alone, so they really need help, especially matters relating to the public interest. Indeed, the people of the Children of Israel had so many apostles coming with clear information, but many of them transgressed the limits by doing damage to the earth. In the end they lost the honor, wealth and power that they had in the past."
		   },
		   {
			"id": 701,
			"surah": 5,
			"ayat": 32,
			"tafsir": "This murder was the first to occur among the children of Adam, Qabil as a murderer did not know what to do with his brother who had been killed (Habil), while he was unhappy to see his brother's corpse lying on the ground. So Allah sent a crow to scratch the ground with its talons to show Qabil how to bury his brother's body. After Qabil witnessed what the crow had done, he understood what to do with his brother's corpse. At that time, Qabil felt his stupidity why he couldn't do like the crow, then was able to bury his brother. Because of this, Qabil deeply regretted his wrong actions. A lesson can be drawn from this event, that humans sometimes gain knowledge and experience from what has happened around them. Regret can be repentance as long as it is driven by the fear of Allah and regrets the bad consequences of his actions. The Prophet said, \"Regret is repentance.\" (History of Ahmad, al-Bukhari, al-Baihaqi and al-hakim). No one is killed unjustly but the first son of Adam gets his share of sin because he is the first to commit murder. (History of al-Bukhari and Muslim)."
		   },
		   {
			"id": 702,
			"surah": 5,
			"ayat": 33,
			"tafsir": "People who disturb the security and disturb the peace, obstruct the enactment of law, justice and Shari'a, undermine public interests such as destroying livestock, damaging agriculture and others, they can be killed, crucified, have their hands and feet cut off or exiled. According to jumhur, the death penalty was carried out against security disturbances, robbery and the like, which was accompanied by murder, the punishment of crucifixion to death was carried out against security disturbances accompanied by murder and confiscation of property, the punishment was cutting off the hands of those who had seized property. Meanwhile, the punishment for disturbing security accompanied by threats and intimidation is banishment. There is an opinion that the banishment means imprisonment or can be replaced with prison. The punishment in this ayat is stipulated in such a severe manner, because from the point of view of disturbing the security intended, apart from being aimed at the public, it often results in murder, robbery, vandalism and so on. Therefore, no one can pardon these crimes. Those who receive the punishment referred to in this verse are not only despised in this world, they are also threatened with enormous torment in the hereafter."
		   },
		   {
			"id": 703,
			"surah": 5,
			"ayat": 34,
			"tafsir": "The security disturbances and their punishments have been explained in ayat 33 above, if they repent before being arrested by the authorities, then for them the punishments listed in ayat 33, which according to sharia terms are called \"hududullah\", will no longer apply, and also not carried out again against them other punishments such as had punishment, sariqah law and jinayah law (criminal). The relief given to those who repent is in accordance with the nature of Allah, the Most Forgiving and Most Merciful."
		   },
		   {
			"id": 704,
			"surah": 5,
			"ayat": 35,
			"tafsir": "Allah commands believers to always be careful, to be careful not to get involved in an offense, to carry out religious prohibitions that Allah has ordered to stay away from it. According to some commentators, avoiding Allah's prohibitions is more severe than obeying His commands. It is not surprising that in the Qur'an, the word ittaqu, which means that we guard ourselves against carrying out religious prohibitions, is mentioned repeatedly up to 69 times, while the word ati'u, which means that we obey religious orders, is only mentioned 19 times. In addition to guarding ourselves against things that might cause us to commit violations or religious provisions, we must also always look for ways to get closer to Allah, namely by carrying out His commands and practicing everything that pleases. Ibn 'Abbas, Mujahid, Abu Wali, al-hasan, Zaid, 'Ata, as-sauri and others, interpret al-wasilah in this verse by getting closer. Regarding this understanding, Ibn Kasir in his commentary (2\/52), said: The understanding that has been given by these priests, there is no difference between the commentators. The word wasilah sometimes means the highest place in heaven, as the Prophet said: \"When you pray for me, then ask me for \"wasilah\". Then he was asked: \"O Messenger of Allah, what is wasilah?\" the most high in Heaven no one will reach it except one and I hope, I am that person.\" (Ahmad's history from Abu Hurairah). that exists in every human being always invites to do things that are contrary to good, namely breaking and leaving God's commandments as His word: \"Indeed, the lust always commands to evil.\" (Yusuf \/ 12:53). we must strive to curb passions, overcome all difficulties and avoid all obstacles that will cause us to deviate from Allah's path so that we are above predefined line. Thus we will obtain the happiness that has been promised by God."
		   },
		   {
			"id": 705,
			"surah": 5,
			"ayat": 36,
			"tafsir": "People who do not want to fear Allah and do not want to cleanse themselves from the sins they have committed, and continue in disbelief, deny the lordship of Allah and then worship other than Allah and until they die without repenting, then on the Day of Resurrection they will regret it. If everything on this earth belonged to him and even added that much, and wanted to escape the punishment that befell him, then all of that would not be accepted by Him. In one hadith, the Prophet Muhammad said: A non-believer will be brought in on the Day of Resurrection and he will be told \"If you had all the gold of this earth, would you like to make it a ransom (for the punishment you will receive). He said yes, I want to.\" (Al-Bukhari narration from Anas ra). But what can I do, the rice has become mush. However they wish, they will not be accepted and will still undergo punishment in the form of very painful torture, because in the hereafter it is impossible for that sin to be redeemed with property. But if he repents during his lifetime and cleanses himself with good deeds, then Allah will accept his repentance."
		   },
		   {
			"id": 706,
			"surah": 5,
			"ayat": 37,
			"tafsir": "After they are put into hell and the torment is unbearable they want to get out, but there is no way for them. Their situation is the same as that mentioned in the word of God: \"Whenever they want to come out of it, they are returned (again) into it.\" (as-Sajdah\/32:20). They will feel the eternal torment that never ends."
		   },
		   {
			"id": 707,
			"surah": 5,
			"ayat": 38,
			"tafsir": "Every crime has a punishment. The culprit will be punished. Likewise, a thief will be punished because he violates the prohibition of stealing. A person, whether male or female, who steals other people's property from its rightful place, is called a \"thief.\" A person who has reached puberty steals other people's property worth at least a quarter of a dinar, of his own volition and is not forced, and knows that his actions are unlawful, prohibited by religion. That person has met the requirements to be subject to the punishment of cutting off his right hand, as ordered in this ayat. A theft can be determined if there is evidence or there is recognition from the thief himself. The implementation of the law of cutting hands is carried out by an authorized person who is appointed for it, with certain conditions. The determination of the value of stolen property, which is subject to the law of cutting off the hand of the perpetrator, namely at least a quarter of a dinar as mentioned above, is the opinion of the majority of scholars, both salaf and khalaf scholars206 based on the words of the Prophet Muhammad as follows: \"Rasulullah saw cut off the hand of the thief who stole a quarter of a dinar and above.\" (History of al-Bukhari - Muslim from Aisha). A thief who has had his right hand cut off, then he steals again with the same conditions, then his left leg is cut off, from the toe to the ankle. If he steals again for the third time, his left hand will be cut again, if he steals for the fourth time, his right leg will be cut again, as the Prophet PBUH said regarding thieves as follows: If he steals, cut off his (right) hand, if he steals again cut off his (left) leg, if he continues to steal, cut off his (left) hand and if he still steals, cut off his (right) leg.\" (Recorded by Al-Imam al-Syafi'i from Abu Hurairah). carried out but he still steals for the fifth time, then he is tazir, meaning that he is given a punishment according to what is determined by the authorities, for example imprisonment or exile to another place, so that he can no longer steal. both men and women, because Allah is Mighty, he will not allow thieves and other humans to commit immorality. Allah is Wise in determining something like me stipulate the law of cutting hands for thieves, because if we pay more attention to this, of course in practice it will generate many benefits, at least it can limit the rampant theft. Whatever Allah commands will surely bring benefit and whatever He prohibits will surely result in damage and destruction if violated."
		   },
		   {
			"id": 708,
			"surah": 5,
			"ayat": 39,
			"tafsir": "At the time of the Prophet Muhammad, there was a woman who stole. This was reported to Rasulullah saw by the person who stole it. They said, \"This is the woman who stole our property, her people will redeem it.\" The Prophet said \"Cut off his hand.\" His people explained: \"We dare to redeem him five hundred dinars.\" The Prophet said, \"Cut off his hand.\" Then cut off the woman's right hand. Then he asked, \"Is my repentance still acceptable, O Messenger of Allah?\" He replied, \"Yes, you are as clean today as the day your mother gave birth to you.\" Then come down this verse. The woman was from the Bani Makhzum tribe, which received great attention from the Quraysh princes. At first they tried to free the woman from the punishment of cutting off her hands. Then they looked for anyone who could contact the Prophet to discuss this matter. Then appointed Usama bin Zaid because he was the favorite of the Prophet. When Usamah bin Zaid visited the Prophet, and talked about this, the Prophet became angry and said, \"Are you going to defend something that Allah has set had and its laws 'azza wa jalla?\" Usama replied \"Forgive me, O Messenger of Allah.\" After that the Messenger of Allah made a speech, among other things he said, \"That what destroyed those before you was because in fact they, if those who stole from among them were prominent people, then they let it go, if those who stole were weak people, they were I was sentenced. I, by Allah, in whose hands I am, if Fatimah, the daughter of Muhammad, stole, I would surely cut off her hands.\" Then they were ordered to cut off the woman's hand, so her hand was cut off. (History of ash-Shaikhan from 'Aisyah). So whoever repents of what he has done, and promises not to steal again, after he has wronged himself and disgraced his good name, and tarnished the sanctity of his people, by returning what he stole, he will be forgiven by Allah because Allah is Forgiving to those who have repented. He is Most Merciful to humble people who like to admit their mistakes."
		   },
		   {
			"id": 709,
			"surah": 5,
			"ayat": 40,
			"tafsir": "This verse warns and emphasizes that Allah, who controls the heavens and the earth, regulates what is in them. Allah determines the punishment for those who steal as well as those who fight against Allah and His Messenger, forgives those who repent among them, is merciful to those who truly repent and correct their deeds, and purifies himself from sins sins that have been committed. God will punish those who violate His commandments as education and safety for fellow human beings, as God loves those who repent, encouraging them to purify themselves. Allah is almighty over all things; like torturing and pitying. Nothing is difficult for Him to arrange everything, according to His will."
		   },
		   {
			"id": 710,
			"surah": 5,
			"ayat": 41,
			"tafsir": "In this verse Allah commands His Messenger so that he does not feel sad and anxious because of the actions of the hypocrites who show their disbelief and show their enmity, because in time Allah will protect him from their evil deeds and win him over them and all their helpers and supporters . There are those among them who profess faith with words, but their hearts are still in denial and faithlessness; so did some of the Jews. They are very happy to hear the words of scholars and priests, as well as people who hate the Prophet Muhammad and have never met him, especially hearing lectures and fake news that have been falsified to discredit Muhammad, and weaken the spirit of the Muslims to abandon his teachings. They did not hesitate to change the contents of the Torah. They move the sentences around, so that those that are in front are placed at the back, and vice versa. The meaning is distorted and so on; for example replacing the punishment of stoning for adultery with flogging and blackening of his face. They told their own envoy who was assigned to go to the Bani Quraizah to ask them to ask the Prophet about the punishment of two prominent men who had committed adultery and had been married. They ordered the following, \"If Muhammad answers that the punishment is flogging and blackening of the face, then accept and take his fatwa. But if he answers something other than that, and emphasizes that the punishment is stoning, then avoid him and don't accept it.\" People whom Allah wants to go astray because of their extreme deeds, then there is no guidance that they can receive even though the guidance comes from the Messenger of Allah. Allah will not purify the hearts of the hypocrites and the Jews because they hold fast and do not want to move in the slightest from their disbelief and misguidance. In this world the hypocrites are humiliated and feel very ashamed because their hypocrisy is revealed and known by Muslims, while the Jews are also humiliated because their evil deeds can be known. Likewise their actions to hide the contents of the Torah, for example the punishment of stoning. Besides all that, in the hereafter there will also be great torment. They will be tormented continuously, without end and will not be expelled from hell for all time."
		   },
		   {
			"id": 711,
			"surah": 5,
			"ayat": 42,
			"tafsir": "This verse once again explains the characteristics of the Jews who like to hear false news about the personality and apostleship of the Prophet Muhammad, to show that the actions of the Jews are always based on untruths and lies; a trait that is very ugly, contemptible and destructive. In addition, they also receive a lot of bribes, namely a gift with the intention of justifying the wrong or blaming the right. This has become one of their livelihoods, especially the rulers. The law was toyed with, what played a role and determined at that time was bribery. Whoever has the strength to give bribes, he will win the case, even though he is clearly guilty. If there was one among the Jews who was displeased and disapproved of the dirty actions of his superiors, then he came to the Prophet Muhammad and asked for a decision to be made; The Apostle may choose, accept their request and decide the case, or reject it. They will not be able to do the slightest harm to the Apostle if the Apostle refuses. If the Apostle accepts their request, then the Apostle must decide their case in the fairest way according to what has been ordered, in accordance with the Shari'a brought, and not contrary to the Qur'an. Allah is pleased and pleased with those who act justly."
		   },
		   {
			"id": 712,
			"surah": 5,
			"ayat": 43,
			"tafsir": "One thing that amazes them is that they call out and invite their people to believe in the Torah, but they don't want to submit to the contents and laws contained therein. even though the Torah contains God's laws which are quite clear. They even seek legal rulings from others. Since they are not believers, it is the same for them. They left and did not want to submit to the Torah, because the content and the law contained therein were not in accordance with the wishes and desires of their passions. Likewise, if cases and issues are decided based on the Qur'an according to their request, they will also abandon the decision and ignore it if the decision is contrary to their wishes and desires."
		   },
		   {
			"id": 713,
			"surah": 5,
			"ayat": 44,
			"tafsir": "The Torah, which was revealed by Allah to the Prophet Musa, contains guidance and instructions for humans to the truth, so that they can get out and be safe from error and idol worship, and is also a light that illuminates things that are still vague or that are still dark for them, so that they can see the right path, both in religious and worldly matters. The Torah is a guide for the prophets who have surrendered themselves to Allah with full sincerity, namely the Prophet Musa and the prophets from the Children of Israel after him, up to the Prophet Isa. This book has been used to decide the case of the Jews only, because indeed the Torah was revealed specifically for the Jews. Likewise their figures and priests used the Torah as a law when there were no prophets with them, because all of them had been commanded by Allah to protect the Torah, and to be witnesses and to be responsible for its implementation. Do not let them pervert the laws that are in it, and hide it because it is against their desires, or because they are afraid of their superiors so they do not dare to enforce the law against them, as if they were more afraid of their fellow human beings than of Allah. Another case with Abdullah bin Salam who lived until the time of al-Khulafa ar-Rashidun. He was a Jew who truly upheld God's law, causing others to hate and dislike him. He enforced the stoning law on anyone who had to be punished for committing adultery, even against their leaders or superiors. Do not let them not propagate and explain these laws because of the benefits of the world or the benefits they receive from interested people, for example bribes, or the rank promised to them, because all of this has no meaning and value when compared to the reward that will be they will get in the hereafter, God's Word: \"(That is) on the day (when) wealth and children are useless, except those who come to Allah with a clean heart.\" (asy-Syu'ara\/26: 88 and 89). Whoever punishes or decides a case is not in accordance with God's law, like the Jews who concealed the stoning law against a married or married adulteress and replaced it with flogging and blackened his face, then paraded around to be witnessed by the public, and so on - otherwise, it means they violate the law. Know that they are the deniers."
		   },
		   {
			"id": 714,
			"surah": 5,
			"ayat": 45,
			"tafsir": "In the Torah, it has been stipulated that life must be paid for with life. People who kill not with the right reasons he must be killed anyway regardless of who killed and who was killed. (Exodus xxi. 24-25: \"must give life for life, eye for eye, tooth for tooth, hand for hand, foot for foot, bruise for sore, wound for wound, swelling for swelling\"). Nearly similar punishments are also found in Leviticus xxiv. and Deuteronomy xix.21. Even though these stipulations and provisions were known to Christians and Jews, they still did not want to carry out and carry them out. They still see the existence of differences in degrees and strata in society. They considered that the Bani Nadir Jewish group had a higher rank and position than the Bani Quraizah Jewish group, and that the Bani Quraizah group had a lower position than the Bani Nadir group. So that if someone from the Bani Nadir group killed someone from the Bani Quraiza group he would not be killed, because they were considered not equal. But if the opposite happened, that is, someone from the Bani Qurayza killed a Bani Nadir, then he had to be killed. This and the like, which is defiance and rejection of the guidance, instructions and laws of Allah contained in the Torah continued until the advent of Islam. After that, the Bani Quraizah complained about class differences in their society, to the Prophet Muhammad, by whom it was decided that there was no difference between person A and person B between the Anu group and the Fulan group, in the application of the law. The law does not discriminate, everyone must be treated equally. Hearing the Prophet's decision, the Bani Nadir group felt lowered in rank because they had been equated with the Bani Quraiza group, people they despised. Then come down this verse. In this verse, Allah reaffirms that in the Torah a stipulation has been outlined that the soul must be paid for with the soul, the same as the kisas law that applies in Islamic law. If a murderer who has reached puberty kills a fellow Muslim and is equally free, then the killer, whether one or several people, must be subject to the death penalty. Except for crazy people who are really damaged in their minds, people who are sleeping until they wake up, and small children until they reach puberty, if they kill they are not subject to kisas punishment in accordance with the words of the Prophet SAW: \"Qalam has been appointed from three kinds of people (meaning they people who are not treated as mukallaf) namely crazy people who really have damaged their minds, until they recover, people who sleep, until they wake up, and children until they reach puberty.\" (History of Ahmad, Abu Dawud from al-hakim and 'Umar bin al-Khattab). Furthermore, people who gouge out eyes or cut off noses or ears or pull out other people's teeth, then he must be subject to kikas punishment, dealt with according to his actions, according to God's word: \"Whoever attacks you, then attack him in proportion to his attack on you.\" (al-Baqarah\/2:194). Likewise, injuring people has a story. People who hurt other people, he must also be hurt the same as the wound he did both in terms of width and depth, as Allah says: \"And if you repay, then repay with (reply) the same as the punishment that was inflicted on you.\" (an-Nahl\/16:126). Whoever relinquishes his inheritance rights voluntarily, and forgives the offender so that they are not punished, it becomes a penance for those who forgive. A person who is released from the kisas law because he is forgiven by the family of the person who was killed does not mean that he has been completely freed from punishment, but he is still subject to a death sentence (compensation), as the Prophet said: From Abu 'Amr, the Messenger of Allah said, \"Whoever kills intentionally, then the verdict is left to the heirs of the person killed. If they want (kisas) they can kill him, and if they want (free him from kisas) then they have the right to receive diat (compensation).\" (History of at-Tirmidhi). Whoever does not carry out the provisions mentioned above, namely kisas which is based on justice, but uses the law according to his heart, then they are people who are unjust, because they violated Allah's law and consider those who are killed or abused to be low class, not equal to those who kill or persecute."
		   },
		   {
			"id": 715,
			"surah": 5,
			"ayat": 46,
			"tafsir": "In this verse it is explained that after the end of the era of the adherents and executors of the contents of the Torah, the Prophet Isa, the son of Maryam, was sent to follow in the footsteps of the previous prophets of the Children of Israel, carrying out the Torah that had been revealed previously. Then the Gospel was revealed to Prophet Isa who perfected the contents of the Torah which had expired, adapted to the circumstances and conditions of the people and society. The Bible contains instructions, and is a light that enlightens its people, so that they can see the true path that makes them happy. The Bible justifies the previous divine book, namely the Torah which contains values that can save its people from going astray in faith and deeds, such as monotheism eradicating shirk and idols which are the source of superstition and evil. The Bible contains instructions and teachings, for example teachings which tell that a prophet will appear (New Testament, John xiv.16, xv. 26 and xvi.7. see also tafsir of as-shaff\/61:6), who has the characteristics noble, the Shari'a is more perfect and universal (comprehensive) not limited by time and place. He is the final prophet and the last apostle. But none of these instructions and teachings can take advantage of them except those who are pious."
		   },
		   {
			"id": 716,
			"surah": 5,
			"ayat": 47,
			"tafsir": "In this verse Allah strictly orders followers of the Bible, namely followers of the law of the Prophet Isa, to carry out the contents of the Bible until the arrival of the final prophets and apostles from the Arab nation, so that they are punished according to what Allah has revealed in it, not to be distorted and not to be interpreted. with the desires of his lust, like the adherents of the law of the Prophet Musa. Even so, not a few of them are disobedient, distorting its meaning and understanding. They change and adjust to the will of their leaders, so that the original Bible which is truly heavenly is no longer known where it is. They are wicked people because they no longer judge and decide matters according to what Allah has revealed."
		   },
		   {
			"id": 717,
			"surah": 5,
			"ayat": 48,
			"tafsir": "After explaining that the Torah had been revealed to Prophet Musa, and the Bible had also been revealed to Prophet Isa and that the two books were obeyed and practiced by their respective adherents. In this verse it is explained that Allah sent down the Qur'an to the last Prophet and Messenger Muhammad saw. The Qur'an is the last Divine Book that brings the truth, includes the content and justifies the previous holy books such as the Torah and the Bible. Al-Qur'an is a well-preserved book, so it will not experience changes and falsifications. Allah's Word confirms: (which) will not be visited by evil either from before or from behind (in the past and in the future), which was sent down from God, the Most Wise, Most Praised. (Fussilat\/41:42). Al-Qur'an is the holy book that guarantees the pure Shari'a beforehand, and the holy book that is valid from the time it was revealed until the day after. Therefore, it is obligatory to judge and decide the case of the human child in accordance with the law that has been revealed by Allah, which has been contained in the Al-Qur'an. It is not the right place to indulge their desires and whims that are contrary to the truth brought by our master the Prophet Muhammad. Each ummah was given shari'a (special regulations), and they were obliged to implement them, and they were also given the path and instructions that must be implemented to cleanse themselves and purify their minds. The Shari'a of every community and the path that must be followed may change and vary, but the basis and foundation of the divine religion is only one, namely monotheism. Torah, Bible, and Al-Qur'an, each has its own Shari'a, which contains provisions of lawful and unlawful law, according to His will to know who obeys and who does not. Allah's Word: And We did not send any messenger before you (Muhammad), but We revealed to him, that there is no god (who has the right to be worshiped) besides Me, so worship Me. (al-Anbiya'\/21:25). \"And indeed, We have sent messengers to every nation (to call on),\" Worship Allah, and stay away from thagut.\" (an-Nahl\/16:36). one kind of path that they will take and practice so that from age to age there is no increase and progress, just like a bird or a bee, God's will will certainly be carried out and there will be no difficulty in the slightest, because God has power over all things. willed by Him. Allah wills that humans are creatures that can use their minds and minds, can progress and develop from age to age. From childhood to adolescence to increase to adulthood and so on. Thus Allah wills and gives to each separate shari'ah people, to test the extent to which humans can and are able to carry out God's commands or stay away from His prohibitions, as has been stated stipulated in His heavenly book, to be rewarded or tortured. Therefore, humans should compete in doing good and good deeds, in accordance with the Shari'a brought by the last prophet Muhammad SAW. Shari'a that replaces the previous Shari'a, for the benefit of the world and happiness in the hereafter. Someday, inevitably, humans will return to God to fulfill His call to the afterlife. It is there that Allah will tell everything about the nature of the dispute between them. Those who truly believe will be rewarded, while those who deny and reject the truth, and deviate without reason or evidence, will be punished and put in hell."
		   },
		   {
			"id": 718,
			"surah": 5,
			"ayat": 49,
			"tafsir": "It was narrated by Ibn Jarir and al-Baihaqi from Ibn Abbas, that Kaab bin Asad, Abdullah bin Suriya, Wisyas bin Qais from the Jews said \"Let's go to Muhammad, hopefully we can lead him astray.\" So they went to the Prophet and they said to the Messenger of Allah .: \"O Muhammad, you already know that we are Jewish priests, princes and leaders. If we follow you, the Jews will surely follow us and there will those who dare to oppose. Between us and our people there is a dispute. We will bring the dispute to you, so you should win us over them, and we will believe and will justify you. So the Messenger of Allah was reluctant (to follow their will) and Allah Azza wa Jalla sent down verses about their case.... wa anihkum bainahum bima anzala Allah....\" (History of Ibn Jarir and al-Baihaqi from Ibn Abbas) The Prophet refused their request, so this verse was revealed. Prophet Muhammad to decide the cases of the Jews submitted to him in accordance with what has been revealed by Allah and never indulge their desires and desires. Allah reminded the Prophet to be careful with their tactics, not to be trapped by the deceit of those who wanted to divert him from some of the laws that Allah had revealed and outlined for him. If they still turn their backs and don't want to accept a decision based on what Allah has revealed, it is because their intention was to ask the Prophet to decide the case just to lure and trap him, in case they could turn away from Allah's law. Know that this is because Allah wills that they will be punished in this world, the consequences of their sins and will be perfected later in the hereafter, a very painful punishment. Indeed, most humans are wicked, are like disbelievers, happy to leave Allah's laws and the Shari'a that have been chosen for them."
		   },
		   {
			"id": 719,
			"surah": 5,
			"ayat": 50,
			"tafsir": "It is narrated that the Bani Nadhir submitted a case that occurred with the Bani Quraiza to the Prophet to be given a decision. Among the Bani Nadhir there were those who asked the Prophet that the case be decided in accordance with the decisions that were valid in the era of ignorance, namely that there was a difference in degree between the two groups, so that the diat imposed on the Bani Quraizah was double the diat imposed on the Bani Nadir, because according to them, the Bani Nadir were stronger, more noble and of a higher rank. Prophet peace be upon him. did not accept their request and he said, \"The people who were killed were of the same rank, there was no difference.\" The Bani Nadir people said, \"Then we also reject and do not accept such a thing.\" Then come down this verse. In this verse Allah scorns and considers their actions as something strange, they have a heavenly book and extensive knowledge, but they still prioritize the laws of ignorance which are clearly contrary to the laws in the Torah, even though Allah's laws are laws the best, because it is comprehensive, fair and correct, regardless of degree and so on."
		   },
		   {
			"id": 720,
			"surah": 5,
			"ayat": 51,
			"tafsir": "This verse prohibits believers from taking Jews and Christians as close friends who will provide help and protection, let alone to be trusted as leaders. Apart from this verse, there are many other verses in the Qur'an which state this kind of prohibition against Jews and Christians. Repeating this prohibition many times in several verses of the Qur'an, shows that the matter is very important and if it is violated it will bring great danger. This prohibition applies to individuals. Believers are prohibited from making Jews and Christians as close friends, a place to share secrets and beliefs as is the case with fellow believers. Likewise, it applies to congregations and the believing community, that they are prohibited from making Jews and Christians as defenders, protectors and helpers, especially in matters related to religion. If it's just to make casual friends in association, especially in worldly affairs, God doesn't forbid it, as long as you are careful in your association, because for them the nature of breaking promises and lying to seek worldly benefits is normal. Something like this was shown by the Prophet when he was in Medina. He entered into cooperative relations with Jews and Christians and sometimes entered into defense agreements with them, if it was deemed beneficial for believers. Jews and Christians have a very strong sense of class and ethnicity. Therefore, no matter how good their relationship with the believers is, they like to enter into agreements to cooperate with them, but if it is detrimental to their group and nation, they will not hesitate to turn back, betray their promises and become enemies of the believers. They always help each other, unite in facing the believers. He is born good, but his heart is always looking for opportunities to destroy believers. The end of this verse emphasizes that whoever among the believers makes Jews and Christians his close friends, then that person is included in their group, without realizing it, gradually that person will be influenced, will not help Islam, but will become an enemy. Islam. If he has become an enemy of Islam, it means he has wronged himself. Know, that Allah will not guide people who are persecuted, to the right path to achieve a happy life in this world and the hereafter."
		   },
		   {
			"id": 721,
			"surah": 5,
			"ayat": 52,
			"tafsir": "This verse explained to Muhammad that the Prophet would see people in whose hearts there was disease, namely hypocrites whose faith was weak, had not yet reached the level of conviction, such as Abdullah bin Ubay and others. They are closer to the Jews than to the believers themselves. Abdullah bin Ubay as the leader of the hypocrites, has a closer relationship with the Jews every day. While other hypocrites, have dared to make cooperation agreements, even closer cooperation with the Jews. It was as if they depended on the Jews for their safety, out of fear that lest the Jews become strong and powerful, they themselves would be in danger. The hypocrites lack faith in the power of the Prophet Muhammad, and the Muslims will be helped by Allah with victory and glory. Allah has promised, that every believer who fights to defend His religion, will be assisted with strength and victory. So it was at that time that the regrets of doubtful and hypocritical people arose and the secret of their heart that they had kept open was revealed."
		   },
		   {
			"id": 722,
			"surah": 5,
			"ayat": 53,
			"tafsir": "This verse describes the condition of the believers who Allah has given help and comfort to their enemies, thanks to the strength of their faith and their determination. Some of them with a feeling of astonishment and astonishment said to others about the condition of the hypocrites who had regretted and revealed their secrets, because they had poured out their hopes on the Jews and Christians to defend and help them, suddenly their hopes were in vain , even though the hypocrites had sworn allegiance that they would join the believers to destroy the Jews. The oath of allegiance was just a mere deception, but they had made a cooperation agreement with the Jews. The result of their hypocrisy was not to benefit them, but to make them humiliated before men and cursed before God. So wipe out their deeds, they receive no reward from Allah, even though they always establish prayers, fast and participate in jihad with the believers, because of their hypocrisy. In fact, they are meant to be a group of people who are losers in this world and in the hereafter."
		   },
		   {
			"id": 723,
			"surah": 5,
			"ayat": 54,
			"tafsir": "This verse contains news of a challenge that will occur, namely the apostasy of some believers. They will leave Islam openly. Their exit from Islam will not harm the believers, but the opposite will happen, namely Allah will replace them with people who have stronger faith and better deeds, as a substitute for those who apostate. According to the history of Ibn Jarir from Qatadah, it is told that after this verse was revealed, several groups of people would apostatize, leaving Islam. The event then really happened, when the Prophet Muhammad. When they returned to Rahmatullah, some Muslims apostatized, with the exception of three places, namely the people of Medina, the people of Mecca and the people of Bahrain. Among the signs of their apostasy is that they no longer want to pay zakat. They said: \"We will continue to pray, but we do not want to pay zakat. By Allah, our property may not be confiscated.\" So Caliph Abu Bakr at that time was forced to take tough measures. The apostates were fought against, so that some of them died, some were burnt and some were arrested, and finally they returned to agree to pay zakat. There are many occurrences of this apostasy. In history it is stated that during the time of the Prophet Muhammad. still alive, three times apostasy occurred, namely: 1. The Bani Madzhij group pioneered by Zulkhimar, namely al-Aswad al-Ansi, a sorcerer. He claimed to be a prophet in Yemen, he was killed by one of the Muslims. 2. The Bani Hanifah group, namely Musailimah al-Kadzdzab, Musailimah claims to be a prophet. He once sent a letter to the Prophet Muhammad. invited him to divide the power in two Arab countries. He ruled over half of the country and Prophet Muhammad peace be upon him. rule the rest. Prophet Muhammad SAW. replied to his letter saying that this earth belongs to Allah and Allah will destroy this earth to whomever among His servants wills and that the final victory will be with those who fear Him. Finally Musailimah was fought by Caliph Abu Bakr and she was killed by Wahsyi who had previously killed Hamzah, the Prophet's uncle in the Uhud War. 3. The Bani Asad group, whose leader was named thulaihah bin Khuwailid, he also claimed to be a prophet, so Abu Bakr fought him by ordering Khalid bin Walid to kill him. He retreated and fled to the land of Sham and finally he returned to being a good Muslim. After the Prophet Muhammad saw. died, during the time of Caliph Abu Bakr, there were many apostate groups consisting of 7 groups, namely: (1) Gatafan, (2) Khuza'ah, (3) Bani Sulaim, (4) Bani Yarbu', (5) some of Bani Tamim, (6) Kindah, and (7) Bani Bakr. The people who replace the apostates always tell the truth and help the cause of Islam, marked by Allah with six important characteristics, namely: 1. Allah loves them, because of their faith and belief in fighting. 2. They love Allah, because Allah's commands take precedence over other matters, 3. They are gentle with believers, 4. They are tough and firm with unbelievers. 5. Jihad fi sabilillah, namely being serious in upholding Allah's religion, willing to sacrifice with wealth and self and not be afraid to fight against religious enemies, 6. They are not afraid of insults and reproaches, not afraid of bullying and threats. Because they are always in charity, struggling, not seeking praise and adulation from humans, nor seeking rank and position nor seeking name and influence. All they seek is the pleasure of Allah alone. The characteristics mentioned above are God's gifts to His desired servants. With these qualities a person's degree becomes high and noble before humans, and especially before God who has great gifts. All of this will be obtained by getting closer to Allah and increasing worship and gratitude."
		   },
		   {
			"id": 724,
			"surah": 5,
			"ayat": 55,
			"tafsir": "In this verse, Allah reaffirms the problem of guardians, that is, the helpers and protectors of the believers are none other than Allah and His Messenger and the believers themselves. This affirmation is intended so that the believer does not hesitate and become weak in conviction, because of the promptings and persuasion of people who are weak in faith. They should have a firm stance, be confident in the struggle, do not depend on other people, other than fellow believers and do not ask for help, other than hoping for Allah's help solely. This verse describes the characteristics of a believer who will be made a leader and helper. Do not just anyone claim to be a believer, because many people only claim to be believers in word of mouth, but in their daily deeds they show the actions of hypocrites. Sometimes he participates in worship, such as praying, fasting and so on, but only to attract the attention of the believers, just pretending, not coming out of his heart. Most of their actions are driven by the joy of wanting to be praised and seen by people, they have very little memory and obedience to God's commands. You have to be careful with people like this, especially in making them leaders and helpers. There are three kinds of actions and practices that must be owned by a believer who will be made a leader and helper, namely: 1. Establishing prayers, with the true meaning. Done according to the time and according to the manners that have been determined. So that prayer can influence words and deeds, making him a believer who has morals, can be trusted and followed, 2. Pay zakat to those who are entitled to receive it. with full obedience and obedience to Allah. By paying zakat he becomes a kind-hearted, generous person, likes to pay attention to the fate of his followers and his people. From him came good examples in defending the believers, especially the weak and poor believers. 3. Humble yourself to God. Against Allah he still worships and towards society he shows noble morals and deeds."
		   },
		   {
			"id": 725,
			"surah": 5,
			"ayat": 56,
			"tafsir": "This verse is Allah's guarantee to the believer who has made Allah, His Messenger and the believer to be his leader and helper. Allah guarantees and promises victory for them. They are called \"hizbullah\", staunch adherents of Allah's religion. God's help will come down to them, so they will get the most glorious victory."
		   },
		   {
			"id": 726,
			"surah": 5,
			"ayat": 57,
			"tafsir": "From this verse and the following verses it can also be seen the reasons for the prohibition of making disbelievers as protectors and helpers. According to the history of Ibn Ishak and the congregation from Ibn Abbas it is told that Rifa'ah bin Zaid bin Attabut and Suwaid Ibn Haris, both of them were hypocrites who claimed to be Muslims, so that many Muslims were close friends with them, so the verse was revealed This. This verse prohibits a believer from turning an infidel who likes to ridicule and make fun of the Islamic religion to be his loyal friend, protector and helper. both genuine infidels, fire worshipers, idols, etc., as well as non-genuine ones such as the People of the Book, namely Jews and Christians. Some commentators explain, among other things, as follows: Islam distinguishes between the People of the Book and the non-Muslim polytheists of Arabia, namely they are allowed to eat animals slaughtered by the People of the Book and marry their women with certain conditions as stated in surahh al-Ma'idah\/ 5:5, and it is forbidden to argue with those who are unjust, as explained in surahh al-'Ankabut. In this verse the term \"People of the Book\" is a designation for people who are Jewish and Christian, even though the Torah and the Bible which are their holy books have been mixed with human words and they do not believe in the Al-Qur'an. As for the term Musyrik or Musyrikin, this is for genuine disbelievers, because they have associated partners with Allah from the start, while those of the People of the Book, the element of uniting Allah contained in their basic creed came later, not from their original teachings. Furthermore, Allah commands the believers to be pious and stay away from His prohibition, namely making close friends with unbelievers, both true infidels and infidels from People of the Book, because there is no reason for true believers to be close friends or help helping with unbelievers who ridicule and make fun of other religions"
		   },
		   {
			"id": 727,
			"surah": 5,
			"ayat": 58,
			"tafsir": "This verse explains part of the ridicule and games of the disbelievers against the religion of Islam, that is, when Muslims invite them to pray, the infidels make this invitation a mockery and game while laughing at them. According to the history of Ibn Jarir from as-Suddi, he narrated that there was a Christian man in Medina, when he heard the call to prayer Asyhadu anna Muhammad Rasulullah (I confess that Muhammad is the messenger of Allah), he said, \"haraqa al-Kadzdzab \" (may the liar burn). Then one night, his housekeeper came in carrying a fire and small grains of fire fell from the fire she was carrying, causing the whole house to burn down and the Christian man and his family were also burned while he was sleeping. It is further explained that the actions of such disbelievers are caused because they are a people who do not want to use reason and do not want to know about the nature of Allah's religion which obliges them to glorify and worship Him. If they used their reason properly, without being influenced by hatred and hostility, their hearts would be humbled when they heard the call to prayer in a melodious voice, especially if they understood and understood the call to prayer which begins with words that glorify Allah."
		   },
		   {
			"id": 728,
			"surah": 5,
			"ayat": 59,
			"tafsir": "According to history, Ibn Jarir and others told the Jews, including Abu Yasir bin Akhtab and others, they asked the Prophet Muhammad about who the apostles believed (believed) in them, the Prophet Muhammad replied, \"I believe in Allah and what was revealed to us and what was revealed to Abraham, Isaac, Jacob and Asbat, and what Allah gave to Moses, Isa and the other prophets, without distinguishing between them. And we submit ourselves to Him. The Prophet Muhammad called Jesus\", they did not acknowledge his prophethood and said, \"We do not believe in people who believe in him, so this verse came down. This verse gave instructions to the Prophet Muhammad to refute the people of the Book with the following form of questions, \" O People of the Book, do you despise, hate and despise us, just because we believe in Allah and in what was revealed to His former messengers? you? We did nothing other than that, because there is no proper reason for you to blame and hate us, other than because most of you have become wicked people.\" In essence, they could not answer this rebuttal other than to be indifferent and continue mocking and insulting the religion of Islam and the Muslims.Therefore Allah sent down the following verse again to give a stronger rebuttal, so that they all kept quiet."
		   },
		   {
			"id": 729,
			"surah": 5,
			"ayat": 60,
			"tafsir": "This verse is in the series of Allah's instructions to His Messenger Muhammad to provide a rebuttal to the People of the Book as described in verse 59. According to the history of St-thabarani, he narrates that the People of the Book said to the Prophet Muhammad which meant, \"There is no religion that we know more bad from your religion\", then this verse came down to refute it. In this verse Allah ordered the Prophet Muhammad to say the following: \"Do I need to inform you about those who mock our religion and call to prayer, something worse in Allah's sight of the (ungodly) work that you are doing, namely you were made into monkeys and pigs.\" The narration of Ibn Abbas narrates that the event of violating the honor of the Sabbath (Saturday) has given rise to two kinds of incidents. The first incident is young people turning into monkeys; in the second, old people become pigs. (See also the tafsir of 2:65 and 7:166) Furthermore, Allah ordered His Messenger to convey that they are the ones with a worse place in the hereafter and are astray from the true path."
		   },
		   {
			"id": 730,
			"surah": 5,
			"ayat": 61,
			"tafsir": "After the last few verses explained the behavior of the disbelievers and the People of the Book from the Jews, then in this verse and the following verses, Allah also explains the behavior of the hypocrites from the Jews of Medina and its surroundings. According to the narrations of Qatadah and as-Suddi they narrated that the Jews came to declare their Islam to the Prophet Muhammad and his companions who happened to be there at the time, so this verse was revealed to reveal the falsehoods of these hypocrites. This verse explains to Muhammad and his companions, which means: When it comes to you hypocrites from the Jews who say, \"We believe in Allah's Apostle Muhammad and what was revealed to him,\" then know that in their hearts there is still disbelief and misguidance that never changes, since they entered your place until they left. Allah knows what they hide in their hearts, when they visit you by means of deceit until they come out in all kinds of deceit to find out about your condition that they need to convey to their people."
		   },
		   {
			"id": 731,
			"surah": 5,
			"ayat": 62,
			"tafsir": "This verse also explains something that means the following: \"And you, O Muhammad, will see that many of the Jews make your religion an object of ridicule and play. They immediately continue and continue their acts of sin and enmity, with words, such as ridiculing, insulting , lie and so on. Apart from that they always eat what is forbidden, such as usury, bribes, corruption and so on. Furthermore Allah said which means: \"Verily what they have done is very bad\", because in essence they have drowned themselves into in a sea of crime that has no shore, so that they can no longer be helped."
		   },
		   {
			"id": 732,
			"surah": 5,
			"ayat": 63,
			"tafsir": "This verse expresses reproach which means the following: Why did the pious people and the Jewish priests not want to forbid their people to lie and eat unclean treasures? Ibn Abbas narrates that there is nowhere in the Qur'an a harsher reproach than this verse against the clergy who neglect their duties in preaching about prohibitions and crimes. Scholars of tafsir say that this verse is not just telling God's slurs to the Jewish priests who do not point out a good way for the wicked Jews, but what is more important than that, what we must realize is that the Jews forbade the Islamic scholars to convey Da'wah especially advocates good deeds and discourages bad deeds."
		   },
		   {
			"id": 733,
			"surah": 5,
			"ayat": 64,
			"tafsir": "According to the history of Ibn Ishak and at-thabrani from Ibn Abbas he said, \"A Jew named Nabbasy bin Qais said to the Prophet Muhammad, 'God you are stingy, do not like to give.\" So this verse, although it is said that only one person from among the Jews told the Prophet, it can be considered as describing the overall position of his people. This verse tells that the Jews said, \"The hands of Allah are bound,\" but what was actually bound were their own hands, thus they would be cursed by Allah. The saying of the Jews that \"God's hands are bound\" is nonsense, because they admit that Allah is the name of a definite and omnipotent being, He is the creator of the universe. This shows that God's hands are not shackled and His power is unlimited because if so, then surely He cannot maintain and govern this nature. So what prompted them to say such words? Some commentators state that the encouragement is as follows: 1. Maybe they heard the verse: Whoever lends Allah with a good loan, Allah will multiply in exchange for him a lot. Allah withholds and expands (sustenance) and to Him you will be returned. (al-Baqarah\/2:245). After hearing this verse they say that God's hands are shackled, which means miserly, because God is incapable and poor, so he needs a loan. 2. They said these words by mocking the Muslims when they saw the Prophet's companions who were in tightness and financial difficulties. 3. In the beginning the Jewish community was a wealthy people. When the Prophet Muhammad was sent as an Apostle they opposed Him, therefore they spent a lot of property to finance the failure of da'wah so that many rich people from among them became poor. Because Allah does not increase sustenance for those who are already poor, they utter the words \"God's hands are shackled\" with the intention, Allah is stingy because he does not help them. The statement in this verse states that \"It is the hands of the Jews who are bound and they are cursed because what they have said is a statement against their stinginess, that is they are the ones who are stingy, their hands are tied, they do not want to give help. It turns out that they are indeed a people who are stingy , they only want to provide assistance if they see that there is hope of getting a big profit. And they will surely receive Allah's curse in return for their actions. This verse also confirms that Allah is Most Gracious and He gives as He wishes. The saying \" hand\" in Arabic has several meanings, namely: (1) one of the members of the human body, (2) strength, (3) possession (possession), and (4) favors. This fourth understanding is what is meant by the words \"hand\" hand\" that is leaning on Allah in this verse. Thus the khalaf scholars interpret the hand in this verse. By this way ian should be interpreted the words \"God's two hands are open\" with the meaning of God's grace spread wide, these gifts are given to whomever He wills. As for those who do not receive God's grace, do not think that God is miserly or needy. There are differences in human levels in receiving sustenance from Allah, including sunnatullah. Allah said: \"Are they those who divide the mercy of your Lord? It is We who determine their livelihood in the life of the world, and We exalt some of them above others by several degrees, so that some of them can take advantage of some of the others. And the mercy of your Lord is better than what what they collect.\" (az-Zukhruf\/43:32). The interpreters in interpreting this verse have two opinions, namely: First, they are known as tawil experts, namely those who interpret the meaning of sentences according to majazi (figurative) meanings, for example the verse: \"But the face of your Lord, who has greatness and glory, remains eternal.\" (ar-Rahman\/55:27). This group interprets the word \"face\", for example in the sentence \"I don't see so and so's face\" meaning self or so and so. So the sentence is the same as the sentence \"I don't see so and so (without mentioning the word \"face\"). Second, the tafwid expert group, namely surrendering the meaning of such a sentence or saying to Allah. They interpret the hand with its true meaning. So this means the word \"face\" \" in the verse of surahh ar-Rahman, according to the essential meaning, namely \"face.\" Regarding the condition of the face of God, they also surrender to God, and in this case they hold on to the verse: There is nothing like Him\" (asy-Syura \/42:11). So this group determines that God has a face, but not like a human face. This verse conveys to Muhammad that what was revealed to him will truly add to the rebellion and disbelief of most of the Jews and explains that the verses revealed contain knowledge that was not known to the Jews who were at the time of the Prophet Muhammad. Because if this were not the case, Muhammad would not have known all of this, because he was a mother who could not read or write well. But because of envy and bigotry, the Jews were further away from believing in the Prophet Muhammad even though Muhammad's prophethood had been written in the holy book. This verse also explains that Allah will create enmity among the People of the Book. The enmity will not end until the Day of Judgment. The character of the Jews really likes to kindle the fire of war, slander and chaos. Such character has been recorded in history and proves that they always tried to deceive the Prophet Muhammad and the believers either directly or by persuading the polytheists or Christians to fight the Prophet Muhammad and the believers. Such a character makes them happy to do and see the corruption in the earth. But every time they light the fires of war, slander and chaos, and try to cause damage, Allah still extinguishes them, because Allah does not like people who do damage, therefore their efforts to cause damage and disaster on this earth always fail. ."
		   },
		   {
			"id": 734,
			"surah": 5,
			"ayat": 65,
			"tafsir": "This verse explains that if the People of the Book had believed in Allah and had believed in Muhammad as the Prophet of the end times, and they were pious by avoiding sinful activities, Allah would have forgiven all the sins and crimes they had committed. Allah will enter them into heaven which is full of all kinds of favors. Allah's forgiveness and the promised paradise depend on faith, piety and obedience. Faith without piety is a hypocrisy that is only used to seek worldly gain. According to this verse, Allah is Forgiving and forgives the sins of those who believe and are pious."
		   },
		   {
			"id": 735,
			"surah": 5,
			"ayat": 66,
			"tafsir": "This verse explains that if the People of the Book really carried out the law of the Torah and the Bible, such as affirming Allah and holding on to the good news contained in the Torah and the Bible about the prophethood of Muhammad, surely Allah would expand their lives. So if in the last verse Allah promised happiness in the afterlife to the People of the Book, if they have faith and are pious, they will receive worldly happiness and spaciousness of sustenance and an abundance of His grace from the sky, by growing various plants. Even so, they remained disobedient and opposed to Allah's apostles. This verse also explains that among the Jews there is a group who are indecisive in their religion, do not adhere fanatically to the opinions of their priests and do not take them lightly. Indeed, the majority of Jews are very fanatical about the opinions of their clergy. This group is bad behavior. The same thing happened among Christians. According to custom, although the middle class of each religion doesn't have many followers, people from among them emerge who like to improve conditions and follow developments and accept the truth. People like this exist in every nation and every era. For example, Abdullah bin Salam and his Jewish friends became loyal followers of the Prophet Muhammad. Likewise, Najasyi and his friends from the Christian community became loyal followers of the Prophet Muhammad. This shows that the function of religious adherents is to seek the truth. So if a follower of a religion adheres to religious instructions correctly, surely he will not become fanatical, rigid and accept the religion that is justified in his books. In seeking the truth, the main capital is sincerity accompanied by knowledge. Seeking the truth with this capital is in Islam. Adherents of Islam themselves who do not practice the instructions of Islam, of course, the truth that exists in Islam cannot be obtained. In connection with this verse, there is a hadith of the Prophet narrated by Ziad bin Labid, namely: From Ziad bin Labid, he said, \"The Prophet Muhammad spoke of something and then he said,\" Such a thing is when science has disappeared. Ziad said, \"We (the companions) said, \"O Messenger of Allah, how can knowledge disappear, while we read the Qur'an and we read it also to our children and our children also read it to their children until Doomsday.\" The Messenger of Allah replied, \"Woe to you, O son of Ibn Labid, if I knew you were the most knowledgeable among the people of Medina, wouldn't the Jews and Christians read the Torah and the Bible, while they did not benefit at all.\" (Ahmad's history). It is clear from this hadith that Muslims who do not practice their religious instructions, they are similar to Jews and Christians. According to the history of Ibn Abi Hatim, after this discussion, this verse 66 was revealed."
		   },
		   {
			"id": 736,
			"surah": 5,
			"ayat": 67,
			"tafsir": "This verse instructs the Prophet Muhammad to convey what has been revealed to him regardless of the magnitude of the challenges among the People of the Book, the polytheists and the wicked. This verse advises the Prophet Muhammad not to be afraid of facing interference from them in spreading the secret and the ugliness of their behavior because Allah guaranteed that he would protect the Prophet Muhammad from harassment, both before the migration by the Quraish infidels and after the migration by the Jews. What Allah has sent down to Muhammad is a mandate that must be conveyed entirely to humans. Conveying only part of His message is considered the same as not conveying it at all. Such was the severity of Allah's warning to Muhammad. This shows that the task of conveying the message is the obligation of the Apostle. The delivery task should not be postponed even though the delay is done to wait for human ability to receive it, because the delay can be considered as an act of concealment against God's message. Threats against concealing some of God's message are as severe as threats against the attitude of someone who believes in only some of the messengers and believes in only some verses of the Qur'an. Even though an apostle is infallible, namely preserved from the nature of not conveying, this verse emphasizes that the task of delivering a message is an obligation that cannot be negotiable or postponed even though it concerns the personality of the Apostle himself as was the case later between Zainab bint Jahsy and the Prophet Muhammad as which is described in al-Ahzab\/33: 37: \"And (remember) when you (Muhammad) said to a person who has been given favors by Allah and you (also) have given favors to him, \"keep on keeping your wife and fear Allah\", while you hide in your heart what Allah will reveal, and you are afraid of people when Allah has more right for you to fear (al-Ahzab\/33:37). In this connection Aisha and Anas said, \"If only the Prophet Muhammad would hide something in the Qur'an, of course it is this verse that he hides.\" From the statements of 'Aisyah and Anas, it is clear what happened What happened between Zainab bint Jahsy and Zaid was an ongoing divorce with the enactment of Allah's will, namely marrying Zainab to the Prophet Muhammad. This was not stated by the Prophet Muhammad to Zaid when he complained about the incident to the Prophet Muhammad, even though he already knew about it through revelation. The Prophet Muhammad, hid the things he knew in accordance with decency while avoiding the accusations made by the hypocrites. Even so, the Prophet Muhammad still received Allah's criticism, as is known in the verse in the surahh al-Ahzab. Strictly speaking, verse 67 threatens those who conceal Allah's message as stated in His word: \"Indeed, those who conceal what We have sent down are in the form of statements and instructions, after We have explained to people in the Book (Al- Qur'an), those are the ones whom Allah cursed and cursed (also) by those who cursed.\" (al-Baqarah\/2:159). In line with this Qur'anic threat, the Prophet Muhammad said to warn those who hide knowledge: Whoever is asked about a knowledge and hides it, he will be restrained on the Day of Judgment with restraints from the fires of hell. (History of Abu Daud, at-Tirmidhi from Abu Hurairah). Furthermore, the end of this verse emphasizes that Allah will not give instructions to unbelievers who disturb the Prophet Muhammad and their work must be in vain because Allah will continue to protect His Prophet and will continue to exalt His words."
		   },
		   {
			"id": 737,
			"surah": 5,
			"ayat": 68,
			"tafsir": "In this verse, Allah ordered Muhammad to tell the People of the Book that they could not be seen as religious people as long as they did not uphold the teachings of the Torah, the Bible and the teachings that had been revealed to the Prophet Muhammad, namely the Qur'an, because if they upheld the teachings of the Torah and the Bible, surely there would be no factions that they opposed and cursed. If there are other people who disturb them, of course they will apologize, they will even turn their left cheek when someone hits them on their right cheek. They will not compete in preparing world-destroying weapons for the sake of the world's human survival. For that peace they will certainly expend their wealth. But the fact that their behavior is the other way around does not show that they are religious people. In fact, most of them have increased their rebellion and disbelief towards something that was revealed by Allah to the Prophet Muhammad, namely the Qur'an as the perfect book of Allah's religion. This illustrates that they do not truly believe in Allah and do not truly believe in the apostles. Strictly speaking they did not do the good works that their Scriptures required. So most of them only adhere to bad customs and bigotry, therefore they reject the Qur'an, consciously because they are far from the true teachings of their religion. Religion before Muhammad is the basis of the religion brought by the Prophet Muhammad because Islam is a refinement of previous religions. Because they see the Qur'an through the eyes of hostility and bigotry, their bigotry and rebellion increases. Indeed there is a small group of those who maintain the teachings of Tawhid, who love the truth; they are the people who look at the Qur'an with awareness because they believe that the Qur'an is actually from their Lord and that the Prophet whose Al-Qur'an was revealed to him is the last Prophet written in their books, so they believe in Muhammad like the Jewish and Najasyi scholars and Christians. Furthermore, the end of this verse forbids the Prophet Muhammad from mourning the disbelievers who did not respond to his call for them to believe in the Qur'an."
		   },
		   {
			"id": 738,
			"surah": 5,
			"ayat": 69,
			"tafsir": "This verse in terms of understanding is no different from verse 62 of surahh al-Baqarah. He repeated again, with a different order. In line with the previous verse, namely verse 62, which instructs Muhammad to tell the People of the Book, that they are not considered religious as long as they do not truly believe in Allah and practice the guidance of the Torah and the Bible as well as the teachings of the Qur'an, then in this verse Allah explained that this applies to the followers of all the apostles before Muhammad, namely Jews, Christians and shabiin (not Jews and Christians). If they carried out the instructions of their religion before their hands changed, they would not be worried about the next day and those who met the Prophet Muhammad but opposed him or pretended to believe, when they repent and do good deeds, they would not worry about the next day. because a person has no advantage unless he believes in Allah and in the Hereafter and does good deeds. Humans have two kinds of strength: first, strength in the field of theory and second, strength in the field of practice or practice. Strength in the field of theory only reaches its perfection if humans have knowledge. Human knowledge will only reach perfection if it comes to the knowledge of the most noble thing, namely Allah, the Almighty and Almighty God, raises and gathers people in the desert of mahsyar. Thus the most noble knowledge is faith in Allah and the Last Day. The most noble of good deeds is serving Allah and trying to convey things that are beneficial to humans. So those who approach Allah with faith and practices like this will certainly not worry in the slightest about the riots and disasters of the Day of Judgment and they will not grieve over the blessings of the world that they have never experienced while living in the world."
		   },
		   {
			"id": 739,
			"surah": 5,
			"ayat": 70,
			"tafsir": "This verse explains that Allah took a promise from the Children of Israel, namely in the form of their pledge to believe in Allah and practice the contents of the Torah as the sharia which Allah revealed to them. To provide an explanation of the contents of the book Allah sent His messengers to them. But every time an apostle came to them who brought instructions that were not to their liking, they treated the apostle with the most despicable treatment. A group of them belied the apostle and some of them persecuted and killed the apostle. This shows how evil their behavior was so that the instructions brought by the apostle did not impress them in the least, instead their disbelief and tyranny increased."
		   },
		   {
			"id": 740,
			"surah": 5,
			"ayat": 71,
			"tafsir": "This verse explains that the Jews did not expect that Allah would give them a very severe trial due to their very heinous and exceeding cruelty, because they considered that they were the children of Allah and His beloved, therefore they considered themselves free from Allah's punishment. . It is as if they are blind to the facts that show God's torments against people who do damage and tyranny. They seem to be deaf to the teachings and instructions that are full of God's threats; namely the torment of those who cancel the promises that have been made because they follow the appetite to commit injustice. According to history, when the Babylonians were under the rule of Nebuchadnezzar around 586 BC to conquer the Jews, they destroyed Solomon's Temple in Baitulmakdis, seized property and raped women. After the Jews returned to the teachings of the Torah and repented to God, then God gave them help to escape from the cruelty of the Babylonians. But after their sight was blind to warnings, and their ears were deaf to God's instructions, they returned to committing injustices by killing the apostles, then God's trials came again, namely they were controlled by the Roman empire one after another. Indeed, it is not all Jews who commit crimes with the fact that a small group of them do good, but it has become sunnatullah that God's trials fall on all people equally as a result of the actions of unjust groups. Allah has warned in His word: \"And protect yourselves from the torment that does not only afflict those who are unjust among you.\" (al-Anfal\/8:25). Furthermore, the end of this verse explains that Allah is All-Seeing to the actions or behavior of the Jews towards the Prophet Muhammad, both deception and in the form of mobilizing all the tribes to unite to attack the Prophet Muhammad, because of their evil passions which had made them blind, when presented the evidence of the truth by the Prophet Muhammad as the final prophet of all prophets."
		   },
		   {
			"id": 741,
			"surah": 5,
			"ayat": 72,
			"tafsir": "Allah confirms in truth that Christians are disbelievers because they believe that Allah is Jesus Christ, son of Maryam. It is this position that makes them disbelievers and heretics, because they exaggerately praise Jesus as, just as the Jews also insult Jesus, especially Maryam. The stance of the Christians towards the Prophet Isa as is a stance held by the majority of Christians and anyone among them who deviates from that stance is considered an apostate. The Christians hold that God is made up of elements which they call three persons, namely the Father, the Son and the Holy Spirit. Jesus is the son, Allah is the Father incarnate in the child who is the Holy Spirit and they are three inseparable entities. Thus God is Jesus and Jesus is God. Their stance is very deviated from the truth, because Jesus himself told the Children of Israel to worship Allah, namely God for Jesus and God for the Children of Israel. So this verse clearly shows Jesus' direct acknowledgment that the God he worships is God alone. Strictly speaking the appeals of Prophet Isa to the Children of Israel as explained in this verse are to affirm the religion of monotheism. This can be seen in the original Gospels. In the New Testament, Mark xii. 28-30, when a scribe asked Jesus, \"The greatest law is: Hear, O Israel, the Lord our God, the Lord is one. Love the Lord your God with all your heart and with all your strength.\" Likewise Matthew iv.10, Jesus scolded Satan for wanting to worship someone other than God, Luke xviii. 19 and John xx.17. Furthermore, Allah explained that Jesus emphatically said that those who associate partners with Allah with something, either with angels or with stars or with stones, then that person will not get to heaven and his place is in hell, because people who associate partners with Allah are people who unjust to themselves for which it is not proper to receive defense from Allah's help."
		   },
		   {
			"id": 742,
			"surah": 5,
			"ayat": 73,
			"tafsir": "This verse explains that God truly confirms the disbelief of Christians who say that God who created the heavens and the earth is one of three persons, namely the Father, the Son and the Holy Spirit. So this verse describes the position of the majority of ancient Christians. A small group of them are of the opinion that Allah is Jesus the Son of Maryam while another small group is of the opinion that Jesus is the Son of Allah, and he is not Allah. Their stance has no solid foundation because the real God is an immeasurahble substance. God Almighty. Therefore Allah is Almighty. If God says a word, it means that the Almighty is more than one, and if the two or more of them will certainly fight for power, the result will be the destruction of this world. If the gods are at peace, that is, there are those who rule in the heavens and those who rule on earth, then that means that God is weak, because the nature of peace is the nature of a weak person who cannot conquer nature alone. Thus the Almighty must be one. Furthermore, if God is spelled out, for example consisting of three persons and all three are considered one because of their unity. then it means that if there is a loss of one of them, it means that the unity is lost. thus lost his divinity because of the death of Jesus (one of God's persons) on the cross. If this is not the case then it means that God is saying. So there is a God who died on the cross and two who are still alive. If it is confirmed that the existence of God the Father and the existence of God the Son then what is called God the Father must have been known to exist first and what is called God the Son must have been known to exist later. Whereas God is Qadim in nature, namely \"existence is not preceded by nothing\" and God is Baqa (eternal) namely \"existence is not terminated by nothing.\" Isa is preceded by \"nothing\", therefore he is not Qadim, because he did not exist at the time before being born by Maryam and Isa is not baqa (eternal) because he has become non-existent, he has died. This is how misguided the position of Christians is, when viewed from a logical point of view. Therefore in this verse Allah warns Christians to abandon wrong beliefs, and they should return to the teachings of Tawhid. If they still persist in disbelief, namely associating partners with Allah, then they will be put into the punishment of hell fire."
		   },
		   {
			"id": 743,
			"surah": 5,
			"ayat": 74,
			"tafsir": "This verse explains that the behavior of the Jews was very surprising because they had received verses that contained insults accompanied by threats, but their hearts were not moved to return to Allah and ask His forgiveness, even though Allah is very broad in His Mercy, Most Forgiving. , The Supreme Recipient of His servant's repentance who drowned in error then truly believes and fears God accompanied by good deeds."
		   },
		   {
			"id": 744,
			"surah": 5,
			"ayat": 75,
			"tafsir": "This verse explains the privileges of the position of the Messiah (Isa) and the privileges of his mother (Maryam) then this verse also explains the nature of the personalities of the two of them. The specialty of the Messiah is that he is the messenger of God, there is no difference from the apostles who came before him, because each of them carries the sign of the apostolate from God. If Allah gave the Prophet Isa the ability to heal hair loss and bring the dead back to life as a miracle for Christ, then Allah made his staff a snake (al-A'raf\/7:107) and split the sea (al-Baqarah\/2:50) as a miracle for Prophet Musa. If the Messiah was made without a father, then Prophet Adam was made without a mother and father. Almasih's mother was a very noble person and pious to Allah. This verse emphasizes that the Messiah was like the other apostles, ordinary humans who had physical needs, including eating food to avoid hunger and maintaining health for the continuation of life. Everyone needs something, he is an ordinary being who therefore cannot be said to be a creator God and does not deserve to be worshiped. So the only natural thing and the right to be worshiped is Allah Almighty because Allah needs His help. Everyone who is needed, of course, is considered noble by those who need it. Strictly speaking, the worshiper is someone who views himself as lowly and despicable than the one being worshiped. The Messiah was very famous for his strong worship of Allah, so the Messiah worshiped Allah, this shows that the Messiah was \"not Allah\" because Allah was the one who was worshiped. It is stupid if someone worships someone who is equal to him both in the nature of events and in need of help. Furthermore, at the end of this verse, Allah explained to Muhammad saw, how Allah explained to the People of the Book about the signs of His power which showed their wrong position regarding the Messiah. Then Allah asked the Prophet Muhammad's attention on how the People of the Book rejected the explanations that had been put forward by Allah, which showed that they did not use common sense because they were shackled by blind faith."
		   },
		   {
			"id": 745,
			"surah": 5,
			"ayat": 76,
			"tafsir": "This verse explains how misguided the Christians who worship the Messiah are. Muhammad received an order from Allah to ask the Christians why they worship other than Allah, something that does not harm or benefit. Did they not know that the Jews were hostile to the Messiah and they wanted to destroy him, while the Messiah himself was unable to harm the Jews and the friends of the Messiah could not help him. Is it normal for people who do not have the ability to be seen as God. Don't they themselves tell that when Jesus was persecuted on the cross, he asked for water because he was thirsty and the Jews only gave him vinegar water which was poured into his nostrils. (Mark xv. 36: \"Then a man came with a sponge and dipped him in sour wine and then put him on a reed and gave Jesus a drink and said: \"Let's wait and see if Elijah comes to take Him down.\" It is also in Matthew xxvii . 48, John xix. 29-30). Doesn't their story show that Jesus was very weak. Is it appropriate for a weak person like this to be seen as God. Furthermore, the end of this verse warns Christians that Allah is All-Hearing, especially their disbelieving words and All-Knowing the falsehood that is in their hearts."
		   },
		   {
			"id": 746,
			"surah": 5,
			"ayat": 77,
			"tafsir": "In this verse, Allah forbids the People of the Book who at the time of the Prophet Muhammad acted excessively in religion as their forefathers did and forbade them to follow the causes that led their forefathers to go astray so that others were led astray from the path of truth (Islamic teachings). They leave the Shari'a law and follow bad passions. So with this verse it can be concluded that the People of the Book are: a. People who have gone astray since long ago because they followed their desires in religious matters, made heresy, made lawful what was unlawful and abandoned the traditions of the Prophet. b. Other people become misguided, because after they have gone astray, they try to mislead other people, expanding the heresy concocted by their priests. c. People who turn away from the religion of Islam, are constantly in error, meaning they have transgressed, committed heresy and deviated from the right intention."
		   },
		   {
			"id": 747,
			"surah": 5,
			"ayat": 78,
			"tafsir": "This verse explains that infidels from among the Jews received God's wrath and curse through the words of the Prophet David and Jesus the son of Maryam. When the Jews committed transgression on the Sabbath (the day it was forbidden for Jews to fish), the Prophet David condemned them in particular, for violating the honor of the Sabbath and in general against those who commit ordinary disobedience. (Psalm cix. 17-18,\/xxviii. 21-22, 31-33,\/xiv. 22-28, and pasim). The Prophet Isa once cursed them as \"the descendants of the killers of the prophets\" and \"you snakes, you descendants of vipers.\" (Matthew xxiii. 31-35). At the end of this verse it is explained that the curse was caused by them committing immorality and violating Allah's laws by transgressing limits."
		   },
		   {
			"id": 748,
			"surah": 5,
			"ayat": 79,
			"tafsir": "This verse explains that the custom of the Jews is to allow evil to happen before them because they do not carry out good and evil. So bad was their deed, that it became the cause of God's curse on them. In connection with this verse, the Prophet Muhammad said, From Abdullah bin Masud ra, he said, Rasulullah SAW said: \"When the Children of Israel fell into the valley of immorality, then they were forbidden by their scholars and they did not want to stop, then the scholars were familiar with them, sitting, eating and drinking together. Allah SWT then made their hearts close to each other and cursed them all through the words of Dawud and Isa bin Maryam. That was because they were immoral and transgressed.\" Abdullah bin Masud said next: The Prophet SAW then sat down, before he leaned back, then said: \"Not for the sake of the One who controls me, until you really subdue them to the truth.\" (History of Abu Dawud, at-Tirmizi and Ibn Majah. According to at-Tirmizi, this hadith is hasan)"
		   },
		   {
			"id": 749,
			"surah": 5,
			"ayat": 80,
			"tafsir": "After the previous verse explains the ugliness of the behavior of the ancestors of the Jews (the Children of Israel), this verse explains that the Prophet Muhammad witnessed the behavior of the unbelievers of the Children of Israel in his time, that is, most of them helped each other with polytheists from among the Arabs. (the Prophets themselves) in an effort to fight the Prophet Muhammad. The work they do is very bad because they only follow the orders of lust and incitement. This act caused the wrath of Allah, for which they would surely receive a reward from Him in the form of the eternal punishment of hell fire. The people who are released from the fires of hell are those who do the work that pleases Allah."
		   },
		   {
			"id": 750,
			"surah": 5,
			"ayat": 81,
			"tafsir": "This verse explains that if the Jewish people who help the Arab polytheists believe in the Prophet Musa as they claim, and believe in the teachings brought by the Prophet Musa, surely they will not be able to help the polytheists who worship idols. Because their pure religious teachings cannot justify it. But most of them are wicked people, because of which they can unite and work together because they are bound by an interest, namely opposing the Prophet Muhammad, rejecting the teachings of the Qur'an and trying to deter people who believe in Muhammad."
		   },
		   {
			"id": 751,
			"surah": 5,
			"ayat": 82,
			"tafsir": "In this verse Allah informs the Prophet Muhammad that in his struggle he will find the people who are the most hostile and hurt the believers. Those people are Medina Jews, Arab polytheists and idol worshippers. Jews and Arab polytheists both opposed Muhammad's teachings. It is this similarity that binds these two groups, even though each has opposing personality traits. Furthermore, this verse tells the Prophet Muhammad that he will get the people who are closest to and like the believers. Humans are Christians. The reason is that among them there is a group that pays attention to religious studies and morals, namely a group of monks who are against worldly luxuries. They are pious and meditate a lot to worship. Of course, these two groups are humble people because their religion invites them to love their enemies and to turn their left cheek to those who hit their right cheek. The kindness of the Christians has been proven by history, namely the welcome of King Habasyah (Abisinia) who was called Najasyi who embraced Christianity. He and his friends protected the Muslims who first migrated from Mecca to Habasyah for fear of harassment and slander by the cruel Arab polytheists. The East Roman king in Sham, namely Heraclius, when he received the Prophet Muhammad's letter, greeted him with a good reception and tried to explain to his people, so that they could accept the invitation of the Prophet Muhammad, even though the people did not agree with him because they still adhered to bigotry. Mukaukis, who ruled Egypt, also welcomed the Prophet's letter with a good reception, even though he was not yet ready to accept the Prophet's invitation to Islam, he answered the Prophet's letter and sent valuable gifts, including in the form of a jariah named Mariah al-Qibtiyah. That was the greeting of Christians during the time of the Prophet. In stark contrast to the Jews, even though they compulsorily express sympathy for the believers, yet in their hearts are hidden deceitful thoughts to deceive the believers. Because the teachings of the Jewish leaders instilled in them national fanaticism and the conviction that the Israelites were the only nation chosen by God."
		   },
		   {
			"id": 752,
			"surah": 5,
			"ayat": 83,
			"tafsir": "In this verse it is explained that when Christians heard and understood the contents of the verses of the Qur'an, some of them shed tears because they were deeply moved and convinced of the truth of the Al-Qur'an which was revealed by Allah to the Prophet Muhammad, which turned out to be justify their scriptures. They were also moved by the characteristics of the Prophet Muhammad that they had known before from their holy book. At such times, they humbly said, \"O our Lord, we believe in You and in Your messengers, especially the Prophet Muhammad. Therefore, include us with those who acknowledge the truth of the Qur'an.\" and the Prophet Muhammad, who will bear witness on the Day of Resurrection that You have truly sent Your prophets and messengers, and that they have truly conveyed Your religion to their respective peoples.\" Furthermore, they stated that, nothing could prevent them from believing in Allah and in the truth that was revealed through His last Messenger who was sent to all mankind. Then they also emphasized that they believe in Allah and in the truth that His Messenger brought, because they really wanted Allah to include them among the pious people, namely the people of the Prophet Muhammad, because of the true teachings of Islam, both regarding faith, worship, mu'amalah and noble character."
		   },
		   {
			"id": 753,
			"surah": 5,
			"ayat": 84,
			"tafsir": "In this verse it is explained that when Christians heard and understood the contents of the verses of the Qur'an, some of them shed tears because they were deeply moved and convinced of the truth of the Al-Qur'an which was revealed by Allah to the Prophet Muhammad, which turned out to be justify their scriptures. They were also moved by the characteristics of the Prophet Muhammad that they had known before from their holy book. At such times, they humbly said, \"O our Lord, we believe in You and in Your messengers, especially the Prophet Muhammad. Therefore, include us with those who acknowledge the truth of the Qur'an.\" and the Prophet Muhammad, who will bear witness on the Day of Resurrection that You have truly sent Your prophets and messengers, and that they have truly conveyed Your religion to their respective peoples.\" Furthermore, they stated that, nothing could prevent them from believing in Allah and in the truth that was revealed through His last Messenger who was sent to all mankind. Then they also emphasized that they believe in Allah and in the truth that His Messenger brought, because they really wanted Allah to include them among the pious people, namely the people of the Prophet Muhammad, because of the true teachings of Islam, both regarding faith, worship, mu'amalah and noble character."
		   },
		   {
			"id": 754,
			"surah": 5,
			"ayat": 85,
			"tafsir": "Based on their words that express their true faith and sincerity in Allah, Allah will reward them in the form of paradise where they will receive the pleasures and gifts of Allah in the form of beautiful gardens and parks. In essence, the beauty and enjoyment that they get in heaven cannot be described in words. Heaven will be granted by Allah to His servants who believe and do good deeds while living on earth."
		   },
		   {
			"id": 755,
			"surah": 5,
			"ayat": 86,
			"tafsir": "Christians who believe in Allah and in the Qur'an are people who are willing to think, are aware, and are not fanatical. But there are people who are fanatical about misguidance and deny the truth, they deny the Qur'an. They are People of the Book, namely Jews and Christians who have closed their hearts to accept the truth, they only feel that they are right. In this verse Allah mentions His threat to those who deny and deny His verses which have explained His perfect and omnipotent attributes, and explained the truth of His Messenger regarding the revelations Allah has conveyed. They will surely become the inhabitants of the hell of Jahim. By their disbelief towards Allah, they have wronged themselves. As a result, they will suffer severe torments, and they will be eternally in that hell."
		   },
		   {
			"id": 756,
			"surah": 5,
			"ayat": 87,
			"tafsir": "This verse was revealed regarding some friends who were mistaken in understanding and implementing the teachings of Islam. They think that in order to get closer to Allah, they must release themselves from all kinds of worldly pleasures, because they think that these pleasures will only prevent them from worshiping Allah. Even though Allah has created and provided good things on this earth, which He has made lawful for them. In addition, He has also explained what He has forbidden. Even though Allah has provided and justified good things for His servants, they must still be treated in a way that is reasonable and not excessive. So the word of Allah in this verse forbids His servants from attitudes and actions that exceed the limits. Actions that exceed the limits in matters of food, for example, can be interpreted in two ways. First, a person still eats good, lawful food, but he eats too much of it, or too much of it. Whereas eating too full is detrimental to health, the digestive organs and possibly the mind. The funds and thoughts are only focused on food and drink, so that other obligations are neglected, especially worship. The second meaning is that a person has exceeded the limit in the types and types of food he eats, drinks he drinks; it is no longer limited to good and lawful food, it has even gone beyond that which is harmful and harmful, which has been forbidden by religion. Both of these are not justified by the teachings of Islam. At the end of the verse, Allah warns His servants that He does not like those who transgress. This means that every work we do must always be within the limits set by religion, such as the limits of what is lawful and unlawful, as well as limits that can be known by reason, mind and feelings, for example the limits regarding the pros and cons and the benefits and harms. One thing we need to remember is the principle contained in Islamic Sharia, that what is lawful in religion is because it is beneficial and not harmful; conversely, what is forbidden is because it is harmful and unbeneficial, or because the harm outweighs the benefit. Therefore, it is not permissible to change the religious laws that have been established by Allah and His Messenger. Allah knows best what is good and beneficial for His servants and what is harmful for them. He is Most Compassionate towards them."
		   },
		   {
			"id": 757,
			"surah": 5,
			"ayat": 88,
			"tafsir": "In this verse, Allah orders His servants to eat the good and lawful sustenance that He has bestowed upon them. \"Halal\" here implies, lawful object and lawful way of obtaining it. While \"good\" is in terms of its usefulness, that is, that contains benefits and benefits for the body, contains nutrients, vitamins, proteins and so on. Food is not good, besides not containing nutrition, also if consumed will damage health. The principle of \"halal and good\" should always be a concern in determining what food and drink to eat for oneself and for the family, because food and drink do not only affect the body, but also the spirit. Every flesh that grows from something that is unclean, then hell is better for him. (History of at-Tirmidhi) There are no obstacles for believers who are able to enjoy good food and drink, and to have intercourse with their wives, however, they must comply with the conditions set by syara', namely: good, lawful and according to a decent size and not excessive. So at the end of this verse Allah warns believers so that they are careful and fear Him in matters of food, drink and other pleasures. Let them not set laws according to their own will, nor should they be excessive in enjoying what He has made lawful. In another verse Allah says: eat and drink, but don't overdo it. Truly, Allah does not like excessive people. (al-A'raf\/7: 31) Islam emphasizes simplicity. He does not justify his people exaggerating in eating, drinking, dressing and so on, even in worship. Conversely, it is also not justified for someone to refrain from enjoying something, even though he is capable of obtaining it. Especially if that self-restraint pushes him to forbid what has been made lawful by the syara'. Every believer is commanded by Allah swt. to always consume halal and good food (containing sufficient nutrition and vitamins). So the part of the verse that reads halal and good (Arabic: halalan thayyiba) above implies two aspects that will be attached to every food sustenance consumed by humans. The first aspect, let food be obtained in a lawful way in accordance with Islamic law as exemplified by the Apostle. In this case it contains the meaning of an order to do the right muamalah. Not by force, deception, stealing, or in ways that are forbidden in Islamic law. While in the good aspect or thayyib is in terms of the substance content of the food consumed. Food should contain substances needed by the body, both in quality and quantity. A balanced nutritional diet is recommended. There are foods that are lawful but not thayyib, for example the Prophet gave the example of the heads, skins and innards of slaughtered animals being thrown away. He even said don't eat bones because bones are food for your brother from the jinn nation. The results showed that these parts contained a lot of substances that cause blood cholesterol levels in the human body to increase rapidly. The Messenger of Allah has set an example of this simplicity. In all aspects of his life, he was always simple, even though if he wanted to, he could have enjoyed all kinds of pleasures to his heart's content. However, he did not do so, because as a leader, he led and set an example to his people, a simple lifestyle, but not torturing himself."
		   },
		   {
			"id": 758,
			"surah": 5,
			"ayat": 89,
			"tafsir": "In this verse it is explained that Allah will not inflict punishment on someone who violates an oath that he has said not in earnest or was not preceded by an intention to swear. However, if a person swears with all his heart and true intentions, then he breaks the oath, then he is subject to expiation (fines), namely one of the following: a) Feeding ten poor people, each one meal each. (Imam Abu Hanifah allowed to feed one poor person only, but within ten days). The food must be of the same quality as the food eaten daily by the expiation payer and his family. b) Giving clothes to ten poor people, which are of the same quality as the clothes they wear everyday. c) Freeing a slave obtained by buying or capturing him in war. Here it is not implied that the slaves must have faith. Therefore, it is permissible to release a slave who is a disbeliever even as expiation for violating an oath. (This is the opinion of Imam Abu Hanifah. While Imams Syafi'i, Malik and Ahmad require that the servant is already a believer). d) Fasting for three days. This applies to oath violators who are unable to pay their oath expiation with one of the three types of expiation mentioned earlier. If he is not able to fast because he is sick, then he must do it after he recovers and is able to fast. If it turns out that the disease does not heal, and then he dies before he can fast to pay for the expiation, then Allah's forgiveness is expected for him, if he really has a serious intention to carry it out even though it has not been achieved. Thus it is clear that someone who violates an oath that is truly intended, then he must pay expiation, one of the three types of expiation. If he cannot afford it, he may pay it with the fourth expiation, namely fasting three days in a row. Regarding this, the Messenger of Allah has explained with his words narrated by Ibn Mardawaih from Ibn 'Abbas, he said: When this expiation verse was revealed, Hudzaifah asked the Messenger of Allah, \"Can we choose?\" So the Messenger of Allah replied, \"You may choose, if you wish, you may free a slave; and if you wish, you may feed (ten poor people). Whoever cannot afford it, he must fast three days in a row. .\" (History of Ibn Mardawaih) If he swears that he will not do something that is lawful for him, thus meaning that he does not expect something that has been made lawful by Allah, then he is obliged to break his oath, and is also obliged to pay his expiation. Vice versa. After Allah explained the types of expiation mentioned above that must be fulfilled by those who break their oath, Allah then warns the believers so that they keep their oaths. Meaning: one must not play with oaths. Oaths are used only in matters that really require an oath as reinforcement or affirmation. If the oath has been taken with real intent, then the contents of the oath must be kept, except if the oath violates religious regulations, for example: to make things lawful that Allah and His Messenger have made lawful. It is only in such circumstances that the oath must be broken, but must be redeemed by expiation. At the end of this verse Allah explains His verses which contain religious laws to those who want to thank Him for all His mercy, His justice and His mercy. It is hoped that thanksgiving in the ways he teaches will lead to an increase in this grace for them."
		   },
		   {
			"id": 759,
			"surah": 5,
			"ayat": 90,
			"tafsir": "With this verse Allah explains His laws regarding four kinds of actions, namely: drinking khamr, gambling, offering sacrifices to statues and raffle fate by using tools resembling arrows that were commonly practiced by the Arabs before the advent of Islam . Regarding the prohibition of drinking khamr, commentators argue that this verse is the last step in determining the law on the prohibition of drinking khamr. According to them, the Qur'an sets out the ruling on drinking khamr in four stages. First, in the form of information about the presence of alcohol content in grapes in surahh an-Nahl\/16:67. Second, the benefits and harms of liquor: They ask you (Muhammad) about alcohol and gambling. Say, \"In both there is great sin and some benefit to man. But the sin is greater than the benefit.\" (al-Baqarah\/2: 219) This verse was revealed in the early days of Islam, when the faith of the Muslims was not yet strong enough to be able to abandon what had become their hobby and habit, which Islam actually did not allow. So after this verse was revealed, some of the Muslims have abandoned the habit of drinking khamr because the verse has stated that this act is a great sin. But some still continue the habit of drinking khamr, because in their opinion the verse has not prohibited them from doing that, because it still states that intoxicants contain many benefits for humans. The alcohol or khamr in question is ethanol which is produced by fermenting fruit juices such as grapes, pineapples, and so on. It can also be produced from molasses, a waste from sugar cane mills, and it is the most widely used raw material for producing alcohol in Indonesia. Alcohol has several benefits, including as a source of energy and a solvent. Alcohol is a fairly high source of energy, higher than sugar and almost equals fat in the following ratio Carbohydrates\/sugar, 4 kcal\/g, alcohol, 7 kcal\/g and fat, 9 kcal\/g. In addition, alcohol is easily digested so that the body easily gain energy after drinking alcohol. Alcohol is also used as a solvent in drugs called elixirs, such as in kidney-stone elixir drugs or also in cough medicines. Third, the prohibition of praying when drunk: O you who believe! Do not approach prayer when you are drunk (an-Nisa'\/4: 43). Since this verse prohibits them from praying while drunk, it means that they are not allowed to drink khamr before praying, so that they can pray while sober. After this verse is revealed, they can no longer drink khamr from before Zuhur, until the end of the Isha prayer, because the times of Zuhr and Asr are continuous, in a short period. Likewise between Asar and Magrib, and between Magrib and Isya. If they drink khamr after the Zuhur or Maghrib prayers, there will surely not be enough time to wait for them to wake up from their drunkenness. So that they will not be able to pray in a conscious state, whereas Allah has forbidden them to pray in a drunken state. People who want to drink khamr only get the opportunity after the Isya prayer and after the Fajr prayer. Because the distance between Isha and Fajr and between Fajr and Noon is quite long. Thus, it is expected that people who drink khamr will decrease. Fourth, the determination of the prohibition of khamr After the faith of the Muslims has become stronger, and their psyche has become more determined to leave what is not permissible in religion, verse 90 of surahh al-Ma'idah\/5 has come down, which gives firmness about the prohibition of drinking intoxicants, namely by saying that drinking khamr, and other acts are dirty, unlawful and includes acts of Satan that should not be carried out by humans who believe in Allah. With the revelation of this verse, all possibilities have been closed for believers to drink khamr. These are the steps that have been regulated by the Al-Qur'an in giving the forbidden law to drink khamr. This principle is very appropriate to use when we want to carry out the eradication and eradication of what has become ingrained and ingrained in society. If we take drastic measures, sudden and all at once eradication, then there will be upheaval in society, and there will be stiff resistance against the new regulations that are about to be implemented. Islam attaches great importance to the development of human mentality, and avoids the emergence of upheavals in society. Khamar or alcoholic beverages are prohibited because behind its benefits, alcohol also has disadvantages. In developed countries, such as America and Australia, alcohol causes more than 55% of traffic accidents and is also a source of various diseases. In America it was identified that many drunkards suffer from diseases due to avitaminosis. In Australia it was found that the children of drunken married couples suffer from physical and\/or mental disabilities. In Papua New Guinea, the drinking of the workers is the reason for the divorce, because the money runs out for drinking. In Indonesia, alcohol is the cause of criminal acts such as robbery, rape and murder. Also the cause of traffic accidents, and household rifts. Even though it is a big business, it has been observed that for every dollar obtained from alcohol products, it requires a greater cost to overcome the resulting social damage, such as: ,- costs US$ 11.08 Memphis State : Gains US$ 1,- costs US$ 4.39 Because alcohol is easily absorbed, excess food such as sugar, fat and protein is stored in the form of fat resulting in excess weight. Obesity is a cause of blood vessel disease, heart and sugar (diabetes). Please note that alcohol is a high-energy drink but without nutrition or called \"empty calories\". Also alcohol causes the body can not absorb vitamins and minerals or both are excreted in the urine. As a result, the drunkard becomes malnourished. And this is also the main cause that the children of drinkers or drunkards suffer from physical or mental disabilities because their sperm or ovum is malnourished. Continuous detoxification of alcohol in the body by the liver can damage cells. Cell damage will interfere with liver performance. In addition, excess fat is stored in the liver which can cause liver cancer or cirrhosis for which there is no cure. Alcohol damages the nervous system, weakens eye and muscle coordination (causes accidents). It also removes memory so that it commits all crimes without awareness, such as raping, fighting, robbing and killing. Alcohol includes substances that cause addiction or addiction. This trait causes drinkers to want to consume more and more because they are not satisfied. That feeling of being dissatisfied is what eventually led to him falling into the world of narcotics such as marijuana, morphine, cocaine, and so on. This addictive nature has not been scientifically explained satisfactorily. As for gambling, it is very dangerous for individuals and society. Gambling can damage a person's personality and morals, because a gambler always dreams of getting big profits without working and trying, spending his life at the gambling table regardless of his health, his needs for life and his family's life which causes the household to break down. Gambling will cause hostility between fellow gamblers. This hostility continues in the association so that it destroys society. How many messy households, destroyed property because of gambling. No one is rich solely because of gambling (see also the tafsir of verse 219 of surahh al-Baqarah\/2). The Arabs before Islam were a pagan society. They make statues of stone and so on, then they worship and they glorify. They slaughtered sacrificial animals to offer to the statues. This action is a misguided act. Because the only one who deserves to be worshiped and glorified is Allah. Humans can worship Allah, without intermediaries. If you want to make a sacrifice, you have to slaughter the sacrifice, then the meat is distributed to people who can use it, not to statues that will not be able to get any benefit from the sacrificial meat. Therefore, it is very appropriate that the Islamic religion prohibits Muslims from offering sacrifices to statues, then Islam stipulates that the sacrifice is to glorify Allah, and the meat is distributed among fellow human beings. Drawing fate, is also an act that has long been known to mankind, even today some people still practice and believe in it. There are various methods used for this purpose. Sometimes by using a tool, or by examining the palm of the hand, or by observing the date and day of the birth of the stars, as is often stated in entertainment magazines or newspapers. The Arabs in the Jahiliyyah era used to raffle fate by using azlam, namely arrows that had not yet been equipped with feathers. They use it to decide whether they will do something or not. The method is: they take three arrows that haven't used the feather, then on the first arrow they write the words \"do it\" while on the second arrow they write the words \"don't do it\"; as for the third arrow, nothing was written on it. The three arrows are placed in a container, then stored in the Kaaba. If they want to do one job, they ask the Kaaba locksmith to take one of the three arrows. Whether they will do the deed or not depends on the inscription found on the arrow that was taken. If it turns out that it was an arrow with no writing on it, then the draw is repeated one more time. Thus they depend on the lottery and they really believe in it. Such sweepstakes and predictions have a lot of downsides. If the fortune teller says that the person concerned will meet bad luck, then this will make him feel worried, afraid and hopeless, and will even cause him not to want to work and try because he believes in the prediction. Conversely, if the fortune teller says that he will be a rich and happy person, then this can cause him to be lazy at work and despise all kinds of effort, because he believes that even without effort he will be happy or become rich. Believers are prohibited from believing in these prophecies, either those said directly by fortune-tellers, or those that are usually published in print and electronic media. These predictions can undermine faith. Believers must believe that only Allah can determine the fate of each of His creatures. Believing in Allah's qadha and qadar, is one of the pillars of faith. At the end of this verse, Allah commands believers to stay away from drinking intoxicants, gambling, sacrificing statues and raffle fate, it is hoped that by avoiding these actions, they will become successful and lucky people in this world and in the hereafter."
		   },
		   {
			"id": 760,
			"surah": 5,
			"ayat": 91,
			"tafsir": "This verse mentions the reason why Allah forbids drinking intoxicants and gambling for believers. The reasons mentioned in this verse are of two kinds. First, because with these two actions Satan wants to create enmity and mutual hatred among human beings. Second, because it will neglect them from remembering Allah and praying. In another verse it has been mentioned that drinking intoxicants and gambling are heinous acts and are included in the actions of Satan. This means that it is Satan who tempts humans to do so in order to create enmity and mutual hatred between them. The emergence of these various dangers in people who like to drink khamr and gamble, cannot be denied. The reality experienced by such people is enough to prove it. The drinker of khamr is definitely a drunkard. A drunk person naturally loses consciousness. It is easy for a person who has lost his consciousness to commit unworthy acts, or say things he should not have said. His actions and words often harm other people, causing enmity between them. On the other hand, a person who is drunk certainly does not remember to perform worship and remembrance or if he does so, of course, in a way that is not correct and not solemn. Moreover, drinking alcohol is addictive and can even make a person dependent, that is, he cannot work if he doesn't drink first. People who like to gamble usually always hope to win. Therefore, he is never deterred from doing that, as long as he still has money, or goods to bet on. When the money or goods run out, he will try to take other people's rights in an illegal way. How many employees or company employees have been found who have corrupted the money they spent at the gambling table. Between the gamblers themselves animosity arose, because each wanted to defeat his opponent, or wanted to take revenge on the opponent who had defeated him. A gambler certainly often forgets about worship, because those who are engrossed in gambling, will not stop playing to worship, because their hearts are already subject to Satan who always tries to prevent people from worshiping God and wanting them to go to the gambling table. In this verse Allah only mentions the dangers of intoxicants and gambling, while the dangers of offering sacrifices to idols and raffle fate are no longer mentioned. If we look closely, it can be said that it was caused by two things. First, because the law of sacrifice for statues and the lottery of fate has been stated in the word of Allah:  and (also forbidden) to be slaughtered for idols. And (it is also forbidden) to draw fate with azlam (arrows), (because) it is an act of wickedness. (al-Ma'idah\/5: 3) Those two actions, in that verse have been stated as \"Wisdom\". Second, is because alcohol and gambling are very dangerous. That is what is prioritized for its prohibition in this verse, because some Muslims still do it after the revelation of verse 219 of surahh al-Baqarah\/2 and verse 43 of surahh an-Nisa'\/4, especially regarding khamar. After explaining the dangers posed by intoxicants and gambling, Allah, in a questioning tone, warned the believers. \"do they want to stop (from doing the job)?\" The point is that after they are informed about the great danger of these actions, then they should stop it, because they themselves will bear the consequences, namely losses in this world and in the hereafter. In this world they will experience loss of property and physical health and the enmity and hatred of others towards them; while in the hereafter they will be overwritten by the wrath and punishment of Allah. In addition to drinking khamr which is intoxicating, we are also prohibited from consuming some intoxicating substances, such as narcotics and dangerous drugs (narcotics) and other addictive drugs, because they can damage the body's tissues, lead to dependence and lose the consciousness of the culprit. In the hadith books of Musnad Ahmad, and Sunan Abi Daud and at-Tirmidhi it is mentioned that 'Umar bin Khaththab once prayed to Allah, \"O Allah, give us a satisfactory explanation regarding the issue of intoxicants.\" So after verse 219 of surahh al-Baqarah\/2 was revealed, the Messenger of Allah, recited the verse to him, but he was still not satisfied, and he continued to pray as mentioned above. Likewise after the revelation of verse (43) of surahh an-Nisa'\/4. But after the revelation of verses 90 and 91 of surahh al-Ma'idah\/5, he was summoned and read to him these verses. He was satisfied. After the reading came to the word of God: Then will you stop (from doing that work)? The companions, including 'Umar bin Khaththab, replied: \"We stop, we stop.\""
		   },
		   {
			"id": 761,
			"surah": 5,
			"ayat": 92,
			"tafsir": "In this verse, Allah first commands the believers to obey Allah and obey His Messenger, so that they are careful and keep themselves safe. The intention is that they obey His commands to stay away from intoxicants and gambling and other unlawful acts, including slaughtering sacrifices to idols, and raffle fate; and they must also obey the statements that His Messenger has given regarding the verses that He has revealed to him. With regard to the issue of khamr, the Messenger of Allah has said: \"Every intoxicating drink is khamr and every khamr is unlawful.\" (Muslim History) The command to \"be careful\" means to protect oneself from the dangers that will befall them if they violate Allah's prohibition on alcohol and gambling, such as addiction and damage to the intestinal wall and the calamity that will be suffered in this world and in the hereafter . It must be remembered, if Allah prohibits His servant from something or an action, it is because the act is dangerous and destructive. In another verse Allah has said:  then let those who violate the orders of His Messenger be afraid of being tested or overwritten by a painful punishment. (an-Nur\/24: 63) After Allah ordered the believers to obey Him and obey His Messenger, and protect themselves from the danger that would befall him if they violated His laws and the provisions of His Messenger, then at the end of that verse Allah mentions His threat, that if they turn away from Allah's religion which has been conveyed by His Messenger, then the responsibility lies with themselves, not with the Messenger; because the obligation of the Apostle is only to convey; and Allah is the one who will account for and repay all their deeds both in this world and in the hereafter. In another verse, Allah, said to His Messenger:  but if they turn away, then your obligation is only to convey. And Allah is Seeing of His servants. (ali 'Imran\/3: 20) His word in another verse is:  then in fact your duty is only to convey it, and We are the ones who take account of (their deeds). (ar-Ra'd\/13: 40)"
		   },
		   {
			"id": 762,
			"surah": 5,
			"ayat": 93,
			"tafsir": "In the history of Ibn Mundzir from Sa'id bin Zubair it is stated that the reason for this verse was revealed as follows, \"That some friends have come to the Prophet to ask questions about people who used to drink khamar and they have prepared the reasons they will submit. to him, \"What is the opinion of the Messenger of Allah, regarding Hamzah bin Abdil Muthalib, Mus'ab bin 'Umair and Abdullah bin Jahsy, won't they go to heaven?\" Rasulullah replied, \"Yes, they will go to heaven.\" Then they said, \"Didn't they used to be drink khamr? Why is it forbidden to us now, while they are going to heaven even though they used to drink intoxicants?\" So the Messenger of Allah replied, \"Allah has heard what you said, if He wanted He would surely answer.\" So the verse (90) was revealed which giving firmness to the law on drinking khamr. Regarding the people they mentioned earlier, namely Hamzah, Mus'ab and Abdullah bin Jahsy, Allah revealed this verse. In this verse Allah explains the condition of people who used to gamble and drink khamr, but then they believe and do good deeds, whether they are still alive or dead when this verse was revealed. They are innocent and will not be tortured for their past actions, as long as they remain fearful of Allah and believe in His Messenger, obey the laws that He has sent down. Furthermore, they continue to do good deeds that have been made obligatory upon them, as such as: prayer, fasting, zakat and so on. Then they also keep away from what He has forbidden that they already know, such as gambling, drinking intoxicants, sacrificing to idols, raffle fate and others, and they still believe in His verses which explain the laws the law. Finally, they continue to be in piety and increase their good deeds, namely with various sunnah worship. Thus it is clear that bad deeds committed in the period before the prohibition came, or before they became aware of the existence of the prohibition, did not cause them a sin, as long as they then believed, were pious and did good deeds, both obligatory and sunnah, and they stay away from all activities that are prohibited by religion. At the end of the verse, Allah explains that He loves those who do good. That is, Allah bestows His mercy on those who do good, so that they are free from the bad influences caused by gambling and intoxicants, for example: hatred, hostility and negligence in remembering Allah, performing prayers and other acts of worship."
		   },
		   {
			"id": 763,
			"surah": 5,
			"ayat": 94,
			"tafsir": "This verse explains Allah's test for believers who are in ihram, that they are not allowed to hunt, even though there are so many game animals at that time, that they can easily catch them, either with their hands or using spears. According to history, this verse was revealed when the Muslims carried out the umrah of Hudaibiah. When they found in their travels a multitude of animals and birds, which they had never found so many. Small animals could be caught with their hands and big and wild animals they could catch with spears and so on. But God forbade them to catch him. This prohibition is a test for them to prove the strength of their faith and piety to Him. People who are truly strong in faith will definitely not violate God's prohibition, either openly or secretly. He was always afraid of Allah's punishment, even though he had never witnessed it. The end of this verse presents Allah's threat to those who still violate His provisions after notification and threats, that they will surely receive a painful punishment as a result of that violation. The test is actually just a mild ordeal, compared to other trials and tests that require sacrifice of material possessions and body and soul. However, if a person does not pass these light and small trials and tribulations, how can he survive the larger ones? The trials and tests that Allah gives to His servants, sometimes require the sacrifice of material possessions and soul and body in doing something that He commands, or in the form of losing something that is very dear, or asking for the willingness to refrain from doing what one wants. The latter is clearly easier to implement, such as the prohibition imposed on them, namely the prohibition on hunting when the game is large and easy to catch, while they are in need of food for provisions on the way."
		   },
		   {
			"id": 764,
			"surah": 5,
			"ayat": 95,
			"tafsir": "This verse confirms Allah's prohibition on believers, so that they do not kill game animals which are usually caught and then slaughtered for their meat. This prohibition is aimed at those who are carrying out ihram, both ihram during the Hajj and Umrah pilgrimages. Then explained the fines imposed on believers who violate the prohibition, namely those who kill the hunted animal on purpose, even though he remembers the existence of the prohibition. The fine is to fulfill one of the following: a. replace the game that he killed, with livestock that he valued the same as the one that had been killed, based on the verdict of two just people. The replacement animal must be brought to the unclean land, then slaughtered there and the meat distributed to the poor and needy. b. expiation in the form of feeding the poor and needy, with food of the same value as the replacement animal mentioned above; c. fasting on days whose number is equal to the number of meals (mud) that must be given to the poor and the poor, with the understanding that each poor and poor gets one mud, approximately equal to  liter (0.75 liter), each one Mud is the same as one day of fasting. Then Allah said that the punishment set was intended so that those who violated the prohibition could feel the consequences of their actions. Furthermore, Allah explained that He forgave past mistakes, namely killing game animals when they were in ihram and it was done before the revelation of this verse. At the end of this verse, Allah mentions His threat to those who still violate the prohibition after the revelation of this verse, that is, He will torture them. Allah Almighty again has the power to torment every guilty creature."
		   },
		   {
			"id": 765,
			"surah": 5,
			"ayat": 96,
			"tafsir": "In this verse, Allah explains that He has made it lawful for believers, whether in ihram or not, to eat meat caught by the sea, including river animals, lakes and so on and which are obtained easily, for example fish that have just died and floated. or fish washed ashore and so on. All of that is given by Allah as delicious food for them and for those who are on their way. Then Allah reaffirmed that He has made it forbidden for the believers to catch wild animals as long as they are in ihram. At the end of the verse, He warns the believers so that they always fear Allah, to Him they will be gathered later on the Day of Judgment, to be accountable for all their deeds and then He will reward them with a reward or punishment that is commensurahte with the practice."
		   },
		   {
			"id": 766,
			"surah": 5,
			"ayat": 97,
			"tafsir": "This verse explains that Allah has made the holy house of the Kaaba, a center of activity for humans, both activities in worldly affairs, such as trade and so on, as well as pilgrimage and umrah worship activities for believers all over the world. Allah determines the forbidden months \"namely Zulkaidah, Zulhijjah, Muharam and Rajab\" which are quiet periods for worship and work for them, because in these months it is not permissible to fight. Likewise, livestock such as camels, oxen, goats and sheep which are slaughtered in the illegitimate land as gifts and distributed to the poor and needy, as well as animals that are given necklaces, namely camels or goats are fat to indicate that the animals are the animal has been designated as a hadyu (sacrifice) to be slaughtered. Thus, the slaughter of these animals will certainly add to the celebration of Muslim worship and is also a happy time for the poor and needy. Believers do not worry about their own safety at these times, because if they have put the animals they are going to slaughter on them, or if they have put on ihram clothes, no one will disturb or threaten their safety. . Then Allah explained that all of this was ordained so that His servants would know that He always knows what is in the heavens and on earth and that Allah knows everything. The proof is that Allah has ordained everything to bring benefit to them and to avoid disaster before it happens. Thus it is clear that Allah knows what is happening and what will happen. It is based on His vast knowledge that Allah establishes His laws and regulations for the benefit of His servants."
		   },
		   {
			"id": 767,
			"surah": 5,
			"ayat": 98,
			"tafsir": "After Allah explained that all rewards for bad deeds are in His hands, and He knows everything that is done by His servants, then Allah reaffirmed the task of His Messenger, namely: to deliver treatises, namely to convey laws, regulations His rules and instructions, as well as His wa'd (promise) and wa'id (threat). If all of that has been carried out by the Messenger, his task will be completed, and he will be released from his responsibility, henceforth it will become the duty and responsibility of the believers. As for rewarding those who obey, and inflicting punishment on those who disobey, this is the right and authority of Allah alone. At the end of this verse, Allah again emphasizes that He always knows what humans do openly, as well as what is done secretly, including the movements of their inner heart. This is a stern warning from Allah to those who disobey His rules and laws. Therefore, it is appropriate for humans to fear Him, and not violate His commandments."
		   },
		   {
			"id": 768,
			"surah": 5,
			"ayat": 99,
			"tafsir": "After Allah explained that all rewards for bad deeds are in His hands, and He knows everything that is done by His servants, then Allah reaffirmed the task of His Messenger, namely: to deliver treatises, namely to convey laws, regulations His rules and instructions, as well as His wa'd (promise) and wa'id (threat). If all of that has been carried out by the Messenger, his task will be completed, and he will be released from his responsibility, henceforth it will become the duty and responsibility of the believers. As for rewarding those who obey, and inflicting punishment on those who disobey, this is the right and authority of Allah alone. At the end of this verse, Allah again emphasizes that He always knows what humans do openly, as well as what is done secretly, including the movements of their inner heart. This is a stern warning from Allah to those who disobey His rules and laws. Therefore, it is appropriate for humans to fear Him, and not violate His commandments."
		   },
		   {
			"id": 769,
			"surah": 5,
			"ayat": 100,
			"tafsir": "In this verse Allah orders His Messenger to explain the characteristics of an action and the people who do it, which will cause them to receive His reward or punishment. It is emphasized that evil and abomination are not the same as virtues and good deeds. Property that is good or obtained in a lawful way is not the same as bad property or obtained in an unlawful way. Items that bring harm are not the same as useful items. Likewise, people who are unjust are not the same as people who are just; and bad people are not the same as pious people; disobedient people are not the same as obedient and pious people. Each will receive a different assessment from Allah and will be rewarded or punished according to the characteristics and circumstances of each. Then Allah warned His servants, so that they should not be deceived by the many deeds and things that are not good. Bad deeds are really liked by people who are weak in faith. Especially in big cities where many people set up businesses that use various facilities that facilitate the occurrence of disobedience. Similarly, goods that are ugly and non-halal are also very popular because they can be obtained in an easy way, such as usury, gambling, bribery, stealing, robbery, and so on. But those who are strong in faith will not be deceived by all these temptations. No matter how many people who commit crimes around him, he still adheres to the laws and instructions of his religion. There may not be as many people of this kind as there are those who are inclined to evil and abominations. But Allah does not judge the number of numbers, but He judges His servants in terms of the goodness of their character and deeds. At the end of this verse, Allah directs His word to people who have common sense, who can distinguish between good and bad, between what is beneficial and what is harmful, so that they are not deceived by various temptations of Satan who always want to lead people to evil and evil. misery. It is the firmness of faith in the midst of various kinds of disobedience that will be able to bring them happiness and luck in this world and the hereafter."
		   },
		   {
			"id": 770,
			"surah": 5,
			"ayat": 101,
			"tafsir": "In this verse Allah gives guidance to His servants, so that they accept what He has sent down and what His Messenger has conveyed to them, so that they do not ask various questions, if the answers to these questions are given to them then will feel burdensome for them, because it will be felt to add to their burdens and obligations. Moreover, if the question asked is meant to test the Prophet, whether the Qur'an is the same as the holy book they received, or they are even seeking relief from various obligations imposed by Allah. Furthermore, this verse explains that if they ask something that was not clear to the Prophet when a verse was revealed regarding this matter, and the question really needs to be answered to understand the content and intent of the verse, then Allah allows it. In fact, we are asked to ask if there is anything we do not understand, as Allah says in surahh an-Nahl\/16: 43: And We did not send before you (Muhammad), but men whom We gave revelations to them; So ask someone who has knowledge if you don't know. (an-Nahl\/16: 43) The end of this verse confirms that Allah is Most Forgiving, and Most Forbearing. The meaning: that is, Allah forgives those who ask questions that are really useful, and things that are not mentioned in His book, and things that He does not charge His servants, and His prohibitions on them not to ask questions to the Apostles that are testing or ridiculing can add to the weight of their burden, this prohibition is His mercy to His servants; in connection with this, the Messenger of Allah has said: Indeed, Allah has determined several obligations that you must fulfill, so do not waste them; and He has forbidden you from doing certain kinds of deeds, so do not transgress them; and He has set some restrictions, so do not exceed them; and He has forgiven you of many things, not because you forgot, so do not look for it. (History of ad-Daruquthni) Regarding Allah's forgiveness mentioned in this verse, it can also be understood that Allah forgives the mistakes that were made before this prohibition, so that Allah does not inflict punishment, because His forgiveness and kindness are very wide for His servants. This is in accordance with His words in other verses, among which are: Allah has forgiven what was past. (al-Ma'idah\/5:95)"
		   },
		   {
			"id": 771,
			"surah": 5,
			"ayat": 102,
			"tafsir": "This verse reminds Muslims that many questions regarding matters of religious law, as they did, have happened to previous nations, but after they were given answers and explanations, they did not want to carry them out, they even turned their backs on them, because they think too heavy. Then they either deny those laws, or they say they didn't come from Allah. However, everything is disbelief, which deserves punishment, both in this world and in the hereafter."
		   },
		   {
			"id": 772,
			"surah": 5,
			"ayat": 103,
			"tafsir": "This verse emphasizes that Allah has never stipulated the prohibition of certain things that apply in ignorance customs such as the prohibition of various animals so that they do not eat their meat. Only they themselves stipulate that it is forbidden to eat the meat of these animals. But they say that the provision comes from God. These animals are as follows: a.Bahirah, namely a female camel that has given birth to five children, and the fifth female child. According to ignorance custom, they split the ears of such a female camel, then they let it go, and it is no longer allowed to be used for transportation, and its milk cannot be taken. b. Saibah, i.e. a female camel that is allowed to go anywhere, may not be used for transportation or carrying loads, and its hair may not be taken, and its milk may not be taken, except for guests. According to the adat of ignorance, this is done to fulfill a vow. If one of them does something heavy work, or travels far, then they make a promise, that he will make his camel a saiba, if his work is successful, or his journey takes place safely. c. Wasilah, namely a female goat or camel born in twins with a male sibling. According to ignorance tradition too, if a female goat gives birth to male and female twins, and the female has another female child, then the female child is called a \"wasilah\", may not be slaughtered, and may not be offered to idols. d.ham, is a male camel that has been credited with impregnating a female camel ten times. According to ignorance tradition, such male camels may no longer be disturbed, for example slaughtered, or used for any purpose, but must be properly cared for. He must not be prevented from drinking water or eating grass anywhere he likes. Thus, among others, some ignorant customs regarding various kinds of animals that cannot be eaten. They said that the provision was from Allah, and became religious law. So in this verse Allah refutes this, and emphasizes that the disbelievers themselves set the stipulation, thus, they have made a lie against Allah. Among the Indonesian Muslim community, this anthropological phenomenon that developed among the ignorant Arabs appeared in the form of taboos, taboos, and so on. There are not a few prohibitions or certain taboos that are deeply rooted in Muslim society, even though the problem has absolutely no basis in religious teachings. The things that are made public are simply the products of local traditions passed down from generation to generation, the truth of which is not supported by religion. The anthropological information conveyed by Allah in verses 103-104 of surahh al-Ma'idah\/5 contains a very important lesson for Muslim communities everywhere not to continue to maintain taboos, because this is not prohibited by Allah. If something like this continues, it means that the community has committed disobedience to Allah. At the end of this verse, Allah explains that most disbelievers do not use their minds. Because, if they would use their common sense, surely they would not make lies against Allah, nor would they forbid what Allah did not forbid. According to a history from Ibn Jarir, Abu Hurairah said, \"I heard the Messenger of Allah say to Aktsam bin al-Jaun, \"O Aktsam, hell has been shown to me, so I see that in hell Amru bin Luhay, Ibn Qam'ah bin Khinzif is pulling his intestines. So I don't see anyone other than you who is more like him.\" So Aktsam said, \"I feel afraid that my resemblance to him will bring some harm to me.\" The Messenger of Allah replied, \"No, because you are a believer, while he is a disbeliever; he was the first person to change the religion of the Prophet Ismail, and he was the first to stipulate provisions regarding bahirah, saibah, wasilah and ham.\" From this history it can be understood that something that is made up in religious law, for example forbidding food that is lawful to Allah, or making traditions that are contrary to religion, or holding worship that is not prescribed by religion as a way to get closer to Allah and earn His pleasure, then these actions are the same as those of 'Amru bin Luhay. delivered by His Messenger. So every worship and determination of the law must be based on the text of the Qur'an or the decree of the Apostle. A person may not add or subtract according to his own will."
		   },
		   {
			"id": 773,
			"surah": 5,
			"ayat": 104,
			"tafsir": "This verse explains the stubborn attitude of disbelievers, when they are invited to follow Allah's laws that are already in the Qur'an which are supported by various reasons and clear evidence and follow the explanations that have been conveyed by the Messenger of Allah, they reject it, they say it's enough what they inherited from their ancestors. Allah condemns their attitude and explains that they do not deserve to follow any Shari'a, nor do they receive guidance from Allah to the straight path to achieve the benefit of this world and the hereafter. Their ancestors were people who were illiterate and still had a simple level of thinking, did not have proper knowledge, which could distinguish between right and wrong. Their minds are still filled with wrong beliefs and superstitions, as well as ways of life that are inconsistent with humanity, for example: killing girls, waging war and enmity between tribes, looking down on orphans and women, and so on. Regarding the attitude of disbelievers of this kind, in another verse it is stated as follows: And when it is said to them, \"Follow what Allah has sent down!\" They replied, \"(No), but we (only) follow the custom that we got from our ancestors.\" Will they (follow their ancestors) even though Satan is actually calling them to the fiery torment (hell)? (Luqman\/31: 21)"
		   },
		   {
			"id": 774,
			"surah": 5,
			"ayat": 105,
			"tafsir": "After mentioning several characteristics of polytheists and disbelievers in the previous verses, in this verse Allah directs His word to the believers, warning them to guard against and distance themselves from such characteristics, such as: stupidity, disobedience , etc. They must always improve themselves with strong faith, useful knowledge, and good deeds, remaining in the guidance of Allah, by following the true Shari'a, which has been revealed, and conveyed by His Messenger. If they carry out this guidance, they can no longer be influenced by bad influences, no matter how bad the circumstances in which they find themselves. The sins and responsibility of those who commit crimes will not be placed on them, as long as they stick to God's instructions and guidance. Personal steadfastness as described in this verse is very important for every believer, and needs to be fostered continuously because many people who originally had faith, but then their faith faded away, due to the influence of their environment. This is because he does not carry out God's instructions, and always follows Satan's enticements. Islam has shown us ways of personal development and firm faith, among others, by way of worship and remembrance, always remembering Allah, and deepening knowledge about religion. If someone always remembers Allah, and he realizes that Allah will repay all his actions, then he will be able to distance himself from actions that Allah has forbidden, and he will always do actions that are pleasing to Him."
		   },
		   {
			"id": 775,
			"surah": 5,
			"ayat": 106,
			"tafsir": "This verse explains that if a believer feels the need to make a will regarding property, then the will must be witnessed by two believers who are just and have a firm stance, so that if in the future issues arise that require testimony from them, it can be expected that they will testify truthfully, and will not hide anything they know about the will. Then it was explained, that if there are not two witnesses who are believers, for example when the person who will make the will is on his way, then he has a disaster, and feels that his death is near, then he may take two witnesses who are not believers, but must fair and firm. The two people who would be used as witnesses were asked to wait until after the prayer. Scholars say what is meant by \"after the prayer\" is \"after the afternoon prayer.\" This is based on what the Prophet had done, and this custom also applies among Muslims, because at these times there are many people who will witness it, because most of them have finished doing most of the tasks that are usually done during the day . It was at that time that the judge usually held a hearing to examine the cases submitted to him. If the two witnesses are not believers, then what is meant by the prayer is the prayer performed according to their religion. If the two witnesses are credible enough, then their testimony on the will does not need to be accompanied by an oath. But if the heirs of the person who made the will doubt the honesty of the witnesses, then the witnesses are asked to take an oath to strengthen their testimony, so that it can be expected that they will actually act as honest witnesses and can be fully trusted. The oath must be pronounced by the two witnesses based on the following verse: \"By Allah, we will not take advantage of this oath, even though he is a close relative, and we do not hide the testimony of Allah; indeed, if so, we would certainly be among the sinners.\" (al-Ma'idah\/5: 106) The content of the oath shows that the witnesses vowed not to treat the testimony like merchandise that can be bought and sold. They didn't hide the testimony or change it because they wanted something personal. They will always uphold their testimony even if it will cause harm to one of their relatives. They really believe that if they hide their testimony when the testimony is needed, or change it with false testimony, they will surely sin and will receive punishment from Allah."
		   },
		   {
			"id": 776,
			"surah": 5,
			"ayat": 107,
			"tafsir": "Furthermore, in this verse it is explained that if at a later date, after the death of the person who made the will, signs of dishonesty from the witnesses appear, for example when asked for their testimony they then gave false testimony, or admitted that they had not hidden anything from the inheritance entrusted to them. them by the person who made the will, then to seek settlement in that situation the obligation to swear an oath is transferred to the heirs of the deceased person who gave the will. For this reason, two other people who are closest to the family relationship with the person who made the will must be found, namely those who are most entitled to receive the inheritance, if he meets the requirements to be able to receive the inheritance. Like not having different religions or not being involved in the murder case of a person with a will. If it turns out that his closest relative does not meet the requirements to receive an inheritance, for example because of differences in religion with the person who left the inheritance, or because he is involved in the case of the murder of a will, then two other people among the heirs are sought, the most important of which is to take an oath. by looking at age, character, knowledge, and so on. The oath made by the two heirs is intended to strengthen the charge against the two people who received the will, that they had betrayed the will. Also to confirm, that they were right in making the charge, and did not transgress; meaning: the accusation is not arbitrary and without reason. Then it also ends with an affirmation, that if they make accusations or testify that are not true, then surely they are among the wrongdoers. In another verse, it is explained that the position of a witness, which was originally obligatory, later became sunnah. It is obligatory upon you, if death is about to pick up someone from among you, if he leaves wealth, make a will for both parents and close relatives in a good way, (as) an obligation for pious people. (al-Baqarah\/2: 180)"
		   },
		   {
			"id": 777,
			"surah": 5,
			"ayat": 108,
			"tafsir": "In this verse it is explained that the method and content of the oath as mentioned above is a way that is closer to the truth, which can encourage the people who swear it, (both the beneficiaries of the will, as well as the heirs of those who swear it) so that they give true testimony, full of responsibility, and glorify Allah (whose name is mentioned in their oath) and to be more careful in maintaining the testament and testimony so as to avoid the punishment and wrath of Allah, and so that the oath is not diverted to others because of his dishonesty. At the end of this verse, Allah warns His servants, so that they fear Him, hold trust and testimony, and like to listen and pay attention to all of His instructions and provisions, to then implement them as well as possible. Allah also warns about the habits of the wicked, namely those who do not want to uphold truth and justice, they will not get the right guidance. It should be explained, that after the two heirs took an oath which meant to declare the dishonesty of the two recipients of the will, all the inheritance left by the person who made the will was handed over to the heirs, to be distributed according to their respective portions, in addition to carry out the actual will and other debts and obligations."
		   },
		   {
			"id": 778,
			"surah": 5,
			"ayat": 109,
			"tafsir": "This verse explains that on the Day of Resurrection, Allah will gather the apostles and their respective followers. The day the incident occurred is called \"Yaumul Mahsyar\". At that time Allah will ask a question to the apostles, \"What answer did they receive from their people after they called on His religion.\" The apostles of course knew what answers they had received from their respective people, and how they responded to the calls that had been conveyed to them, although they did not know all of them. However, the apostles were people of very high moral character and very humble before God Almighty and All-Knowing of all things. Therefore, with full sense of servitude to Allah, they replied, \"That they have no knowledge of it. Indeed, Allah is the All-Knower of the unseen.\" Allah asked the apostles what answers they received from the people they had called to His religion. Allah did not ask the apostles whether they had conveyed the message assigned to them, or not? This shows that the apostles really did their job well, namely conveying Allah's religion to their people. However, it is some of the people who do not accept invitations and appeals as well as possible. Another thing that we can understand from this verse is that Allah did not directly ask questions to the people rather than the apostles, for example: \"O people, what answer did you give to My apostles when they conveyed My message to you? all?\" Instead, God addressed His questions to His apostles, not to their people. This shows God's wrath against people who ignore the calls and warnings that the apostles have conveyed to them. So the question is to rebuke disobedient people."
		   },
		   {
			"id": 779,
			"surah": 5,
			"ayat": 110,
			"tafsir": "In this verse, it is explained about the various favors that were bestowed upon Prophet Isa and his mother, and then the various crimes of the Children of Israel who once accused that the various statements and evidence that Prophet Isa conveyed to them were only magic. Allah's favor to Maryam, namely the mother of Prophet Isa, is that Allah has made her a holy woman, chosen among women in this world to obtain a noble position. God's favors to Prophet Isa mentioned in this verse are as follows: 1. Allah has strengthened Prophet Isa with the Holy Spirit, namely the angel Gabriel. Allah has made his soul clean from all bad qualities. With this blessing, Isa could know that he was born into the world with an extraordinary event, so that he could prove the sanctity of himself and his mother. Because God has strengthened him with the Holy Spirit, he can speak when he is small and weak, still in the cradle. He spoke out in defense of his mother's chastity and honor against the Jewish accusations. Then when he grows up he can also speak well to call people to the religion of Allah. About the Prophet Isa, his mother and the Holy Spirit in this verse, the opinions of some commentators can be said to be the same. Regarding \"remembering the favors,\" it means \"grateful\" for the blessings given to Isa and to his mother Maryam and strengthening them with the Holy Spirit, namely Jibril, and talking to people when he was still a baby and when he grew up he became a prophet, according to Ibn 'Abbas as quoted by al-Bagawi, at the age of 30 and carried out his prophetic duties for 30 months. Then \"I taught you writing, wisdom (i.e. the wisdom of knowledge), the Torah and the Bible,\" and so on. For more about the Holy Spirit, see the vocabulary above (al-Baqarah\/2: 253). It can be added, that as stated in the Al-Qur'an, that the Holy Spirit applies to all believers (al-Mujilah\/58: 22); and sent down to anyone of His servants according to His will. In this verse, spirit means revelation (al-Kahf\/16: 2). Prophet Isa called himself the son of Maryam, who did not know a human father because his birth was indeed a miracle. Allah has given him great blessings in the form of spiritual strength, \"strengthening him with the Holy Spirit\", with the miracles that happened around him and his mother Maryam, concerning his birth, life and death. But Rohulkudus (al-Baqarah\/2: 87) which we find a lot in the Qur'an, in the sense of \"holy spirit\" also means \"divine inspiration.\" The Prophet Muhammad also prayed for mercy with the Holy Spirit to a friend, namely the poet Hassan bin Sickle through his words: That Hassan bin Sickle al-Ansari asked Abu Hurairah for testimony, \"Did you hear the Prophet SAW say, \"O Hassan, fulfill the Messenger of Allah. O Allah, strengthen him (Hassan) with the Holy Spirit.\" (History of al-Bukhari, Muslim, and an-Nasa'i) The meaning of the Holy Spirit in the Qur'an and hadith is not the same as the meaning of the Spirit in the Bible (Old and New Testaments) The Spirit, the Spirit of God or His word in the Old Testament (Genesis i.2) is about the formation of the earth, \"and the Spirit of God hovering over the face of the waters,\" and Psalm xxxiii.6, \"By the word of the Lord the heavens were made, by the breath of His mouth\" In the New Testament it is called the Holy Spirit, the Spirit of God or the Spirit of Jesus. Matthew mentions that the birth of Jesus Christ was when Mary was betrothed to Joseph the son of Heli, conceived by the Holy Spirit, before they lived as husband and wife. Joseph's husband Mary was a sincere person, she did not want to disgrace her wife in public, she intended to secretly divorce her. But in her dream the angel of the Lord appeared to her, and said, do not be afraid \" take Mary as your wife, because the child inside her is the Holy Spirit. She will give birth to a son and you will name him Jesus, \" (Matthew 1.18-21). See also vocabulary (an-Nisa'\/4: 156). 2. Allah has taught him the Bible, meaning Jesus has He gifted him with the ability to write and read, so that he can study written science. Besides that, Allah also taught him the Torah, the holy book that was revealed to the Prophet Musa. Finally, Allah taught him the Gospel, the holy book that was revealed to the Prophet Isa himself. The Prophet Isa himself never changed the contents of the Torah and did not replace it with the Gospel that was revealed to him, and is acknowledged by the present New Testament, \"Do not think that I came to abolish the Torah law or the prophets. I came not to abolish it, but to fulfill it.\" (Matthew v.17). 3. Jesus can make something out of the ground that is the shape and size of a bird, then he blows on the bird, so he becomes a real bird, with permission of Allah. This means that Jesus was the one who formed the object like a bird, and he also blew it, then Allah made it a living bird. 4. Jesus has been able to heal people blind from birth and people who have hair loss, by God's permission, even though at that time no healer could heal people who were blind from birth and people who had hair loss. In Indonesian, the word abras is the equivalent of leprosy from the English translation leprosy, namely \"a chronic disease that attacks the skin and nerves, which slowly causes damage to the limbs; lepra\" (Big Indonesian Dictionary), which in Arabic is usually equated with judzam, not abras. Mu'jam Alfadh al-Qur'an al-Karim explains, that abras \"is a white color on the skin due to loss of red dye (pigment) ) and causes white spots of various shapes. This is a symptom of leprosy.\" So it's not leprosy. In the New Testament (Matthew x.8, Luke iv.27), it is translated as \"leprosy,\" the same as the English translation. precisely, namely \"a skin disease in the form of white patches on the hands or feet due to pigment cells, which are cells that give the skin a dry, tan color.\" (Big Indonesian Dictionary), or in medical terms it is known as leukemia or vitiligo. Isa can also revive people who have died, so that they can come out of their graves alive, with Allah's permission.After the Prophet Isa gave evidence with his miracles, some of them (the Children of Israel) accused him of performing witchcraft, driving out demons by using leader of the demons, \"He cast out demons by the power of Beelzebub, the prince of demons\" (Luke xi.15).The Jews called the king of demons or ruler of demons Beelzebub, and the ruler of the demons used to kill This exorcism is found in several chapters in the New Testament, including in Matthew, Mark and Luke. 6. Allah had protected Prophet Isa from the crimes of the Jews who wanted to kill and crucify him, when Jesus came to them bringing Allah's religion which was accompanied by clear evidence and information, which Allah had bestowed upon him. Allah saved Jesus and raised him to Him. The crimes of the Children of Israel exceeded the crimes of other people, the crimes of other people against Allah's Apostle were only limited to the person of the apostle, but the crimes of the Children of Israel were not only aimed at Prophet Isa, but also against his mother, namely they accused Maryam of having committed adultery with a man, so that gave birth to Jesus. In fact, their crimes were not only aimed at Jesus and his mother, but also against Allah, because they said that Allah had a wife and children, even though Allah is Most Holy of these things. The disbelievers among the Children of Israel not only rejected the religion of Allah that was conveyed to them by Prophet Isa, they even said that the information that was conveyed by Jesus was just magic. The various favors of Allah to the Prophet Isa mentioned in this verse are very sharp satire and criticism of the Children of Israel, for their abominable attitudes and actions. This verse also reveals how great their hatred is towards those who receive God's favor. Their statement that the statements conveyed by Prophet Isa to them were \"real magic\", is strong evidence of their jealousy towards Prophet Isa who was chosen by Allah as His Prophet and Messenger. Allah's favor to Prophet Isa mentioned in this verse is an extraordinary blessing, which Allah did not give to other prophets. In the next verse, Allah mentions several of His other blessings which He also gave to Prophet Isa but are ordinary favors, which were also obtained by other apostles."
		   },
		   {
			"id": 780,
			"surah": 5,
			"ayat": 111,
			"tafsir": "Allah explained the attitude of the hawariyin, namely a group from the Children of Israel who accepted Allah's religion as conveyed by Prophet Isa. Then they said to Prophet Isa, \"We have believed; and bear witness, that indeed we are those who obey your call.\" That is, they believe and accept the call of Prophet Isa, and will carry out all of his commands, as proof of that faith. The meaning of God's favor to Prophet Isa in this case is that Prophet Isa was well received by the hawariyin, so they loved and obeyed him. This is not only a blessing for the Prophet Isa solely, but also a blessing for his mother, because every blessing that a child gets, also brings joy and happiness to his mother."
		   },
		   {
			"id": 781,
			"surah": 5,
			"ayat": 112,
			"tafsir": "In this verse Allah tells that the hawariyyin once asked Prophet Isa whether Allah could send down to them a dish from the sky. This question does not show that the hawariyyin still have doubts about Allah's power. They had complete confidence in the power of Allah. But they asked that to reassure them even more. Because, if they can witness that God has the power to bring down what they want, then their hearts will be more peaceful, and their faith will grow stronger. This also happened to the Prophet Abraham when he asked Allah to show him how He has the power to revive a dead creature. Allah said: and (remember) when Abraham said, \"O my Lord, show me how You raise the dead.\" God said, \"Don't you believe yet?\" He (Ibrahim) replied, \"I believe, but so that my heart is calm (steady).\" (al-Baqarah\/2:260) Thus, the question of the hawariyyin earlier can be interpreted as follows, \"O Isa, would your Lord allow us to ask Him to bring us a dish?\" So what they doubt is not God's power to grant it, but whether God is willing to grant the Prophet's request, if Prophet Isa asks Him to do that for them. It should be noted in the verse above, that when the hawariyyin put their question to Prophet Isa, they mentioned him by his name, followed by the title 'son of Maryam'. This is to emphasize that they do not subscribe to the belief that Jesus is God, or the son of God. They believe that Jesus is a creature of Allah who was chosen to be His Prophet and Messenger, also the son of Maryam, not the son of Allah. hawariyyun or hawariyyin, from hawari, \"bleaching agent, which is clean and free from all stains; friend and defender;\" according to Mu'jam Alfadh al-Qur'an al-Karim, hawari, pure and clean of everything, is generally used for those who are truly sincere for the prophets,\" or \"defense, support,\" \"defenders\" (Ali 'Imran\/3: 52). Allegedly from the origin of the Abyssinian language. According to Muhammad Asad in The Message of The Qur'an, \"a person who whitens his clothes by washing them,\" because it is also said to the followers of the Prophet Isa as a symbol of people who have a clean heart The recent discovery of the Dead Sea Scroll strongly supports this view, in that the word hawari was used to designate a person who belonged to the Essense Brotherhood, a group of religious groups in Palestine at the time of Prophet Jesus, which may also include himself. their zeal for moral purity and selflessness, and they always wore white clothes.The Prophet Muhammad gave the title hawari to Zubair bin 'Awwam saying: \"Every prophet is also yes a hawari, and my hawari is Zubair bin 'Awwam\". (History of al-Bukhari and at-Tirmidhi) In some tafsirs of the Indonesian language it is translated as \"follower,\" \"friend,\" \"helper\" or \"stay \"Hawariyun;\" while the Bible translates it with \"disciple.\" At the end of the verse it is explained the answer of the Prophet Isa to the hawariyyin. He ordered them to fear Allah, that is so that they do not make requests or questions that give the impression as if they doubt the power of Allah. This is a very good lesson, because those who believe must strengthen his faith, and eliminate all kinds of things that can reduce faith. Allah is Almighty, over everything. Preparing a meal is a work that is not worthy to ask Allah. He is exalted. He has bestowed upon His servants everything on earth, whether foodstuffs, clothing, housing, etc. So it is the duty of humans to process the available materials for them to make and food, clothing, housing and so on for their own interests. Allah does not ask for a reward for the blessings He has provided, which are countless. If Allah does not bring down dishes from the sky, then that does not reduce the meaning of His power and compassion for His servants. Therefore, do not reduce your faith and trust in Him."
		   },
		   {
			"id": 782,
			"surah": 5,
			"ayat": 113,
			"tafsir": "In this verse, the next words of the hawariyyin are told to Prophet Isa, after Jesus told them to believe in Allah, do good deeds, work and put their trust in Him, and not make inappropriate requests. The hawariyyin said, \"We have full faith in the power of Allah, but we made this request, because we needed food, and we did not get any other food, while we were hungry. In addition, if we could see the food go down, and being able to taste its delicacy, our faith will grow stronger. In this way we will also be able to witness those who did not witness the descent of the dish and did not eat it, so that they too will also have faith, and their belief will grow stronger because of our testimony earlier.\""
		   },
		   {
			"id": 783,
			"surah": 5,
			"ayat": 114,
			"tafsir": "In this verse it is explained that Prophet Isa, after knowing the good intentions of the hawariyyin in their request, namely that they did not doubt the power of Allah, but because they wanted to be more certain and gain stronger faith and peace of mind, Prophet Isa granted their request to pray. to Allah to bring down dishes for them. Prophet Isa began his prayer with the words \"Allahuma Rabbana\". While these words contain the meaning of His majesty, namely: divinity, power, wisdom and His wisdom, as well as His characteristics as Ruler, Educator, Preserver and Giver of favors. Then Isa continued his prayer with a request that Allah send down for them food from the sky. Prophet Isa hoped that the day when the dish descended would be a feast for them and their future generations. This will also be a sign or evidence for Allah's power. The Prophet Isa ended his prayer by saying, \"Give us sustenance, because You are the Most Important Provider of sustenance.\" What we need to pay attention to in this verse is that the Prophet Jesus in his prayer first mentions the spiritual benefits that will be obtained if God answers his prayer, then only mentions the physical benefits. The spiritual benefit is: the descent of the dish will be a very important day in the life of its people, and they will make it a holiday, where they will always remember God's grace, and they will exalt the greatness of His power. This will increase their confidence, and will strengthen their faith in Allah. As for the physical benefit, that food will be a sustenance that will eliminate hunger and restore their physical freshness and strength. It was a different matter for the hawariyyin when they made the request to Isa. They prioritize the mention of physical benefits, and after that only mention the spiritual benefits. Thus it can be concluded that with the composition of his prayer, the Prophet Isa taught his people, so that they prioritize spiritual-mental aspects rather than physical-material physical aspects. Mentioned \"Ma'idah\" in this surahh which means \"dish\", so the word has been agreed to be the name for this surah, namely surahh al-Ma'idah\/5. The words used as names for the surahhs of the Qur'an are mostly taken from a word contained in the relevant surah, which relates to a very important matter, for example: the name of this surah and surahh \"al-Baqarah\". Sometimes it is also taken from other words that are not in the surah but clearly indicate the contents of the surah, for example the name of surahh al-Ikhlas\/112. Verses 112 and 113 mention the request for food from the sky by the followers of Prophet Isa. In several chapters in the New Testament it is described very diversely (Matthew vi.11, Acts x.9-12 and so on)."
		   },
		   {
			"id": 784,
			"surah": 5,
			"ayat": 115,
			"tafsir": "In this verse it is explained that Allah granted the prayer and lowered the dish according to their request. However, with the condition that after the food is passed down, none of them may remain disbelievers, or return to disbelief after believing, because they have been given lessons and explanations about the power and greatness of Allah, then given concrete evidence that they can witness. with their own senses. If there are still those among them who disbelieve, then Allah's wrath and punishment should be inflicted on them, which exceeds the punishment inflicted on other unbelievers. The opinions of the scholars vary regarding the types of food that Allah sent down in this dish. But this issue is not an important issue to discuss, the Qur'an itself does not mention it. Likewise Rasulullah saw. What we need to pay attention to is the causal relationship, as well as the content and purpose of the story, to be used as an example and a lesson to strengthen our faith and belief in Allah with all His attributes of perfection."
		   },
		   {
			"id": 785,
			"surah": 5,
			"ayat": 116,
			"tafsir": "In this verse, Allah says, did Jesus and his mother claim to be gods. Isa stated that the statement above was not true, because he had no right to say something that was inappropriate for himself and his mother. Allah asked Jesus this question even though Allah knew what really happened, so that Jesus on the Day of Judgment would declare before the apostles and mankind that only Allah has the right to be worshiped, and he would explain the mistakes of his people who saw himself and his mother as God. . All worship is directed only to Allah. This verse gives a warning to Christians who lived later on the mistakes and errors of their faith. Many kinds of worship and prayers performed by Christians are addressed to Jesus and his mother, both specifically for Jesus and their respective mothers, as well as the worship of associating them with Allah. All worship like that cannot be justified, because all worship must be directed to Allah alone. Allah's Word: Even though they are only ordered to worship Allah sincerely obeying Him solely because of (practicing) religion (al-Bayyinah\/98: 5) There is no God but Allah who has the right to be worshiped by servants. The Prophet Isa answered God's question about worship and belief addressed to himself and his mother with an answer that begins with the word \"Subhanaka\" which means \"You are pure\", meaning that it is impossible for there to be a god but Allah. The Prophet Isa emphasized that neither himself nor anyone else had the right to say something that was inappropriate for himself and his mother. Prophet Isa did not even cross his mind to declare himself or his mother as god, because he was sent to humans to guide them to the straight path, namely the religion of monotheism. If the Prophet Isa declared his claim to be God, or crossed his mind, surely Allah would know better, because He is All-Knowing of what is hidden in the human mind, especially what is revealed. Man does not know what Allah has hidden unless He reveals it through revelation. Verily, Allah alone is All-Knower of all that is unseen; His knowledge includes everything that has ever happened, is happening, and will happen. Allah asked whether Prophet Isa declared himself and his mother to be God, because many Christians in Najran considered Jesus and his mother to be God (Alusi V;94). The important thing is that this verse is the answer of Prophet Isa, who never declared himself and his mother as God. This answer needs to be known by the disciples of Prophet Isa and all his followers."
		   },
		   {
			"id": 786,
			"surah": 5,
			"ayat": 117,
			"tafsir": "After the Prophet Isa purified Allah in the last verse and then he cleared himself of the accusation of considering himself to be God, in this verse Jesus explained what he had actually called for his people, namely that they should worship Allah. His own God and also the God of his people. It is not true that he deified himself and his mother because they are both servants of Allah like any other human being. The Prophet Isa had taught the basics of religion and the basics of faith to his people which they should have used as a guide in religious life of all time. When Prophet Isa was still with them, he always gave guidance to them and supervised all their behavior; what is right is justified, what is wrong is declared wrong according to God's instructions. But after he was raised to the sky, his apostolic assignment ended, his supervision and guidance for his people ended. Prophet Isa no longer knows their deeds and the history of their development and their religion. Only Allah is the Watcher and Witness over them. Allah guides those who want the truth, let those who want to go astray. The people who deified Jesus were infidels and heaven was forbidden for them. Allah confirms this in His word: Indeed, those who say, \"Indeed, Allah is the Messiah, the son of Mary.\" Even though Al-Masih (himself) said, \"O Children of Israel! Worship Allah, my Lord and your Lord.\" Indeed, whoever associates (something with) Allah, then indeed, Allah has forbidden heaven for him, and his place is hell. And there is no helper for those wrongdoers. (al-Ma'idah\/5:72)"
		   },
		   {
			"id": 787,
			"surah": 5,
			"ayat": 118,
			"tafsir": "This verse explains that Jesus fully surrendered the decision over the Christians to Allah, and he released his hands from responsibility for their actions, because he had conveyed his call in accordance with Allah's commands, namely to confirm Him and specialize in worshiping Him. Allah will punish them according to their deeds. He is the one who knows which of them are in monotheism and who are polytheists, who are obedient and who are disbelievers, who are pious and who are wicked. If Allah inflicts punishment on them, then the punishment will fall on those who deserve the punishment. They are servants of Allah, they should worship Allah, not worship other than Allah. If Allah forgives them, then He gives forgiveness to those who deserve it and who deserve it. Allah is Almighty and authorized in taking care of all matters, no one else takes care of it. Allah is Wise in determining the decision on this matter, and He knows best which of the Christians have become polytheists and who are still in the monotheistic religion. Those who become polytheists, there is no forgiveness for their sins. Allah's Word: Surely Allah will not forgive (sins) for associating partners with Him (shirk), and He forgives what (sins) other than (shirk) is for whom He wills. (an-Nisa'\/4: 48) Since the beginning of the century AD, there have been many streams of belief that have grown among followers of the Christian religion. So that many disputes arise between them, then it is up to Allah to punish or forgive among His servants according to His will."
		   },
		   {
			"id": 788,
			"surah": 5,
			"ayat": 119,
			"tafsir": "In this verse, Allah explains that on the Day of Judgment, people who always act in monotheism, will benefit from the truth of their faith and from the honesty of their actions and words. The benefits they get are: first, the pleasures of heaven, which give a lot of physical satisfaction, and secondly, the pleasures of Divine pleasure, which give peace and spiritual satisfaction. All their deeds are accepted by Allah as worship and Allah gives grace and pleasure to them. They are happy to obtain the pleasure of Allah. There is no greater pleasure than the reward from Allah. Allah is pleased with them, and they are pleased with Allah. This is the peak of eternal happiness in man. These two favors of Allah are heaven and Divine pleasure which are obtained after passing the calculation of charity on the Day of Judgment."
		   },
		   {
			"id": 789,
			"surah": 5,
			"ayat": 120,
			"tafsir": "This surahh ends with a statement, that all the kingdoms of the heavens and the earth and their contents belong only to Allah. Both intelligent and non-sensing beings; inanimate objects or animate beings, all of them submit and submit under His will and iradat. This verse warns Christians of the wrong way of thinking about Jesus and his mother, who are considered gods, even though both are servants of Allah and belong to Him. Neither of them are allies of Allah, nor equal to Him. Therefore, prayer and worship should not be addressed to both. Only Allah has the right to be worshiped, because He is the owner and ruler of this world and everything in it."
		   }
	]
}
