{
	"tafseer": [
		{
			"id": 4415,
			"surah": 44,
			"ayat": 1,
			"tafsir": "This verse consists of hijaiyah letters, as they appear at the beginning of several surahhs of the Qur'an. Scholars of commentary differ on the meaning of the letters. Furthermore, you are welcome to examine this issue in the \"Al-Qur'an and its tafsir\" volume I, namely the tafsir of the first verse of surahh al-Baqarah.\""
		   },
		   {
			"id": 4416,
			"surah": 44,
			"ayat": 2,
			"tafsir": "Allah explains that He has sent down the Qur'an on a night known as the night \"Lailatul Qadar\" to warn His servants and so that they fear His punishment, and on that night He has detailed everything that is beneficial to His servants. in this world and in the hereafter. He is the Lord of the worlds who governs the heavens and the earth and everything in between. Nothing is hidden from Allah regarding the affairs of His servants, their life and death are in His hands. He was their God and the God of their ancestors, but they still doubted after the truth was clear and obvious. Allah's Word: Indeed, We have sent it down (the Qur'an) on the night of qadar. And do you know what the night of glory is? The night of glory is better than a thousand months. (al-Qadr\/97: 1-3) The event of the revelation of the Qur'an occurred in the month of Ramadan as Allah says: The month of Ramadan is the (month) in which the Qur'an was revealed, (al-Baqarah\/2: 185) From the hadith of the Prophet: From Watsilah bin al-Asqa' that the Messenger of Allah said: the shuhuf of Ibrahim was revealed on the first night of Ramadan, the Torah was revealed on the 6th of Ramadan, the Zabur on the 12th night of Ramadan, the Bible on the 18th night of Ramadan and the Qur'an an was sent down on the night of the 24th of Ramadan. (History of Ahmad, ath-thabrani, and al-Baihaqi) Allah sent down the Qur'an to inform people about things that are beneficial to practice and things that will harm them, so that they stay away from it, to be an argument against Allah over his servant."
		   },
		   {
			"id": 4417,
			"surah": 44,
			"ayat": 3,
			"tafsir": "Allah explains that He has sent down the Qur'an on a night known as the night \"Lailatul Qadar\" to warn His servants and so that they fear His punishment, and on that night He has detailed everything that is beneficial to His servants. in this world and in the hereafter. He is the Lord of the worlds who governs the heavens and the earth and everything in between. Nothing is hidden from Allah regarding the affairs of His servants, their life and death are in His hands. He was their God and the God of their ancestors, but they still doubted after the truth was clear and obvious. Allah's Word: Indeed, We have sent it down (the Qur'an) on the night of qadar. And do you know what the night of glory is? The night of glory is better than a thousand months. (al-Qadr\/97: 1-3) The event of the revelation of the Qur'an occurred in the month of Ramadan as Allah says: The month of Ramadan is the (month) in which the Qur'an was revealed, (al-Baqarah\/2: 185) From the hadith of the Prophet: From Watsilah bin al-Asqa' that the Messenger of Allah said: the shuhuf of Ibrahim was revealed on the first night of Ramadan, the Torah was revealed on the 6th of Ramadan, the Zabur on the 12th night of Ramadan, the Bible on the 18th night of Ramadan and the Qur'an an was sent down on the night of the 24th of Ramadan. (History of Ahmad, ath-thabrani, and al-Baihaqi) Allah sent down the Qur'an to inform people about things that are beneficial to practice and things that will harm them, so that they stay away from it, to be an argument against Allah over his servant."
		   },
		   {
			"id": 4418,
			"surah": 44,
			"ayat": 4,
			"tafsir": "Allah explained that on the night of \"Lailatul Qadar\", explained all matters related to the life of creatures, life, death, sustenance, good luck, bad luck and so on. Everything is a provision from Allah who is full of wisdom according to His wisdom. Verse 5 closes with the assertion that Allah has sent His Messenger to people from their own class, cleanse their souls, teach them the al-kitab, al-hikmah; so that it becomes an argument for Allah against His servants and becomes a reason to punish them when they sin, oppose the messenger sent to them, reject the guidance that the apostle brings from Allah and there is no reason for them to argue and not accept Allah's punishment, as He said: But We will not punish before We send a messenger. (al-Isra'\/17: 15) And His words: The messengers were as bearers of glad tidings and warners, so that there would be no reason for humans to contradict Allah after the messengers were sent. (an-Nisa'\/4: 165)"
		   },
		   {
			"id": 4419,
			"surah": 44,
			"ayat": 5,
			"tafsir": "Allah explained that on the night of \"Lailatul Qadar\", explained all matters related to the life of creatures, life, death, sustenance, good luck, bad luck and so on. Everything is a provision from Allah who is full of wisdom according to His wisdom. Verse 5 closes with the assertion that Allah has sent His Messenger to people from their own class, cleanse their souls, teach them the al-kitab, al-hikmah; so that it becomes an argument for Allah against His servants and becomes a reason to punish them when they sin, oppose the messenger sent to them, reject the guidance that the apostle brings from Allah and there is no reason for them to argue and not accept Allah's punishment, as He said: But We will not punish before We send a messenger. (al-Isra'\/17: 15) And His words: The messengers were as bearers of glad tidings and warners, so that there would be no reason for humans to contradict Allah after the messengers were sent. (an-Nisa'\/4: 165)"
		   },
		   {
			"id": 4420,
			"surah": 44,
			"ayat": 6,
			"tafsir": "In this verse Allah explains that the wisdom and background of sending the messenger is a mercy from Him for the universe as He says: And We did not send you (Muhammad) but to (become) a mercy for the entire world. (al-Anbiya'\/21: 107) Some commentators argue that mercy is the background for the revelation of the Al-Qur'an, because by following the contents and instructions of the Qur'an, humans can properly manage the affairs of this world and the hereafter , improve their way of life so that they see the blessings of living in their society. Allah's Word: And We sent down from the Qur'an (something) which is a bidder and a mercy for those who believe. (al-Isra'\/17: 82) Allah is All-Hearing, hearing everything that humans say. All-Knowing of all things that bring benefit to them."
		   },
		   {
			"id": 4421,
			"surah": 44,
			"ayat": 7,
			"tafsir": "Allah explains that He is All-Hearing and All-Knowing about the affairs of His servants because He is the one who maintains, rules and owns the heavens and the earth and what is between them. Thus this should be a standpoint for people who want to know and believe in it without the slightest doubt."
		   },
		   {
			"id": 4422,
			"surah": 44,
			"ayat": 8,
			"tafsir": "Allah explains that there is no true God but Him. It is He who gives life to all things according to His will, and who kills whoever He wills, both former, present and future. Therefore He is the one who deserves and deserves to be worshiped, not gods who cannot resist disaster and cannot bring benefits as worshiped by polytheists."
		   },
		   {
			"id": 4423,
			"surah": 44,
			"ayat": 9,
			"tafsir": "Allah explains that the polytheists still doubt about the oneness of Allah and the existence of the resurrection day, their acknowledgment that it is Allah who created the heavens and the earth and everything that exists on this earth is an acknowledgment that is not based on belief, but only because they follow traces of their ancestors without knowledge."
		   },
		   {
			"id": 4424,
			"surah": 44,
			"ayat": 10,
			"tafsir": "In this verse Allah commands the Prophet Muhammad to be patient while waiting for the Meccans to suffer from hunger. At that time, if they looked up, they would see in the sky a thick fog filling the sky. According to scientific studies regarding the occurrence of Dukhan (fog). It seems that the Doomsday will begin with a violent collision between the earth and heavenly bodies (planets or other asteroids). This collision is expected to cause the scattering of earthly materials and celestial bodies in very, very large quantities. The material scatters into space like a cloud of dust (ad dukhan) in very large quantities. This cloud of dust is likely to cover the earth's atmosphere so that sunlight no longer penetrates the earth, the temperature will drop dramatically, and all living things will die. Palaeontologists (experts on ancient problems), including paleogeologists (ancient geology) and paleobiologists (ancient biology), put forward the theory of the extinction of the dinosaur species 66.4 million years ago, by putting forward a hypothesis known as the Asteroid Theory. (Asteroid Theory). This theory arose after Walter Alvarez discovered an anomaly high concentration of iridium in the Cretaceous-Tertiary stratigraphic series in Gubbio, Italy. This abnormal concentration of iridium raises suspicions that iridium comes from celestial bodies. According to the Asteroid Theory, the extinction of dinosaur species occurred due to the collision of the earth with an asteroid, which resulted in the emergence of an extraordinary cloud of dust that covered the earth, thus blocking sunlight from entering, lowering the temperature and killing ancient living species. This theory is supported by the high levels of iridium in the locations where the dinosaurs were found. Is ad-Dukhan in verse 10 also caused by the collision of the earth with heavenly bodies, before the end of the world."
		   },
		   {
			"id": 4425,
			"surah": 44,
			"ayat": 11,
			"tafsir": "Allah explained that when the thick fog covered them, they said, \"This is a torment that is so disturbing that we cannot sleep and if this torment continues, of course we will die."
		   },
		   {
			"id": 4426,
			"surah": 44,
			"ayat": 12,
			"tafsir": "Allah explained that they promised the Messenger of Allah that they would believe in Allah if the punishment that befell them was removed by Allah. That is human nature in general when they are in trouble; they promise to repent and refrain from the things that caused the trouble, but when their trouble ends or their trouble disappears, they return to doing the things that caused the trouble. It is narrated that when the drought that befell the Quraysh was so great. Abu Sufyan visited Rasulullah SAW and asked for mercy from him, and promised to have faith if Muhammad SAW prayed for them to be released from the trouble so that their trouble would end."
		   },
		   {
			"id": 4427,
			"surah": 44,
			"ayat": 13,
			"tafsir": "Allah explained how they promised to believe if their punishment was removed. A messenger has been sent to them who gives warnings and explanations about the truth of Muhammad's prophethood and that the Qur'an is from Allah. All of this should have been enough to awaken them and return them to the truth, but they still refused and turned their backs on it, they even accused that the teachings that Muhammad had spread were received from a Roman, a slave from the Saqif tribe named Addaz who was a Christian. Some of them accused Muhammad of being mad and that the teachings he brought came from the jinn when Muhammad was unconscious."
		   },
		   {
			"id": 4428,
			"surah": 44,
			"ayat": 14,
			"tafsir": "Allah explained how they promised to believe if their punishment was removed. A messenger has been sent to them who gives warnings and explanations about the truth of Muhammad's prophethood and that the Qur'an is from Allah. All of this should have been enough to awaken them and return them to the truth, but they still refused and turned their backs on it, they even accused that the teachings that Muhammad had spread were received from a Roman, a slave from the Saqif tribe named Addaz who was a Christian. Some of them accused Muhammad of being mad and that the teachings he brought came from the jinn when Muhammad was unconscious."
		   },
		   {
			"id": 4429,
			"surah": 44,
			"ayat": 15,
			"tafsir": "In this verse Allah explains that if He removes some of the punishment from them according to His request that they do good and no longer violate Allah's prohibitions, they will still be in their original state, namely disbelievers and deny Muhammad as Allah says: And if they We have mercy on them, and We have removed the calamity that befell them, surely they will continue to drift in their error. (al-Mu'minun\/23: 75) And His words: If they were returned to the world, they would certainly repeat what they had been forbidden to do. They are real liars. (al-An'am\/6: 28)"
		   },
		   {
			"id": 4430,
			"surah": 44,
			"ayat": 16,
			"tafsir": "In this verse Allah explains that on the Day of Resurrection He will give a very painful punishment to the infidels of Mecca. On that day they will not have defenders, helpers and saviors who will be able to block the punishment of Allah that is inflicted on them, and at that time their deep regret will arise. Allah's Word: They expressed regret when they saw the doom. And We put shackles around the necks of those who disbelieve. They are not rewarded but according to what they have done. (Saba'\/34: 33)"
		   },
		   {
			"id": 4431,
			"surah": 44,
			"ayat": 17,
			"tafsir": "Allah explained that before testing the Prophet Muhammad's people, He had tested the Pharaohs who were very arrogant and arrogant. The test is, by sending them a noble apostle, namely the Prophet Musa. This event is expected to be an example for the people of the Prophet Muhammad."
		   },
		   {
			"id": 4432,
			"surah": 44,
			"ayat": 18,
			"tafsir": "The Prophet Musa said to the Pharaohs, \"Give me the Children of Israel and release them from slavery and torture you all, because they are an independent people for me to bring to our country of origin. I am the Messenger of Allah who has been entrusted with conveying the revelations Allah and warns you all about His punishment when you all disobey Him Allah's Word: So go both of you to him (Pharaoh) and say, \"Indeed, we are both messengers of your Lord, so release the Children of Israel with us and do not you torture them. Indeed, we have come to you with proof (of our apostleship) from your Lord. And safety is delegated to those who follow instructions. (thaha\/20:47)"
		   },
		   {
			"id": 4433,
			"surah": 44,
			"ayat": 19,
			"tafsir": "Musa appealed to the Pharaohs so that they would not be proud of Allah by denying His lordship, by acknowledging that the lordship was in them, and not disobeying Him and violating His commands. Furthermore, Moses emphasized that he had come to them with clear evidence of the truth of what he was calling for. The concrete evidence includes the events that occurred between Musa and Pharaoh which are narrated in the Qur'an. Allah's Word: He (Moses) said, \"Would (you do that) even if I show you something real (proof)?\" He (Pharaoh) said, \"Show me something (clear evidence), if you are righteous man!\" So he (Moses) threw down his staff, suddenly the stick became a real big snake. And he took his hand out (from inside his shirt), suddenly it became white (glow) for those who saw it. (asy-Syu'ara'\/26: 30-33)"
		   },
		   {
			"id": 4434,
			"surah": 44,
			"ayat": 20,
			"tafsir": "Furthermore, in this verse, Musa said to Pharaoh and his people, that he would ask for protection from his Lord and their God, the God who created him and who created them, for protection from the evil actions that they would inflict on him either in words or deeds. If they didn't want to accept what he called on them, Musa expected them to let it happen to his people without reciprocating their attitude. The problem between Musa and Pharaoh and his people dragged on, even though they had been given clear evidence, they still disobeyed. Moses prayed and complained to Allah that they continued to associate partners with Him and belied His messengers. Allah's Word: And Musa said, \"O our Lord, You have given Pharaoh and the leaders of his people jewelery and wealth in the life of the world. O our Lord, (as a result) they mislead (people) from Your path. O Lord , destroy their treasures, and lock their hearts, so that they will not believe until they see the painful doom.\" (Yunus\/10: 88)"
		   },
		   {
			"id": 4435,
			"surah": 44,
			"ayat": 21,
			"tafsir": "Furthermore, in this verse, Musa said to Pharaoh and his people, that he would ask for protection from his Lord and their God, the God who created him and who created them, for protection from the evil actions that they would inflict on him either in words or deeds. If they didn't want to accept what he called on them, Musa expected them to let it happen to his people without reciprocating their attitude. The problem between Musa and Pharaoh and his people dragged on, even though they had been given clear evidence, they still disobeyed. Moses prayed and complained to Allah that they continued to associate partners with Him and belied His messengers. Allah's Word: And Musa said, \"O our Lord, You have given Pharaoh and the leaders of his people jewelery and wealth in the life of the world. O our Lord, (as a result) they mislead (people) from Your path. O Lord , destroy their treasures, and lock their hearts, so that they will not believe until they see the painful doom.\" (Yunus\/10: 88)"
		   },
		   {
			"id": 4436,
			"surah": 44,
			"ayat": 22,
			"tafsir": "Furthermore, in this verse, Musa said to Pharaoh and his people, that he would ask for protection from his Lord and their God, the God who created him and who created them, for protection from the evil actions that they would inflict on him either in words or deeds. If they didn't want to accept what he called on them, Musa expected them to let it happen to his people without reciprocating their attitude. The problem between Musa and Pharaoh and his people dragged on, even though they had been given clear evidence, they still disobeyed. Moses prayed and complained to Allah that they continued to associate partners with Him and belied His messengers. Allah's Word: And Musa said, \"O our Lord, You have given Pharaoh and the leaders of his people jewelery and wealth in the life of the world. O our Lord, (as a result) they mislead (people) from Your path. O Lord , destroy their treasures, and lock their hearts, so that they will not believe until they see the painful doom.\" (Yunus\/10: 88)"
		   },
		   {
			"id": 4437,
			"surah": 44,
			"ayat": 23,
			"tafsir": "Allah ordered Musa to leave Egypt at night and take along the Children of Israel and those who believe in him from the original inhabitants of Egypt, without the knowledge of Pharaoh. He was told by Allah that Pharaoh and his people would chase him, but he would not be overtaken by them. Allah said: And indeed, We have revealed to Moses, \"Go with My servants (the Children of Israel) by night, and beat (make) for them a dry path in the sea, (you) do not need to be afraid of being overtaken and there is no need to worry (will sink).\" (thaha\/20: 77)"
		   },
		   {
			"id": 4438,
			"surah": 44,
			"ayat": 24,
			"tafsir": "Allah ordered Musa so that he and his people left the sea that he passed in a split state as it was when he entered it, until Pharaoh and his army entered it, then Allah linked the sea which was split again until Pharaoh and all his soldiers drowned. Meanwhile, Moses and those who were with him were safe on land, as stated in the word of Allah: And We saved Moses and those who were with him. Then We drowned the other groups. (asy-Syu'ara'\/26: 65-66)"
		   },
		   {
			"id": 4439,
			"surah": 44,
			"ayat": 25,
			"tafsir": "How much wealth was left by Pharaoh and his army, both in the form of gardens full of flowers that made the cool air pleasant, and springs that flowed beautifully. Likewise green gardens, full of trees that bear fruit with abundance, beautiful scenic spots, magnificent buildings and magnificent and beautiful palaces."
		   },
		   {
			"id": 4440,
			"surah": 44,
			"ayat": 26,
			"tafsir": "How much wealth was left by Pharaoh and his army, both in the form of gardens full of flowers that made the cool air pleasant, and springs that flowed beautifully. Likewise green gardens, full of trees that bear fruit with abundance, beautiful scenic spots, magnificent buildings and magnificent and beautiful palaces."
		   },
		   {
			"id": 4441,
			"surah": 44,
			"ayat": 27,
			"tafsir": "At first they lived in peace with a life that was sufficient and complete, abundant sustenance, joy that was always enjoyed. All this was bestowed upon them by Allah, but they still did not want to realize that their wickedness and disbelief increased because of this, and Allah destroyed them. Their wealth is of no benefit to them and cannot help them. God's Word: And his wealth is of no use to him when he has perished. (al-Lail\/92: 11)"
		   },
		   {
			"id": 4442,
			"surah": 44,
			"ayat": 28,
			"tafsir": "Thus Allah destroys people who deny His messengers who always violate His commands and violate His prohibitions. A country full of abundant wealth was transferred by God to other people who had nothing to do with them, either family or religious. So the nations took control over Egypt. Ibn Kathir argues that it was the Children of Israel who inherited Pharaoh's wealth. Thus Allah gives wealth to whom He wills and takes away the kingdom from whom He wishes, glorifies whom He wills, and humiliates whom He wishes. Allah's Word: Say (Muhammad), \"O Lord of power, You give power to whomever You will, and You take power from whomever You wish. You glorify whoever You wish and humiliate whoever You wish. .In Your hands are all good things. Indeed, You are Almighty over all things.(Ali 'Imran\/3: 26)"
		   },
		   {
			"id": 4443,
			"surah": 44,
			"ayat": 29,
			"tafsir": "Heaven and earth do not weep over the departure and destruction of Pharaoh and his people. Nothing in the heavens or on earth paid any heed to the death of Pharaoh and his evil and wicked people. They do not want to repent to correct their mistakes, therefore punishment is hastened without any delay. Abu Ya'la narrated, as did Abu Nu'aim in the book Hiyah al-Auliya: From Anas bin Malik, the Prophet said: Every Muslim has two doors in the sky; the door where the sustenance descends and the door where charity and words enter, if both are not there then both doors cry."
		   },
		   {
			"id": 4444,
			"surah": 44,
			"ayat": 30,
			"tafsir": "Allah saved the Children of Israel from the torment of Pharaoh and his people who humiliated them. The Pharaohs had destroyed their enemies, killed their sons, and spared the women's lives but forced the hard labor. Pharaoh was an arrogant and transgressed beyond humanity. Allah's Word: Indeed, Pharaoh has done arbitrary on earth and divided its inhabitants, he oppressed a group of them (the Children of Israel), he slaughtered their sons and spared their daughters. Indeed, he (Pharaoh) was one of those who did mischief. (al-Qasas\/28: 4)"
		   },
		   {
			"id": 4445,
			"surah": 44,
			"ayat": 31,
			"tafsir": "Allah saved the Children of Israel from the torment of Pharaoh and his people who humiliated them. The Pharaohs had destroyed their enemies, killed their sons, and spared the women's lives but forced the hard labor. Pharaoh was an arrogant and transgressed beyond humanity. Allah's Word: Indeed, Pharaoh has done arbitrary on earth and divided its inhabitants, he oppressed a group of them (the Children of Israel), he slaughtered their sons and spared their daughters. Indeed, he (Pharaoh) was one of those who did mischief. (al-Qasas\/28: 4)"
		   },
		   {
			"id": 4446,
			"surah": 44,
			"ayat": 32,
			"tafsir": "Allah explained that He had chosen the Children of Israel over the intelligent people of their time; sent down to them the Divine books, sent messengers to them because He is All-Knowing of their capabilities and abilities. Several historical and contemporary facts have proven Allah's statement, as stated in the Al-Qur'an, surahh al-Jatsiyah\/45: 16 below. And indeed, to the Children of Israel We have given the Book (Torah), power and prophethood, We bestowed upon them good sustenance and We have preferred them over the nations (at that time). Historical facts show us that most of the prophets and apostles came from among the Children of Israel. The names of the prophets\/apostles from among the Children of Israel, which are listed in the Qur'an, begin with the Prophet Jacob. The prophets with the title Israel, are: (1) Jacob [Jacob], (2) Joseph [Joseph], (3) Moses,[Moses] (4) Aaron [Aron], (5) Daud [David], ( 6) Solomon [Solomon], (7) Ilyas [Eliah], (8) Ilyasa [Elisha], (9) Uzair [Ezra], (10) Zulkifli [Ezekiel], (11) Junus [Jonah] (12) Ayyub [Job], (13) Zakariyya [Zeccharia], (14) Yahya [John], and (15) Isa [Jesus]. If Israel's ancestors such as Prophet Abraham [Abraham], Prophet Lut [Lot], and Prophet Isaac, [Isaac] are included, then the number of prophets\/apostles from among Israel listed in the Qur'an is 18 people. From this historical fact it is clear that the Israelites have been blessed with many apostles\/prophets more than other nations. As a complement to the award of the prophetic\/apostolic degree, Allah swt revealed the Torah Scriptures to the Prophet Musa and the Psalms to the Prophet David, which became the basis of law for Israel. Then the Holy Bible was also revealed to the Prophet Isa, which was supposed to be the basis of law for the Children of Israel, but was later rejected by the Children of Israel. In Christianity, the Torah, Psalms and Gospels are used as a guide, and the three Scriptures are compiled into the Old Testament (for the Torah and Psalms) and the New Testament (for the Gospels). It is these three Scriptures that have resurrected or given birth to the Judeo-Christian civilization that exists in the world today. Historical facts also explain to us that the Prophet David and Prophet Sulaiman were very just kings, and their powers spanned a very wide area. During the time of King Solomon, his power stretched from Palestine in the west to the borders of India in the east. To the south to Yemen and to the north to the border of Syria. Current facts also show that many scientific pioneers, whether natural sciences, technology or social sciences, emerged from among the Children of Israel. The Nobel Laureates (Nobel Laurreates) are from among the Children of Israel. They are: Albert Einstein (physicist and cosmologist), Enrico Fermi (nuclear physicist), Erwin Schrodinger (quantum physicist), Max Born (quantum physicist), Raould Hoffman (organic physics chemist), Richard Feynmann ( Quantum Physicist). Besides that, philosophers, such as Karl Marx (founder of Marxian economic theory), Charles Darwin (founder of Evolution Theory) and Sigmund Freud (expert in psychoanalysis), also came from among the Children of Israel. The pioneers above have influenced the course of human history today. The facts above have been able to explain to us about the statement of Allah SWT, which is listed in the Al-Qur'an, surahs 44: 32 and 45: 16. Genetic factors are the key to human excellence, as well as excellence in the world of Botany (Plants) and Zoology (Animal). Human genetic factors are also influenced by the environment. If a population group of humans (Group-A) migrates to another group of humans (group-B), and if there is marriage between members of the two populations, then there will be gene flow either from group-A genes to group-B or on the contrary (see The New Encyclopaedia Brittanica, Vol. 19, Macropaedia, 2005, Gene in Populations, pp. 719-720) Gene flow is able to enrich genetic factors. Approximately 4000 years ago, Prophet Ibrahim's family, consisting of his wife: Sarah, his niece: Prophet Lut, migrated from the Ur region (Babylonia, or present-day Iraq), to the north to the Harran region (now entering the southeastern region of Turkey ). Then migrated again to the south, namely to Syria, Palestine; and on to Egypt, where he married Hajar. Ibrahim's family then migrated to Arabia and returned to Palestine. He lived there until his death. It was because of this frequent movement of places that this small group of Abraham's family became known as the Hebrew tribe, meaning those who moved from place to place. During this migration, the Abrahamic family group came into contact with many advanced civilizations at that time, such as the Babylonian, Assyrian, Canaanite and Egyptian civilizations. Gene flow will certainly occur during this era of the Abrahamic migration, so that the Hebrew tribe experiences genetic enrichment. What is unique is that this Hebrew tribe is still able to maintain its characteristics as a tribe that adheres to Tawhid; different from the surrounding communities. This custom of the Hebrew tribe, which was then passed on by the younger generation: the Children of Israel, was passed on from generation to generation, either by expanding the territory, as in the era of King Solomon, or when the Children of Israel experienced 'exile for nearly 2000 years in Europe,' starting from 70 AD until they returned to Palestine in 1948 AD Gene enrichment for nearly 4000 years of Israeli civilization occurred; this may be the advantage bestowed by Allah swt. to the Israelites."
		   },
		   {
			"id": 4447,
			"surah": 44,
			"ayat": 33,
			"tafsir": "Allah has bestowed upon the Children of Israel various pleasures that show their glory in the sight of Allah which can be a lesson for those who pay attention to them. Allah saved them from their enemies, covered them with a cloud above them, sent down on them manna and salwa and other blessings. Al-Hasan and Qatadah say, what is meant by the words: \"Al-Bala'ul Mubin\" is a real blessing as the word of Allah: And to give victory to the believers, with a good victory. (al-Anfal\/8: 17) And His words: We will test you with bad and good as a trial. (al-Anbiya'\/21: 35)"
		   },
		   {
			"id": 4448,
			"surah": 44,
			"ayat": 34,
			"tafsir": "Allah explained that the Meccan unbelievers did not believe in the existence of a resurrection day because according to their belief it was impossible for a dead person to come back to life. Such belief arises because their minds have been smeared with the taints of polytheism; the longer the stain grew thicker so that it covered their entire heart and mind. Then a sense of arrogance (arrogance) arises in their hearts accompanied by denial for no reason. They are of the opinion that what their ancestors considered to be true was also true according to them, even though the belief of their ancestors was solely based on conjectures that had no basis in truth. Their situation is like a person who has already said words, then he defends those words desperately without paying attention to whether what he says is true or false. They no longer use common sense in judging those words but merely follow their own desires. Their attitudes and beliefs are expressed in their words. \"Death is only once that is death in this world only, not twice, and we will never be resurrected.\" By saying that, it means they have rejected the statement of revelation which says that death is twice. Allah says: How can you disbelieve in Allah, even though you (were) dead, then He gives you life, then He causes you to die and then He brings you back to life. Then to Him you will be returned. (al-Baqarah\/2: 28) This verse explains that humans before living in the world were creatures that died, then they were born as living beings. After that, they met their death and experienced a second death. Then on the Day of Judgment they will be resurrected from the graves, and live a second time. In this verse, it is explained that polytheists acknowledge one life and one death, do not believe in life after death. Their denial of the resurrection day is groundless because their minds do not come to that provision. If Allah has the power to create all of this life, surely He also has the power to restore life after death and account for all deeds."
		   },
		   {
			"id": 4449,
			"surah": 44,
			"ayat": 35,
			"tafsir": "Allah explained that the Meccan unbelievers did not believe in the existence of a resurrection day because according to their belief it was impossible for a dead person to come back to life. Such belief arises because their minds have been smeared with the taints of polytheism; the longer the stain grew thicker so that it covered their entire heart and mind. Then a sense of arrogance (arrogance) arises in their hearts accompanied by denial for no reason. They are of the opinion that what their ancestors considered to be true was also true according to them, even though the belief of their ancestors was solely based on conjectures that had no basis in truth. Their situation is like a person who has already said words, then he defends those words desperately without paying attention to whether what he says is true or false. They no longer use common sense in judging those words but merely follow their own desires. Their attitudes and beliefs are expressed in their words. \"Death is only once that is death in this world only, not twice, and we will never be resurrected.\" By saying that, it means they have rejected the statement of revelation which says that death is twice. Allah says: How can you disbelieve in Allah, even though you (were) dead, then He gives you life, then He causes you to die and then He brings you back to life. Then to Him you will be returned. (al-Baqarah\/2: 28) This verse explains that humans before living in the world were creatures that died, then they were born as living beings. After that, they met their death and experienced a second death. Then on the Day of Judgment they will be resurrected from the graves, and live a second time. In this verse, it is explained that polytheists acknowledge one life and one death, do not believe in life after death. Their denial of the resurrection day is groundless because their minds do not come to that provision. If Allah has the power to create all of this life, surely He also has the power to restore life after death and account for all deeds."
		   },
		   {
			"id": 4450,
			"surah": 44,
			"ayat": 36,
			"tafsir": "Allah explained the challenges of the polytheists of Mecca to the Prophet. If what the apostle said was true, namely that there is a resurrection day, he should present evidence of the truth and he should revive their ancestors who had died before. According to them, if the Messenger of Allah could raise (from the grave) to revive their ancestors, this would certainly be proof of the existence of the day of resurrection. So Allah explained that He has the power to collect everything that is scattered, starting from solid objects, liquids, and air, from the smallest atoms to molecules, all are gathered together to form a human being. Do humans know where the food they eat, the clothes they wear, the household items they use, and so on come from? All come from faraway corners of the world, then are gathered by God in one place to meet the needs and desires of a human being. If such a thing could be done by God, of course it would be easier for Him to collect the scattered bones, the flesh that had crumbled to the ground, and the record of the deeds one has done, making it easier for Him to repeat something that once existed. at first time. From this information, it can be concluded that the resurrection day will definitely occur. It's just that the time is not yet known and only Allah knows it. What is clear, the day of resurrection will occur after the entire universe has experienced total destruction, including everything in it. That is why Allah does not serve the challenges of polytheists, because it is useless to answer them. The challenge was put forward by them only to cover up the contents and desires of their hearts. Whether their request is granted or not, they will not believe either."
		   },
		   {
			"id": 4451,
			"surah": 44,
			"ayat": 37,
			"tafsir": "Then Allah reminded them of the people who had been afflicted with calamity and Allah's punishment, because they were disobedient and did not heed the call of the apostles who were sent to them. Let them take care of themselves, lest Allah punish them as what happened to the former people, Allah stated that their situation was no better than the Tubba'. Sahl bin Sa'd said, I heard the Messenger of Allah say: Do not criticize Tubba' because he has converted to Islam. (Ahmad's history) Tubba' is the name for the kings of Himyar in Yemen. His people are called Tubba' people. They committed sins that exceeded the limits so that their country was destroyed by God. But some of his people are still alive wandering the surrounding countries. At first they were a people who had sufficiently high abilities and knowledge and had quite strong armies. When compared with the Tubba' people, the Meccan infidels were far behind from the Tubba' people. Allah stated that the disbelievers of Mecca were no better off than the people of 'Ad and Samud. These two peoples were also destroyed by Allah because of their arrogance and their denial of the resurrection day. At the end of this verse, Allah emphasizes that sunatullah has been applied to the previous people. They were all destroyed because they had drowned in the mire of disobedience. This incident should have been a lesson to the Meccan disbelievers if they would have learned one. In another verse, Allah confirms this sunna. Allah said: As sunatullah which (also applies) to those who have gone before (you), and you will not find changes in the sunnah of Allah. (al-Ahzab\/33: 62)"
		   },
		   {
			"id": 4452,
			"surah": 44,
			"ayat": 38,
			"tafsir": "Allah explains that the heavens and the earth and everything in them were not created in vain or by chance without purpose and purpose, but that everything was created according to Allah's plan and will. If you pay close attention to every life that exists on earth and all events in the heavens, you will certainly know that both animate and inanimate creatures of various levels, from the lowest level to the highest level, each benefit, there are provisions that applies to him, and there is also an appointed time for his life. As an example of a bird, it is hatched from an egg that comes from its mother. After being incubated for a certain time, a small, featherless chick emerges from the egg. From day to day the bird is fed by its mother, so that the baby bird grows gradually, its body becomes large and overgrown with feathers, its wings grow stronger. Then taught by their parents to fly, they fly from branch to branch, guided by their parents to find food and drink. As an adult, he begins to carry out his life tasks, looking for a partner to develop offspring. When it reaches its end, it dies like the other birds. If you pay attention, it seems as if the birds carry a mission in life. God ordained that the bird's food is insects, the insects eat and damage the plants planted by humans. It's as if the bird helps human business and life. Birds with their melodious voices and chirps please and soothe the hearts of those who hear them. Bacteria, a kind of soft and small animal, and also worms seem to be of no use at all. If you pay attention, the bacteria and worms eat garbage and dirt, both from humans and from other creatures. If the bacteria and worms were not there, then garbage and dirt would accumulate because they would not decompose, causing pollution that endangered human life. The deeper one contemplates and pays attention to nature and its events, the deeper the wisdom, use and purpose of its creation are known; the more you feel the love and purpose of Allah to make humans as caliphs on earth. It's just that most humans don't know themselves and feel they are the most powerful and the most capable. In another verse Allah says: So do you think that We created you playfully (without any intention) and that you will not be returned to Us. (al-Mu'minun\/23: 115) And His words: And We did not create the heavens and the earth and what is between them in vain. That is the opinion of unbelievers, so woe to those who disbelieve because they will go to hell. (shad\/38: 27)"
		   },
		   {
			"id": 4453,
			"surah": 44,
			"ayat": 39,
			"tafsir": "Then Allah emphasized that the heavens and the earth and their contents were not created, except (as creatures) subject to the correct provisions of Allah. Everything must comply with the provisions that apply and have been determined. If one of God's creatures deviates or does not comply with these provisions, then he will feel the consequences of that deviation. Like the banana tree which includes plants that grow in a place that has enough water. If it grows in dry land or desert, it will die. Likewise with fish; it is defined as living in water. If he jumps ashore, he will die too. This is God's law that applies to all of His creatures. From the information above, it can be concluded that the Creator is the One, Almighty and All-Wise substance, therefore all creatures created by Him must submit and obey His laws, both consciously and compulsorily. Because all creatures were created based on His will, then it is also based on His will that these creatures return to Him later. This happened because of His majesty and might. The various and countless creatures of God are signs of God's power that can be used as food for thought for those who want to seek the truth. By paying attention to the signs of His power, people can recognize and know how great and how extensive the creator's knowledge is. Then Allah regretted the attitude of the polytheists who did not want to understand the signs of Allah's greatness and power in this world. Their attitude was seen when they denied Muhammad's prophethood and denied the resurrection day. This attitude arises because of the pride and arrogance that is in them so that it covers the clarity of their thoughts. As a result, they grew further away from God's grace and sank further into the abyss of iniquity."
		   },
		   {
			"id": 4454,
			"surah": 44,
			"ayat": 40,
			"tafsir": "In this verse, Allah explains the events that took place on the day of reckoning by emphasizing that that day is the day that Allah has appointed to give decisions to all creatures regarding the rewards of good or bad deeds that have been done. On the day of the judgment, the polytheists were afraid and astonished at the fact that their assumptions while living in the world before were conjectures that did not contain the slightest truth. They used to deny the existence of the day of reckoning, but in reality it really happened. On that day, all creatures were driven to Padang Mahsyar and gathered to receive a fair decision from Allah. At that time, it was also proven that the idols that they worshiped and asked for help while living in the world could not benefit and help them, even those idols were put into hell with them. The children and families they used to be proud of in the world are no longer of any use and cannot help them avoid Allah's punishment. Allah says: Your relatives and your children will not benefit you on the Day of Judgment. He will separate between you. And Allah is Seeing of what you do. (al-Mumtahanah\/60: 3) And His words: Indeed, the day of judgment is a time that has been determined. (an-Naba'\/78: 17)"
		   },
		   {
			"id": 4455,
			"surah": 44,
			"ayat": 41,
			"tafsir": "On that day, the relationship between one person and another was cut off, there was no longer any relationship between children and their fathers, family members' relationships with other family members, let alone friends' relationships. The only thing that can help and determine the fate of humans is their own deeds that they have done while living in the world. Whoever plants a lot of good deeds, of course he will get abundant results from his good deeds. Conversely, whoever follows the desires of his lust, will surely get the punishment of hell. Nothing can reduce their punishment, even if it is their biological children, relatives or friends. Allah says: When the trumpet is blown, there will be no family ties between them on that day (the Day of Judgment), and they will not (also) ask each other. (al-Mu'minun\/23: 101) And the word of Allah: And no intimate friend even asks his friend, while they are looking at each other. (al-Ma'arij\/70: 10-11) At the end of this verse, Allah emphasizes that the Meccan infidels who still live wallowing in polytheism and misguidance, on the Day of Judgment they will not get help from anyone."
		   },
		   {
			"id": 4456,
			"surah": 44,
			"ayat": 42,
			"tafsir": "Allah mentions His servants who will not experience a terrible punishment, namely people who receive an abundance of His grace, they are people who are always grateful for His blessings, obey all commands and avoid all His prohibitions. They do not need defenders and helpers to save themselves from Allah's punishment, because their good deeds are enough to guarantee that they are Allah's servants who do not deserve the torments of hell. Then Allah declared that He is Mighty against all His enemies, nothing can stand against Him. He is also Most Merciful towards the enforcers of His religion and His servants who are always submissive and obedient to Him."
		   },
		   {
			"id": 4457,
			"surah": 44,
			"ayat": 43,
			"tafsir": "Allah describes how the torment is provided for the disbelievers who live in hell. In another verse, the condition of the zaqqum tree is described, that is, its corpse frightens those who see it, Allah says: Its corpse is like the heads of devils. So indeed, they do eat of it (the fruit of the tree), and they fill their stomachs with its fruit (zaqqum). (as-shaffat\/37: 65-66) How painful and sore the stomach of a person who eats the zaqqum fruit is described as the taste felt by someone who drinks boiling oil dirt, the heat is likened to hot boiling water which can crush and destroy the stomach people who drink it. After eating the zaqqum fruit, the disbelievers will be forced to drink very hot water again. Allah said: Then indeed, after eating (zaqqum fruit) they get a drink mixed with very hot water. (as-shaffat\/37: 67) That's how the disbelievers feel when they eat and when they drink."
		   },
		   {
			"id": 4458,
			"surah": 44,
			"ayat": 44,
			"tafsir": "Allah describes how the torment is provided for the disbelievers who live in hell. In another verse, the condition of the zaqqum tree is described, that is, its corpse frightens those who see it, Allah says: Its corpse is like the heads of devils. So indeed, they do eat of it (the fruit of the tree), and they fill their stomachs with its fruit (zaqqum). (as-shaffat\/37: 65-66) How painful and sore the stomach of a person who eats the zaqqum fruit is described as the taste felt by someone who drinks boiling oil dirt, the heat is likened to hot boiling water which can crush and destroy the stomach people who drink it. After eating the zaqqum fruit, the disbelievers will be forced to drink very hot water again. Allah said: Then indeed, after eating (zaqqum fruit) they get a drink mixed with very hot water. (as-shaffat\/37: 67) That's how the disbelievers feel when they eat and when they drink."
		   },
		   {
			"id": 4459,
			"surah": 44,
			"ayat": 45,
			"tafsir": "Allah describes how the torment is provided for the disbelievers who live in hell. In another verse, the condition of the zaqqum tree is described, that is, its corpse frightens those who see it, Allah says: Its corpse is like the heads of devils. So indeed, they do eat of it (the fruit of the tree), and they fill their stomachs with its fruit (zaqqum). (as-shaffat\/37: 65-66) How painful and sore the stomach of a person who eats the zaqqum fruit is described as the taste felt by someone who drinks boiling oil dirt, the heat is likened to hot boiling water which can crush and destroy the stomach people who drink it. After eating the zaqqum fruit, the disbelievers will be forced to drink very hot water again. Allah said: Then indeed, after eating (zaqqum fruit) they get a drink mixed with very hot water. (as-shaffat\/37: 67) That's how the disbelievers feel when they eat and when they drink."
		   },
		   {
			"id": 4460,
			"surah": 44,
			"ayat": 46,
			"tafsir": "Allah describes how the torment is provided for the disbelievers who live in hell. In another verse, the condition of the zaqqum tree is described, that is, its corpse frightens those who see it, Allah says: Its corpse is like the heads of devils. So indeed, they do eat of it (the fruit of the tree), and they fill their stomachs with its fruit (zaqqum). (as-shaffat\/37: 65-66) How painful and sore the stomach of a person who eats the zaqqum fruit is described as the taste felt by someone who drinks boiling oil dirt, the heat is likened to hot boiling water which can crush and destroy the stomach people who drink it. After eating the zaqqum fruit, the disbelievers will be forced to drink very hot water again. Allah said: Then indeed, after eating (zaqqum fruit) they get a drink mixed with very hot water. (as-shaffat\/37: 67) That's how the disbelievers feel when they eat and when they drink."
		   },
		   {
			"id": 4461,
			"surah": 44,
			"ayat": 47,
			"tafsir": "Then Allah explained what the angels should do to the inhabitants of hell. Allah ordered the Zabaniyah angels to grab and drag the inhabitants of hell and throw them into the midst of the blazing fire so that they were scorched. This expression is a picture for humans, how heavy and hard the torment that will be experienced by the inhabitants of hell later. After the Zabaniyah angel threw the inhabitants of hell into the midst of the blazing fire, he doused them with boiling hot liquid. Such torment was the heaviest torment they would ever feel and it felt even more evenly throughout their bodies. In another verse, it is also explained that such punishment, Allah says: So for those who disbelieve, clothes from fire (hell) will be made for them. Over their heads will be poured boiling water. With (boiling water) it will be destroyed what is in their stomachs and skins. And (the punishment) for them iron rods. (al-hajj\/22: 19-21)"
		   },
		   {
			"id": 4462,
			"surah": 44,
			"ayat": 48,
			"tafsir": "Then Allah explained what the angels should do to the inhabitants of hell. Allah ordered the Zabaniyah angels to grab and drag the inhabitants of hell and throw them into the midst of the blazing fire so that they were scorched. This expression is a picture for humans, how heavy and hard the torment that will be experienced by the inhabitants of hell later. After the Zabaniyah angel threw the inhabitants of hell into the midst of the blazing fire, he doused them with boiling hot liquid. Such torment was the heaviest torment they would ever feel and it felt even more evenly throughout their bodies. In another verse, it is also explained that such punishment, Allah says: So for those who disbelieve, clothes from fire (hell) will be made for them. Over their heads will be poured boiling water. With (boiling water) it will be destroyed what is in their stomachs and skins. And (the punishment) for them iron rods. (al-hajj\/22: 19-21)"
		   },
		   {
			"id": 4463,
			"surah": 44,
			"ayat": 49,
			"tafsir": "In a history it is explained that because of the revelation of this verse, Al-Amawy narrated in his book \"Al-Magazi\" that 'Ikrimah said, Rasulullah SAW once met Abu Jahl and told him, \"Woe to you\". This curse was repeated three times. Then Abu Jahl withdrew his hand from the hands of the Messenger of Allah and said, \"What are you threatening me with. You and your Lord will not be able to take any action against me. In fact, if you know, I am the mightiest and most noble person in the valley (Mecca) You already know that I am the most powerful among the inhabitants of the land of Batha over his people.\" Then Abu Jahl died in the Battle of Badr in humiliation. So this verse came down as if to satirize the words of Abu Jahl which were also the words of the Meccan infidels at that time. In this verse Allah describes the rebuke and ridicule uttered by the angel Zabaniyah to the inhabitants of hell. The angels told them that. \"Feel, O people who claim to be mighty and noble, feel the retribution for the sins you have done while living on earth; as if you are the one who determines everything, no one is more powerful than you.\" They think that worldly pleasures are real pleasures. Therefore they use their whole lives and lives to get that pleasure. They are only selfish and don't want to know that actually their lives depend on other humans. They even think that everything they get is solely the result of their own hard work, they forget that everything comes from Allah, the Most Gracious, the Most Merciful. Their actions show that they feel themselves powerful and mighty. But what they experienced on the Day of Judgment was the exact opposite of what they had previously suspected. They feel the excruciating torment and agonizing pain. They feel that there is no value in their dignity in front of the angels who are torturing them. They regretted themselves incessantly."
		   },
		   {
			"id": 4464,
			"surah": 44,
			"ayat": 50,
			"tafsir": "Allah explained that the disbelievers while living in the world were not sure that they would really be punished in the hereafter, they doubted the news. This doubt is reflected in their words and actions. They deny the existence of the resurrection day and the existence of the day of judgment. They deny the truth of the Koran, they even say the Koran was made by Muhammad and Muhammad was not a messenger of Allah, but a sorcerer and a sorcerer. However, after they were resurrected and brought to Padang Mahsyar to have their deeds weighed and thrown into the blazing fire, only then did they realize the consequences of their arrogance and stubbornness while living in this world. They will have endless regrets, even though they know that regrets at that time are useless. Allah says: On that day (when) they will be pushed into Hell with all their might. (It was said to them), \"This is the hell that you used to deny.\" (ath-thur\/52: 13-14)"
		   },
		   {
			"id": 4465,
			"surah": 44,
			"ayat": 51,
			"tafsir": "As a comparison between the rewards received by the believers and the punishment received by the disbelievers, the following verses describe the pleasures and happiness that the believers receive. The pleasures and happiness they get include: 1. They get a good place to return to with their Lord. In that place they are safe from all kinds of disturbances either in the form of disturbances to their own security or from disturbances to the security of their souls. They are under God's protection, nothing can shake God's protection. There are no words that hurt the heart, there are no other people's attitudes that can shake feelings, everything is pleasing to the ear, beautiful to look at, soothing and reassuring feelings, a beautiful place, comfortable air, clear springs emit water that excites people who live in it. 2. In that heaven, those who believe are given clothes made of silk, both silk that is smooth and soft, satisfying the hearts of those who wear it, as well as thick silk that is of various colors and warms the body. 3. They sat talking, facing each other in pleasant seats. From their faces, what radiated was a sense of incomparable happiness and a sense of satisfaction with the reward that God had given them. 4. They are awarded a life partner who accompanies them, in the form of a match or partner who is compatible and according to their wishes. Their soulmate is flawless and their heart has never been attached to someone else. 5. They are served various kinds of fruits and delicious food, they are endless and never boring. Thus the pleasure and happiness that will be obtained by the experts in heaven later. Actually, happiness and pleasure cannot be imagined by humans because there is no comparison in this life."
		   },
		   {
			"id": 4466,
			"surah": 44,
			"ayat": 52,
			"tafsir": "As a comparison between the rewards received by the believers and the punishment received by the disbelievers, the following verses describe the pleasures and happiness that the believers receive. The pleasures and happiness they get include: 1. They get a good place to return to with their Lord. In that place they are safe from all kinds of disturbances either in the form of disturbances to their own security or from disturbances to the security of their souls. They are under God's protection, nothing can shake God's protection. There are no words that hurt the heart, there are no other people's attitudes that can shake feelings, everything is pleasing to the ear, beautiful to look at, soothing and reassuring feelings, a beautiful place, comfortable air, clear springs emit water that excites people who live in it. 2. In that heaven, those who believe are given clothes made of silk, both silk that is smooth and soft, satisfying the hearts of those who wear it, as well as thick silk that is of various colors and warms the body. 3. They sat talking, facing each other in pleasant seats. From their faces, what radiated was a sense of incomparable happiness and a sense of satisfaction with the reward that God had given them. 4. They are awarded a life partner who accompanies them, in the form of a match or partner who is compatible and according to their wishes. Their soulmate is flawless and their heart has never been attached to someone else. 5. They are served various kinds of fruits and delicious food, they are endless and never boring. Thus the pleasure and happiness that will be obtained by the experts in heaven later. Actually, happiness and pleasure cannot be imagined by humans because there is no comparison in this life."
		   },
		   {
			"id": 4467,
			"surah": 44,
			"ayat": 53,
			"tafsir": "As a comparison between the rewards received by the believers and the punishment received by the disbelievers, the following verses describe the pleasures and happiness that the believers receive. The pleasures and happiness they get include: 1. They get a good place to return to with their Lord. In that place they are safe from all kinds of disturbances either in the form of disturbances to their own security or from disturbances to the security of their souls. They are under God's protection, nothing can shake God's protection. There are no words that hurt the heart, there are no other people's attitudes that can shake feelings, everything is pleasing to the ear, beautiful to look at, soothing and reassuring feelings, a beautiful place, comfortable air, clear springs emit water that excites people who live in it. 2. In that heaven, those who believe are given clothes made of silk, both silk that is smooth and soft, satisfying the hearts of those who wear it, as well as thick silk that is of various colors and warms the body. 3. They sat talking, facing each other in pleasant seats. From their faces, what radiated was a sense of incomparable happiness and a sense of satisfaction with the reward that God had given them. 4. They are awarded a life partner who accompanies them, in the form of a match or partner who is compatible and according to their wishes. Their soulmate is flawless and their heart has never been attached to someone else. 5. They are served various kinds of fruits and delicious food, they are endless and never boring. Thus the pleasure and happiness that will be obtained by the experts in heaven later. Actually, happiness and pleasure cannot be imagined by humans because there is no comparison in this life."
		   },
		   {
			"id": 4468,
			"surah": 44,
			"ayat": 54,
			"tafsir": "As a comparison between the rewards received by the believers and the punishment received by the disbelievers, the following verses describe the pleasures and happiness that the believers receive. The pleasures and happiness they get include: 1. They get a good place to return to with their Lord. In that place they are safe from all kinds of disturbances either in the form of disturbances to their own security or from disturbances to the security of their souls. They are under God's protection, nothing can shake God's protection. There are no words that hurt the heart, there are no other people's attitudes that can shake feelings, everything is pleasing to the ear, beautiful to look at, soothing and reassuring feelings, a beautiful place, comfortable air, clear springs emit water that excites people who live in it. 2. In that heaven, those who believe are given clothes made of silk, both silk that is smooth and soft, satisfying the hearts of those who wear it, as well as thick silk that is of various colors and warms the body. 3. They sat talking, facing each other in pleasant seats. From their faces, what radiated was a sense of incomparable happiness and a sense of satisfaction with the reward that God had given them. 4. They are awarded a life partner who accompanies them, in the form of a match or partner who is compatible and according to their wishes. Their soulmate is flawless and their heart has never been attached to someone else. 5. They are served various kinds of fruits and delicious food, they are endless and never boring. Thus the pleasure and happiness that will be obtained by the experts in heaven later. Actually, happiness and pleasure cannot be imagined by humans because there is no comparison in this life."
		   },
		   {
			"id": 4469,
			"surah": 44,
			"ayat": 55,
			"tafsir": "As a comparison between the rewards received by the believers and the punishment received by the disbelievers, the following verses describe the pleasures and happiness that the believers receive. The pleasures and happiness they get include: 1. They get a good place to return to with their Lord. In that place they are safe from all kinds of disturbances either in the form of disturbances to their own security or from disturbances to the security of their souls. They are under God's protection, nothing can shake God's protection. There are no words that hurt the heart, there are no other people's attitudes that can shake feelings, everything is pleasing to the ear, beautiful to look at, soothing and reassuring feelings, a beautiful place, comfortable air, clear springs emit water that excites people who live in it. 2. In that heaven, those who believe are given clothes made of silk, both silk that is smooth and soft, satisfying the hearts of those who wear it, as well as thick silk that is of various colors and warms the body. 3. They sat talking, facing each other in pleasant seats. From their faces, what radiated was a sense of incomparable happiness and a sense of satisfaction with the reward that God had given them. 4. They are awarded a life partner who accompanies them, in the form of a match or partner who is compatible and according to their wishes. Their soulmate is flawless and their heart has never been attached to someone else. 5. They are served various kinds of fruits and delicious food, they are endless and never boring. Thus the pleasure and happiness that will be obtained by the experts in heaven later. Actually, happiness and pleasure cannot be imagined by humans because there is no comparison in this life."
		   },
		   {
			"id": 4470,
			"surah": 44,
			"ayat": 56,
			"tafsir": "In this verse, Allah explains another pleasure that He will bestow in heaven later, that is, they will not experience death as they would in this world. They will live forever in heaven later. This means that the inhabitants of heaven are still in good health physically and spiritually and they have ascended to a dignity that God has not bestowed on other creatures, except for angels, namely eternal life full of happiness. In the hadith of the Prophet narrated by Muslim, the condition of the inhabitants of heaven is described, namely: \"It was narrated by Abu Hurairah and Abu Sa'id that the Messenger of Allah said, a caller called out, \"Indeed you will always be healthy, therefore you will not suffer from illness. forever; indeed you will live and will not die forever, and indeed you will remain young and will never experience aging forever and indeed you will feel pleasure and will not suffer forever.\" (Muslim History) At the end of the verse In this regard, Allah confirms that the inhabitants of heaven are protected from the torments of hell. Being protected from this punishment is one of the most precious pleasures, because if someone is released from a danger or sees someone else suffering while he himself is released from that danger and suffering, then he will feel a pleasure and feel that he has never committed a crime so he does not experience suffering."
		   },
		   {
			"id": 4471,
			"surah": 44,
			"ayat": 57,
			"tafsir": "All the blessings that the inhabitants of heaven receive are gifts from Allah which are given as a sign that He approves of the deeds they have done while living in the world, and as proof that they follow the revealed instructions that Allah conveys to His Messengers, obey the commands that they have to do and stay away from all the prohibitions they have to stop. That is what they receive as a result of the hard work they have done and the reward for their faith. The results they get are incomparable when compared to the results one has ever achieved while living in the world, enjoying the results of one's own sweat which is a pleasure in itself."
		   },
		   {
			"id": 4472,
			"surah": 44,
			"ayat": 58,
			"tafsir": "Allah explained the instructions and warnings that had been conveyed to the Meccan polytheists as conveyed by His Messenger, Muhammad saw, in the form of His revelations which were revealed in a language they already understood, namely their own language, Arabic. This was intended so that the polytheists of Mecca could easily take instructions and lessons from the main points of the Islamic religion, parables and stories of the ancient people contained in the revealed Qur'an that had been revealed. By reading the Qur'an they will meditate on the verses that tell people to pay attention to the signs of Allah's power and greatness in the events of the heavens and the earth and what is between the two, as well as the evidence of the Day of Resurrection. With this guidance and warning, it is hoped that they will repent, return to the right path, acknowledge and seek the essential truth by abandoning the habits of their forefathers whose errors were evident. However, because of their frozen hearts because of their arrogance and arrogance, they cannot accept the guidance and truth that the Qur'an presents to them, so they remain in darkness and astray."
		   },
		   {
			"id": 4473,
			"surah": 44,
			"ayat": 59,
			"tafsir": "That is why Allah allowed the polytheists of Mecca to go astray in their polytheism, letting them wait for Allah's provision at a predetermined time, and they will surely witness for themselves who is right later, those who always associate partners with God and commit sins or are the believers who follow the teachings of the revelation conveyed by the Prophet Muhammad. If they were willing to acknowledge the truth of the Qur'an, they would surely be sure that victory would surely be won by those who follow the monotheistic religion who strive and do good deeds to seek the pleasure of Allah. Allah said: Verily, We will help Our messengers and those who believe in the life of the world and on the day when the witnesses appear (the Day of Resurrection), (ie) the day when apology is of no use to the wrongdoers and they receive anathema and bad place to live. (Gafir\/40: 51-52) While waiting for this provision from Allah, there were differences in attitudes and beliefs between the followers of the apostle and the polytheists of Mecca. The followers of the apostles wait for the promise of victory from Allah with patience and trust. They believe that Allah will certainly fulfill His promise, namely winning Islam and Muslims in the world and bestowing eternal pleasure and happiness in the hereafter. Therefore, they are never afraid or afraid, dying and living are the same for them because they have surrendered everything that is in them, body and soul, property and life to God. On the other hand, the polytheists are waiting with feelings of worry and fear. They are very worried about being destroyed by the Muslims. Every time they see developments, progress, and the victory of the Muslims over them, the more they worry about themselves. They are very afraid of the revenge of the Muslims against them. Because of that they tried their best and devoted everything in their power to overcome the progress and victory of the Muslims. This can be seen in their efforts as they have attempted in the Ahzab War, the Hudaibiyah agreement and so on. Actually, in their hearts the real truth is imagined, but because of their pride and arrogance, they keep distancing themselves from the truth of the Qur'an."
		   }
	]
}
