{
	"tafseer": [
		{
			"id": 4584,
			"surah": 48,
			"ayat": 1,
			"tafsir": "Commentators differ on the meaning of the word \"victory\" (fath) in this verse. Some of them argue the conquest of Mecca. Some argue, the conquest of the countries that were under the rule of the Romans, and some are of the opinion, Peace of Hudaibiyyah. Most commentators follow this last opinion. Among them are: 1. According to Ibn 'Abbas, the victory in this verse is the Peace of Hudaibiyyah because that peace was the cause of the conquest of Mecca. 2. It was narrated from Ibn Mas'ud that he said, \"You are of the opinion that what is meant by victory in this verse is the conquest of Mecca, while we are of the opinion of the Peace of Hudaibiyyah. In another history it is explained that this surahh al-Fath was revealed in a place located between Mecca and Medina, after the Hudaibiyyah Peace took place, starting from the beginning to the end of the surahh. 3. Az-Zuhri said, \"There is no greater victory than the victory brought about by the Hudaibiyyah Peace in the history of the spread of Islam during the time of the Prophet. Since the occurrence of the peace, there was a direct relationship between the Muslims and the polytheists of Mecca. Muslims can step back into their hometowns and meet their long-lost families. In such relationships and associations, the disbelievers have heard directly the conversations of the Muslims, both those carried out by fellow Muslims and those carried out with infidels so that within three years, many of them converted to Islam. Thus the process lasted until the time of the conquest of Mecca, the Muslims could enter the city without bloodshed. Hudaibiyyah is the name of a village, about 30 km west of Mecca. The name comes from the name of a well in the village. The name of the village was then used as the name of an agreement between the Muslims and the Meccan infidels, which took place in the month of Zulkaidah in the year 6 H (February 628 AD) in that village. In the sixth year of the Hijriah, the Prophet Muhammad and his Muslim community, which numbered nearly 1,500 people, decided to leave for Mecca to release their longing for the Baitullah, their Qibla, by performing Umrah and to release their longing for the relatives they had long left behind. To dispel the untruthful prejudices of Meccan infidels, Muslims wear ihram clothes, bringing animals to be slaughtered which will be donated to the Meccans. They also departed without weapons, except for weapons that people usually carry on long journeys. Arriving at Hudaibiyyah, the large group of Muslims met Basyar bin Sufyan al-Ka'bi. Basyar told the Prophet that the Quraysh had known the arrival of him and the Muslims. Therefore, they have prepared troops and weapons to welcome the arrival of the Muslims. They are gathering in dzi thuwa. Rasulullah saw then sent 'Uthman bin 'Affan to meet the leaders and dignitaries of Quraysh to convey the purpose of his arrival with the Muslims. So went 'Uthman. The Muslims were waiting for 'Uthman's return, but he did not come back. This happened because 'Uthman was detained by Quraysh officials. Then the news spread among the Muslims that 'Uthman had been killed by the leaders of Quraysh. Hearing the news, many Muslims have lost their patience. The Prophet swore to fight against the infidels of Quraysh. Witnessing this, the Muslims promised him that they would fight with the Prophet against the infidels. Only one person did not pay allegiance, namely Jadd bin Qais al-Ansari. The pledge of the friends pleases Allah as mentioned in verse 18 of this surah. Therefore, the bai'at is called Bai'atur-Ridhwan which means \"loyalty that is pleased\". This Bai'atur-Ridhwan shook the hearts of the Meccan polytheists for fear that the Muslims would seek revenge for 'Uthman's death, as they had expected. Therefore, they sent messengers who stated that the news about the killing of 'Uthman was not true and they came to negotiate with Rasulullah saw. The negotiations resulted in a peace called the Hudaibiyyah Agreement (Sulhul-Hudaibiyyah). The contents of the peace are: 1. Stopping war for 10 years. 2. Every Quraysh who comes to the Messenger of Allah without the permission of the guardian who takes care of him must be returned, but every Muslim who comes to the Quraysh, is not returned to his guardian. 3. The Arab tribes may choose between entering into an agreement with the Muslims or with the polytheists of Mecca. In connection with this, the Khuza'ah clan chose the Muslims, while the Bani Bakr group chose the polytheists of Mecca. 4. The Prophet Muhammad and his entourage were not allowed to enter Mecca in the year the agreement was made, but they were only allowed to enter Mecca in the following year within three days. During those three days, the Quraysh would empty Mecca. The Prophet Muhammad and the Muslims were not allowed to carry full weapons into the city of Mecca. After the agreement, Rasulullah saw and the Muslims returned to Medina. The peace agreement was opposed by some of the companions because they considered the agreement to be detrimental to the Muslims and more profitable to the polytheists of Mecca. At first glance, the opinion of some of the Companions is true, as mentioned in point two and point four. In the agreement it was stipulated that every polytheist who came to the Prophet without the permission of his guardian must be returned, on the other hand, if a Muslim comes to a Quraysh he will not be returned. In addition, Muslims were prohibited from entering the city of Mecca that year. Even if it is permissible in the following year, but only within three days, while the city of Mecca is their own hometown. At that time, the Muslims felt they had enough strength to fight and defeat the polytheists, why not just fight them? It was different with Rasulullah SAW and other companions, who looked at him from a political perspective and had far-sighted views. In accordance with inspiration from Allah, he believed that the agreement would be the starting point for the victory that would be obtained by the Muslims in the future. Even though points two and four of the agreement seemed to be detrimental to the Muslims, he was sure that there would not be any Muslims who would become disbelievers again, because they had received many trials from their Lord. His belief was reflected in his attitude after the agreement was made. If studied, then what the Prophet believed in could be understood, including: 1. With the existence of the Hudaibiyyah Agreement, it means that the Meccan polytheists indirectly acknowledged the de facto government of the Muslims in Medina. So far, they have stated that the Prophet and the Muslims were nothing more than a group of rebels who wanted to impose their will on them. 2. By allowing the Prophet Muhammad and the Muslims to enter the city of Mecca in the coming year to carry out worship around the Kaaba, it implies that the polytheists of Mecca have recognized Islam as a religion that has the right to use the Kaaba as their house of worship. and this also means that they have recognized Islam as one of the world's religions. 3. With the occurrence of this agreement, it means that the Muslims have obtained security guarantees from the polytheists of Mecca. This allowed them to organize and foster an Islamic society and carry out Islamic da'wah to all corners of the Arab lands, without being disturbed by the polytheists of Mecca. So far, every attempt of the Prophet always get obstacles and distractions from them. Since then, the Prophet has been able to send letters inviting kings in the Arabian Peninsula and its surroundings to convert to Islam, such as the Persian Kisra, Muqauqis from Egypt, the Roman emperor Heraclius, the king of Gassan, the dignitaries of Yemen, the king of Najasyi (Negus) from Ethiopia and so on. In the eighth year of the Hijri, the Quraysh attacked the Bani Khuza'ah, allies of the Muslims. In the Hudaibiyyah Agreement it is stated that an attack on one of the allies of the Muslims means an attack on the Muslims. This means that the attacking party has unilaterally violated the agreement that has been made. Therefore, in the eighth year of Hijriah on the 10th of Ramadan, the Prophet went with 10,000 Muslims to Mecca. Upon hearing of the arrival of the Muslims in such a large number, the Quraysh became terrified and afraid, so that Abu Sufyan, the leader of the Quraysh at that time, immediately met the Prophet outside Mecca. He declared to the Prophet that he and all his people surrendered to him and he himself declared that he converted to Islam right away. With Abu Sufyan's statement, the Messenger of Allah together with the Muslims entered the city of Mecca in a safe, peaceful and serene atmosphere, without bloodshed. Thus, the victory of Rasulullah SAW and the Muslims was complete, which occurred two years after the Hudaibiyyah Agreement. Since then, Islam spread easily to all corners of the Arabian Peninsula. Since then, the Islamic government began to spread its wings to areas controlled by the big powers at that time, such as the areas of the Roman empire and the Persian empire."
		   },
		   {
			"id": 4585,
			"surah": 48,
			"ayat": 2,
			"tafsir": "This verse explains that with the occurrence of the Hudaibiyyah Agreement, it means that Allah has perfected His infinite blessings upon the Prophet Muhammad. These blessings are: 1. Forgiving the sins of the Prophet Muhammad that were committed before and after the Hudaibiyyah Agreement. Of course what is meant by sin in this verse is that which does not reduce or impair his prophetic function because Muhammad saw as a prophet and messenger was preserved from committing grave sins. 2. The spread of Islam throughout the Arabian Peninsula, even to several areas of the Roman Empire. This made Rasulullah SAW the person who was responsible for dealing with religious matters and also as the head of state. In history, this has rarely happened. Among the prophets and apostles who also served as heads of state, only Prophet David and his son, Prophet Sulaiman. 3. Guiding Rasulullah saw to the straight path and pleased Him. 4. Help the Messenger of Allah from disturbances and enemy attacks so that no one can attack and kill him. According to Mujahid, Sufyan ats-sauri, Ibnu Jarir, al-Wahidi, and several other scholars, what is meant by giving forgiveness in this verse is to forgive the sins of the Prophet before and after he was appointed as an apostle. Az-Zamakhsyari, in the tafsir of al-Kasysyaf, says, \"Allah made the conquest of Mecca a cause for the forgiveness of Muhammad's sins, because Allah made him the cause of the Messenger of Allah getting four things, namely: forgiveness of sins, perfection of favors, guidance to the straight path, and glorious victory.\""
		   },
		   {
			"id": 4586,
			"surah": 48,
			"ayat": 3,
			"tafsir": "This verse explains that with the occurrence of the Hudaibiyyah Agreement, it means that Allah has perfected His infinite blessings upon the Prophet Muhammad. These blessings are: 1. Forgiving the sins of the Prophet Muhammad that were committed before and after the Hudaibiyyah Agreement. Of course what is meant by sin in this verse is that which does not reduce or impair his prophetic function because Muhammad saw as a prophet and messenger was preserved from committing grave sins. 2. The spread of Islam throughout the Arabian Peninsula, even to several areas of the Roman Empire. This made Rasulullah SAW the person who was responsible for dealing with religious matters and also as the head of state. In history, this has rarely happened. Among the prophets and apostles who also served as heads of state, only Prophet David and his son, Prophet Sulaiman. 3. Guiding Rasulullah saw to the straight path and pleased Him. 4. Help the Messenger of Allah from disturbances and enemy attacks so that no one can attack and kill him. According to Mujahid, Sufyan ats-sauri, Ibnu Jarir, al-Wahidi, and several other scholars, what is meant by giving forgiveness in this verse is to forgive the sins of the Prophet before and after he was appointed as an apostle. Az-Zamakhsyari, in the tafsir of al-Kasysyaf, says, \"Allah made the conquest of Mecca a cause for the forgiveness of Muhammad's sins, because Allah made him the cause of the Messenger of Allah getting four things, namely: forgiveness of sins, perfection of favors, guidance to the straight path, and glorious victory.\""
		   },
		   {
			"id": 4587,
			"surah": 48,
			"ayat": 4,
			"tafsir": "Allah bestows His grace by instilling peace in the hearts of believers, especially in the hearts of the companions who joined the Messenger of Allah in the Hudaibiyyah Agreement. With that peace of mind, the friends obey Allah's law and the decisions of His Messenger. With that calmness of heart, Allah adds to the faith of the friends. Imam al-Bukhari concluded based on this verse that faith is not the same in every believer's heart, some are thick, some are medium, and some are thin. Besides that, faith can also increase and decrease in a person. Some commentators are of the opinion that what is meant by decreasing calm in the hearts of believers is eliminating the differences of opinion that occurred among the companions of the Prophet concerning the Hudaibiyyah Agreement. With the emergence of sobriety, all the companions of the Prophet finally followed the decision of the Prophet. It was narrated that 'Umar bin al-Khatthab was one of the friends who did not agree with the Hudaibiyyah Agreement so he said, \"Are we not on the right path, while they are on the wrong path?\" By the grace of Allah, the differences of opinion disappeared. The companions realized the truth of the Prophet's opinion, including 'Umar bin al-Khaththab who finally agreed with the Prophet's opinion. This verse can mean general and can also mean special. In a general sense, this verse means that Allah will instill equanimity, patience and steadfastness in every believer so that there will be no more differences of opinion between them which can cause divisions. Only people who lack faith are easily at odds with other believers. While the special meaning is that Allah creates peace of mind in everyone who is with the Prophet Muhammad in facing the Hudaibiyyah Agreement. It is this special meaning that is meant in this verse because this is in accordance with the cause of its descent. Allah explains that it is He who governs and controls the heavens and the earth. He has \"soldiers of the heavens\" and \"soldiers of the earth,\" who can carry out whatever He wills. Not a single one of His soldiers disobeyed His orders. Among these \"soldiers\" there are angels, animals, hurricanes, great earthquakes, floods, various kinds of diseases, and so on. If Allah wills, He can destroy everything with just one kind of army, including destroying Satan. But He did not do that, in fact He ordered the Muslims to strive and fight in His way. Everything is determined in accordance with the wisdom, goals, and benefits that He knows, while humans may not know it."
		   },
		   {
			"id": 4588,
			"surah": 48,
			"ayat": 5,
			"tafsir": "It was narrated by Imam Ahmad and al-Bukhari that Anas bin Malik asked the Messenger of Allah about the revelation of verses 1 to 3 of this surah, on his way back to Medina, after the Hudaibiyyah Agreement. Rasulullah saw said, \"Indeed, verses have come down to me that I like more than what is on the surface of this earth.\" Then he read it. The friends said, \"It would be nice O Messenger of Allah, in fact it has been explained what will be bestowed upon you, but what will Allah bestow upon us?\" Then came down this verse, which explains the grace that will be received by those who believe. The Muslims who pledged allegiance to the Prophet Muhammad and accepted the Hudaibiyyah Agreement obtained an even greater favor from Allah by washing away the sins of the mistakes they had made and providing a happy place for them in heaven. It was a big win for them."
		   },
		   {
			"id": 4589,
			"surah": 48,
			"ayat": 6,
			"tafsir": "The pledge of the Muslims to the Prophet, and the acceptance of the Hudaibiyyah Agreement, was used by Allah as a reason for: 1. Punish the hypocrites and polytheists, both men and women, in the form of defeat in the world in addition to causing confusion, fear and sadness on themselves because they saw the victory of the Muslims over them, some of them were taken prisoner by those who believed, some of their families were killed in war, and so on. At first they thought they would definitely win and defeat the Muslims, even being able to kill all of them. They believed at that time that their situation was better than that of the Muslims. But what happened was the other way around and all their regrets were of no use. 2. Wrath them so that their lives are wretched in this world and in the hereafter. 3. Cursing them so that they are tormented to live in the world. 4. Put them in hell. In this verse, \"the hypocrites\" are mentioned before \"the polytheists\". The lesson is to emphasize that hypocrites do more harm to believers than polytheists. The hypocrites are enemies that are invisible and difficult to deal with, while the polytheists are enemies that are clearly visible so that they are easy to deal with. With regard to the attitude of these hypocrites, Allah says: Even (at first) you thought that the Messenger and the believers would never return to their families forever and be made to feel such beauty in your heart, and you have been prejudiced with bad prejudice, therefore you become a people who perish. (al-Fath\/48: 12) Besides disasters, hypocrites and polytheists will also receive Allah's wrath, be kept away from His mercy, and be provided with Hell Hell which burns them up in the afterlife. Hell Hell is the worst place prepared for them."
		   },
		   {
			"id": 4590,
			"surah": 48,
			"ayat": 7,
			"tafsir": "It is narrated that after the Hudaibiyyah Agreement, Ibn Ubayy said, \"Did Muhammad think that after the Hudaibiyyah peace, he had no more enemies? Wasn't there still the Persian and Roman empires?\" So this verse came down which explains that Allah has an army of the heavens and the earth, which can defeat any army or force if He wills it. Hypocrites and polytheists will not be able to challenge the power and will of Allah because He has a strong army in the heavens and on earth, which consists of angels, jinns, humans, terrible lightning, strong winds, floods, terrible earthquakes , etc. All of these can be deployed by Allah whenever He wants to destroy those who disbelieve in Him. In verse 4 it has also been explained that Allah has armies in the heavens and on earth. In this verse the words are repeated. Its function is to explain that Allah has soldiers to convey mercy and reduce His punishment. Verse 4 describes soldiers who give favors, while this verse describes soldiers who send down punishment. At the end of this verse it is explained that Allah is Mighty, there is nothing that can beat and match Him. He is All-Wise performing all kinds of actions according to their benefits and benefits."
		   },
		   {
			"id": 4591,
			"surah": 48,
			"ayat": 8,
			"tafsir": "Allah stated that in fact He sent Muhammad as a witness for his people about the truth of Islam and the success of the da'wah that he was doing. The prophet is in charge of conveying Allah's religion to all human beings, as well as delivering good news to those who want to follow the religion he conveys. Those who follow the Apostle's invitation will be given a double reward in the form of heaven in the hereafter. The Prophet is also tasked with giving a warning to those who deny his call to follow Allah's religion that they will be put into hell as a result of their denial."
		   },
		   {
			"id": 4592,
			"surah": 48,
			"ayat": 9,
			"tafsir": "Allah does this so that people believe in Him and in Muhammad saw, as the apostle sent by Him; defending and upholding His religion by conveying it to other humans; glorify Him by magnifying His name; and glorify Him by praising and purifying Him from qualities that are not worthy of Him every morning and evening."
		   },
		   {
			"id": 4593,
			"surah": 48,
			"ayat": 10,
			"tafsir": "This verse explains Allah's statement regarding the pledge of allegiance made by the Companions to the Messenger of Allah that this also means taking allegiance to Allah. Bai'at is a pledge of allegiance or pledge made by a person or several persons which contains an acknowledgment to obey someone, for example because he is appointed as a leader or caliph. What is meant by bai'at in this verse is Bai'atur Ridhwan which took place in Hudaibiyyah which was carried out by the companions under the Samurah tree. The companions at that time promised the Prophet that they would not run away from the battlefield and would fight to the last drop of blood against the polytheists of Mecca, if the news was conveyed to them that 'Uthman bin 'Affan who was sent by the Messenger of Allah had indeed been killed. Meccan polytheists. It was narrated by al-Bukhari from Qatadah that he said to Sa'id bin al-Musayyab, \"How many people are following Bai'ah ar-Ridhwan?\" Sa'id replied, \"One thousand and five hundred people.\" There are also those who think the number was one thousand four hundred people. In this verse, it is explained how the companions took allegiance to the Messenger of Allah, namely by placing the hand of the Prophet on the hands of those who promised. In such a position, say the word bai'at. The meaning of the sentence \"Allah's hand is on their hands\" is to state that making a promise with the Prophet (s) is the same as making a promise to Allah. Allah's hand in the context of this verse is a figurative meaning, because Allah is the Holy of Holies from all the characteristics that resemble His creatures. Therefore, there are commentators who interpret the hand here as power. Then explained the consequences that would be experienced by those who broke the agreement, namely they would bear a great sin. This big sin was imposed on them because they did not want to pay allegiance to the Prophet, while the Muslims personally committed allegiance to him. On the other hand, it also explains the reward that will be obtained by those who fulfill their allegiance. They will get multiple rewards in the hereafter and their place will be a paradise full of pleasures."
		   },
		   {
			"id": 4594,
			"surah": 48,
			"ayat": 11,
			"tafsir": "Allah explained to Rasulullah SAW that some Arab tribes living in the desert who did not go to Mecca to perform Umrah would say to him, \"We are not going with you to Mecca to perform Umrah because we are busy taking care of our work, property and family. Meanwhile we don't have a maid who will help us take care of all that after we leave with you. Therefore, ask forgiveness for us from your God, by reason of our busyness.\" When Rasulullah SAW decided to go for Umrah to Mecca in the sixth year of Hijrah, he invited the Muslims to join him. The more people who go with him, the greater the meaning because with a large number of Muslims it will create a sense of trepidation in the hearts of the polytheists of Mecca so that they accept Muslims into Mecca, and Umrah can be carried out in a safe atmosphere. Among the Muslims invited were Arab tribes who lived in the desert around the city of Medina, such as the Juhainah, Muzainah, Gifar, Asyja', ad-Dil, and Aslam tribes. Rasulullah saw told them that the purpose of going to Mecca was solely to perform the Umrah pilgrimage and to see the family that had been abandoned for a long time. Therefore, going to Mecca is not fully armed as going to war, except carrying weapons that are usually carried by travelers. In addition, livestock were also brought for food on the way and to be presented to the people of Mecca. Even so, they still refused the Prophet's invitation with the reasons they stated above, even though they hid the real reason. Even if the desert Arabs try to hide their real reasons, Allah knows everything. Therefore, Allah told it to the Prophet. Their real reason was their suspicion that Rasulullah SAW and the Muslims would be defeated and completely annihilated by the polytheists of Mecca. If they had joined the Messenger of Allah, of course they would have lost and been annihilated as well. The reasons and contents of their hearts were conveyed by Allah to Rasulullah SAW before they went to him to ask Allah for forgiveness for their refusal. Thus, the Messenger of Allah already knows the true contents of their hearts when they face them. Allah then taught the Messenger of Allah the exact answer that would be conveyed to them when they asked him to ask Allah for forgiveness for their sins. Allah taught the Prophet by ordering him to say to the Arabs living in the desert as a rejection of their request, \"O Arabs living in the desert, you refuse my invitation to go to Mecca solely because you want to avoid the disaster and calamity that you expect to befall you. Who among you can resist the power of Allah if He wishes to bring calamity and calamity upon you and who else can avoid something that He will give to someone, if He so wills? Therefore, it is not appropriate for you to give excuses that you are busy taking care of your business, wealth, and looking after your family as a reason for not going with me to Mecca. If Allah wants to destroy all that you have, no one can defend it, even if it is guarded it is you.\" This verse is also a warning to people who always put forward \"worldly activities\" as an excuse for leaving the religious obligations that Allah has imposed on them and for violating the prohibitions Allah has warned them about. Let Muslims really believe that worldly activities are only to achieve worldly pleasures that are temporary in nature, while jihad fi sabilillah will produce happiness in eternal life in the hereafter. At the end of this verse, Allah confirms that He is All-Knowing of everything that is done by His servants, including the false reasons put forward by someone to avoid Allah's commands. Therefore, He will give every human being a just and equal reward for all the sins and deeds that have been done."
		   },
		   {
			"id": 4595,
			"surah": 48,
			"ayat": 12,
			"tafsir": "In this verse, Allah explains that the desert Arabs have been consumed by Satan's tricks. The notion that the Prophet and his companions would be destroyed, had actually been instilled by Satan in his heart, so that it had become their opinion and belief. Therefore, they were very afraid to go with the Prophet to Mecca. Yet if they think about it deeply, then their reluctance will actually be the cause of their destruction in this world, let alone in the hereafter. The place prepared for them is a fiery hell."
		   },
		   {
			"id": 4596,
			"surah": 48,
			"ayat": 13,
			"tafsir": "In this verse it is stated that whoever does not believe in Allah and His Messenger, Allah will provide him with a burning hellfire as a reward for their denial."
		   },
		   {
			"id": 4597,
			"surah": 48,
			"ayat": 14,
			"tafsir": "Allah's threat to punish the disbelievers is not a threat that is made up and difficult to carry out, but something that will really happen and it will be easy for Allah to carry out because only He is the ruler of the heavens and the earth and all that is in them. Only He owns, regulates, manages, establishes the laws that apply to him, and maintains the continuity of his existence with perfect wisdom. He is also the one who has the right to forgive, help, and punish whoever He wills. He is Allah, the Most Forgiving and Most Eternal of His Mercy. This verse indicates that even though the Arabs who lived in the desert had refused and denied the Messenger of Allah's invitation to go to Mecca and made up excuses for their absence, Allah is Forgiving to those servants who want to repent to Him with repentance. which is true. Therefore, it is up to them whether they will repent in the opportunity that Allah has given them or they will remain disbelievers. He will bestow countless graces on everyone who sincerely worships Him."
		   },
		   {
			"id": 4598,
			"surah": 48,
			"ayat": 15,
			"tafsir": "The Bedouin Arabs who did not participate in making the pilgrimage to Mecca with the Prophet said to the Prophet Muhammad when he was going to Khaibar, \"O Muhammad, give us the opportunity to come with you to Khaibar.\" Their willingness to go to Khaibar was because they believed that the Khaibar War would be won by the Muslims, so they would get a lot of spoils in that battle. Rasulullah SAW and his friends went to the battlefield of Khaibar in the seventh month of Muharram, when he returned from the Hudaibiyyah Agreement. In that war, the Muslims won and obtained a lot of booty from the Jews. In one authentic hadith, it is explained that Allah has promised the companions who accompanied the Messenger of Allah to Hudaibiyyah that they would receive victory in the Battle of Khaibar and a lot of loot. This promise indirectly rejected the willingness of the Bedouin Arabs who wanted to join the war with the Prophet Muhammad because this war was specifically participated in by the Muslims who joined Hudaibiyyah. Because their intentions were not good, Allah ordered the Apostle to say to people who were willing to go to Khaibar, but did not go to Hudaibiyyah, \"You don't need to come with us to Khaibar because you already know us. You only want to come if will benefit yourself, whereas if there is no benefit even if there is only misery and calamity, then you don't want to go with us, and even put forward various reasons. Thus Allah has opened the secret of your heart to us before we returned from Hudaibiyyah and Allah have declared to us that the spoils of Khaibar will only be accepted by those who are coming to Hudaibiyyah, that is why you cannot come with us.\" The Bedouin Arabs replied, \"O Muhammad, you are telling lies against us. Actually Allah did not say that. You are telling lies because of the envy that has arisen in your hearts towards us.\" At the end of this verse it is explained that the Bedouin Arab hypocrites who say this are people who do not know the religion of Allah. They also do not know the purpose of the jihad order. Allah ordered jihad not because He was unable to destroy them, but to distinguish between those who believe and who are disbelievers."
		   },
		   {
			"id": 4599,
			"surah": 48,
			"ayat": 16,
			"tafsir": "This verse seems to test the hearts and will of the Bedouin Arab hypocrites, by ordering the Prophet to say that if they really want to join the ranks of the Muslims, then they will be invited to fight against people who have great power. They are required to fight the enemy unless they surrender and embrace Islam. Then the Bedouin Arabs were promised that if they joined the jihad, Allah would bestow His blessings on them, both in this world in the form of victory and loot, and in the hereafter in the form of a paradise full of pleasures. On the other hand, if they disobey Allah's commands, do not want to wage jihad, and carry out those orders, they will receive a painful punishment in the hereafter. With this verse, it is as if Allah is giving them the opportunity to repent by accepting the invitation to jihad. However, on their faces there was refusal and fear to accept the invitation and opportunity to repent. The meaning of \"people who have power\" here is the Meccan infidels. Meanwhile, according to some others it means the Hawazin and Bani hanifah tribes in Nejed."
		   },
		   {
			"id": 4600,
			"surah": 48,
			"ayat": 17,
			"tafsir": "It was narrated from Ibn 'Abbas that when the verse which threatened people who did not want to join in the jihad with the Prophet was revealed, the people who were paralyzed said, \"What about us, O Messenger of Allah?\" In response, this verse came down. In this verse, Allah explains that the reasons that are permissible for a person not to join the war are blindness, lameness, physical disability, or illness. Muqatil said, \"The Prophet justified the reasons for sick people not accompanying the Prophet to Hudaibiyyah with this verse as the reason.\" Then Allah gives encouragement and encouragement to believers that whoever obeys Allah and His Messenger, and fulfills the call of jihad in His way, will be rewarded with a paradise full of pleasures. On the other hand, those who deny Allah and His Messenger and do not want to join in the jihad with other Muslims, Allah will punish them with a painful punishment."
		   },
		   {
			"id": 4601,
			"surah": 48,
			"ayat": 18,
			"tafsir": "Allah conveyed to Rasulullah saw that He had accepted the allegiance that had been made by his companions to him at the time of Bai'ah ar-Ridhwan. The companions who took Bai'at at that time were approximately 1,400 people. According to history, there was a person who accompanied the Messenger of Allah, but did not take allegiance, namely Jadd bin Qais al-Ansari. He is a hypocrite. The friends who took Bai'at had promised to keep all the promises they had made even though it would result in their own death. This is mentioned in a hadith narrated by al-Bukhari from Salamah bin al-Akwa', that he said: I had made allegiance to the Messenger of Allah, then I walked towards the shadow of a tree (Samurah). When the people were few, the Holy Prophet said, \"O Ibn al-Akwa', did you not take Bai'at?\" I said, \"O Messenger of Allah, I have taken Bai'at.\" Rasulullah said, \"This one too.\" So I took Bai'at a second time. I (Yazid bin Abu 'Ubaid, one of the sanad of this hadith) asked Salamah bin al-Akwa', \"O Abu Muslim (Salamah's nickname), why did you take Bai'at that day?\" He replied, \"To die.\" (Al-Bukhari's history from Salamah bin al-Akwa') Allah promises a reward in the form of a paradise full of pleasures to those who take the bai'at. This is also confirmed in the hadith of the Messenger of Allah narrated by Ahmad, Muslim, Abu Dawud, and at-Tirmidhi from Jabir ra, Rasulullah saw said: No one will go to hell from those who take allegiance under that (Samurah) tree. According to Nafi', when 'Umar bin al-Khatthab heard that friends often came to visit the tree to commemorate and commemorate the Bai'ah ar-Ridhwan incident, he ordered the tree to be cut down. Umar ordered that the tree and place not be sacred and worshiped by people who came later so that it became a place for shirk to arise. Umar's actions were saddu dhari'ah (covering gaps or opportunities so that shirk would not occur in the future). Furthermore, Allah explained that He knows the contents of the hearts and determination of the Muslims who take the Bai'at. Therefore, Allah instilled in their hearts calmness, patience, and obedience to the decisions of the Prophet Muhammad. Allah also promised them victory in the Battle of Khaibar which will take place in the near future. Thus, this verse includes verses that explain events that will occur in the future, namely the victory of the Muslims in the Battle of Khaibar. And that event really happened."
		   },
		   {
			"id": 4602,
			"surah": 48,
			"ayat": 19,
			"tafsir": "This verse explains that in the Battle of Khaibar that will take place, the Muslims will gain victory over the infidels and get a lot of booty. The spoils were specifically given to the Muslims who followed Bai'ah ar-Ridhwan. At the end of this verse, Allah repeats His threat to the Bedouin Arab hypocrites who do not want to accompany the Prophet to Mecca. Allah will apply something to His creatures in accordance with the wisdom and benefits."
		   },
		   {
			"id": 4603,
			"surah": 48,
			"ayat": 20,
			"tafsir": "Allah promised the Muslims victory and booty a lot from the disbelievers gradually in the future. Allah will soon give victory and spoils to the Battle of Khaibar. Allah also guaranteed and stopped the Jews in Medina from disturbing and destroying the property of the Muslims when they went to Mecca and to Khaibar. They should be grateful for these events and serve as evidence of the truth of the Prophet Muhammad as the messenger sent by Allah to mankind. Allah helps and helps the Muslims from the threats and attacks of enemies, whether they are known or not, in large or small numbers. Allah guides the Muslims to take a straight path and is pleased with Him. According to Ibn Jarir, what is meant by the words, \"Allah holds back the hands of people who will destroy the Messenger of Allah and the Muslims\" is the desire and effort of the people of Khaibar and other tribes who are allied with them, because in their hearts there is still envy and hurt. The tribes that allied themselves with the people of Khaibar were the Asad and Gathafan tribes."
		   },
		   {
			"id": 4604,
			"surah": 48,
			"ayat": 21,
			"tafsir": "In addition to victory and security guarantees, Allah also promised that the Muslims would conquer other lands that had not yet been conquered. These countries have been confirmed by Allah will be controlled by Muslims and protected from the possibility of being conquered by other people. The truth of God's promise was proven later, with the conquest of countries around the Arabian Peninsula such as Persia, and parts of the Roman empire. At the end of this verse, Allah confirms that He has power that cannot be matched by anyone, and that nothing is difficult for Him. As if with this verse, Allah stated that winning the Muslims over the disbelievers was not a difficult thing for Him. If He wanted it to be like that, it would happen."
		   },
		   {
			"id": 4605,
			"surah": 48,
			"ayat": 22,
			"tafsir": "In this verse, Allah gives good news to the Muslims that if the Quraysh attack the Muslims in Hudaibiyyah, surely He will help them and destroy the polytheists. Allah also stated that the Muslims would be able to conquer Mecca in the near future. This is illustrated in His words, \"O Muslims, if the people of Mecca fight you and do not want to accept the Hudaibiyyah Agreement, surely We can defeat them and they will retreat and run headlong, because they do not have helpers and protectors who will defend them.\" they defend themselves. But you, O Muslims, have helpers and protectors to gain victory.\""
		   },
		   {
			"id": 4606,
			"surah": 48,
			"ayat": 23,
			"tafsir": "This verse emphasizes that winning faith over disbelief and eliminating falsehood with right has become the sunnah (law) of Allah that applies to all of His creatures from the past until now, and for the future. There is not a single creature in this universe that can change His sunnah."
		   },
		   {
			"id": 4607,
			"surah": 48,
			"ayat": 24,
			"tafsir": "Narrated by Ahmad, Ibn Abi Syaibah, 'Abd bin Humaid, Muslim, Abu Dawud, and an-Nasa'i, from Anas bin Malik, that he said, \"During the Hudaibiyyah War, 80 Meccan polytheists with full weapons had raided the Prophet's camp. and the companions from the Tan'im hill. Thanks to the prayers of the Prophet, the attack was broken and all the invaders were captured. Then the Messenger of Allah freed and forgave them, so this verse was revealed.\" It was Allah who restrained and hindered the attacks of the polytheists who invaded the Prophet's encampment in Hudaibiyyah and Allah also promised victory for the Prophet and the Muslims. Then He also engendered in the heart of the Prophet saw compassion and compassion so that he freed the unbelievers who were held captive. Not one of them was killed, even though the Muslims had succeeded in gaining victory. At the end of this verse, Allah confirms that He is All-Knowing of all that is done by His creatures, there is nothing hidden from Him. Therefore, He will reward all their deeds with an appropriate and fair reward."
		   },
		   {
			"id": 4608,
			"surah": 48,
			"ayat": 25,
			"tafsir": "This verse explains that unbelievers prevent Muslims from performing Umrah in the Grand Mosque. They also prevented the Muslims from bringing and slaughtering sacrificial animals to areas around the Grand Mosque, such as in Mina and so on. As has been explained that in the sixth year of the Hijra, the Prophet Muhammad left for Mecca with a group of friends to perform Umrah and slaughter sacrifices in the area of the Haram. Due to being bound by the Hudaibiyyah Agreement, the Prophet and his companions could not carry out their purpose in that year. The Apostle tried to fulfill the Hudaibiyyah Agreement, but there was a group of polytheists who attacked the Messenger of Allah's camp in Hudaibiyyah, but the attack was thwarted by Allah. Even so, many of the Muslims wanted to avenge the attack even though they were bound by the Hudaibiyyah Agreement. Allah softened the hearts of the Muslims so that they accepted the Prophet's decision. Allah explained that He softened the hearts of the Muslims so they did not invade Mecca with the following objectives: first, to save the Muslims in Mecca who hid their faith in unbelievers. They fear being killed or persecuted by unbelievers if they confess their faith. The Muslims themselves cannot distinguish them from the disbelievers. If there was an attack on the city of Mecca, surely the believers who were in Mecca would be killed like the unbelievers were killed. If this happened, of course the Muslims would be subject to shame and trouble because they had to pay kifarat. The polytheists will also say, \"Surely the Muslims have killed people of the same religion as them.\" Second, there is an opportunity for Muslims to call on polytheists to believe. With the occurrence of the Hudaibiyyah Agreement, the Muslims have been able to have direct contact with the disbelievers. Thus, a reasonable exchange of ideas can occur between them, without pressure from any party so that certain people can be expected to convert to Islam or it is hoped that their attitudes will no longer be as harsh as their previous attitudes. It is hoped that these things will happen before the Muslims perform Umrah in the coming year. From this verse it can be understood that Allah always looks after and protects those who truly believe in Him, wherever that person is. Even He will not bring a disaster to the disbelievers, if there are believers who will be affected by that disaster."
		   },
		   {
			"id": 4609,
			"surah": 48,
			"ayat": 26,
			"tafsir": "This verse reminds the Muslims of the emergence of a sense of arrogance and arrogance in the hearts of the polytheists of Mecca. This feeling arose when they disagreed with writing \"Bismillahir-Rahmanir-Rahimi\" at the beginning of the Hudaibiyyah Agreement letter. It is narrated that when Rasulullah SAW intended to fight polytheists, they sent Suhail bin 'Amr, Khuwaithib bin 'Abd al-'Uzza, and Mikras bin Hafadz to him. They submitted a request to him to cancel his intention and they agreed if the intention was carried out in the coming year. Thus, there is an opportunity for them to vacate the city of Mecca when the Muslims perform Umrah and will not be disturbed by anyone. So an agreement was made. Rasulullah saw ordered 'Ali bin Abi Talib to write \"Bismillahir-Rahmanir-Rahimi\". They replied, \"We don't know.\" The Prophet said that this agreement was a sign of peace from him to the people of Mecca. They said, \"If we admit that you are Allah's Apostle, we will not hinder you and will not fight you, and write this agreement as a sign of peace from Muhammad bin Abdullah to the people of Mecca.\" So Rasulullah SAW said to his friends, \"Write according to their wishes.\" Because of their attitude, some of the Muslims were reluctant to accept the agreement, and wanted to invade Mecca. So Allah instilled calmness and obedience and obedience to the Companions to the decision of the Messenger of Allah. Everything that happens, both among believers and unbelievers, is known to Allah, nothing escapes His knowledge. Therefore, He will reward every charity and deeds of His servants as fairly as possible."
		   },
		   {
			"id": 4610,
			"surah": 48,
			"ayat": 27,
			"tafsir": "Allah explained that the dream of the Messenger of Allah who saw himself and his companions entering the city of Mecca safely and securely and he also saw among his companions cutting and shaving their hair is a true dream and will definitely occur in the near future."
		   },
		   {
			"id": 4611,
			"surah": 48,
			"ayat": 28,
			"tafsir": "In this verse, the truth of Muhammad is emphasized as a messenger sent by Allah to mankind by stating that he is a messenger of Allah who was sent to bring guidance and the religion of Islam as a complement to the religions and Shari'a that had been brought by the previous apostles, declaring errors and erroneous beliefs. -religious beliefs and beliefs held by humans that are not based on religion, and to stipulate laws that apply to humans in accordance with the times, different circumstances and places. This also means that with the advent of Islam brought by Muhammad saw, other religions are no longer recognized as legitimate religions in the sight of Allah. At the end of this verse, it is stated that everything that Allah promised to Rasulullah SAW and the Muslims must happen and nothing can prevent it from happening."
		   },
		   {
			"id": 4612,
			"surah": 48,
			"ayat": 29,
			"tafsir": "This verse explains that Muhammad is the messenger of Allah who was sent to all mankind. The Companions and followers of the Prophet were tough towards the disbelievers, but gentle towards their neighbors. Allah's Word: O you who believe! Whoever among you turns away from his religion, then Allah will bring a people, He will love them and they will love Him, and be gentle with those who believe, but be harsh with those who disbelieve. , who strive in the way of Allah. (al-Ma'idah\/5: 54) The Prophet said: The parable of the believers in love and affection between them is like one body; if one part of the body is sick with a fever, then the other body feels feverish and disturbed too. (Muslim and Ahmad's narrations from an-Nu'man bin Basyir) Believers always pray sincerely, submissively, and sincerely, seeking rewards, gifts, and the pleasure of Allah. Traces of prostration appeared on their faces. The meaning is a bright countenance, no image of malice and bad intentions towards others, full of submission and obedience to Allah, with a refined attitude and manners as a picture of their faith. Regarding the light on the face of a believer, 'Uthman said, \"As for the secret that is hidden in a person's heart, Allah will reveal it in the look on his face and on his tongue.\" Such characteristics are described in the Torah and the Bible. The companions and followers of the Prophet were at first few and weak, then increased and developed in a short time like a seed that grows, gives off a stalk, then the stem branches and branches, then becomes big and bears fruit so that it amazes those who plant it, because it is strong and beautiful, thus increasing the heat the hearts of the unbelievers. Then to the followers of the Prophet, both past and present, Allah promises forgiveness of their sins, gives them many rewards, and provides heaven as an eternal place for them. Such a promise of God must be fulfilled."
		   }
	]
}
