{
	"tafseer": [
		{
			"id": 4631,
			"surah": 50,
			"ayat": 1,
			"tafsir": "It was stated earlier that the letters of the alphabet that appear at the beginning of a surah usually warn of the importance of the matter that is mentioned later, and very often it is the nature of the Qur'an mentioned here that is referred to. In this verse, Allah swore by His book, which contains many blessings and virtues (the Qur'an) that is very noble that the Prophet Muhammad was truly a messenger of His who warned his people about the day of resurrection. In line with this statement, at the beginning of surahh Yasin it has also been explained that the Prophet Muhammad was truly one of the messengers who was sent to warn people whose fathers had never been warned. Therefore, they were heedless and called the Age of Jahiliah."
		   },
		   {
			"id": 4632,
			"surah": 50,
			"ayat": 2,
			"tafsir": "They denied the apostleship of the Prophet Muhammad, and they not only hesitated and denied his apostleship, but they were astonished because a human being had come to them who gave a warning from among themselves. They thought it strange that God should send a man like themselves, who used to eat and drink and have a family, who used to sleep and occasionally get sick. They imagine that a messenger of God must be an angel as explained in the word of God: How are we going to follow a human (ordinary) among us? (al-Qamar\/54: 24) And His word They said, \"You are only human like us too.\" (Ibrahim\/14: 10)"
		   },
		   {
			"id": 4633,
			"surah": 50,
			"ayat": 3,
			"tafsir": "After they showed their surprise about Muhammad's apostleship, they were full of denial and mockery said, \"Are we after death and after our bones become earth and scattered in the earth, will we come back to life again?\" They see that rising from the grave is an impossible thing, which is impossible and completely unreasonable, because they measure God's power equal to theirs."
		   },
		   {
			"id": 4634,
			"surah": 50,
			"ayat": 4,
			"tafsir": "Allah put forward the argument for the resurrection from the grave because Allah really knows what the earth has eaten and destroyed from their bodies, where the parts of the human body moved or shifted and then what it became, because all the details are on the side God. All of them are recorded and preserved in the book, all of which illustrate that it will not be difficult for Allah to bring them back to life on the Day of Resurrection, the day that will surely come."
		   },
		   {
			"id": 4635,
			"surah": 50,
			"ayat": 5,
			"tafsir": "Indeed, they have denied and denied the apostle Muhammad, the Prophet who was strengthened by miracles. If they deny the news brought by the Messenger of Allah, it will result in more harm because they have severed the relationship between Allah and His most respected and beloved messenger as Sayyidul-Mursalin. Because of this they are constantly in a state of chaos. They deny the apostleship from among humans and they think that only those who have a high position and lineage should be God's messengers. And their words were mentioned by Allah in His word: Why was this Qur'an not revealed to a big man (rich and influential) from one of these two countries (Mecca and Taif)?\" (az-Zukhruf\/43: 31 ) It's even worse because they see the prophet as a sorcerer, witch doctor or madman. Their words and looks show that they are unstable, don't know what they are saying and their minds are always in turmoil."
		   },
		   {
			"id": 4636,
			"surah": 50,
			"ayat": 6,
			"tafsir": "Allah commands the disbelievers who deny the day of resurrection to look up at the sky above them to be used as food for thought, how Allah has raised the sky without pillars and decorated it with various sparkling stars, while the sky has not the slightest crack. In terms of science, according to the latest findings it is stated that the sky is a homogeneous colossal object that is not covered with cracked and empty objects, but is densely filled with a kind of subtle object called ether (al-atsir) and this subtle object It is known because it is a place where light or light travels. Among those stars, there are those which are more than a million and a half years away from the earth, while our own sun is only eight minutes and eighteen seconds away from the earth. Please imagine how far away some of the stars are in the firmament. The light emitted by the star to earth through the ether and if that subtle object was not there, of course the light would be cut off. Therefore, in this verse it is stated that the sky does not have the slightest cracks."
		   },
		   {
			"id": 4637,
			"surah": 50,
			"ayat": 7,
			"tafsir": "Allah explained that He has spread the earth for human habitation and placed several mountains that function as pegs in the earth so that the earth is shaken even strong and stable and on its slopes various beautiful plants grow."
		   },
		   {
			"id": 4638,
			"surah": 50,
			"ayat": 8,
			"tafsir": "In this verse it is explained that these beautiful sights were deliberately created so that humans remember their Creator, obey and repent to Him. The sky is so high that is decorated with stars so that it becomes material for reflection and thought, how great and how powerful God is. And the earth that is spread out for human habitation is decorated with various plants whose fruits are used by humans and their livestock, all of which must be used as a lesson and warning for every servant of Allah who returns to remember Him."
		   },
		   {
			"id": 4639,
			"surah": 50,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains how to grow these plants, that is, to send down rainwater from the sky which has many benefits to grow fruitful plants and trees, especially plants and seeds from which plants can be harvested, such as rice, wheat, corn, and so on. etc."
		   },
		   {
			"id": 4640,
			"surah": 50,
			"ayat": 10,
			"tafsir": "Allah grows tall palm trees that have tiered mayang as sustenance for His servants. In this verse Allah does not mention that the provision is for His servants who like to remember Allah as He describes in the eighth verse, because the provision is more general. Someone who returns to remembering Allah eats the sustenance while being grateful for Allah's favors, while others eat it like animals, not remembering the giver of these blessings. Allah revives the dry and barren earth after it rains with various kinds of plants. And like that also the resurrection on the Day of Judgment. Every farmer who always cultivates his fields and fields must always remember and be prepared to face the Resurrection Day with piety and good deeds. surahh Qaf verses 9 to 11 is a unit which states the benefits of water. The many benefits of water can be felt directly by humans, starting from basic needs such as drinking water, cooking, washing, agriculture, its use for industry and material processing, to transportation facilities. In the above verse it is stated that it is by Allah's will that water descends to the earth's surface in the form of rain. Examples of benefits are emphasized in the role of water in plant growth. All plants, including human food sources, both low plants such as seeds (you can include shrubs, grasses, fungi, lichens, algae and even bacteria) as well as large trees such as dates, need water for their growth. The verses above seem to say that through the water cycle, Allah provides sustenance for His creatures. Only with the presence of water, the soil will be able to become a growing medium for the plants on it. So even if the barren land is given water it will grow. The process of plant growth on barren land that gets water is often used to describe the events of human resurrection in the afterlife (see: Yunus\/10: 24, Fussilat\/41: 39, az-Zukhruf\/43: 11)"
		   },
		   {
			"id": 4641,
			"surah": 50,
			"ayat": 11,
			"tafsir": "Allah grows tall palm trees that have tiered mayang as sustenance for His servants. In this verse Allah does not mention that the provision is for His servants who like to remember Allah as He describes in the eighth verse, because the provision is more general. Someone who returns to remembering Allah eats the sustenance while being grateful for Allah's favors, while others eat it like animals, not remembering the giver of these blessings. Allah revives the dry and barren earth after it rains with various kinds of plants. And like that also the resurrection on the Day of Judgment. Every farmer who always cultivates his fields and fields must always remember and be prepared to face the Resurrection Day with piety and good deeds. surahh Qaf verses 9 to 11 is a unit which states the benefits of water. The many benefits of water can be felt directly by humans, starting from basic needs such as drinking water, cooking, washing, agriculture, its use for industry and material processing, to transportation facilities. In the above verse it is stated that it is by Allah's will that water descends to the earth's surface in the form of rain. Examples of benefits are emphasized in the role of water in plant growth. All plants, including human food sources, both low plants such as seeds (you can include shrubs, grasses, fungi, lichens, algae and even bacteria) as well as large trees such as dates, need water for their growth. The verses above seem to say that through the water cycle, Allah provides sustenance for His creatures. Only with the presence of water, the soil will be able to become a growing medium for the plants on it. So even if the barren land is given water it will grow. The process of plant growth on barren land that gets water is often used to describe the events of human resurrection in the afterlife (see: Yunus\/10: 24, Fussilat\/41: 39, az-Zukhruf\/43: 11)"
		   },
		   {
			"id": 4642,
			"surah": 50,
			"ayat": 12,
			"tafsir": "Allah gave a warning to the disbelievers of Mecca with a painful punishment as had been inflicted on the ancient peoples, who denied the messengers sent by Allah before Muhammad saw. They get various doom and calamity. Noah's people were the people who first denied His prophet. Preaching for 950 years, no one believed except eighty people, finally destroyed by Allah SWT with a hurricane. The Rass, the people of the Prophet Shuaib they tortured and killed his prophet in a well then Allah destroyed them in the well which they erected statues around it. The Samud, the people of Nabi Saleh, were destroyed by an earthquake. The people of 'Ad, the people of Prophet Hud were destroyed by the wind. Pharaoh was drowned by Allah in the sea. Lut people who practice sodomy, the country is turned upside down. The inhabitants of Aikah, the people of Prophet Shuaib, were also destroyed by Allah. The Tubba' al-himyari from Yemen were also destroyed by Allah. They all belied the apostles, so they deserved to be destroyed as God threatened them."
		   },
		   {
			"id": 4643,
			"surah": 50,
			"ayat": 13,
			"tafsir": "Allah gave a warning to the disbelievers of Mecca with a painful punishment as had been inflicted on the ancient peoples, who denied the messengers sent by Allah before Muhammad saw. They get various doom and calamity. Noah's people were the people who first denied His prophet. Preaching for 950 years, no one believed except eighty people, finally destroyed by Allah SWT with a hurricane. The Rass, the people of the Prophet Shuaib they tortured and killed his prophet in a well then Allah destroyed them in the well which they erected statues around it. The Samud, the people of Nabi Saleh, were destroyed by an earthquake. The people of 'Ad, the people of Prophet Hud were destroyed by the wind. Pharaoh was drowned by Allah in the sea. Lut people who practice sodomy, the country is turned upside down. The inhabitants of Aikah, the people of Prophet Shuaib, were also destroyed by Allah. The Tubba' al-himyari from Yemen were also destroyed by Allah. They all belied the apostles, so they deserved to be destroyed as God threatened them."
		   },
		   {
			"id": 4644,
			"surah": 50,
			"ayat": 14,
			"tafsir": "Allah gave a warning to the disbelievers of Mecca with a painful punishment as had been inflicted on the ancient peoples, who denied the messengers sent by Allah before Muhammad saw. They get various doom and calamity. Noah's people were the people who first denied His prophet. Preaching for 950 years, no one believed except eighty people, finally destroyed by Allah SWT with a hurricane. The Rass, the people of the Prophet Shuaib they tortured and killed his prophet in a well then Allah destroyed them in the well which they erected statues around it. The Samud, the people of Nabi Saleh, were destroyed by an earthquake. The people of 'Ad, the people of Prophet Hud were destroyed by the wind. Pharaoh was drowned by Allah in the sea. Lut people who practice sodomy, the country is turned upside down. The inhabitants of Aikah, the people of Prophet Shuaib, were also destroyed by Allah. The Tubba' al-himyari from Yemen were also destroyed by Allah. They all belied the apostles, so they deserved to be destroyed as God threatened them."
		   },
		   {
			"id": 4645,
			"surah": 50,
			"ayat": 15,
			"tafsir": "In this verse, Allah in a subtle and profound way shows the signs of His power by saying, \"We who have created all creatures from the beginning without anyone's help, are We tired and tired of creating these creatures a second time, which according to experience making the second time easier than creating it the first?\" It is stated in His words as follows: And it is He who began creation, then repeats it again, and it is easier for Him. (ar-Rum\/30: 27) Likewise His words: And he made a parable for Us and forgot the origin of its occurrence; he said, \"Who can give life to the bones, which are shattered?\" Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 78-79) Talking about creation, Allah makes a statement that the process of creation is still ongoing, whether for animate as well as inanimate objects. The indication can also be seen in the following verses: And horses, mules, and donkeys, that you ride them and as ornaments. And He created what you did not know. (an-Nahl\/16: 8 ) And Allah has created all kinds of animals from water, so some of them walk on their bellies and some walk on two legs while some walk on four legs. (an-Nur\/24: 45) The two verses above, and many other verses, show that Allah \"has not yet finished\" His creative work. Creation is indicated as s an ongoing process. From a scientific point of view, this situation is obvious. Gradually, researchers began to realize and understand that many natural phenomena are in a developing position. One of the evidences is the evolution of the species that continues to grow. Found a lot of evidence in the form of fossils that show the existence of species that have an \"intermediate form\" of the two types that exist at this time. Some of the examples above are just a few of the many proofs. There is still much that has not been revealed. What we know today is only the tip of the iceberg rising above the water. Meanwhile, the large part of the iceberg, which is below the surface of the water, is completely unknown. Many researchers realize that nature's ability to regulate itself is based on a fundamental and mysterious ability of the universe. Evidence that nature has creative powers, and is capable of creating complex variations of structures and shapes, often overturns the laws of nature that were previously made by humans. Thus, it is not an exaggeration if some philosophers claim that the universe, which for the time being considered as inanimate matter, is something very creative. If the creation has not been completed, surely many \"new things\", which have never existed before, will appear in the universe. Many scientists believe that the universe is still expanding. This is known among scientists as expansion theory."
		   },
		   {
			"id": 4646,
			"surah": 50,
			"ayat": 16,
			"tafsir": "Allah explains that He has created man and has full authority to bring him back to life on the Day of Judgment and He also knows what his heart whispers, both good and evil. This heart whisper (in Arabic) is called hadisun nafsi. The whisperings of the heart are not held accountable unless they are said or done. Allah swt is closer to man than his own jugular vein. Ibn Mardawaih has narrated a hadith from Abu Sa'id that the Prophet said: Allah is close to man (son of Adam) in four circumstances; He is closer to man than his jugular vein. It is as if a wall between man and his heart. He holds every animal by the forelocks, and He is with man wherever he is. (History of Ibn Mardawaih) ("
		   },
		   {
			"id": 4647,
			"surah": 50,
			"ayat": 17,
			"tafsir": "Allah explains that even though He knows every action of His servants, He commands two angels to record all the words and deeds of His servants, even though He Himself is closer than the jugular vein of man himself. The angel on the right records the good and the other on the left records the evil."
		   },
		   {
			"id": 4648,
			"surah": 50,
			"ayat": 18,
			"tafsir": "In this verse it is explained that the task assigned to the two angels is that not a single word is uttered by a person except by the side of the angel who watches over and records his deeds. Al-Hasan al-Basri in interpreting this verse said, \"O children of Adam, a list has been prepared for you and an angel has assigned you to record all your deeds, one on the right and the other on the left. As for those who are on your right is the one who records the good and the one on your left records the evil. Therefore, it's up to you, whether you want to reduce or increase your bad deeds and deeds, you are given freedom and are responsible for it and later after death, the list is closed and hang around your neck, enter with you into the grave until you are raised on the Day of Judgment, and that's when Allah will say: And every human being We have fastened (the record) of his deeds around his neck. And on the Day of Resurrection We will bring out for him a book in an open state. \"Read your book, it is enough for yourself today as a counter against you.\" (al-Isra'\/17: 13-14) Then dian al-hasan al-Basri said, \"By Allah, be righteous, God who made you a reckoner for yourself.\" Abu Usamah narrated that the Prophet said, \"An angel who records virtue leads an angel who records evil. If a human does good, the angel on the right records ten virtues, but if a human does something evil, he says to the one on the left, 'Wait seven hours, maybe he recites tasbih begging for forgiveness.' This hadith contains wisdom because of the presence of angels. on the right and left humans record their actions. Allah did not create humans to be punished, but to be educated and cleansed. Every suffering aims to increase endurance and practice patience. Every object usually contains more benefits than harm, and Allah created humans with the aim - a noble goal for humans themselves. Goodness is the main thing, while evil comes later. Objects (materials) basically contain benefits while the harm comes later. The four elements are the same: fire, wind, water and land, basically for the benefit of humans. Fire , hurricanes, floods, and earthquakes came later good power is essential to man, and evil comes later. Humans are given complete freedom and accountability and therefore, whoever commits a crime should not be blamed except for himself."
		   },
		   {
			"id": 4649,
			"surah": 50,
			"ayat": 19,
			"tafsir": "After the disbelievers' denial of the day of resurrection, in this verse Allah rejects their disbelief and disbelief with the statement that they will believe in the truth of Allah's word, when they face the agony of death and on the Day of Resurrection. When death has come, the true reality will open and a belief will arise that the Day of Resurrection will come; sakaratulmaut really opened the veil, which they always avoided. Now for them there is no shelter or escape anymore. In an authentic hadith it is explained that the Prophet Muhammad, when facing his death, said, \"Subhanallah, Glory be to Allah, in fact this sakaratulmaut contains awesomeness.\""
		   },
		   {
			"id": 4650,
			"surah": 50,
			"ayat": 20,
			"tafsir": "And the trumpet is blown a second time. The first is the explosion of the destruction of the world, the second is the explosion of the resurrection. Then came the Day of Judgment which contained many punishments for the disbelievers. Rasulullah saw said: How can I have fun when the angel who owns or blows the trumpet has put down his trumpet mouth, and bows his forehead waiting for the command to blow. The companions asked, \"O Messenger of Allah, what should we read (facing that terrible event)?\" He said, \"Read: hasbunallahu wa ni'mal-deputy.\" (History of Ibn Hibban)"
		   },
		   {
			"id": 4651,
			"surah": 50,
			"ayat": 21,
			"tafsir": "This verse explains that each person will come to his Lord on the Day of Judgment accompanied by companion angels and witness angels for all his deeds while living in the world."
		   },
		   {
			"id": 4652,
			"surah": 50,
			"ayat": 22,
			"tafsir": "Allah confirms to humans that when their life in the world was full of negligence in the face of the great and terrible Day of Judgment, \"Indeed, humans are negligent about the existence of this great and terrible Doomsday. Allah reveals the walls and veils that always block his view, now he is can see with his own eyes, what he used to deny. Man's eyesight on that day was sharp, eliminating all doubts, but what is the use of this awareness and realization, after he is in the afterlife?\" They should have had their awareness and conviction before they were still in the world."
		   },
		   {
			"id": 4653,
			"surah": 50,
			"ayat": 23,
			"tafsir": "The angel accompanying him said, \"This is the son of Adam who was handed over to me to watch over him, now I have presented him with his book of deeds so that he will be judged by God as fairly as possible.\""
		   },
		   {
			"id": 4654,
			"surah": 50,
			"ayat": 24,
			"tafsir": "Allah said to the two angels who accompanied and witnessed, \"So that they both throw into hell all the disbelievers who are very disobedient and obstinate, namely those who greatly hinder virtue, refuse the obligations assigned to them, who violate the boundaries social norms by committing tyranny, and full of doubts about the existence of Allah and the truth of his religion. Those who associate partners with Allah by worshiping other than Allah, are thrown into the fire of hell whose punishment is very painful."
		   },
		   {
			"id": 4655,
			"surah": 50,
			"ayat": 25,
			"tafsir": "Allah said to the two angels who accompanied and witnessed, \"So that they both throw into hell all the disbelievers who are very disobedient and obstinate, namely those who greatly hinder virtue, refuse the obligations assigned to them, who violate the boundaries social norms by committing tyranny, and full of doubts about the existence of Allah and the truth of his religion. Those who associate partners with Allah by worshiping other than Allah, are thrown into the fire of hell whose punishment is very painful."
		   },
		   {
			"id": 4656,
			"surah": 50,
			"ayat": 26,
			"tafsir": "Allah said to the two angels who accompanied and witnessed, \"So that they both throw into hell all the disbelievers who are very disobedient and obstinate, namely those who greatly hinder virtue, refuse the obligations assigned to them, who violate the boundaries social norms by committing tyranny, and full of doubts about the existence of Allah and the truth of his religion. Those who associate partners with Allah by worshiping other than Allah, are thrown into the fire of hell whose punishment is very painful."
		   },
		   {
			"id": 4657,
			"surah": 50,
			"ayat": 27,
			"tafsir": "The devil who accompanies the disbeliever rejects the charge that he is the one who misleads from the true path by saying, \"O our Lord, I did not mislead him, but he himself is always in a very far error.\""
		   },
		   {
			"id": 4658,
			"surah": 50,
			"ayat": 28,
			"tafsir": "Allah says to humans and satans who lead them astray so that they do not fight before Allah, because He has sufficiently given instructions with revelations, the Book, to the apostles, accompanied by clear proofs and has made threats against them.\""
		   },
		   {
			"id": 4659,
			"surah": 50,
			"ayat": 29,
			"tafsir": "The decisions that have been ordained by Allah and the threats against disbelievers with eternal punishment in hell fire cannot be changed anymore. Allah will absolutely not wrong anyone, or punish people without fault, or replace someone who is punished with someone else, and so on. ("
		   },
		   {
			"id": 4660,
			"surah": 50,
			"ayat": 30,
			"tafsir": "The Prophet Muhammad was commanded by Allah to warn his people on the day Allah will say to the Hellfire, \"Are you full?\" Hellfire replied that it was full and could add more. Verse 30 shows how wide and deep Hell Hell is. Jinn and humans were thrown into it group by group so that it was crowded. These conversations and questions and answers are put forward in an allegorical manner to make it easier to respond and to make the picture of events clearer. Ibn 'Abbas in interpreting this verse explains that Allah has sworn an oath in the verse: Whoever among them follows you, I will surely fill Hell with you all. (al-A'raf\/7: 18)"
		   },
		   {
			"id": 4661,
			"surah": 50,
			"ayat": 31,
			"tafsir": "This verse explains that those who are pious are in front of heaven. They see all kinds of pleasures and joys that Allah has promised them in the Qur'an, all kinds of pleasures and delights are endless, even lasting forever. All of that as a tribute to those who are pious."
		   },
		   {
			"id": 4662,
			"surah": 50,
			"ayat": 32,
			"tafsir": "This verse explains that when the pious people are in front of heaven, the angels say to them: that what is in front of them is the pleasure that God has promised them through the intercession of His messengers and written in His books, namely for every servant. God who always returns with repentance to God. They always ask for forgiveness from their sins and they always try to keep all of His rules."
		   },
		   {
			"id": 4663,
			"surah": 50,
			"ayat": 33,
			"tafsir": "They fear Allah, the Most Gracious, while He is invisible to them, and they face Allah's presence with repentant hearts and submit to Him. ("
		   },
		   {
			"id": 4664,
			"surah": 50,
			"ayat": 34,
			"tafsir": "The angels said to them with great respect that they were welcome to enter that heaven safely and securely. This verse explains to those who are invited to enter heaven that that day is eternal, that is the eternal abode. They will not die or move from heaven."
		   },
		   {
			"id": 4665,
			"surah": 50,
			"ayat": 35,
			"tafsir": "This verse reveals that for them in heaven whatever pleasures they desire are provided, pleasures that they have never seen with their eyes, have never heard with their ears and have never imagined in their hearts, and besides these immeasurahble pleasures, there is another addition from God, namely being able to see God's face which is the culmination of all pleasures as in His word: For those who do good, there is the best reward (heaven) and the addition (the pleasure of seeing God). (Yunus\/10: 26)"
		   },
		   {
			"id": 4666,
			"surah": 50,
			"ayat": 36,
			"tafsir": "Allah explained that there were many among mankind before the Prophet Muhammad such as the people of 'Ad, Samud, Tubba', and others, their bodies and physical strength were much stronger than humans today. They have explored several countries, carried out various efforts to seek sustenance and accumulate wealth with all kinds of ingenuity, but it turns out that they cannot escape Allah's punishment. They have all perished because of their disbelief in Allah and in defiance of the call of His messengers. Can they escape or can they avoid the destruction? ("
		   },
		   {
			"id": 4667,
			"surah": 50,
			"ayat": 37,
			"tafsir": "This verse explains that in fact in the event of doom being inflicted upon them there is a very clear warning for those who use their common sense or use their point of view, while witnessing the facts so that awareness and a desire for introspection arises."
		   },
		   {
			"id": 4668,
			"surah": 50,
			"ayat": 38,
			"tafsir": "In this verse Allah puts forward the argument for His power, namely that He has created the heavens and the earth and everything that is between them in the six ages, and in creating great things filled with various wonders. He was not at all tired and weak. It is better for humans to use the cosmos as food for thought and contemplation about its beauty and perfection, so that it can be used as an intermediary medium to recognize the majesty of its creator. With this verse, Allah stated the mistake of the Jewish people who said that Allah had created the heavens and the earth in six days starting with Sunday and ending with Friday and resting on Saturday, then lying on His Throne Throne because he felt tired. So Allah refutes this notion by explaining that He does not feel the least bit tired. Glory be to Allah from all the characteristics of shortcomings or weaknesses. This verse is in line with the following verse: And did they not see that it is Allah who created the heavens and the earth and He did not feel bad for creating them, and He has the power to give life to the dead? That's how it is; indeed, He is Almighty over all things. (alAhqaf\/46: 33)"
		   },
		   {
			"id": 4669,
			"surah": 50,
			"ayat": 39,
			"tafsir": "Allah ordered His prophet to remain patient with the words of polytheists who deny the day of resurrection. God, who created the heavens and the earth in that short period of time without weakness and fatigue, will certainly also have the power to resurrect them on the Day of Judgment and reward each of them with good deeds with rewards and bad ones with punishment. It is not something that is impossible for God. Allah ordered His prophet to purify Him with tasbih while praising Him at predetermined times, especially during prayer times, namely before sunrise and before sunset."
		   },
		   {
			"id": 4670,
			"surah": 50,
			"ayat": 40,
			"tafsir": "This verse instructs His prophet to glorify Him at night and after every prayer, Ibn 'Abbas interprets this verse and says that the prayer before sunrise is the Fajr prayer, and before sunset includes the ¨uhur and Asar prayers, Prayers at night include the Maghrib and Isha prayers, and after each prayer includes the ba'diyah prayer. In the hadith narrated by al-Bukhari from Ibn 'Abbas, it is explained that the Prophet was ordered to glorify after completing any prayer. And in the hadith narrated by Muslim, the number of tasbih (Subhanallah) is explained 33 times, tahmid (al-hamdulillah) 33 times, and takbir (Allahu Akbar) 33 times, and fulfilled 100 times by reading \"La ilaha illallah wahdahu la syarikalahu, lahul mulku wa lahul hamdu yuhyi wa yumitu wa huwa 'ala kulli syai'in qadir\". All of that is read after each prayer. ("
		   },
		   {
			"id": 4671,
			"surah": 50,
			"ayat": 41,
			"tafsir": "In this verse, Allah commands His prophet to listen to the call of the angel (Gabriel) on the Day of Judgment. The call was made from a place so close that all creatures could hear, \"So that they gather to be reckoned (in Padang Mahsyar).\" Then they all came out of their respective graves and came to the presence of God like locusts scattered."
		   },
		   {
			"id": 4672,
			"surah": 50,
			"ayat": 42,
			"tafsir": "This verse explains that on the day they heard the second terrible sound, that was the day they came out of their graves. According to scientific studies, the universe was started by a great explosion known as the Big Bang. Starting from here, nature then expanded until now. Researchers say, if the expansion of the universe has grown to a certain level and stops, then the universe will be destroyed. One of the reasons for the cessation of expansion is that the attractive forces between celestial bodies do not work because they are too far apart. It is believed that the expansion of the universe will end with an explosion at very high temperatures. This event is named Big Crunch. This explosion was followed by the end of all life forms. The universe will disappear. All natural objects that we can see, and which we cannot see because they are very far from the earth, will shrink, down to only the size of a proton. The process of exploding the universe causes negative energy to arise, which can cause natural conditions to become unstable, and eventually destroyed. It is suspected that this ending will happen not in the \"not too distant future\" from now, bearing in mind that we are now in the middle of the universe's life cycle. It is estimated that the expansion of the universe will stop when the area of the universe reaches 50 million times its current size. Or in other words, about 7.5 x 1017 years from now. Based on the Big Crunch theory, the destruction of the universe begins slowly, and will gradually accelerate, until it finally reaches a very high speed. At the end of the process, the universe will experience an infinite pressure and temperature, and will be in a very small size. The theory that appears in this concept is almost similar to the explanation of the Qur'an. On the day We fold the heavens as we fold the pages of books. As We have started Our first creation We will repeat it. A promise to Us, verily it is We who will carry it out. (al-Anbiya'\/21: 104) And they do not glorify Allah with the glory that should be, even though the earth is entirely in His hand on the Day of Judgment, and the heavens folded with His right hand. Exalted and Most High is He from what they associate. (az-Zumar\/39: 67) After the detonation, and the universe will be only the size of a proton, what will happen? Who knows? The Universe will continue to revolve in the Big Bang and Big Crunch cycle of all time? Or, Big Crunch will be the end of it all. If a new universe were to be formed, then this universe would have no memory of the previous universe. It will develop without knowing and depending on what happened before."
		   },
		   {
			"id": 4673,
			"surah": 50,
			"ayat": 43,
			"tafsir": "In this verse it is emphasized that it is actually Allah who revives people in the world and turns them off when their respective deaths come, and only Allah is the place where all creatures return to receive the reward for their deeds."
		   },
		   {
			"id": 4674,
			"surah": 50,
			"ayat": 44,
			"tafsir": "This verse reveals the days when the earth was split open so that all the contents of the graves appeared quickly from its gaps as informed in surahh az-Zalzalah verses 1-2: When the earth is shaken with a violent shock, and the earth has issued heavy burdens (which are contained )his. (az-Zalzalah\/99: 1-2) That is an easy gathering for Allah without the slightest difficulty. ("
		   },
		   {
			"id": 4675,
			"surah": 50,
			"ayat": 45,
			"tafsir": "In this verse, Allah commands His prophet to be patient. Allah knows better what the polytheists say about their denial of Muhammad's apostleship and about their attitude that denies the verses of Allah, especially their denial about the resurrection day. So Allah ordered His prophet to be patient because he was not assigned to impose coercion on them, his job was only to convey appeals and treatises and Allah was the one who brought them to account. Even so, the prophet must also carry out his da'wah as his main task. Therefore, Allah still ordered His prophet to give a warning with the Qur'an to people who fear Allah's threats, because indeed only they benefit from Allah's warning in accordance with His words: for) those who fear (face) My presence and fear My threats.\" (Ibrahim\/14: 14)"
		   }
	]
}
