{
	"tafseer": [
		{
			"id": 5949,
			"surah": 87,
			"ayat": 1,
			"tafsir": "Allah ordered His Messenger to purify His name from everything that is not in accordance with the greatness and glory of His substance and nature. Allah's name is only pronounced in order to praise Him, nothing is allowed to be named by His name. Glory to God the Most High."
		   },
		   {
			"id": 5950,
			"surah": 87,
			"ayat": 2,
			"tafsir": "Allah explains that it is He who created and perfected the creation of all creatures. Allah also determines everything according to the right shape and size and balance. In addition, He stipulates provisions and laws that apply to each of His creatures, so that they can live and reproduce, and take care of each other's lives. It is Allah who grows green and fresh grass for food for animals and livestock which He then makes dry and black in color. It is Allah who makes the grass grow and turns it dry, not the idols worshiped by the heathen."
		   },
		   {
			"id": 5951,
			"surah": 87,
			"ayat": 3,
			"tafsir": "Allah explains that it is He who created and perfected the creation of all creatures. Allah also determines everything according to the right shape and size and balance. In addition, He stipulates provisions and laws that apply to each of His creatures, so that they can live and reproduce, and take care of each other's lives. It is Allah who grows green and fresh grass for food for animals and livestock which He then makes dry and black in color. It is Allah who makes the grass grow and turns it dry, not the idols worshiped by the heathen."
		   },
		   {
			"id": 5952,
			"surah": 87,
			"ayat": 4,
			"tafsir": "Allah explains that it is He who created and perfected the creation of all creatures. Allah also determines everything according to the right shape and size and balance. In addition, He stipulates provisions and laws that apply to each of His creatures, so that they can live and reproduce, and take care of each other's lives. It is Allah who grows green and fresh grass for food for animals and livestock which He then makes dry and black in color. It is Allah who makes the grass grow and turns it dry, not the idols worshiped by the heathen."
		   },
		   {
			"id": 5953,
			"surah": 87,
			"ayat": 5,
			"tafsir": "Allah explains that it is He who created and perfected the creation of all creatures. Allah also determines everything according to the right shape and size and balance. In addition, He stipulates provisions and laws that apply to each of His creatures, so that they can live and reproduce, and take care of each other's lives. It is Allah who grows green and fresh grass for food for animals and livestock which He then makes dry and black in color. It is Allah who makes the grass grow and turns it dry, not the idols worshiped by the heathen."
		   },
		   {
			"id": 5954,
			"surah": 87,
			"ayat": 6,
			"tafsir": "In this verse it is explained that Allah sent down the Qur'an to the Prophet Muhammad to read and He will open the heart of His Prophet and strengthen his memory. Thus, having heard it once, he would not forget what he had heard. Allah said: So Most High is Allah, the true King. And do not you (Muhammad) hastily (read) the Qur'an before it has been revealed to you, and say, \"O my Lord, add knowledge to me.\" (thaha\/20: 114) And His words: Do not you (Muhammad) move your tongue (to read the Qur'an) because you want to quickly (master) it. Indeed, We will collect it (in your bosom) and recite it. (al-Qiyamah\/75: 16-17)"
		   },
		   {
			"id": 5955,
			"surah": 87,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains that if He wanted the Prophet Muhammad to forget what was revealed, then He could do so. Allah said: And if We willed, We would have destroyed what We have revealed to you (Muhammad), and you would not have found any defender against Us. (al-Isra'\/17: 86) Do not forget that what the Prophet Muhammad once heard was a gift and goodness from Allah. Truly He knows what is clear and what is hidden, what is revealed and what is kept secret."
		   },
		   {
			"id": 5956,
			"surah": 87,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains that He will give His Prophet taufik to the easy path, which leads to happiness in this world and in the hereafter. It was he who gave him a religion that is easy for the soul to accept and not difficult for the mind to understand."
		   },
		   {
			"id": 5957,
			"surah": 87,
			"ayat": 9,
			"tafsir": "In this verse, Allah commands His Messenger to warn humanity about what he has received from Him. Allah states that the warning is of great use and benefit to humans, because the warning gives instructions to him about ways to achieve happiness in life in this world and in the hereafter. However, it turns out they still disobey and deny. So the Messenger of Allah do not grieve."
		   },
		   {
			"id": 5958,
			"surah": 87,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that those who are lucky are those who can accept the call or warning of His Messenger, and fear Allah and His punishment. They are the ones who use their sane minds to reach the truth that will become their guide in life."
		   },
		   {
			"id": 5959,
			"surah": 87,
			"ayat": 11,
			"tafsir": "In these verses, Allah explains that for those who deny, disobey, and distance themselves from the instructions given by the Prophet Muhammad, the warnings given will not benefit. Therefore, they remain in disbelief and will be thrown into the lowest hell. In summary, there are three groups of people who responded to the call of the Prophet Muhammad to the way of Allah: 1. The group of people who know and are sure of the truth, there is not the slightest doubt in their hearts. This person is a perfect believer (mu'min kamil) who fears his Lord. 2. The group of people who receive instructions, then they are sure of the instructions, then declare their faith. This person was a faction that was somewhat less valuable than the first. 3. Those who are disobedient and disbelievers, whose hearts have been closed from being called to the way of Allah. They are the most evil and farthest from goodness."
		   },
		   {
			"id": 5960,
			"surah": 87,
			"ayat": 12,
			"tafsir": "In these verses, Allah explains that for those who deny, disobey, and distance themselves from the instructions given by the Prophet Muhammad, the warnings given will not benefit. Therefore, they remain in disbelief and will be thrown into the lowest hell. In summary, there are three groups of people who responded to the call of the Prophet Muhammad to the way of Allah: 1. The group of people who know and are sure of the truth, there is not the slightest doubt in their hearts. This person is a perfect believer (mu'min kamil) who fears his Lord. 2. The group of people who receive instructions, then they are sure of the instructions, then declare their faith. This person was a faction that was somewhat less valuable than the first. 3. Those who are disobedient and disbelievers, whose hearts have been closed from being called to the way of Allah. They are the most evil and farthest from goodness."
		   },
		   {
			"id": 5961,
			"surah": 87,
			"ayat": 13,
			"tafsir": "In this verse, Allah explains that those who are put in hell undergo endless torment. They feel pain that has no limit, do not die in it nor live. Allah says: And those who disbelieve, for them Hellfire. They were not destroyed until they died, and their punishment was not relieved from them. Thus We repay every person who is very disbelieved. (Fathir\/35: 36)"
		   },
		   {
			"id": 5962,
			"surah": 87,
			"ayat": 14,
			"tafsir": "Allah explains that the person who is lucky, namely spared from the torment of the afterlife, is a person who is clean, believes in Allah and does not associate partners with Him, and believes in what was conveyed by the Prophet Muhammad. When it crosses his heart and he remembers the attributes of God who has greatness and glory, then at that time he also submits to His power and then prostrate to pray. Allah says: Indeed, those who believe are those who, when Allah's name is called, their hearts tremble, and when His verses are recited to them, their faith increases (strengthens) and they put their trust only in Allah. (al-Anfal\/8: 2)"
		   },
		   {
			"id": 5963,
			"surah": 87,
			"ayat": 15,
			"tafsir": "Allah explains that the person who is lucky, namely spared from the torment of the afterlife, is a person who is clean, believes in Allah and does not associate partners with Him, and believes in what was conveyed by the Prophet Muhammad. When it crosses his heart and he remembers the attributes of God who has greatness and glory, then at that time he also submits to His power and then prostrate to pray. Allah says: Indeed, those who believe are those who, when Allah's name is called, their hearts tremble, and when His verses are recited to them, their faith increases (strengthens) and they put their trust only in Allah. (al-Anfal\/8: 2)"
		   },
		   {
			"id": 5964,
			"surah": 87,
			"ayat": 16,
			"tafsir": "In these verses, Allah explains that disbelievers prioritize the pleasures of this world rather than the pleasures of the hereafter. In fact, they should choose the pleasures of the hereafter, according to what God's religion wants. The pleasures of the hereafter are better and eternal, while the pleasures of this world will vanish with filth and sorrow. Even so, in general humans need to be balanced in their efforts and manage the portion of time for the benefit of the world and the hereafter, as Allah says: And seek (reward) the land of the hereafter with what Allah has bestowed on you, but do not forget your share in this world and do good ( to others) as Allah has done good to you, and do not do mischief on earth. Indeed, Allah does not like people who do damage. (al-Qasas\/28: 77)"
		   },
		   {
			"id": 5965,
			"surah": 87,
			"ayat": 17,
			"tafsir": "In these verses, Allah explains that disbelievers prioritize the pleasures of this world rather than the pleasures of the hereafter. In fact, they should choose the pleasures of the hereafter, according to what God's religion wants. The pleasures of the hereafter are better and eternal, while the pleasures of this world will vanish with filth and sorrow. Even so, in general humans need to be balanced in their efforts and manage the portion of time for the benefit of the world and the hereafter, as Allah says: And seek (reward) the land of the hereafter with what Allah has bestowed on you, but do not forget your share in this world and do good ( to others) as Allah has done good to you, and do not do mischief on earth. Indeed, Allah does not like people who do damage. (al-Qasas\/28: 77)"
		   },
		   {
			"id": 5966,
			"surah": 87,
			"ayat": 18,
			"tafsir": "In this verse, Allah explains that what He conveyed to the Prophet Muhammad regarding commands and prohibitions, promises of grace and warnings is the same as what has been contained in the books of the Prophets Abraham and Prophet Musa. Thus, the Prophet Muhammad only recalled His previous religion which had been forgotten by humans. The existing religion has been changed by human hands, corrupted by the passions and customs of their ancestors so that they have deviated from the truth. Allah's Word: And indeed, this (Qur'an) was truly sent down by the Lord of the worlds, Which was brought down by ar-Ruh al-Amin (Gabriel), into your heart (Muhammad) so that you may be among those who warn , in clear Arabic. And indeed, (the Qur'an) is (mentioned) in the books of the former. (asy-Syu'ara'\/26: 192-196) He (Allah) has made known to you the religion that He has bequeathed to Noah and what We have revealed to you (Muhammad) and what We have bequeathed to Abraham, Moses and Isa, that is, uphold religion (faith and piety) and do not be divided in it. It is very hard for the polytheists (to follow) the religion that you call upon them. Allah chooses those whom He wills to the religion of monotheism and guides His (religion) for those who return (to Him). (asy-Shura\/42: 13)"
		   },
		   {
			"id": 5967,
			"surah": 87,
			"ayat": 19,
			"tafsir": "In this verse, Allah explains that what He conveyed to the Prophet Muhammad regarding commands and prohibitions, promises of grace and warnings is the same as what has been contained in the books of the Prophets Abraham and Prophet Musa. Thus, the Prophet Muhammad only recalled His previous religion which had been forgotten by humans. The existing religion has been changed by human hands, corrupted by the passions and customs of their ancestors so that they have deviated from the truth. Allah's Word: And indeed, this (Qur'an) was truly sent down by the Lord of the worlds, Which was brought down by ar-Ruh al-Amin (Gabriel), into your heart (Muhammad) so that you may be among those who warn , in clear Arabic. And indeed, (the Qur'an) is (mentioned) in the books of the former. (asy-Syu'ara'\/26: 192-196) He (Allah) has made known to you the religion that He has bequeathed to Noah and what We have revealed to you (Muhammad) and what We have bequeathed to Abraham, Moses and Isa, that is, uphold religion (faith and piety) and do not be divided in it. It is very hard for the polytheists (to follow) the religion that you call upon them. Allah chooses those whom He wills to the religion of monotheism and guides His (religion) for those who return (to Him). (asy-Shura\/42: 13)"
		   }
	]
}
