{
	"tafseer": [
		{
			"id": 4474,
			"surah": 45,
			"ayat": 1,
			"tafsir": "The first verse consists of hijaiah letters, as they appear at the beginning of several surahhs of the Qur'an. Scholars of commentary differ on the meaning of the letters. Furthermore, you are welcome to examine this issue in the \"Al-Qur'an and its tafsir\" volume I, namely the tafsir of the first verse of surahh al-Baqarah.\" His name, Muhammad SAW. Mentioned the attribute of Allah \"Most Mighty\" in this verse so that it will be reflected in the minds of those who read or hear it, that what sent down the Qur'an was a substance that has unlimited power, cannot be matched and cannot be denied. His will. His will and will must be carried out according to His plan, there is no other power that is able to hinder and change it. Likewise, the attribute \"All-Wise\" is highlighted in this verse so that it is understood, that in carrying out His will and power Therefore, He carries out justice that is evenly distributed to all of His creatures. He acts, creates and implements things according to their uses and benefits. this torment can be witnessed in all actions and in all creatures He has created, from the simplest level to the most perfect level. In plants, animals, humans, and the system and regulations that apply to the solar system, one can see that in every creature there are laws and rules that cannot be violated; all must submit and obey both voluntarily and compulsorily. There is not a single creature that violates and violates the laws and provisions that Allah has set for it, unless it will result in damage and destruction. If people want to use a clear and healthy mind, they will certainly acknowledge Allah's power and wisdom towards all of His creatures. And if he is convinced of that, of course he will accept and practice the Al-Qur'an as the revelation and guidance of Allah. This also means that the Qur'an was revealed to the Prophet Muhammad in Arabic, conveyed for the first time to the people of Quraysh, then spread to all corners of the world, there is wisdom in accordance with its uses and benefits. Wisdom, uses and benefits are known to humans by means of the Al-Qur'an itself. There is something that is known based on the knowledge and experience that a person has, and there is something that is not yet known by humans, because the All-Knowing is only Allah."
		   },
		   {
			"id": 4475,
			"surah": 45,
			"ayat": 2,
			"tafsir": "The first verse consists of hijaiah letters, as they appear at the beginning of several surahhs of the Qur'an. Scholars of commentary differ on the meaning of the letters. Furthermore, you are welcome to examine this issue in the \"Al-Qur'an and its tafsir\" volume I, namely the tafsir of the first verse of surahh al-Baqarah.\" His name, Muhammad SAW. Mentioned the attribute of Allah \"Most Mighty\" in this verse so that it will be reflected in the minds of those who read or hear it, that what sent down the Qur'an was a substance that has unlimited power, cannot be matched and cannot be denied. His will. His will and will must be carried out according to His plan, there is no other power that is able to hinder and change it. Likewise, the attribute \"All-Wise\" is highlighted in this verse so that it is understood, that in carrying out His will and power Therefore, He carries out justice that is evenly distributed to all of His creatures. He acts, creates and implements things according to their uses and benefits. this torment can be witnessed in all actions and in all creatures He has created, from the simplest level to the most perfect level. In plants, animals, humans, and the system and regulations that apply to the solar system, one can see that in every creature there are laws and rules that cannot be violated; all must submit and obey both voluntarily and compulsorily. There is not a single creature that violates and violates the laws and provisions that Allah has set for it, unless it will result in damage and destruction. If people want to use a clear and healthy mind, they will certainly acknowledge Allah's power and wisdom towards all of His creatures. And if he is convinced of that, of course he will accept and practice the Al-Qur'an as the revelation and guidance of Allah. This also means that the Qur'an was revealed to the Prophet Muhammad in Arabic, conveyed for the first time to the people of Quraysh, then spread to all corners of the world, there is wisdom in accordance with its uses and benefits. Wisdom, uses and benefits are known to humans by means of the Al-Qur'an itself. There is something that is known based on the knowledge and experience that a person has, and there is something that is not yet known by humans, because the All-Knowing is only Allah."
		   },
		   {
			"id": 4476,
			"surah": 45,
			"ayat": 3,
			"tafsir": "This verse explains that as proof that Allah is Almighty, Most Wise, it can be seen in the events of the heavens, the earth, in humans and in animals of various kinds. It is emphasized that in the heavens and on earth, there are many signs of Allah's power and might. A simple-minded person will surely conclude that behind the events of the heavens and the earth and everything in between, there must be a substance that is the Creator, the Almighty. Moreover, people with high knowledge, of course, can understand more. The amazing creation of the heavens, the earth and their contents is a sign of God's majesty and power for believers, and shows that it is God who has the right to be worshiped, not other than Him. In this verse it is mentioned that people who believe and not others, because they are the ones who can take advantage that the Creator of the heavens and the earth is Allah, so they worship none but Him. At the end of this verse, Allah explains that the signs of Allah's power in the heavens and on earth are signs and proofs of Allah's existence and power for those who believe. By paying attention to the signs of Allah's power in the heavens and on earth, people who are clean in spirit, healthy in mind who want to seek the truth and are not influenced by Satan's temptations will certainly be the ones who accept the fact that the Qur'an was revealed to Muhammad. peace be upon him is truly a revelation from Allah that must be carried out by every human being who wants to live happily in this world and in the hereafter. On the other hand, a person's soul that is polluted by the stains of disobedience, a mind that has been shackled by shirk beliefs has been seduced by Satan's deception, then no matter how clear and bright the signs of Allah's power and greatness are, they will not be able to feel and live them. Therefore, they still wallow in disbelief and disobedience. Signs of Allah's power spread both in the heavens and on earth. An example is related to celestial bodies as described in surahh al-An'am\/6: 96-97. He wakes up the morning and makes the night for rest, and (makes) the sun and the moon for reckoning. That is the decree of Allah, the Almighty, the All-Knowing. And it is He who made the stars for you, so that you may make them guides in darkness on land and in the sea. We have explained the signs (Our power) to those who know. (al-An'am\/6: 96-97). According to scientific studies, humans since the beginning of civilization have used objects in the sky such as the sun and the earth as calendar calculations. A calendar based on the sun's movement and position in the earth's sky, known as the Solar Calendar, has been carried out by Western civilization (derived from Rome and Greece), India; while Jewish, Arab, Chinese, and Indian civilizations use the Lunar Calendar, which is a calculation based on the motion and position of the moon in the earth's sky. In the language of astronomy, the Solar Calendar is based on the earth's orbit relative to the sun's position, while the Lunar Calendar is based on the moon's orbit relative to the earth's and sun's positions. Likewise the stars in the sky are used as navigation indicators. In scientific language, navigation indicators that use or are based on the position of the stars in the sky are called stellar navigation. Stellar navigation has also been used by land nomads to determine the direction of their journey. In today's modern world, it turns out that stellar navigation has also been used by spacecraft, such as the Space Shuttle: Columbia, Challenger, and Enterprise. Likewise the signs of Allah's power that can be found on earth. One of them is as mentioned in surahh ash-Shura\/42: 32 above, where mountains that according to lay people remain in place, actually float and move."
		   },
		   {
			"id": 4477,
			"surah": 45,
			"ayat": 4,
			"tafsir": "Allah shows signs of His power and greatness in the events of human beings themselves and in the creation of animals of various types and forms. Humans were created by Allah from the elements contained in the soil. Various substances consisting of carbohydrates, proteins, fatty substances, sugars, various kinds of salts, various kinds of vitamins, iron, and so on accumulate in the human body, through food and drink that come from plants and animals. Plants and animals that all come from the ground. Allah says: And among His signs (greatness) is that He created you from dust, then suddenly you (become) human beings who multiply. (ar-Rum\/30: 20) Some of the substances that humans eat become spermatozoa in men and ova in women. Sperm and ovum meet, during intercourse between a man and a woman. Thus there is fertilization. The seeds are getting bigger and bigger. Forty days later, tissues filled with blood vessels form. Forty days later, a prospective fetus was seen that was shaped like curdled blood. Then after forty days a fetus is formed which is attached to the uterine wall. It was at that time, began to show signs of life and the baby's heart began to beat. The baby's heartbeat can be heard when someone puts their ear to the stomach of a pregnant mother. From the time fertilization occurs in the mother's womb to the appearance of signs of life, it takes four months. Five months and ten days after that, the fetus was born from the womb. Since then the baby has been breathing with its lungs that have started to work, and since then he has gradually released himself from his dependence on his parents, especially his mother. He has been given reason, feeling and the ability to work so that with the ability given, he has been able to carry out his life's task as the caliph of Allah on earth. Finally he grew old and died. The creation of man Allah explains in His word: It was He who created you from dust, then from a drop of sperm, then from a clot of blood, then you were born as a child, then allowed you to grow up, then grow old. But among you there are those who were turned off before that. (We do this) so that you arrive at the specified time, so that you understand. (Gafir\/40: 67) By paying attention to the process of human creation, how difficult and complicated the laws that apply to creation, people who are conscious will acknowledge the power and majesty of Allah, God Almighty. Allah also shows the signs of His power and majesty which are found in the occurrence and life of reptiles of various kinds, kinds, and ways of life. By paying attention to their shape, people can distinguish animals. There are animals with a spinal column which in Life Sciences are called \"vertebrates\", there are animals without a spinal column (invertebrates). Animals with backbones are divided into several parts, such as mammals (mammals), birds (aves), reptiles (reptiles), animals that live on land and in water (amphibians), fish (pisces). Animals that do not have a backbone are further divided into several parts, such as animals with ticks (insectivores), soft animals (molluscs), and single-celled animals (protozoa). Each type and type of animal has its own laws and regulations which are neatly arranged, such as how to live, how to eat, how to reproduce, how to maintain life, to its majesty and benefits. And the things that are explained will be an i'tibar and a lesson for people who want to think and want to know how High is the Knowledge of their Creator; thus, will strengthen the faith in his heart."
		   },
		   {
			"id": 4478,
			"surah": 45,
			"ayat": 5,
			"tafsir": "In this verse, Allah reminds people of the signs of His greatness and power which are found at the turn of the day and night, both in terms of length and shortness. In terms of change, one can watch from sunrise on the eastern horizon to sunset on the western horizon. During the day, one sees nothing in the sky, except for the sun shining brightly. At that time, most people worked and tried to make a living, fulfilling their needs. The sun moves away from the eastern horizon getting higher and higher. Then he looks at the meridians. After that, it descends towards the western horizon. Finally he sank on the western horizon. Since then, the day gradually darkened, sometimes a reddish cloud was seen, then the animals began to appear one by one, from the brightest star to the faintest shining star. After darkness covers the entire surface of the earth, it becomes clearer that the stars scattered in the sky, the various constellations and the various colors of their light appear. At the end of the night, the dawn begins to appear on the eastern horizon, as a sign that the sun will soon rise again. Since then, the starlight began to dim again because its light began to be overshadowed by the sun's light. That's how people can witness the situation over and over again. Such an atmosphere occurs in countries that are on the equator, while the southern and northern hemispheres will experience longer or shorter days than nights, according to the latitude and declination of the sun. In terms of the short length of the night and the day, people who are at the equator will always see the short length of the day and night which are almost the same. Areas south of the equator will experience longer afternoons when the sun is in the south, but will experience shorter afternoons when the sun is north of the equator. Likewise, people who are north of the equator will experience a longer afternoon if the sun is in the south. The farther a place is both north and south of the equator, the greater the difference in the length of time between night and day. For people who are at the North Pole and South Pole, in one year there is a continuous night and there is also a continuous day. During continuous days the sun is always above the horizon, it is always seen that it never goes below the horizon, whereas during continuous nights, the sun is always below the horizon, never visible and never crosses the horizon upwards. By paying attention to the change of day and night, and the short length that always changes throughout the year, you will see the signs of Allah's power and greatness, and you will see that there are laws that regulate them very neatly, never deviating from the provisions that have been set. determined. Then Allah showed signs of His power and greatness which were seen in the rain falling from the sky. Due to the heat of the sun, the water evaporates upwards. The wind that is always blowing accelerates the evaporation process and drives it somewhere and gradually the water vapor collects in the sky as clouds. When a cloud that is drifting in the wind is held up by a mountain, it collects there, getting thicker and thicker. The color that was originally whitish turned black. And when the air temperature has reached such a cold, the water vapor will fall as rain that waters the surface of the earth. Because of the rain water, various kinds of plants grow, and because of the rain water, animals and humans can live. Humans with the results of their thoughts can regulate the flow of water so that it does not flow entirely into the sea. Part of it is utilized and partly can be used in the dry season. In each area, on the surface of the earth, rainfall is not the same; depending on the determining factors. There are areas where the rainfall is very heavy and some are very thin and some are moderate. By observing the rain falling and the benefits it brings to the lives of creatures, one can see how vast the power of its creator is. After that Allah also showed signs of His power which can be seen in the range of winds, namely the range of land breezes and sea breezes which always blow changing directions. It is a law of nature that the land heats up faster when exposed to sunlight compared to the ocean, which heats up slowly when exposed to sunlight. On the other hand, the land releases heat faster at night, when the sun's heat is no longer there, compared to the ocean, which is slow to release it. Thus, there are areas of maximum and minimum air. During the day the land is hotter than the sea so that the air becomes a minimum, while the sea air is less hot than the land so that the air becomes a maximum. Air flows from the maximum area to the minimum area, so the sea breeze blows during the day towards the land. However, at night, the opposite occurs; the land becomes a maximum and the sea becomes a minimum because the land cools faster than the sea so that the wind blows from the land towards the ocean. This situation benefits fishermen. They set off at night, sailing out into the middle of the ocean following the direction of the sea breeze. In addition, the change in the position of the sun is in the northern latitude of the southern hemisphere. Therefore, the air is maximum in the Southern Hemisphere. Then the wind blows from the southern hemisphere to the northern hemisphere. At that time in Indonesia experienced a dry season. However, when the sun is at the southern latitude, the southern hemisphere receives more heat than the northern hemisphere. Therefore, the maximum air is in the north, so the wind blows from north to south. For Indonesia, the wind blows from the Gobi desert to China, along the Malay Peninsula due to the influence of the earth's rotation, it turns east, towards Indonesia, towards the Victoria Desert in Australia. At that time, in Indonesia experienced the rainy season. In addition, there are constant winds blowing from the north pole and south pole, because the polar regions always experience colder air than the equator, so the polar regions have maximum air. However, because of the rotation of the earth on its axis from west to east, the winds blowing from the poles experience a westerly deflection. That is why the wind in Indonesia blows from the southeast. For the polar regions themselves, the west wind always blows, which remains constant all the time. From the rotation of the wind, people will know how All-Wise and All-Mighty Allah who created this universe. That is why at the end of this surahh, Allah confirms that the signs of His power which can be seen in the universe, in humans, in the wind, in the rain, and so on are proof of His power for those who use their minds and for those who use their minds. people who really want to seek the truth. With these various appeals, Allah shows signs of His power so that people believe in His Oneness and omnipotence. By knowing all of this correctly, their faith will undoubtedly increase and their enthusiasm will also increase to use this knowledge for the benefit of mankind. From the information above, it is also understood that there is a lot that can be used as evidence of the existence of Allah, Almighty and All-Wise, as long as people are willing to follow the way of thinking outlined by Allah in the Qur'an. This also means that in fact, the higher one's knowledge, the more he has the evidence. If there is a knowledgeable person who does not believe in the existence of God, it means that he has not yet used his knowledge as it should. In these verses there are three different sentences, the first is yu'minun, the second is yuqinun, and the third is ya'qilun, this is meant; if you believe then understand these signs of Allah's greatness and if you do not believe but seek truth and belief then understand these signs, and if you do not believe and do not seek reality then be you people of reason and understand these signs. This verse briefly describes the existence of mechanisms for the rotation and circulation of the earth related to changes in the weather and the rotation of the winds. Today's science explains that there is day and night on earth due to the rotation of the earth on its axis. Besides rotating, the earth also revolves in its trajectory (evolution) which is an ellipse. Earth takes one year to circulate in this trajectory until it is back in the same position. The process of the earth's rotation and evolution, apart from being related to the weather and climate in various places on the earth's surface, is also related to changes in wind direction. Local rains generally occur after noon, when temperatures begin to cool, after in the morning and during the previous day the earth's surface gets a lot of solar heat and produces enough water vapor to produce clouds that rain down. The earth's axis of rotation makes an angle of 23.5o to the trajectory of its circulation, so that the total intensity of sunlight received by the northern and southern hemispheres is always different, except for the position of the trajectory perpendicular to the half-sphere of the earth's cross-section, when the sun is directly above equator. The existence of places that get different light intensity causes the heat of the earth's surface to vary too. With the difference in heat on the surface of the earth, there is a flow of air (wind) from a cold place to a hotter place. In the area around the equator (equatorial) there are winds that blow all year round towards the equator which are always hot, known as trade winds. In Indonesia, which is located between two major oceans and two continents, the wind that changes direction every half year is known as the monsoon wind. From October to April, the wind blows from the northwest to the southeast (westerly wind) which brings moisture with it and causes the rainy season. From April to October, the wind blowing from the southeast to the northwest is dry, causing the dry season. At sea level, this difference in solar heat causes ocean currents and differences in water vapor production. The combination of the dynamics of wind direction and the production of water vapor on the earth's surface produces a cycle of climate change, which basically repeats itself every year. During certain recurrence periods, extreme cases such as the El Nino and La Nina phenomena are common."
		   },
		   {
			"id": 4479,
			"surah": 45,
			"ayat": 6,
			"tafsir": "Allah stated to Rasulullah saw, that the verses of the Al-Qur'an that were recited to him were verses that contained evidence and strong arguments both in terms of the origin of the Al-Qur'an (from Allah) as well as in terms of its content and style. The statement of Allah had been conveyed by the Prophet Muhammad to the polytheists of Mecca, but they could not accept all of this, they even grew disapproving of the Messenger of Allah. When the Qur'an was recited to the Meccan infidels, their hearts recognized the height of its content and style. This acknowledgment was immediately conveyed by 'Utbah bin Rabi'ah and Abu al-Walid, a well-known Arab writer at that time. They are ordered to pay attention to the events of this universe, the events of themselves, the rain that falls from the sky that waters the earth so that the barren earth becomes fertile, the winds that blow, and so on, all of this can be used as proof that Allah is One, Almighty. again Almighty. They have also been sent an apostle who will convey the religion of Allah to all mankind. The Apostle was the person they trusted the most among them, the person they respected and the person they always asked for advice in resolving disputes that occurred between them. The messenger who was sent can also prove that he is really the messenger sent by God to humans, for example by presenting several miracles that God gave him. There have been many proofs presented to them, but they do not also believe. Actually, for a person who is willing to use his mind, there is enough evidence to make him a believer. That is why the Messenger of Allah was commanded by Allah to ask the polytheists of Mecca about what more information they asked for that could change their hearts so that they became believers. Complete information has been provided to them. There are no more arguments and stronger evidence than those that have been put forward. If they don't want to understand it and don't want to accept the evidence and arguments, it's up to them. They will be rewarded accordingly due to their stubborn attitude."
		   },
		   {
			"id": 4480,
			"surah": 45,
			"ayat": 7,
			"tafsir": "Then Allah threatens the polytheists who always deny the truth of the verses of the Qur'an with very terrible threats. They continue to deny the truth of the verses of the Al-Qur'an, even though in it there is a clear explanation of the arguments and proofs of His oneness and power. They have heard the evidence and information themselves. According to a reasonable size, of course they have understood it. However, what happened was the opposite. That is why they are called in this verse people who lie a lot and commit a lot of sins. Furthermore, it is explained that the condition of polytheists before and after hearing the verses of the Qur'an remains the same, there is no change in their attitude and behavior, they even grow in denial and arrogance. That is why in this verse they are said to be as if they had never heard of the verses of the Qur'an that were conveyed to them. In another verse, it is explained that they themselves admit that they have never heard of the Qur'an being conveyed to them. Allah said: And they said, \"Our hearts are closed from what you call us to him and our ears are blocked, and between us and you there is a wall, therefore do (as you wish), verily we will do (as we wish) ).\" (Fussilat\/41: 5) In another verse: And those who do not believe in their ears there is a blockage, and (the Qur'an) it is darkness for them. (Fussilat\/41: 44) At the end of this verse, Allah commands His Messenger to convey the good news to them that they will receive a painful punishment in hell later. In this verse it is stated that announcing the existence of a painful doom is good news, not sad news. This expression was deliberately made in such a way as to reply to the attitude of those who made fun of the verses of the Qur'an that were conveyed to them and to show that their attitude was an attitude that had gone too far. Therefore, what is meant by good news here is the opposite of the good news, namely sad news as an insult to them."
		   },
		   {
			"id": 4481,
			"surah": 45,
			"ayat": 8,
			"tafsir": "Then Allah threatens the polytheists who always deny the truth of the verses of the Qur'an with very terrible threats. They continue to deny the truth of the verses of the Al-Qur'an, even though in it there is a clear explanation of the arguments and proofs of His oneness and power. They have heard the evidence and information themselves. According to a reasonable size, of course they have understood it. However, what happened was the opposite. That is why they are called in this verse people who lie a lot and commit a lot of sins. Furthermore, it is explained that the condition of polytheists before and after hearing the verses of the Qur'an remains the same, there is no change in their attitude and behavior, they even grow in denial and arrogance. That is why in this verse they are said to be as if they had never heard of the verses of the Qur'an that were conveyed to them. In another verse, it is explained that they themselves admit that they have never heard of the Qur'an being conveyed to them. Allah said: And they said, \"Our hearts are closed from what you call us to him and our ears are blocked, and between us and you there is a wall, therefore do (as you wish), verily we will do (as we wish) ).\" (Fussilat\/41: 5) In another verse: And those who do not believe in their ears there is a blockage, and (the Qur'an) it is darkness for them. (Fussilat\/41: 44) At the end of this verse, Allah commands His Messenger to convey the good news to them that they will receive a painful punishment in hell later. In this verse it is stated that announcing the existence of a painful doom is good news, not sad news. This expression was deliberately made in such a way as to reply to the attitude of those who made fun of the verses of the Qur'an that were conveyed to them and to show that their attitude was an attitude that had gone too far. Therefore, what is meant by good news here is the opposite of the good news, namely sad news as an insult to them."
		   },
		   {
			"id": 4482,
			"surah": 45,
			"ayat": 9,
			"tafsir": "This verse explains the different attitude of the Meccan polytheists when they heard the verses of the Qur'an conveyed to them. When any of their friends convey news about verses of the Qur'an, they make fun of those verses. It was narrated that when Abu Jahl heard the word of Allah: Truly the zaqqum tree, food for people who sin a lot. (ad-Dukhan\/44: 43-44) he asked for dates and cheese, saying to his companions, \"Eat this zaqqum fruit, which Muhammad peace be upon him threatens you with is nothing but a sweet food like honey.\" And when he heard the word of Allah: Above him were nineteen (guardian angels). (al-Muddatstsir\/74: 30) Abu Jahl said, \"If the guards are only nineteen, then I myself will throw them.\" There are many other ways and attitudes that are contemptuous from the Meccan infidels when they hear the recitation of the Qur'an. Even Abu Jahal challenged as explained in the Qur'an: And (remember), when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then rain us with stones from heaven, or bring on us a painful doom.\" (al-Anfal\/8: 32) Because they always deny Allah's verses and make fun of them, in this verse Allah confirms the reward they will receive later in the hereafter. They will be put into a hell that humiliates and tortures them as a reward for their attitude and actions."
		   },
		   {
			"id": 4483,
			"surah": 45,
			"ayat": 10,
			"tafsir": "In this verse Allah explains that the polytheists in the hereafter will face the hell that has been prepared for them, because they are always arrogant to accept the instructions conveyed by the Prophet Muhammad. Everything they try in this world cannot save them from Hell, likewise what they worship besides Allah, cannot provide the slightest protection and they will get a very big punishment."
		   },
		   {
			"id": 4484,
			"surah": 45,
			"ayat": 11,
			"tafsir": "In this verse it is explained that the Qur'an is a guide that comes from Allah, which He conveyed to Muhammad saw, so that it is conveyed to all mankind. Those instructions lead people to the right path to happiness in this world and the hereafter. It is explained that those who deny the guidance of the Qur'an will take a misguided path, a path that leads to suffering in this world and the hereafter. Al-Qur'an as a guide can bring people out of error towards the truth, from disbelief towards faith. Therefore, those who do not believe will receive a very painful punishment."
		   },
		   {
			"id": 4485,
			"surah": 45,
			"ayat": 12,
			"tafsir": "Allah stated that it was He who subdued the sea for human needs. This means that Allah created the sea just for humans. In another verse it is explained that Allah made the earth and everything in it for humans. Allah says: It is He (Allah) Who created everything that is on earth for you then He ascended to the heavens, then He perfected them into seven heavens. And He is All-Knowing of all things. (al-Baqarah\/2: 29) Therefore, this verse seems to encourage people to try and think as much as possible, in which the sea and everything in it can be utilized for various purposes, as well as this universe. As an example, some of the results of human thought that have been used in utilizing the sea are presented, for example ships that sail from one country to another, transporting people and goods for their daily needs. Of course traffic at sea will be able to strengthen relations between residents of one country and residents of another country. Humans can also take advantage of this sea as a source of livelihood. Inside there are ingredients that can be used as food, such as fish, seaweed, and so on. There are also jewelry materials such as pearls, marjan, and the like. Sea water can be evaporated to produce salt which is useful for increasing energy and flavoring food, and it can be made fresh to be used as drinking water and for irrigating plants, and for other things. Rocks of various colors and various shapes and types are taken out of the sea, used as lime for household building materials. At present, more and more are being discovered from the sea such as oil, iron and various metals. In the face of today's population development explosion, people have started to turn their minds towards the ocean. They have started to think about the possibilities of utilizing and digging up marine products as a source of food because it is suspected that food production on the mainland will decrease in the near future and be out of balance with the number and increase in population. All of these are God's gifts bestowed on humans as a sign of His mercy, so that humans are grateful for them. There are so many other gifts from God that humans haven't discovered yet, therefore humans should try and think about how to find them. Allah subjected the seas so that ships could sail on them. One of His many gifts is the human ability with Allah's permission to dive in a submarine. Submarine, which is now also widely used in research, is a watercraft that can operate in water at pressures that humans can withstand. The submarine is positively buoyant and its weight is less than the volume of water it displaces. To dive hydrostatically, a ship must obtain negative buoyancy by increasing its own weight or by reducing the volume of water displaced. To control its weight, a submarine must be equipped with ballast tanks which can be filled either with water from the surroundings, or with compressed air. For general diving and floatation movements, the submarine uses a forward and backward tank called the Main Ballast Tank which can be opened and completely filled with water to dive or filled with compressed air to float."
		   },
		   {
			"id": 4486,
			"surah": 45,
			"ayat": 13,
			"tafsir": "Furthermore, Allah explains that it is He who subdues all His creatures in the heavens and on earth so that humans can use and utilize them for their benefit in carrying out their duties as Allah's caliphs on earth. This means that humans are obliged to try to find the benefits and uses of Allah's creation for them. The key to everything is the willingness to try and the desire to know some of God's knowledge. This has been started by humans since ancient times until now so that the longer the earth is inhabited by humans, the more God's knowledge is known to humans and the benefits of the universe. All of this is for the benefit of life and human life. However, only a small part of Allah's knowledge has been known to humans. Allah's creations in the sky such as the sun, moon, stars, clouds, wind, rainwater, and His creations on earth such as plants, animals, mountains, seas and some of them He created besides as a mercy and His gifts to humans also contain signs of His power and majesty, which show that the Creator is the One and Only Substance. There is no other God besides Him, who always takes care of His creatures and is not worthy of being associated with anything. Such a conclusion can only be reached by a servant of God who makes careful observations, uses a sound mind and is willing to seek the truth. If someone wants to pay attention to the universe, wants to pay attention to the relationship between one type of creature and another, he will certainly come to the conclusion that each unit has a relationship between one and another, and cannot be separated or stand alone. Seen in the process of rain, it is closely related to the existence of the sea, the presence of mountains, the heat emitted by the sun, the presence of wind and so on. Likewise, the wind direction range is determined by many things, such as the presence of clouds, mountains and the sun's heat. Ships sailing on the sea require wind or fuel such as coal or oil. The higher a person's knowledge, the more he knows the relationship between one creature and other creatures. The moon cannot let go of its trajectory from the earth, as if it is being held captive by the earth, so is the earth and other planets being held captive by the sun. The planets always revolve around the sun in their respective orbits. Furthermore, the sun and the planets that follow cannot escape from the larger unity, namely the Milky Way Galaxy. Finally the Milky Way Galaxy together with other galaxies are also bound to a certain arrangement as well. So with the thought and research people will come to the conclusion that the Creator must be the One Almighty, the Almighty. The above verse, like many similar verses, shows how Allah subdued the heavens and the earth for humans. As is well known, nature has physical properties, all of which are ordained by Allah, the Sunatullah, and are manifestations of nature's submission. For example, the earth has physical properties such as electricity, magnetism, elasticity and mass density. From these physical properties, humans, especially geographers, can study the earth even far into the earth. By taking advantage of the elastic properties of the earth, humans can catch earthquake waves that propagate in the bowels of the earth and know the physical characteristics of the layers of the earth that they pass through. With these earthquake waves, humans can know the layers of the earth from above to the core of the earth which is about 6000 km below us. In practical use, the search for petroleum uses the elastic properties of the earth, namely by sending waves whose source came from 'artificial earthquakes', which in the past used dynamite. Inside the earth there is the earth's core, the outer part of which is liquid. This core is what causes the earth to have a strong magnetic field that plays an important role in maintaining the continuity of life. Spreading far above the surface, this magnetic field protects the earth from the damaging radiation that comes from outer space. Radiation from stars other than the sun cannot pass through this shield, which is called the Van Allen Belt .This shield extends to about 18,000 km from the earth, protecting this ball from deadly energy.In a practical aspect, by knowing the nature of this magnetism, geoscientists also develop exploration methods for both minerals and petroleum.The statement regarding creation made is not to play around, many are put forward in many verses of Al- Koran. This statement guarantees that the earth is livable. Earth made it easy for humans to live in. He is the one who made the earth for you easy to explore. (al-Mulk\/67: 15)"
		   },
		   {
			"id": 4487,
			"surah": 45,
			"ayat": 14,
			"tafsir": "Al-Wahidi and al-Qusyairi narrated from Ibn 'Abbas that this verse was revealed in connection with the problems that occurred between 'Umar bin al-Khaththab and Abdullah bin Ubay in the war of the Bani Musthalik. They stopped at a well called Al-Muraisi', then Abdullah sent a young man to fetch water, but the young man returned a long time ago, Abdullah bin Ubay asked the young man why it took him so long to come back. The young man replied that Umar was sitting by the well. He did not let anyone take water before he filled the girbai (water jug from the skin) of the Prophet Muhammad saw, Abu Bakr's girbai, and Umar's former slave girbai, then Abdullah bin Ubay said, \"We and they are like a parable: Fatten your dog, then he will eat you.\" Then Abdullah's words reached Umar. He became angry, then drew his sword to kill Abdullah bin Ubay, so this verse came down which softened Umar's heart. Furthermore, Allah ordered Rasulullah SAW and his followers to be tolerant in facing the attitude of the polytheists and to forgive their actions that made fun of Allah's verses. They are people who oppose Allah and are not afraid of His threats. From this verse it is understood that the high ethical values taught by Islam to its adherents are to be tolerant and to forgive those who have acted unkindly towards them or have tried to destroy their religion. Forgiving the mistakes of family, colleagues, neighbors and acquaintances can easily be done by someone, but being tolerant and forgiving the actions of people who always want to harm themselves and their religion at every opportunity requires greatness of spirit. This verse teaches and educates Muslims to be tolerant, love to forgive, and have a big heart in facing everything in their life. At the end of this verse Allah explains why Rasulullah saw and his followers had to be tolerant and forgive the actions of the Quraysh who made fun of Allah's verses. The reason is because Allah will give them appropriate retribution according to their deeds."
		   },
		   {
			"id": 4488,
			"surah": 45,
			"ayat": 15,
			"tafsir": "In this verse Allah explains that each person will receive their respective rewards according to their deeds in the world. So whoever among His servants obeys all His commands and stays away from all His prohibitions with full sincerity and awareness, then the result will be for himself. He will get a place of return full of pleasure. On the other hand, whoever disobeys His commandments and does not stop His prohibitions, the bad consequences in return for his actions will befall him. He will get a bad, despicable place to return, and a very severe punishment in hell. At the end of this verse Allah explains that only to Allah all creatures are returned, not to others. Everything will be gathered in Padang Mahsyar to receive a fair decision from Allah. Among them there are those whose faces are beaming with joy because they will meet Allah which they have always hoped for while living in the world. They believe that God loves His servants who are steadfast, patient and always submissive and obedient to Him. On the other hand, there are also people whose faces are somber because their hearts are full of fear and regret. They are afraid to meet Allah because they will receive His wrath and will feel the most painful torments in hell."
		   },
		   {
			"id": 4489,
			"surah": 45,
			"ayat": 16,
			"tafsir": "In this verse Allah explains that the Children of Israel had been given the Book of the Torah, the ability to understand religion, prophethood, abundant sustenance and superiority over other nations at that time. The grace given by Allah to the Children of Israel at that time was in balance with the attitude and efforts of the Children of Israel to uphold the religion of Allah. Therefore, the priority given is also the priority of the world and the hereafter. In this verse, six kinds of gifts are mentioned, namely: First: the Book of the Torah. This book was revealed to Prophet Musa. In it there are instructions, lessons and provisions that can guide the Children of Israel to the right path. This book was specially revealed by Allah to the Children of Israel. Second: The ability to understand the religion of Allah. With this ability, Musa, Aaron and the leaders of their people could explain disputes that occurred among their people and with this ability Allah's religion could be explained to the Children of Israel properly. Third: Prophethood Many of the apostles and prophets sent by God were appointed from the Children of Israel; some of them were just prophets like Prophet Khidir, some were prophets and apostles like Moses, Harun, Ayyub, and others, and there were also prophets and apostles who were appointed from among them besides serving as prophets and apostles, as well as heads of state such as the Prophet David and Prophet Sulaiman. In this way, world and religious power was gathered in them. Fourth: Abundant sustenance The Children of Israel have been awarded by Allah the heyday and golden era during the reign of Prophet David and during the reign of his son Sulayman. Many stories tell of the majesty and glory of the Children of Israel during the reign of both the son and the father. The power and wisdom of Prophet David and Prophet Sulayman are explained in the Qur'an. What the Children of Israel had achieved at that time was not obtained by other nations who were contemporaries with them. Fifth: Their priority over other nations in their time, namely during the time of the Prophet David and Prophet Sulayman. Sixth: God has given them laws and teachings that are strengthened by miracles. This is what drives them to unite and they have no disputes but only light disputes that do not bring harm. However, when knowledge comes to them, they differ as stated in the word of God mentioned above. The dispute between them arose after a clear proof (argument) came because of the struggle over leadership and jealousy between them. In connection with the primacy of the Children of Israel, Ibn 'Abbas once said, \"There is no one among the people in this world who is loved by Allah more than they are.\" Allah has shown signs of His power that they can see, hear, and understand. They also followed all the instructions of Allah. Such was the condition of the Children of Israel at that time."
		   },
		   {
			"id": 4490,
			"surah": 45,
			"ayat": 17,
			"tafsir": "In this verse, it is explained that the sixth priority that Allah has given to the Children of Israel is that Allah has given them the ability to understand the arguments and explanations about religion. This information is sometimes in the form of laws, warnings, and sometimes in the form of miracles. Everything was well understood and implemented so that their life would be good, there would be no disputes among themselves and their community bonds would be good too, because of that there were many great efforts that they could do at that time. In fact, the provisions as above do not only apply to the Children of Israel, but also apply to all nations who want to carry out Allah's commands and keep away from His prohibitions and submit, obey and surrender to Him. If so, then the happiness obtained is not only in the form of worldly happiness, but also the happiness in the hereafter. It is as if with this verse Allah reminds people to imitate the life of the Children of Israel in ancient times. At the end of this verse Allah explains the causes of the dispute among the Children of Israel that came later. Their prophets used to explain that there would be a final Prophet who was sent to all humans. The prophet was a descendant of Abraham from his son Ishmael. After the Prophet in question came and gave information according to the information conveyed by their previous prophets, they also denied it, and did not believe it. The envy arose because the Prophet who was sent was not from Isaac's lineage, and they thought that Isaac's descendant was more noble than Ismail's descendant even though the two of them were blood brothers (Prophet Abraham). Therefore, it is inappropriate for the last prophets and apostles to be appointed from their descendants. Allah says: And they (the People of the Book) did not divide except after knowledge (the truth conveyed by the prophets) came to them out of envy among themselves. (asy-Shura\/42: 14) Regarding the matter they are arguing about, Allah will give His decision on the Day of Judgment and will explain the real reasons that led to the dispute between them. At that time, their jealousy and envy were clearly visible, which led to group fanatics so that the favors that originally had to be grateful for, instead made them arrogant and arrogant."
		   },
		   {
			"id": 4491,
			"surah": 45,
			"ayat": 18,
			"tafsir": "Then Allah ordered Rasulullah SAW not to be influenced by the attitude of the Quraysh people because Allah had determined Shari'a matters which must be used as a guide in determining religious affairs through the medium of revelation. So the rules contained in the revelation that must be followed, should not follow the desires of people who do not know it. The Shari'a brought by the previous apostles and the Shari'a brought by the Prophet Muhammad are of the same principle and essence, both are based on monotheism, guiding people to the right path, creating benefit in society, commanding to do good and preventing doing evil. If there is a difference, then the difference is not the main problem, only in the implementation of worship and the methods. It is adjusted to the circumstances, place and time."
		   },
		   {
			"id": 4492,
			"surah": 45,
			"ayat": 19,
			"tafsir": "In this verse Allah explains that polytheists do not know Allah's law and do not acknowledge His oneness. Therefore they will not be able to reject or avoid Allah's punishment that befalls them in the hereafter. Then it was explained that the polytheists helped each other in committing evil and disobedience. It was emphasized that their ruse was carried out by conspiring to hinder and undermine the religion of Islam and divide Muslims. Things like this they can do while living in this world, whereas in the hereafter they cannot do it. On that day, one cannot help others and cannot bear the sins of others; each person is responsible for his own actions. At the end of the verse, Allah confirms that He is the protector of the pious. The piety that they do to seek the pleasure of Allah is rewarded by Him with multiple rewards in the hereafter."
		   },
		   {
			"id": 4493,
			"surah": 45,
			"ayat": 20,
			"tafsir": "In this verse, Allah explains that the Qur'an is a guide for human life, guidance and mercy that is bestowed on His servants who believe in it. The Qur'an is called a guideline because it contains the arguments and religious information that they really need for human welfare in this world and their happiness in the hereafter. Allah's guidance and mercy will only be felt by people who truly believe and believe in Allah and His Messenger in carrying out the contents of the Qur'an."
		   },
		   {
			"id": 4494,
			"surah": 45,
			"ayat": 21,
			"tafsir": "Allah ordered His Messenger to ask the disbelievers of Mecca about their dispute with the aim of disproving their suspicions. They suspect that Allah will treat and will reward them in the same way as those who believe. Will Allah equate those who believe in Him but do not carry out His Shari'a with those who believe in carrying out His Shari'a. The answer is of course, no, absolutely not, as Allah says: The inhabitants of hell are not the same as the inhabitants of heaven; the inhabitants of heaven are the ones who gain the victory. (al-hasyr\/59: 20) In other verses, it is explained that the believers are not the same who carry out Allah's commands and keep away from His prohibitions with the wicked, namely people who believe and acknowledge the existence of Allah's commands and prohibitions, but does not carry them out, Allah says: Is a believer like a wicked person (infidel)? They are not the same. (as-Sajdah\/32: 18) At the end of this verse, Allah confirms that all the conjectures and conjectures of the disbelievers are untrue and impossible conjectures. Therefore, the Muslims should be aware of this assumption so that they are not influenced by it."
		   },
		   {
			"id": 4495,
			"surah": 45,
			"ayat": 22,
			"tafsir": "Allah explained that the heavens and the earth were created righteously, and had the purpose of creating according to His will. Nothing is created by God without a purpose. The purpose of the presence of one creation is to be used by another creation, in order to achieve the goals of the other creation. If an activity has no purpose, then what happens is la'ib, a game. The opposite word vanity, the opposite word haq is often used to explain the same thing, as in the verse below: And We did not create the heavens and the earth and what is between them in vain. That is the opinion of unbelievers, so woe to those who disbelieve because they will go to hell. (shad\/38: 27) As we have seen, the physical properties of the earth, such as its mass, structure, temperature, and so on are just right for life. However, these properties alone are not enough to allow life to exist on earth, another important factor is the composition of the atmosphere [see surahh Ibrahim\/14:19 and surahh al-Jatsiyah\/45: 3]. No other power can change God's will. Such provisions apply to all of His creation in accordance with His justice and Sunnah. Among Allah's justice is to give a fitting reward to His servants for their deeds and deeds on the Day of Judgment. Whoever does a good deed will receive his reward in accordance with the conditions that have been determined by Him, so whoever does a bad deed will receive a reward commensurahte with that evil deed. Why is it said that giving the appropriate reward is in accordance with God's justice. Because God created humans as His creatures, equipped with the inclination and ability to do good and do evil. Both or one of the two potentials can develop in a person. Its development is largely determined by circumstances, environment, and time. In addition, Allah has endowed man with a mind. With his mind, humans have the ability to evaluate stimuli that influence their actions and behavior. Before a person determines his attitude to do an act or not to do it, there is turmoil within him in considering and making a choice, which attitude or action he will take from the two actions. At such times, humans are given the freedom to choose between good and evil. In such agitation, the human soul gets pressures called psychological pressures. If he chooses and decides to do something good, then the action occurs based on his own choice. If he chooses the decision to do bad things, then it will happen because of his own choice too. Moments like that are the moments that determine whether he intentionally commits an act or he does it unintentionally. And also distinguish between the deeds done; whether the act was done consciously or not. That is why it is said that Allah's reward for His servants is in accordance with their deeds and deeds, that is the picture of Allah's justice."
		   },
		   {
			"id": 4496,
			"surah": 45,
			"ayat": 23,
			"tafsir": "Muqatil said that this verse was revealed related to the conversation between Abu Jahl and al-Walid bin al-Mugirah. One night Abu Jahal tawaf was in Baitullah with Walid. The two men discussed the condition of the Prophet Muhammad. Abu Jahl said, \"By Allah, actually I know that Muhammad is the right person.\" Al-Walid said to him, \"Just let it go, what do you care and what is the reason for your opinion?\" Abu Jahl replied, \"O Abu Abdisy Shams, we have named him a true, honest and trustworthy person in his youth, but after he is mature and perfect in his mind, we call him a liar and a traitor. By Allah, I actually know that he is true. \" Al-Walid said, \"What is it that prevents you from justifying and believing in his call?\" Abu Jahal replied, \"Later the Quraysh girls will gossip that I am a follower of the orphan Abu Talib, even though I am from the highest tribe. For the sake of Al-Lata da Al-Uzza, I will not be his follower forever.\" Then came down this verse. Furthermore, in this verse Allah explains the condition of the Meccan unbelievers who were immersed in evil deeds. Everything they do is caused by the urge of their lust because they have been tempted by Satan's deception. There are no more truth values that underlie their behavior and actions. What is good according to their lusts is what they do. It's as if they regard their passions as a god that they must follow his orders. They have forgotten that their presence in this mortal world has a purpose and purpose. There is a mission that they must carry, namely as the caliph of Allah on earth. They have wasted the position given to them by Allah as God's creatures that are the best in shape and have the best abilities. They do not realize that they will have to account for all their actions to Allah later and that Allah will repay every deed with a proper reward. This is what is meant by the word of Allah: So whoever does an atom's weight of good, surely he will see (reply) it, and whoever does an atom's weight of evil, surely he will see (reply) it. (az-Zalzalah\/99: 7-8) Actually, the lust that exists in humans is a priceless gift that God has given to humans. In addition, Allah gave reason and religion to humans so that with both of them humans can control their desires. If a person controls his desires in accordance with common sense considerations and does not conflict with religious guidance, then such a person has acted according to his nature. But if a person indulges his desires without sound reasoning and is no longer guided by religious demands, then that person has been enslaved by his desires. That means that he has deviated from his fitrah and fell into error. Based on the information above, then in following their desires, humans are divided into two groups. The first group is a group that can control their lust; they are the pious. While the second group is people who are controlled by their desires. They are sinners and always wallowing in the mire of evil. Ibn 'Abbas said, \"Every time Allah mentions lust in the Qur'an, every time He rebukes it.\" Allah said: And if We wanted, We would have raised (degrees) him with (the verses), but he tends to the world and follows his (low) desires, then his example is like a dog, if you drive him out his tongue and if you let him stuck out his tongue (too). Such is the parable of those who deny Our signs. Then tell the stories to make them think. (al-A'raf\/7: 176) In another verse: And do not follow your desires, for they will lead you astray from the way of Allah. (shad\/38: 26) In this verse, Allah commends those who can control their desires and promises him a place to return to which is full of pleasure. Allah says: And as for those who fear the greatness of their Lord and refrain from (desires) their lusts, then verily, heaven is (his) abode. (an-Nazi'at\/79: 40-41) There are many hadiths of the Prophet that denounce those who follow their desires. It was narrated by 'Abdullah bin 'Amr bin 'As that the Prophet said: Does not believe someone from among you so that his lust is subject to what I brought (guidance). act for the benefit of the afterlife. But the wrongdoer is the one who follows his own desires and hopes for the impossible from Allah. (History of at-Tirmidhi and Ibn Majah) People who always indulge their lust usually lose control of themselves. That is why he fell into error because he did not want to pay attention to the instructions given to him, and the consequences of the evil deeds he had done because he followed his passions. The condition of a person who indulges his desires is likened to a person whose heart is locked so that he is no longer able to judge what is good and what is bad, and like a person whose ears are clogged so that he is no longer able to pay attention to the signs of Allah's power in the heavens and on earth. and like a person whose eyes are closed cannot see and know the truth of the existence of Allah, the Creator of all things. Furthermore, Allah ordered His Messenger not to justify the attitude of the disbelievers of Mecca by saying that no power would guide other than Allah after they strayed from the straight path. At the end of this verse, Allah reminds them why they do not take lessons from the universe, what happened to themselves, and the punishment that befell the previous nations as proof that Allah Almighty has the right to be worshipped."
		   },
		   {
			"id": 4497,
			"surah": 45,
			"ayat": 24,
			"tafsir": "In this verse Allah explains the disbelief of polytheists towards the day of resurrection. According to their assumption that life is only in the world. In the world they are born and in the world they die and that's where everything ends, and the same thing happened to their ancestors. According to them, what causes the death and destruction of all things is the change of time. From their opinion, it can be concluded that they deny the resurrection day. This explanation is reinforced by the customs of the Jahiliyyah Arabs, namely when disaster or calamity befalls them, the words come out of their mouths, \"Oh, woe to the times.\" They swear at the masses because they think that the period is the source of all calamities. In the Qudsi hadith from Abu Hurairah, the Prophet said: Allah said: Allah said, \"Man has hurt me by saying O unlucky period. So don't one of you say 'unlucky period because I am the (Creator and Ruler) of the period. I'm waiting for the night to turn into day, and If I wanted it, I would have held both of them.\" (Muslim history) Then Allah regretted the attitude of the Meccan polytheists who were not based on true knowledge. God declared that they had absolutely no knowledge of the matters pertaining to that time. Their opinion is only based on conjecture and conjecture."
		   },
		   {
			"id": 4498,
			"surah": 45,
			"ayat": 25,
			"tafsir": "In this verse, Allah explains and confirms that their opinion is really based on conjecture and conjecture, which leads to the denial of the resurrection day. When Allah's verses were read to them which contained information about the evidence for the Day of Resurrection, they did not want to understand the information put forward, and they also challenged the Messenger of Allah (saw) so that he would revive those who had died. If the Messenger of Allah could do that, then they would believe. From their attitude like that, it can be concluded that they really have been controlled by their passions, no longer use their minds properly so that they do not want to accept all the truth conveyed by the Messenger of Allah, that the day of resurrection will come when that has been determined, namely after all living humans are killed and the universe and everything in it is destroyed. But this does not make them understand and acknowledge."
		   },
		   {
			"id": 4499,
			"surah": 45,
			"ayat": 26,
			"tafsir": "In this verse Allah commands His Messenger to explain to the polytheists of Mecca, that it is Allah who has the power to give life and death to His creatures. Previously they did not exist and were inanimate objects, after that by the power of Allah they were made living beings in the world for a specified period of time. When it reaches the specified time, they are turned off. Then they will be resurrected on the Day of Judgment to be accountable for all the actions they have done while living in the world. Allah confirms that the occurrence of the Day of Judgment is a certain event, there is not the slightest doubt. If God has the power to give life and death, surely He also has the power to revive and reassemble the parts of their bodies that have been scattered to the ground. Repeating an action is easier than creating it the first time. And for Allah, there is no deed that is difficult. At the end of this verse, Allah regrets why most polytheists do not believe in the truth of the day of resurrection and continue to deny it on the grounds that it is impossible for a person who has died, whose body has been crushed to pieces with the ground, whose bones have been scattered, that it is impossible to come back to life. Allah says: And indeed, (the day of) the Hour will surely come, there is no doubt about it; and indeed, Allah will resurrect whoever is in the grave. (al-hajj\/22: 7)"
		   },
		   {
			"id": 4500,
			"surah": 45,
			"ayat": 27,
			"tafsir": "Allah explained that the one who has power in the heavens and on earth is Allah. There is nothing beyond His power that applies according to His will. There is no other ruler besides Him and there are no other gods worthy of worship besides Him. His dominion encompasses all nature; world and the hereafter. Allah also reigns at the end of the natural world and the beginning of the hereafter. At that time humans will be resurrected from the grave. All humans will be brought to Padang Mahsyar to face trial. At that time, their deeds would be scrutinized. Each person will receive a record of his deeds as long as he lives in the world, which is made carefully by the angels who record the deeds. On that day, the gloom of the disbelievers appeared to deny the truth of Allah's verses. That melancholy turned into great misery and suffering when they were dragged to hell, that's where they showed their regrets, but the regrets were useless."
		   },
		   {
			"id": 4501,
			"surah": 45,
			"ayat": 28,
			"tafsir": "In this verse, Allah explains the condition of humans on the day of the decision and the enormity of the commotion while waiting for the decisive moments, namely: 1. On that day, humans kneel and kneel before God, the ruler of all nature, to receive an account of his deeds. them and accept the final decision that will be made upon them. 2. On that day, they were summoned to see their records made by angels. Then they check whether there are any of their actions that have not been recorded or are there those that are recorded, but not in accordance with what they have done. If their recorded actions are in accordance with what was ordered by the religion that their apostle brought, then they will get happiness and luck, whereas if they are not in accordance with the orders and violate the prohibitions of their religion a lot, then they will get accidents and doom in hell. Allah says: And the earth (Padang Mahsyar) becomes bright with the light (justice) of its Lord; and books (an account of their deeds) were given (to each one), prophets and witnesses were presented, then a decision was given between them fairly, while they were not harmed. (az-Zumar\/39: 69) In another verse Allah says: And put the book (record of charity), then you will see the sinners fear what is (written) in it, and they say, \"How wretched we are, what book is this, nothing is left behind, the small and the large but everything is recorded,\" and they find (all) what they have done (written). And your Lord does not wrong anyone. (al-Kahf\/18: 49) At that time, humans received a call. They were told that it was on that day that they would receive a reward for their deeds in proportion."
		   },
		   {
			"id": 4502,
			"surah": 45,
			"ayat": 29,
			"tafsir": "Allah declares His word to all mankind that the books that contain records of deeds are the true books, there is no mistake in them, they were made on the basis of the command of Allah Almighty, which is the basis for consideration in determining decisions for the people. man. Allah also states that when that person lives in the world, recorders of deeds have been deployed, both good deeds and bad deeds. The record cannot be wrong because it is made with great accuracy as evidence which cannot be doubted"
		   },
		   {
			"id": 4503,
			"surah": 45,
			"ayat": 30,
			"tafsir": "Then Allah explains the condition of those who believe and do good deeds. They will be rewarded according to their deeds. They include servants of God who get an abundance of His grace. What is meant by God's mercy in this verse is heaven. This is in accordance with the meaning of the hadith narrated by Abu Hurairah: ) Truly Allah says to heaven, \"You are My mercy. With you I bestow My love on those whom I will.\" (Al-Bukhari and Muslim) At the end of this verse, Allah confirms that heaven is happiness that will be achieved by those who believe because of the abundant blessings that will be felt by its inhabitants."
		   },
		   {
			"id": 4504,
			"surah": 45,
			"ayat": 31,
			"tafsir": "In this verse Allah explains the condition of those who deny His oneness. They always receive ridicule and humiliation because Allah's messengers have been brought to them who have recited His verses, but they are arrogant and stubborn. Because of that they will feel God's humiliating punishment caused by the sinful acts they have done. At that moment, they stuttered because they saw the reality they used to deny."
		   },
		   {
			"id": 4505,
			"surah": 45,
			"ayat": 32,
			"tafsir": "In this verse, Allah explains the regret of those who deny the Day of Resurrection. While still on earth, when they were told the news about the resurrection day, they thought that the news of the resurrection day was strange and impossible news. For them it was impossible to resurrect a dead person whose bones had been scattered and his whole body had crumbled to the ground. But later, after they face the reality and are faced with the most horrific torments, then they will regret their previous attitudes and actions which were based solely on conjecture and prejudice, not based on knowledge and belief in Allah, the Almighty Ruler of the Universe."
		   },
		   {
			"id": 4506,
			"surah": 45,
			"ayat": 33,
			"tafsir": "Then Allah explained the condition of the polytheists when their crimes were clearly exposed. They stuttered to face such a big responsibility. They are afraid to see their piled up sins that they have to atone for with the torments of hell which they are so afraid of. They also realized at that moment that no one could defend them; their power in the world, abundant wealth, their children and grandchildren, conspiratorial friends, and so on were all meaningless at that time. The only choice they could make at that time was to wait for a decision and surrender to accept Allah's punishment."
		   },
		   {
			"id": 4507,
			"surah": 45,
			"ayat": 34,
			"tafsir": "In this verse, Allah explains the ridicule, humiliation and punishment they will bear on the Day of Judgment. On that day, Allah will not pay attention to their screams and cries, their wails and regrets because everything they experienced was truly a balanced retribution for their deeds in the world before. In the world they persecute and slander innocent people, justify what is forbidden for their personal and group interests; Allah will reward them according to their deeds in the hereafter. If Allah ignores them because of the arrogant and arrogant attitude they have carried out, as well as the inhuman attitude they have carried out. Then such an attitude is a reasonable reply in accordance with His justice."
		   },
		   {
			"id": 4508,
			"surah": 45,
			"ayat": 35,
			"tafsir": "In this verse Allah explains why the disbelievers have to accept the terrible punishment and punishment, the reasons are: 1. Because when they lived in the world, they made fun of Allah's verses conveyed to them through His Messenger. This attitude is considered as an attitude full of arrogance and arrogance. They also want to undermine the faith that has seeped into the hearts of the Muslims with various excuses and methods. 2. They have been deceived by the pleasures of life in this world, so they forget the afterlife which is the ultimate goal of human life. That is why when Allah makes His decision, there is no possibility for them to escape punishment and there is no forgiveness for them."
		   },
		   {
			"id": 4509,
			"surah": 45,
			"ayat": 36,
			"tafsir": "These two verses are the closing verses of surah al-Jatsiyah. In these verses Allah mentions some of His attributes that have to do with the basis for decision-making on the Day of Judgment, namely: 1. He is Praiseworthy, therefore to Him be all praise. This expression gives an understanding that all the blessings that humans get while living in the world come from Allah so that humans can carry out their duties as His caliph on earth, not to act arbitrarily and follow lust. If humans are not grateful for these blessings and do not use them according to what they should, surely that person will receive His wrath and punishment. 2. Allah is Almighty, He controls the universe. These words give the sense that everything in the heavens and on earth is in His power. He rules the world and the hereafter. 3. He is Supreme, because majesty and arrogance are only for Allah in the heavens and on earth and His power is above all powers. 4. He is Almighty, His decisions cannot be rejected, cannot be changed by anyone, and nothing can match His power. 5. He is All-Wise. Meaning: Allah in setting His commands to all His creatures, always accompanied by rules, calculations, and success and certainty, occurs according to what He wills."
		   },
		   {
			"id": 4510,
			"surah": 45,
			"ayat": 37,
			"tafsir": "These two verses are the closing verses of surah al-Jatsiyah. In these verses Allah mentions some of His attributes that have to do with the basis for decision-making on the Day of Judgment, namely: 1. He is Praiseworthy, therefore to Him be all praise. This expression gives an understanding that all the blessings that humans get while living in the world come from Allah so that humans can carry out their duties as His caliph on earth, not to act arbitrarily and follow lust. If humans are not grateful for these blessings and do not use them according to what they should, surely that person will receive His wrath and punishment. 2. Allah is Almighty, He controls the universe. These words give the sense that everything in the heavens and on earth is in His power. He rules the world and the hereafter. 3. He is Supreme, because majesty and arrogance are only for Allah in the heavens and on earth and His power is above all powers. 4. He is Almighty, His decisions cannot be rejected, cannot be changed by anyone, and nothing can match His power. 5. He is All-Wise. Meaning: Allah in setting His commands to all His creatures, always accompanied by rules, calculations, and success and certainty, occurs according to what He wills."
		   }
	]
}
