{
	"tafseer": [
		{
			"id": 5448,
			"surah": 72,
			"ayat": 1,
			"tafsir": "In this verse, Allah commands His Messenger to convey to his companions about the jinn who believe in Allah. The belief in the jinn implies: 1. that the Prophet Muhammad is a messenger for mankind and also for the jinn, as also expressed in other verses. 2. that the jinn hear and understand human language, as also stated in other verses. 3. that the jinn will also be judged just like humans. 4. that there are jinn who also preach to their people. 5. So that the people of Quraysh know that when they hear the Qur'an, only the jinn acknowledge their miracles and have faith in them. Based on the meaning of this verse, it is understood that the Prophet Muhammad knew that the jinn heard his recitation through revelation, not by witnessing it with his own eyes."
		   },
		   {
			"id": 5449,
			"surah": 72,
			"ayat": 2,
			"tafsir": "As in the first verse, in this second verse Allah states that the jinn have heard the Qur'an which amazes them because it guides them to the right path, then they believe. They were determined not to associate anything with Allah. What they heard and their attitude after that was also conveyed to their people, as also mentioned in another verse: So when it was finished, they returned to their people (to) give a warning. (al-Ahqaf\/46: 29)"
		   },
		   {
			"id": 5450,
			"surah": 72,
			"ayat": 3,
			"tafsir": "In this verse, it is explained that just as they avoid associating themselves from associating partners with Allah, the jinn also purify Him from having a wife or children. Having friends, wife and children is only a human need, as Allah says: And among His signs (greatness) is that He creates partners for you from your own kind, so that you are inclined and feel at ease with him. (ar-Rum\/30: 21)"
		   },
		   {
			"id": 5451,
			"surah": 72,
			"ayat": 4,
			"tafsir": "In this verse, it is revealed that among the jinn there are those who utter words which are far from the truth, namely that Allah has children and female friends."
		   },
		   {
			"id": 5452,
			"surah": 72,
			"ayat": 5,
			"tafsir": "In this verse it is explained that the jinn declares that it is inappropriate for both jinn and humans to dare to say that Allah has children and has a wife."
		   },
		   {
			"id": 5453,
			"surah": 72,
			"ayat": 6,
			"tafsir": "The genie also said that many of the humans took refuge and begged the jinn. This causes humans to be controlled by jinns, and brought to commit crimes so that they are disobedient and sinful. Allah's Word: And (remember) on the day when He gathered them all together (and Allah said), \"O group of jinns! You have (misled) many people….\" (al-An'am\/6: 128)"
		   },
		   {
			"id": 5454,
			"surah": 72,
			"ayat": 7,
			"tafsir": "He further explained that the unbelieving jinn thought, as humans expected, that Allah would not send any messengers to His creatures to invite them to monotheism and faith in Him and the Day of Judgment."
		   },
		   {
			"id": 5455,
			"surah": 72,
			"ayat": 8,
			"tafsir": "In this verse, Allah adds another statement to the jinn when He sent the Prophet Muhammad and sent down the Qur'an to him and protected him from the jinn. The sky at that time was strictly guarded, and fiery arrows were provided in all corners of the sky to prevent the jinn from approaching it to steal the news that could be heard, as they often did. It has been narrated by at-Tirmidhi, and ath-thabrani from Ibn 'Abbas, he said: Previously the jinns could ascend to the sky to hear revelations. When they hear a word then they add nine other words. The sayings (which they heard) were true but their additions were all lies. When the Prophet was sent as an apostle, they were forbidden to occupy these places. Then they conveyed the prohibition to Satan; whereas at that time the stars had not been used to shoot the jinn. Then the devil said to them, \"The ban was caused by an incident on earth,\" then the devil sent his soldiers to investigate the incident. They found the Prophet peace be upon him praying between two mountains in Mecca, then they went to the Devil and presented their findings to him, then the Devil said, \"This is what happened on the surface of the earth.\" (History of at-Tirmizi and ath-thabrani)"
		   },
		   {
			"id": 5456,
			"surah": 72,
			"ayat": 9,
			"tafsir": "In this verse, it is again explained about the testimony of the jinn that they occupied these places without any guards and arrows of fire. They were then expelled from there so that they could not steal or even hear the Koran to be conveyed to astrologers and sorcerers who would mix up the truth with the falsehood. This is due to Allah's love for His servants and as a safeguard against His book, the Qur'an. So whoever wants to steal the news from then on he will be chased with fiery arrows that will stab and destroy him. We have to believe in what the Qur'an reports about the jinn stealing news that can be heard, then they were banned after the sending of the Prophet Muhammad, although we don't know how they steal, how they guard, how many guards. We also don't know what is meant by the fiery arrows peeking at them, while the jinn also come from fire, so how can they be penetrated by those fiery arrows. Some of the mufassirs are of the opinion that what is meant by \"places to steal news\" are places that are used by the jinn in the human chest to tempt them and prevent them from following the right path. Whereas what is meant by \"guardians\" are the arguments of the intellect (reason\/ratio) that Allah makes as a guide for His servants, and what is meant by \"fire arrows\" are natural evidences that are scattered in each person's body. each and every corner of the world. Thus, the meaning of the verse is that the Qur'an, which contains scientific and natural evidence, is the guardian of religion from doubtful things brought up by Satan, as a tool to tempt and confuse those he can seduce. Also to influence the souls of people who go astray so that they ignore religion and reject its instructions. So whoever wants to influence the souls of believers with doubts and absurd thoughts, then he will be faced with evidence that can eradicate these doubts from their roots."
		   },
		   {
			"id": 5457,
			"surah": 72,
			"ayat": 10,
			"tafsir": "In this verse, Allah adds another description of the jinn regarding their belief that the sky is guarded for one of two reasons: 1. because Allah will suddenly send down His punishment on the inhabitants of the earth. 2.because he will send an apostle who will guide humanity and improve their condition. It was as if the genie was saying, \"Is it because Allah will punish the inhabitants of the earth that we are prohibited from stealing news, and stone anyone who dares to steal the news with fiery arrows, or because Allah wants to guide people by sending a messenger who will guide them to the straight path?”"
		   },
		   {
			"id": 5458,
			"surah": 72,
			"ayat": 11,
			"tafsir": "In a further statement, Allah stated that among the jinn there were Muslims, did good deeds, and obeyed Allah, but there were also the opposite, namely those who did not believe and disobeyed Allah's commandments. The jinn also have various desires and different opinions, so that some of them are believers, some are wicked, and some are disbelievers, just like humans."
		   },
		   {
			"id": 5459,
			"surah": 72,
			"ayat": 12,
			"tafsir": "The demons also explained that they believed they would not be separated from Allah's grip, wherever they were in this world, and also could not escape. Allah is in control of the jinn wherever they are and there is no way to escape from Him."
		   },
		   {
			"id": 5460,
			"surah": 72,
			"ayat": 13,
			"tafsir": "It was also explained that when the jinns hear the Qur'an which guides them to the right path, they immediately believe in it and acknowledge that the Qur'an is from Allah. According to Qatadah, this verse has the meaning that whoever believes in Allah and justifies what the apostles brought, there is no concern for him about reducing his merits and there are no other people's sins that he must be responsible for. He will receive the full reward of good deeds without any reduction."
		   },
		   {
			"id": 5461,
			"surah": 72,
			"ayat": 14,
			"tafsir": "In this verse, it is explained that among the jinn there are those who believe in obeying Allah, are solemn and sincere, and do good deeds. There are also those who turn away from the true teachings. Therefore, whoever believes in Allah and obeys Him, he has actually followed the path that will lead him to happiness. It also means that he has done something that saves him from the torments of hell."
		   },
		   {
			"id": 5462,
			"surah": 72,
			"ayat": 15,
			"tafsir": "The believing genies denounce the disbelieving jinn, with their own affirmation, that the jinn who turn away from the provisions of Islam will be fueled in hell and tortured in it, just like human beings who disbelieve. They also stated that whoever obeys (Islam), then they really have chosen the straight path. Everything described in the past verses is the statement of the jinn revealed by Allah. In the following, Allah continues His revelations which were conveyed to Rasulullah saw."
		   },
		   {
			"id": 5463,
			"surah": 72,
			"ayat": 16,
			"tafsir": "In this verse, Allah reveals that whoever among humans or jinn adheres to and adheres to Islamic provisions, Allah will expand their sustenance and make all their worldly affairs easier. In order to widen sustenance, Allah expresses it with the word \"fresh water\", because water is the source of life. Lots of water means wide happiness. Allah's Word: And if the inhabitants of the land had faith and were pious, We would surely bestow upon them blessings from the heavens and the earth. (al-A'raf\/7: 96)"
		   },
		   {
			"id": 5464,
			"surah": 72,
			"ayat": 17,
			"tafsir": "Allah explains in this verse that they are given the opportunity of life to test and observe which of them are grateful for His blessings and who deny them. For those who are grateful, Allah provides the most perfect reward, and for those who deny, Allah provides opportunities and postpones His torment. Only then did Allah drop His punishment. In another verse, Allah says: And I gave them a grace period. Truly, My plans are firm. (al-Qalam\/68: 45) Furthermore, Allah explains that whoever turns away from the Qur'an and His guidance, without following His commands and not staying away from His prohibitions, Allah will punish him with punishment. the most terrible and he could not escape from Him."
		   },
		   {
			"id": 5465,
			"surah": 72,
			"ayat": 18,
			"tafsir": "In this verse, Allah states that the mosques are His. Therefore, there should be no worship in it other than Him and not associate partners with Him. Qatadah said, \"Jews and Christians when they enter churches and places of worship, they associate partners with Allah with other gods. -Hasan al-Basri said, \"What is meant by mosques are all the places of prostration on earth, whether those have been prepared for prostration or not, because the whole earth is a place of prostration for the people of the Prophet Muhammad.\" This kind of understanding is a mosque in a simple sense or language, as the words of the Prophet narrated by al-Bukhari, Muslim, and an-Nasa'i from Jabir: This earth has been made entirely for me as a place of prostration and purification.(History of al-Bukhari, Muslim, and an-Nasa'i ) The mosque is not only for prayer, but for various other worship activities."
		   },
		   {
			"id": 5466,
			"surah": 72,
			"ayat": 19,
			"tafsir": "In this verse, it is explained that when the Prophet Muhammad worshiped Allah, the jinns who witnessed him were astonished and amazed at the way the Prophet and his companions worshiped Him. The amazement was also due to the recitation of the Qur'an which they had never heard of. Even more so when you see the companions as members following the Prophet Muhammad in prayer while standing, bowing, and prostrating. Al-hasan and Qatadah said, \"When the servant of Allah broadcasts the treatise by calling to monotheism of Allah, in contrast to the worship of the polytheists to their idols, then almost the disbelievers who oppose and are hostile to the Prophet Muhammad, unite and help help in antagonizing Him."
		   },
		   {
			"id": 5467,
			"surah": 72,
			"ayat": 20,
			"tafsir": "In this verse, Allah instructs the Prophet Muhammad to tell his enemies that he only worships Allah and does not associate anything with Him. Such a thing is not something extraordinary nor is it something to be hated, so that they are hostile to it."
		   },
		   {
			"id": 5468,
			"surah": 72,
			"ayat": 21,
			"tafsir": "Allah stated that the Prophet Muhammad could not act differently in this matter, was unable to provide guidance, and bring happiness or goodness to them. Allah ordered the Prophet to convey to the disbelievers that he could not bring any harm to them, either in matters of religion or worldly matters, nor could he benefit them either. Only God can do so completely. Allah owns everything and He is the Almighty over all things. The Prophet Muhammad was also commanded to put his trust in Allah because it is He who will reward him for his good deeds. He is also the one who will repay the disbelievers for the bad actions they have committed. This also means that the Prophet would not abandon da'wah even though the disbelievers continued to oppose him."
		   },
		   {
			"id": 5469,
			"surah": 72,
			"ayat": 22,
			"tafsir": "In these verses, Allah states that the Prophet Muhammad was unable to protect himself any more than he was able to protect others. Therefore, Allah ordered His Prophet to say that no one among Allah's creatures could protect him from harm if Allah so willed. Nothing can help him and there is no refuge except in Allah. If the Holy Prophet continued to carry out the message and obeyed Him, Allah would surely protect him. That is, no one will defend the Prophet from Allah's threats if he does not carry out His message. The Prophet is only tasked with conveying God's messages and warnings as He says: O Messenger! Convey what your Lord has revealed to you. If you don't do (what was ordered) it means you are not conveying His message. And Allah keeps you from (disturbing) humans. (al-Ma'idah\/5: 67) Furthermore, Allah explains that whoever dares to disobey an order or prohibition and deceives His Messenger, hell has been prepared for him in which he will live forever. He will not be able to escape from that hell."
		   },
		   {
			"id": 5470,
			"surah": 72,
			"ayat": 23,
			"tafsir": "In these verses, Allah states that the Prophet Muhammad was unable to protect himself any more than he was able to protect others. Therefore, Allah ordered His Prophet to say that no one among Allah's creatures could protect him from harm if Allah so willed. Nothing can help him and there is no refuge except in Allah. If the Holy Prophet continued to carry out the message and obeyed Him, Allah would surely protect him. That is, no one will defend the Prophet from Allah's threats if he does not carry out His message. The Prophet is only tasked with conveying God's messages and warnings as He says: O Messenger! Convey what your Lord has revealed to you. If you don't do (what was ordered) it means you are not conveying His message. And Allah keeps you from (disturbing) humans. (al-Ma'idah\/5: 67) Furthermore, Allah explains that whoever dares to disobey an order or prohibition and deceives His Messenger, hell has been prepared for him in which he will live forever. He will not be able to escape from that hell."
		   },
		   {
			"id": 5471,
			"surah": 72,
			"ayat": 24,
			"tafsir": "Allah then comforted and reassured the Prophet Muhammad and ridiculed the disbelievers for their lack of attention to the jinn, while they claimed to be clever, and also because of their carelessness they lied and mocked something. But besides that, they are quick to admit the truth of the genie and hope for guidance from it. In this verse, Allah explains that the disbelievers always insult and ridicule the believers so that they see with their own eyes the torments promised to them. Only then will they realize who is actually the despicable one, are the believers who believe in Allah alone or are the polytheists who have no helpers and helpers? ¦ so that when they have seen what was threatened to them, both the doom and the Last Hour, then they will know who is worse position and weaker army. (Maryam\/19: 75)"
		   },
		   {
			"id": 5472,
			"surah": 72,
			"ayat": 25,
			"tafsir": "This verse and the verses that follow are the answer to the question, \"When will the day that was promised come to us.\" Allah ordered His Prophet to convey to mankind that the Day of Judgment will definitely come, there is no doubt about it. However, no one knows when the time will come, whether it will be in the near future or in the long term. The Prophet saw was once asked by Gabriel about the Day of Judgment when he was confronted by the Prophet in the form of a Bedouin, but he did not answer. Among other things Jibril asked, \"O Muhammad! Inform me about the Day of Judgment.\" He replied, \"The one who is asked does not know more than the one asking.\" Then the Bedouin asked again in a loud voice, \"O Muhammad! When will the Day of Judgment come?\" The Prophet replied, \"Don't worry, he will definitely come, but what have you prepared to deal with him?\" The Bedouin replied, \"I don't pray much or fast, but I love Allah and His Messenger.\" Then the Prophet said, \"Then you are with those you love.\" Anas said, \"The believers are not as happy about something as they are happy to hear this hadith.\""
		   },
		   {
			"id": 5473,
			"surah": 72,
			"ayat": 26,
			"tafsir": "In this verse, Allah explains that He knows all that is unseen, unseen, and not known by His servants. Everything that is unseen that cannot be known except by Allah, can be known by the apostles who are pleased by Him and He will show them only what He wants. Allah says: And they know nothing about His knowledge except what He wills. (al-Baqarah\/2: 255) This verse shows that the work of sorcerers, astrologers, and sorcerers is all wrong because they are not among those whom Allah pleases, in fact they are among those He hates. This verse also explains that those who claim that the star can show who will live and who will die, are people who have disbelieved and denied the Qur'an. Fakhruddin ar-Razi said, \"What is meant by not being able to witness the unseen is a special occult, namely about the time of the Doomsday.\""
		   },
		   {
			"id": 5474,
			"surah": 72,
			"ayat": 27,
			"tafsir": "Furthermore, Allah revealed that the apostles who obtained His pleasure so that they could witness the unseen world, were guarded by the angel Hafadhah with very strict guard. With that guard, the temptations of satan, jinn, and other troublemakers did not reach them, so that the apostles could convey God's revelations according to their origins. They are also guarded from the undermining of human demons so that they are safe from human harm and harm. Adh-ahhak said, \"God does not send an apostle unless he has prepared guards from angels to protect him from demons who come in the form of angels. When the demons come, the guards remind him to be careful because those who come it's a demon, and if the one who meets the apostle is an angel, then the guards say, \"This is the messenger of your Lord.\" These guards are angels whose job is to guard the physical and spiritual strength of the apostles and to protect them from the whispers of Satan."
		   },
		   {
			"id": 5475,
			"surah": 72,
			"ayat": 28,
			"tafsir": "In this verse, Allah explains the purpose of this very neat guard, namely so that the apostles can carry out their duties perfectly and so that the revelations conveyed to them are well preserved. This safeguard also aims to prove with certainty that the apostles conveyed their Lord's message to mankind in the best way possible. Allah says: And Allah certainly knows those who believe and He certainly knows those who are hypocrites. (al-'Ankabut\/29: 11) Furthermore, Allah explained that His knowledge includes what is known by the guardian angels, what has existed, and what will exist one by one. He knows everything perfectly, there is no comparison. The angel is an intermediary who conveys His knowledge to the apostles."
		   }
	]
}
