{
	"tafseer": [
		{
			"id": 5272,
			"surah": 68,
			"ayat": 1,
			"tafsir": "Commentators differ on the meaning of the letter \"nun\" in this verse. (Next, see volume I in the description of the hijaiah letters found at the beginning of the surahhs in the Qur'an). In this verse Allah swears by the al-qalam (pen) and all kinds written with it. An oath is made to convince the listener or the person being spoken to that the speech or words conveyed are true, without the slightest doubt. However, the oath sometimes has another meaning, namely to remind the person being spoken to or the listener that the person being used to swear is something noble, valuable, useful, and valuable. Therefore, it is necessary to think about and contemplate so that it can become an illustration and teaching in the life of this mortal world. Oaths in this second meaning are the oaths of Allah contained in surahhs of the Qur'an, such as wal-'asr (by the times), was-sama' (by the sky), wal-fajr (by the dawn), and etc. As if with that oath, Allah reminds people to pay attention to the time of day, the sky, dawn, and so on. Everything related to those mentioned needs to be considered because it has something to do with life and human life in achieving happiness in this world and in the hereafter. In this verse, Allah swears by the qalam (pen) and everything that is written with it. This is to state that the qalam is one of the great blessings bestowed by Allah to humans, in addition to the pleasure of being good at speaking and explaining things to others. With a qalam, people can record the teachings of Allah's religion that were conveyed to His apostles, and record the knowledge of Allah that they have just discovered. With a letter written in qalam, people can convey good news and sad news to their family and close friends. With qalam, people can educate and educate their people, and many more benefits that humans get with this qalam. At the time of the Prophet Muhammad, the Arab community was familiar with the qalam and its use, namely to write everything that was felt, that was thought, and that would be conveyed to other people. Even so, not many of them use it because there are still many who are illiterate and science has not yet developed. At that time, the use of the qalam as a means of conveying Allah's religion was felt. With qalam, the verses of the Qur'an were written on palm fronds and animal bones at the behest of the Prophet. He himself really appreciates people who are good at writing and reading. This can be seen in the decision of the Prophet Muhammad during the Battle of Badr, namely that an infidel who was captured by the Muslims could be released by paying a ransom or by teaching the Muslims to write and read. With this verse, it is as if Allah is hinting to the Muslims that His knowledge is vast, boundless and infinite. Therefore, seek and demand His vast knowledge so that it can be utilized for worldly interests. To record and convey knowledge to others and so that it is not lost due to forgetfulness or the person who has it dies, a qalam is needed as a tool to write it down. Therefore, qalam is closely related and cannot be separated from the development of knowledge, welfare and benefit of mankind. The time of revelation of this verse is close to the verses of the Qur'an that were first revealed by Allah to the Prophet Muhammad, namely the first five verses of surahh al-'Alaq. After the Prophet received verses 1-5 of surahh al-'Alaq, he returned to his house in a state of trembling and fear. After losing his fear and fear, the Prophet was brought by Khadijah, his wife, to the house of Waraqah bin Naufal, the son of his father's brother (cousin). Everything that happened to the Prophet himself in the cave of Hira was conveyed to Waraqah, and in response to this, he said, \"What came to Muhammad saw was like what had come to the previous prophets. Therefore, what the angel Gabriel conveyed was religion that really comes from God. Then Waraqah said that he would follow the religion that Muhammad brought."
		   },
		   {
			"id": 5273,
			"surah": 68,
			"ayat": 2,
			"tafsir": "In this verse, Allah stated emphatically to the Prophet Muhammad that he did not need any favors from anyone other than the blessings of Allah. Is it possible that Muhammad was said to be a madman, because he received enormous favors and gifts from Allah? In another verse it is stated: And they said, \"O he to whom the Qur'an was sent down, you (Muhammad) are truly mad.\" (al-hijr\/15: 6) After the Quraysh learned about Waraqah bin Naufal's statement and the Prophet conveyed the religion of Islam to them, they accused Muhammad saw of being possessed by madness or a sorcerer who wanted to turn the Quraysh away from religion. their ancestors. Therefore, they ordered their people not to ever listen to the words of Muhammad, and not to believe that what he received was really Allah's religion. Is it possible for a human being, a madman or a sorcerer to be trusted by Allah to convey His religion? In connection with the attitude of the Quraysh people, this verse was revealed to strengthen Muhammad's message, strengthen his heart, and remind him of the gifts that had been bestowed upon him. With this, Allah indicates that the true religion and comes from Him is a religion that encourages people to seek and seek His extensive knowledge, then utilize that knowledge for the benefit of humans and humanity. Every knowledge of Allah that is obtained must be written down with a pen, so that it can be studied and read by others, so that knowledge develops. With that knowledge too, humans will be able to achieve progress. Therefore, learning to read and write with a pen is the basis for the progress of a people. If humans want to progress, then encourage learning to write and read. With the revelation of this verse, the Prophet's heart grew steadier, calm, and strong to carry out his task of conveying Allah's religion. He also has strong arguments in dealing with the attitude of the Quraysh people. With this verse, Allah answered the accusations of the Quraysh people by ordering them to review the life history of the great and growing Prophet Muhammad before their own eyes. Wasn't it before he was sent as an apostle, those who said he was crazy respected him and made him the person they trusted the most? Do they not remember that there was a dispute between them about who has the right to lift the Black Stone and put it in its original place? The incident almost resulted in bloodshed, and no one can reconcile it. Then they asked Muhammad to be willing to be a peacemaker between them. They accepted the decision that Muhammad made for them, and they considered that the decision he gave was the fairest decision. Is it possible for someone who was originally good, endowed by Allah with honesty, gentleness of character, always helping and assisting anyone who needs it, and being an example and role model for the Quraysh, suddenly becomes crazy because he carries out the Lord's commands, namely conveying Allah's religion and emigrated to Medina. If one pays attention to the arrangement of these verses, there is an example that Muslims must emulate, that is, even though the Quraysh had been rude and hurt their hearts and bodies, the Messenger of Allah refuted their accusations in a good and educational way. He ordered them to use the right mind and use good norms."
		   },
		   {
			"id": 5274,
			"surah": 68,
			"ayat": 3,
			"tafsir": "The previous verse describes the accusations of the Meccan infidels who stated that the Prophet Muhammad was crazy because he dared to go against the teachings of their forefathers and continuously preached new teachings that contradicted their teachings, who worshiped statues and idols, even though all that the Prophet did is by Allah's command. Allah who gave favors to the Prophet with fortitude and great enthusiasm in carrying out da'wah. In this verse, Allah confirms that the Prophet really obtained a reward that was continuous and uninterrupted. So this confirms that the Prophet Muhammad was not a madman because he was someone who received a reward from Allah. Thanks to Allah's help and protection, his efforts and efforts paid off with the spread of Islam in the Arabian Peninsula, which then spread to all corners of the world. The Quraysh people who were originally in power and adhered to the shirk religion within 23 years became believers and became defenders of Islam. This is a great victory for Muhammad and the Muslims, and in the hereafter they will be rewarded with eternal pleasure in heaven. With such a statement from Allah and the sign that the Prophet understood from His words, his heart strength, determination and patience increased in carrying out his da'wah, regardless of the ridicule and pressure on the actions of the Quraysh people."
		   },
		   {
			"id": 5275,
			"surah": 68,
			"ayat": 4,
			"tafsir": "This verse strengthens the reason put forward by the verse above by stating that the Prophet Muhammad received uninterrupted rewards as the fruit of his noble character. The statement that the Prophet Muhammad had great morals is God's praise to him, which He rarely gives to His other servants. Indirectly, this verse also states that the accusations of polytheists that the Prophet Muhammad was a madman are accusations that have no reason whatsoever, because the better a person's character is, the farther he is from madness. On the other hand, the worse a person's character is, the closer he is to madness. The Prophet Muhammad was a man of great character, so he was far from crazy. This verse describes the task of Rasulullah saw as a person of noble character. He was given the task of conveying Allah's religion to humans so that by adopting that religion they would have noble morals as well. He said: Indeed I was sent only to perfect noble character (from humans). (Ahmad's history from Abu Hurairah)"
		   },
		   {
			"id": 5276,
			"surah": 68,
			"ayat": 5,
			"tafsir": "These two verses serve as a warning to the polytheists and state with certainty that they are truly in a state of misguidance, because it will not be long before the truth of the religious teachings brought by the Prophet Muhammad will be seen. The strength of Islam and the weakness of the polytheists will be seen. The Muslims will defeat them, and Islam will become a widespread teaching. With this explanation it is clear that the Prophet Muhammad was not mad, but it was the disbelievers who rejected the truth and continued to follow their passions who had lost their minds. This is actually dangerous for them because this wrong attitude and position will bring destruction and humiliation to them. In the world they will lose influence and power as happened in several wars with Muslims, namely in the Badr War, Uhud War, and the Khandaq War. In the afterlife they will surely regret their misguidance because they will receive a painful punishment because of their rejection of the preaching of the Prophet Muhammad. On the Day of Judgment, all human actions will be accounted for, weighed, and shown to each of them. At that time, the polytheists saw clearly, which of them was right, were the Apostles they accused mad or were they themselves? Here it is clear that the Prophet Muhammad was the right one, while they were thrown into the Hellfire. Allah's Word: Later they will know who is really a liar (and) arrogant. (al-Qamar\/54: 26)"
		   },
		   {
			"id": 5277,
			"surah": 68,
			"ayat": 6,
			"tafsir": "These two verses serve as a warning to the polytheists and state with certainty that they are truly in a state of misguidance, because it will not be long before the truth of the religious teachings brought by the Prophet Muhammad will be seen. The strength of Islam and the weakness of the polytheists will be seen. The Muslims will defeat them, and Islam will become a widespread teaching. With this explanation it is clear that the Prophet Muhammad was not mad, but it was the disbelievers who rejected the truth and continued to follow their passions who had lost their minds. This is actually dangerous for them because this wrong attitude and position will bring destruction and humiliation to them. In the world they will lose influence and power as happened in several wars with Muslims, namely in the Badr War, Uhud War, and the Khandaq War. In the afterlife they will surely regret their misguidance because they will receive a painful punishment because of their rejection of the preaching of the Prophet Muhammad. On the Day of Judgment, all human actions will be accounted for, weighed, and shown to each of them. At that time, the polytheists saw clearly, which of them was right, were the Apostles they accused mad or were they themselves? Here it is clear that the Prophet Muhammad was the right one, while they were thrown into the Hellfire. Allah's Word: Later they will know who is really a liar (and) arrogant. (al-Qamar\/54: 26)"
		   },
		   {
			"id": 5278,
			"surah": 68,
			"ayat": 7,
			"tafsir": "In this verse, Allah reaffirms His statement in the previous verse by telling the Prophet Muhammad that the polytheists must have known about the real deeds they had carried out. Allah and the Prophet Muhammad know better who deviates from the true path that has been laid out for him so that they get the misery of life in this world and in the hereafter. Allah also knows who follows the right path so that they get everything they want, namely the happiness of life in this world and in the hereafter, the actions of those who deviate from the right path, because of that they will experience misery in this world, such as defeat in war and destruction. their beliefs and in the Hereafter they will receive a painful punishment."
		   },
		   {
			"id": 5279,
			"surah": 68,
			"ayat": 8,
			"tafsir": "This verse instructs the Messenger of Allah to continue to reject all kinds of offers, solicitations, and wishes of the polytheists of Mecca who do not want to listen to Allah's verses, they even deny them. The Messenger of Allah was forbidden to follow them, because they were on a misguided path while he was already on a straight path. In another verse, Allah says: And if you follow most people on this earth, they will surely lead you astray from Allah's way. What they follow is sheer presumption and they are only fabricating lies. (al-An'am\/6: 116)"
		   },
		   {
			"id": 5280,
			"surah": 68,
			"ayat": 9,
			"tafsir": "This verse explains that the polytheists wanted the Prophet to follow and comply with their requests, and allowed their invitations for the Prophet to be lenient with them. If Rasulullah and the Muslims want to be lenient towards them, then they will also be lenient towards him and the Muslims. According to a history, the Quraysh people once offered the Prophet to be willing to reduce his da'wah activities, and no longer denounce their idols. In fact, they are willing to follow the teachings of the Prophet for a time, as long as after that the Prophet and his followers follow their teachings once in a while, so in rotation. This invitation was of course rejected by the Prophet because it was not in accordance with the preaching he brought to leave polytheism and replace it with the teachings of monotheism. This invitation began when the Prophet conveyed Allah's religion to the polytheists of Mecca openly and with courage, even though at that time the Muslims were weak and the enemies were strong. All the reasons put forward by the Prophet related to the proof of the truth of his treatise cannot be answered by polytheists. On the contrary, their answers show the weakness of the beliefs they profess. Therefore, they asked the Prophet to be lenient towards them and stop his reproaches to the idols they worshiped. If Rasulullah SAW was willing to accept the offer, then they were also willing to fulfill his wishes, such as being lenient towards Rasulullah SAW and the Muslims. They are also willing to participate in worshiping Allah, besides being allowed to worship their gods and carry out the customs of their ancestors. They were also willing to find a wife that the Prophet liked or collect the wealth he wanted. Based on the desire to alleviate the suffering that was being experienced by his friends due to the torture committed by polytheists, it occurred to the Prophet Muhammad to be lenient towards polytheists by accepting some of their offers. So this verse was revealed which warned the Prophet never to be lenient towards them, but to remain as usual, namely to take a firm and firm stance. This verse is in line with the word of Allah: And if We had not strengthened you, you would have almost leaned a little towards them. If so, surely We will taste you (torment) twice in this world and twice after death, and you (Muhammad) will not find any helper for Us. (al-Isra'\/17: 74-75) If we examine the meaning of this verse, it will be known that there was a specific purpose of the polytheists, which the Prophet was not allowed to know, in making their offer to him. They wanted to deceive the Prophet Muhammad with this invitation, whereby if accepted, then the religion of Islam that had just been conveyed would be mixed with elements of shirk. There will be mutual influence between the two kinds of belief, so that Islam will no longer have pure monotheistic beliefs. Allah's rebuke to Rasulullah SAW is also a warning to all Muslims, so that they are careful in matters of faith. Never incorporate an element of shirk into the Islamic creed, even a little."
		   },
		   {
			"id": 5281,
			"surah": 68,
			"ayat": 10,
			"tafsir": "In these verses, Allah reminded and ordered the Prophet Muhammad to: 1. Not follow the wishes of people who easily take oaths, because those who like to swear are just liars. While lying is the base of evil and the source of all kinds of immoral acts. Because of this, Islam also states that lying is one of the signs of a hypocrite. The Prophet Muhammad said, as narrated by al-Bukhari:The signs of a hypocrite are three: if he speaks, he lies, if he is trusted, he betrays, and if he makes a promise, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who like to swear are people who are not good. People who do not have good thoughts and intentions towards others think that other people do the same to them. Therefore, in order to convince others of his righteousness, he took an oath. 1. Do not follow people who are despised and misleading, such as inviting them to follow their religion in several ways. 1. Don't follow people who always criticize other people, and mention the bad things of others, either directly or indirectly. 2. Not following people who like to slander is like influencing people to be displeased with someone else, and trying to cause chaos. Allah states that slander with the meaning of chaos is greater in consequence than murder. And kill them where you find them, and drive them out from where they have driven you out. And slander is more cruel than murder. (al-Baqarah\/2: 191) 1. Not following people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2. Do not follow people who are used to doing things that exceed the limits, such as people who like to violate God's commands and do not stop what He has forbidden. Allah says: And whoever disobeys Allah and His Messenger and transgresses the limits of His law, Allah will surely put him in the fire of hell, he will abide therein and he will receive a humiliating punishment. (an-Nisa'\/4: 14) 1. Do not follow people who are used to doing acts of sin and immorality because he is a person who has no self-respect and good morals. The act of sin will eliminate self-esteem and conflict with noble morals. Allah does not like people who like to do sinful acts. He said: And do not argue for (defense) those who betray themselves. Truly, Allah does not like those who are always treacherous and wallowing in sin. (an-Nisa'\/4: 107) 1. Do not follow people who like to do cruel things and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, being cruel and having no compassion is contrary to the attributes of God. One of the reasons why Islam spread quickly in the Arabian Peninsula was because of the gentle attitude of the Prophet Muhammad. Had he been harsh and cruel, people would have avoided him. Allah said: So by the grace of Allah you (Muhammad) treat them gently. If you had been tough and rough-hearted, they would have distanced themselves from around you. Therefore forgive them and ask forgiveness for them, and consult with them in this matter. (Ali 'Imran\/3: 159) 1. Do not follow people whose origins are unknown, namely: 1. People whose circumstances are unknown, where they come from, what their job is, what their manners are, and so on. 2. People whose origins are unknown and whose intentions and goals are not clear and what the motives are behind their invitations."
		   },
		   {
			"id": 5282,
			"surah": 68,
			"ayat": 11,
			"tafsir": "In these verses, Allah reminded and ordered the Prophet Muhammad to: 1. Not follow the wishes of people who easily take oaths, because those who like to swear are just liars. While lying is the base of evil and the source of all kinds of immoral acts. Because of this, Islam also states that lying is one of the signs of a hypocrite. The Prophet Muhammad said, as narrated by al-Bukhari:The signs of a hypocrite are three: if he speaks, he lies, if he is trusted, he betrays, and if he makes a promise, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who like to swear are people who are not good. People who do not have good thoughts and intentions towards others think that other people do the same to them. Therefore, in order to convince others of his righteousness, he took an oath. 1. Do not follow people who are despised and misleading, such as inviting them to follow their religion in several ways. 1. Don't follow people who always criticize other people, and mention the bad things of others, either directly or indirectly. 2. Not following people who like to slander is like influencing people to be displeased with someone else, and trying to cause chaos. Allah states that slander with the meaning of chaos is greater in consequence than murder. And kill them where you find them, and drive them out from where they have driven you out. And slander is more cruel than murder. (al-Baqarah\/2: 191) 1. Not following people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2. Do not follow people who are used to doing things that exceed the limits, such as people who like to violate God's commands and do not stop what He has forbidden. Allah says: And whoever disobeys Allah and His Messenger and transgresses the limits of His law, Allah will surely put him in the fire of hell, he will abide therein and he will receive a humiliating punishment. (an-Nisa'\/4: 14) 1. Do not follow people who are used to doing acts of sin and immorality because he is a person who has no self-respect and good morals. The act of sin will eliminate self-esteem and conflict with noble morals. Allah does not like people who like to do sinful acts. He said: And do not argue for (defense) those who betray themselves. Truly, Allah does not like those who are always treacherous and wallowing in sin. (an-Nisa'\/4: 107) 1. Do not follow people who like to do cruel things and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, being cruel and having no compassion is contrary to the attributes of God. One of the reasons why Islam spread quickly in the Arabian Peninsula was because of the gentle attitude of the Prophet Muhammad. Had he been harsh and cruel, people would have avoided him. Allah said: So by the grace of Allah you (Muhammad) treat them gently. If you had been tough and rough-hearted, they would have distanced themselves from around you. Therefore forgive them and ask forgiveness for them, and consult with them in this matter. (Ali 'Imran\/3: 159) 1. Do not follow people whose origins are unknown, namely: 1. People whose circumstances are unknown, where they come from, what their job is, what their manners are, and so on. 2. People whose origins are unknown and whose intentions and goals are not clear and what the motives are behind their invitations."
		   },
		   {
			"id": 5283,
			"surah": 68,
			"ayat": 12,
			"tafsir": "In these verses, Allah reminded and ordered the Prophet Muhammad to: 1. Not follow the wishes of people who easily take oaths, because those who like to swear are just liars. While lying is the base of evil and the source of all kinds of immoral acts. Because of this, Islam also states that lying is one of the signs of a hypocrite. The Prophet Muhammad said, as narrated by al-Bukhari:The signs of a hypocrite are three: if he speaks, he lies, if he is trusted, he betrays, and if he makes a promise, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who like to swear are people who are not good. People who do not have good thoughts and intentions towards others think that other people do the same to them. Therefore, in order to convince others of his righteousness, he took an oath. 1. Do not follow people who are despised and misleading, such as inviting them to follow their religion in several ways. 1. Don't follow people who always criticize other people, and mention the bad things of others, either directly or indirectly. 2. Not following people who like to slander is like influencing people to be displeased with someone else, and trying to cause chaos. Allah states that slander with the meaning of chaos is greater in consequence than murder. And kill them where you find them, and drive them out from where they have driven you out. And slander is more cruel than murder. (al-Baqarah\/2: 191) 1. Not following people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2. Do not follow people who are used to doing things that exceed the limits, such as people who like to violate God's commands and do not stop what He has forbidden. Allah says: And whoever disobeys Allah and His Messenger and transgresses the limits of His law, Allah will surely put him in the fire of hell, he will abide therein and he will receive a humiliating punishment. (an-Nisa'\/4: 14) 1. Do not follow people who are used to doing acts of sin and immorality because he is a person who has no self-respect and good morals. The act of sin will eliminate self-esteem and conflict with noble morals. Allah does not like people who like to do sinful acts. He said: And do not argue for (defense) those who betray themselves. Truly, Allah does not like those who are always treacherous and wallowing in sin. (an-Nisa'\/4: 107) 1. Do not follow people who like to do cruel things and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, being cruel and having no compassion is contrary to the attributes of God. One of the reasons why Islam spread quickly in the Arabian Peninsula was because of the gentle attitude of the Prophet Muhammad. Had he been harsh and cruel, people would have avoided him. Allah said: So by the grace of Allah you (Muhammad) treat them gently. If you had been tough and rough-hearted, they would have distanced themselves from around you. Therefore forgive them and ask forgiveness for them, and consult with them in this matter. (Ali 'Imran\/3: 159) 1. Do not follow people whose origins are unknown, namely: 1. People whose circumstances are unknown, where they come from, what their job is, what their manners are, and so on. 2. People whose origins are unknown and whose intentions and goals are not clear and what the motives are behind their invitations."
		   },
		   {
			"id": 5284,
			"surah": 68,
			"ayat": 13,
			"tafsir": "In these verses, Allah reminded and ordered the Prophet Muhammad to: 1. Not follow the wishes of people who easily take oaths, because those who like to swear are just liars. While lying is the base of evil and the source of all kinds of immoral acts. Because of this, Islam also states that lying is one of the signs of a hypocrite. The Prophet Muhammad said, as narrated by al-Bukhari:The signs of a hypocrite are three: if he speaks, he lies, if he is trusted, he betrays, and if he makes a promise, he does not keep his promise. (History of al-Bukhari, Muslim, at-Tirmidhi, and an-Nasa'i from Abu Hurairah) People who like to swear are people who are not good. People who do not have good thoughts and intentions towards others think that other people do the same to them. Therefore, in order to convince others of his righteousness, he took an oath. 1. Do not follow people who are despised and misleading, such as inviting them to follow their religion in several ways. 1. Don't follow people who always criticize other people, and mention the bad things of others, either directly or indirectly. 2. Not following people who like to slander is like influencing people to be displeased with someone else, and trying to cause chaos. Allah states that slander with the meaning of chaos is greater in consequence than murder. And kill them where you find them, and drive them out from where they have driven you out. And slander is more cruel than murder. (al-Baqarah\/2: 191) 1. Not following people who like to forbid good deeds and prevent others from doing good or he himself does not like to do good. 2. Do not follow people who are used to doing things that exceed the limits, such as people who like to violate God's commands and do not stop what He has forbidden. Allah says: And whoever disobeys Allah and His Messenger and transgresses the limits of His law, Allah will surely put him in the fire of hell, he will abide therein and he will receive a humiliating punishment. (an-Nisa'\/4: 14) 1. Do not follow people who are used to doing acts of sin and immorality because he is a person who has no self-respect and good morals. The act of sin will eliminate self-esteem and conflict with noble morals. Allah does not like people who like to do sinful acts. He said: And do not argue for (defense) those who betray themselves. Truly, Allah does not like those who are always treacherous and wallowing in sin. (an-Nisa'\/4: 107) 1. Do not follow people who like to do cruel things and have no compassion. Allah is Most Gracious, Most Merciful to His servants. Therefore, being cruel and having no compassion is contrary to the attributes of God. One of the reasons why Islam spread quickly in the Arabian Peninsula was because of the gentle attitude of the Prophet Muhammad. Had he been harsh and cruel, people would have avoided him. Allah said: So by the grace of Allah you (Muhammad) treat them gently. If you had been tough and rough-hearted, they would have distanced themselves from around you. Therefore forgive them and ask forgiveness for them, and consult with them in this matter. (Ali 'Imran\/3: 159) 1. Do not follow people whose origins are unknown, namely: 1. People whose circumstances are unknown, where they come from, what their job is, what their manners are, and so on. 2. People whose origins are unknown and whose intentions and goals are not clear and what the motives are behind their invitations."
		   },
		   {
			"id": 5285,
			"surah": 68,
			"ayat": 14,
			"tafsir": "In this verse, Allah warns the Prophet Muhammad and the Muslims not to follow people who have the above characteristics, even if he has a lot of wealth, a high position, great power, or he feels pleasure and pleasure. temporal world. None of this will benefit Allah on the Day of Judgment. Allah says: Let me (act) to those whom I myself have created, and I give abundant wealth, and children who are always with him, and I give the widest possible (life). Then he was eager for Me to add to it. Can't! Verily he has contradicted Our verses (Al-Qur'an). I will burden him with a painstaking climb. Truly he has thought and determined (what he determined), so woe to him! How did he set?, Again, woe to him! How did he determine? Then he (contemplated) thought, then turned sour and sullen, then turned away (from the truth) and boasted. (al-Muddatstsir\/74: 11-23)"
		   },
		   {
			"id": 5286,
			"surah": 68,
			"ayat": 15,
			"tafsir": "This verse explains that when the polytheists of Mecca listen to the recitation of the verses of the Qur'an, they say that the Qur'an is none other than the words of Muhammad and contains tales of ancient people, not revelations at all. God to him. In another verse, Allah says: Then he said, \"This (Qur'an) is only magic that was learned (from the ancients). This is only human speech.\" (al-Muddatstsir\/74: 24-25) Besides, polytheists also say that the Qur'an is magic put forward by a sorcerer and so on. However, from all the accusations that they leveled, it can be understood that they do so solely because they have lost their minds looking for reasons that can be put forward to refute the truth of the Qur'an. Every time they meditate on it, the more belief arises in their hearts in the Qur'an. However, their lust still overpowers the truth that has arisen deep in their hearts."
		   },
		   {
			"id": 5287,
			"surah": 68,
			"ayat": 16,
			"tafsir": "In this verse, Allah confirms that they are truly misguided people, and He will make them humiliated in the world. To express their humiliation, Allah will mark their noses like an elephant's trunk, so that everyone knows their true condition. The purpose of putting a mark on their nose is so that everyone knows that they are bad people and have a lot of sins, so they can be easily recognized."
		   },
		   {
			"id": 5288,
			"surah": 68,
			"ayat": 17,
			"tafsir": "This verse explains that Allah has given the polytheists of Mecca many favors in the form of worldly pleasures and luxuries. All of this aims to find out whether they want to be grateful for the more blessings given by removing the rights of the poor, allowing the Prophet's call to follow the right path and submit and obey Allah, or with this blessing, they want to accumulate wealth, challenge the call Prophet, and deviate from the right path? Allah will inflict a painful punishment on them and eliminate these blessings if they persist in disobeying them, as happened to some garden owners. The owner of the garden was originally a pious, obedient, and obedient man carrying out God's commands and avoiding all His prohibitions. He has a garden as a source of livelihood. When he was going to pick his garden, he told the poor and needy people to come to his garden, and immediately gave them the rights that were obtained from the produce of the garden. After he died, the garden was inherited by their children. At the time of reaping the results, they also discussed whether to continue to do what their father had done or make a new plan. One of them suggested that they should do what their father used to do, namely telling the poor to come on picking day. However, this proposal was rejected by his other brothers. They don't want to give even a bit of the garden's produce to the poor, as their father had done. Even though one brother had been warned of the danger that might befall them, they still decided to pick the produce from the garden without notifying the poor in advance, and they would own all the produce from the garden without removing the rights of other people. is in it. The heirs of the garden owner reneged on the provisions his father used to make when he was alive, after seeing the fertility of his plants and the abundance of fruit to be picked. They also believe that all of it will definitely be theirs. Therefore, they vowed to pick it early in the morning so no one would notice. They also agreed not to give the garden's produce to other people even a little."
		   },
		   {
			"id": 5289,
			"surah": 68,
			"ayat": 18,
			"tafsir": "This verse explains that Allah has given the polytheists of Mecca many favors in the form of worldly pleasures and luxuries. All of this aims to find out whether they want to be grateful for the more blessings given by removing the rights of the poor, allowing the Prophet's call to follow the right path and submit and obey Allah, or with this blessing, they want to accumulate wealth, challenge the call Prophet, and deviate from the right path? Allah will inflict a painful punishment on them and eliminate these blessings if they persist in disobeying them, as happened to some garden owners. The owner of the garden was originally a pious, obedient, and obedient man carrying out God's commands and avoiding all His prohibitions. He has a garden as a source of livelihood. When he was going to pick his garden, he told the poor and needy people to come to his garden, and immediately gave them the rights that were obtained from the produce of the garden. After he died, the garden was inherited by their children. At the time of reaping the results, they also discussed whether to continue to do what their father had done or make a new plan. One of them suggested that they should do what their father used to do, namely telling the poor to come on picking day. However, this proposal was rejected by his other brothers. They don't want to give even a bit of the garden's produce to the poor, as their father had done. Even though one brother had been warned of the danger that might befall them, they still decided to pick the produce from the garden without notifying the poor in advance, and they would own all the produce from the garden without removing the rights of other people. is in it. The heirs of the garden owner reneged on the provisions his father used to make when he was alive, after seeing the fertility of his plants and the abundance of fruit to be picked. They also believe that all of it will definitely be theirs. Therefore, they vowed to pick it early in the morning so no one would notice. They also agreed not to give the garden's produce to other people even a little."
		   },
		   {
			"id": 5290,
			"surah": 68,
			"ayat": 19,
			"tafsir": "Allah's provision and will must apply without anyone being able to block it. So at night, by God's decree and will, there came a thunderbolt that burned their entire garden. No one was left, all burnt. The incident occurred when the owners of the garden were sleeping soundly, so no one knew that their garden had been burnt down. They are negligent and do not remember Allah, the Lord who provides them with sustenance."
		   },
		   {
			"id": 5291,
			"surah": 68,
			"ayat": 20,
			"tafsir": "Allah's provision and will must apply without anyone being able to block it. So at night, by God's decree and will, there came a thunderbolt that burned their entire garden. No one was left, all burnt. The incident occurred when the owners of the garden were sleeping soundly, so no one knew that their garden had been burnt down. They are negligent and do not remember Allah, the Lord who provides them with sustenance."
		   },
		   {
			"id": 5292,
			"surah": 68,
			"ayat": 21,
			"tafsir": "After waking up in the morning, they called each other and asked them to go to the garden to pick the produce. After gathering, they left and walked secretly while whispering among themselves, \"Don't let any of the poor people come into our garden like before when father was still alive. We hope to get the entire harvest of this garden. use it for our own purposes.\" They went to the garden early in the morning with the intention that poor people would not enter their garden and they were sure that they would be able to pick all the produce of the garden."
		   },
		   {
			"id": 5293,
			"surah": 68,
			"ayat": 22,
			"tafsir": "After waking up in the morning, they called each other and asked them to go to the garden to pick the produce. After gathering, they left and walked secretly while whispering among themselves, \"Don't let any of the poor people come into our garden like before when father was still alive. We hope to get the entire harvest of this garden. use it for our own purposes.\" They went to the garden early in the morning with the intention that poor people would not enter their garden and they were sure that they would be able to pick all the produce of the garden."
		   },
		   {
			"id": 5294,
			"surah": 68,
			"ayat": 23,
			"tafsir": "After waking up in the morning, they called each other and asked them to go to the garden to pick the produce. After gathering, they left and walked secretly while whispering among themselves, \"Don't let any of the poor people come into our garden like before when father was still alive. We hope to get the entire harvest of this garden. use it for our own purposes.\" They went to the garden early in the morning with the intention that poor people would not enter their garden and they were sure that they would be able to pick all the produce of the garden."
		   },
		   {
			"id": 5295,
			"surah": 68,
			"ayat": 24,
			"tafsir": "After waking up in the morning, they called each other and asked them to go to the garden to pick the produce. After gathering, they left and walked secretly while whispering among themselves, \"Don't let any of the poor people come into our garden like before when father was still alive. We hope to get the entire harvest of this garden. use it for our own purposes.\" They went to the garden early in the morning with the intention that poor people would not enter their garden and they were sure that they would be able to pick all the produce of the garden."
		   },
		   {
			"id": 5296,
			"surah": 68,
			"ayat": 25,
			"tafsir": "After waking up in the morning, they called each other and asked them to go to the garden to pick the produce. After gathering, they left and walked secretly while whispering among themselves, \"Don't let any of the poor people come into our garden like before when father was still alive. We hope to get the entire harvest of this garden. use it for our own purposes.\" They went to the garden early in the morning with the intention that poor people would not enter their garden and they were sure that they would be able to pick all the produce of the garden."
		   },
		   {
			"id": 5297,
			"surah": 68,
			"ayat": 26,
			"tafsir": "After arriving at the garden, they were amazed because the garden had been destroyed and completely burned. They thought that it was not their garden that was burnt, because their garden, which was filled with lush plants and full of fruit, now was the time to be picked."
		   },
		   {
			"id": 5298,
			"surah": 68,
			"ayat": 27,
			"tafsir": "Finally they realized and were sure that what was burning was indeed their garden, and said, \"We did not stray into another garden, this is indeed ours. Because we have sinned by not following what our father had outlined in every garden we picked, So Allah destroyed this garden.\""
		   },
		   {
			"id": 5299,
			"surah": 68,
			"ayat": 28,
			"tafsir": "One of them who had warned them before said, \"Haven't I suggested before this that we all do what our father used to do, namely always glorify God and purify Him, always be grateful for every favor He has bestowed on us?\" us by giving a portion of the proceeds to those who are entitled to receive it, and always praying to Him so that we will always be abundantly blessed with His blessings and gifts. However, all of you don't pay any heed to my advice.\""
		   },
		   {
			"id": 5300,
			"surah": 68,
			"ayat": 29,
			"tafsir": "They admit their mistakes and oversights by stating that Allah destroyed the garden not because of His tyranny against them, but because they themselves have wronged themselves by not giving the rights of the poor and poor."
		   },
		   {
			"id": 5301,
			"surah": 68,
			"ayat": 30,
			"tafsir": "They then blamed each other by saying, \"You are the one who suggested that we all no longer give the rights of the infidels and the poor that our fathers used to give us.\""
		   },
		   {
			"id": 5302,
			"surah": 68,
			"ayat": 31,
			"tafsir": "After blaming each other, they finally regretted each other. They then realized that it was their actions and attitudes that had invited such a fate. They said, \"Surely we are the ones who are guilty. We have violated the lines that have been set by Allah by not giving the rights of the poor to our property. Hopefully Allah will grant us a garden that is better than the one that was destroyed.\" We will really repent, submit, and obediently carry out His commands and stay away from all His prohibitions. May Allah bestow what is good and beneficial for the life of this world and the life hereafter.\" According to the history of Mujahid, after they repented, Allah bestowed a better garden than their destroyed garden and granted their prayers."
		   },
		   {
			"id": 5303,
			"surah": 68,
			"ayat": 32,
			"tafsir": "After blaming each other, they finally regretted each other. They then realized that it was their actions and attitudes that had invited such a fate. They said, \"Surely we are the ones who are guilty. We have violated the lines that have been set by Allah by not giving the rights of the poor to our property. Hopefully Allah will grant us a garden that is better than the one that was destroyed.\" We will really repent, submit, and obediently carry out His commands and stay away from all His prohibitions. May Allah bestow what is good and beneficial for the life of this world and the life hereafter.\" According to the history of Mujahid, after they repented, Allah bestowed a better garden than their destroyed garden and granted their prayers."
		   },
		   {
			"id": 5304,
			"surah": 68,
			"ayat": 33,
			"tafsir": "Such was the calamity that Allah befell the garden owners as a trial for them. The ordeal was very beneficial, so they repented and regretted the actions that God had forbidden. They also promised not to repeat the act again, and to remain obedient to Allah and not to do other prohibited acts. Because they truly repent, Allah grants their prayers and gives them happiness in this world and the hereafter. What about the polytheists of Mecca, will they continue to behave and act as they did to the Prophet Muhammad and the Muslims? If they accept the call of the Prophet Muhammad, surely Allah will give them what has been given to the owners of the garden. On the other hand, if they persist in their position, they will not only receive punishment in this world, but will also receive punishment in the hereafter. Verily, the punishment in the Hereafter is more severe and more severe than the punishment in this world. If the punishment of this world is only in the form of loss of wealth and pleasures, then the punishment of the hereafter is even more terrible than that, namely the punishment that causes misery and havoc for the body and soul of those who experience it."
		   },
		   {
			"id": 5305,
			"surah": 68,
			"ayat": 34,
			"tafsir": "This verse emphasizes that believers who carry out Allah's commands, stay away from His prohibitions, and submit and obey Him, will be placed in a paradise full of pleasures in the hereafter. This is in return for their faith in Allah and their good deeds while living in the world."
		   },
		   {
			"id": 5306,
			"surah": 68,
			"ayat": 35,
			"tafsir": "According to Muqatil, when the 34th verse above was revealed, the Meccan infidels said to the Muslims, \"Indeed, Allah has excelled us over you in this worldly life. Therefore, it is not permissible for us, He will exaggerate us over you. in the hereafter, or at least, the same with you all.\" So Allah refutes the statements of those disbelievers with this verse by saying, \"Are We going to violate Our promises by equating those who surrender, submit, and obey Us to those who commit sins and always deny to us?\" God's Word: The inhabitants of hell are not the same as the inhabitants of heaven; the inhabitants of heaven are the ones who gain the victory. (al-hasyr\/59: 20) From the words of these disbelievers it can be understood that according to them life in this world is a picture of life in the hereafter. If someone in this worldly life is given a lot of wealth, power, rank, pleasure, and luxury, surely in the hereafter they will be like that too. Conversely, if a person's worldly life experiences misery and suffering, of course in the hereafter they will also be miserable and suffer. The assumption of such disbelievers is a wrong assumption. Life in this world is preparation for life in the hereafter. If someone is good in worship and charity, even if he is not awarded a lot of wealth, power, rank, and so on, then he will still get a double reward from Allah. On the other hand, if they deny and commit sinful acts, even if they gain a lot of wealth, rank and power, then in the afterlife a place full of misery and humiliation will be prepared."
		   },
		   {
			"id": 5307,
			"surah": 68,
			"ayat": 36,
			"tafsir": "In this verse, Allah reveals the strange way of thinking of disbelievers so that they determine this. It's as if they didn't use proper judgment, common sense, and fair decisions. Is it possible that people who go astray are the same as people who are righteous, people who fear Allah and people who sin, people who fear Allah and people who deny Him, and so on. The way of thinking like that used by unbelievers is the wrong way of thinking and is influenced by Satan who always leads people astray."
		   },
		   {
			"id": 5308,
			"surah": 68,
			"ayat": 37,
			"tafsir": "In this verse, it is stated that the opinion or way of thinking of disbelievers is not based on revelation from Allah. There is nothing in Allah's book that explains such a thing. The expression was hurled at them in the form of a question, \"Do you, O disbelievers, have a book sent down from the sky, which you received from your ancestors and then learned from generation to generation, which contains a provision as you say? . Do you have such a book that allows you to choose what you want according to your will.\" This verse is expressed in the form of a question sentence. Usually the interrogative sentence intends to ask something that is not known, but the interrogative sentence here is to deny and state the ugliness of an action. It is as if Allah revealed to the disbelievers that none of His revelations stated this. Their utterances are utterances that they fabricate and such a way of inventing them is a way that is not commendable."
		   },
		   {
			"id": 5309,
			"surah": 68,
			"ayat": 38,
			"tafsir": "In this verse, it is stated that the opinion or way of thinking of disbelievers is not based on revelation from Allah. There is nothing in Allah's book that explains such a thing. The expression was hurled at them in the form of a question, \"Do you, O disbelievers, have a book sent down from the sky, which you received from your ancestors and then learned from generation to generation, which contains a provision as you say? . Do you have such a book that allows you to choose what you want according to your will.\" This verse is expressed in the form of a question sentence. Usually the interrogative sentence intends to ask something that is not known, but the interrogative sentence here is to deny and state the ugliness of an action. It is as if Allah revealed to the disbelievers that none of His revelations stated this. Their utterances are utterances that they fabricate and such a way of inventing them is a way that is not commendable."
		   },
		   {
			"id": 5310,
			"surah": 68,
			"ayat": 39,
			"tafsir": "In this verse, once again Allah ridicules the disbelievers by asking, \"O disbelievers, have you ever received promises from Us that We must fulfill as you said, namely that you will receive all that is you want, while you deny Us?\" From this question it can be understood that Allah never determines or promises His servants as they say."
		   },
		   {
			"id": 5311,
			"surah": 68,
			"ayat": 40,
			"tafsir": "Then Allah ordered His Messenger to ask the disbelievers with the intention of denouncing the ways they did, \"O disbelievers, if you have a book that explains what you are saying, show us. If it is true that Allah has promised you that is confirmed by oath that you will get everything you want, try to prove that oath. If you have someone who can guarantee the truth of your words, try to show us the person.\" The Prophet's questions and requests to the disbelievers caused them to be silent in a thousand languages, because they would not be able to answer and fulfill these requests. In fact they worship idols or statues. They made the statues and idols themselves, and they knew that the statues and idols would not be able to guarantee what they said, as if they were powerless to defend their opinions. The word za'im (something that is responsible) which is found at the end of this verse means someone who guarantees that something will be carried out and is full of truth. If someone says something or promises something, then a za'im guarantees that the person's words are the true words, or the promise he has made must be fulfilled. The disbelievers of Mecca were asked to state who could guarantee the veracity of their words which said that Allah equates the reward received by believers with the reward they receive, even though Allah has never said that."
		   },
		   {
			"id": 5312,
			"surah": 68,
			"ayat": 41,
			"tafsir": "In this verse, again the Prophet Muhammad was ordered to ask the disbelievers whether they have allies who can guarantee the truth of what they say. If so, try to bring them up or bring them in to prove their guarantee. What is meant by \"their partners\" in this verse are all those they worship besides Allah, such as statues of Lata, 'Uzza, Manah, and so on. Also included are people they respect, and their religious leaders. With this last question, the Meccan disbelievers grew silent and remained silent because it turned out that the gods they worshiped besides Allah, their well-known literary experts, such as al-Walid bin al-Mugirah, and others were unable to convey or bring it up. ."
		   },
		   {
			"id": 5313,
			"surah": 68,
			"ayat": 42,
			"tafsir": "This verse states to the Meccan disbelievers that if they have a guarantor for the truth of their words that they will surely enter paradise as the believers enter paradise, then try to bring witnesses or guarantors later on the Day of Resurrection. On that day, everyone was in a state of fear and was trying to escape from that fear. On that day they are asked to prostrate to test their faith, even though they are no longer able to prostrate, because the joints of their bones are weak, because punishment has covered them from above and below, and from the right and left. Such a day must come and the riot as intended must occur. At that time, there will be no one's refuge except Allah, the Almighty God."
		   },
		   {
			"id": 5314,
			"surah": 68,
			"ayat": 43,
			"tafsir": "In this verse it is explained that the disbelievers on the Day of Judgment will be in the slightest state of helplessness. No one gave them any help and they were in a state of humiliation. They were only in a state full of regrets, but all of that was of no use anymore. When they lived in the world before, they were in good health, had plenty, had power, and had ranks, but they did not want to pray, prostrate and worship Allah, and surrender themselves to Him. After in the afterlife, when the time of regret comes, they call on God, wanting to do it to serve Him, but they can't do it anymore. This is because in addition to their bones being weak, the door to repentance has also been closed. Only believers can prostrate themselves in the hereafter when Allah appears to them"
		   },
		   {
			"id": 5315,
			"surah": 68,
			"ayat": 44,
			"tafsir": "This verse is a heartwarming and entertainment to the Prophet Muhammad and a strong threat to the disbelievers. There are so many attitudes and actions of disbelievers towards the Prophet Muhammad and the Muslims in carrying out the tasks assigned by Allah to them. Among them were those who prevented people from converting to Islam, tortured the Prophet's companions who had converted to Islam, hurt, ridiculed, boycotted and ostracized (isolated) the Prophet, and so on. Because of that, sometimes the Prophet's heart arose to pray that Allah would punish and torture those who disobeyed, as had happened to past peoples. With this verse, Allah states that He knows all kinds of attitudes and actions of those disbelievers, and will punish them according to what they do. Furthermore, Allah stated that because they denied the Qur'an and denied Allah, those disbelievers had the opportunity to commit sinful acts and commit persecution so that the sins they committed increased. Thus, the penalty for punishment is even more severe, so that they cannot bear it. They think that with the rank, wealth, and power they have, Allah has bestowed an incomparable gift on them, but this is not the case. In fact, with the rank, wealth, and power that they have, their sins are getting bigger. In another verse, Allah says: So let them go astray until the appointed time. Do they think that We have given them wealth and children (meaning that) We have given them good deeds? (No), but they don't realize it. (al-Mu'minun\/23: 54-56) Another word of Allah: So when they forgot the warning that had been given to them, We opened all the doors (pleasures) for them. So that when they were happy with what had been given to them, We punished them suddenly, then they fell silent in despair. (al-An'am\/6: 44)"
		   },
		   {
			"id": 5316,
			"surah": 68,
			"ayat": 45,
			"tafsir": "Allah stated that He gave the disbelievers the time to reach the appointed time by allowing them to increase in their disbelief and tyranny. God also stated that His plan cannot be thwarted by anyone, and it must be carried out, no one can hinder Him. In fact, if disbelievers want to realize, of course they will come to a point of view and view that what they use to prevent the Prophet Muhammad and the believers from upholding Allah's religion are the blessings bestowed upon them by Allah, such as wealth, rank , positions, and so on. They should use these blessings to seek His pleasure. Their sins are very big because they deny and abuse God's grace. Regarding the punishment that befell the disbelievers, this is explained in the hadith of the Prophet Muhammad which was narrated by al-Bukhari and Muslim: Indeed, Allah Ta'ala will postpone the punishment for the wrongdoers, so that when He punishes them, no one escapes the punishment. . Then the Prophet saw (surahh Hud\/11: 102): \"And this is how your Lord will punish you when He torments (the inhabitants of) countries that commit injustice. Indeed, His punishment is very painful, very severe.\" (History of al-Bukhari, Muslim, Abu Ya'la, al-Baihaqi and an-Nasa'i from Abu Musa al-Asy'ari)"
		   },
		   {
			"id": 5317,
			"surah": 68,
			"ayat": 46,
			"tafsir": "In this verse, Allah asks the Messenger of Allah a question with the intention of guessing the way of thinking of the disbelievers that someone does a job in order to expect a reward, profit, or worldly pleasure. According to them, no one wants to work and try solely because of Allah. Allah's question is: O Muhammad, do you ask for a reward from those who associate Me with something else, because you give them advice, call them to the truth and follow My religion, so that they must be burdened with debt because of the wages you receive? ask that?"
		   },
		   {
			"id": 5318,
			"surah": 68,
			"ayat": 47,
			"tafsir": "In this verse the question is still continued: Do they have knowledge about the unseen, or have like the Lawh Mahfudh record everything with what they want, namely proof of the truth of their opinion? The Meccan pagans thought that the images they worshiped could tell them everything that was going to happen and everything that was unseen. However, their assumption has no proof at all."
		   },
		   {
			"id": 5319,
			"surah": 68,
			"ayat": 48,
			"tafsir": "Allah ordered the Prophet Muhammad to be patient in accepting His decrees, continue to carry out the apostolic duties that had been assigned to him, and avoid anything that could hinder or interfere with efforts to carry out that task. Then Allah warned him not to behave and act like someone who was in the belly of a fish, namely the Prophet Jonah. Because he was angry with his people, the Prophet Jonah then left them and prayed to Allah that they would be overwritten by a devastating punishment. This story begins when the Prophet Yunus was sent by God to the inhabitants of the city of Nineveh. He called on his people to worship Allah, God Almighty, there is no god but Him. But the residents of the city of Nineveh rejected the invitation, they even denied it and threatened it. Because of the attitudes and actions of his people like that, he was angry and warned them that Allah would bring a very terrible disaster in return for their attitude and denial. He then left his people. After the death of the Prophet Jonah, his people were aware and afraid of God's threat, so they went out of their homes to the fields with their wives, children and livestock. In that field, they together expressed repentance to Allah, and humbled themselves with full faith. They promised Allah that they would follow Jonah's call, carry out His orders and stop His prohibitions. Because Jonah's people truly repented, submitted, and submitted themselves to Him, Allah granted their prayer by preventing the calamity from coming to them, as explained in Allah's word: , then his faith is beneficial to him other than the people of Jonah? When they (Jonah's people) believed, We removed from them the humiliating punishment in the life of this world, and We gave them pleasure for a certain time. (Yunus\/10: 98) As for the Prophet Jonah, after giving the warning, he left his people by leaving the task entrusted by Allah to him as His messenger. Without getting permission from Allah, he went on board a ship laden with cargo. After the ship sailed and was in the middle of the ocean, the captain was concerned that the ship would sink if the cargo was not reduced. To reduce the ship's load, they held a lottery among the passengers. Whoever loses the lot will be thrown into the sea. Thus, the ship will avoid the danger of sinking. In the lottery, the Prophet Jonah lost, but the passengers of the ship found it difficult to make this decision. This was repeated three times and the result was the same, Prophet Jonah still lost. But like the first, the passengers also found it difficult to carry out this decision. Finally the Prophet Jonah made his own decision, and he plunged into the sea. After Jonah plunged into the sea, God ordered a large shark to swallow him. It was revealed to the fish not to eat Jonah's flesh and bones, but enough to make his stomach a prison for Jonah, because Jonah was not his food. Prophet Yunus felt miserable and miserable in the dark belly of the fish. He repented, prayed, and surrendered himself to Allah, may Allah forgive his sins and save him, as explained in another word of Allah: And (remember the story of) Dzun Nun (Yunus), when he went away angry, then he thought that We weren't going to make things difficult for him, so he prayed in a very dark situation, \"There is no god but You, Glory to You. Indeed, I am one of the wrongdoers.\" So We answered his (prayer) and We saved him from grief. And thus We save those who believe. (al-Anbiya'\/21: 87-88)"
		   },
		   {
			"id": 5320,
			"surah": 68,
			"ayat": 49,
			"tafsir": "After several days in the belly of the fish, the Prophet Jonah was blessed by Allah by revealing to the fish to throw Jonah to land. So the fish threw Jonah ashore. He fell on land that was barren, deserted, without water, plants, and trees around him. His body was in a very weak and sick state, because of the suffering he experienced while in the belly of the fish, and because of his sadness due to the attitude of his people who challenged his message. To protect him from the scorching heat of the sun and the cold of the night, Allah grew beside him a kind of pumpkin tree (yaqthin). Thus, Prophet Jonah was protected and could also eat its fruit to strengthen his weak body, as Allah says: Then We threw him onto barren land, while he was sick. Then for him We grew a tree of the gourd variety. (as-saffat\/37: 145-146) If Allah had not bestowed His mercy on Yunus, he would have drowned in the ocean, or crushed in the belly of a fish, or died of hunger and drought in the middle of a barren desert. However, Allah is Most Merciful to His servants who want to repent truly, as did the Prophet Yunus. Therefore, Allah bestowed mercy on him."
		   },
		   {
			"id": 5321,
			"surah": 68,
			"ayat": 50,
			"tafsir": "After Jonah's health recovered, so did his physical strength, then Allah sent him back to his people who at that time numbered more than a hundred thousand people, as Allah said: And We sent him to a hundred thousand (people) or more, until they believed, therefore We bestow the enjoyment of life on them for a certain time. (as saffat\/37: 147-148) The arrival of Yunus was greeted by his people with joy and declared their faith in him, so that they were among the pious. With the verses above, Allah warned the Prophet Muhammad not to behave and act like the Prophet Yunus who was easily angry and easily despaired, so that he left his people and the sacred task that had been assigned to him, namely the apostolic task. The Prophet Muhammad was commanded to always be steadfast and patient under any circumstances because Allah loves those who are patient."
		   },
		   {
			"id": 5322,
			"surah": 68,
			"ayat": 51,
			"tafsir": "Allah revealed to the Prophet Muhammad peace be upon him that because the polytheists were very angry and hated him, they looked at the Prophet from the corner of their eyes with eyes full of anger and hatred. This is especially every time they hear the recitation of the verses of the Qur'an. According to some commentators, what is meant by \"those who almost derailed the Prophet with their eyes\" were the Bani Asad, one of the tribes in Arabia at that time. It is narrated that the people from Bani Asad had a kind of knowledge that could influence others by using the sharpness of their eyes. So some of them intended to try their knowledge on the Prophet Muhammad, because according to them, if Muhammad had really been a messenger sent by Allah, surely he would not have been affected by their knowledge. The fact is that knowledge does not work against Rasulullah saw. From the history above in this verse it is understood that any kind of occult knowledge will not be able to affect or affect a person if he believes in Allah, except knowledge that is in accordance with sunatullah, such as hurting someone by influencing his soul in accordance with the propositions and provisions of psychology. , torturing someone with electricity, and so on. Such knowledge can influence a person. Because those polytheists were unable to influence the Prophet with the knowledge that was in them, such as the glare of sharp eyes, and because they could not match the verses of the Qur'an, they said that in fact he (Muhammad) was truly really crazy people."
		   },
		   {
			"id": 5323,
			"surah": 68,
			"ayat": 52,
			"tafsir": "In this verse, Allah says emphatically that the Qur'an contains instructions and lessons for the happiness of human life in this world and the hereafter. It is intended for all human beings wherever they are, whether for residents of developed countries or for residents of countries that are developing or underdeveloped, both for smart people and for stupid people, both for city dwellers and for rural residents, both for for the rich and for the poor, and so on. Therefore, everyone can learn to understand and study the Qur'an, as long as he has the attitude of accepting every truth that is conveyed to him. If someone does not have such an attitude, even though his heart and mind have accepted the truth of the Qur'an, his desires order him to oppose the Qur'an and say it is man-made or other accusations. How many people are constantly fighting truth and justice because they indulge their desires, such as the desire for rank, position, and a lot of wealth, fear of being ostracized by their group, fear of leaving the beliefs of their ancestors, and so on. How many people are willing to kill their friends, siblings, even their fathers and mothers because they follow their passions. Muhammad saw is a prophet and messenger of Allah who has proven his honesty, a person who is respected and trusted by his people, perfectly fair mind, no one who deny it. After he was appointed by Allah as a prophet and messenger, hatred arose, because following Muhammad saw meant leaving rank, wealth, pleasure, and tyranny."
		   }
	]
}
