{
	"tafseer": [
		{
			"id": 1751,
			"surah": 14,
			"ayat": 1,
			"tafsir": "This surah begins with \"Alif Lam Ra\". (See the commentary in the first volume under the title \"mafatihus suwar\".) In the word of Allah SWT after Alif Lam Ra explains the intent and purpose of the revelation of the Al-Quran to the Prophet Muhammad. Allah sent down the Al-Quran to the Prophet so that the instructions and regulations that the Al-Quran brought could be guidance and guidance to his people. With these instructions they can be brought out of darkness into bright light, or from misguidance and ignorance to the right path and have high knowledge and civilization, so that they gain the pleasure and love of Allah SWT in this world and in the hereafter. This affirmation of the function of the Al-Quran is very important, especially if it is connected with the previous verses, where Allah SWT has mentioned that there are people who deny the Al-Quran, either in part or in whole. Furthermore, in this verse it is explained that the Prophet could only carry out the task mentioned above with the permission and assistance of Allah SWT, by providing convenience and strengthening his determination in facing all obstacles. Al-Quran is the way that Allah Almighty and Most Praised for the Prophet Muhammad and his people."
		   },
		   {
			"id": 1752,
			"surah": 14,
			"ayat": 2,
			"tafsir": "Allah swt again reminds of His power in this verse by emphasizing that it is He who owns and controls all that is in the heavens and on earth. Because Allah swt is the Owner and Ruler of all His creatures in this world, the Al-Quran that He sent down is a guide to the best path that guarantees true happiness."
		   },
		   {
			"id": 1753,
			"surah": 14,
			"ayat": 3,
			"tafsir": "In this verse, Allah swt explains that people who prefer worldly life over the hereafter, block others from the path of Allah, and want people to stay away from the straight path that Allah has given to humans, they are astray as far as possible. Various worldly affairs should not neglect us from preparing ourselves for ukhrawi life. However, this worldly life should not be completely neglected, as Allah says: And seek (rewards) for the hereafter with what Allah has bestowed upon you, but do not forget your share in this world (al-Qashash\/28: 77) unbelievers not only deny the Koran, but also prevent other people from following the true path, that is, prevent people from knowing Islamic teachings and making them a way of life. Thus, they are people who go astray and try to mislead others, so that their crimes are multiplied. They also try with various tricks so that the straight path indicated by Allah becomes crooked. They exchange the verses of Allah with what is in accordance with the will of their lusts and evil intentions. Thus, the mistakes they make are multiplied again. Naturally they were overwritten by the wrath of Allah because they had gone astray and disbelieved."
		   },
		   {
			"id": 1754,
			"surah": 14,
			"ayat": 4,
			"tafsir": "In the previous verse, it has been stated that the revelation of the Al-Quran to the Prophet Muhammad is a mercy for humans. Then in this verse, Allah also explains another of His blessings, namely His sending messengers to a people using the language spoken by that people. This facilitated communication between the apostles and their people to provide explanations and guidance to these people. However, even though the holy books had been revealed in their own languages, and the apostles had spoken with them in the same language, there were still those among them who were reluctant to hear, understand, and follow them. Therefore, Allah allows them to go astray and Allah gives guidance to those whom He wills. Allah is Almighty and All-Wise."
		   },
		   {
			"id": 1755,
			"surah": 14,
			"ayat": 5,
			"tafsir": "In this verse, Allah swt shows that the messengers who have been sent to humans have the same task, namely conveying Allah's verses to guide humans to the right path, bringing them out of darkness caused by ignorance, disbelief, and disobedience, to the light which is bright because of faith, guidance and knowledge and noble morals. Allah narrates in this verse that the Prophet Musa (as) was also sent to convey this task, and was ordered to call his people. Allah said, \"Take out your people from darkness to bright light, call them to believe, and remember the days of Allah\". What is meant by \"days of Allah\" are important events that have been experienced by human beings before, such as God's favor that they received when they were released from Pharaoh's slavery, or God's wrath and punishment that had befallen them because of their disobedience. At the end of this verse Allah confirms that the \"days of Allah\" contain signs of His oneness and power. These signs can only be understood by everyone who is patient and grateful."
		   },
		   {
			"id": 1756,
			"surah": 14,
			"ayat": 6,
			"tafsir": "In this verse, Allah swt tells about the Prophet Musa who invited his people to remember the favors of Allah that were bestowed upon them, namely when Allah saved them from the cruelty of Pharaoh and his followers, who had tortured them with severe torture, slaughtered their sons , and let their daughters live. Then the Prophet Musa reminded his people that all the experiences they had gone through were actually a very severe trial from Allah to them, to test their faith and obedience to Him."
		   },
		   {
			"id": 1757,
			"surah": 14,
			"ayat": 7,
			"tafsir": "In this verse Allah swt again reminds His servants to always be grateful for all the blessings He has bestowed. If they do it, then the favor will be added again by Him. On the other hand, Allah also reminds those who deny His favor, and do not want to be grateful that He will inflict a very painful punishment on them. Grateful for God's grace can be done in various ways. First, with a sincere greeting; secondly, accompanied by deeds, namely using the grace for purposes that are pleasing to Him. In everyday life, we can see that people who are generous and like to spend their wealth for the public interest and helping people, generally never fall into poverty or misery. In fact, his fortune is always increasing, his wealth is increasing, and his life is happy, loved and respected in the association. On the other hand, rich people who are stingy, or like to use their wealth for things that are not pleasing to Allah, such as gambling or taking usury, their wealth does not increase, in fact it quickly decreases. In addition, he was always hated and cursed by the people, and in the afterlife received severe punishment."
		   },
		   {
			"id": 1758,
			"surah": 14,
			"ayat": 8,
			"tafsir": "Allah swt explains in this verse the words of the Prophet Musa as when he told his people, that if they and the people on this earth all disbelieve in Allah and deny His grace and mercy, this will not reduce His greatness and majesty. . Because, Allah SWT is Rich and Praised, does not need their thanksgiving and does not need their good deeds for his own sake or to add to His greatness and glory. Their disbelief will be self-defeating, because Allah does not add more favors and mercy to them. Allah's Word: Whoever does good then (his reward) for himself and whoever does evil then (his sin) becomes his own responsibility. And your Lord does not wrong (His) servants at all. (Fushshilat\/41: 46)"
		   },
		   {
			"id": 1759,
			"surah": 14,
			"ayat": 9,
			"tafsir": "In this verse, Allah swt asks mankind if they have ever received news about the earlier peoples, as well as news about events that have happened to them, for example news about the people of Prophet Noah, the people of Ã‚'d and the people of Samud, and the people of who came after them, which only Allah really knows? They belied the apostles even though they had brought clear evidence. They covered their hands to their mouths to show hatred for the apostles, saying, \"Indeed we have disobeyed what you were ordered to convey to us.\" Besides that, these people also told the apostles that they were in doubt and were not sure of the truth that the apostles called on them."
		   },
		   {
			"id": 1760,
			"surah": 14,
			"ayat": 10,
			"tafsir": "In this verse it is explained that because they expressed doubts about what the apostles conveyed to them, especially about the power of Allah, the apostles said to their people, \"Is there any right to doubt about Allah, the Creator of the heavens and the earth? He calls on you to grant forgiveness for all your sins, and He has postponed your torment until a time determined by Him?In contrast, the people of each of the apostles said that the apostles, in their view, were ordinary people like them and have no advantages. Therefore, there is no reason for them to become followers of the apostles. According to them, the apostles have turned them away from the religion they inherited from their ancestors, and prevented them from worshiping the statues that were worshiped by the ancestors.Therefore, they asked for concrete evidence from pa ra apostles to show the truth of their sending as apostles of Allah swt. In fact, the apostles had put forward their respective miracles, which God bestowed upon them as proof of his apostleship."
		   },
		   {
			"id": 1761,
			"surah": 14,
			"ayat": 11,
			"tafsir": "To answer the questions and requests of his people, this verse mentions the words of the apostles to them that it is true that they are only human beings like their people too, it's just that God has given them gifts, namely in the form of prophecy and apostleship, which are accompanied by miracles that can only be used with the permission of Allah swt. Therefore, it is not within the power of an apostle to suggest a miracle other than that which God has bestowed upon him. At the end of this verse it is also shown that trustworthiness is a principle and attitude of life that must be a guide for every believer, if they have carried out their obligations to the best of their ability."
		   },
		   {
			"id": 1762,
			"surah": 14,
			"ayat": 12,
			"tafsir": "In this verse, the affirmation of the apostles is explained to their people, that for them there is no reason at all not to put their trust in Allah, because He has bestowed abundant mercy and favors upon them. Among them is that Allah swt has shown them the straight path that leads them to the bright light of faith so that they earn His pleasure in this world and in the hereafter. Therefore, they will face all the threats of their people with patience and tenacity and trust in the Almighty. It is only to Allah that the believers put their trust and surrender. They are neither afraid nor afraid of the threats of unbelievers because everything in nature is subject to the rule of Allah."
		   },
		   {
			"id": 1763,
			"surah": 14,
			"ayat": 13,
			"tafsir": "In this verse, the continuation of the speech of the disbelievers to the apostles is told, in which they threaten the apostles to be expelled from their country if they do not stop preaching to Allah's religion. The disbelievers presented a choice to the apostles, did they accept the expulsion, or were they willing to return to the religion they had inherited from their ancestors, namely the religion of shirk and kufr. Furthermore, in this verse it is explained that after the threat of the disbelievers, Allah swt revealed to the apostles that He would definitely destroy the unjust people. This revelation is a moral encouragement that has great meaning for each of the apostles who are carrying out their sacred duties, so that they are not afraid to face the tyrannical people."
		   },
		   {
			"id": 1764,
			"surah": 14,
			"ayat": 14,
			"tafsir": "In this verse, Allah swt mentions another of His promises to the apostles, that Allah will place them in those countries, after the unjust people have disappeared because of the punishment that will befall them. He will carry out this promise for those who are pious, who are afraid to face Allah with many sins, and are afraid of His threats and punishment. It can be clearly understood that Allah's promise mentioned in this verse strengthens His promise which has been mentioned in the verse above, regarding the annihilation of the wrongdoers. After they perished and disappeared from the face of the earth, the apostles and their respective people who believed and obeyed Allah became the inhabitants of these countries, and they lived peacefully under the abundance of Allah's mercy and pleasure."
		   },
		   {
			"id": 1765,
			"surah": 14,
			"ayat": 15,
			"tafsir": "People who believe in Allah, hoping for His pleasure and mercy, and fearing His threats and torments, ask Allah to give them victory over their tyrannical enemies. Allah granted their request. So the people who were arbitrary and stubborn were destroyed. Arbitrary and stubborn are the characteristics of arrogant people, who want to match the power and greatness of Allah. They do not care about the laws and regulations that God has bestowed on His servants to regulate the relationship between human beings, in order to achieve a harmonious life, mutual love and mutual respect. Therefore, they should receive punishment from the Almighty and Most Merciful."
		   },
		   {
			"id": 1766,
			"surah": 14,
			"ayat": 16,
			"tafsir": "In this verse it is emphasized that those who reject the truth by denying the apostle sent by Allah to them, even daring to threaten to expel him, are people who want to compete with the power and greatness of Allah. They are stubborn, arrogant, and act arbitrarily. They have been in front of Hellfire, even in life on earth, they have felt like on the edge of hell, always anxious, worried, and full of doubts. In the afterlife, they will be put into hell and given a drink of dirty water like pus. This is a punishment for those who do not care about the laws and instructions that Allah has given to His servants."
		   },
		   {
			"id": 1767,
			"surah": 14,
			"ayat": 17,
			"tafsir": "In this verse, Allah swt describes how severe the torment that the unjust people will receive or suffer in the afterlife, namely torment with a very hot hell fire, they are given a drink that is dirty like pus, and they drink that dirty water, but it is very difficult for them to gulp it down. In addition, the danger of death always threatens them from all directions, but their death is delayed by Allah, so that they will feel the pain of the punishment that will befall them."
		   },
		   {
			"id": 1768,
			"surah": 14,
			"ayat": 18,
			"tafsir": "If in the above verses Allah has explained the punishment that disbelievers will suffer in Hellfire, then in this verse He explains the great loss they will suffer, namely the reward for their good deeds in this world, if any, Allah will erase . Thus, they cannot derive any benefit from the good deeds they may have done in the world. Their deeds are likened to by this verse as ashes blown away by a strong wind, disappearing without a trace. Such a situation is the result of their misguidance and deviation which is very far from the guidance of Allah SWT."
		   },
		   {
			"id": 1769,
			"surah": 14,
			"ayat": 19,
			"tafsir": "In this verse, Allah swt mentions that it is He who created this planet earth and its heavens (atmosphere) with rights. That is, Allah created all of that not for nothing but full of knowledge and wisdom. Scientifically, our earth and its atmosphere contain substances or materials that support life processes. 70% of the earth's atmosphere consists of nitrogen gas (N2), which is inert (harmless to living things), but is very much needed for the emergence of a life process, especially by the world of flora (plants). While 20% of our atmosphere is oxygen gas (O2), which is very much needed for the survival of all living things, because oxygen will provide energy for the ongoing metabolic processes of all living things for their survival; through a process known as respiration (breathing). 70% of our earth contains water (H2O), a substance (chemical molecule) that is very necessary as a medium for metabolic reaction processes for life. The distance between the earth and the sun is quite moderate, namely 92.9 million miles or around 139.35 million km; so that sunlight is able to catalyze (help) the ongoing process of life. Both in humans (the process of forming vitamin D in the skin), animals, or plants (assimilation). Earth's temperature at the equator is also very moderate, an average of only 28-350C. Imagine the other planets that are still in the solar system, such as the planet Mars, whose atmosphere is mostly filled with deadly methane (CH4) gas, the distance from the sun is about 141.6 million miles or 212.40 million km; surface temperature of Mars (at the equator) 0-10oC; so colder than Earth. Or the planet Venus with a very thick atmosphere and its distance from the sun is 67.2 million miles or 100.80 million km, but the planet's temperature is quite cold due to a thick blanket of atmosphere. The surface temperature of Venus at the equator is estimated at -32oC. Meanwhile, the planets Jupiter and Saturn, which are respectively 483.4 million miles from the sun (725.10 million km) and 886.3 million miles (1329.45 million km), have an average temperature on the planet's surface at the equator -143oC. The atmospheres of Jupiter and Saturn are dominated by ammonia gas (NH3). If Allah wills, the earth can be changed easily into a condition like those planets, and then all the creatures of this earth will die. Therefore, humans who have been made by Allah as His caliphs on this earth should use all of this in a good way and for good purposes, according to His rules and regulations. However, if humans deviate from God's rules and regulations, then He will not allow them to commit injustice. So at the end of this verse, Allah SWT confirms to His Messenger that if He wills, He will destroy His people and replace them with new creatures. This affirmation is to remind the apostle and his people who obey and believe in Allah, how great the sins of the disbelievers are, because with their disbelief they do not acknowledge the power of Allah as the creator and sustainer of His creatures. If people think about Allah's power and His mercy towards humans, surely they will come to the belief that only Allah has the right to be worshiped and praised and to be afraid of His punishment and torment."
		   },
		   {
			"id": 1770,
			"surah": 14,
			"ayat": 20,
			"tafsir": "In this verse, Allah also confirms that destroying all of it is not difficult for Him, because He is the creator and ruler. There is nothing that can stop, if He wants to inflict punishment on His servant."
		   },
		   {
			"id": 1771,
			"surah": 14,
			"ayat": 21,
			"tafsir": "In this verse, Allah SWT describes the situation that will occur in Padang Mahsyar, where people are gathered after they are resurrected from their graves, to account for the good deeds and evil deeds that each person has done while in the world. It is stated in this verse, that all humans will gather before Allah in Padang Mahsyar, to be brought to account and to hear Allah's decision regarding their further destiny. And after the account is finished, and the sinners have been determined to be tortured in hell, there arises the awareness and remorse of the weak in faith who have been deceived by the persuasion of the arrogant in this world who treat themselves as gods, and the weak in faith as a servant. At that time, those who were weak in faith said to arrogant people who had been their follower while in the world, \"We were your followers when in the world. Now, can you save us from the punishment and torment of Allah, even if only a little ?\" Furthermore, this verse mentions the arrogant people's response to this statement, \"If Allah had guided us, we would have been able to guide you too. Now we are in the same situation, we have to choose between complaining and regretting our actions, or being patient. accept the fate that Allah has decreed for us. We will never find a place to escape from His punishment and torment.\" This verse clearly illustrates how big a mistake the two groups have made. The first group, namely those who are weak in faith, have allowed themselves to be played by the arrogant in this world, and have served themselves to them, and in the hereafter it turns out that those whom they glorify are unable to defend themselves from Allah's punishment, let alone defend other people. -other people they have enslaved in this world. While the second group, has been deceiving the weak in this world and pretending to be a god. In the hereafter they are also required by their followers to defend and prevent them from the punishment of Allah, but they are helpless, dealing with the power and greatness of Allah SWT."
		   },
		   {
			"id": 1772,
			"surah": 14,
			"ayat": 22,
			"tafsir": "In this verse, Allah mentions the devil's confession before Allah, after the reckoning is completed in Padang Mahsyar. Satan always tempts and misleads people from the right path, by giving a picture in such a way, so that people who are exposed to his temptations see evil as good and commendable deeds. And besides that, Satan also gives promises to those who are tempted by him, namely the benefits they will get if they fulfill his invitation. However, he was unable to fulfill this promise. Satan's confession after the reckoning in Padang Mahsyar was completed was addressed to those people who had been led astray in this world, both the weak groups who had enslaved themselves to other than Allah, as well as the strong and arrogant groups who had considered themselves as God. In his confession, Satan told them that God had actually promised them a true promise, He had the power to fulfill His promise. Satan has also made promises to them, but he is powerless to keep them. Satan has absolutely no power over them, he just calls people to something that is not true, then they just obey his call without using reason. Therefore, humans are guilty. Let them not revile him, but blame themselves. Satan is never able to help them from the punishment and torment of Allah, and they cannot help him either. In fact, Satan has always not justified human actions by associating them with Allah.\" This is how things will be in the hereafter. The strong and arrogant in this world, who have led the weak astray, shake hands from the weak people who have become victims of their error. .Furthermore, Satan, who has tempted and misled the two groups, has also let go of the fate of those who have become victims of his false temptations. All of them are powerless in the face of God's decision for them. At the end of this verse, God again emphasizes that those who wrongdoers, either against themselves or against others, will surely get a painful punishment, as a reward for their injustice."
		   },
		   {
			"id": 1773,
			"surah": 14,
			"ayat": 23,
			"tafsir": "In this verse, Allah mentions again the happiness that will be obtained by those who believe in Allah and always do good deeds, that in the hereafter they will be placed in heaven, a very beautiful garden under whose trees clear rivers flow. . They will remain in it to enjoy a happy life, with Allah's permission as a reward for their faith and good deeds while living in the world. There they said to each other, \"Salam,\" which means peace from all calamities. For those of us who are still alive in this world, Islam teaches us to use the greeting \"Assalamualaikum\" which means \"hope you are always in prosperity\". This is the best teaching for educating humans to be willing and happy when other people get the happiness of life and prosperity, as he feels happy when he himself gets that happiness and prosperity, and is far from envy and jealousy. Expecting others to suffer misery or loss and expecting the loss of happiness or goodness from someone is a trait that is very hated by Islam. In this regard, the Prophet (pbuh) said: None of you will believe until he loves for his brother (fellow believers) what he loves for himself. (Al-Bukhari and Muslim narration from Anas bin Malik)"
		   },
		   {
			"id": 1774,
			"surah": 14,
			"ayat": 24,
			"tafsir": "The parable mentioned in this verse is the parable of good utterances, for example words that contain the teachings of monotheism, such as \"La ilaha illallah\" or other words that invite people to virtue and prevent them from evil. Such words are likened to a good tree, whose roots are firm in the earth. Roots for trees have two main functions: (1) to suck up water and nutrients from the soil and (2) to support the tree upright. If the roots can no longer take nutrients from the soil, the tree will gradually die. Meanwhile, tree roots that function properly will be able to channel nutrients from the soil to the top of the tree and tree growth will go well. Lush branches soaring into the sky. Hadith of the Prophet saw: From Abdullah bin Umar ra, he said, \"Rasulullah saw said, \"Among the types of trees, there is a tree that never loses its leaves. The tree is a parable for Muslims. Tell me, what is that tree? People thought the tree was a tree that grows in the forest. Abdullah said, \"Meanwhile, I think that tree is a date palm. But I am embarrassed to say. Then the friends said, \"Tell us what tree it is, O Messenger of Allah!\" He replied, \"That tree is a date palm.\" Bukhari) Islam teaches its people to get used to using good speech, which is beneficial for themselves, and beneficial to others. A person's speech shows his character and personality as well as his etiquette and manners. On the other hand, every Muslim must stay away from words and words dirty, which can cause disgust for those who hear it."
		   },
		   {
			"id": 1775,
			"surah": 14,
			"ayat": 25,
			"tafsir": "In this verse it is described that a good tree always gives its fruit to every human being, with the permission of its Lord. The process of plant growth requires a variety of nutrients that are quite a lot of kinds. According to the amount needed, these nutrients are divided into macro nutrients which are needed in large quantities, and micro nutrients which are needed in small amounts, but their presence is absolutely necessary. To arrive at the occurrence of fruit, roots must be able to supply all of these nutrient needs in sufficient and balanced quantities. There are several nutrients which, if supplied in excess of their needs, will become toxic to plants and can cause plant death (eg iron for rice). Therefore, humans who take advantage of this tree should be grateful to Allah because in essence the knowledge that has been obtained through someone is a gift and mercy from Allah SWT. Likewise, the good words we say to others, for example in giving useful knowledge, will benefit many people. Everyone who obtains knowledge from a teacher must be grateful to Allah because in essence the knowledge he has obtained through someone is a gift and mercy from Allah SWT. Parents in the household must always use kind and polite words, and stay away from dirty and rude words, because their children will imitate those words."
		   },
		   {
			"id": 1776,
			"surah": 14,
			"ayat": 26,
			"tafsir": "This verse mentions the parable of bad words and sentences, namely utterances that contain disbelief and polytheism or that invite to immoral acts. Those ugly words are likened to a bad tree, whose roots are uprooted from the earth, so that the tree cannot stand firmly, cannot bear leaves and bear fruit. This means that it cannot provide fruit and other benefits for humans, even if it only causes harm, if the tree collapses and falls on them. Ugly words can only lead to sin, and generate anger and hatred. In a hadith narrated by Abu Hathim as a marfu hadith, that the khabitsah syajarah (bad tree) is handhalah whose fruit tastes bitter. People who cannot control their emotions often speak bad words, which harm themselves and harm others. Likewise people who are drunk and damaged in their minds, like to speak ugly words. That is why Islam teaches patience because patience encourages a person to master his emotions. Islam also prohibits a person from things that damage the mind, such as drinking alcohol and others."
		   },
		   {
			"id": 1777,
			"surah": 14,
			"ayat": 27,
			"tafsir": "In this verse, Allah swt explains that He strengthens the believers with good and firm sayings, both in this life and in the hereafter. Thus, there is a reciprocal relationship between faith and good and firm speech. Faith encourages a person to always use good and firm words. On the other hand, good words can maintain the firmness of one's faith. In this verse further, Allah swt emphasizes that He allows astray those who are unjust and who like to act according to their own will, without ignoring the correct rules, among others, by saying bad words that invite disbelief, polytheism, disobedience, and etc."
		   },
		   {
			"id": 1778,
			"surah": 14,
			"ayat": 28,
			"tafsir": "This verse is conveyed in the form of a question, but not to be answered, but only as a warning to Muslims so that they should never act and act as the unbelievers do. Let them always obey, submit, and obey God's commands and stop all His prohibitions. If they disbelieve in Allah, they will surely be punished in this world and in the hereafter, just like what happened to disbelievers. According to Ibn Abbas what is meant by \"those who have exchanged the favors of Allah\" in this verse are the Meccan infidels. They have been awarded various favors that God has not given to other nations. The land of Mecca has been used as an unclean land, namely land that is respected, land whose security is guaranteed, and where the Kaaba is erected, which is visited by people from all over the world every year. Allah swt has brought water, food, and fruits to that barren land. An even greater blessing is the appointment of Muhammad from their own nation as the final prophet and messenger, who carries the religion of Allah, which is the guide and guidance of life for all mankind. They deny all the blessings that have been bestowed on them. In fact, they tortured the Prophet Muhammad and the Muslims and hindered the spread of Islam. Therefore, Allah swt inflicted punishment and torment on them in the form of a dry and long dry season, so that many of them died of hunger. According to history, some of them ate bones because there was no more food to eat. Allah explains that they are people who have exchanged Allah's favors and have placed their people who are their followers in a place full of misery, namely the blazing Hell of Hell, whose fuel is stones and people. From this verse it is understood that Allah swt commands humans to always be grateful for His blessings by following His commands and stopping His prohibitions. All humans and creatures are very dependent on these blessings, both in the form of external blessings, as well as in the form of inner or invisible."
		   },
		   {
			"id": 1779,
			"surah": 14,
			"ayat": 29,
			"tafsir": "This verse is conveyed in the form of a question, but not to be answered, but only as a warning to Muslims so that they should never act and act as the unbelievers do. Let them always obey, submit, and obey God's commands and stop all His prohibitions. If they disbelieve in Allah, they will surely be punished in this world and in the hereafter, just like what happened to disbelievers. According to Ibn Abbas what is meant by \"those who have exchanged the favors of Allah\" in this verse are the Meccan infidels. They have been awarded various favors that God has not given to other nations. The land of Mecca has been used as an unclean land, namely land that is respected, land whose security is guaranteed, and where the Kaaba is erected, which is visited by people from all over the world every year. Allah swt has brought water, food, and fruits to that barren land. An even greater blessing is the appointment of Muhammad from their own nation as the final prophet and messenger, who carries the religion of Allah, which is the guide and guidance of life for all mankind. They deny all the blessings that have been bestowed on them. In fact, they tortured the Prophet Muhammad and the Muslims and hindered the spread of Islam. Therefore, Allah swt inflicted punishment and torment on them in the form of a dry and long dry season, so that many of them died of hunger. According to history, some of them ate bones because there was no more food to eat. Allah explains that they are people who have exchanged Allah's favors and have placed their people who are their followers in a place full of misery, namely the blazing Hell of Hell, whose fuel is stones and people. From this verse it is understood that Allah swt commands humans to always be grateful for His blessings by following His commands and stopping His prohibitions. All humans and creatures are very dependent on these blessings, both in the form of external blessings, as well as in the form of inner or invisible."
		   },
		   {
			"id": 1780,
			"surah": 14,
			"ayat": 30,
			"tafsir": "This verse describes the second and third actions that caused Allah to inflict a painful punishment on them. The second reason is the act of associating partners with Allah. Included in this action are: 1. Acknowledging that God is many. 2. Worshiping others besides worshiping Allah. 3. Recognizing that something other than Allah has power and power like the power and power of Allah swt. Associating partners with Allah is the belief of the Jahiliy Arabs. They have gods other than Allah. Some of the offerings were in the form of statues that they made, some of which they placed around the Kaaba. They believe in magic and fortune-telling. If they wanted to do some important work or a long journey, they would go to the Kaaba and have the custodian cast lots. It is the result of this draw that determines whether they will do the job or the long journey or not. The third reason is that the disbelievers try to mislead people from Allah's path. They hinder, even kill people who do work or follow the Islamic religion. The three types of actions above are grave sins. Therefore, Allah swt ordered the Prophet Muhammad to deliver His stern warning to humans. If they persist in disbelief, let them do as they please, have fun, and do mischief on earth for a certain time, until Allah inflicts a severe punishment upon them. This is confirmed by the word of Allah SWT: Say, \"Enjoy yourself with your disbelief for a while. Indeed, you are one of the inhabitants of hell. (az-Zumar\/39: 8)"
		   },
		   {
			"id": 1781,
			"surah": 14,
			"ayat": 31,
			"tafsir": "In this verse, Allah SWT commands Muslims to do good deeds, which can make people happy in worldly and spiritual life. These actions are: 1. Carrying out the prayer. 2. Donate some of the assets that have been bestowed by Allah swt. Allah swt ordered Muslims to establish prayers, because prayer is the pillar of religion, as the Prophet saw said: Prayer is the pillar of religion, whoever builds it, has actually founded a religion and whoever abandons it, then he has actually torn down religion. (Al-Baihaqi History from Umar bin al-Khatthab) A person who is obedient and always performs prayers in accordance with the teachings of the Koran is a person who is physically and spiritually pure, because prayer prevents those who perform it from committing heinous and forbidden acts, as the word says. Allah swt: ... and carry out the prayer. Verily prayer prevents from (deeds) abominable and unjust. And (know) the remembrance of Allah (prayer) is greater (its priority than other acts of worship). Allah knows what you do. (al-Ankabut\/29: 45) And the word of Allah swt: Really lucky is the person who purifies himself (with faith), and remembers the name of his Lord, then he prays. (al-Ala\/87: 14-15) The first act of the servant that Allah will bring to account on the Day of Judgment is prayer. If a servant prays well, then his deeds are good, otherwise if he prays badly or does not perform them, then all the rewards of his other deeds will be bad and damaged. The Messenger of Allah said: The first act of a servant that Allah will bring to account on the Day of Judgment is prayer. So if the practice of prayer is good, then all the deeds are good, and if the practice of prayer is bad, then all the deeds are bad. (History of ath-thabrani from Anas bin Malik) In fact, Allah swt emphasized that the person who always performs the prayer is the person who becomes the inheritor of Paradise in the hereafter, as He says: As well as the person who maintains his prayer. They are the ones who will inherit, (namely) who will inherit (heaven) Paradise. They live in it. (al-Muminun\/23: 9-11) Carrying out prayers means praying continuously, according to the time determined by religion, complete with conditions and pillars, accompanied by being solemn and sincere. Allah also commands believers to spend part of the wealth that Allah has bestowed upon them, before the Day of Judgment comes, that is, the day when all the doors of repentance have been closed, not a single sin can be redeemed, even if it is redeemed with all the earth's gold. There is no longer a close friend who can help and no one who can save and provide assistance including children and grandchildren. Allah swt said: So today no ransom will be accepted from you or from the disbelievers. (al-hadid\/57: 15) And the word of Allah swt: O you who believe! Spend some of the sustenance that We have given you before the day comes when there will be no more buying and selling, no more friendship and no more intercession. Those who disbelieve are the wrongdoers. (al-Baqarah\/2: 254) The people who are free from the doomsday doomsday are only people who, while living in the world, do good deeds, like to give charity, so that their hearts are pure and clean and willing to what Allah has given them Later. Allah swt said: (That is) on the day (when) wealth and children are useless, except for those who come to Allah with a clean heart. (asy-Syuara\/26: 88-89) Enjoying giving away wealth is a reflection of the true Muslim personality, as someone who has surrendered himself, his wealth and his life to religion, solely to seek the pleasure of Allah swt. This deed is also a manifestation of gratitude to Allah who has bestowed His countless blessings. To those who are grateful for favors, Allah will add more favors from the favors He has given. On the other hand, the attitude of not being happy to spend part of the wealth that Allah has bestowed is a personal reflection of those who deny Allah and His messengers and a reflection of their denial of Allah's favors. They feel that everything they get is solely because of their own hard work. With such an attitude means they have wronged themselves. The consequence of being unjust towards oneself is that they no longer receive additional favors from Allah, they will even be subject to a painful punishment in this world and in the hereafter. Zalim towards other people is that he does not want to give or issue other people's rights that are in his wealth. Unjust to the people around him is to disturb the interests and good relations that have been forged in society. Even from this verse it is understood that a person who is miserly and does not want to spend part of his wealth is arrogant and arrogant. Because he feels he has been able to overcome all kinds of difficulties he faces, including the difficulties and calamities that will befall him on the Day of Resurrection. They feel that they no longer need additional favors and help from Allah, both in this world and in the hereafter. Giving away wealth in Islam takes several forms: 1. Spending wealth to support oneself, children, relatives and wife. 2. Giving away assets to fulfill obligations, such as zakat assets and zakat fitrah. 3. Donate wealth for infaq sunnah. Spending wealth for the maintenance of his wife, relatives, and to fulfill the obligatory maintenance, is an obligation that is determined by religion for those who believe, and its provisions are stated in the verses of the Al-Quran and the hadiths of the Prophet. Meanwhile, sunnah infaq that is given for the public interest and to elevate Allah's sentence is categorized as a charity, that is, an infaq or a deed whose reward will not end, even if the person giving the infaq has passed away, as long as the infaq provides benefits. The giving of obligatory infak, sunnah infak, and subsistence must be accompanied by a sincere intention, solely done to seek the pleasure of Allah, farthest from being happy, wanting to be praised and flattered by fellow human beings. Therefore Allah leaves it up to humans how best to give the treasure to those who are entitled to receive it, so that it produces a reward from Allah's side. If he is worried that joy will arise in his heart, then he may give the treasure in secret, unknown to anyone. If he wants his actions to be imitated by others, then he may also give his wealth openly. Let Muslims remember that wealth in essence belongs to Allah. He bestowed it on humans so that they can carry out their duties as servants of God as long as they live in the world. Therefore, if someone has acquired wealth and has exceeded his needs, it should be donated to those who are entitled to receive it."
		   },
		   {
			"id": 1782,
			"surah": 14,
			"ayat": 32,
			"tafsir": "Allah Almighty and Almighty bestows many favors on His servants. Among them are: Allah, the Most Great, whose knowledge encompasses all things, explains that it is He who has created the heavens and the earth, whose events are much bigger and more difficult than human events, which are always witnessed and paid attention to by humans and in both there are lessons and benefits. . The sky is in the form of space that is infinitely wide and immense, in which there are countless celestial bodies in the form of planets, each of which runs according to a predetermined orbit, following the laws that have been established by Allah SWT. There is not a single planet that does not follow those laws, because not following the laws that have been laid down means the destruction of all the planets. If one contemplates, pays attention to, and studies the neat and orderly arrangement of space, one will feel the meaninglessness of human beings and the greater the majesty and majesty of their Creator will be felt. Allah also created the earth which is one of the space planets, where humans live, live, and prepare themselves before experiencing real life in the afterlife. The surface of the earth is overgrown with various kinds of plants, with various kinds of fruit that are useful and beneficial to humans. In the bowels of the earth there are various kinds of minerals. Everything was created by God for humans. He is the one who sends down rain that comes from water vapor and becomes clouds. The clouds are driven by Him with the wind to a certain place, until they become dark black clouds, then change and fall as rain that waters the surface of the earth. With that rain, the plants grow and prosper, which then becomes big, blooms and bears fruit, as Allah says: And you see the earth is dry, then when We send down water (rain) on it, the earth will live and become fertile and grows a variety of beautiful plant pairs. (al-hajj\/22: 5) And the word of Allah swt: (God) who has made the earth a stretch for you, and made roads on it for you, and who sent down water (rain) from the sky.\" Then We grow with it ( rainwater) various types of plants.(thaha\/20: 53) In scientific terms this verse explains about the biosphere cycle (Biospheric Cycle).God reaffirms His power in governing life on this earth. From the water that pours down from the sky, then appear lush gardens that produce fruit, all of which are intended as sustenance for humans. Then in the verse it continues with \"He has subjected ships to you\", and also \"He has subjected the rivers for you\". Bowing in the two sentences of the verse above is translated from the Arabic word sakhkhara. This implies to humans to use their minds (technology) in making or creating ships that are able to sail in seas, or in the management of rivers, as a place for shipping or other purposes. If humans use their reason by using natural science (God's provisions) so that they can find for themselves God's provisions that God uses to control ships, then humans can make efforts so that human will is in line with His will and His provisions, God's provisions show how to construct ships so they can lift their bodies and their cargo so they don't sink. Allah's provision shows that an object that floats in water will displace as much water as it contains. The weight of the water displaced by the object will be proportional to the upward pressure experienced by the object. By making a hollow ship, a large outer volume will be achieved, but the weight is small because it is hollow. Therefore, the body of the ship and its cargo can be lifted up by force until it floats. By using a propulsion engine similar to that of a land vehicle but which has been adjusted in such a way, the ship is able to float in addition to being able to move in the desired direction. This is an explanation from a scientific point of view. Allah explains this so that humans know how great His power is in governing life and living on the surface of this earth and the blessings that have been bestowed upon humans. For humans who like to pay attention to the events of rain, plants, and the process of life on the surface of this earth, they will know how high the value of Allah's law is and how extensive His knowledge is, which applies permanently, unceasingly until the time He determines. Allah also commands people to pay attention to the water they drink so that they are grateful, as His word: Have you ever paid attention to the water you drink? Did you send it down from the clouds or did We send it down? If We had willed, We would have made it salty, why are you not grateful? (al-Waqiah\/56: 68-70) Allah subdued the ship (ark) for humans, the intention is to give humans the ability to build ships and make them able to float on the surface of the water and sail to where they want, bringing them to all corners of the world. Allah swt subdued the seas for humans so that the sea can be navigated by ships carrying all their needs, as He says: And a sign (of Allah's greatness) for them is that We carried their offspring in ships that were full of cargo, and We created ( also) for them (other transport) like what they drive. (Yasin\/36: 41-42) With the same ship, humans have fun enjoying the voyage. With that ship they also make a living, catch fish, look for marine products, and search for priceless minerals. All of these are God's gifts to humans. God has made rivers subservient to mankind, such as giving the ability to dam and flow them for agricultural purposes, and to turn their swift currents into useful sources of energy, such as waterwheels and electric currents. Rivers can also function as highways for ships to pass through and are the arteries of trade. To shorten river traffic, humans make canals that connect one river to another, and between one ocean and another. Dirty river water can be cleaned, so that it becomes indispensable drinking water."
		   },
		   {
			"id": 1783,
			"surah": 14,
			"ayat": 33,
			"tafsir": "Likewise, as a blessing from Allah SWT to humans, He has conquered for humans the sun and moon, that is, making the sun and moon continuously walk around their orbits, which creates light and darkness which are beneficial to life and the lives of creatures. By keeping the sun and moon, as well as the other planets, walking around their orbits, a terrible collision will be avoided between the planets in the firmament, as Allah says: it reaches its last circulation) returns it like an old bunch shape. It is not possible for the sun to overtake the moon and for the night to precede the day. Each circulates in its orbit. (Yasin\/36: 39-40) The existence of an orbit that is continuously traversed by each planet, has given way for humans to the moon, giving great possibilities for humans to try to reach other planets. With the intermediary of the same orbit, humans can place satellites that can be used for the benefit of mankind, such as to know the weather conditions, to facilitate telecommunications relations and so on, so that relations between countries that were previously felt far away now feel closer. Allah swt also subjected humans to day and night. Daytime can be used by humans as a place to do business, do charity, and socialize. While the night can be used as a time to rest from fatigue after trying during the day. Allah says: And it is because of His mercy, He made for you the night and the day, so that you may rest at night and that you may seek some of His bounty (during the day) and that you may give thanks to Him. (al-Qashash\/28: 73) In this verse Allah also uses the word sakhkhara (subject), which suggests us to use reason in making use of both the sun, the moon, and the phenomena of night and day. Thus this sakhkhara contains instructions for developing technology, a calendar based on the sun (solar calendar) or the moon (lunar calendar), and solar energy (solar energy). It also contains instructions to use either the sun or the moon for navigation purposes in voyages or flights, and so on. Likewise using night and day to find out or measure our biological clock. This is an explanation from a scientific point of view."
		   },
		   {
			"id": 1784,
			"surah": 14,
			"ayat": 34,
			"tafsir": "As a blessing from Allah, He has provided for humans everything they need, whether asked for or not, because Allah has created the heavens and this earth for humans. He provides for humans everything that exists, so that it can be used and utilized whenever desired. Sometimes humans themselves do not know what their basic needs are, where without those needs, they will not live or be able to achieve their goals. Such a need is still bestowed by Allah to him even without being asked. There are also other forms of human need that cannot be obtained except by trying and praying, because it requires human effort to obtain them. There are so many blessings from Allah SWT that He has bestowed on humans, so if anyone wants to count them, they certainly won't be able to. Therefore, every human being should be grateful for the blessings that have been given by Allah SWT by obeying all His commands and not doing things that are forbidden by Him. Being grateful for Allah's favors that must be done by humans is not something that is needed by Allah SWT. Allah is Rich, does not need anything from humans, but most humans are very unjust and deny the blessings that have been given to them."
		   },
		   {
			"id": 1785,
			"surah": 14,
			"ayat": 35,
			"tafsir": "In these verses, Allah swt ordered the Prophet Muhammad to convey to his people the story of when Prophet Abraham prayed to his God, so that this prayer would become an inspiration and lesson for the Arabs at that time, because Abraham as was the forerunner and origin of their descendants. . The prayer is: O our Lord, make this land of Mecca a safe, secure and peaceful land, and protected from wars and enemy attacks. This prayer of Prophet Ibrahim was granted by God, and He has made the land of Mecca and its surroundings, a land and a safe place for the people who are there. In that land, it is forbidden to shed blood, torturing people, to kill animals, and to cut down the plants that are there. Allah said: Do they not see that We have made (their country) a holy land that is safe, even though the people around it are robbing each other. Why (after the truth is clear) do they still believe in falsehood and deny Allah's favor? (al-Ankabut\/29: 67) The Arabs and those who live around the Arabian Peninsula, from the past until now still view sacred and respect this forbidden land. The Arabs used to be a nation known as a nation that felt humiliated if they could not defend themselves against the killing or abuse committed by a person or a tribe against members of their tribe. The demand for defense is a sacred obligation to defend the honor of his tribe which has been tarnished. Therefore, they will hold a counter-prosecution at every opportunity they can. Unless they meet in the forbidden land, they will not carry out a defense prosecution. They waited outside the forbidden land. After the enemy came out of the forbidden land, then they took revenge. Likewise, the sacred land is respected and protected from the evil intentions of those who want to destroy the Kaaba and pollute it. As has been done and experienced by Abraha, the governor of Ethiopia and his army. Abraha who is a Christian can conquer Yemen who is a Jew. He intended to develop Christianity in Yemen and make Yemen the center of Christianity in the Arabian Peninsula. He also knows that people in the Arabian Peninsula have great respect for the Kaaba. Because of that he wanted to divert people's attention from respecting and visiting the Kaaba to respecting and visiting a place or building that is in Yemen. To fulfill his wish, a large and magnificent church was built in Yemen, but the inhabitants of the Arabian Peninsula were not interested in visiting, let alone respecting the building. Because of this, Abraha's anger arose, so he prepared troops riding elephants to invade Mecca and destroy the Kaaba. Even though he and his army did not encounter the slightest resistance from the Meccans at that time, Allah swt destroyed Abraha with his army until they broke up. The event of the destruction of Abraha and his army when they attacked Mecca, is described by Allah SWT in His words: Haven't you (Muhammad) noticed how your Lord has acted against the army of elephants? Had He not rendered their deceit useless? And He sent them flocks of birds, which pelted them with stones of burnt clay, so that He made them like leaves to eat (worms). (al-Fil\/105: 1-5) In the hadiths of the Prophet Muhammad, much was explained about the designation of the land of Mecca as unclean land. Even in the hadith narrated by al-Bukhari it is emphasized that the land of Mecca has been designated by Allah as an unclean land since Allah created the heavens and the earth: From shafiyah bint Syaibah, he said, \"I heard the Messenger of Allah preaching on the day of the conquest of Mecca, he said, \"O people humans, verily Allah has made Mecca an unclean land on the day of the creation of the heavens and the earth, so He has forbidden it until the Day of Judgment, it cannot be cut off its vegetation, it cannot be hunted for its animals and it cannot be taken from its findings except for someone who will announce it.\" (History al-Bukhari) The Prophet Muhammad once prayed to Allah swt so that Medina would also be used as an unclean land. This prayer was said by the Prophet when the Muslims faced him at the beginning of the fruit season, to present the fruits to him. When he held the fruit the fruit that was given, he prayed: O God, in fact Abraham was a servant you, your beloved, and your prophet. Likewise I am Your servant and prophet. Indeed, Ibrahim has prayed to You for Mecca, and indeed I also pray for Medina as he prayed to You for Mecca and the like (Muslim History from Abu Hurairah) Ibrahim also prayed that Allah swt would prevent him and his descendants from worshiping idols, because the deed misleads people from the right path to the wrong path. Furthermore, Ibrahim explained that whoever among his children and grandchildren followed him, namely believing in Allah wholeheartedly, purifying obedience and submission to Allah alone, those were the people who followed his religion. On the other hand, whoever among his children and grandchildren does not follow his religion, and does not follow the instructions of Allah that he has conveyed, then Allah is Most Forgiving, Most Everlasting Mercy, Most Recipient of Repentance by guiding people to the right path. This means that anyone who claims to be a follower of the Prophet Abraham, of course he adheres to a religion based on monotheism, admits that God is One, does not have children, was not born or created, and is not associated with anything, as the confessions of adherents of religions which state that origin Their religion is the religion of Prophet Abraham. It is impossible for a religion to claim to be a follower of the teachings of Abraham even though they associate partners with Allah, and do not purify obedience and submission to Allah alone. This prayer of the Prophet Abraham was not entirely granted by Allah because many of his children and grandchildren were disobedient to Allah, in addition to many who believed, some were even appointed as prophets and apostles. In the last verse, Allah swt explained that after Prophet Abraham was appointed a prophet and apostle, he also prayed that his descendants would later be appointed prophets and apostles, but Allah swt replied that not all of Prophet Abraham's prayers were granted by God, because people -an unjust person, even though he is the son of a prophet and apostle, is impossible to be appointed as a prophet and apostle, like his father and grandfather. Allah swt said: And (remember), when Abraham was tested by his Lord with a few sentences, then he carried it out perfectly. He (Allah) said, \"Verily I have made you a leader for all mankind.\" He (Ibrahim) said, \"And (also) from my children and grandchildren?\" Allah said, \"(True, but) My promise does not apply to the wrongdoers.\" (al-Baqarah\/2: 124) From this verse it can be understood that Muslims are prohibited from appointing wrongdoers as leaders who will take care of their affairs. Those who will be appointed as leaders should be people who are still clean in spirit, like to do pious deeds, carry out Allah's commands, and stop His prohibitions."
		   },
		   {
			"id": 1786,
			"surah": 14,
			"ayat": 36,
			"tafsir": "In these verses, Allah swt ordered the Prophet Muhammad to convey to his people the story of when Prophet Abraham prayed to his God, so that this prayer would become an inspiration and lesson for the Arabs at that time, because Abraham as was the forerunner and origin of their descendants. . The prayer is: O our Lord, make this land of Mecca a safe, secure and peaceful land, and protected from wars and enemy attacks. This prayer of Prophet Ibrahim was granted by God, and He has made the land of Mecca and its surroundings, a land and a safe place for the people who are there. In that land, it is forbidden to shed blood, torturing people, to kill animals, and to cut down the plants that are there. Allah said: Do they not see that We have made (their country) a holy land that is safe, even though the people around it are robbing each other. Why (after the truth is clear) do they still believe in falsehood and deny Allah's favor? (al-Ankabut\/29: 67) The Arabs and those who live around the Arabian Peninsula, from the past until now still view sacred and respect this forbidden land. The Arabs used to be a nation known as a nation that felt humiliated if they could not defend themselves against the killing or abuse committed by a person or a tribe against members of their tribe. The demand for defense is a sacred obligation to defend the honor of his tribe which has been tarnished. Therefore, they will hold a counter-prosecution at every opportunity they can. Unless they meet in the forbidden land, they will not carry out a defense prosecution. They waited outside the forbidden land. After the enemy came out of the forbidden land, then they took revenge. Likewise, the sacred land is respected and protected from the evil intentions of those who want to destroy the Kaaba and pollute it. As has been done and experienced by Abraha, the governor of Ethiopia and his army. Abraha who is a Christian can conquer Yemen who is a Jew. He intended to develop Christianity in Yemen and make Yemen the center of Christianity in the Arabian Peninsula. He also knows that people in the Arabian Peninsula have great respect for the Kaaba. Because of that he wanted to divert people's attention from respecting and visiting the Kaaba to respecting and visiting a place or building that is in Yemen. To fulfill his wish, a large and magnificent church was built in Yemen, but the inhabitants of the Arabian Peninsula were not interested in visiting, let alone respecting the building. Because of this, Abraha's anger arose, so he prepared troops riding elephants to invade Mecca and destroy the Kaaba. Even though he and his army did not encounter the slightest resistance from the Meccans at that time, Allah swt destroyed Abraha with his army until they broke up. The event of the destruction of Abraha and his army when they attacked Mecca, is described by Allah SWT in His words: Haven't you (Muhammad) noticed how your Lord has acted against the army of elephants? Had He not rendered their deceit useless? And He sent them flocks of birds, which pelted them with stones of burnt clay, so that He made them like leaves to eat (worms). (al-Fil\/105: 1-5) In the hadiths of the Prophet Muhammad, much was explained about the designation of the land of Mecca as unclean land. Even in the hadith narrated by al-Bukhari it is emphasized that the land of Mecca has been designated by Allah as an unclean land since Allah created the heavens and the earth: From shafiyah bint Syaibah, he said, \"I heard the Messenger of Allah preaching on the day of the conquest of Mecca, he said, \"O people humans, verily Allah has made Mecca an unclean land on the day of the creation of the heavens and the earth, so He has forbidden it until the Day of Judgment, it cannot be cut off its vegetation, it cannot be hunted for its animals and it cannot be taken from its findings except for someone who will announce it.\" (History al-Bukhari) The Prophet Muhammad once prayed to Allah swt so that Medina would also be used as an unclean land. This prayer was said by the Prophet when the Muslims faced him at the beginning of the fruit season, to present the fruits to him. When he held the fruit the fruit that was given, he prayed: O God, in fact Abraham was a servant you, your beloved, and your prophet. Likewise I am Your servant and prophet. Indeed, Ibrahim has prayed to You for Mecca, and indeed I also pray for Medina as he prayed to You for Mecca and the like (Muslim History from Abu Hurairah) Ibrahim also prayed that Allah swt would prevent him and his descendants from worshiping idols, because the deed misleads people from the right path to the wrong path. Furthermore, Ibrahim explained that whoever among his children and grandchildren followed him, namely believing in Allah wholeheartedly, purifying obedience and submission to Allah alone, those were the people who followed his religion. On the other hand, whoever among his children and grandchildren does not follow his religion, and does not follow the instructions of Allah that he has conveyed, then Allah is Most Forgiving, Most Everlasting Mercy, Most Recipient of Repentance by guiding people to the right path. This means that anyone who claims to be a follower of the Prophet Abraham, of course he adheres to a religion based on monotheism, admits that God is One, does not have children, was not born or created, and is not associated with anything, as the confessions of adherents of religions which state that origin Their religion is the religion of Prophet Abraham. It is impossible for a religion to claim to be a follower of the teachings of Abraham even though they associate partners with Allah, and do not purify obedience and submission to Allah alone. This prayer of the Prophet Abraham was not entirely granted by Allah because many of his children and grandchildren were disobedient to Allah, in addition to many who believed, some were even appointed as prophets and apostles. In the last verse, Allah swt explained that after Prophet Abraham was appointed a prophet and apostle, he also prayed that his descendants would later be appointed prophets and apostles, but Allah swt replied that not all of Prophet Abraham's prayers were granted by God, because people -an unjust person, even though he is the son of a prophet and apostle, is impossible to be appointed as a prophet and apostle, like his father and grandfather. Allah swt said: And (remember), when Abraham was tested by his Lord with a few sentences, then he carried it out perfectly. He (Allah) said, \"Verily I have made you a leader for all mankind.\" He (Ibrahim) said, \"And (also) from my children and grandchildren?\" Allah said, \"(True, but) My promise does not apply to the wrongdoers.\" (al-Baqarah\/2: 124) From this verse it can be understood that Muslims are prohibited from appointing wrongdoers as leaders who will take care of their affairs. Those who will be appointed as leaders should be people who are still clean in spirit, like to do pious deeds, carry out Allah's commands, and stop His prohibitions."
		   },
		   {
			"id": 1787,
			"surah": 14,
			"ayat": 37,
			"tafsir": "This verse describes when Ibrahim as was about to return to Palestine to meet his wife Sarah, leaving his wife Hajar and his young son Ismail in Mecca, in the middle of a barren desert, unaccompanied by any human being and without provisions for his abandoned family. It was then that he prayed to God the Most Gracious, asking that his family be protected and saved from all the dangers and disasters that might befall him. Ibrahim as was a prophet and apostle who was sent to call on king Namrudz, king of Babylon and his people, so that they follow the religion of Allah. After receiving torture, obstruction, and threats from king Namrudz and his followers, Ibrahim left Babylon and finally settled in Palestine, with his wife Sarah and a maid named Hajar. Because Sarah was a barren woman, Abraham did not have any sons, even though he was old. Even so, his desire to have a son is still his dream. Therefore, he married his wife's maid named Hajar after obtaining permission and approval from Sarah. From that marriage, a son named Ismail was born and with that birth, Ibrahim's dream that he had wanted all this time was fulfilled. Ibrahim's affection for his son Ismail and his growing love for Hajar caused Sarah to feel anxious and jealous. Anxious because he is worried that Ibrahim's love for him will decrease, and jealous because he himself cannot fulfill Ibrahim's wish to have a son to continue his life, while his maid Hajar can fulfill her husband's wish. Sarah conveyed her feelings to her husband Ibrahim, and asked him earnestly that Ibrahim should take Hajar and his son Ismail away from her. Thus, he no longer saw Hajar's happiness and Ismail's growing maturity. Ibrahim could feel how deep his love for Sarah was. He was also worried that Sarah would be sad if the request was not granted. Therefore, Ibrahim also granted Sarah's request. So he took Hajar and his son, Ismail who was still small, following the camel without knowing its destination, in a state of compassion and emotion remembering the fate that would be experienced by his wife and son later. Under these circumstances, without realizing it, he came to an area that was foreign to him, an area located between the barren rocky hills, which is now called the city of Mecca. At that time, Mecca was a desert lowland area that had not been inhabited by a single human. No water source found. According to a hadith narrated by al-Bukhari that in that place there was a tree, and it was under that tree that Abraham and his family took shelter and relieved themselves from the long journey from Palestine to Mecca today. After several days Ibrahim accompanied Hajar and his son there, he also remembered his wife Sarah who he had left in Palestine. Wanting to return to Palestine, he did not have the heart to leave Hagar and his son. Under these circumstances, he decided to return to Palestine and seek approval from Hajar. When he asked for Hajar's approval and consent, Hajar asked Ibrahim, \"Did Allah order you to place me in this deserted, barren area?\" Ibrahim replied, \"Yes.\" Hajar replied, \"If so, He (Allah) will not abandon us.\" So Ibrahim went to Palestine, met his wife Sarah and left his wife and son Ismail who was still small in that place, in the middle of the scorching sun of the desert, without a house for shelter, and sufficient supplies, except for a jug of water to quench thirst. When Hajar and her son arrived at a place where all the provisions and drinking water had run out, her son Ishmael wept from thirst, while his milk stopped flowing. He intended to find water, and he put his son to sleep under a tree where he took shelter. He also went wherever he thought there was water, but he did not find a drop. so, without realizing it he had jogged back and forth seven times between the hills of Safa and the hills of Marwah, but he had not yet gotten a drop of pure water. So with a sense of sadness and despair, he returned to where his son was left behind. At that time Ishmael was crying from thirst while slapping his feet on the ground. Hajar also prayed to surrender herself to the Most Gracious God. Under these circumstances, Ibrahim, who was continuing his journey to Palestine, remembered his wife and son who were left behind and the fate he might be suffering, because it was thought that the food and water he had left had run out. Then he prayed as contained in the verse, \"O my Lord, I have placed some of my descendants, namely my wife and son Ismail, who will continue my descent, in a desert valley that is barren and arid, near where the Kaaba, Your house will be built. later, respected, whom You will forbid people to dishonor their honor, and which You will make the surrounding area an unclean area, that is, it is forbidden in that land to fight and shed blood.\" The prayer of Abraham and his wife Hajar was granted by God. At that time, water gushed out from the ground where the feet of his son Ismail who was crying had been beaten. At that moment, Hajar felt gratitude to Allah for His infinite mercy, and a hope arose in her heart for her and her son's survival, so she drank the water for her son Ismail. Because he was worried that the water would run out and disappear back into the sand, he collected the water with his hands, saying, \"Zam! Zam! (Gather up! Gather!)\" And the water collected, has not dried up until now and is called Zamzam Lake . With the Zamzam Lake in that place, many people passing by ask for water there. When the Bani Jurhum saw that there was a source of water in that place, they asked permission from Hajar to live together there, and Hajar granted the request. Since then, began life in that barren area, more and more newcomers who settled. Eventually a country and culture arose, so that the area became a crossroads for trade between west and east. After Ismail grew up, he married one of the women of Bani Jurhum, the newcomer, who then gave birth to offspring who were the future inhabitants of the country. The descendants multiplied, inhabiting the land of Mecca and its surroundings. It was from Ismail's descendants that the Prophet Muhammad was later born, as the last prophet and messenger of Allah. In the verse above, it is further explained that Ibrahim as prayed to God to take care of his descendants in Mecca, to make them devout people who perform prayers, serve and submit themselves to God. He also asked God to incline the human heart, love and compassion for his offspring, to be given sustenance, and to bring food and fruit to that barren land, because in that country it is impossible to grow the plants needed as food. food material. Prophet Ibrahim's prayer was granted by Allah swt. It has been proven that since ancient times until now many people have visited Baitullah to carry out the Hajj and Umrah pilgrimages, as well as to see the remains and struggles of the Prophet Muhammad and his companions. Likewise, many kinds of necessities were brought to the barren land, such as foodstuffs, fruits, and articles of clothing to luxury goods. The bestowal of multiple gifts is confirmed in the word of Allah SWT: And they said, \"If we follow the instructions with you, we will surely be expelled from our country.\" (Allah said) Did We not confirm their position in the safe land of the forbidden (holy land), which brought to that place fruits of all kinds (plants) as sustenance (for you) from Us? But most of them don't know. (al-Qashash\/28: 57) Allah swt bestowed a lot of sustenance and wealth on the people and lands of Arabia so that they would be grateful for Allah's blessings by guarding the Baitullah, carrying out His commands, and stopping His prohibitions. From this verse, it can be understood that everything that is obtained while living in this world, is for the purpose of worshiping God. With the results obtained, the implementation of Allah's commandments and the termination of His prohibitions can be perfected, not solely for one's own interests and pleasure."
		   },
		   {
			"id": 1788,
			"surah": 14,
			"ayat": 38,
			"tafsir": "Furthermore, Prophet Ibrahim prayed, \"O our Lord, indeed You know everything that is stored in our hearts including everything that is implied and etched in our hearts. You also know everything that we say and declare including the prayers that have been we pray to You. There is nothing that You do not know about everything in the earth and in the sky, for all that is only You who creates, owns and manages it, please accept our prayers, O our God.\" This verse teaches Muslims how to pray properly in accordance with religious regulations, namely praying with a clean heart, full of belief in the greatness and power of Allah, and the content of the prayer describes the desire to perfect one's self-serving to God, not to achieve a goal. -Aspirations for self-interest and pleasure and harm others. The prayer that the Prophet Abraham asked for was intended so that God would make him and his children and grandchildren obedient servants of God, and that his children and grandchildren would be given sustenance, so that with that sustenance they could perfect their self-serving to Allah. With this provision, they can defend and develop Allah's religion and become servants and khadam of the Kaaba, the house of Allah."
		   },
		   {
			"id": 1789,
			"surah": 14,
			"ayat": 39,
			"tafsir": "Ibrahim as offered praises to Allah, the Lord of the Universe, who had bestowed upon him the two best sons, at a time when he and his wife were old, it was impossible to have another son, even his wife Sarah had given up and felt she was no longer possible. have children. It was then that he was blessed with a son named Ishak and previously he had been awarded a son from his wife Hajar. Even though Sarah was very old and it was no longer possible for her to bear children, her wish to have a son was always her dream, especially after hearing that Ismail had grown up, her husband Ibrahim always visited her where he grew up in Mecca, which is very far from Palestine. Jealousy arises for Hajar, his former maid, especially after he married Ibrahim with his permission. Added to Sarah's thoughts, why was her maid blessed by Allah swt with a son, while she herself had not yet been awarded. The jealousy was getting bigger and bigger. Under these circumstances, an angel came to the two elderly husband and wife, conveying God's command to tell the good news that God would give them a son named Isaac, a boy who would be appointed as a prophet and apostle in the future. . The news was received by Ibrahim, especially Sarah, with a sense of wonder and disbelief, but full of hope. She could hardly believe the news because she was too old to conceive and give birth to children. According to custom, it is impossible for a woman of her age to bear children. Even so, he also had hope because the news came from God Almighty delivered by His messenger angel. He believes and believes that God has the power to create what He wills, everything is easy for God. The angel gave the news to Ibrahim and Sarah that they would have a son, described in the word of Allah SWT: And his wife stood up and smiled. So We conveyed to him the good news about (the birth of) Isaac and after Isaac (will be born) Jacob. She (his wife) said, \"It's a miracle, is it possible for me to give birth to a child when I'm old, and my husband is very old? This is really something miraculous.\" They (the angels) said, \"Why do you wonder about Allah's decree? (That is) Allah's mercy and blessings, poured out on you, O ahlul-bait! Verily, Allah is Praiseworthy, Most Merciful.\" (Hud\/11: 71-73) And the word of Allah swt: (They) said, \"Do not be afraid, indeed we give you good news with (the birth of a) son (who will become) a clever person (Ishak ).\" He (Ibrahim) said, \"Is it true that you gave me good news even though I was advanced in age, then (by way of) how did you give (the good news)?\" (They) replied, \"We convey the good news to you properly, so do not be of those who despair.\" He (Ibrahim) said, \"No one despairs of the mercy of his Lord, except those who go astray.\" (al-hijr\/15: 53-56) Ibrahim offered praise and thanks to Allah, the Most Gracious for His other gifts, namely granting his prayers, such as making the land of Mecca and its surroundings as unclean land, making him and some of his descendants pious people even raised his two sons, Ishmael and Isaac, to be prophets and apostles. What Ibrahim felt when he offered praise and thanksgiving to God is understandable, how happy he and his family were after trying hard, experiencing very heavy trials, getting obstacles and obstacles from their father and people, then when he and his wife got older old, he saw all the results of his efforts, almost everything he had asked God before, was granted. In fact, his dream of having children, which he initially felt would not be possible, then, by the will of the Most Gracious God, finally came true, so that his second son, Isaac, was born."
		   },
		   {
			"id": 1790,
			"surah": 14,
			"ayat": 40,
			"tafsir": "In this verse another description of Abraham's gratitude to Allah for all His blessings. He becomes more submissive and obedient to Allah, and prays that Allah will make his descendants always perform prayers, never neglect to do them in the slightest, perfect the pillars and conditions, and also perfectly carry out his traditions with complete submission and solemnity. Ibrahim as prayed that his descendants would always pray, because prayer is the difference between a believer and an unbeliever and is the subject of worship commanded by Allah. People who always pray, it will be easy for him to do other acts of worship and good deeds. Prayer can purify the soul and body because prayer can prevent humans from heinous and unjust acts, as the word of Allah swt: Â¦and pray. Verily prayer prevents from (deeds) abominable and unjust. And (know) the remembrance of Allah (prayer) is greater (its priority than other acts of worship). Allah knows what you do. (al-Ankabut\/29: 45) Ibrahim as asked Allah SWT to accept his worship. This desire to worship God takes precedence over the desire to follow the will of his father, as Allah says: And I will distance myself from you and from what you worship besides Allah, and I will pray to my Lord, hopefully I will not be disappointed by praying to My Lord.\" (Maryam\/19: 48) What is meant by prayer in this verse is worship. Rasulullah saw stated that prayer is worship. Then he read the word of Allah swt: Indeed, those who are with your Lord are not reluctant to worship Allah and they purify Him and only to Him they prostrate (al-Araf\/7: 206)"
		   },
		   {
			"id": 1791,
			"surah": 14,
			"ayat": 41,
			"tafsir": "Ibrahim as prayed that Allah would forgive all his mistakes, the mistakes of his parents, and the mistakes of those who believed on the day when Allah gathered them to be accounted for for all the deeds and deeds he had done while living in the world before. It was narrated from al-Hasan that Ibrahim's mother was a believer in Allah, while his father was a disbeliever. He begged forgiveness for his father because he had promised to beg forgiveness for his father. However, when it turned out that his father was still in disbelief and became an enemy of Allah, then he separated himself from him, as stated in His words: As for Abraham's request for forgiveness (to Allah) for his father, it was nothing but because of a promise he had made to his father. So when it became clear to Ibrahim that his father was an enemy of Allah, Abraham separated himself from him. Truly, Ibrahim was a very meek and forbearing man. (at-Taubah\/9: 114)"
		   },
		   {
			"id": 1792,
			"surah": 14,
			"ayat": 42,
			"tafsir": "It is mentioned in history that the polytheists of Mecca always hindered and opposed the Prophet Muhammad and his companions in carrying out their da'wah as God had commanded them. Day by day, these obstacles and obstacles are increasing, even to the point of persecution and boycott. Many friends were persecuted. They do not want to have buying and selling relations, brotherhood relations and mutual assistance relations with the Muslims. The torture and persecution were so severe that almost the companions of the Prophet gave up. Meanwhile, the polytheists seem as if they were given a heart by Allah by giving them power and wealth. Their actions are increasingly indiscriminate. In such circumstances, Allah warned the Prophet Muhammad with a verse which stated, \"O Muhammad, do not think that Allah is negligent and does not pay attention to the actions and deeds of the polytheists of Mecca who are unjust. wronged themselves. Allah must record all their deeds. Nothing escapes his record. All their actions and deeds will be rewarded accordingly. Allah will put them into a burning hell in the hereafter.\" With the revelation of this verse, the hearts of the Prophet and his companions became peaceful. Their fighting spirit increased. They increase efforts to develop the religion of Allah. The heavier the pressure and persecution that the polytheists are subjected to, the more their efforts to propagate Islam will increase, because they believe that Allah will surely fulfill His promises. This verse is addressed to the Prophet Muhammad, but what is meant is all of the people of the Prophet Muhammad, including his people who live today. Therefore, Muslims do not need to be affected by the lives of tyrannical people who are full of luxury and pleasure, as if they were God's people. All of this is only a trial by God and is temporary in nature, until the appointed time, namely the day full of turmoil and tribulation, a day when human eyes widen in fear of facing the retribution that God will give."
		   },
		   {
			"id": 1793,
			"surah": 14,
			"ayat": 43,
			"tafsir": "In this verse, Allah SWT explains the condition of those who were unjust while living in the world, namely their condition when they are resurrected from their graves, then they go to Padang Mahsyar, they come rushing to fulfill the calls of callers who call them with contempt. Their situation was like that of a person about to be hanged. They walked forward without turning right or left, their eyelids didn't move and their eyes didn't blink a bit. Their hearts at that time were empty and empty, thinking of nothing but fear of facing the terrible doom that would soon befall them. In another verse, Allah swt describes the condition of the disbelievers who were raised from the graves, namely: So turn your back (Muhammad) from them on the day (when) callers (angels) invite (them) to something unpleasant (day of vengeance), their eyes were downcast, when they came out of the grave, as if they were locusts flying around, they obediently came to the caller. The disbelievers say, \"This is a hard day.\" (al-Qamar\/54: 6-8) And the word of Allah swt: (That is) on the day when they come out of the grave quickly as if they were going quickly to the idols (while in the world), their eyes are down filled with humiliation. That was the day that was threatened to them. (al-Maarij\/70: 43-44)"
		   },
		   {
			"id": 1794,
			"surah": 14,
			"ayat": 44,
			"tafsir": "In this verse, Allah swt orders to give a warning to the wrongdoers and the polytheists of Mecca, namely about the complaints and groans that come out of their mouths when doom befalls them in the hereafter while begging, \"O our Lord, give us another chance, even if it's only for a few moments to obey Your call and follow the teachings of Your apostle by returning us to the world. truly will purify obedience to You alone, we will not associate partners with You anymore, O our Lord.\" Their request was answered by Allah swt with His words: And they swore by (name) Allah with a solemn oath, \"Allah will not raise the dead.\" Not so (surely Allah will raise him up), as a true promise from Him, but most people do not know. (an-Nahl\/16: 38) According to the history of al-Baihaqi from Muhammad bin Kaab Al-Quradhi, he said, \"The inhabitants of hell pray to Allah five times. Allah answered four times while the fifth prayer was answered by Allah with an order so that they do not say again and to remain languishing in hell.\" These prayers are in the word of God as follows: They replied, \"O our Lord, You have killed us twice and have given us life twice (also), then we confess our sins. Then is there a way (for us) to get out (of hell)?â€ (Gafir\/40: 11) This request was answered by Allah SWT with His words: That is because you actually deny when called upon to worship Allah alone. And if Allah is associated, you believe. So the decision (now) is with Allah, the Most High, the Most Great. (Gafir\/40:12) The prayer of the second resident of hell is as stated by Allah SWT: And (what a horror), if you saw those who sinned bowed their heads before their Lord, (they said), \"O our Lord, we have seen and heard, so return us (to the world), surely we will do good deeds. Indeed, we are people who believe.\" (As-Sajdah\/32:12) Their request was answered by Allah swt in His word: So feel for you (this punishment) because you neglected to meet your day (Doomsday), indeed We also neglected you and feel eternal punishment, for what you have done.\" (as-Sajdah\/32: 14) The prayer of the inhabitants of hell for the third time is as stated in the word of Allah SWT: ) even for a moment, surely we will obey Your call and will follow the apostlesÂ¦.\" (Ibrahim\/14: 44) Their request was answered by Allah SWT in His word: (They were told), \"Wasn't it formerly (in this world) ) have you sworn that you will never perish? (Ibrahim\/14: 44) The prayer of the inhabitants of hell for the fourth time is as the word of Allah swt: And they scream in hell, \"O our Lord, take us out (from hell), surely we will do good, which is different from what has been we do first.\" (Fathir\/35: 37) Allah swt answered their request in His words: Have We not extended your life to be able to think for people who want to think, even though a warner has come to you? So taste (Our punishment), and for the wrongdoers there is no helper. (Fathir\/35: 37) And the inhabitants of hell pray as mentioned in His words: O our Lord, remove us from it (return us to the world), if we still return (to disbelief), indeed, we are people the unjust.\" (al-Muminun\/23: 107) Finally Allah swt answered emphatically: He (Allah) said, \"Stay with contempt in it, and do not speak to me.\" (al-Muminun\/23: 108) After the fifth answer from Allah swt, the mouths of the inhabitants of hell are silenced, there is no more prayer, apart from the screams that come out of their mouths, because the punishment of hell is very heavy for them."
		   },
		   {
			"id": 1795,
			"surah": 14,
			"ayat": 45,
			"tafsir": "This verse reminds the Messenger of Allah and those who believe that these tyrannical people have lived in the land of people who have wronged themselves and committed destruction on earth, as the ad and Thamud have done. It is clear what punishment Allah has inflicted on them and its traces are in those countries based on the story mentioned in the Al-Quran. Likewise, Allah SWT has given parables for Muslims about the consequences that will be experienced by those who are unjust in this world and in the hereafter. If the Muslims did what the wrongdoers had done, they would surely be punished as well, like the punishment that had been inflicted on those who were wrongdoing before. Therefore, Muslims should take lessons from the stories and events of those ancient people."
		   },
		   {
			"id": 1796,
			"surah": 14,
			"ayat": 46,
			"tafsir": "Allah swt explains in this verse that the Meccan infidels have devised an evil plan to break the struggle of the Muslims. But they do not realize that every evil plan they have is known by God, nothing is hidden from God in the slightest. Allah frustrates their every effort, so that their ideals and goals will not be achieved. Actually their efforts are very large, so that even if the plan is used to destroy a very sturdy mountain, it will be implemented. But all their plans, no matter how big, will not be able to defeat Allah's miracles, cannot erase His verses, and cannot hinder the development of the Islamic religion on earth. This verse foreshadows the victory of the Muslims and the destruction of the polytheists of Mecca in the near future. This verse also applies to today's Muslims, as long as they increase their strength and efforts, are always patient and steadfast in facing the various trials and tribulations inflicted by the evil plans of the disbelievers."
		   },
		   {
			"id": 1797,
			"surah": 14,
			"ayat": 47,
			"tafsir": "This verse explains that Allah swt will not deny His promise, no matter how big the evil plans of the disbelievers are, do not think that Allah will break the promise He has made with the apostles. The promise is: Allah will definitely help His messengers and those who believe with him, so that they will win. Similarly, Allah will not violate His promise to punish the disbelievers in the hereafter, as stated in His previous words: Indeed, Allah will delay them until the day when (their) eyes will widen. (Ibrahim\/14: 42) At the end of this verse, Allah swt confirms that He is Mighty and Most Severe in punishment. No one can escape His demands. He must have retaliated and tortured those who hindered His apostles."
		   },
		   {
			"id": 1798,
			"surah": 14,
			"ayat": 48,
			"tafsir": "This verse explains that the time of retribution and execution of the punishment is on the day when the earth is exchanged for another earth, when Allah destroys the sky and everything in it and exchanges it for another sky. At that time the earth, the moon and all the stars will collide, so that they break apart like dust and fly like clouds, then a different earth and sky will appear. Said Ibn Abbas, \"The other earth is none other than the earth which has changed its character from the present earth, as if it had moved its mountains, and its waters had not flowed, and its seas had died, neither wavy nor calm.\" From the verses and narrations of Ibn Abbas above, it can be understood that later on the Day of Judgment the entire universe will be destroyed. Each one collided with the other, so that it scattered and flew in the sky for a while, then took the shape of the earth and the sky, but it was not the earth and the sky that it is today. The human condition at that time was explained by Rasulullah saw in this hadith: From Aisyah she said, \"I was the first human to ask this to Rasulullah saw about this verse.\" Aisyah said, \"I asked, \"Where were the humans at that time, O Messenger of Allah?\" The Messenger of Allah replied, \"On the shirath (straight path).\" (Muslim History)"
		   },
		   {
			"id": 1799,
			"surah": 14,
			"ayat": 49,
			"tafsir": "These verses explain the condition of humans when they are resurrected from the graves after the destruction of the world. They rise from the grave to and stop before Allah Almighty to receive the sentence of punishment. On that day, there were no close friends who could help and help, no children and family who could comfort the heart from the feelings of anxiety that were being felt and no one could take refuge in anyone, except for God Almighty. After Allah swt described His power and might on that day, He described the weakness and helplessness of those who sinned at that time by explaining the circumstances of those who were being punished, namely: 1. People who sinned at that time were bound to be one with another, starting from their hands to their feet with their gods while living on earth. Their situation shows the similarity of their attitudes and actions while living in the world. Because they both disbelieved in Allah, they deserved to be punished together, as explained in His word: So they (the god) were overturned into hell with those who went astray, and all the devil's army. (asy-Syuara\/26: 94-95) 2. They wear clothes made of asphalt. What is meant by this verse is not the clothes in the true sense, but the whole body of the sinners at that time was covered with hot asphalt. Thus, it can be described the four kinds of punishment that are being suffered by those disbelievers, namely the hot tar that burns and scorches the body, the flames of fire in the body, the horrible black color, and the smell of rotting flesh. 3. Their faces are licked with fire. In line with this verse, the word of Allah swt: On the day they are dragged to hell on their faces. (It was said to them), \"Feel the touch of the fires of hell.\" (al-Qamar\/54: 48)"
		   },
		   {
			"id": 1800,
			"surah": 14,
			"ayat": 50,
			"tafsir": "These verses explain the condition of humans when they are resurrected from the graves after the destruction of the world. They rise from the grave to and stop before Allah Almighty to receive the sentence of punishment. On that day, there were no close friends who could help and help, no children and family who could comfort the heart from the feelings of anxiety that were being felt and no one could take refuge in anyone, except for God Almighty. After Allah swt described His power and might on that day, He described the weakness and helplessness of those who sinned at that time by explaining the circumstances of those who were being punished, namely: 1. People who sinned at that time were bound to be one with another, starting from their hands to their feet with their gods while living on earth. Their situation shows the similarity of their attitudes and actions while living in the world. Because they both disbelieved in Allah, they deserved to be punished together, as explained in His word: So they (the god) were overturned into hell with those who went astray, and all the devil's army. (asy-Syuara\/26: 94-95) 2. They wear clothes made of asphalt. What is meant by this verse is not the clothes in the true sense, but the whole body of the sinners at that time was covered with hot asphalt. Thus, it can be described the four kinds of punishment that are being suffered by those disbelievers, namely the hot tar that burns and scorches the body, the flames of fire in the body, the horrible black color, and the smell of rotting flesh. 3. Their faces are licked with fire. In line with this verse, the word of Allah swt: On the day they are dragged to hell on their faces. (It was said to them), \"Feel the touch of the fires of hell.\" (al-Qamar\/54: 48)"
		   },
		   {
			"id": 1801,
			"surah": 14,
			"ayat": 51,
			"tafsir": "Allah swt does this on the Day of Resurrection to repay humans for what they have done while living in the world. They get the reward or the torment of hell according to the deeds they have done. On that day, Allah SWT will quickly give His servant an account."
		   },
		   {
			"id": 1802,
			"surah": 14,
			"ayat": 52,
			"tafsir": "At the end of this surah, Allah swt explains that this glorious Al-Quran contains teachings, warnings, and frightening news that His messenger conveyed to humans, because some of His verses explain the consequences that will be experienced by sinners in the afterlife. . Humans who want to take lessons from his verses will be happy in this world, and in the hereafter will get pleasure and enjoyment in heaven as a reward for the good deeds they have done. This is explained by the word of Allah SWT: Say, \"Allah, He is a witness between me and you. This Al-Quran was revealed to me so that I could warn you and those who reach (the Al-Quran to him). (al-Anam) \/6: 19) And the word of Allah swt: Alif Lam Ra. (This is) the Book that We sent down to you (Muhammad) so that you bring people out of darkness into bright light with God's permission, (ie) to the way of God Almighty, Most Praised (Ibrahim\/14: 1) Likewise, so that humans make the arguments and proofs contained in the Al-Quran as the basis for determining and believing that there is no God who has the right to be worshiped other than God Almighty. , moon, stars, night, day, sea, and air for humans and sends down rain from the sky so that rainwater grows various kinds of plants that are beneficial to human life and life.In the sea there are various kinds like God's gifts, such as fish, pearls, minerals, and so on which are halal sustenance for humans. It's just that many people don't want to acknowledge the existence of God's various blessings."
		   }
	]
}
