{
	"tafseer": [
		{
			"id": 6139,
			"surah": 99,
			"ayat": 1,
			"tafsir": "In this verse, Allah reveals that the earth shook and shook violently, as explained in the word of Allah in another verse: O people! Fear your Lord; indeed, the shock (day) of Doomsday is a very big (event). (al-hajj\/22: 1) When the earth is violently shaken. (al-Waqi'ah\/56: 4). This description shows the enormity of the situation at that time. It was intended to attract the attention of unbelievers to think and meditate on it. It was as if they were being told that if the earth as a solid object could vibrate violently on that day, then why did they themselves not want to realize their negligence by abandoning their disbelief."
		   },
		   {
			"id": 6140,
			"surah": 99,
			"ayat": 2,
			"tafsir": "In this verse, Allah states that on the day when the shaking occurred, because of the intensity of the shaking, the earth poured out its buried entrails in the form of metal, treasures, and corpses from the graves. In another verse, Allah says: And when the earth is leveled, and what is in it spews out and becomes empty. (al-Insyiqaq\/84: 3-4) For example, as happened with the eruption of Mount Krakatau in 1883, the earthquake and tsunami in Aceh in 2004, the hot mud in Sidoarjo, East Java since 2006, and others that were so devastating that eject lava and entrails of the earth. The shocks on the Day of Resurrection will be even more devastating."
		   },
		   {
			"id": 6141,
			"surah": 99,
			"ayat": 3,
			"tafsir": "In this verse, Allah reveals that people who experienced and witnessed a terrible event and shocked those who saw it, said, \"What on earth is happening to the earth. Has this never happened before?\" In another verse, Allah says: And you see people drunk, when in fact they are not drunk. (al-hajj\/22: 2)"
		   },
		   {
			"id": 6142,
			"surah": 99,
			"ayat": 4,
			"tafsir": "In this verse, Allah states that when the great shaking occurs, when the earth shakes and suffers destruction and damage, it is as if He is explaining to mankind that this unprecedented event is not according to the provisions that apply to the universe under normal circumstances. Allah explained that the cause of the shaking was at His command alone. When the earth is ordered to be destroyed, the earth will be destroyed to pieces. Basically verses 1-5 above are concerned with the Day of Judgment. However, from a smaller scale these verses can be interpreted by the geological process of the occurrence of an earthquake, which of course is much smaller in magnitude compared to the events of the end of the world. As previously explained, according to scientific studies, the plates of the earth's crust move and interact with each other. Where these plates meet, these plates meet causing earthquakes. An example is Indonesia, which is a meeting place for three plates: Eurasia, Pacific and Indo-Australia. When two plates meet, a continuous pressure (load) occurs, and if the plate can no longer withstand the pressure (load), then the load that has accumulated for hundreds of years is released, and is released in the form of an earthquake. On that day the earth 'tell the news. Heavy loads issued in the form of earthquakes, is a geological process that runs for years. And so on, every time the load is released, the load collection process occurs again. This geological process or geological news can be recorded both naturally and by using geophysical or geodetic equipment (see also an-Naml\/27: 88, ath-thur\/52: 6). Studies on earthquakes can also be seen in surahh an-Naba'\/78: 17-20."
		   },
		   {
			"id": 6143,
			"surah": 99,
			"ayat": 5,
			"tafsir": "In this verse, Allah states that when the great shaking occurs, when the earth shakes and suffers destruction and damage, it is as if He is explaining to mankind that this unprecedented event is not according to the provisions that apply to the universe under normal circumstances. Allah explained that the cause of the shaking was at His command alone. When the earth is ordered to be destroyed, the earth will be destroyed to pieces. Basically verses 1-5 above are concerned with the Day of Judgment. However, from a smaller scale these verses can be interpreted by the geological process of the occurrence of an earthquake, which of course is much smaller in magnitude compared to the events of the end of the world. As previously explained, according to scientific studies, the plates of the earth's crust move and interact with each other. Where these plates meet, these plates meet causing earthquakes. An example is Indonesia, which is a meeting place for three plates: Eurasia, Pacific and Indo-Australia. When two plates meet, a continuous pressure (load) occurs, and if the plate can no longer withstand the pressure (load), then the load that has accumulated for hundreds of years is released, and is released in the form of an earthquake. On that day the earth 'tell the news. Heavy loads issued in the form of earthquakes, is a geological process that runs for years. And so on, every time the load is released, the load collection process occurs again. This geological process or geological news can be recorded both naturally and by using geophysical or geodetic equipment (see also an-Naml\/27: 88, ath-thur\/52: 6). Studies on earthquakes can also be seen in surahh an-Naba'\/78: 17-20."
		   },
		   {
			"id": 6144,
			"surah": 99,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that on the day when damage and destruction occurs to the earth and when a new realm and new life occurs, human beings appear in different circumstances and in groups. Good people are not the same as bad people. Obedient people are not the same as people who commit immorality. They appear for Allah to show them what they have done and to reap the fruits of their labors while living on earth."
		   },
		   {
			"id": 6145,
			"surah": 99,
			"ayat": 7,
			"tafsir": "In these verses, Allah details the reward for each charity. Whoever does good, even if it is only an atom's weight, will surely be rewarded, and so will those who do evil, even if it is only an atom's weight, will feel the reward. The good deeds of the disbelievers cannot help and release him from the torment because of his disbelief. They will be eternally miserable in hell."
		   },
		   {
			"id": 6146,
			"surah": 99,
			"ayat": 8,
			"tafsir": "In these verses, Allah details the reward for each charity. Whoever does good, even if it is only an atom's weight, will surely be rewarded, and so will those who do evil, even if it is only an atom's weight, will feel the reward. The good deeds of the disbelievers cannot help and release him from the torment because of his disbelief. They will be eternally miserable in hell."
		   }
	]
}
