{
	"tafseer": [
		{
			"id": 6194,
			"surah": 106,
			"ayat": 1,
			"tafsir": "The first condition is taken from the sentence li ilaf which means out of habit. 2. Maintaining a good name, which is taken from the sentence of Quraysh because the Quraysh tribe or tribe is one of the noblest tribes that later gave birth to the Prophet Muhammad. So a trader must always maintain his good name so that he gets the full trust of all his customers, because he never lied or cheated, never broke promises or hoarded goods needed by the people and so on. 3. Conducting business missions outside their area, even abroad to expand their trading area and this condition is taken from the sentence rihlah which means to travel. A trader will not progress if he does not carry out a trading mission outside his area. 4. Paying attention to favorable circumstances. He must pay attention to the climate, situation, and conditions of the place around him. This condition is taken from the sentence asy-syita'i wa as-saif which means: in winter and summer. The Quraysh also set the direction of their trade, namely in winter they went to the south, namely the country of Yemen, and in the summer to the north, namely the country of Sham. If these four conditions are considered carefully, it will undoubtedly bring about equal prosperity and that prosperity should never be just to satisfy lust. However, it must be used as a provision for worshiping Allah who owns the Baitullah and used to be grateful for all the blessings He has given, in order to produce welfare, sufficient food and clothing and safety from fear as implied in the sentence: \"Who has given food to them to relieve hunger. and secure them from fear.\" So the one who must be worshiped and grateful for is Allah, the owner of the Kaaba, because near the Kaaba there is a kind of worship that is not found outside the city of Mecca, namely tawaf in the Baitullah. If you pay attention to the way of tawaf, it is indeed very strange, because according to natural law, every object that surrounds another object will gradually grow farther from its base or rotation point according to centrivical force or the power to jump outward. If a stone is tied with a rope and then rotated, if the stone is released it must be thrown far out. Likewise in the spiritual field, a trader who used to be diligent in praying in congregation and attending lectures to the ulema in his village after frequently traveling outside the area, he grew farther away from the mosque and the ulema. If he travels abroad, he will certainly be further away from his religious sources. Not so the situation of people who are tawaf in Baitullah. Even though he went around seven times, he remained beside the Baitullah. Likewise, every trader who has become a wealthy or millionaire should still diligently carry out his worship of Allah continuously (istikamah). (1-2) In the following verses, Allah explains the profession of the Quraysh tribe as traders in a barren country and has two trade routes. In the winter to Yemen to buy spices that come from the Far East via the Persian Gulf and the second to Syria in summer to buy agricultural products to be brought back to their barren and dry country. The inhabitants of the desert (Bedouins) respect the Quraysh because they are seen as neighbors (neighbors) of Baitullah, inhabitants of the holy land and are devoted to maintaining the Kaaba, and are the guardians of the Kaaba. Therefore, the Quraysh were safe and secure, both when they left and when they returned, even though there were many robberies on the way. Because respect for Baitullah is a soul strength and authority to maintain their safety in their trade missions to the north or south; so that a habit arises and a penchant for commerce that generates a lot of fortune. The respect for Baitullah that fills the souls of the Arabs is God's will alone, more so when they see how God destroys the army of elephants who want to tear down the Kaaba, before they get close to it. If respect for Baitullah did not affect the souls of the Arabs, or had no effect at all, the Quraysh would certainly not have wanted to make these trade trips. Thus, their sources of sustenance will decrease because their country is not fertile land."
		   },
		   {
			"id": 6195,
			"surah": 106,
			"ayat": 2,
			"tafsir": "The first condition is taken from the sentence li ilaf which means out of habit. 2. Maintaining a good name, which is taken from the sentence of Quraysh because the Quraysh tribe or tribe is one of the noblest tribes that later gave birth to the Prophet Muhammad. So a trader must always maintain his good name so that he gets the full trust of all his customers, because he never lied or cheated, never broke promises or hoarded goods needed by the people and so on. 3. Conducting business missions outside their area, even abroad to expand their trading area and this condition is taken from the sentence rihlah which means to travel. A trader will not progress if he does not carry out a trading mission outside his area. 4. Paying attention to favorable circumstances. He must pay attention to the climate, situation, and conditions of the place around him. This condition is taken from the sentence asy-syita'i wa as-saif which means: in winter and summer. The Quraysh also set the direction of their trade, namely in winter they went to the south, namely the country of Yemen, and in the summer to the north, namely the country of Sham. If these four conditions are considered carefully, it will undoubtedly bring about equal prosperity and that prosperity should never be just to satisfy lust. However, it must be used as a provision for worshiping Allah who owns the Baitullah and used to be grateful for all the blessings He has given, in order to produce welfare, sufficient food and clothing and safety from fear as implied in the sentence: \"Who has given food to them to relieve hunger. and secure them from fear.\" So the one who must be worshiped and grateful for is Allah, the owner of the Kaaba, because near the Kaaba there is a kind of worship that is not found outside the city of Mecca, namely tawaf in the Baitullah. If you pay attention to the way of tawaf, it is indeed very strange, because according to natural law, every object that surrounds another object will gradually grow farther from its base or rotation point according to centrivical force or the power to jump outward. If a stone is tied with a rope and then rotated, if the stone is released it must be thrown far out. Likewise in the spiritual field, a trader who used to be diligent in praying in congregation and attending lectures to the ulema in his village after frequently traveling outside the area, he grew farther away from the mosque and the ulema. If he travels abroad, he will certainly be further away from his religious sources. Not so the situation of people who are tawaf in Baitullah. Even though he went around seven times, he remained beside the Baitullah. Likewise, every trader who has become a wealthy or millionaire should still diligently carry out his worship of Allah continuously (istikamah). (1-2) In the following verses, Allah explains the profession of the Quraysh tribe as traders in a barren country and has two trade routes. In the winter to Yemen to buy spices that come from the Far East via the Persian Gulf and the second to Syria in summer to buy agricultural products to be brought back to their barren and dry country. The inhabitants of the desert (Bedouins) respect the Quraysh because they are seen as neighbors (neighbors) of Baitullah, inhabitants of the holy land and are devoted to maintaining the Kaaba, and are the guardians of the Kaaba. Therefore, the Quraysh were safe and secure, both when they left and when they returned, even though there were many robberies on the way. Because respect for Baitullah is a soul strength and authority to maintain their safety in their trade missions to the north or south; so that a habit arises and a penchant for commerce that generates a lot of fortune. The respect for Baitullah that fills the souls of the Arabs is God's will alone, more so when they see how God destroys the army of elephants who want to tear down the Kaaba, before they get close to it. If respect for Baitullah did not affect the souls of the Arabs, or had no effect at all, the Quraysh would certainly not have wanted to make these trade trips. Thus, their sources of sustenance will decrease because their country is not fertile land."
		   },
		   {
			"id": 6196,
			"surah": 106,
			"ayat": 3,
			"tafsir": "In this verse, Allah commands the Quraysh to worship the Lord of the Kaaba who has saved them from the attacks of the Ethiopians who joined the army of elephants. They should only worship Allah and glorify Him."
		   },
		   {
			"id": 6197,
			"surah": 106,
			"ayat": 4,
			"tafsir": "Then Allah explained the nature of the Lord who owns the Kaaba who was ordered to be worshiped, that is, God who opened the door of wide sustenance for them and made it easy for them to seek that sustenance. If not so, of course they are in narrowness and misery. He secures the path they take in order for them to seek sustenance, and makes those they meet on their way happy with them. They had no trouble. If not, of course they are always in fear which results in a miserable and destitute life."
		   }
	]
}
