{
	"tafseer": [
		{
			"id": 3661,
			"surah": 35,
			"ayat": 1,
			"tafsir": "In this verse, Allah explains that praise and thanks are only for Him, who has created the heavens and the earth and what is between them with a very beautiful and miraculous creation, a creation that has not existed before, and has arranged it in an orderly and complete and perfect. He is also the one who has commissioned angels to deliver revelations to His prophets, to deliver various kinds of affairs. The angel is a kind of creature that has various wings, some are two, three, or four, some even more than that. Angels are tasked with conveying all of God's commands and prohibitions to His prophets. Allah has power to increase the wings of angels more and more according to His will, according to needs. No power can stop Him, for God is Almighty over all things. In a hadith it is explained that: Verily the Prophet Muhammad saw the Angel Gabriel on the night of Isra' in his original form, he has six hundred wings, between his two wings as long as the eye looks to the east and west. (Muslim history from Ibn Mas'ud)"
		   },
		   {
			"id": 3662,
			"surah": 35,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that giving or withholding a mercy is included in His power. When He bestows a grace upon man, no one can restrain Him and hinder Him. Vice versa, if He withholds and closes a mercy and has not given it to whom He wills, then no one can open it and give it, because all matters are in His hands. He is Mighty and does according to His will and wisdom. Therefore, we must always turn to God through worship to achieve our goals, and always put our trust in Him, as well as in trying to achieve the goals and purposes that are pleasing to Him. In line with this, Allah says: And if Allah inflicts a calamity on you, then no one can remove it except Him. And if Allah wills good for you, then no one can refuse His grace. (Yunus\/10: 107) And in a hadith it is stated as follows: From al-Mugirah bin Syu'bah that he said, \"I heard the Messenger of Allah say when he finished praying, 'There is no god but Allah. He is One, there is no partner for Him. To Him is the kingdom and to Him is all praise. He has power over all things. O Allah, my Lord, there is no one who hinders something that You give and there is no one who gives something that You prevent, it does not benefit someone's success in facing your torment.\" (History of Ahmad, al-Bukhari and Muslim)"
		   },
		   {
			"id": 3663,
			"surah": 35,
			"ayat": 3,
			"tafsir": "In this verse, Allah recommends that humans pay special attention to the blessings that have been given to them and keep them from disappearing and disappearing. For this purpose, humans must always humble themselves to admit that all these blessings are from Allah as a gift to him, which he must be grateful for by worshiping Him and not others, obeying all His commands, and avoiding all His prohibitions. The only way to maintain and preserve the favors that exist in a person is to be grateful for those blessings. Thus, Allah will always add to it. On the other hand, if a favor is not grateful for, then Allah will inflict a severe punishment, as He says: And (remember) when your Lord announced, \"If you are grateful, I will surely add (favor) to you.\" (Ibrahim\/14: 7) Allah is the only true provider of sustenance, both those that come down from the sky in the form of rain and so on, as well as those that grow from the earth in the form of necessities of life such as rice, water, clothing, and so on. There is no God but Him. If man wants to understand and realize all of this, of course he will not turn away from Him, but he will still recognize Him, worship only Him, and nothing else."
		   },
		   {
			"id": 3664,
			"surah": 35,
			"ayat": 4,
			"tafsir": "In this verse, Allah comforted the Prophet Muhammad that if his people continuously belied him about the truth he conveyed after he presented reasons and parables (likenesses) to them, then he should be patient as the previous messengers who were always hurt by their people, until the time came for him to win according to God's provision that He had promised. Let him return all matters to Allah. He will reward his patience and reward torture to his people who always deny Him."
		   },
		   {
			"id": 3665,
			"surah": 35,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains the truth of His promise, namely the occurrence of the Day of Resurrection and the Day of Judgment. If someone obeys His commands will be rewarded, and those who disobey Him will be tortured. God's promise in due time will come true. He will never break His promises, as Allah says: Truly, Allah does not break promises. (ali 'Imran\/3: 9) Therefore, it is not appropriate for someone to be deceived by the luxurious life of the world, so that he \"forgets the land\", even forgets God. All his time is used to accumulate wealth without the slightest remembrance of Allah. This is prohibited by Allah as He says: O you who believe! Do not let your possessions and your children distract you from the remembrance of Allah. (al-Munafiqun\/63: 9) Likewise, let no one be deceived and deceived by Satan's enticements and temptations, by easily following his promptings and invitations, because Satan not only invites to things that are heinous and evil, but sometimes he orders people to do good for fun purposes. Allah said: O you who believe! Do not follow in the steps of satan. Whoever follows the footsteps of Satan, then he (Satan) will actually order what is abominable and unjust. (an-Nur\/24: 21)"
		   },
		   {
			"id": 3666,
			"surah": 35,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that satan is an eternal enemy to humans who always makes doubts, whispers evil with his enchanting appeal, so that humans obey and do it. Allah's Word: Satan has made their (bad) actions seem beautiful to them, thus blocking them from (Allah's) path, while they are people of sharp vision. (al-'Ankabut\/29: 38) Therefore, let humans regard and make satan his very dangerous enemy, who does not need to be served and followed at all, as Allah says: And do not follow the steps of satan. Verily satan is a real enemy to you. (al-An'am\/6: 142) At the end of this verse it is emphasized that the intent and purpose of Satan to encourage people to act contrary to God's commands is to make as many friends as possible, to become residents of a fiery hell. Allah's Word: Will they (follow their ancestors) even though Satan actually calls them to the fiery doom (hell)? (Luqman\/31: 21)"
		   },
		   {
			"id": 3667,
			"surah": 35,
			"ayat": 7,
			"tafsir": "In this verse it is explained that those who disbelieve in Allah and His Messenger will receive a harsh and painful punishment in hell. The punishment was in return for their disobedience to Satan's persuasion, then following his steps. As for those who justify the orders brought by His messenger and do good deeds, they will receive forgiveness and a great reward. Their sins are forgiven by Allah, their rewards are multiplied and heaven has been prepared as a reward for the faith that is steady in their hearts and good deeds that are sincere for Allah alone. Allah's Word: And give good tidings to those who believe and do good, that for them (provided) gardens beneath which rivers flow. (al-Baqarah\/2: 25)"
		   },
		   {
			"id": 3668,
			"surah": 35,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains the great difference between the two groups mentioned in the previous verse. People who are deceived and can be deceived by Satan, so that their bad works are considered good, of course, are not the same as people who cannot be deceived by Satan. As the word of Allah: Say (Muhammad), \"Do we need to tell you about the person whose deeds have the most to lose?\" (That is) people whose deeds in the life of the world are in vain, while they think they have done their best. (al-Kahf\/18: 103-104) Getting lost or getting guidance is in the hands of Allah. He misleads or guides those whom He wills, according to His wisdom, based on the circumstances of the servant concerned. People who are set astray, he always does bad and heinous deeds. On the other hand, those who are guided by Allah always do good deeds. Therefore, the Prophet Muhammad was forbidden by Allah to be sad and worried about his people who did not want to believe and accept his invitation, so that he would not destroy himself. This kind of thing is also explained in another verse, the word of Allah: Then maybe you (Muhammad) will harm yourself because of grief after they turn away, if they do not believe in this information (Al-Qur'an). (al-Kahf\/18: 6) This verse closes with the affirmation of Allah that He is Aware of what they are doing, including the bad and heinous deeds that He will repay in kind."
		   },
		   {
			"id": 3669,
			"surah": 35,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains that He is the One Who Creates the winds that move thick clouds containing water then carry them to the barren earth, and send down rain. With the falling rain, the dead earth and not a single tree on it turns fertile. The earth grows various fruits and various tastes. Thus Allah revives the earth after death with rain that falls from the clouds. If humans want to use their minds and think seriously about Allah's signs of power like the events mentioned above, of course they will come to the conclusion that Allah has the power to revive dead land, of course, the power also revives dead humans even though they have been broken and their bones are broken. -the bones are scattered. It was narrated from Abu Ruzain al-'Uqaili that he asked the Messenger of Allah about how Allah revives the dead and what are the signs in creatures. The Messenger of Allah replied, \"O Abu Ruzain, have you ever passed through an arid valley of your people, then you came back through it fertile and green?\" Abu Ruzain replied, \"Yes.\" The Prophet said, \"That's how Allah revives the dead.\""
		   },
		   {
			"id": 3670,
			"surah": 35,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that whoever wants to get glory in this world and in the hereafter, he must always obey Allah because all glory both in this world and in the hereafter belongs to Him. He is the one who receives good words such as monotheism sentences, dhikr, reading the Qur'an, and others, as well as good deeds accompanied by sincerity will be rewarded by Allah. Any charity, whether in the form of words or deeds, which is carried out without sincerity will not be rewarded, and will even be punished because it is considered to belie religion. Prayers, zakat and other good deeds if done cheerfully, i.e. done not to please Allah, but seeking praise or fame in society, will not be accepted by Allah. Allah's Word: So woe to those who pray, (namely) those who are negligent of their prayers, who do joy, and are reluctant (to provide) assistance. (al-Ma'un\/107: 4-7) People who plan crimes against Muslims, such as planning something that will cause the decline of Islam or lack of attention from society and others, will receive a painful punishment on the Day of Judgment and his bad plans will be destroyed not reaching his target like what happened to the infidels of Quraysh. They used to plan to arrest Rasulullah SAW and then kill or exile him somewhere far from his bloodshed, so that Islam would become weak and would even disappear from the surface of the earth."
		   },
		   {
			"id": 3671,
			"surah": 35,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains the incident of Adam who became the ancestor of mankind. He was created by God directly from the ground, then his offspring were created from sperm which in essence also came from the soil because it came from food in the form of rice, vegetables and others, which came from the soil. Then they were made into pairs, consisting of a boy and a girl. No woman conceives or gives birth unless everything is known by Allah, nothing is hidden from Him. In line with this verse Allah says: Allah knows what every woman contains, what is lacking and what is growing in the womb. And everything has a measure by His side. (Allah) Who knows all that is unseen and that which is visible; The Greatest, Most High. (ar-Ra'd\/13: 8-9) No one who has a long life, unless Allah has decreed it in advance and written in the Lawh Mahfudh, will not increase and will not decrease. Likewise, a person who has been assigned a short life span will not be longer or shorter for the sake of maintaining balance on earth so that prosperity runs in an orderly manner. This is easy for God, because He knows everything, nothing is hidden from Him."
		   },
		   {
			"id": 3672,
			"surah": 35,
			"ayat": 12,
			"tafsir": "In this verse, Allah explains that there are two features of water, each of which has its own use. Both can be breeding grounds for delicious tasting fish. The fresh water in the rivers that flow through the villages and big cities, is delicious to drink, quenches thirst, fertilizes the soil, and grows grass, plants, and trees. Boats can sail on it to carry the necessities of life from one place to another. While salt water, in which there are pearls and sea coral which can be used as jewelry, and is a place for large ships to sail from one place to another, both in their own area and abroad as export goods or bring it from abroad as imported goods, which can not be reached by small boats, as merchandise to seek God's grace. At the end of this verse it is explained that Allah's power can subdue fresh water and salt water so that they can be used according to their respective functions. This is so that humans are grateful for the blessings that God has bestowed upon them. According to scientists, water is delicious to drink and tastes fresh if it contains only a small amount of dissolved salt, while the salty and bitter taste of seawater is caused by the high salt content dissolved in it. The measure of the salt content in ordinary water is expressed by salt or salinity, the units of which are grams of salt per kg of water, or because the BD of water = 1, in grams\/liter. Fourteen centuries ago, when practical chemistry did not exist, this verse has stated that the salinity of seawater varies. This fact is proven now that what is stated in this verse is true. Measurement results around the world show that the average salinity of seawater is 34.72 gr\/l. But the average salinity of the three great oceans differs: 34.90 for the Atlantic Ocean, 34.76 for the Indian Ocean and 34.62 for the Pacific Ocean. The salinity of water in the open ocean generally varies between 33 and 37 grams\/l. The highest salinity in the open sea is found in the Red Sea (about 41 gr\/l), while the lowest is found in the Gulf of Bothnia and the Baltic Sea (about 10 and 20 gr\/l respectively)."
		   },
		   {
			"id": 3673,
			"surah": 35,
			"ayat": 13,
			"tafsir": "In this verse it is explained that it is Allah who puts the night into the day, so the day becomes longer than the night, and vice versa. He puts the day in the night so that the night is longer than the day. The alternation of day and night is a mercy from Allah. During the day, humans work for sustenance and at night they rest to relieve fatigue and gather new energy to be used again the next day. Allah has subjected the day and the night, and made the sun and moon to circulate according to the conditions that have been outlined. None of them violated that provision, so that a collision did not occur. This is all a mercy from Allah, because thus the number of years and the reckoning of time can be known, as Allah confirms in another verse: It is He who makes the sun shine and the moon shine, and it is He who determines the places of their orbits, so that you may know the number of years, and calculation (time). (Yunus\/10: 5) Only Allah did all of that. God who has perfect and absolute power. He is the God who must be worshipped. Everything in the heavens and on earth is His slave and under His dominion. In contrast to the idols worshiped by polytheists, who do not have the slightest ability, even as thin as the epidermis. In fact, their worship belongs to Allah the Creator of the universe."
		   },
		   {
			"id": 3674,
			"surah": 35,
			"ayat": 14,
			"tafsir": "This verse explains that the gods they associate with Allah cannot hear when their worshipers call them, because they are only inanimate objects. Even if they could hear the cries of their worshippers, those gods would not be able to do anything, and would not be able to serve and grant their requests on the Day of Resurrection. The gods disengaged from them, didn't want to take responsibility, and even said, \"Actually they don't worship us, but worship their own desires, and something that is considered good according to the invitations and enticements of satan.\" Allah says: And they have chosen gods besides Allah, so that these gods will be a protector for them. Absolutely not! Later they (worship) will deny their worship of him, and will become enemies to them. (Maryam\/19: 81-82) Verse 14 closes with the assertion that the news about the gods worshiped by the polytheists is true and cannot be wrong, because the information comes from Allah, God knows everything with certainty. Nothing is hidden from Him, neither on earth nor in heaven. God's Word: For God there is nothing hidden in the earth and in the sky. (ali 'Imran\/3: 5"
		   },
		   {
			"id": 3675,
			"surah": 35,
			"ayat": 15,
			"tafsir": "In this verse, it is explained that humans are very interested in their Creator, namely Allah, because all humans need His help in all aspects of life, such as strength, sustenance, resisting danger, obtaining enjoyment, knowledge and so on, both in world affairs and in the hereafter. All of that will not happen except by the grace and taufik of Allah. Only Allah must be worshiped and expected to please Him. He is Omnipotent, does not need anything. Most Praised for the blessings that have been bestowed upon His servants. Every favor possessed by humans comes from His side. He is the one who should be praised and thanked in every way. In another verse Allah confirms: To Him belongs whatever is in the heavens and whatever is in the earth. And Allah is truly the Most Rich, the Most Praised. (al-hajj\/22: 64)"
		   },
		   {
			"id": 3676,
			"surah": 35,
			"ayat": 16,
			"tafsir": "These verses make it clear that Allah does not need anything, and He has perfect power. If Allah wants to destroy His creatures, then in an instant everything will be destroyed, because even though He created it, He has no need for it in the slightest. He then replaces them with other creatures who will obey and obey His commands, calling for good and forbidding what is abominable and evil. That is not difficult for God to do, but very easy. Allah's Word: And do they not see how Allah started the creation (creation), then He repeated it (again). Truly, that is easy for Allah. (al-'Ankabut\/29: 19)"
		   },
		   {
			"id": 3677,
			"surah": 35,
			"ayat": 17,
			"tafsir": "These verses make it clear that Allah does not need anything, and He has perfect power. If Allah wants to destroy His creatures, then in an instant everything will be destroyed, because even though He created it, He has no need for it in the slightest. He then replaces them with other creatures who will obey and obey His commands, calling for good and forbidding what is abominable and evil. That is not difficult for God to do, but very easy. Allah's Word: And do they not see how Allah started the creation (creation), then He repeated it (again). Truly, that is easy for Allah. (al-'Ankabut\/29: 19)"
		   },
		   {
			"id": 3678,
			"surah": 35,
			"ayat": 18,
			"tafsir": "In this verse, Allah explains the awesomeness of the Day of Judgment. On that day everyone bears their own sins. A person who sins will not bear the sins of others. If someone feels that their sin is very heavy, then asks someone else for help to bear some of their sins, then that sin will not be inflicted on the person being asked, even if it is a relative, such as father, child, and so on. Everyone on the Day of Judgment is busy with their own affairs thinking and contemplating what will happen to them. Allah's Word: O people! Fear your Lord and be afraid of the day when (at that time) a father cannot help his child, and a child cannot (also) help his father in the least. Indeed, Allah's promise must be true, so never be deceived by the life of this world, and do not be deceived by deceivers in (obeying) Allah. (Luqman\/31: 33) Another verse explains: On that day man will flee from his brothers, and from his mother and father, and from his wife and children. Every one of them that day had some business to occupy him with. ('Abasa\/80: 34-37) In the tafsir of al-Qurthubi it is narrated from 'Ikrimah that a father pins his hopes on his son on the Day of Judgment and says, \"O my son! How am I as your father,\" then the child praises him with good praise . The father said again to his son, \"O my son! I really need from your good deeds even if it's only an atom's weight, so that I can survive my situation as you can see.\" His son replied, \"O my father! How little do you ask, but I myself am worried about myself as you are worried about yourself. Therefore, I can not give anything in the slightest.\" Then he turned to his wife who pinned his hopes on him and said, \"O Fulanah! How am I as your husband?\" Then she praised her husband with good praise. The husband said to his wife, \"I ask you for just one of your good deeds, hopefully with your gift I will be safe from my situation, as you can see.\" His wife replied, \"How little you ask, but I can't give it because I'm worried about what you're worried about.\" The content of this verse is a consolation for the Prophet's heart because his preaching did not get a good response from his people and they remained stubborn. Allah explains that those who can receive His advice and warnings are only those who fear Allah and His painful punishment in the hereafter, even if they don't see it. It's not like those people whose hearts have been sealed by God so they don't know anything. They perform the obligatory prayers in accordance with the pillars and conditions, purify their hearts, and draw closer to Allah. Whoever purifies himself from shirk, sin, and disobedience, such as joy, ujub, lying, and deceit, his goodness will return to himself. Vice versa, if he commits immorality wallowing in sin, then the harm will return to him. This verse closes with an explanation that all matters are returned to Allah. Each person will be rewarded according to his deeds in the world. If it is good, it will be rewarded well, and vice versa, if the deed is bad, it will be rewarded with a proper reward. Allah's Word: Only to Allah all matters are returned. (al-Anfal\/8: 44)"
		   },
		   {
			"id": 3679,
			"surah": 35,
			"ayat": 19,
			"tafsir": "In this verse, Allah explains that people who do not know or deny the religion brought by the Prophet Muhammad are not the same as people who open their eyes wide so they can see and know clearly the truth of the religion they brought, then they follow and obey it. . The first group includes those who are evil and do not know, while the second group includes those who are good and know. Allah's Word: Say (Muhammad), \"The bad and the good are not the same.\" (al-Ma'idah.\/5: 100) And His words: Say, \"Are those who know and those who do not know?\" (az-Zumar\/39: 9)"
		   },
		   {
			"id": 3680,
			"surah": 35,
			"ayat": 20,
			"tafsir": "In this verse, Allah explains that disbelief is not the same as faith, because disbelief is darkness, not knowing Allah's rules. Unbelievers walk in darkness, unable to get out of it, even drifting into error in this world and the hereafter. As for the light of faith, it illuminates Muslims to the right path and brings happiness in this world and the hereafter. Some interpreters interpret 'pitch darkness here with' evil, and 'light with' truth, falsehood and truth are not the same."
		   },
		   {
			"id": 3681,
			"surah": 35,
			"ayat": 21,
			"tafsir": "Furthermore, Allah explained that those who are protected are not the same as those who are exposed to heat. Some commentators interpret dhill (shade\/shade) here with heaven, because heaven has a shade that causes cool weather. As Allah says: The parable of heaven which is promised to those who are pious (is like a garden), beneath which rivers flow; always fruitful and shady. (ar-Ra'd\/13: 35) While harr (hot) is defined as hell, because it is indeed a very hot place and full of burning fire, far hotter than any known fire in the world. Even a single spark of hell falls on the world, then the world will be completely hot as explained in a hadith. If a spark of fire from the fires of hell (is) in the east, then the heat will be felt (by those who are) in the west. (History of ath-thabrani from Anas bin Malik)"
		   },
		   {
			"id": 3682,
			"surah": 35,
			"ayat": 22,
			"tafsir": "At the beginning of this verse, Allah explains that people whose hearts are alive because they believe in Allah and His Messenger, and know the Qur'an and its contents, are not the same as people whose hearts are dead due to disbelief. The latter do not want to know Allah's commands and prohibitions, and cannot distinguish between guidance and misguidance. This is a parable for the believers and for the disbelievers. Allah's Word: And is a person who has died and then We brought him back to life and We gave him a light so that he can walk in the midst of the crowd, the same as someone who is in darkness, so that he cannot get out of there? (al-An'am\/6: 122) And His words: The parable of the two groups (unbelievers and believers), is like the blind and the deaf with those who can see and can hear. Are the two groups the same? So don't you take a lesson? (Hud\/11: 24) The believer sees, hears, and is bathed in bright light when crossing the shirathal mustaqim to heaven which is cool, has shade, and many springs. Whereas blind and deaf infidels walk in pitch darkness and cannot get out of it, and even always act arrogantly in their misguidance in this world and the hereafter until they are given the decision to enter a very hot hell, full of blazing fire. Allah gives instructions to those whom He wills, wants to hear proof of the truth of the messenger, and accepts the religion he brought, namely Islam, well. Just as a person who has died is put in the grave, cannot hear advice and suggestions that will guide him to the right path, so can a person whose heart is dead. It will not benefit him Allah's warnings. They cannot understand the contents of the Qur'an and religious teachings."
		   },
		   {
			"id": 3683,
			"surah": 35,
			"ayat": 23,
			"tafsir": "In this verse, Allah explains that the Prophet Muhammad's duty was only to warn people who had not received guidance. He is not burdened with orders to force them to accept the instructions and the religion he brought, because the instructions are wholly in the hands of Allah. Therefore, the Prophet Muhammad was not in the right place to grieve and feel disappointed if they did not want to welcome his call. This task was emphasized by the Prophet Muhammad as the word of Allah: Say (Muhammad), \"Indeed I am only a warner,\" (shad\/38: 65) And His words: What was revealed to me, that I am only a real warner.\" (shad\/38: 70)"
		   },
		   {
			"id": 3684,
			"surah": 35,
			"ayat": 24,
			"tafsir": "This verse explains that the Prophet Muhammad was sent to humans so that they believe in Allah Almighty accompanied by the obligatory shari'a for His servants. The Prophet was also ordered to give good news to people who justify his treatise and accept the religion he brought from Allah, that they will be entered into heaven which is full of pleasures and pleasures. It also gives a warning to those who deny it and reject the revelations sent down from Allah that they will be put into hell which is full of doom and torment which is very painful. In another verse Allah confirms the following: And We sent you (Muhammad), only as a bearer of glad tidings and a warner. (al-Isra'\/17: 105) There has not been a nation since the Prophet Adam unless Allah sent them a messenger who gave a warning. Thus, the people have no more reason to argue against God after He sent the apostles. God's Word: The apostles were as bearers of good news and warners, so that there would be no reason for humans to contradict God after the apostles were sent. (an-Nisa'\/4: 165) And His words: We will not torment before We send a messenger. (al-Isra'\/17: 15) In another verse it is also emphasized as follows: And if they (the polytheists) belied you (Muhammad), so would the people who were before them, the people of Nuh, 'Ad, and Samud (also denied His messengers), and (so also) the people of Abraham and the people of Lut, and the people of Midian. And Musa (also) was lied to, but I gave grace period to the disbelievers, then I tortured them, so how great is My torment. (al-hajj\/22: 42-44)"
		   },
		   {
			"id": 3685,
			"surah": 35,
			"ayat": 25,
			"tafsir": "In this verse, Allah explains that after they denied the arrival of the apostles and belied the religion they brought, He punished the disbelievers with a painful punishment. How great is Allah's wrath against them if they remain in a state of disobedience, and continue to deny the apostleship of Muhammad and the religion he brought. They will experience what the ancients experienced. Thus the sunatullah remains valid and will not change. As the word of Allah: As the sunnah of Allah which (also applies) to those who have gone before (you), and you will not find changes in the sunnah of Allah. (al-Ahzab\/33: 62)"
		   },
		   {
			"id": 3686,
			"surah": 35,
			"ayat": 26,
			"tafsir": "In this verse, Allah explains that after they denied the arrival of the apostles and belied the religion they brought, He punished the disbelievers with a painful punishment. How great is Allah's wrath against them if they remain in a state of disobedience, and continue to deny the apostleship of Muhammad and the religion he brought. They will experience what the ancients experienced. Thus the sunatullah remains valid and will not change. As the word of Allah: As the sunnah of Allah which (also applies) to those who have gone before (you), and you will not find changes in the sunnah of Allah. (al-Ahzab\/33: 62)"
		   },
		   {
			"id": 3687,
			"surah": 35,
			"ayat": 27,
			"tafsir": "In this verse, Allah describes several things that show His perfection and power, which can be seen by humans at all times. If they realize and realize all of that, of course they will also realize the oneness and power of Allah, the Most Perfect. Among the signs is that Allah has created various kinds of things that come from one. Allah sends down rain from the sky, so that plants can grow and produce fruits of various colors, tastes, shapes and aromas, as we can see. The fruits are colored yellow, red, green, and so on. The same thing is also explained in another verse. Allah's Word: And in the earth there are parts adjoining, vineyards, plants, date palms having branch, and that which has no branch; watered with the same water, but We prefer one plant over the other in terms of taste. Indeed, in that there are signs (of Allah's greatness) for people who understand. (ar-Ra'd\/13: 4) Allah also created mountains that looked like lines, some that looked white, red, and black. Between the mountains there are also streets of various colors. According to scientists, colored stripes on rocks are most common in sedimentary rock types. Sedimentary rock is formed from the deposition of materials transported by water or wind. The material that is deposited is fine grains in the form of sand, dust, or clay as a result of weathering of rocks elsewhere, which are then detached from the parent rock and transported by flowing water or wind. Places of deposition of this sedimentary material are generally located in low parts where the velocity of the transport force (water currents, gusts of wind) is reduced. Areas that are commonly known as places of deposition are plains, coasts, especially deltas, and seabeds. During the transportation and sedimentation processes, a sorting mechanism occurs where generally materials with the same physical characteristics (for example in terms of grain size or specific gravity) will be deposited in the same depositional environment. This process of weathering, transport and deposition has been continuous throughout Earth's history which can take thousands or even millions of years. During this process there are also changes in both the depositional environment and the type of material deposited, so that in sedimentary rocks layers are formed which also describe the historical sequence (time) of deposition. Another geological mechanism that usually occurs in sedimentary rocks is experiencing uplift by tectonic forces so that sedimentary rocks that are usually formed in low places can be found on mountain peaks. On incised mountain peaks, both by erosion and by the occurrence of fractures, these sedimentary layers will appear to the surface. Each layer of sedimentary rock can have a different color because it is composed of different materials. This color difference is mainly characterized by differences in mineralogy. For example: minerals containing iron oxide compounds (hematite) are red in color, white minerals include alumino-silica (kaoline), metal hydroxide minerals (goethite, brucite, diaspore, boehmite) can give various colors (yellow, green, gray, black, pink), which are clear in color, including silica (quartz). Colorful hard rocks or minerals are usually rubbed into gemstones."
		   },
		   {
			"id": 3688,
			"surah": 35,
			"ayat": 28,
			"tafsir": "In this verse, Allah adds more explanations about things that show His perfection and power. Allah created reptiles and livestock, which are of various colors even though they come from the same kind. There are even animals that are one, but have a variety of colors. Glory be to Allah the creator of the universe with the best. In line with this the word of God: And among His signs (greatness) is the creation of the heavens and the earth, the difference in your language and the color of your skin. (ar-Rum\/30: 22) Thus Allah shows signs of His power as mentioned above to be known in depth. Only scholars who are truly aware of and know the signs of Allah's power, so that they truly submit to His authority and fear His punishment. Ibn 'Abbas said, \"The so-called scholars are people who know that Allah is Almighty over all things.\" In another narration, Ibn 'Abbas said, \"The scholar is a person who does not associate anything with God, who makes lawful what Allah has made lawful and forbids what He has made forbidden, keeps His commandments, and believes that he will meet Him who will reckon and repay all human deeds.\" This verse closes with an affirmation that Allah Almighty takes action against those who disbelieve in Him. He does not punish those who believe and obey Him, but is Most Forgiving to them. He has the power to punish those who always commit immorality and sin, just as He has the power to reward those who obey Him and forgive their sins, so humans should fear Him."
		   },
		   {
			"id": 3689,
			"surah": 35,
			"ayat": 29,
			"tafsir": "In this verse, Allah explains that those who always read the Qur'an, believe in the news, study the words and their meanings and then practice them, follow orders, stay away from prohibitions, perform their prayers on time according to the prescribed method and with full sincerity and solemn, spending their wealth without exaggeration, sincerely without joy, whether secretly or openly, they are people who practice their knowledge and do good with their Lord. They are like traders who do not lose money, but get multiple rewards as a gift from Allah, based on their good deeds. Allah's Word: As for those who believe and do good deeds, Allah will perfect their reward and increase some of His bounty. (an-Nisa'\/4: 173) Apart from that, they will also receive forgiveness for the mistakes and crimes that have been committed, because Allah is Forgiving, Most Gracious to His servants, gives a perfect reward for their deeds, forgive his mistakes and increase His blessings. In line with this the word of Allah: Indeed, Allah is Most Forgiving, Most Gracious. (asy-Shura\/42: 23)"
		   },
		   {
			"id": 3690,
			"surah": 35,
			"ayat": 30,
			"tafsir": "In this verse, Allah explains that those who always read the Qur'an, believe in the news, study the words and their meanings and then practice them, follow orders, stay away from prohibitions, perform their prayers on time according to the prescribed method and with full sincerity and solemn, spending their wealth without exaggeration, sincerely without joy, whether secretly or openly, they are people who practice their knowledge and do good with their Lord. They are like traders who do not lose money, but get multiple rewards as a gift from Allah, based on their good deeds. Allah's Word: As for those who believe and do good deeds, Allah will perfect their reward and increase some of His bounty. (an-Nisa'\/4: 173) Apart from that, they will also receive forgiveness for the mistakes and crimes that have been committed, because Allah is Forgiving, Most Gracious to His servants, gives a perfect reward for their deeds, forgive his mistakes and increase His blessings. In line with this the word of Allah: Indeed, Allah is Most Forgiving, Most Gracious. (asy-Shura\/42: 23)"
		   },
		   {
			"id": 3691,
			"surah": 35,
			"ayat": 31,
			"tafsir": "Indeed, the Qur'an that was revealed to the Prophet Muhammad is the Book of Allah which was truly sent down from Allah. Therefore, Allah made it obligatory for the Prophet and for all his people to practice his teachings and follow the guidelines of life contained therein. If a Muslim has perfectly adhered to the teachings of the Qur'an, then he no longer needs to practice the previous holy books, even though he is obliged to believe in them. Because what has been explained in previous books has been justified by the Qur'an. In other words, having faith in the holy books that were revealed to the apostles before the Prophet Muhammad does not mean practicing their teachings, but it is enough to believe in their truth, because the essence of what is contained in these books has also been stated in the Al-Qur'an. Allah is All-Knowing about His servants. Allah is Observant of the rules of life that are necessary for them. It is on this basis that He establishes rules and laws according to their lives, where and when they are. For the welfare of humanity as a whole, Allah sent messengers with the task of conveying His Shari'a, where the Prophet Muhammad was the last messenger sent for all mankind until the Day of Judgment. The treatises and shari'a that he brought are eternal and eternal until the Day of Judgment comes. God's Word: God knows better where He places His apostolic task. (al-An'am\/6: 124) Imam Ibn Kathir explained that the purpose of Allah's vast knowledge regarding His servants is that He elevates the rank of prophets and messengers above all human beings. Even among them (the prophets) themselves differed in height, and the position of the Prophet Muhammad exceeded all of them."
		   },
		   {
			"id": 3692,
			"surah": 35,
			"ayat": 32,
			"tafsir": "Allah revealed the Qur'an to Prophet Muhammad. Then the teachings of the Qur'an were inherited by Him to His chosen servants. They are the people of the Prophet Muhammad, because Allah has glorified this people beyond the glory that the previous people had. That glory depends on how far they practice the teachings of the Prophet, and to what extent they are able to follow God's instructions. The following describes the levels of believers who practice the Qur'an: 1. People who are unjust to themselves. That is, people who carry out obligatory actions and also do not leave unlawful actions. 2. Muqtasid, namely people who carry out all obligations and leave their prohibitions, but sometimes they do not do actions that are considered sunnah or still do some work that is considered makruh. 3. Sabiqun bil khairat, namely people who always do obligatory and sunnah practices, leave all actions that are forbidden and evil, as well as some things that are permissible (permissible). According to al-Maragi the division above can also be expressed in other words, namely: 1. People who still practice the teachings of the Book of Allah a little and are too happy to indulge their desires, or people who still have a lot of bad deeds compared to their good deeds. 2. People who are balanced between good deeds and evil. 3. People who constantly seek Allah's reward by doing good deeds. Scholars of tafsir have mentioned several hadiths in connection with the above intention. One of them is the hadith narrated by Ahmad from Abu Darda', where after reading verse 32 of surahh Fathir above, Rasulullah said: As for those who compete in doing good they will enter heaven without reckoning (calculation), while the middle people (muqtashid) they will be given an account with a light reckoning, and those who wronged themselves they will be detained first in the place (his account), so that he will experience suffering and then be put into heaven. Then he read \"Alhamdulillah al-ladzi adhhaba 'anna al-hazana inna rabbana lagafurun syakur,\" (All praise be to Allah who has removed our sorrow, verily our Lord is Most Forgiving, Most Grateful). (Ahmad's history) The legacy of practicing the holy book and the glory bestowed on the people of the Prophet Muhammad is a very great gift from Allah, which no one can prevent that decree."
		   },
		   {
			"id": 3693,
			"surah": 35,
			"ayat": 33,
			"tafsir": "Then Allah explains the reward that will be received by the believers above, namely heaven 'Adn, an eternal residence forever, which they will live in in the afterlife when they have faced Allah. They were endowed with gold jewelery and silk garments. It was narrated from Abu Hurairah that the Messenger of Allah said: Some of the believers will get jewelry (in heaven) placed on limbs that have been washed (water) with ablution. (Al-Bukhari) In another hadith, the Messenger of Allah said: From Abu Hurairah ra that Abu Umamah narrated the hadith that the Messenger of Allah told his companions, and mentioned the jewels of the inhabitants of heaven. He said, \"They were given gold and silver bracelets studded with pearls, they also wore crowns of continuous Yaqut pearls. They wore crowns like the crowns of kings. They were young, without beards and moustaches, and their eyes were dark. (History Ibn Abi hatim) For Allah's multiplied grace, they praise His greatness and are grateful for their salvation from sorrow and pain.Ibn 'Abbas interprets sadness (hazan) by the fires of hell, because of pain due to sin or pain due to the intense torment in Padang Mahsyar. Their release from all torment and fear is solely due to Allah's forgiveness for those who make mistakes (sins) and gratitude for those who always obey Him. It was narrated in a hadith from Ibn 'Umar where the Prophet said: People (who always says)\"La ilaha illallah\" will not feel lonely in his death, in his grave, and also on the day of Resurrection.Seo it was as if I was with them where they were cleaning their heads from the dirt\/dust, and they were saying, \"Praise be to Allah who has removed sorrow from us! Verily, our Lord is Most Forgiving, Most Gracious.\" (History of at-Thabrani from Ibn 'Umar) In short, they are free from all the fear and torment that have been threatened to those who sinned due to the whisperings and seductions of satan while living in this world."
		   },
		   {
			"id": 3694,
			"surah": 35,
			"ayat": 34,
			"tafsir": "Then Allah explains the reward that will be received by the believers above, namely heaven 'Adn, an eternal residence forever, which they will live in in the afterlife when they have faced Allah. They were endowed with gold jewelery and silk garments. It was narrated from Abu Hurairah that the Messenger of Allah said: Some of the believers will get jewelry (in heaven) placed on limbs that have been washed (water) with ablution. (Al-Bukhari) In another hadith, the Messenger of Allah said: From Abu Hurairah ra that Abu Umamah narrated the hadith that the Messenger of Allah told his companions, and mentioned the jewels of the inhabitants of heaven. He said, \"They were given gold and silver bracelets studded with pearls, they also wore crowns of continuous Yaqut pearls. They wore crowns like the crowns of kings. They were young, without beards and moustaches, and their eyes were dark. (History Ibn Abi hatim) For Allah's multiplied grace, they praise His greatness and are grateful for their salvation from sorrow and pain.Ibn 'Abbas interprets sadness (hazan) by the fires of hell, because of pain due to sin or pain due to the intense torment in Padang Mahsyar. Their release from all torment and fear is solely due to Allah's forgiveness for those who make mistakes (sins) and gratitude for those who always obey Him. It was narrated in a hadith from Ibn 'Umar where the Prophet said: People (who always says)\"La ilaha illallah\" will not feel lonely in his death, in his grave, and also on the day of Resurrection.Seo it was as if I was with them where they were cleaning their heads from the dirt\/dust, and they were saying, \"Praise be to Allah who has removed sorrow from us! Verily, our Lord is Most Forgiving, Most Gracious.\" (History of at-Thabrani from Ibn 'Umar) In short, they are free from all the fear and torment that have been threatened to those who sinned due to the whisperings and seductions of satan while living in this world."
		   },
		   {
			"id": 3695,
			"surah": 35,
			"ayat": 35,
			"tafsir": "People who have received favors from God realize that all these gifts are solely because of His love. The magnitude of God's gift is not balanced with the good deeds they do. Therefore, the entry of believers into heaven is not at all because of the good they do, but because of Allah's mercy and grace for those who obey His commands. The Messenger of Allah said: None of you will enter paradise because of what he has done. They (the companions) asked, \"Are you also not like that, O Messenger of Allah?\" He replied, \"Neither do I, but because Allah has mercy and grace on me.\" (Muslim history from Jabir bin 'Abdullah) In that heaven they will not encounter any more difficulties or obstacles as they experienced in life in this world. They also do not feel tired and tired. Everything feels delicious and exhilarating. In short, heaven is a place of everlasting and eternal pleasure, where its inhabitants can enjoy that pleasure as a reward for their obedience and obedience in this world. Allah said: (It was said to them), \"Eat and drink with pleasure because of the deeds you have done in the past days.\" (al-haqqah\/69: 24)"
		   },
		   {
			"id": 3696,
			"surah": 35,
			"ayat": 36,
			"tafsir": "In this verse it is explained that for those who disbelieve who always hide religious truths whose evidence has been obtained by their reason, both from the explanation of the verses of the Qur'an and through the results of deep thought, hell is provided for them. Their situation there is between life and death. Perhaps death is better than enduring such tribulations, but God deliberately ordained such torments as a recompense for the crimes they committed. In surahh al-A'la\/87: 13 it is emphasized that their condition is neither dead nor alive, as an tafsir of the word \"death has not been assigned to them\". Besides that, it is explained that the torment of Hell will not be lessened by the pain, even though the unfortunate humans who are experiencing torment there scream for help. There is an explanation from another verse which describes that death is what they really hope for compared to their situation between life and death, the hope of death is concluded from the meaning contained in the verse: And they cried out, \"O (Angel) Malik! Let your Lord just kill us.\" He replied, \"Indeed, you will remain (in this hell).\" (az-Zukhruf\/43: 77) Imam Muslim narrated a hadith about the condition of unbelievers which reads as follows: As for the inhabitants of hell where they are residents, they will neither die in it nor live. (Muslim history from Abu Sa'id al-Khudri) About the torment that is not relieved, even more so, there is also an explanation in other verses, for example: So that when We open for them the door of a very severe doom, they immediately become despondent. hope. (al-Mu'minun\/23: 77) And His words: So therefore feel! Then We will add nothing to you other than punishment. (an-Naba'\/78: 30) And We will gather them on the Day of Judgment with their faces down, blind, dumb and deaf. Their abode is Hell Hell. Every time the flames of Hell are extinguished, We add more flames for them. (al-Isra'\/17: 97) Such torture is the proper recompense for anyone who denies Allah's favors, does not acknowledge His omnipotence and does not believe in the messengers He sent."
		   },
		   {
			"id": 3697,
			"surah": 35,
			"ayat": 37,
			"tafsir": "It was further explained that the unfortunate person begged Allah to be released from the punishment and returned to the world again. They promised to obey God who while in the world they neglected. However, if the request is granted \"and this is absolutely not possible\" they will certainly repeat the old forbidden actions. Actions that they regret and have done in the past are acts of shirk and all other evil deeds. Allah answered and rebuked them with contempt that in the past they were given the opportunity to live long enough to correct their mistakes and accept the truth conveyed by the apostle as a warning person. In other words, such a request is not accepted by God at all. Another verse states: O our Lord, remove us from it (return us to the world), if we still return (to disbelief), indeed, we are unjust.\" He (Allah) said, \"Stay in disgrace therein, and do not speak with Me.\" (al-Mu'minun\/23: 107-108) Allah says: And whoever is allowed to go astray by Allah, then there is no protector for him after that. You will see the wrongdoers when they see the doom saying, \"Is there a way to return (to the world)?\" (asy-Shura \/ 42: 44) Regarding the age referred to in verse 37, Ibn 'Abbas explained in one narration, namely 40 years, and another narration says 60 years. In his commentary, Ibn Kathir chose the most authentic narration from Ibn 'Abbas, namely 60 years. Likewise the hadith narrated by Imam Ahmad from Abu Hurairah. Among the many sayings of the hadith, there is one which means: As for the person who gave the warning mentioned in this verse is N Abi Muhammad himself taught the Book of Allah to his people, threatening them with painful torments for those who disobey Allah's commands and do not want to obey Him. In short, their request was not granted to return to the world because of two things. First, because on average they have been given the opportunity to live for so long between 60-70 years, and secondly, the apostles have been sent to them to deliver teachings and warnings from God. Listen to God's words: Nearly exploded with anger. Every time a group (unbelievers) are thrown into it, the guards (of hell) ask them, \"Has no one ever come to warn you (in the world)?\" (al-Mulk\/67: 8) In Tafsir al-Wadhih it is said that nadzir (warner) in this verse means the Messenger of Allah who brought the Qur'an, may also be interpreted as old age and death. Indeed, age and death are important reminders for humans that soon they will leave this mortal world, and are required to account for their actions. It is clear that the disbelievers above are eternal in hell and are not expelled forever. It is the punishment of hell that they feel all the time as a fitting reward for those who are unjust who do not want to submit to the teachings of the apostles as God's messengers in their worldly life. This verse emphasizes that they should not be expected to find a helper who will save them from the torments of hell from chains and shackles made of hellfire."
		   },
		   {
			"id": 3698,
			"surah": 35,
			"ayat": 38,
			"tafsir": "This verse instructs the Prophet Muhammad to give a stern warning to polytheists that Allah is All-Knowing of what they hide. Allah is also All-Knowing of the feelings contained in their hearts, and what plans they will carry out. It is Allah who knows everything that is invisible to the human senses, both in the heavens and on earth. Therefore, let those polytheists fear Allah, because all their movements are under His supervision. Everything they plan to deceive the messenger and eradicate the truth of His religion in this earth, or their attempts to help their allies in deifying idols, must be known to Allah. Allah knows all the feelings that are contained in the hearts of people, and what deeds they do. The word of Allah \"Surely He is All-Knowing of what is in the human breast\" suggests that even if disbelievers are given the opportunity to live longer, they will not leave their disbelief. Therefore, in vain Allah extends his life."
		   },
		   {
			"id": 3699,
			"surah": 35,
			"ayat": 39,
			"tafsir": "This verse confirms that humans are made caliphs on earth. As a caliph, which can be interpreted as a ruler, humans are given the ability to make the best use of this nature for the welfare of their lives. Some commentators explain the intention of khala'if fi al-ardh is that some humans replace other humans, one generation replaces another generation so that they take lessons because Allah has destroyed the previous people because of the sins they committed. Everything aims to make them realize who they really are. Such a sense of conviction, God willing, will encourage us to be grateful for all of His infinite blessings, confirm Him from all actions and beliefs that smell of shirk, and obey all His commands. The more the feeling of disbelief in their hearts, the more the anger and wrath of Allah will increase. However, this does not mean that this will reduce the greatness and majesty of Allah, because He does not need human praise and gratitude for His majesty and glory, as the verse reads: And whoever gives thanks (to Allah), then he is grateful for himself. ; and whoever is not grateful (kufr), then surely Allah is Rich, Most Praised. (Luqman\/31: 12) Instead, losses will befall them in the hereafter because they do not want to return to the right path, and remain in disbelief. They are eternally tormented by the fires of Hell as described above. Deliberately the sentence, \"does not increase disbelief for the disbelievers\" is mentioned twice because it implies that kufr which causes Allah's anger and kufr which causes loss, are both separate and contain their own meanings."
		   },
		   {
			"id": 3700,
			"surah": 35,
			"ayat": 40,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to invite the polytheists to have a dialogue to explore their wrong ways of thinking. Why did the polytheists ask for help from the statues and idols that they associate with Allah? Is there any evidence to show that idols deserve worship. The polytheists of Mecca did not really understand the nature of their god, how it was. If they had realized that their gods could do nothing, they would not have worshiped them. But on the other hand, if it is true that the idols have the power (to create), surely they will be able to show the results. Likewise, if Allah had partners in creating the heavens, surely those partners also deserve to be worshiped as they think. Is there a holy book (which is correct in content) that can strengthen the arguments about the existence of partners for God? The Prophet Muhammad gave the polytheists the opportunity to state the reasons for their worship of idols, especially the ability of these gods to create creatures, so that they have the right to be worshiped and to be associated with Allah in the matter of creation. Because such belief is merely an inheritance from their ancestors (see surahh al-Baqarah\/2: 170), there is no reason that they can put forward, whether the reason is accepted from naqli (nas) or aqli (logic) reasons. Nowhere has a holy book been found that calls for people to worship idols, because everything is just the imagination and imagination of the ancients. After the Qur'an condemns and breaks their way of thinking, and that what they follow is the way of thinking of their leaders who go astray, then of course their opinion is wrong and leads to misery."
		   },
		   {
			"id": 3701,
			"surah": 35,
			"ayat": 41,
			"tafsir": "Allah describes the truth and the majesty of His power. By His power, the heavens were created without pillars, and the mountains stood firm. Allah spreads reptiles (dabbah), humans and animals over the earth, as the verse reads: He created the heavens without pillars as you see them, and He placed mountains (on the surface of) the earth so that it (the earth) would not shake you; and breed all kinds of moving creatures that animate the earth. And We send down rain from the sky, then We grow in it all kinds of good plants. (Luqman\/31: 10) Everything proves the greatness and power of Allah the Most High. God's understanding of holding back the heavens and the earth is to hold the heavens by the law of gravity so that they don't shake and collapse, or shift from their places. Allah keeps and watches over both of them with supervision that He alone knows. All celestial bodies in this universe circulate according to their respective orbits. Astronomers can prove that there has never been a collision between these celestial bodies with one another. Everything circulates according to its own orbit. Another explanation that strengthens the meaning contained in the verse above is: And among His signs (greatness) is the standing of the heavens and the earth by His will. Then when He calls you one call from the earth, immediately you come out (from the grave). (ar-Rum\/30: 25) The strength of the heavens and the earth so that they never experience damage, collapse, and so on is because of Allah's power too. If Allah Almighty were to destroy the earth and the heavens, no creature power would be able to prevent it. This is also explained by another verse: Do you not see that Allah has subjected to you (humans) what is in the earth and the ships that sail in the sea by His command. And He holds back the celestial (objects) from falling to the earth, except with His permission? Truly, Allah is Most Gracious, Most Merciful to mankind. (al-hajj\/22: 65) Besides His attribute of the Almighty, Allah also has the trait of compassion for His servants. Even though most people on this earth are infidels and do not want to submit to the teachings and guidelines of life for the welfare of the world and the hereafter that He has determined, the punishment and wrath of Allah are not immediately sent down to punish the disbelievers and disobedient. Allah's mercy is that apart from delaying the torment of disbelievers and disbelievers, it is also very easy to forgive those who want to repent of all their mistakes, no matter how great the immoral acts they have committed. Allah is Mighty, Most Compassionate, and Merciful to all His servants, both believers and unbelievers."
		   },
		   {
			"id": 3702,
			"surah": 35,
			"ayat": 42,
			"tafsir": "Those polytheists swore with all their hearts, if Allah sent a messenger who warned them about the deviant way of thinking and the moral decay of their people, they would surely be the easiest to accept the apostle's instructions, compared to any people who had come before them. The explanation of this verse is also reinforced by another verse which reads: If we had a book with us from (the books that were revealed) to the ancients, we would certainly be servants of Allah who were purified (from sin). But apparently they denied it (the Qur'an); then later they will know (the result of their denial). (ash-shaffat\/37: 168-170) In Tafsir al-Khazin it is narrated that the Meccan infidels when they learned that the People of the Book (Jews and Christians) denied the apostles sent to them, they also swore by Allah if they were sent also the apostles like those who were sent to the Children of Israel, of course they will become a nation that has received more guidance compared to the Jews and Christians. Such an attitude they showed before Muhammad was sent as an apostle. However, after he was really sent among them, they also denied him as the attitude of the People of the Book to His messenger. To warn Muslims about the attitude of the disbelievers who have obtained the pure truth about the Prophet Muhammad and his message, Allah sent down the above verses. After their dream came true, namely when Muhammad was sent as a messenger in their community to convey the truth from Allah, which was contained in the Al-Qur'an al-Karim, then they immediately denied it. In fact, their attitude of denial and arrogance is becoming more and more. Instead of getting closer to the truth, they are even further away with the excuse of protecting the honor and dignity of their people. Strictly speaking, the Meccan polytheists were reluctant to follow the teachings of the Prophet Muhammad. Their situation is similar to that of a wild camel running away, the more it is chased by its owner, the faster it runs and the more it loses its way, making it harder to catch."
		   },
		   {
			"id": 3703,
			"surah": 35,
			"ayat": 43,
			"tafsir": "This verse still explains the attitude of the polytheists of Mecca towards the preaching of the Prophet. With all their power and thoughts, with their possessions and wealth, they opposed the preaching of the Prophet Muhammad, he was even boycotted and prevented. However, all the evil plans to break the Islamic da'wah eventually backfired on them. The failure of the Meccan infidels to prevent the spread of Islamic da'wah has been written in golden ink in Islamic history. Every attempt and evil plan to extinguish the light of Allah's religion on this earth will surely fail, because Allah will always maintain the existence of His religion on this earth, until the end of time, even if it is disliked by polytheists, as stated in the verse: They want to extinguish the light (religion) of Allah with their mouths (sayings), but Allah still perfects His light even though the disbelievers hate it. (ash-shaff\/61: 8) In Aisar at-Tafasir it is mentioned that Ka'ab said to Ibn 'Abbas, \"In the Torah it is explained that whoever digs a hole for his friend, he is the one who enters it.\" Ibn 'Abbas replied, \"I found that in the Qur'an.\" Ka'ab asked, \"Where?\" Ibn 'Abbas replied, \"Read wa la yahiqul makrus-sayyi 'illa bi EXPAH (That evil plan will only befall those who plan it themselves.)\" As described above, sometimes Allah delays the arrival of punishment as proof of His love. to unbelievers. However, don't think that Allah will not torture them if they do not repent, because if they have not experienced torment in this world, they will surely experience it in the afterlife. In the afterlife they will only believe where the unjust person was placed by Allah in accordance with God's threat while they were still in the world. And the wrongdoers will know where they will return to. (asy-Syu'ara'\/26: 227) Even though the doom is certain to come, those who do not believe in it still oppose its arrival by not stopping all their evil deeds. In this verse, Allah reveals their future destiny by saying that there is nothing they are waiting for but torment like what happened to humans long ago due to their denial of the message of the apostles. However, the end of this verse emphasizes that the sunnah of Allah determines that anyone who rejects His teachings will surely be tortured with a punishment that will not change and will not be transferred to other people. Allah will not bestow His grace on someone who has been recorded as a disobedient and a sinner, and will not pass his\/her sins on to others. And one will not carry the burden of other people's sins. (al-An'am\/6: 164) (44) Allah ordered the Prophet Muhammad to warn the liars (musyrik), did they never travel to witness how terrible the punishment that was sent down to the nations in the past due to their denial of the truth God's teachings. Originally this verse was addressed to the polytheists of Mecca, who generally work as traders. In certain seasons, the Quraysh caravan departed for Sham (Syria) and Iraq. In the desert areas they passed through, there are many traces of lands that were once inhabited by humans in ancient times, due to the disobedience of their inhabitants to the apostles sent by Allah. They were tortured, and the earth on which they stood was turned upside down so that it was completely destroyed. Allah warned the traders of Quraysh, if they also followed in the footsteps of the people who denied Him, sunatullah would surely apply to them. They will feel the torment and punishment they will not be able to resist. To convince them, verse 44 further explains that the people who have felt the retribution due to their attitudes and actions against the teachings of the apostles are people who are mighty, brave, have wealth, and have many descendants. However, their great might, wealth, and offspring were unable to defend and protect them from Allah's punishment. The purpose of walking on earth, according to the tafsir of Sayid Quthub in Tafsir fi ilal al-Qur'an, is to walk with open eyes and a fresh mind while contemplating the events that have befallen the people in the past, how and what their condition was when they were hit by God's punishment. Such a journey, according to him, increases the feeling of piety to Allah, awakens the heart from heedlessness and heedlessness of the sunatullah that must apply. They are reminded that Allah Almighty is never overwhelmed to carry out His decisions, if He so desires. Because it is emphatically said that there is no force and power that can weaken Allah, whether that power is in the heavens or on earth. How is God weak? Doesn't His knowledge and power encompass the kingdoms of heaven and earth? How is it possible that His creatures, even though all humans unite to compete with God's power, will not be able to overthrow or match His power, while all of them are made physically weak? Allah says: Allah wants to give you relief, because humans are created weak. (an-Nisa'\/4: 28) Pay attention to the end of this verse with the affirmation that Allah is All-Knowing and All-Powerful over all His creatures. In Tafsir al-Maragi it is explained that Allah is All-Knowing and All-Powerful towards those who must be punished immediately. On the other hand, a person who repents and wants to return to God from his error, He guides him so that he has full faith. When the polytheists asked the Prophet Muhammad to bring down the promised doom immediately, they were told that Allah determined His rules for this people, namely that punishment would not be immediately sent down to those who committed disobedience or disobeyed the teachings of the apostle. Because it is hoped that some of them may still be converted and return to the teachings of their Lord"
		   },
		   {
			"id": 3704,
			"surah": 35,
			"ayat": 44,
			"tafsir": "This verse still explains the attitude of the polytheists of Mecca towards the preaching of the Prophet. With all their power and thoughts, with their possessions and wealth, they opposed the preaching of the Prophet Muhammad, he was even boycotted and prevented. However, all the evil plans to break the Islamic da'wah eventually backfired on them. The failure of the Meccan infidels to prevent the spread of Islamic da'wah has been written in golden ink in Islamic history. Every attempt and evil plan to extinguish the light of Allah's religion on this earth will surely fail, because Allah will always maintain the existence of His religion on this earth, until the end of time, even if it is disliked by polytheists, as stated in the verse: They want to extinguish the light (religion) of Allah with their mouths (sayings), but Allah still perfects His light even though the disbelievers hate it. (ash-shaff\/61: 8) In Aisar at-Tafasir it is mentioned that Ka'ab said to Ibn 'Abbas, \"In the Torah it is explained that whoever digs a hole for his friend, he is the one who enters it.\" Ibn 'Abbas replied, \"I found that in the Qur'an.\" Ka'ab asked, \"Where?\" Ibn 'Abbas replied, \"Read wa la yahiqul makrus-sayyi 'illa bi EXPAH (That evil plan will only befall those who plan it themselves.)\" As described above, sometimes Allah delays the arrival of punishment as proof of His love. to unbelievers. However, don't think that Allah will not torture them if they do not repent, because if they have not experienced torment in this world, they will surely experience it in the afterlife. In the afterlife they will only believe where the unjust person was placed by Allah in accordance with God's threat while they were still in the world. And the wrongdoers will know where they will return to. (asy-Syu'ara'\/26: 227) Even though the doom is certain to come, those who do not believe in it still oppose its arrival by not stopping all their evil deeds. In this verse, Allah reveals their future destiny by saying that there is nothing they are waiting for but torment like what happened to humans long ago due to their denial of the message of the apostles. However, the end of this verse emphasizes that the sunnah of Allah determines that anyone who rejects His teachings will surely be tortured with a punishment that will not change and will not be transferred to other people. Allah will not bestow His grace on someone who has been recorded as a disobedient and a sinner, and will not pass his\/her sins on to others. And one will not carry the burden of other people's sins. (al-An'am\/6: 164)"
		   },
		   {
			"id": 3705,
			"surah": 35,
			"ayat": 45,
			"tafsir": "This verse describes the manifestation of the attributes of mercy and womb from Allah. If Allah directly tortured the polytheists as they wished, surely they and the animals would die of thirst due to lack of drinking. However, God did not act like that even though He was in power, instead He set a provision namely that the torment was postponed until a time that only He knew. However, if the punishment has befallen, it will not be reduced and they will not be able to escape. Such provisions of Allah only apply to the people of the Prophet Muhammad, while the previous people, if they were guilty, were immediately punished without delay. In Tafsir al-Wadhih it is explained that this provision is the glory bestowed by Allah on the Prophet Muhammad, as a law for him and his people. With the hope that those who still don't want to believe will soon repent, return to His instructions and teachings. However, when God's promise has come, there is no time to delay it. That's where each person's actions will be reckoned with. The good are rewarded with good, the evil is rewarded with punishment. With God's love and compassion, the Qur'an calls for humans to repent and return to Him. Even though the doom has been postponed, no one knows when the time is certain. People who feel guilty do not need to despair, because no matter how big the mistake, if it ends with true regret and repentance, Allah will surely forgive it. He is the Most Forgiving and Merciful. He is the All-Knowing and Caring for all His servants."
		   }
	]
}
