{
	"tafseer": [
		{
			"id": 4059,
			"surah": 39,
			"ayat": 1,
			"tafsir": "Allah explains that this highly valuable Al-Qur'an was revealed from Allah, the Almighty, the Most Wise. The attributes of Allah, the All-Mighty and All-Wise, are mentioned in this verse so that it will be illustrated to those who hear or read them that the Al-Qur'an contains true instructions. Its truth values cannot be disputed or disputed by anyone, and its wisdom values cannot be doubted. The proofs of the truth that the Qur'an was sent down from Allah and contains correct instructions are also explained in other verses. Allah says: And indeed, this (Qur'an) was truly sent down by the Lord of the worlds, which was brought down by ar-Ruh al-Amin (Gabriel), into your heart (Muhammad) so that you may be among those who warn , in clear Arabic. (asy-Syu'ara'\/26: 192-195) And His words: Verily, those who deny the Qur'an when (the Qur'an) is conveyed to them (they will surely be wretched), and verily (the Qur'an) is a noble Book, (which) will not be visited by falsehood either from before or from behind (in the past and in the future), which was sent down from God, the Most Wise, Most Praised. (Fushshilat\/41: 41-42)"
		   },
		   {
			"id": 4060,
			"surah": 39,
			"ayat": 2,
			"tafsir": "Allah explained that He revealed to His messenger the Book of the Qur'an, bringing truth and justice. The meaning of \"bringing the truth\" in this verse is to bring orders to all human beings so that they worship only Allah Almighty. Then Allah explained that the correct way of worship is only to worship Allah alone, by purifying obedience to Him, free from the influence of shirk and joy. The truth contained in the Qur'an is in accordance with the truth contained in the books revealed to the previous messengers. Thus, all worship that is addressed to other than Allah or worship that is not directly addressed to Him is worship that is not true."
		   },
		   {
			"id": 4061,
			"surah": 39,
			"ayat": 3,
			"tafsir": "Allah then ordered His messenger to remind his people that the holy religion is Allah's religion. The meaning of religion in this verse is worship and obedience. Therefore, worship and obedience should be directed to Allah alone, clean from shirk and joy. Idol worshipers argue that God is a substance that is beyond the reach of human senses. Therefore, it is impossible for humans to directly worship Him. If people want to worship Him, according to them, they should use an intermediary who is entrusted with the task of conveying their worship to Allah. These intermediaries are angels and jinn, who sometimes assume human form. They are considered God. As for the carved statues that are placed in places of worship, these are statues that depict God, but are not the real God. It's just that in general ignorance causes them to no longer distinguish between statues and God so they worship the statue as they worship God, like the situation of people who worship animals. They no longer distinguish between worshiping animals and worshiping the Creator of animals. The Arabs of Jahiliyyah painted statues of various shapes, some depicting stars, angels, prophets and pious people who had passed away. They worshiped the statues as a symbol for each of these gods. Such was the opinion of the polytheists in the past and before Muhammad was sent as an apostle. Then came the Messenger of Allah with an order to destroy their idols and eradicate the wrong assumptions from their minds, and replace them with teachings that lead the mind to believe in monotheism. Allah said: And indeed, We have sent a messenger for every nation (to call), \"Worship Allah, and stay away from thagut.\" (an-Nahl\/16: 36) And His words: And We did not send any messenger before you (Muhammad), but We revealed to him, that there is no god (who has the right to be worshiped) besides Me, so worship Me. (al-Anbiya'\/21: 25) As a broader explanation of the Quraysh's acknowledgment of the existence of God, Qatadah said that when the polytheists of Mecca were asked who their God was, who created them, and who created the sky and the earth and sends down rain from the sky, they say, \"Allah.\" Then when asked of them, why they worship idols, they also replied, \"So that these idols draw them closer to Allah as close as possible and the idols give intercession when they need help from Allah.\" Then regarding the attitude of the polytheists who are similar to that Allah says: So why (idols and gods) that they worship besides Allah to draw closer (to Him) cannot help them? Even the gods had disappeared from them? (al-A.hqaf\/46: 28) Allah threatens their attitudes and actions and shows them the consequences they will feel. Allah will decide what they disputed on the day of reckoning. On that day, the truth of the monotheistic religion will no longer be covered up and the evil of idol worship will be seen clearly. Each adherent will get the appropriate reward. Those who stick to the religion of monotheism will find a place full of enjoyment. While those who always wallow in the valley of polytheism will find a place to return full of suffering. At the end of this verse, Allah emphasizes that He will not give guidance to people who deny the truth and deny the religion of monotheism because of their irreparable error. They used various ways to associate Allah with other gods, such as worshiping idols, or assuming that Allah had children and so on. All of that is nothing but their assumptions that are far from the truth and drag them into the valley of error."
		   },
		   {
			"id": 4062,
			"surah": 39,
			"ayat": 4,
			"tafsir": "Allah explains in more detail the actions that caused them to fall astray. God pointed out that had He wished to have children, He would not have taken children as they say. Of course God has the power to choose children according to His will, and those chosen are of course sons. However, why did those Meccan infidels say that Allah had daughters, even though they themselves were reluctant to have daughters? Allah said: Or (is it appropriate) for Him daughters while for you sons? (ath-thur\/52: 39) And His word: Is (appropriate) for you male and for Him female? That is certainly an unfair distribution. (an-Najm\/53: 21-22) The notion that God has children regardless of their form, is including associating partners with God with other gods. This means dividing the power of God. After all, the child must inherit power from the father, and when that power is divided, the omnipotence of Allah is lost. This cannot happen because Allah, who created the heavens and the earth and their contents, certainly has unlimited power, so that His power cannot be divided. That is why Allah emphasized that He is Most Holy from the qualities expressed by the polytheists. On the other hand, Allah emphasizes that He is One and Only, childless and fatherless. He does not need anything, in fact He is All-Conquering. He has power to subdue whatever is in the heavens and on earth and all that is in it, and forces them to submit under His dominion and obey according to His will."
		   },
		   {
			"id": 4063,
			"surah": 39,
			"ayat": 5,
			"tafsir": "Allah explains that He created the heavens and the earth with the right purpose. He decorated the sky with the sun and moon. Each has trajectories according to the provisions that have been determined by Allah. Because of the rotation of the earth on its axis, it is as if the sun is seen moving in the sky from east to west, so there is a change of day and night. When the sun appears on the eastern horizon it is day and when the sun sets on the western horizon it is night. This is what happens every day. The events that occurred were solely due to Allah's will, which He had determined when He created the universe. Allah closes the night over the day is an expression of the parable where the day which is marked by the bright sunlight is likened to an open place, while the night which is marked by the closing of the sun is likened to a curtain covering an open place. So when it is said that the night covers the day, the meaning is that the bright sunlight is covered by the dark curtain of the night. Allah closing the day over the night is the opposite of the parable mentioned otherwise. The day is likened to a bright light and the night is likened to places that are pitch black. At noon, the sun's bright light covers the darkness of the night, until the darkness of the night changes to light. This kind of view is an everyday view according to the observations of ordinary people. However, if one were to think more carefully, one would be able to understand that the length of day and night is not the same. For places around the equator, the length and shortness of day and night are always around the same, around 12 hours. However, for places that are north of the equator, when the sun is moving in the north, the noon time for these areas is longer. The increase in daylight hours is directly proportional to the position of the place on earth and the position of the sun. So that in several places in the northern arctic region when the sun is in the northernmost hemisphere, these areas will experience continuous daylight. It can be said, the farther a place is from the equator and the farther the position of the sun is from the celestial equator, the longer the daytime so that in certain areas it lasts continuously. So from the closest place to the farthest from the equator there is a part of the night that is covered by the day which gets longer. Until one day the day completely covered the night. Means that noon spends the entire circle of the sun's circulation. In other words the day completely covers the night. After that, Allah explained that he had subdued the sun and the moon. Means that the circulation of the sun and the moon is in accordance with the provisions that have been arranged by Allah at the time of creation. If what is meant by the apparent daily circulation of the sun, then from the time the sun culminates to the next culmination it takes approximately 24 hours. But if what is meant by the annual circulation, namely the apparent circulation of the sun among the stars, it takes one year. As for the circulation of the month from ijtima' to the next ijtima, it takes as much as one month. Terms of time as much as one month according to calendar calculations based on the circulation of the month. The provisions on the circulation time are provisions in outline only. To get more precise figures, requires a more thorough and in-depth discussion. But what can be understood is that the sun and moon circulate according to a certain circulation time; one might even say that it circulates according to conditions that are almost certain. That is why Allah emphasized that each celestial body circulates according to the time determined according to its respective circulation. Therefore, when the time comes for the sun and moon to lose their balance, they deviate more and more from their normal circulation. Something similar will happen on the Day of Resurrection, which is the day when the heavens and the earth and everything in them will fall apart. Allah said: (Remember) on the day of heaven We roll it up like sheets of paper. (al-Anbiya'\/21: 104) At the end of the verse, Allah orders His servants to seek forgiveness from Him by rushing to worship and purify obedience to Him. Allah also reminds them that He is Mighty and His provisions cannot be disputed. Allah is Forgiving to His servants who are aware and like to be guided to the right path."
		   },
		   {
			"id": 4064,
			"surah": 39,
			"ayat": 6,
			"tafsir": "Allah shows the signs of His power in the creation of human beings. God explains that He created man in the beginning alone. God created humans of various colors and languages from Adam. Then Allah created his partner Eve. Allah also explained that He also created eight pairs of livestock. A pair of goats, a pair of sheep, a pair of camels and a pair of cows. God explains further about human events. Humans are created through a process of event after event. The process of its first occurrence is as a germ, after which it goes through process after process as condensed blood then becomes a fetus. It is at the perfect time to become a fetus that God creates a spirit in it so that it becomes a living being. Signs of life can be known from the heartbeat by placing the ear to the mother's stomach. Regarding the process of human occurrence in the mother's stomach, the Prophet Muhammad said: In fact, the incident of someone among you in the mother's stomach is the first 40 days in the form of semen (sperm), then becomes 'alaqah (something that hangs) at a time like that again (40 days) , then becomes a \"Mudhgah\" (a lump of flesh) in such a period (40 days. Then an angel is sent (by Allah), then he blows the spirit into the fetus, and Allah orders to determine 4 things: his sustenance, his age, his deeds, whether he people who are wretched or happy. (Muslim history from Ibn Mas'ud) In addition, Allah explains that when a baby is in the womb, he is in three darknesses, namely on the inside of the membrane that covers the baby in the womb so that the baby is protected from the influence decay. To the eye, at first glance the membrane seems to be just one layer, but when examined closely, the membrane has three layers. Scientists explain that three layers make The things that can protect the fetus while in the womb are: 1. The amniotic membrane, which contains fluid so that the fetus is swimming. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position itself when it is about to be born. 2. The chorion membrane layer 3. The decidual membrane layer Some researchers attribute the three layers of darkness in the ayat above to the layers of the amniotic membrane that surround the uterus, the wall of the uterus itself, and the abdominal wall in the abdomen. God emphasized that the one who did this was God the Creator of human beings and who rules over the heavens and the earth and their contents. Therefore, He has the right to be worshiped. There is no God worthy of worship except He, the One and only God who has no partners. At the end of the verse, Allah asks the polytheists a question that contains ridicule towards them, why can they be turned away from worshiping only Allah, becoming worshipers of statues, even though they already have the ability to read the signs of the oneness and power of Allah in nature. universe and exist in themselves."
		   },
		   {
			"id": 4065,
			"surah": 39,
			"ayat": 7,
			"tafsir": "Allah explains that if the polytheists continue to deny His omnipotence, even though there is sufficient evidence for this, then this will not harm Allah in the slightest. He does not need anything from all of His creatures. Allah said: And Musa said, \"If you and those who are on earth all deny (the favors of Allah), then surely Allah is Rich, Most Praised.\" (Ibrahim\/14: 8) In the Qudsi hadith it is explained: \"O My servants, if the former and the last of you, humans and jinn all gathered in the heart of the most evil person, then such an attitude does not reduce my power in the slightest.\" (Muslim history from Abu dzarr al-Gifari) Allah explains that He does not give up disbelief for His servants. Denial is fundamentally against the human spirit. The human soul and all of Allah's creatures are created according to the nature of their occurrence, which should be subject to the provisions of their Creator. However, if they are grateful for Allah's blessings, surely He will like it, because such a situation is in accordance with the nature of its occurrence, and in accordance with the sunatullah. Allah said: Indeed, if you are grateful, I will surely increase (favors) to you, but if you deny (My favors), then surely My punishment will be very heavy. (Ibrahim\/14: 7) Then Allah explained that everyone, on the Day of Resurrection, will be required to account for their deeds while living in the world. Everyone who sins is responsible for his sinful actions. He will not bear the sins of others. After that, each person will be brought before his Lord to receive an explanation about his deeds during his life in the world. Not a single good or bad deed remains. At that time the deeds of each person will be rewarded accordingly. If the record of his deeds is full of good deeds, surely he will get a place full of pleasures. But if the records of his deeds are full of bad deeds, surely he will get a place full of suffering. As Allah says: And that man only gets what he has worked for, and indeed his efforts will be shown (to him), then he will be rewarded with the most perfect reward. (an-Najm\/53: 39-41) It should be remembered that someone who commits evil, then someone else follows him, then he will receive additional sins from the evil committed by those who imitate him. In this regard, the Messenger of Allah once stated the following: Whoever makes good habits in Islam, he will receive a reward plus the reward of the person who does it until the Day of Judgment without reducing that person's reward in the least. And whoever does bad habits in Islam, he will get his sin, plus the sins of those who do it until the Day of Judgment, without reducing that person's sins in the slightest. (Muslim history and an-Nasa'i from Abu dzarr) At the end of this verse Allah explains, that He is All-Knowing of what is stored in the breasts of His servants. Thus there can be no deed that escapes the actions of God, both actions that can be witnessed by other people or actions that are only known by the doer himself."
		   },
		   {
			"id": 4066,
			"surah": 39,
			"ayat": 8,
			"tafsir": "Allah explains the attitude of people who deny the favor of Allah. When harm befalls him, either in the form of illness or suffering, that befalls his life, he asks Allah for help, so that his illness or suffering will be eliminated. He also declared himself to repent, asking forgiveness for his bad deeds in the past. However, when he gets a blessing where his illness and suffering have disappeared, he forgets the words he made when he prayed. Then they fabricated other gods as partners for Allah. They not only mislead themselves, but also mislead other people, hindering people who declare themselves as people who believe in monotheism. At the end of the verse, Allah commands His messengers to say to people who deny Allah's favors, \"Be satisfied with carrying out your desires while living in this world, enjoy the delights that don't last long, until death takes your soul. At that time you will regret your actions . On the day of reckoning, you will know for sure that you will become residents of hell which is full of torment.\""
		   },
		   {
			"id": 4067,
			"surah": 39,
			"ayat": 9,
			"tafsir": "Then Allah ordered His Messenger to ask the unbelievers of Mecca, whether they are more fortunate than people who worship at night by prostrating and standing very solemnly. In carrying out this worship, arose in his heart the fear of Allah's punishment in the hereafter, and his hope radiated for Allah's mercy. The same command was given by Allah to His Messenger to ask them whether those who know are the same as those who do not know. What is meant by people who know are people who know the rewards they will receive, because of their good deeds, and the punishment they will receive if they commit immorality. Meanwhile, those who do not know are those who do not know about it at all, because they do not have the slightest hope of getting a reward for their good deeds, and do not expect to be punished for their bad deeds. At the end of the verse, Allah states that only intelligent people can take lessons. The lesson is either from his life experience or from the signs of God's greatness that are in the heavens and on earth and their contents, also those that are found in him or examples from the stories of past people."
		   },
		   {
			"id": 4068,
			"surah": 39,
			"ayat": 10,
			"tafsir": "Allah ordered His Messenger to call on all of Allah's servants and advise them to remain fearful of Allah, obey all of His commands and stay away from all of His prohibitions. Humans are commanded to be pious because those who do good in this world will also receive goodness. They will be blessed with health, prosperity and success in carrying out their life tasks. All of this can be achieved because he always has good and virtuous character as is usually done by pious people. Besides that, he will also get good in the hereafter, namely getting a place full of pleasures, and getting the pleasure of Allah. Allah also ordered the Muslims to prepare themselves to migrate to Medina, and ordered them to be steadfast because they were separated from their homeland, relatives and friends. The order was given with an explanation that if the freedom of the Muslims in carrying out Allah's orders in Mecca is disturbed, then they should emigrate to another country where it is possible to provide peace in carrying out Allah's commands. This command is illustrated in God's brief word \"And God's earth is wide.\" Allah said: \"Isn't Allah's earth wide, so that you can emigrate (move) in that earth?\" (an-Nisa'\/4: 97) At the end of the verse, Allah explains that only those who are patient will receive unlimited rewards, as experienced by the people who were earlier than them."
		   },
		   {
			"id": 4069,
			"surah": 39,
			"ayat": 11,
			"tafsir": "In this verse, Allah ordered His messenger to tell the polytheists of Mecca that he was ordered to worship Allah and obey His commands by purifying obedience to Him in carrying out religious affairs. From this explanation, it can be understood that worship other than Allah must be eradicated from its roots. Likewise regarding religious affairs, the guidelines are orders that come from Allah, not to be based on other people's opinions."
		   },
		   {
			"id": 4070,
			"surah": 39,
			"ayat": 12,
			"tafsir": "The Prophet was also ordered to be the first person to surrender to Allah. Thus, the Messenger of Allah became a role model who must be emulated by all his actions and shunned what he forbade. He became an example in terms of purifying monotheism, purifying worship, and ridding himself of the behavior and deeds of the polytheists of Mecca. Surrender referred to in this verse is submission to all of Allah's provisions, both those related to syara' commands or submission and obedience to Allah's provisions related to sunnah kauniyah."
		   },
		   {
			"id": 4071,
			"surah": 39,
			"ayat": 13,
			"tafsir": "In this verse, the Messenger of Allah is also ordered to be afraid of violating Allah's prohibitions, such as not being sincere in carrying out His commands and confirming them. If he is afraid of violating His prohibitions, it means he is afraid of the terrible punishment that will befall him on the day of reckoning. On that day all human actions, good or bad, are examined and rewarded accordingly."
		   },
		   {
			"id": 4072,
			"surah": 39,
			"ayat": 14,
			"tafsir": "After that Allah ordered His Messenger to tell his people that he only worships Allah and only for Him does he purify obedience in carrying out religious affairs. From this verse it can be understood that in carrying out religious affairs there must be a clear dividing line, not to be confused between associating Allah with associating partners with Him. Between what is ordered by religion and which is not ordered. In matters of faith and worship there is no compromise, while in matters of the world and benefit, this can be resolved by ijtihad, as long as the principles do not conflict with religious teachings."
		   },
		   {
			"id": 4073,
			"surah": 39,
			"ayat": 15,
			"tafsir": "In this verse, Allah ordered His Messenger to tell the polytheists of Mecca, and let them worship the statues according to their will. They have been warned repeatedly and given guidance time and time again. However, they still remain in their stance following in the footsteps of their ancestors which are only based on conjectures that are far from the truth. As a final confirmation, the Prophet was ordered to tell them that the people who lose are the people who harm themselves. This means that if they are later given retribution with a terrible punishment, there will be no other than that suffering because of their own actions. The loss and suffering not only befall them, but also their families who share the same view as them. At the end of this verse, Allah emphasizes that such losses and suffering are real losses and suffering, because there is no greater loss and suffering than the losses they will suffer on the Day of Judgment."
		   },
		   {
			"id": 4074,
			"surah": 39,
			"ayat": 16,
			"tafsir": "In this verse, Allah explains the suffering they experienced. They will be placed in the midst of the layers of fire of hell. At the top there is fire in layers and below it too. They are at the peak of suffering, because they are under siege by the fires of hell. Allah said: On the day (when) doom closed them from above and from under their feet and (Allah) said (to them), \"Taste (return of) what you have done!\" (al-'Ankabut\/29: 55) And His words: For them a sleeping mat from the fire of hell and on them there is a blanket (fire of hell). (al-A.'raf\/7: 41) The terrible torments that Allah put forward are nothing but to frighten His servants, so that they are aware and converted and return to the straight path, the path indicated by the Messenger of Allah and love ask Allah's forgiveness for the sins they have done. At the end of the verse, Allah commands His Messenger to call upon His servants to be pious, to obey His commands, and to stay away from His prohibitions. This exclamation shows the compassionate nature of Allah towards His servants and His priceless wisdom."
		   },
		   {
			"id": 4075,
			"surah": 39,
			"ayat": 17,
			"tafsir": "This verse describes those who always take care of themselves and avoid worshiping tagut, idols, and are steadfast in the face of Satan's temptations, serve themselves and worship only Allah, not worshiping anyone other than Him. They will receive good news from the apostles that they will be spared from the punishment of the grave after death, the misery in Padang Mahsyar. They will have eternal pleasure in heaven. Therefore, the Prophet Muhammad was ordered to give good news to his people who always worship Allah, and always hear the right words, and do the best of all those true words. They will also get what the pious servants of Allah get. They are people who always follow God's instructions and always use common sense. It was narrated by Ibn Abi Hatim from Zaid bin Aslam that this verse was revealed in connection with three of the Prophet's companions, namely Zaid bin 'Amr, Abu dzarr al-Gifari, and Salman al-Farisi, the three of them were people who had said the phrase \"La ilaha illallah\" in the Arab Jahiliah era."
		   },
		   {
			"id": 4076,
			"surah": 39,
			"ayat": 18,
			"tafsir": "This verse describes those who always take care of themselves and avoid worshiping tagut, idols, and are steadfast in the face of Satan's temptations, serve themselves and worship only Allah, not worshiping anyone other than Him. They will receive good news from the apostles that they will be spared from the punishment of the grave after death, the misery in Padang Mahsyar. They will have eternal pleasure in heaven. Therefore, the Prophet Muhammad was ordered to give good news to his people who always worship Allah, and always hear the right words, and do the best of all those true words. They will also get what the pious servants of Allah get. They are people who always follow God's instructions and always use common sense. It was narrated by Ibn Abi Hatim from Zaid bin Aslam that this verse was revealed in connection with three of the Prophet's companions, namely Zaid bin 'Amr, Abu dzarr al-Gifari, and Salman al-Farisi, the three of them were people who had said the phrase \"La ilaha illallah\" in the Arab Jahiliah era."
		   },
		   {
			"id": 4077,
			"surah": 39,
			"ayat": 19,
			"tafsir": "This verse explains the opposite of the characteristics of the people mentioned in the verse before this verse, namely those who say they are capable of doing anything and are also able to overcome all kinds of difficulties. They were rebuked by Allah by saying, \"Are you the one who controls all human affairs, regulates and controls their condition? Can you change My decision by canceling the punishment I have decreed against those who always pollute their souls by doing all kinds of sinful acts?\" and do the deeds that I forbid?\" Allah confirms that they can never erase and change all kinds of His decisions in the slightest, because the provisions of all things are in His hands."
		   },
		   {
			"id": 4078,
			"surah": 39,
			"ayat": 20,
			"tafsir": "In this verse, the mention of actions that are pleasing to Allah are repeated, namely all acts of piety, obligatory actions, and sunnah. People who perform these deeds will be placed later in heavenly chambers which have everything they desire in them and are decorated with beautiful gardens with rivers flowing in them. That is God's promise to everyone who is faithful and pious. The promise is a true promise, will not be denied in the slightest, because God will not deny His promise."
		   },
		   {
			"id": 4079,
			"surah": 39,
			"ayat": 21,
			"tafsir": "In this verse, Allah commands people to think about one of the processes that occur in nature, namely the process of the rain falling and the growth of plants on the surface of the earth. If one looks at it as if the event were a cycle that started at a point in a circle, starting from something, then it grew bigger, then it got old, then it died or died, then a new incident started again and so on up to a period determined by God, namely the end of this natural event. According to scientific studies, the distribution and dynamics of water in the soil is described in this verse. Apart from being running water that flows directly on the surface of the ground, some of the water that falls from the sky either as rainwater or melted snow will infiltrate (infiltrate) into the soil and spread in the soil pores. Water will be retained by the soil pores with a force that is inversely proportional to the size of the soil pores. In soil pores with a large size, water will be pulled by gravity and can flow (percolate) to lower layers of soil or rock or flow laterally in the direction of the slope. Shallow groundwater that flows in the direction of the slope will come out again as springs. Water flowing down to the lower layers will then fill the groundwater-carrying layer (aquifer), which is a layer of soil or rock composed of coarse grains, mainly sand. If this aquifer emerges to the surface of the ground, for example at a slope bend, springs will also be found at the location where it appears. Pores with a smaller size, known as capillary pores, will hold water in it as soil moisture. The water contained in these capillary pores will not be released except by a greater stress than gravity, generally by evaporation, or in the deeper layers by the suction power of plant roots. This soil moisture is then used by plants for metabolism and then evaporates from the stomata of leaves and other plant parts that contain chlorophyll. Evaporation of groundwater in this way is known as transpiration. Soil that has enough moisture will be characterized by the plants that cover it have green leaves. If the humidity is reduced, the leaves will gradually turn yellow and then dry out. The dried leaves will fall off to reduce the evaporation process. Water evaporated by the sun's heat, then becomes a lumpy cloud, driven back by the wind to a place so that it rains. The process of such events becomes material for reflection for people who want to use their minds. Of course there is a Almighty Substance that arranges all of that, so that everything happens in an orderly and neat manner. There's no way a human could do that. The one who does all of that is certainly the One who has the right to be worshiped and obeyed by all His commands."
		   },
		   {
			"id": 4080,
			"surah": 39,
			"ayat": 22,
			"tafsir": "This verse emphasizes that it is not the same person whose heart Allah has opened so that he accepts the religion of Islam, with a person whose heart has gone astray, so that he denies the truth. The person's heart has seen the power and greatness of Allah in the beauty and wonders of this nature, then his heart opens to receive the light from the Divine light. On the other hand, people who are misguided in their hearts do not see the signs of Allah's power and greatness in this natural event. They feel able to change or improve the process of events. It is because of their ignorance and narrow-mindedness that their hearts remain closed, and do not allow the rays of Divine light to enter into their hearts. The two kinds of people are certainly not the same. In another verse, Allah confirms the dissimilarity of the two kinds of people. Allah said: And is the person who has died and then We brought him back to life and We gave him a light so that he can walk in the midst of the crowd, the same as someone who is in darkness, so that he cannot get out of there? (al-An'am\/6: 122) Ibn 'Abbas narrated, \"Among the people whose breasts Allah has widened to accept the religion of Islam, is Abu Bakr ra Ibn Mardawaih narrated from Ibn Mas'ud he said: The Messenger of Allah read this verse, then we asked, \"O Prophet of Allah, how is that open heart?\" He replied, \"When light illuminates the heart, it becomes open and spacious.\" We asked, \"What is such a sign, O Messenger of Allah?\" He replied, \"Facing yourself with the eternal life of the country and distancing yourself from the life of a country that is full of deceit and preparing yourself to die before death comes.\" (History of Ibn Mardawaih) Narrated by at-Tirmidhi from Ibn 'Umar, he said: That someone said, \"O Messenger of Allah, which believer is the best?\" Rasulullah SAW replied, \"Those who remember death a lot and prepare for death the most, and when light shines on their hearts, the heart opens and becomes spacious.\" Companions asked, \"What is the sign like that, O Prophet of Allah?\" The Prophet replied, \"Facing the land that is eternal and keeping away from the land that is full of deceit and preparing to die before death comes.\" As for those who rough and petrified hearts will have a big accident because of their stubborn attitude do not want to remember Him. Their hearts should soften when God's name is called before them, but their faces turn black and somber when they hear God's name called and their hearts turn hard and hard. Narrated by at-Tirmidhi from Ibn 'Umar, he said: The Messenger of Allah said: Do not talk too much without mentioning the name of Allah, because talking too much without mentioning the name of Allah causes the heart to harden. And verily the person who is farthest from Allah is the one whose heart is hard.\" At the end of this verse it is explained that the person whose heart is hard is the person whose eyes are blind, they are truly in a real error. Everyone easily knows their badness That."
		   },
		   {
			"id": 4081,
			"surah": 39,
			"ayat": 23,
			"tafsir": "Allah explained that He sent down the best words, namely the noble Qur'an, some of the verses have a good resemblance in explaining laws, truths, lessons, presenting evidence, wisdom, and so on, as are some parts of water like some parts of the air, some parts of one country like some parts of another country. As there is a story repeated mention of it in several places, so are the commandments, prohibitions, and so on. Believers, when they hear the recitation of the Qur'an their hair bristles, and their hearts tremble for fear of Allah. It encourages their hearts to follow all of Allah's commandments and stop His prohibitions. Their souls come alive, their enthusiasm increases to carry out good deeds and jihad in His way. With the Qur'an, Allah gives guidance to His servants, guides those whom He wills to the straight path and strengthens the faith in their hearts. But people whose hearts are led astray, they are empty and empty, they will not get the slightest benefit from the Qur'an."
		   },
		   {
			"id": 4082,
			"surah": 39,
			"ayat": 24,
			"tafsir": "In this verse, Allah emphasizes the difference between the conditions of those who are guided and those who are not guided. People who go astray and are not guided will face hell on the Day of Resurrection. The fires of hell burn their faces, and their hands cannot cover their faces from the heat of the fire, because their hands are shackled. It's different with people who believe. They are safe from the fires of hell and do not need to avoid the punishment that befell the disbelievers. On that day, the disbelievers were pointed at by the angels saying, \"You will feel the burning punishment of hell, because of the things you did while living on earth.\""
		   },
		   {
			"id": 4083,
			"surah": 39,
			"ayat": 25,
			"tafsir": "In this verse, Allah explains the punishment that has been inflicted on those who used to deny the messengers sent to them, just as the polytheists of Mecca did to the Messenger of Allah. The punishment was meted out to them after being repeatedly called to the right path by the apostles sent to them, but they did not heed the call. Thus they are overwritten by punishment in this world and in the hereafter they will get a very painful punishment. The punishment of this world is far lighter and lighter than the punishment of the hereafter."
		   },
		   {
			"id": 4084,
			"surah": 39,
			"ayat": 26,
			"tafsir": "In this verse, Allah explains the punishment that has been inflicted on those who used to deny the messengers sent to them, just as the polytheists of Mecca did to the Messenger of Allah. The punishment was meted out to them after being repeatedly called to the right path by the apostles sent to them, but they did not heed the call. Thus they are overwritten by punishment in this world and in the hereafter they will get a very painful punishment. The punishment of this world is far lighter and lighter than the punishment of the hereafter."
		   },
		   {
			"id": 4085,
			"surah": 39,
			"ayat": 27,
			"tafsir": "Allah explains in this verse that He has made various examples in the Qur'an such as explaining the history of some of the previous Ummahs reminding them of the calamity they experienced. The examples and parables were put forward to them so that they would take lessons from them, both those related to the life of this world and those related to the life in the hereafter. By adhering to the Qur'an, they can rectify their misguided beliefs, improve their chaotic order of life, so that they turn into a civilized life. It is not difficult for them to understand the Qur'an because it was revealed in Arabic, their own language. There is nothing contradictory in it. The contents are clear and firm both related to faith, law, ethics, and so on. If they would believe and follow the instructions of the Qur'an, they would surely be able to protect themselves from any calamity that might befall them and surely they would obey Allah alone."
		   },
		   {
			"id": 4086,
			"surah": 39,
			"ayat": 28,
			"tafsir": "Allah explains in this verse that He has made various examples in the Qur'an such as explaining the history of some of the previous Ummahs reminding them of the calamity they experienced. The examples and parables were put forward to them so that they would take lessons from them, both those related to the life of this world and those related to the life in the hereafter. By adhering to the Qur'an, they can rectify their misguided beliefs, improve their chaotic order of life, so that they turn into a civilized life. It is not difficult for them to understand the Qur'an because it was revealed in Arabic, their own language. There is nothing contradictory in it. The contents are clear and firm both related to faith, law, ethics, and so on. If they would believe and follow the instructions of the Qur'an, they would surely be able to protect themselves from any calamity that might befall them and surely they would obey Allah alone."
		   },
		   {
			"id": 4087,
			"surah": 39,
			"ayat": 29,
			"tafsir": "Allah made a parable to explain the difference between shirk and monotheism. For that Allah likened two slaves. One slave is owned by several masters, they are united in their ownership. While other slaves are only owned by a master, no one else owns them. At one time the first slave received orders from his masters with different orders, such as the first master ordered to clean his yard, the second master ordered to hoe his garden, the third master ordered to clean his house and so on. This command is given at the same time. Which command of the master must be carried out by the slave? It is impossible for the slave to carry out every order from his master at the same time. And so on so that the slave is always confused in obeying the orders of each master. As for the second slave who only had a master, he could carry out his master's orders well, he would not be confused in carrying out the order, and his master was relieved because his slave could carry out his orders well. Is the condition of the two slaves the same and is the condition of the master of each slave the same? This is the case with people who believe in monotheism and people who believe in shirk. People who believe in monotheism are never confused in carrying out orders and prohibitions from their Lord, because these orders and prohibitions originate from the One and Only God. A shirk religion is always in a state of confusion, which command of his god will he follow. Conversely, people who believe in monotheism only worship the One God, while people who believe in shirk are always confused, which god is more worthy of worship than other gods. After explaining the heresy of shirk, Allah emphasized that all praise is only for Him, not for others. Only He has the right to be worshiped, but most people don't want to know about it."
		   },
		   {
			"id": 4088,
			"surah": 39,
			"ayat": 30,
			"tafsir": "Allah explained that all humans will return to God and on the Day of Resurrection, humans will argue and accuse each other. On the Day of Judgment the polytheists tried to defend themselves, but the Prophet Muhammad was able to reject their reasons, by stating that the da'wah had been conveyed to them, but they denied and denied it. Therefore, they ask forgiveness from Allah, but their request is not acceptable, because on that day repentance is no longer acceptable. Among the debates between polytheists and their worships is mentioned in this verse. They said to their leaders, \"We followed you, but you led us astray.\" The leaders replied, \"We too have been deceived by the demons and our ancient ancestors.\""
		   },
		   {
			"id": 4089,
			"surah": 39,
			"ayat": 31,
			"tafsir": "Allah explained that all humans will return to God and on the Day of Resurrection, humans will argue and accuse each other. On the Day of Judgment the polytheists tried to defend themselves, but the Prophet Muhammad was able to reject their reasons, by stating that the da'wah had been conveyed to them, but they denied and denied it. Therefore, they ask forgiveness from Allah, but their request is not acceptable, because on that day repentance is no longer acceptable. Among the debates between polytheists and their worships is mentioned in this verse. They said to their leaders, \"We followed you, but you led us astray.\" The leaders replied, \"We too have been deceived by the demons and our ancient ancestors.\""
		   },
		   {
			"id": 4090,
			"surah": 39,
			"ayat": 32,
			"tafsir": "This verse explains that there is no one who is more unjust than someone who concocts lies against Allah, by holding other worship, or saying that the angels are the daughters of Allah. They also deny the truth of the Qur'an which was brought by the Prophet Muhammad, who called for monotheism, carried out amar ma'ruf nahi munkar and announced that the day of resurrection and retribution would come. They act as liars when the truth comes to them, as if they have closed their minds and senses to conduct investigations or distinguish between what is right and what is wrong, as is done by conscious and reasonable humans. All of that arises because of the nature of pride and arrogance. Therefore, Allah delivers a strong threat in the form of a question, \"Isn't there a place to live in hell for those who disbelieve?\" This way of conveying threats in the form of questions is often found in the Qur'an, because of its enormous benefits for those who are seeking the truth. The question aroused surprise or at least concern to those who were unwary and inattentive. In accordance with sunatullah, after delivering threats against unbelievers, Allah then gave good news and praise to the Prophet Muhammad and his friends and followers who always fear Him."
		   },
		   {
			"id": 4091,
			"surah": 39,
			"ayat": 33,
			"tafsir": "As for the person who brought the truth, namely Muhammad and those who confirmed it, namely his companions and followers until the Day of Judgment. They always fear Allah, do not worship statues and idols, always fulfill Shari'a obligations, and carry out amar ma'ruf nahi munkar while expecting rewards and avoiding His punishment. They are what is meant by the pious people."
		   },
		   {
			"id": 4092,
			"surah": 39,
			"ayat": 34,
			"tafsir": "They will be rewarded and honored by Allah whom they always obey and worship. In heaven, they will get whatever they want with Allah. In several valid hadiths it is explained that in heaven they will find various favors that have never been seen by their eyes, heard by their ears, and imagined in their hearts. That is the reward for those who always prioritize good deeds, with a sincere heart in a hidden or open condition, who always guard their deeds and words, both regarding heavy or light matters, big or small. They face all that with full sense of responsibility."
		   },
		   {
			"id": 4093,
			"surah": 39,
			"ayat": 35,
			"tafsir": "All the graces, rewards, and gifts bestowed upon them by Allah. Allah also forgives the worst deeds they have ever done in the world. Allah does not repay their sins and mistakes with punishment, even covers their sins and bad deeds and repays them with a better reward than what they have done. In this verse forgiveness of sins takes precedence over giving rewards, because someone whose sins are forgiven has felt calm. After all, Allah's forgiveness is wider than the sins of His servants."
		   },
		   {
			"id": 4094,
			"surah": 39,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains some of the favors given to Prophet Sulaiman, as an answer to his prayer. First: Allah bestowed upon Solomon the power to subdue the winds. With God's permission, the wind blows swiftly or gracefully according to his will anyway. Allah said: And (We subject) to Sulaiman a very strong wind that blows by his order to the land that We have blessed him with. And We are All-Knowing of all things. (al-Anbiya'\/21: 81) Second: Allah bestowed upon him the ability to subdue demons who are skilled builders and skilled divers, who carry out tasks according to Solomon's orders. If he orders them to build a building such as palace meeting halls, defensive fortifications, or buildings where Solomon's wealth is stored and others, then they can complete this task in a very short time. If Solomon ordered them to collect pearls and marjans and other marine wealth, the task could be completed quickly too. Third: Allah bestowed upon him the power to subdue the devil who opposed his orders. Their hands and feet were bound in shackles, so as not to be a danger to others, and as punishment for their disobedience. The power given by Allah to Solomon to subdue Satan means the power to move them to carry out heavy tasks, namely the task of building buildings and diving to extract the wealth of the sea. However, there is no definite information about how Solomon shackled the demon. The most important attitude is that we accept the information contained in the Qur'an and to express its meaning, we leave it to science."
		   },
		   {
			"id": 4095,
			"surah": 39,
			"ayat": 37,
			"tafsir": "In this verse, Allah explains some of the favors given to Prophet Sulaiman, as an answer to his prayer. First: Allah bestowed upon Solomon the power to subdue the winds. With God's permission, the wind blows swiftly or gracefully according to his will anyway. Allah said: And (We subject) to Sulaiman a very strong wind that blows by his order to the land that We have blessed him with. And We are All-Knowing of all things. (al-Anbiya'\/21: 81) Second: Allah bestowed upon him the ability to subdue demons who are skilled builders and skilled divers, who carry out tasks according to Solomon's orders. If he orders them to build a building such as palace meeting halls, defensive fortifications, or buildings where Solomon's wealth is stored and others, then they can complete this task in a very short time. If Solomon ordered them to collect pearls and marjans and other marine wealth, the task could be completed quickly too. Third: Allah bestowed upon him the power to subdue the devil who opposed his orders. Their hands and feet were bound in shackles, so as not to be a danger to others, and as punishment for their disobedience. The power given by Allah to Solomon to subdue Satan means the power to move them to carry out heavy tasks, namely the task of building buildings and diving to extract the wealth of the sea. However, there is no definite information about how Solomon shackled the demon. The most important attitude is that we accept the information contained in the Qur'an and to express its meaning, we leave it to science."
		   },
		   {
			"id": 4096,
			"surah": 39,
			"ayat": 38,
			"tafsir": "In this verse, Allah explains some of the favors given to Prophet Sulaiman, as an answer to his prayer. First: Allah bestowed upon Solomon the power to subdue the winds. With God's permission, the wind blows swiftly or gracefully according to his will anyway. Allah said: And (We subject) to Sulaiman a very strong wind that blows by his order to the land that We have blessed him with. And We are All-Knowing of all things. (al-Anbiya'\/21: 81) Second: Allah bestowed upon him the ability to subdue demons who are skilled builders and skilled divers, who carry out tasks according to Solomon's orders. If he orders them to build a building such as palace meeting halls, defensive fortifications, or buildings where Solomon's wealth is stored and others, then they can complete this task in a very short time. If Solomon ordered them to collect pearls and marjans and other marine wealth, the task could be completed quickly too. Third: Allah bestowed upon him the power to subdue the devil who opposed his orders. Their hands and feet were bound in shackles, so as not to be a danger to others, and as punishment for their disobedience. The power given by Allah to Solomon to subdue Satan means the power to move them to carry out heavy tasks, namely the task of building buildings and diving to extract the wealth of the sea. However, there is no definite information about how Solomon shackled the demon. The most important attitude is that we accept the information contained in the Qur'an and to express its meaning, we leave it to science."
		   },
		   {
			"id": 4097,
			"surah": 39,
			"ayat": 39,
			"tafsir": "After Rasulullah saw put forward an argument that could not be refuted by the polytheists, Allah ordered him to deliver a threat by saying, \"O my people, act according to your assumptions, that you have the strength and skills, and sweat your sweat in making your plots and tricks, because I also did the same in strengthening and spreading my religion, later you will know, which of us has a better outcome.\""
		   },
		   {
			"id": 4098,
			"surah": 39,
			"ayat": 40,
			"tafsir": "In this verse, Allah threatens us all in the form of a question, namely, who will receive such a humiliating punishment, and who will continue to receive this punishment? Threats in the form of these questions give us clues that there are humans who receive a humiliating punishment, both in this world and the hereafter. Disbelievers and disobedient people can also get that punishment continuously and eternally. Therefore, we need to be careful not to get the punishment that is threatened by being an obedient believer and always putting our trust in Allah."
		   },
		   {
			"id": 4099,
			"surah": 39,
			"ayat": 41,
			"tafsir": "This verse explains that in fact Allah has sent down the Qur'an to the Prophet Muhammad with the truth. He was then ordered to convey the teachings of God's religion to all mankind by giving the good news of the arrival of God's grace and warning of the arrival of God's punishment for those who deny him. Al-Qur'an contains all the instructions needed by humans in managing all aspects of their life. With that, they become happy people in this world and the hereafter because they follow the straight path. Whoever gets instructions to practice the contents of the Qur'an, then the benefit of that guidance is for himself, because they will be pleased by Allah, put into heaven, and saved from hell. And whoever deviates from the straight path so that he goes astray, then in fact it is only to his own detriment. He will fall into destruction and desolation because he will receive God's wrath and will experience suffering in the fires of hell. On the Day of Judgment, no one will be saved except those who truly bring a clean heart according to the word of Allah: (That is) on the day (when) wealth and children are useless, except for those who turn to Allah with a clean heart . (asy-Syu'ara'\/26: 88-89) Allah then explained that the Prophet Muhammad was not the one who was responsible for their deeds. His task is solely to convey the treatise as explained in His words: Truly, you are only a warner and Allah is the preserver of all things. (Hud\/11: 12) His words also: So give a warning, because you (Muhammad) are only a warner. You are not the one who has power over them. (al-Gasyiyah\/88: 21-22)"
		   },
		   {
			"id": 4100,
			"surah": 39,
			"ayat": 42,
			"tafsir": "In this verse, Allah describes one kind of His perfect power and His awesome nature. That is, He is the one who holds the human spirit when it comes to death by severing the connection between the spirit and the body and holding the person's spirit at birth so that it cannot control its body, but the relationship between them still exists. God retains the soul of the person He has ordained death by not returning the spirit, and releases another soul by returning the soul to its body, so that it can wake up from its sleep until the appointed time. A person who dies is held by God's spirit so that he cannot return to his body and a person who has not died just sleeps, his spirit is released so that he can return to his body again. It was narrated from Ibn 'Abbas that in the human body there is a soul and a spirit whose relationship is like sunlight. The mind and soul can think and make choices, while the spirit causes it to live and move. Both of them were turned off when he died, and his soul was turned off only when he slept, while his spirit was still there. Imam al-Bukhari and Muslim narrated a hadith from Abu Hurairah which reads: The Messenger of Allah said, \"If one of you is going to sleep, then let him blow into his clothes on the inside, because he does not know what is left in it, then let him say, \"O my Lord with your name I lay my stomach, and with your name also I lift it. If You hold my soul then love him, and if You let him go back, then take care of him as You take care of the pious.\" (History of al-Bukhari and Muslim) Imam al-Bukhari, Ahmad, Abu Dawud, and Ibn Abi Syaibah narrated a hadith from Abu Qatada, which reads: Indeed, the Prophet said to his companions at night (while sleeping) in the valley, \"Verily Allah holds your spirit when He wills, and returns it when He wills.\""
		   },
		   {
			"id": 4101,
			"surah": 39,
			"ayat": 43,
			"tafsir": "In this verse, Allah refutes the opinion of the polytheists that the idols they worship besides Allah can intercede for them on the Day of Judgment, and provide assistance to them in achieving their goals and hopes. Such a thing is impossible to justify a person who has a sound mind. Therefore, the Prophet Muhammad was ordered by Allah to rebuke the polytheists who think so with the words, \"Are you going to see idols that can benefit even though they have nothing and have no sense? only Allah can intercede."
		   },
		   {
			"id": 4102,
			"surah": 39,
			"ayat": 44,
			"tafsir": "In this verse, Allah told His Prophet to say that only Allah belongs to all the intercessors. No one can intercede except with Allah's permission as stated in His word: No one can intercede with Him without His permission His. (al-Baqarah\/2: 255) And as His word:  and they do not intercede except for those who please (Allah)  (al-Anbiya'\/21: 28) All intercession belongs only to Allah because He has the kingdoms of the heavens and the earth and all that is in them, including the idols worshiped by the polytheists. Therefore, worship Allah alone who has a perfect kingdom, whose power is unlimited. Then to Him you will all be returned on the day of resurrection. It is he who will later inflict a very painful punishment on the polytheists. There is no doubt that this verse contains a grave threat. Then Allah also explains a very bad character of those who deny His oneness."
		   },
		   {
			"id": 4103,
			"surah": 39,
			"ayat": 45,
			"tafsir": "In this verse, Allah explains that if only Allah's name is mentioned, and there is no God who has the right to be truly worshiped except Him, then the hearts of those who do not believe in the afterlife will become wild and angry. Their hearts were upset and heard the monotheistic sentence. However, when the names of gods other than Allah are mentioned, they suddenly become happy and rejoice. 'Abdullah bin 'Abbas explained the meaning of this verse, \"The hearts of four people who did not believe in the Day of Judgment became hard and wild, namely: Abu Jahl. bin Hisham, al-Walid bin 'Utbah, shafwan, and Ubay bin Khalaf, like that in His words: And when you mention only your Lord in the Qur'an, they turn back and run away (because of hatred).(al-Isra'\/17: 46) In the tafsir of Ruh al-Ma'ani, al- Alusi said, \"We often encounter people nowadays whose characteristics resemble those of the polytheists mentioned in this verse, who like to ask for help from people who have died, and love to remember and reveal the exaggerated history of their lives. , which goes in tune with their passions. They greatly exalted the people they worshiped. Their hearts become irritated if only the name of Allah is mentioned or it is said that only Allah has the right to be truly worshiped, and only Allah can be asked for His help.\""
		   },
		   {
			"id": 4104,
			"surah": 39,
			"ayat": 46,
			"tafsir": "In this verse, Allah taught His prophet to say the following sentences to strengthen faith and ask for additional taufik and His guidance, \"O Allah, Creator of the heavens and the earth, Who knows the things that are unseen and real, You decide all the disputes between Your servants about what they always dispute. You are the one who will give the decision on the Day of Resurrection which of us is right and who is wrong, who is guided and who is astray. wake up for the night prayer: \"O Allah, Lord of Gabriel, Mikail, and Israfil, Creator of the heavens and the earth, the All-Knower of all things unseen and real. You decide matters among Your servants in matters that they dispute. Guide me to the truth that is disputed with (the basis of) Your permission. Truly You point whom You will to the straight path. (History of Muslim, Abu Dawud, and al-Baihaqi)"
		   },
		   {
			"id": 4105,
			"surah": 39,
			"ayat": 47,
			"tafsir": "In this verse, Allah explains that if the unjust polytheists had all the wealth that is on earth and added that much, they would have redeemed themselves with that wealth for the terrible and terrible punishment that would befall them on the Day of Resurrection. . Threats like this have also been mentioned in surahh ali 'Imran. It seems clear to them the punishment from Allah that they have never thought about its existence and its awesomeness. The polytheists if they practice something they consider it a good thing, even though in essence what they do is a bad thing."
		   },
		   {
			"id": 4106,
			"surah": 39,
			"ayat": 48,
			"tafsir": "It seems clear to them, when books are offered to them that contain records of their deeds while living in the world, all their bad deeds are listed there. They believe that these violations will be accounted for and accounted for one by one. As a result, they will receive a painful punishment that covers all corners, all of which are because they always make fun of the teachings of Allah's religion."
		   },
		   {
			"id": 4107,
			"surah": 39,
			"ayat": 49,
			"tafsir": "This verse describes the strange condition of the polytheists. If harm befalls such as poverty and disease, they immediately seek protection and pray to Allah. But when circumstances have changed, such as recovering from illness, receiving favors, and expanding their fortune, they forget about the period of suffering and say that all of this is due to their own merit, skills, intelligence, and experience. That's their very strange attitude. When experiencing suffering, they run screaming for help to Allah. After the situation turned into pleasure and enjoyment, they cut ties with their Creator and stated that all the improvements in fate were due to their own intelligence and skills. They do not know that actually the good and bad luck that Allah has given them is a test to find out who is grateful for the blessings that Allah has given and who is scornful of them. Those who are grateful will be rewarded with other favors, while those who deny them will be subject to a painful punishment."
		   },
		   {
			"id": 4108,
			"surah": 39,
			"ayat": 50,
			"tafsir": "In this verse, Allah explains that people like this have also heard statements before them, so that such an assumption is not a new one. Everything they tried before was useless in resisting the coming of punishment from Allah because they always belied and mocked the coming of Allah's messenger."
		   },
		   {
			"id": 4109,
			"surah": 39,
			"ayat": 51,
			"tafsir": "This verse explains that they were overwritten by the bad consequences of what they did. Allah accelerates the coming of their doom like Karun which is swallowed up by the earth, the thunder that strikes the people of Lut, and the eternal calamity that will befall them in the hereafter. Those who are unjust among them will be afflicted with bad consequences from their efforts, including those polytheists who always oppose the Prophet Muhammad. They will surely be punished as a bad result of their disbelief like the punishment that was inflicted on the former people. Among the examples of doom is the famine that hit them for seven years, their leaders were killed and taken prisoner during the Battle of Badr. They also will not be able to escape and escape Allah's punishment on the Day of Resurrection."
		   },
		   {
			"id": 4110,
			"surah": 39,
			"ayat": 52,
			"tafsir": "In this verse, Allah shows proof of His power, majesty and wisdom. The polytheists do not know that it is Allah who extends sustenance to whom He wills and narrows for whom He wills. It is an undeniable fact that human beings differ in terms of their possessions and wealth, some are very rich and some are very poor. Such things cannot be associated only with intelligence or skill. Sometimes those with higher education live in poverty, while those with low education live in abundance. Indeed, in that incident there are signs of Allah's power for the believers. They know that everything is arranged by God. There is nothing in this life that is outside of His rule"
		   },
		   {
			"id": 4111,
			"surah": 39,
			"ayat": 53,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to convey to his people that Allah, the Most Forgiving, Most Merciful and very broad in His mercy and compassion for His faithful servants, will forgive all the sins they have already done, such as leaving the commandments Him or do His prohibitions if they really repent of their mistakes. Many people think that because their sins have piled up, God will no longer forgive them. Be he who despairs of His forgiveness, mercy, and compassion. The world has become dark in his eyes because so far he has not heeded the teachings of his religion and has always turned his back on the instructions contained therein. His heart was full of filth and lawlessness, and he could no longer see the path of truth and goodness that he would follow. He has been confused by a sense of hopelessness and there is no hope that seems to him to return from the misguidance and disobedience that he has always done. But Allah, even though the sins of His servants are great, He still loves and supports them and forbids them to despair of His mercy and compassion, He still views them as His servants who are entitled to receive His love when they realize their mistakes and ask for forgiveness. to her. Let alone those who believe, even for polytheists the door of repentance is still open if they convert to Islam and believe in Allah and His Messenger. It was narrated by Imam al-Bukhari from Sa'id bin Jubair from Ibn 'Abbas that many polytheists who had committed murders and often committed adultery came to the Prophet Muhammad. They said to him, \"Indeed what you call on us is good. Can you explain to us that what we did before that He will forgive.\" The Prophet replied by reciting the word of Allah: And those who do not associate partners with Allah with other gods and do not kill those whom Allah has made unlawful except for the right (reasons), and do not commit adultery; and whoever does this, surely he will receive a severe punishment, (namely) the punishment will be multiplied for him on the Day of Judgment and he will remain in that punishment, in humiliation, except for those who repent and believe and do good; then God replaced their evil with good. Allah is Forgiving, Most Merciful. (al-Furqan\/25: 68-70) In the hadith of the Prophet saw it is also explained: It was narrated from 'Amr bin 'Anbasah that an old man who had come to meet the Prophet had come to lean on his cane and said to him, \"O Messenger of Allah, I do a lot of mistakes and immorality. Is it possible that mistakes can be forgiven?\" The Prophet replied, \"Have you acknowledged that there is no god but Allah?\" The old man replied, \"Yes, even I admit that you are the messenger of God.\" Rasulullah saw emphasized, Allah forgives all the mistakes and immorality that you have done.\" will not return to making mistakes, and will continue to do good deeds. Servants of Allah must not despair of His forgiveness, mercy, and compassion, because the door of His grace is wide open for those who repent, as confirmed in His word : And whoever commits evil and wrongs himself, then he asks Allah's forgiveness, surely he will get Allah, Most Forgiving, Most Merciful.(an-Nisa'\/4: 110) After forbidding His servants to despair of mercy and compassion Allah, Allah encourages His servants to immediately ask forgiveness and repent to Him for all the mistakes and mistakes that have been committed. a forgives all sins except the sin of shirk as mentioned in His word: Indeed, Allah will not forgive (sins) for associating partners with Him (shirk), and He forgives what (sins) are other than (shirk) for whom He wills. Whoever associates partners with Allah, then indeed, he has committed a great sin. (an-Nisa'\/4: 48) Indeed, God's mercy is great and wide for His servants. Servants who have disobeyed because they ignored His commands, violated the laws that He has established, and wallowed in sin and immorality, are still being called as His servants and advised not to despair of His forgiveness and mercy."
		   },
		   {
			"id": 4112,
			"surah": 39,
			"ayat": 54,
			"tafsir": "For those who accept this call by repenting to Allah and believing with all their hearts in the extent of His mercy and forgiveness, Allah orders them to truly return to the straight path that He has spread, surrender to Him, and shelter under his protection. With Allah, there are various kinds of gifts and favors that will be bestowed on him, if he has realized and returned to being a servant who is glorified by Him. Every sinner should take this good opportunity immediately before the Day of Judgment comes where repentance and remorse will no longer be accepted. Don't let this good opportunity pass you by because the one who will lose is the one who doesn't heed it. In another verse, Allah says: Has not the time come for those who believe, to solemnly remember Allah and adhere to the truth that has been revealed (to them), and let them not (act) like those who have received the book before that, then they go through such a long period that their hearts become hard. And many of them became wicked people. (al-hadid\/57: 16) The golden opportunity bestowed by Allah should be utilized as well as possible before the decisive moment arrives when the door of repentance has been tightly closed, namely when death has arrived or when the Day of Judgment has come. At that time, no one who was disobedient could escape Allah's punishment and no creature could defend and prevent him from this punishment. Let him really follow and adhere to all the teachings that Allah has explained in the Al-Qur'an al-Karim for the good and happiness of human beings in this world and in the hereafter. Let no one wait until tomorrow to repent because he doesn't know if he will live to tomorrow. Maybe someone promised him that he would repent the next afternoon, but who knows, before evening came he would have died and lost that very precious opportunity. repeated words of regret in various ways"
		   },
		   {
			"id": 4113,
			"surah": 39,
			"ayat": 55,
			"tafsir": "For those who accept this call by repenting to Allah and believing with all their hearts in the extent of His mercy and forgiveness, Allah orders them to truly return to the straight path that He has spread, surrender to Him, and shelter under his protection. With Allah, there are various kinds of gifts and favors that will be bestowed on him, if he has realized and returned to being a servant who is glorified by Him. Every sinner should take this good opportunity immediately before the Day of Judgment comes where repentance and remorse will no longer be accepted. Don't let this good opportunity pass you by because the one who will lose is the one who doesn't heed it. In another verse, Allah says: Has not the time come for those who believe, to solemnly remember Allah and adhere to the truth that has been revealed (to them), and let them not (act) like those who have received the book before that, then they go through such a long period that their hearts become hard. And many of them became wicked people. (al-hadid\/57: 16) The golden opportunity bestowed by Allah should be utilized as well as possible before the decisive moment arrives when the door of repentance has been tightly closed, namely when death has arrived or when the Day of Judgment has come. At that time, no one who was disobedient could escape Allah's punishment and no creature could defend and prevent him from this punishment. Let him really follow and adhere to all the teachings that Allah has explained in the Al-Qur'an al-Karim for the good and happiness of human beings in this world and in the hereafter. Let no one wait until tomorrow to repent because he doesn't know if he will live to tomorrow. Maybe someone promised him that he would repent the next afternoon, but who knows, before evening came he would have died and lost that very precious opportunity. repeated words of regret in various ways"
		   },
		   {
			"id": 4114,
			"surah": 39,
			"ayat": 56,
			"tafsir": "In these verses, Allah explains how the regrets of those who do not take advantage of the golden opportunities that Allah has given them. In the afterlife, they will repeat words of regret in various ways, including: 1. In fact, I am very sorry for my negligence and negligence during my life so that I did not heed Allah's teachings, always disobeyed Him, left my obligations to Him as a servant, and breaking the laws He has established. Why didn't I use the opportunity God gave me to repent and return to the straight path. Why do I always make fun of people who have obeyed and dutifully carried out His instructions and teachings, even including those who insult and take His religion lightly. 2. Why did I not properly accept the instructions He gave through His messengers, and did not practice the instructions of His teachings. If I had accepted and practiced those instructions and teachings, I would have been among those who are pious that the Jannatun Na'im heaven has been prepared for them which is full of favors and pleasures and full of happiness and the pleasure of Allah. 3. When he sees the fires of hell and the various kinds of torments that are inflicted on its inhabitants, and he feels certain that he will be thrown into it, he daydreams and hopes that if he can return to the world so that he can do as many good deeds as possible for the provision in the hereafter so that free from the torments of hell and included in the group of people who do good."
		   },
		   {
			"id": 4115,
			"surah": 39,
			"ayat": 57,
			"tafsir": "In these verses, Allah explains how the regrets of those who do not take advantage of the golden opportunities that Allah has given them. In the afterlife, they will repeat words of regret in various ways, including: 1. In fact, I am very sorry for my negligence and negligence during my life so that I did not heed Allah's teachings, always disobeyed Him, left my obligations to Him as a servant, and breaking the laws He has established. Why didn't I use the opportunity God gave me to repent and return to the straight path. Why do I always make fun of people who have obeyed and dutifully carried out His instructions and teachings, even including those who insult and take His religion lightly. 2. Why did I not properly accept the instructions He gave through His messengers, and did not practice the instructions of His teachings. If I had accepted and practiced those instructions and teachings, I would have been among those who are pious that the Jannatun Na'im heaven has been prepared for them which is full of favors and pleasures and full of happiness and the pleasure of Allah. 3. When he sees the fires of hell and the various kinds of torments that are inflicted on its inhabitants, and he feels certain that he will be thrown into it, he daydreams and hopes that if he can return to the world so that he can do as many good deeds as possible for the provision in the hereafter so that free from the torments of hell and included in the group of people who do good."
		   },
		   {
			"id": 4116,
			"surah": 39,
			"ayat": 58,
			"tafsir": "In these verses, Allah explains how the regrets of those who do not take advantage of the golden opportunities that Allah has given them. In the afterlife, they will repeat words of regret in various ways, including: 1. In fact, I am very sorry for my negligence and negligence during my life so that I did not heed Allah's teachings, always disobeyed Him, left my obligations to Him as a servant, and breaking the laws He has established. Why didn't I use the opportunity God gave me to repent and return to the straight path. Why do I always make fun of people who have obeyed and dutifully carried out His instructions and teachings, even including those who insult and take His religion lightly. 2. Why did I not properly accept the instructions He gave through His messengers, and did not practice the instructions of His teachings. If I had accepted and practiced those instructions and teachings, I would have been among those who are pious that the Jannatun Na'im heaven has been prepared for them which is full of favors and pleasures and full of happiness and the pleasure of Allah. 3. When he sees the fires of hell and the various kinds of torments that are inflicted on its inhabitants, and he feels certain that he will be thrown into it, he daydreams and hopes that if he can return to the world so that he can do as many good deeds as possible for the provision in the hereafter so that free from the torments of hell and included in the group of people who do good."
		   },
		   {
			"id": 4117,
			"surah": 39,
			"ayat": 59,
			"tafsir": "In this verse, Allah reveals to people who have gone astray and do not want to take the opportunity to repent that their fate cannot be avoided anymore because Allah has given enough lessons and warnings. God has also given the opportunity to repent and do good, but all of this is ignored and ignored. They only follow their lust and desires so that they become rebellious, arrogant, and arrogant people. They also belong to the group of disbelievers. All their fantasies and supplications were all rejected and Allah's justice was applied to him, those who did good and were pious were put into heaven and those who were evil and rebellious were put into hell."
		   },
		   {
			"id": 4118,
			"surah": 39,
			"ayat": 60,
			"tafsir": "In this verse, Allah explained to the Prophet Muhammad that later on the Day of Judgment, he would see the faces of the disbelievers turning black because they were so afraid to see and feel how great and terrible the commotion was at that time. Nothing can save them, as if they are surrounded by danger and calamity from all directions. Wherever they ran they were always confronted by things that were so frightening that at that time no human thought except for his own safety from the dangers of death. This is explained in the word of God: On that day man will flee from his brother, and from his mother and father, and from his wife and children. Every one of them that day had some business to occupy him with. ('Abasa\/80: 34-37) And His words: Indeed, we fear (the punishment) of God on the day (when) people with sour faces are full of difficulties. (al-Insan\/76: 10) Besides not seeing anything that can help or prevent them from harm, they also know that they will be dragged into hell because of their rebellion and arrogance while living in this world. They don't want to believe, they always insult and make fun of those who believe, considering them a weak people so they want to follow the teachings of the apostles sent by God. If in this world a person's face turns pale when faced with danger and may turn blue with fear, then on the Day of Judgment the face of the disbeliever will be jet black with panic and extreme fear. Such is the fate of those who will surely be dragged and thrown into the blazing fires of hell. Hadith of the Prophet saw: It was narrated by 'Abdullah bin 'Umar that the Messenger of Allah said (about the fate of arrogant disbelievers), \"On the Day of Resurrection, arrogant people will be gathered as if they were worthless seeds. They will remain in a state of humiliated until they are dragged into the Hellfire.\" (History of A.hmad and at-Tirmidhi)"
		   },
		   {
			"id": 4119,
			"surah": 39,
			"ayat": 61,
			"tafsir": "Then Allah explains the condition of those who believe and fear Allah. On the Day of Resurrection, they will be saved by Allah from the chaos that threatens that day. With Allah's help and good deeds in the world, they can overcome all difficulties and save themselves from all kinds of dangers, until they enter paradise where all kinds of troubles and sorrows end. Their faces were radiant with white because they felt happy and happy as stated in the verse: On that day there were faces that were radiant, laughing and rejoicing. ('Abasa\/80: 38-39)"
		   },
		   {
			"id": 4120,
			"surah": 39,
			"ayat": 62,
			"tafsir": "In these verses, Allah confirms that He is the Creator of everything that exists, both in the heavens and on earth. He is the Creator of the entire universe, nothing else can create other than Him. This is an intrinsic truth that no one can deny. No one can claim that he is the creator of nature, because reason will not accept that someone has the power and authority to create this universe, nor can reason accept that this world happened by itself without a creator. Therefore, surely this nature was created by the Almighty and All-Knowing Substance, that is He Allah. It is Allah who takes care of everything that exists, His knowledge is very broad, covering all of His creatures. He is the one who controls nature from the smallest to the greatest. He controls all of it according to His knowledge, wisdom and wisdom. No creature intervenes in that creation and control. This is what common sense can accept and what human conscience can accept. Even so, there are still many people who deny this fact and say that he is in power, and he is God, as stated by Pharaoh or put forward various theories about this nature to establish that the universe is happening by itself without anyone creating it. . People like this are disbelievers who always deny the evidence of Allah's power both in the heavens and on earth and do not want to use the common sense that Allah has bestowed upon them. They are what Allah says are the people who lose the most both in this world and especially in the hereafter. Some commentators are of the opinion that what is meant by \"Maqalid as-samawati wa al-ardh\" (control of heaven and earth here is the treasury). So, the keys to all the treasures stored in heaven and on earth are in His hands. He is the one who maintains and looks after it. He is the ruler who has the right to distribute to whom He wills. The Messenger of Allah said: It was narrated by Usman ra that when he asked the Messenger of Allah about the word of Allah \"Only for Allah, the maqalid of the heavens and the earth.\" he replied, \"O Usman, you are asking me something that no one has ever asked me before. Maqalid as-samawati wa al-ardh\" is the saying: There is no God but Allah, Allah is Great, Glory be to Allah, all praise be to Allah I ask forgiveness from Allah, who has no god but Him, the Beginning, the End, the Born, the Inner One, gives life, gives death, while He lives and does not die, in His hand is all good, and He has power over all things.\" (History of Abu Ya'la, Ibn Abi Hatim, and Ibn Mardawaih) Whoever brings this speech will receive good in the heavens and on earth."
		   },
		   {
			"id": 4121,
			"surah": 39,
			"ayat": 63,
			"tafsir": "In these verses, Allah confirms that He is the Creator of everything that exists, both in the heavens and on earth. He is the Creator of the entire universe, nothing else can create other than Him. This is an intrinsic truth that no one can deny. No one can claim that he is the creator of nature, because reason will not accept that someone has the power and authority to create this universe, nor can reason accept that this world happened by itself without a creator. Therefore, surely this nature was created by the Almighty and All-Knowing Substance, that is He Allah. It is Allah who takes care of everything that exists, His knowledge is very broad, covering all of His creatures. He is the one who controls nature from the smallest to the greatest. He controls all of it according to His knowledge, wisdom and wisdom. No creature intervenes in that creation and control. This is what common sense can accept and what human conscience can accept. Even so, there are still many people who deny this fact and say that he is in power, and he is God, as stated by Pharaoh or put forward various theories about this nature to establish that the universe is happening by itself without anyone creating it. . People like this are disbelievers who always deny the evidence of Allah's power both in the heavens and on earth and do not want to use the common sense that Allah has bestowed upon them. They are what Allah says are the people who lose the most both in this world and especially in the hereafter. Some commentators are of the opinion that what is meant by \"Maqalid as-samawati wa al-ardh\" (control of heaven and earth here is the treasury). So, the keys to all the treasures stored in heaven and on earth are in His hands. He is the one who maintains and looks after it. He is the ruler who has the right to distribute to whom He wills. The Messenger of Allah said: It was narrated by Usman ra that when he asked the Messenger of Allah about the word of Allah \"Only for Allah, the maqalid of the heavens and the earth.\" he replied, \"O Usman, you are asking me something that no one has ever asked me before. Maqalid as-samawati wa al-ardh\" is the saying: There is no God but Allah, Allah is Great, Glory be to Allah, all praise be to Allah I ask forgiveness from Allah, who has no god but Him, the Beginning, the End, the Born, the Inner One, gives life, gives death, while He lives and does not die, in His hand is all good, and He has power over all things.\" (History of Abu Ya'la, Ibn Abi Hatim, and Ibn Mardawaih) Whoever brings this speech will receive good in the heavens and on earth."
		   },
		   {
			"id": 4122,
			"surah": 39,
			"ayat": 64,
			"tafsir": "It was narrated by Ibn 'Abbas that the Quraysh had offered to the Prophet Muhammad that they would give him a lot of wealth, so that he would become the richest man in Mecca and would marry him with any woman he liked but he had to stop criticizing idols they. The offer was answered by the Prophet, \"Wait until the command comes from my Lord.\" So surahh al-Kafirun\/109 and verse 64 of this surahh az-Zumar came down. In this verse, Allah ordered the Prophet Muhammad to tell the polytheists of Mecca who invited him to worship idols, that the invitation was a very misleading invitation. The Prophet said, \"Is it possible for me to worship other than Allah, O ignorant people? I have witnessed proofs of His oneness and He has guided me. I have believed with all my heart and soul that He is Allah, the One and Only Almighty. Can this determination of mine be negotiable with unreasonable reasons?\" According to Ibn 'Abbas the offer did not end there, they even invited Muhammad to worship idols. Thus they want to worship God besides worshiping idols."
		   },
		   {
			"id": 4123,
			"surah": 39,
			"ayat": 65,
			"tafsir": "In this verse, Allah confirms to the Prophet Muhammad that He has revealed to him and the previous prophets, that if he partners with Allah, then all his past good deeds will be erased. This is a strong warning from Allah to humans not to associate partners with Allah with others, because that act is shirk and the sin of shirk is a sin that Allah will not forgive. If a person dies in a state of shirk, the reward of all his good deeds will be erased and he will be plunged into Hellfire as stated in this verse: Whoever among you apostates from his religion, then he dies in disbelief, then their deeds will be in vain in this world and in the hereafter, and they are the inhabitants of hell, they will abide therein forever. (al-Baqarah\/2: 217) To the Prophet Muhammad himself, Allah gave a warning while he was a messenger sent by Him. His favorite Apostle who could not possibly associate with Him. Nevertheless, Allah also warned him not to ever cross his mind to embrace the religion of shirk. Especially for other humans, of course this warning must receive serious attention. It is really inappropriate for someone who knows how great Allah's favors are on him, on all mankind, to deny that favor and violate the order of the giver of that favor by associating partners with Him, by asking for help from idols, graves, trees, and so on. Allah then emphasized His commandment by issuing another commandment, namely that only Allah must be worshiped, only to Him humans must offer all their acts of worship, and to Allah also humans pray and give thanks because He is the true giver of favors, as read every Muslim in prayer: Verily my prayer, my worship, my life and my death are for Allah, the Lord of all the worlds. (al-An'am\/6: 162)"
		   },
		   {
			"id": 4124,
			"surah": 39,
			"ayat": 66,
			"tafsir": "In this verse, Allah confirms to the Prophet Muhammad that He has revealed to him and the previous prophets, that if he partners with Allah, then all his past good deeds will be erased. This is a strong warning from Allah to humans not to associate partners with Allah with others, because that act is shirk and the sin of shirk is a sin that Allah will not forgive. If a person dies in a state of shirk, the reward of all his good deeds will be erased and he will be plunged into Hellfire as stated in this verse: Whoever among you apostates from his religion, then he dies in disbelief, then their deeds will be in vain in this world and in the hereafter, and they are the inhabitants of hell, they will abide therein forever. (al-Baqarah\/2: 217) To the Prophet Muhammad himself, Allah gave a warning while he was a messenger sent by Him. His favorite Apostle who could not possibly associate with Him. Nevertheless, Allah also warned him not to ever cross his mind to embrace the religion of shirk. Especially for other humans, of course this warning must receive serious attention. It is really inappropriate for someone who knows how great Allah's favors are on him, on all mankind, to deny that favor and violate the order of the giver of that favor by associating partners with Him, by asking for help from idols, graves, trees, and so on. Allah then emphasized His commandment by issuing another commandment, namely that only Allah must be worshiped, only to Him humans must offer all their acts of worship, and to Allah also humans pray and give thanks because He is the true giver of favors, as read every Muslim in prayer: Verily my prayer, my worship, my life and my death are for Allah, the Lord of all the worlds. (al-An'am\/6: 162)"
		   },
		   {
			"id": 4125,
			"surah": 39,
			"ayat": 67,
			"tafsir": "In this verse, Allah denounces the actions of the polytheists of Mecca for worshiping idols and statues, denying His greatness and power. Allah also reminds them of how great the blessings He has bestowed upon them. It is as if the powerful and bestowing gifts are the helpless statues they have made with their own hands. How low is their way of thinking by glorifying something that is despicable and helpless. Allah further confirms that the earth is entirely in His hands on the Day of Judgment, and likewise the heavens will be rolled up in His right hand. If the heavens and the earth are all in His hands, then who else is greater, greater, more powerful than God? Do they magnify the statues when the statues are only a small part of the heavens and the earth? Regarding this verse, Imam al-Bukhari narrated from Ibn Mas'ud a hadith: One of the priests came to the Messenger of Allah and said to him, \"O Muhammad, I actually found (in our book) that Allah the Almighty placed the sky in one of finger, the earth on another finger, trees on another finger, water and earth on another finger, and other creatures on another finger, then He said, 'I am the king. The Messenger of Allah laughed at the priest's words so that his molars showed a sign of agreement. Then the Holy Prophet read this verse 67. Regarding the depiction of the heavens and the earth in His hands, perhaps it can be understood with the meaning that this world is in His power. We don't know what the real nature of the earth's condition is in God's hands. This includes unseen matters, which must be accepted as explained by Allah. What must be fully believed is that God cannot be likened to anything. God's Word: There is nothing like Him. And He is All-Hearing, All-Seeing. (asy-Shura\/42: 11) Then Allah closes this verse by stating that associating partners with Allah with other creatures especially with something trivial and helpless like statues is a misguided and misleading act. Glory be to Allah from all these understandings and not worthy of His power and majesty to be associated with others."
		   },
		   {
			"id": 4126,
			"surah": 39,
			"ayat": 68,
			"tafsir": "In this verse, Allah explains that later on the Day of Judgment there will be two trumpet blasts. In the first blast, all living beings, both in heaven and on earth, will die. Because of the enormity of the blasting sound, all living things became paralyzed and eventually died like someone who was hit by a lightning strike or a high-voltage electric shock. There were Allah's creatures who did not die at that time because Allah did not want their death, but who they were is not mentioned in the Qur'an, as well as in authentic hadiths. Therefore, we just leave the knowledge of this to Allah. Maybe He didn't mention His creatures that don't die because of some reason or wisdom that we don't know the essence of. However, according to a history from Abu Ya'la al-Maushuli, the creatures that do not die are the Angels Jibril, Mikail, and Izrail. After that, the creatures died one by one. After that first blast, in which nearly all living things died, followed by the second trumpet blast. With this second blast, all creatures that have died, both those who died before the first blow and those who died during the blow, come alive again. Each stood waiting to see what would happen to him. There are several hadiths regarding this trumpet blowing, including: 1. Hadith narrated by Abu Dawud. from Abu Sa'id al-Khudri namely: Rasulullah once mentioned about the one who blew the trumpet and said, \"On his right is Gabriel and on his left is Mikail.\" 2. The hadith narrated by Ibn Majah al-Bazzar and Ibn Mardawaih from Abu Sa'id al-Khudri namely: In fact, in the hands of the two trumpeters there are two horns that they will blow. The two of them always kept an eye on their surroundings, and whenever the two of them were ordered around. In addition, in the Qur'an the trumpet blast is called az-Zajrah, as mentioned in the verse: So the resurrection is only with one shout; then immediately they saw it. (ash-shaffat\/37: 19) And in the verse: Then the return is only with one blow. So instantly they came back to life on the (new) earth. (an-Nazi'at\/79: 13-14) In other verses it is also mentioned as \"dakwah\" (call), as in the verse: And among His signs (greatness) is the standing of the heavens and the earth with his will. Then if He calls you one call from the earth, immediately you come out (from the grave). (ar-Rum\/30: 25)"
		   },
		   {
			"id": 4127,
			"surah": 39,
			"ayat": 69,
			"tafsir": "After all that happened, the Padang Mahsyar earth shone brilliantly bathed in God's light because God's justice was upheld, and all the good and bad deeds were weighed, placed in front of each of their deeds, as stated in the verse: And We have chained every human being ( note) his deeds around his neck. And on the Day of Resurrection We will bring out for him an open Book. (al-Isra'\/17: 13) And in the verse: And put the book (record of charity), then you will see the sinners fear what is (written) in it, and they say, \"How woeful for us, the book what is this, nothing is left behind, the small and the large but everything is recorded,\" and they find (all) what they have done (written). And your Lord does not wrong anyone. (al-Kahf\/18: 49) Also presented by the prophets to be witnesses of the deeds of their people. This is also explained in another verse: And what (the situation of the disbelievers will be), if We bring a witness (Rasul) from every nation and We bring you (Muhammad) as a witness over them. (an-Nisa'\/4: 41) Besides the prophets as witnesses, other witnesses were presented, namely angels who recorded all their deeds. This is stated in the verse: Everyone will come with a companion (angel) and a witness (angel). (Qaf\/50: 21) Apart from the book of charitable records and trusted witnesses, there are also witnesses who consist of the body's own limbs such as the feet and hands. All the members of the body will tell later what they have done, as mentioned in the verse: On the day, (when) their tongues, their hands and their feet bear witness against them for what they used to do. (an-Nur\/24: 24) You can imagine how great God's trial was at that time. A court that can decide every case and convict people with the fairest decision possible so that no one is harmed or abused because of it. The highest trial which is quite complete with reliable witnesses whose truth cannot be disputed because each witness mutually supports the testimony of other witnesses. It is at that moment that the fate of every person is decided and determined based on the truth and it is absolutely impossible that a decision would be contrary to justice and could harm or cause someone to be mistreated. This is found in the verse: And We will set the right scales on the Day of Resurrection, so no one will be harmed even a little; even if it is only the weight of a mustard seed, We will certainly bring it (reward). And it is sufficient for Us to make calculations. (al-Anbiya'\/21: 47)"
		   },
		   {
			"id": 4128,
			"surah": 39,
			"ayat": 70,
			"tafsir": "After going through the scales that weigh the fairest, then given a reply to each charity in full, the good ones are rewarded multiplied and the bad ones in proportion. No one protested the verdict and reply. Rejoice those who believe and do a lot of good deeds and wreak havoc and regret the disbelievers who during their lives in the world were always arrogant and arrogant and committed many sins and disobedience. In fact, there is no need for a very thorough and precise procedure and irrefutable witnesses, because all the deeds of Allah's servants are in the knowledge of Allah, the Most Extensive, and He is the absolute authority on that day. He can treat His servants according to His will without any proof of someone's guilt, but Allah, the All-Wise, wills that all the decisions that He determines can be seen by His servants at that time, all based on irrefutable evidence."
		   },
		   {
			"id": 4129,
			"surah": 39,
			"ayat": 71,
			"tafsir": "In this verse, Allah explains that disbelievers who associate partners with Allah with others such as idols and other idols are herded into hell in a rough way. They were herded in groups by prioritizing the group that was the most misguided and lawless, then followed by the group with the lower level of rebellion and so on. Every one of the groups arrived at hell, the doors of hell were opened and they were pushed so hard that they fell into it. This is clearly illustrated in the following verse: Woe on that day to those who deny. Those who play in falsehood (sinful acts), on that day (when) they will be pushed into Hell with all their might. (It was said to them), \"This is the hell that you used to deny.\" (ath-thur\/52: 11-14) The gates of hell will be closed after all have entered it in the verse: Verily, the fire is sealed over (themselves), (while they are) tied to long poles. (al-Humazah\/104: 8-9) They were rebuked, reviled, and humiliated by the angels who held the keys to hell by saying had they not come to them Allah's apostles from among themselves who called to obey and obey Allah, and not associate partners with others? His with another. The apostle also reads to them the verses of Allah which prove the truth of his message with strong and clear evidence and explanations so that they cannot be refuted? Why did they reject his call with arrogance and arrogance? They cannot answer that question because they have already faced the fact that they will go to hell. They admit frankly that they are guilty of belittling Allah's Apostle because they are driven by lust, fear of losing influence, position, and so on. Such an acknowledgment is found in the following verse: Every time a group (unbelievers) are thrown into it, the guards (of hell) ask them, \"Has no one ever come to warn you (in the world)?\" They replied, \"Yes, indeed, a warner has come to us, but we deny (it) and we say, \"Allah did not send down anything, you are actually in great error.\" (al-Mulk \/ 67: 8 -9)"
		   },
		   {
			"id": 4130,
			"surah": 39,
			"ayat": 72,
			"tafsir": "With this acknowledgment of their mistake, the angel ordered them to enter Hell. They will remain in it forever, no one can get out even for a moment, because hell is a proper place for the residence of those who are arrogant and arrogant. Hell is the worst place full of torment and suffering."
		   },
		   {
			"id": 4131,
			"surah": 39,
			"ayat": 73,
			"tafsir": "In this verse it is explained that believers who are pious with great respect are led to Jannatun Na'im heaven. They found the door wide open and there were waiting for the gatekeepers with great respect and wisdom while saying to them 'Assalamu' alaikum\". prepared for them in this paradise. Then they are respectfully invited to enter heaven immediately and it is said to them, \"You will remain in it forever and ever.\" The believers came in groups. The first group was the closest people to Allah and have the highest rank in His sight according to their faith, piety and good deeds in this world. The second group is people who are lower in rank than the first group. And so on until all the Muslims enter it. The door heaven is open for them as it is also mentioned in another verse: This is an honor (for them). And sun ugh, for those who fear Allah (provided) the best place to return, (namely) Paradise 'Adn whose doors are open for them. (shad\/38: 49-50) In that paradise they will get various kinds of pleasures and pleasures that no one in this world has ever thought of. Such favors and gifts can be achieved by various kinds of charity and worship performed by humans during their life in the world. Explained by the hadith narrated by al-Bukhari and Muslim from Umar bin Khaththab that the Messenger of Allah once said Which of you who performs ablution perfectly then he says, \"I bear witness that there is no god but Allah, and indeed Muhammad is the servant and messenger of Allah, surely Allah will eight gates of heaven were opened for him and he was allowed to enter from whichever door he liked. (Muslim history and others) It was also narrated from Abu Hurairah that the Messenger of Allah once said: The first group to enter paradise will have faces like the full moon (on the fourteenth night). The next entourage had bright faces like the most brilliant stars in the firmament (the morning star). (Al-Bukhari and Muslim) Al-Bukhari and Muslim also narrated from Sahal bin Sa'ad that the Messenger of Allah said: In that heaven there are eight doors, one of the doors is named ar-Rayyan. That door is only entered by people who are fasting.\""
		   },
		   {
			"id": 4132,
			"surah": 39,
			"ayat": 74,
			"tafsir": "The believers who were very happy and delighted to see the pleasures and pleasures they would enjoy in heaven said, \"Praise be to Allah who has fulfilled His promise to us, as His Messenger has conveyed and the prayers we always pray.\" Allah's Word: Allah promises the believers, men and women, (will get) paradise beneath which rivers flow, they will abide therein, and (get) a good place in heaven 'Adn. And Allah's pleasure is greater. That's a great victory. (at-Taubah\/9: 72) And the word of Allah: O our Lord, give us what You have promised us through Your messengers. And do not humiliate us on the Day of Resurrection. Truly, You never break a promise. (ali 'Imran\/3: 194 Experts of heaven continued their thanksgiving, \"Praise be to Allah who has bequeathed to us this sign of heaven so that we may occupy it, wherever we please and enjoy the various kinds of gifts He has provided in it. \" Among the pleasures of heaven are as explained in the word of Allah as follows: And their shade (trees) is close over them and it is made easy for them to pick (fruits). And they are circulated vessels of silver and cups that are clear as crystal. (al-Insan\/76: 14-15) And there they are given a glass of drink mixed with ginger. (which comes from) a spring (in heaven) called Salsabil. (al-Insan\/76: 17- 18) And they are surrounded by youths who are still young. When you look at them, you will think they are pearls scattered. And when you see (the conditions) there (heaven), you will surely see various kinds of pleasures and great kingdoms. (al -Insan\/76: 19-20) (75) In this verse, Allah explains to the Prophet Muhammad how the atmosphere in the afterlife will be and the beautiful and amazing sights where the angels surround the 'Throne praising Allah, ready to carry out the orders that will be sent down to they. The hum of their prayer beads was heard around the Throne. Among them there are those who are in charge of carrying the Throne as mentioned in the verse: And the angels are in various parts of the sky. On that day eight angels uphold the 'Arsh (throne) of your Lord above them (heads). (al-haqqah\/69: 17) They stand in regular rows as explained in the verse: On the day when the spirits and angels stand in rows, they do not speak, except those who have been given permission to them by God The Most Merciful and he only speaks the truth. (an-Naba'\/78: 38) On that day Allah will judge His servants fairly and correctly. The prayer beads were heard simultaneously, \"Praise be to Allah, the Lord of the worlds.\" God who created the heavens and the earth, who created humans to be caliphs on earth, gave him guidance and guidance. He who makes the torment and punishment of hell for those who disobey Him, and promises gifts and favors to those who carry out His commands obediently and obediently. He is also the one who turns off all of His creatures on the Day of Judgment and revives them to receive the reward for their deeds and then holds a trial to account for all the deeds of His servants fairly, correctly and wisely and then rewards all of His creatures. The disobedient are put into hell and the believers and pious are put into heaven according to His promise. All praise goes to Allah for all His deeds, His justice and His mercy."
		   },
		   {
			"id": 4133,
			"surah": 39,
			"ayat": 75,
			"tafsir": "In this verse, Allah explained to the Prophet Muhammad how the atmosphere in the afterlife would be and the beautiful and amazing sights where the angels surrounded the 'Throne praising Allah, ready to carry out the orders that would be sent down to them. The hum of their prayer beads was heard around the Throne. Among them there are those who are in charge of carrying the Throne as mentioned in the verse: And the angels are in various parts of the sky. On that day eight angels uphold the 'Arsh (throne) of your Lord above them (heads). (al-haqqah\/69: 17) They stand in regular rows as explained in the verse: On the day when the spirits and angels stand in rows, they do not speak, except those who have been given permission to them by God The Most Merciful and he only speaks the truth. (an-Naba'\/78: 38) On that day Allah will judge His servants fairly and correctly. The prayer beads were heard simultaneously, \"Praise be to Allah, the Lord of the worlds.\" God who created the heavens and the earth, who created humans to be caliphs on earth, gave him guidance and guidance. He who makes the torment and punishment of hell for those who disobey Him, and promises gifts and favors to those who carry out His commands obediently and obediently. He is also the one who turns off all of His creatures on the Day of Judgment and revives them to receive the reward for their deeds and then holds a trial to account for all the deeds of His servants fairly, correctly and wisely and then rewards all of His creatures. The disobedient are put into hell and the believers and pious are put into heaven according to His promise. All praise goes to Allah for all His deeds, His justice and His mercy."
		   }
	]
}
