{
	"tafseer": [
		{
			"id": 5151,
			"surah": 60,
			"ayat": 1,
			"tafsir": "This verse warns Muslims not to have an affectionate relationship with polytheists who are enemies of Allah and Muslims. Because, with such a relationship, they unknowingly revealed the secrets of the Muslims, conveyed something that the Prophet would carry out to them in an effort to uphold God's word. Therefore, Muslims are prohibited from doing this even to their relatives. Making infidels who are enemies of the Muslims as loyal friends and helpers is something that is prohibited. This should not be done as long as the infidels want to destroy Islam and the Muslims. Allah then explained the reasons for the prohibition on making disbelievers as loyal friends, namely: 1. They denied and did not justify everything that the Prophet brought. They disbelieve in Allah, His Messenger, and the Qur'an. Is it possible for such a person to be a helper and a loyal friend? Then convey to them the secrets that are beneficial to them and pose a danger to the Muslims? 2. They have expelled the Prophet Muhammad and the Muhajirin from their hometown because they believe in Allah, not for any other reason. This verse has the same meaning as the word of Allah: And they torture the believers just because (the believers) believe in Allah, the Mighty, the Most Praised (al-Buruj\/85: 8) And Allah's Word: (That is) people -people who were expelled from their hometowns without good reason, just because they said, \"Our God is Allah.\" If Allah had not repelled some people with others, Christian monasteries, churches, Jewish houses of worship and mosques, in which the name of Allah is often mentioned, would have been torn down. Allah will surely help those who help His (religion). Indeed, Allah is Mighty, Mighty (al-hajj\/22: 40) Allah warns Muslims that if they leave their hometown or are expelled because of jihad in the way of Allah and seek His pleasure, then do not ever make those disbelievers as their loyal friend and helper. It is enough for the Muslims to suffer the consequences of their actions, and never give them the opportunity to add to the suffering of the Muslims. How could any of the Muslims do as did the hathib who conveyed to the disbelievers the steps that the Prophet would take in dealing with the disbelievers? Allah knows everything that is done by His servants. Therefore, He conveyed this to the Prophet, so that he could immediately take action. Thus, the Muslims are not harmed. At the end of this verse it is emphasized that whoever has mercy on the enemies of Islam and makes them helpers means that he has deviated from the straight path."
		   },
		   {
			"id": 5152,
			"surah": 60,
			"ayat": 2,
			"tafsir": "This verse explains other reasons why Allah forbids Muslims to be close friends and help each other with infidels, namely: 1. If one day they catch or beat Muslims, they will definitely commit unexpected injustices. They are friends with the Muslims solely for the benefit of themselves and their group. If there is no expected profit, they will distance themselves, and will even destroy the Muslims. 2. They always try to vilify and antagonize the Muslims. How could one or some of the Muslims reveal their secrets or be close friends with them? People who can be friends are only people who want good for us, not the other way around. 3. They expect the Muslims to deny the truth and disbelieve in Allah, so that the Muslims are the same as them, that is, they are both disbelievers. Therefore, they only want to be close friends or help the Muslims as long as it fulfills their wishes."
		   },
		   {
			"id": 5153,
			"surah": 60,
			"ayat": 3,
			"tafsir": "On the Day of Judgment everyone will be accountable to Allah for themselves. Even close relatives, loyal friends, children, or parents cannot help someone on the Day of Judgment. The only thing that can help a person from Allah's punishment is faith and good deeds done while living in the world. Relatives, loyal friends, children and parents cannot be used as helpers on the Day of Judgment because each of them tries to avoid the calamity that will befall them, so they do not have time to think about their relatives or friends, as Allah says: deafening (second trumpet blast), On that day man flees from his brother, And from his mother and father, And from his wife and children. Every one of them that day had some business to occupy him with. ('Abasa\/80: 33-37) At the end of this verse, Allah gives a warning that He is All-Knowing of everything that humans do, nothing escapes His knowledge. Therefore, He will give the fairest reward. So be careful and take care of yourself as best you can."
		   },
		   {
			"id": 5154,
			"surah": 60,
			"ayat": 4,
			"tafsir": "Allah ordered the Muslims to follow the example of Prophet Abraham and those who believed along with him, when he said to his people who disbelieved and worshiped idols, \"O my people, verily we are free from all of you, and from what you worship besides Allah.\" Then it was explained that what Abraham meant by being freed was: 1. Prophet Abraham denied his people, ignored their gods, and did not justify the actions of those who worshiped statues that could not benefit or harm anyone. Allah said: O people! An analogy has been made. So listen up! Verily, whatever you call other than Allah could not create even a single fly, even though they united to create it. And if the fly takes something from them, they can't get it back from the fly. As weak as those who worship and those who are worshiped. (al-hajj\/22: 73) 2. Prophet Ibrahim said that between him and his people who deny there has been enmity and hatred for each other forever. Ibrahim stated that he would continue to oppose his people until they left their shirk. If they have faith, the enmity will only end. Against his father who was still an infidel, he did not take a firm stance like his attitude towards his people. He promised to pray that God would forgive his father's sins. In this case, Allah forbade Muslims to follow the example of Abraham, even though he eventually gave up on his father, after it became clear to him that his father's disobedience. It is true that some of the believers pray for their fathers who die in polytheism. They reasoned by imitating Abraham's actions. So Allah disproved their actions: It is inappropriate for the Prophet and those who believe to ask forgiveness (of Allah) for the polytheists, even if those people are (his) relatives, after it is clear to them, that the polytheists are inhabitants of hell. As for Abraham's request for forgiveness (to Allah) for his father, it was nothing but because of a promise he had made to his father. So when it became clear to Ibrahim that his father was an enemy of Allah, Abraham separated himself from him. Truly, Ibrahim was a very meek and forbearing man. (at-Taubah\/9: 113-114) Furthermore, Prophet Ibrahim said to his father that he was unable to help him. He can only pray that Allah will give him taufik in the form of faith."
		   },
		   {
			"id": 5155,
			"surah": 60,
			"ayat": 5,
			"tafsir": "Before Prophet Ibrahim parted ways with his people who did not want to accept his call, he prayed to Allah with a submissive heart and surrendered to Him. In his prayer he said, \"O our Lord, do not make us (targets) slander for the disbelievers.\" In other words, the meaning of this verse is that Prophet Abraham begged Allah not to win the disbelievers over the believers. That would give the unbeliever the opportunity to slander the believer. This victory can also lead to the belief in disbelievers that they are on the right path while the believers are on the wrong path. At the end of the verse, Prophet Ibrahim prayed, \"O our Lord, forgive and pardon our sins so that it is as if we had never done those sins. You are our place of refuge. Your requirements are very strict. You do and create everything according to nature. , uses, and benefits."
		   },
		   {
			"id": 5156,
			"surah": 60,
			"ayat": 6,
			"tafsir": "This verse repeats the command to make the Prophet Abraham and those who believe along with him as a good role model with the intention that the order is heeded by those who believe. This is especially intended for people who believe they will meet Allah in the hereafter, and hope for rewards and rewards from heaven as a place of pleasure. Those who do not follow Allah's commandments, and do not follow the examples of pious people, let them know that Allah does not need them in the slightest. Allah is Praiseworthy in the heavens and on earth, and He does not need the help of His creatures in carrying out His will. Allah said: And Musa said, \"If you and those who are on earth all deny (the favors of Allah), then indeed Allah is Rich, Most Praised. (Ibrahim\/14: 8)"
		   },
		   {
			"id": 5157,
			"surah": 60,
			"ayat": 7,
			"tafsir": "According to al-Hasan al-Basri and Abu Salih, this verse was revealed in connection with Khuza'ah, Bani al-Harith bin Ka'ab, Kinanah, Khuzaimah, and other Arab tribes. They asked for peace with the Muslims by pledging not to fight against the Muslims and not to help their enemies. So this verse came down which ordered the Muslims to accept their enmity. This verse states to the Prophet and those who believe that hopefully Allah will establish a sense of love and compassion between the Muslims in Medina and the polytheists of Mecca who have hated and been their enemies. That is easy for Allah, as the Almighty Substance and determines everything. Moreover, if the disbelievers want to believe in Allah and His Messenger, then Allah will forgive the sins they have committed before, namely the sin of being against the Prophet and the Muslims. The sign contained in this verse is proven to be true in the liberation of the city of Mecca by the Muslims, without bloodshed. When the Prophet entered the city of Mecca, because the polytheists violated their agreement with the Muslims, they were afraid to face the Muslim army, and hid in their homes. Therefore, the Messenger of Allah announced that whoever enters Baitullah, then he gets security, whoever enters the Grand Mosque, then he gets security, and whoever enters Abu Sufyan's house, he gets security. The polytheists obeyed this order and they took refuge in the Kaaba, the Grand Mosque and Abu Sufyan's house. So at that time, the Muslims who had migrated with the Prophet to Medina were reunited with their families who were still polytheists and still lived in Mecca, after several years they were separated. Then re-establish good relations and affection between them. Because of the good attitude of the Muslims towards them, they embraced Islam in droves. Allah's Word: When Allah's help and victory has come, and you see people flocking to Allah's religion. So glorify your Lord and ask His forgiveness. Truly, He is the Acceptor of repentance. (an-Nasr\/110:1-3)"
		   },
		   {
			"id": 5158,
			"surah": 60,
			"ayat": 8,
			"tafsir": "It was narrated that Ahmad bin Hanbal told several other imams from 'Abdullah bin Zubair, he said, \"Has come to Medina (from Mecca) Qutailah bint 'Abdul 'Uzza, the former wife of Abu Bakr before converting to Islam, to meet his daughter Asma 'bint Abu Bakr brought various gifts. Asma' was reluctant to accept the gift and did not allow her mother to enter her house. Then Asma' sent someone to 'Aisyah to ask the Messenger of Allah about it. So this verse was revealed which allowed Asma' to accept gifts and allowed her mother who was a disbeliever stay in his house. Allah does not forbid believers from doing good, establishing brotherly relations, helping and helping polytheists as long as they do not have the intention of destroying Islam and the Muslims, do not expel Muslims from countries them, nor are they close friends with the person who wants to expel them.This verse provides general provisions and principles Islam in establishing relations with non-Muslims in one country. Muslims are required to behave well and associate with unbelievers, as long as they behave and want to get along well, especially with Muslims. If in the history of Islam, especially during the time of the Prophet Muhammad and the time of his companions, there were acts of violence committed by Muslims against polytheists, then these actions were solely carried out to defend themselves from tyranny and torture committed by polytheists. In Mecca, the Prophet and his companions were tortured and abused by polytheists, until they were forced to move to Medina. Arriving in Medina, they were also hostile to the Jews who allied themselves with the polytheists, even though a peace treaty had been made between them and the Prophet. Therefore, the Prophet was forced to take harsh measures against them. Likewise, when the Muslims faced the Persian and Roman empires, the infidels there had provoked hostilities so that war broke out. So there is one principle that needs to be kept in mind in the relationship between Muslims and non-believers, that is, it is permissible to have good relations, as long as non-Muslims do the same. This can only be proven in the attitudes and actions of both parties. In Indonesia this principle can be implemented, as long as no other religious party intends to convert Muslims or destroy Islam and Muslims."
		   },
		   {
			"id": 5159,
			"surah": 60,
			"ayat": 9,
			"tafsir": "In this verse it is explained that Allah only forbids Muslims from helping people who hinder or hinder people from worshiping in the way of Allah, and converts Muslims so that they convert to other religions, who fight, expel, and help expel Muslims from the country. they. With such people, Allah strictly forbids Muslims to be friends with them. At the end of this verse, Allah reminds the Muslims who make their enemies as friends and help them, that if they violate this prohibition, then they are the wrongdoers."
		   },
		   {
			"id": 5160,
			"surah": 60,
			"ayat": 10,
			"tafsir": "This verse explains Allah's command to the Messenger of Allah and believers regarding the attitude that must be taken, if a believing woman who comes from an infidel area comes to face or ask for protection. Allah states that when a woman comes from a disbelieving area who recites the two sentences of creed and does not show signs of avarice and hypocrisy, then she needs to be examined first, whether they really have faith, or they have come because they have run away from their husbands, while she actually does not. have faith. Allah ordered this not because He did not know about their affairs. Allah is All-Knowing of the essence of their faith, even knows everything that is in their hearts. However, for vigilance and precaution among Muslims who are fighting against unbelievers, efforts to carry out research must be carried out, even if the person is a relative. If during the examination it is proven that they are believers, then Muslims should never return them to the area of disbelief, because believing women are no longer lawful for their husbands who are infidels. On the other hand, disbelieving men are not lawful for believing women. From this verse a law can be stipulated which states that if a wife has converted to Islam, it means that since then she has been divorced from her husband who is still a non-believer. Therefore, it is forbidden for her to return to her husband. This verse also strengthens the law which states that it is unlawful for a Muslim woman to marry an infidel man. Then Allah decreed that the dowry that had been received by the wife who converted to Islam was returned to her husband. According to Imam Syafi'i, the wife is obliged to return the dowry if her husband, who is an infidel, asks for it. If the husband does not ask for it, then the dowry is not obliged to be returned. Some scholars are of the opinion that the dowry that must be returned is if the husband is one of those who made a peace agreement with the Muslims, while for the husband who is not included in the peace agreement with the Muslims the dowry is not obliged to be returned. Some other scholars are of the opinion that the law on returning the dowry is not obligatory but sunnah and even then if asked by her husband. Meanwhile, Muslims are allowed to marry believing women who emigrated by paying a dowry. This meant that women could not be used as slaves, because they were not prisoners of war. Allah encourages Muslims to marry them in order to protect themselves. Allah explained that the reason for the prohibition on continuing the marriage of a believing wife with an infidel husband is because there will be no marital relations between believing women and their husbands who are still infidel and are in an infidel area. Their marriage contract is no longer valid since the wife converted to Islam. On the other hand, if those who go to the area of disbelief are wives who believe and then they become infidels, the Muslims are ordered to let them go. However, they had to return the things that their Muslim husband had given them. All of those mentioned are Allah's laws that must be obeyed by everyone who serves Him, because in establishing His laws, Allah is All-Knowing of the ability of the servant who will carry the law and knows what is best done by servants. -His. In establishing the law, Allah also knows the benefits and consequences of establishing the law and the compatibility of the law for those who bear it."
		   },
		   {
			"id": 5161,
			"surah": 60,
			"ayat": 11,
			"tafsir": "This verse explains the law of a believing wife who has apostatized and fled from her husband to an infidel area, while she has not returned the dowry she received from her believing husband. If the husband attacks an infidel area, then he can take his ex-wife captive, then he can take her ex-wife back by replacing the dowry that the wife has received from the infidel husband. It was narrated by Ibn Abi Hatim from al-Hasan that this verse was revealed in connection with the incident of Ummul Hakam bint Abi Sufyan who had apostatized and fled from her husband, then she married a man from Bani Thaqif. This verse orders that the dowry that Ummul Hakam received from her disbelieving husband be replaced and taken from the spoils of war, and Ummul Hakam to return to her original husband (who was a Muslim). According to the history of Ibn 'Abbas, the dowry was taken and given to the infidel husband before dividing the spoils of war by five as much as the infidel husband had given to the runaway woman. At the end of this verse, Allah orders Muslims to be pious and carry out His commands and stop His prohibitions, both those explained in the verse above, as well as those mentioned in other verses and those contained in the hadith, if they believe in Him and in His Messenger."
		   },
		   {
			"id": 5162,
			"surah": 60,
			"ayat": 12,
			"tafsir": "Allah revealed to the Prophet Muhammad that women who profess their faith and obedience must promise that they will not associate anything with Allah, will not steal other people's property, will not commit adultery, will not abort children in their wombs, and will not do what is forbidden. , such as mourning the dead by tearing clothes apart, and so on. If they have promised, then their statement of faith must be accepted. The Prophet was also ordered to tell them that they would receive Allah's forgiveness and reward from Him if they consistently carried out their promise. The prophets were also asked to pray to Allah that their sins would be forgiven, for verily Allah is Most Forgiving, Most Merciful. Al-Bukhari narrated from 'Urwah bin Zubair that 'Aisyah said, \"Rasulullah SAW tested women who emigrated according to the verse: yes ayyuhan-nabiyy idha ja'akal-mu'minat¦..innallaha gafurur-rahim. Whoever has fulfilled With the above conditions, it means that the woman has made a statement stating that she is a believer.\" It was also narrated by 'Urwah bin Zubair from 'Aisyah, he said, \"Fatimah bint 'Utbah had come to express her faith in the Messenger of Allah, so he asked her to promise not to associate anything with Allah, not to steal, not to commit adultery, not to abort her womb, so Fatima felt ashamed to mention the promise while placing her hand on her head.\" So 'Aisyah said, \"You should admit what the Prophet said. By Allah, we do not express faith except in this way.\" Fatima carried out what 'Aisyah asked for, then the Prophet accepted her confession. According to another tradition, the Prophet Muhammad received many statements of faith from women during the conquest of Mecca. Among those who declared their faith was Hindun bint 'Utbah, wife of Abu Sufyan, head of the Quraysh tribe."
		   },
		   {
			"id": 5163,
			"surah": 60,
			"ayat": 13,
			"tafsir": "Narrated by Ibn Mundhir from Ibn Ishaq from 'Ikrimah and Abu Sa'id from Ibn 'Abbas, he explained that 'Abdullah bin 'Umar and Zaid bin Haritsah were friends with the Jews. Then this verse was revealed which forbids Muslims to be close friends with people who are angry with Allah. In this verse, Allah reiterates the prohibition of making Jews, Christians and Meccan polytheists who have malicious intentions against the Muslims as guardians or close friends, because it is feared that the believers will convey important secrets to them. At the end of this verse, Allah explains that the disbelievers have given up hope of obtaining goodness from Allah in the hereafter, because of their disobedience to the Messenger of Allah who has hinted at his arrival in their books. In fact, this issue has also been strengthened by clear evidence and real miracles. Their desperation to obtain Allah's mercy in the hereafter is the same as their despair in the grave because they do not believe in a resurrection in the hereafter."
		   }
	]
}
