{
	"tafseer": [
		{
			"id": 6198,
			"surah": 107,
			"ayat": 1,
			"tafsir": "In this verse, Allah confronts the Prophet Muhammad with a question, \"Do you know people who deny religion and what is meant by people who deny religion?\" This question is answered in the following verses."
		   },
		   {
			"id": 6199,
			"surah": 107,
			"ayat": 2,
			"tafsir": "Allah then explains that some of the characteristics of people who belie religion are those who reject and yell at orphans who come to them to beg for His mercy for the necessities of life. His refusal was an insult and arrogance towards the orphans."
		   },
		   {
			"id": 6200,
			"surah": 107,
			"ayat": 3,
			"tafsir": "Allah further confirms the nature of the liar, namely he does not invite other people to help and feed the poor. If he doesn't want to invite people to feed and help the poor, it means he doesn't do it at all. Based on the information above, if someone is unable to help poor people then he should encourage others to do this noble business."
		   },
		   {
			"id": 6201,
			"surah": 107,
			"ayat": 4,
			"tafsir": "In these verses, Allah reveals a threat, namely woe to those who pray with their bodies and tongues, not reaching their hearts. He is heedless and unaware of what his tongue is speaking and what his limbs are doing. He bows and prostrate in a state of heedlessness, he utters the takbir but does not realize what he is saying. All of that is just normal movement and mere rote words that don't affect anything, just like a robot. This behavior is directed at people who belie religion, namely hypocrites. This threat is not addressed to ordinary Muslims who do not understand Arabic and do not know the meaning of what they read. So ordinary people who do not understand the meaning of what they recite in prayer are not among the negligent people mentioned in this verse."
		   },
		   {
			"id": 6202,
			"surah": 107,
			"ayat": 5,
			"tafsir": "In these verses, Allah reveals a threat, namely woe to those who pray with their bodies and tongues, not reaching their hearts. He is heedless and unaware of what his tongue is speaking and what his limbs are doing. He bows and prostrate in a state of heedlessness, he utters the takbir but does not realize what he is saying. All of that is just normal movement and mere rote words that don't affect anything, just like a robot. This behavior is directed at people who belie religion, namely hypocrites. This threat is not addressed to ordinary Muslims who do not understand Arabic and do not know the meaning of what they read. So ordinary people who do not understand the meaning of what they recite in prayer are not among the negligent people mentioned in this verse."
		   },
		   {
			"id": 6203,
			"surah": 107,
			"ayat": 6,
			"tafsir": "Allah further adds an explanation about the nature of religious liars, that is, they perform outward acts simply for fun, not impressing their souls to absorb its secrets and wisdom."
		   },
		   {
			"id": 6204,
			"surah": 107,
			"ayat": 7,
			"tafsir": "Allah adds again in this verse the trait of liars, that is they do not want to give things that are needed by people who need them, while those items do not deserve to be held, such as pots, cottonwood, hoes, and so on. The situation of a person who promotes religion is different from that of a person who denies religion, because the first is seen in his way of life which is honest, fair, compassionate, generous, and so on. While the characteristics of religious liars are cheerful, cheating, persecuting, arrogant, miserly, looking down on others, not caring about anyone but himself, proud of his wealth and position, and does not want to spend part of his wealth, both for individual needs and for society."
		   }
	]
}
