{
	"tafseer": [
		{
			"id": 3504,
			"surah": 32,
			"ayat": 1,
			"tafsir": "See Tafsir Alif Lam Mim in surah al-Baqarah\/2: 1 (Volume I)."
		   },
		   {
			"id": 3505,
			"surah": 32,
			"ayat": 2,
			"tafsir": "This verse explains that the Qur'an which was revealed to Muhammad is truly a revelation from Allah, Lord of the worlds. This Qur'an is not the work of sorcerers, nor the spells of sorcerers, nor is it the work of Muhammad, there is no doubt about it. This verse is a rebuttal to the accusations of unbelievers who claim that the Qur'an is poetry composed by poets, and some say it was composed by soothsayers. There are also those who say that the Qur'an is just ancient tales, and there are also those who say that it was made by Muhammad. Allah said: And they said, \"(It's only) the tales of the ancients, who were asked to write down, then read those tales to him every morning and evening.\" (al-Furqan\/25: 5)"
		   },
		   {
			"id": 3506,
			"surah": 32,
			"ayat": 3,
			"tafsir": "This verse explains that the attitude of polytheists as explained in the verse above is an inappropriate attitude. It is inappropriate for them to accuse Muhammad of lying by saying that he had made up the Koran, even though they really knew Muhammad's condition, from when he was a child until he grew up and was appointed an apostle. They even gave the title \"Al-Amin\" (a confidante) because they really believed in Muhammad. However, suddenly they accused him of being a liar. Therefore, Allah confirmed that everything that Muhammad conveyed was true. The Qur'an really comes from Allah and was revealed to him to warn polytheists about the punishment in the hereafter that will befall those who deny the messengers sent to them. The Qur'an contains lessons and instructions that lead them to the path of eternal happiness. In another verse, the attitude of the polytheists towards the Qur'an is also stated. Allah says: And those who disbelieve say, \"This (Qur'an) is nothing but a lie concocted by him (Muhammad), assisted by other people,\" Indeed, they have committed injustice and a lie that big. (al-Furqan\/25: 4)"
		   },
		   {
			"id": 3507,
			"surah": 32,
			"ayat": 4,
			"tafsir": "This verse explains that the God who sent down the Qur'an to Muhammad saw is the Creator of the heavens and the earth and everything that exists between them for six periods. The meaning of the six times in this verse is not the known day (time) as it is today, but the day before the existence of the heavens and the earth. The day at this time is after the existence of the heavens and the earth, and after the circulation of the earth around the sun and so on. After creating the heavens and the earth, Allah resides on the 'Throne, according to His power and greatness. (See al-A'raf\/7: 54) Allah confirms that no one can take care of all his affairs, rejecting danger, calamity, and torment. No one can intercede when punishment befalls him, except Allah alone, because He is the Almighty who determines everything. Then Allah warned, \"Are you, O human, unable to take lessons and think about what you always see? Why do you still worship other than Allah?\""
		   },
		   {
			"id": 3508,
			"surah": 32,
			"ayat": 5,
			"tafsir": "Only Allah is the one who manages, arranges, holds, and eliminates everything in this world. Everything that happens is according to His will and decree, nothing deviates from His will. God's arrangement starts from the heavens down to the earth, then the affairs go back up to Him. All that is mentioned in this verse is a description of the greatness and power of Allah, so that humans can easily understand it. Then He also described the time that God used to manage, organize, and complete all the affairs of this universe, namely for one day. However, the size of a day is equal to 1000 years of the size of the year known to humans in this world. The word thousand years in Arabic does not always mean 1000 in its true sense, but is sometimes used to describe the amount or amount of time it takes. In this verse the number one thousand is used to denote the length of time the universe has lived since Allah created it for the first time until its destruction on the Day of Judgment, then the return of all matters to Allah, namely the day of reckoning. All of that took a very long time, so it is difficult for humans to calculate it. In another verse, the word thousand is used to explain the length of time needed if humans want to ascend to God, even if the angels only need one day. Allah says: The angels and Gabriel ascended (facing) to God, in a day equivalent to fifty thousand years. (al-Ma'arij\/70: 4) There are also those who argue that the meaning of this verse is that all the affairs of this world will return to Allah on the Day of Judgment in one day, which is equal to 1000 years of time in this world. Some commentators interpret this verse, \"The angels ascend to Allah to the sky in one day. If the distance is covered by other than angels, then it takes 1000 years.\" On the night of Mi'raj, the Prophet Muhammad ascended to the sky with the angel Gabriel to face Allah. The distance was covered in approximately half the night."
		   },
		   {
			"id": 3509,
			"surah": 32,
			"ayat": 6,
			"tafsir": "This verse explains that the God who created, governs, and takes care of the heavens and the earth and all that is in them is the All-Knowing God. He is All-Knowing of all that is unseen, hidden in the heart, that will happen, and that has happened. He is also All-Knower of all that can be seen and that which cannot be seen by the eye. He is God Almighty, His Mercy is everlasting and He is also the One who created all creatures in good, harmonious forms and with benefits and uses that only He knows. If you pay attention to all the creatures that exist in nature, from the largest to the smallest, there will be an assumption that among these creatures there are those that are of great benefit and some that are deemed useless or useless at all, and can even pose a danger to humans. , such as venomous snakes, pests of infectious diseases, plants that contain poisons, and so on. This conjecture will arise if each of these creatures is seen separately, not in a unified universe. If these creatures are seen as a whole in the universe, where one has a close relationship with one another, it will be seen that all of these creatures have benefits and uses in maintaining the balance and preservation of this nature. In fact, it is clearly seen that the efforts of some humans, whether intentionally or not, damage and kill some living things, cause pollution in this nature, so that its sustainability is disturbed. One example is the existence of pesticides, many worms and bacteria are destroyed. As a result, the waste decomposition process becomes disrupted. Even though bacteria and worms are considered animals that are of no use at all. Deforestation causes the soil to become bare, resulting in many floods and landslides during the rainy season, and drought during the dry season. All this is the result of human greed. It can be categorized as a destructive act on earth. The consequences can be extensive and give a domino effect (a streak). Based on the explanation above, it is clear that everything created by Allah has its benefits, but many people do not want to pay attention to it. Then this verse explains that He created man from dust. The point is that God created Adam from the ground and then created Adam's children and grandchildren from the essence of the soil obtained by the father and mother from food in the form of animals and plants, all of which came from the soil. In verse 7 it is stated that humans were created from soil, but in this verse it is emphasized that only at the beginning humans were created from soil. With this verse it can also be interpreted that there was another phase after the initial creation before the creation became human. If this is indeed the case, many other questions remain, including (1) was the beginning of human creation the same as and the beginning of the creation of other earthly creatures (see the tafsir of surahh al-An'am verse 2), (2) whether the phase after the initial creation, humans developed through an intermediate form like the process of evolution of other living things that are now widely believed (see surahh ar-Rum\/30 verse 20), or (3) humans were created through a special process that is different from other living things (al -Ahzab\/33 verse 33)."
		   },
		   {
			"id": 3510,
			"surah": 32,
			"ayat": 7,
			"tafsir": "This verse explains that the God who created, governs, and takes care of the heavens and the earth and all that is in them is the All-Knowing God. He is All-Knowing of all that is unseen, hidden in the heart, that will happen, and that has happened. He is also All-Knower of all that can be seen and that which cannot be seen by the eye. He is God Almighty, His Mercy is everlasting and He is also the One who created all creatures in good, harmonious forms and with benefits and uses that only He knows. If you pay attention to all the creatures that exist in nature, from the largest to the smallest, there will be an assumption that among these creatures there are those that are of great benefit and some that are deemed useless or useless at all, and can even pose a danger to humans. , such as venomous snakes, pests of infectious diseases, plants that contain poisons, and so on. This conjecture will arise if each of these creatures is seen separately, not in a unified universe. If these creatures are seen as a whole in the universe, where one has a close relationship with one another, it will be seen that all of these creatures have benefits and uses in maintaining the balance and preservation of this nature. In fact, it is clearly seen that the efforts of some humans, whether intentionally or not, damage and kill some living things, cause pollution in this nature, so that its sustainability is disturbed. One example is the existence of pesticides, many worms and bacteria are destroyed. As a result, the waste decomposition process becomes disrupted. Even though bacteria and worms are considered animals that are of no use at all. Deforestation causes the soil to become bare, resulting in many floods and landslides during the rainy season, and drought during the dry season. All this is the result of human greed. It can be categorized as a destructive act on earth. The consequences can be extensive and give a domino effect (a streak). Based on the explanation above, it is clear that everything created by Allah has its benefits, but many people do not want to pay attention to it. Then this verse explains that He created man from dust. The point is that God created Adam from the ground and then created Adam's children and grandchildren from the essence of the soil obtained by the father and mother from food in the form of animals and plants, all of which came from the soil. In verse 7 it is stated that humans were created from soil, but in this verse it is emphasized that only at the beginning humans were created from soil. With this verse it can also be interpreted that there was another phase after the initial creation before the creation became human. If this is indeed the case, many other questions remain, including (1) was the beginning of human creation the same as and the beginning of the creation of other earthly creatures (see the tafsir of surahh al-An'am verse 2), (2) whether the phase after the initial creation, humans developed through an intermediate form like the process of evolution of other living things that are now widely believed (see surahh ar-Rum\/30 verse 20), or (3) humans were created through a special process that is different from other living things (al -Ahzab\/33 verse 33)."
		   },
		   {
			"id": 3511,
			"surah": 32,
			"ayat": 8,
			"tafsir": "This verse explains that Allah created human offspring from sperm, which is a little water that gushes out, which meets the egg. The result of this meeting is called nutfah."
		   },
		   {
			"id": 3512,
			"surah": 32,
			"ayat": 9,
			"tafsir": "Then in the woman's womb, Allah completes the event of the nutfah, so that it takes the form of a human. Then the spirit is blown into it. Thus move the little fetus. After showing him the signs of life, Allah bestowed on him hearing, sight, reason, feeling, and so on. Man at the beginning of his life in the mother's womb, even though he has been endowed with eyes, ears and brain, but he cannot yet see, hear and think. He only obtained this after he was born, and the longer his five senses can function perfectly. At the end of this verse, Allah says that only a few people want to be grateful for the blessings Allah has bestowed upon them."
		   },
		   {
			"id": 3513,
			"surah": 32,
			"ayat": 10,
			"tafsir": "This verse explains the question of the polytheists to Rasulullah SAW, which shows their denial and arrogance. They said, \"Is it possible that when our flesh and bones have fallen to the ground, can we be brought back to life as before?\" From the questions above it is illustrated that according to them it is impossible for humans to come back to life after death and their bodies crumble into the ground. They cannot imagine in their minds how great the power of Allah is. If they want to reach the truth, they can look for proofs of Allah's power and greatness in the creation of human beings. They didn't exist before, then they came into existence. Of course recreating what once was is easier for Allah. Actually, if they want to think, of course they will come to the conclusion that everything is just as easy for Allah, nothing is difficult for Him. These polytheists not only deny the power of Allah, but also deny the existence of the Resurrection Day, which is the day when all human beings are brought before the Divine Supreme Court."
		   },
		   {
			"id": 3514,
			"surah": 32,
			"ayat": 11,
			"tafsir": "This verse rejects the opinion of the polytheists who say that there is no Doomsday. In this verse it is said, \"O polytheists, actually the angels who are in charge of taking human life, really keep time, so they take that person's life at the right time, not even a moment backwards, nor is it accelerated even for a moment.\" This applies to all polytheists, and they cannot run away from this decree of Allah. Then they will be resurrected on the Day of Judgment and held accountable for all their actions fairly."
		   },
		   {
			"id": 3515,
			"surah": 32,
			"ayat": 12,
			"tafsir": "Allah told His Messenger that he would be horrified if he saw the condition of those who deny the Day of Judgment when they bow their heads before Allah because of shame and fear for all their actions and deeds in life in this world. They claim to Allah that they have seen the reality of the Day of Judgment actually taking place, and have also felt the calamity that befell them on that day. They then begged to be given the opportunity to return to the world so that they could follow all the instructions of the apostle. At that time, they claimed to have truly believed what they used to deny. They also acknowledged that only Allah has the right to be worshiped, who gives life and death, and who resurrects, as it was then. In another verse, Allah says: And if you (Muhammad) see when they are brought to hell, they say, \"If we were returned (to the world), surely we would not deny the verses of our Lord, and become people of faith .\" (al-An'am\/6: 27)"
		   },
		   {
			"id": 3516,
			"surah": 32,
			"ayat": 13,
			"tafsir": "If Allah wanted all human beings to receive taufik and guidance to believe and do good deeds, surely this would not be difficult for Him. However, this is not in accordance with the sunatullah that used to apply in this world. God's rules and laws that apply in nature are the most perfect rules and laws. According to these rules and laws is to place everything in its place, such as placing the eyes, ears, heart, hands, feet, and so on in a proper and natural place, according to their beauty and function. Among the sunatullahs is that Allah will fill hell with jinn and humans who deserve to live there and become its inhabitants, just as He will fill heaven with people who also deserve to live there. If humans pay attention to the sunatullah that applies in this nature, harmony and neatness will appear in it. Fish that live underwater have fins, gills, and are cold-blooded. Likewise flies, snakes, birds, and so on. If the eye looks to the wide horizon, then in it there is also a sunatullah which is also very neat, so that the planets do not collide with one another."
		   },
		   {
			"id": 3517,
			"surah": 32,
			"ayat": 14,
			"tafsir": "Because polytheists deny the Day of Judgment, and see it as something that is impossible to happen, and believe that they will not meet God on the Day of Judgment, they feel the punishment that is inflicted. When the door of repentance was closed, God declared that He would no longer pay attention to their request. At the end of this verse, Allah mentions that the form of punishment that befalls disbelievers is eternal punishment in hell, as a result of their actions and actions."
		   },
		   {
			"id": 3518,
			"surah": 32,
			"ayat": 15,
			"tafsir": "This verse explains that those who believe in the verses of the Qur'an and acknowledge that Muhammad is Allah's messenger are those who, when they are reminded of Allah's verses and recited in front of them, then they prostrate to Him His. They also glorify Him while reading, \"Subhanallahi wa bihamdihi, subhanallahil 'adhim.\" Such prostration is called prostration recitation. The law is sunnah, both in prayer and outside prayer. Their actions were a sign of their obedience and submission. This is also a sign that they really live up to the teachings and instructions of the verses that are read to them. There is not the slightest arrogant and arrogant attitude in serving Allah. They are also happy and solemn in worship."
		   },
		   {
			"id": 3519,
			"surah": 32,
			"ayat": 16,
			"tafsir": "In this verse, Allah describes yet another sign for those who believe. Among them are they sleep less, and often wake up in the middle of the night to pray and pray to Allah to be spared from His torment. They also donate part of the sustenance they have received from Allah. There are many verses from the Al-Qur'an and the hadiths of the Prophet that explain the virtues and benefits of night prayers, especially to draw closer to Allah and increase the strength of faith in the heart. The Tahajud prayer can elevate humans to a commendable place, as Allah says: And on some nights, perform additional Tahajud prayers (as a form of worship) for you: hopefully your Lord will raise you to a commendable place. (al-Isra'\/17: 79) In another verse, Allah explains that praying and reading the Qur'an at night can strengthen the soul. Thus, the soul will be able to accept heavier and greater obligations from Allah, as mentioned in His words: O you who are covered (Muhammad)! Get up (to pray) at night, except for a small part, (ie) half or a little less, or more than (half) of it, and recite the Qur'an slowly. Indeed, We will send down heavy words on you. Truly, the night's wake is stronger (fills the soul); and (readings at that time) more memorable. (al-Muzzammil\/73: 1-6) It was narrated by at-Tirmidhi, Ibn Majah, Ahmad, Abu Dawud, and ath-thabrani that Mu'adz bin Jabal asked the Messenger of Allah: O Messenger of Allah, tell me what actions can enter me into heaven and keep me away from the fire of hell. The Messenger of Allah said, \"Indeed you really have asked something big, in fact the deed is easy to do by people who make it easy for Allah, you worship Allah, do not associate Him with anything, establish prayers, pay zakat, fast in Ramadan, make pilgrimages to Baitullah.\" Then the Messenger of Allah continued his words, \"Would you like me to show you the doors of goodness? Fasting is a shield, alms erases mistakes like water extinguishes fire, and prayers in the middle of the night.\" Then he recited Tatajafa. . . to the end of the verse. (History of at-Tirmidhi, Ibn Majah, Ahmad, Abu Dawud, and ath-thabrani) Narrated by Ibn Jarir ath-thabari from Ibn 'Abbas, he said, \"The meaning of \"their stomachs are far from their beds\" is to worship Allah, remembrance, prayer, standing, sitting or lying down, they always remember Allah.\""
		   },
		   {
			"id": 3520,
			"surah": 32,
			"ayat": 17,
			"tafsir": "This verse explains that a person cannot know how much happiness and pleasure Allah will give him in the hereafter, and how pleasant and comfortable it will be to live in that paradise. All of that is a reward for the good deeds that have been done while living in the world. Narrated by al-Bukhari and Muslim and other hadith priests from Abu Hurairah, the Messenger of Allah said: Allah said, \"I have prepared for My righteous servants what no eye has seen, no ear has heard of, and no ever etched in the human heart, except for what I have presented to you. Read, if you wish \"Fala talamu nafs. . . to the end.\" Narrated by al-Firyabi, Ibn Abi Syaibah, Ibn Jarir ath-thabari, ath-thabrani, al-hakim and stated as an authentic hadith from Ibn Mas'ud, he said, \"Indeed it is written in the Torah that Allah promised to those whose stomachs are far from their beds, what eyes have not seen, ears have not heard, what has not been etched into the human heart. Angels who are close to God do not know about it and neither do the apostles who are sent. In fact it is also found in the Qur'an, as mentioned in this verse.\""
		   },
		   {
			"id": 3521,
			"surah": 32,
			"ayat": 18,
			"tafsir": "In this verse it is explained that after explaining the characteristics of the disbelievers and the characteristics of the believers, Allah ordered to compare the two characteristics, whether those who deny Allah's verses, do not believe in His promises and threats, disobey orders -His commands and prohibitions are the same as those who follow Allah's verses, acknowledge the truth of His promises and threats, follow His commands and stop His prohibitions? Allah confirms that the two groups are not the same at all, there is a huge difference in His sight. People who are not knowledgeable and do not have keen insight can distinguish between the two types of classes. Another Word of God which has the same content as this verse, is: Do those who commit crimes think that We will treat them like those who believe and do good, that is, the same in their life and death? How bad their judgment was. (al-Jasiyah\/45: 21) Allah's Word: Is it appropriate that We treat those who believe and do good the same as those who do mischief on earth? Or is it appropriate for We to consider those who are pious to be the same as those who are evil? (sad\/38: 28)"
		   },
		   {
			"id": 3522,
			"surah": 32,
			"ayat": 19,
			"tafsir": "This verse explains the differences between the two groups and the differences in their conditions in the hereafter. Those who believe in Allah and His Messenger, and do good deeds will be rewarded many times over in the hereafter. They will live in magnificent houses with beautiful gardens, as a reward for the faith and good deeds they have done while living in the world. Allah's Word: Surely Allah will forgive your sins and admit you to gardens beneath which rivers flow, and to good dwellings in paradise 'Adn. That's a great victory. (ash-saff\/61:12)"
		   },
		   {
			"id": 3523,
			"surah": 32,
			"ayat": 20,
			"tafsir": "As for those who disbelieve, deny Allah and His Messenger, and do evil deeds, they will be rewarded with the punishment of hell in the hereafter. Every time they approach the door of hell to get out, they are returned to it again. If hell is likened to a crater or crater of a volcano, then the disbelievers are in it. The flames from the crater were so dangerous and every time they shot sparks. In this picture, the infidels who are being punished are also carried away, they are thrown into the mouth of the crater, then they are immersed again at the bottom, so that they do not have the slightest chance to get out of that hell. When they are immersed back into hell, they are told, \"You will feel the punishment of hell that you did not believe in at all while living on earth.\""
		   },
		   {
			"id": 3524,
			"surah": 32,
			"ayat": 21,
			"tafsir": "In this verse, Allah explains that actually those disbelievers while still alive in the world have been punished by Allah with various kinds of punishment, both visible and that can only be felt by them. The torment for them in this world is called al-'adzab al-adna (the imminent punishment), while the torment in the hereafter is called al-'adzab al-akbar (greater punishment). There are many trials that God has given to humans while living in the world, from the smallest trials to the biggest trials. It can also be in the form of outward luxury to poverty and misery. A person who is rich but is not based on faith in God, his heart is always anxious and worried, maybe someone will take away his wealth, or an heir will kill him in order to get the wealth. An unbelieving ruler is always worried that his power will pass to other people. If necessary, that power is maintained with an iron fist and violence. Worries like this never happened to Pharaoh when his sorcerers were defeated by Prophet Musa. Allah said: He (Pharaoh) said, \"Did you believe in him (Moses) before I gave permission to you? Surely he is your leader who teaches you magic. So really, I will cut off your hands and feet crosswise, and really, will I crucify you at the base of a date palm and indeed, you will surely know which of us is more painful and more enduring in its torment.\" (thaha\/20: 71) There are many rulers who behave like this Pharaoh. They think that they own it all and they are the most powerful. In fact, Allah gives trials from worldly punishment so that everything becomes a lesson for the disbelievers. This is so that they want to believe, do good deeds, and hopefully return to the right path. Let them bear light torments in this world as long as in the hereafter they are spared from very heavy torments."
		   },
		   {
			"id": 3525,
			"surah": 32,
			"ayat": 22,
			"tafsir": "Allah explains that the most unjust people in His sight are those who have received Allah's warnings, verses of the Qur'an, and the instructions of the Messenger, but they turn away from those teachings and instructions because of arrogance and envy that is in them. his heart. At the end of this verse it is emphasized that Allah will torment with a painful punishment everyone who commits sins and immorality. Narrated by Ibn Jarir ath-tabari from Mu'adz bin Jabal, he said, \"I heard the Messenger of Allah say: Three things, whoever does it, then in fact he has done a sinful act: whoever is determined to fight in a way that is not righteous or disobeying his parents or the one who walks with the wrongdoers and then he helps the unjust person. Allah says, \"Verily, We will repay those who sin.\" Mu'adz bin Jabal)"
		   },
		   {
			"id": 3526,
			"surah": 32,
			"ayat": 23,
			"tafsir": "This verse explains that Allah has sent down the Torah to Prophet Musa as He has sent down the Qur'an to Prophet Muhammad. However, the revelation that was revealed to Prophet Musa was denied by his people. Musa and his followers were tortured by Pharaoh and his people, so they fled to the Palestinian area. Similarly, Muhammad SAW had also been lied to by his people, hurt, and opposed so that he and his companions migrated to Medina. That is the sunatullah that applies in this world, there is always a fight between right and wrong, and between good and evil. All of this is a trial for believers. In this verse, the name Musa is mentioned among the prophets and messengers of Allah because of the many similarities between his struggle with the Prophet Muhammad. This verse was revealed as entertainment for the Prophet Muhammad and his companions who were conveying Allah's religion to humans. In conveying the treatise, he received threats and persecution from his people. It was as if they were being told, \"O Muhammad, do not be saddened by the attitudes and actions of the polytheists. Such things are natural and are circumcision. Remember Musa and his followers. They were persecuted and hunted down. by Pharaoh and his people, until they fled across the Red Sea, and crossed the barren and hot desert. Under these circumstances, many of his followers were traitors, but he remained steadfast and patient. The stronger the challenges and persecution that received, the stronger his efforts and patience. I will certainly love you and your followers as I have also taken care of Moses and his followers.\""
		   },
		   {
			"id": 3527,
			"surah": 32,
			"ayat": 24,
			"tafsir": "This verse explains that Allah has made among the Children of Israel who follow His instructions to become community leaders. Some of them were appointed as prophets and messengers who conveyed correct instructions to their people, and some of them were made leaders for their people towards the right path. This was given because they are people of faith and are patient in carrying out God's laws. They also patiently accept every trial that befalls them, and they are sure of God's guidance. Allah said: And We gave Musa the Book (Torah) and We made it a guide for the Children of Israel (by saying), \"Do not take (protector) other than Me.\" (al-Isra'\/17"
		   },
		   {
			"id": 3528,
			"surah": 32,
			"ayat": 25,
			"tafsir": "This verse explains that in fact only Allah who resolves and gives decisions on all disputes and conflicts over religion between them on the Day of Judgment. Allah will reward those who deny the Prophet's call and reward those who follow him. Some commentators are of the opinion that it was the Prophet Muhammad who resolved conflicts over religion. He gives a fair decision on the disputes of the apostles with their people on the Day of Resurrection."
		   },
		   {
			"id": 3529,
			"surah": 32,
			"ayat": 26,
			"tafsir": "In this verse, Allah warns the polytheists of Mecca who always oppose and deny the call of the Prophet Muhammad. Is it not yet clear to them the true path which has been shown to them. Do they forget and do not pay attention to the consequences that the ancient peoples received who denied the apostles who were sent to them. Didn't the Meccan polytheists often trade to Syria and Yemen? On that trip, they watched and saw the former lands of the people of 'Ad, Samud, Lut, the people of Aikah, and so on which had been destroyed as a result of their actions that belied the apostles. Another verse that is in line with this verse is the word of Allah: So how many countries have We destroyed because (the inhabitants) were unjust, so that their buildings collapsed and (how many) abandoned wells and high palaces (no occupants). (al-hajj\/22: 45) Allah's other words: So those are their houses that have collapsed because of their tyranny. Indeed, in that there is truly a sign (of Allah's power) for those who know. (an-Naml\/27: 52) Allah said that actually in the former ruins and residences of those who denied and denied the apostle's call there were lessons for those who wanted to take lessons. This incident shows that sunatullah applies to all wrongdoers."
		   },
		   {
			"id": 3530,
			"surah": 32,
			"ayat": 27,
			"tafsir": "This verse asks whether the disbelievers are blind, so they cannot see the evidences of Allah's greatness and power? Isn't it Allah who drives the clouds to dry and barren places and has no plants? The clouds turn into rainwater which waters the land enabling people to drain it onto the dry lands. The land then becomes fertile and overgrown with various kinds of plants and plants. Some of these plants are eaten by humans and some by their domestic animals. Do they not see such evidence so that they can acknowledge the greatness and power of Allah in resurrecting dead humans and raising them from their graves? If they pay attention, they will certainly come to the conviction that Allah is Almighty, nothing is difficult for Him. If He wills, it is enough for Him to say \"kun\" (be), then it will be what He wills."
		   },
		   {
			"id": 3531,
			"surah": 32,
			"ayat": 28,
			"tafsir": "In this verse it is explained that because of their belief in Islam, Muslims often say that later Allah will give them victory. At that time a just decision will be made between humans, including between them and the disbelievers. The disbelievers, especially the polytheists of Mecca, after listening to the words of the Muslims, asked this with the intention of ridiculing and making fun of them. The disbelievers said, \"O Muslims, you all always say that you will soon get victory, even though you are all useless people and lowly people among us. Could your accusations come true? If what you say is true, tell us when it happened?\""
		   },
		   {
			"id": 3532,
			"surah": 32,
			"ayat": 29,
			"tafsir": "This verse explains that Muhammad told the Meccan polytheists, including the disbelievers, that the day of victory and the day of a just settlement is the Day of Judgment. On that day, it will no longer be useful for someone's faith that was only spoken at that time, even though in this world, he is a disbeliever. They were not given the opportunity to repent that day. Not giving the disbelievers a chance to repent on that day was reasonable because they had been warned by the apostles sent to them while living on earth. The apostle has shown them the path of eternal happiness contained in the Qur'an and hadith, but they still deny and disobey. Allah will determine the law among people fairly on the Day of Resurrection. Those who do good will be rewarded with good rewards, while those who do bad will be punished with painful torments. This is in accordance with the word of Allah: \"O our Lord, give a decision between us and our people with (fair) rights. You are the best decision maker.\" (al-A'raf\/7: 89)"
		   },
		   {
			"id": 3533,
			"surah": 32,
			"ayat": 30,
			"tafsir": "Because the polytheists persisted in their denial, and had even begun to challenge and hurt the Muslims, Allah ordered the Messenger of Allah and the Muslims to turn away from them and pay no more attention to them. The Messenger of Allah was also ordered to call on all human beings to accept the revelations that had been conveyed to him, in accordance with the task he had received from Allah. Let those polytheists wait for the punishment that Allah will inflict on them both in this world and in the hereafter, in return for the evil deeds they have done to the Prophet and all Muslims. God will truly keep His promises. At the end of this verse, Allah explains that the Prophet Muhammad will see the result of his magnanimity and the reward for his efforts to convey Allah's message. He will guard and protect the Prophet from all kinds of dangers that come from the polytheists. According to a history, after this verse, verses came down that allowed the Prophet Muhammad and his companions to fight the disbelievers."
		   }
	]
}
