{
	"tafseer": [
		{
			"id": 5242,
			"surah": 67,
			"ayat": 1,
			"tafsir": "This verse explains that Allah, the Most Holy and infinite in His mercy, is the ruler of all the kingdoms of this mortal world and all its contents, and the kingdom of the hereafter which takes place after the disappearance of the kingdoms of this world. Allah said: And to Allah belongs the kingdom of the heavens and the earth and what is between them. He creates what He wills. And Allah is Almighty over all things. (al-Ma'idah\/5: 17) Another word of Allah: Praise be to Allah, Lord of all the worlds, the Most Gracious, the Most Merciful, the Owner of the Day of Judgment. (al-Fatihah\/1: 2-4) Allah is the ruler of the kingdom of the world. This means that it is He who created the entire universe and everything in it. He is also the one who develops, maintains the continuity of his form, regulates, manages, controls, and determines everything in it, according to His will. In organizing, administering, developing, and maintaining the continuity of this natural being, Allah establishes laws and regulations. All must obey and follow the laws and regulations that He made without the slightest exception. Anything and anyone who does not want to submit and obey, and deny those laws and regulations will surely perish or be miserable. There are two laws and regulations of Allah that apply in nature; First, sunatullah which is God's law and provisions that apply in this universe, both for living things and inanimate things, both for humans and for animals, plants, and inanimate objects, both for the earth and all its contents and for all planets that circulate in the universe that is not limited in extent. Among God's laws and regulations are fire burning, water flowing from high places to low places, Pascal's law, and, Archimedes' law. Living humans need oxygen, eat and drink, both in the form of physical and spiritual food and drink. Humans are individual beings and social beings. Every planet, including the earth, has a gravitational attraction and runs in a predetermined orbit; and many more laws and regulations of Allah, both those that are known to man and those that are not yet known to him. Violation of God's laws and regulations means misery and destruction for those who break them. For example, putting your hand into a fire will result in burning of your hand, and destroying nature or cutting down a forest that exceeds the limit can result in flooding and human losses. Even the stars and meteors that violate God's laws will be destroyed. Second, the religion of Allah, which contains instructions for humans. By following these instructions, humans will live happily in this world and in the hereafter. The religion that contains instructions was sent down by Allah to the apostles He sent, from the Prophet Adam to the Prophet Muhammad, as the last prophet and messenger of Allah, the last of all the apostles and prophets. Humans who live after the Prophet Muhammad was sent, until the end of time, must follow the religion he brought if they want to live safely, happily in this world and in the hereafter. Thus Allah who controls, manages, regulates, and maintains the continuity of this natural form, establishes laws and regulations, so that in this way everything looks neat, beautiful, and beneficial to humans. If a citizen is obliged to obey and comply with all the laws and regulations that apply in his country, of course he must be even more obligated to submit and obey the laws and regulations of Allah who created, bestowed favors, and guarded them. If a country stipulates sanctions for every citizen who violates the laws and regulations that have been established, then Allah will determine more sanctions and judge fairly every creature who violates the laws and regulations that He has made. Besides being the ruler of the world's kingdoms, Allah also controls the kingdoms of the hereafter, which exist after the destruction of all the world's kingdoms. The kingdom of the hereafter is an eternal kingdom; starting from the occurrence of the Day of Judgment, the day of the world's destruction and the resurrection of humans from the graves. Then they were gathered in Padang Mahsyar to be tried and weighed their deeds and deeds. From the court it was decided; for those whose faith and good deeds are heavier than the mistakes they have made, then they will be rewarded with heaven, a place full of enjoyment and happiness. On the other hand, if the evil deeds they have done while living in the world are heavier than the faith and good deeds they have done, then the reward they get is hell, a place full of incomparable misery. Life in the afterlife, whether in heaven or hell, is eternal life. In heaven, Allah bestows pleasure and happiness on those who believe and do good deeds, while in hell, Allah inflicts severe punishment on those who disbelieve and do evil deeds. Allah said: Not so! Whoever does bad, and his sin has drowned him, then they are residents of hell. They abide therein, And those who believe and do good, they are the inhabitants of heaven. They live in it. (al-Baqarah\/2: 81-82) At the end of this verse it is emphasized that Allah, as the ruler of the kingdoms of the world and the kingdoms of the hereafter, is Omnipotent over all things. There is nothing that can match His power and nothing that can escape His power."
		   },
		   {
			"id": 5243,
			"surah": 67,
			"ayat": 2,
			"tafsir": "In this verse it is explained that God who holds the power of the kingdom of the world and the kingdom of the hereafter and controls all that, is the God who created death and life. Only He determines the time of death of every creature. When the moment of death has come, nothing can speed it up or slow it down for an instant. Likewise with the condition of a creature that is about to die, there is nothing that can change it from what He has determined. Allah says: And Allah will not delay (death) a person when the time of his death has come. And Allah is All-Aware of what you do. (al-Munafiqun\/63: 11) No human or other living creature can escape from the death that God has ordained, as He says: Wherever you are, death will find you, even if you are in a high fortress and strong. (an-Nisa'\/4: 78) Likewise it is stated that Allah created life. The point is that it is He who gives life to all living things in this world. It is He who provides all the necessities of life and He also gives the possibility for the continuation of this type of living creature, so that it is not threatened with extinction. Then it is He who determines the length of life of a creature and determines the conditions of life for all creatures. In the meantime, Allah also determines how long a creature will survive, so that when the time He has determined ends, that type of creature will perish as experienced by ancient animal species. In this verse it is explained that Allah created death and life is to test humans, which of them has faith and does good deeds by following the instructions brought by the Prophet Muhammad and who denies them. From the verse above it is understood that by creating life, Allah gave a very broad opportunity for humans to choose what is good according to themselves. Will he follow his desires, or will he follow God's instructions, laws, and provisions as the ruler of this universe. If humans suffer a painful punishment in the hereafter, then the punishment is essentially inflicted on their own will. Likewise, if they get happiness, then that happiness comes because of their own will while living in the world. Based on this test, the degree and dignity of a human being are determined in the sight of Allah. The stronger a person's faith, the more good deeds he does. The more he is submissive and obedient to follow the laws and regulations of Allah, the higher the degree and dignity he will get in the sight of Allah. On the other hand, if a human does not believe in Him, does good deeds and disobeys Him, he will get the most despicable place in the hereafter. Worldly life is to test humans, which of them always use their minds and minds to understand God's religion, and choose which deeds are best done, so that their deeds are pleasing to God. Also to find out who is steadfast and resistant to restraining himself from doing Allah's prohibitions and who is the most obedient to Him. This verse encourages and recommends that humans are always vigilant in their lives. Let them always check their hearts whether he is truly a believer, and also check everything they are going to do, whether it is in accordance with what Allah has commanded or not, and whether what they are going to do is Allah's prohibition or not. If the deed is in accordance with Allah's commands, even including actions that are pleasing to Him, you should do it immediately. Conversely, if the act is included in the prohibition of Allah, then do not ever carry it out. At the end of this verse, Allah confirms that He is Almighty, there is not a single creature that can hinder His will if He wants to do something, such as wanting to reward those who believe and do good deeds or want to punish people who disobey Him. He is Most Forgiving to His servants who want to repent to Him by regretting the sins they have committed, promise not to commit that sin again and also promise not to commit other sins. In this verse, Allah mentions two of His attributes side by side, namely the attribute of Mighty and Most Forgiving, as if these two attributes were opposite traits. The nature of the Almighty gives the sense of giving news that frightens, while the nature of the Most Forgiving gives the sense that there is hope for everyone who commits sin, if he repents. This shows that God who has the right to be worshiped really can impose His will on anyone, nothing can stop him. He knows everything, so that he can give the right response to each of His servants, both in the form of reward and punishment. With that knowledge too, He can distinguish between those who are obedient and those who are disobedient to Him, so that there is not the slightest possibility that someone who is disobedient will receive a reward or someone who is obedient and obedient will receive punishment. God never errs in giving vengeance. Another Word of Allah which mentions the news of warning and hope in tandem is: Tell My servants that I am the Most Forgiving, the Most Merciful, and indeed My punishment is a very painful punishment. (al-hijr\/15: 49-50)"
		   },
		   {
			"id": 5244,
			"surah": 67,
			"ayat": 3,
			"tafsir": "Allah explained that it was He who created all the heavens in stages in the universe. Every natural object seems to be floating firmly in the middle of the universe, without any pillars to support it and without any ropes to tie it up. Each sky occupies a space allotted for it in the middle of the universe and each layer consists of countless planets. Each planet walks in the orbit that has been determined for it. Allah says: He created the heavens without pillars as you see them, and He placed mountains (on the surface of) the earth so that it (the earth) would not shake you; and breed all kinds of moving creatures that animate the earth. And We send down rain from the sky, then We grow in it all kinds of good plants. (Luqman\/31: 10) All celestial bodies and the stars contained in them are subject to and obediently follow the provisions and laws set by Allah for them. Everything remained like that until the appointed time for him. Allah said: Allah who raised the sky without a pillar (as) that you see, then He sits on the 'Throne. He subdued the sun and moon; each circulating according to a predetermined time. He arranges affairs (His creatures), and explains the signs (His greatness), so that you are sure of meeting your Lord. (ar-Ra'd\/13: 2) According to Astronomy, in the infinitely wide universe, there are galaxies or clusters of stars in which there are countless billions of stars. The stars that are in each of these galaxies are small like the earth, some are big like the sun, and many are even bigger. Each galaxy has an orderly system, which is inseparable from the entire space system. There is an attraction that exists on each planet, causing the planets not to fall and not collide with one another, so that they remain afloat and circulate in their respective orbits in space. If we relate the meaning of this verse to what is explained in Astronomy, then what is meant by the many levels of the heavens are the galaxies. While the number seven in Arabic is usually used to indicate something that is many in number. Therefore, what is meant by the seven heavens are the many galaxies in the sky. Meanwhile, there are also commentators who argue that what is meant by \"the seven layers of heaven\" are the seven stars that are around the sun, and there are also commentators who do not want to interpret it. They leave it to God because it is in His knowledge that humans have not known for certain. Such is the general description of the state of the system of galaxies. Very little is known about the state of each of the innumerable planets, such as their nature and character, what they contain, how they form in detail, and so on. That too is only a small fraction of knowledge about the galaxy. As regarding the creation of the seven layers of \"heaven\" there are several other verses, such as al-Baqarah\/2: 29, al-An'am\/6: 125, Nuh\/71: 15, and an-Naba'\/78: 12. According to scientists, the word sky can be interpreted as the sky of the earth in the form of the atmosphere or the sky of the universe. When the heavens of the earth, it turns out that the atmosphere is divided into seven layers. And each layer has a duty and function to protect the earth. The division of the atmosphere into seven layers is based on differences in chemical content and air temperature. The seven layers are named: Troposphere, Stratosphere, Mesosphere, Thermosphere, Exosphere, Ionosphere, and Magnetosphere. In surahh Fussilat\/41 verses 11-12 it is stated that each layer of the sky has its own affairs. Science has confirmed this, for example, there are layers that are responsible for making rain, preventing radiation damage, reflecting radio waves, up to a layer that prevents meteors from damaging the earth. However, with verse 5 in the same surahh (al-Mulk\/67: 5), it seems that what is meant by the sky is not the atmospheric sky, but the universal sky. The verse reads as follows: And indeed, We have decorated the near sky with stars and We made them (the stars) as tools for throwing Satan, and We have prepared for them the punishment of a flaming hell. (al-Mulk\/67: 5) It is clearly stated that the \"near sky\" (perhaps it can be interpreted as the first layer of heaven) is decorated by stars. The word used is not star (singular form which can refer to the sun as a star in the solar system), but the stars (plural form). Thus the \"near sky\" is all the galaxies we know today. If this is the case, what is stated in the Al-Qur'an regarding this matter, cannot be reached by scientific findings at all. Related to that, it is a very arrogant thing if a human being claims to know everything. No matter how vast a person's knowledge is, it is still very little when compared to Allah's knowledge. If someone compares himself to the earth, then sees himself situated among the many planets, he will certainly feel that he is actually nothing when compared to Allah's creatures, which are of various shapes and countless patterns. Allah then ordered people to look at and pay attention to the heavens and the earth and their contents, and study their characteristics. For example, pay attention to the sun shining and the moon shining, to what extent are the benefits and benefits of that light and light for the lives of all existing beings. Look at the cattle grazing in the meadows, the green plants, the tall, firm mountains that soothe the eyes of those who look at them; the vast expanse of the sea turns blue; the sky and everything in it. Everything grows, develops, remains in existence and form, and is continuous and has very neat systems, laws and regulations. This system is inseparable from a larger system of laws and regulations, namely those that apply to the entire mortal world. Think about it and think about it, are there any flaws or blemishes in the creatures created by Allah, as well as in the systems, laws and regulations that apply to them? The Greatest and Most Creator Allah, Lord of all the worlds, there is not even a flaw or blemish in the creatures He created. Then it is as if Allah continues His questions to humans, do they still have doubts about His power and greatness? Do humans still have doubts about the systems, laws, and regulations made for His creatures, including themselves? If still in doubt, humans are ordered to pay attention, ponder, and study again truthfully. Do they still find in Allah's creation some imperfect ones? From the question posed by this verse, it can be understood that it is as if God is challenging humans, to look for (if there are) the slightest flaws and imperfections in His creation. If there are deficiencies, defects, and blemishes in God's creation, then humans deserve to deny His oneness and power. However, they are amazed and admit the neatness of God's creation, they even admit their weaknesses. If this is the case, then their denial is not caused by their disbelief in Allah, but solely because of their arrogance and arrogance."
		   },
		   {
			"id": 5245,
			"surah": 67,
			"ayat": 4,
			"tafsir": "Allah's question to humans in the verse above is answered by Allah himself in this verse by saying that even if humans repeatedly pay attention to, study, and meditate on all of Allah's creation, surely they will not find even the slightest flaws and defects. If they continue to do this, even their whole life and lives are used for it, in the end they will only feel and will not find any shortcomings, until they die and return to their Lord. From this verse, it can be understood that no one among humans is able to find flaws in God's creation. If any human being is able, this means that he knows all of Allah's knowledge. Until now no one has known it and no one will be able to have all of Allah's knowledge. If there is one among humans who is considered the most knowledgeable, then the knowledge he knows is only a small part of God's knowledge. However, many people do not want to realize their weaknesses and shortcomings, so they still deny Him."
		   },
		   {
			"id": 5246,
			"surah": 67,
			"ayat": 5,
			"tafsir": "After declaring that there is not the slightest flaw in His creation, Allah confirms that He is God Almighty, Almighty, by saying that He has adorned the heavens closest to the earth with the sun shining brightly at noon, the moon and stars shining brightly. at night, which can be seen by humans every day and night. The sky decorated with the sun, moon and shining stars is visible to people as if it were a house decorated with sparkling lights at night, pleasing those who look at it. The parable presented by the verse above is a beautiful parable and is to the point. Namely that the universe is likened to a house. The house is the place where people live, where they take shelter from the hot sun and take shelter in the rain, where they have fun and rest, where they raise their children, and so on. Thus this nature was created by God for the benefit of all mankind. Besides decorating the sky, these stars can also cause flames of fire that can be used to throw cursed demons that steal the conversation of the inhabitants of the sky. There are some scholars who interpret this verse by saying that Allah created the stars as world ornaments and to generate sustenance for humans, namely by having day and night with all kinds of benefits that can be obtained from it. The sustenance that humans get because of that day and night, some are the cause of good and some are the cause of evil that can inflame evil desires. Qatadah said that Allah created the stars for three purposes, namely: first, to decorate the sky; secondly, to cast down demons; and third, to serve as directions and addresses for travelers on their way, whether on land, sea or in this vast space. Perhaps Qatadah explains one of Allah's purposes for creating the stars as far as he knows, because there are many other purposes, both of which are known and unknown to humans. Allah is Most Knowledgeable, Most Wise. Thus Allah created the countless stars that adorn the universe. All of that can be used by humans in accordance with the desires to be achieved. If the desire to be achieved is a desire that is in accordance with the pleasure of Allah, surely Allah will pave the way for the achievement of that desire and give him multiple rewards. On the other hand, if the wish to be achieved is a desire that is contrary to the good pleasure of Allah, then they will be provided with a painful punishment."
		   },
		   {
			"id": 5247,
			"surah": 67,
			"ayat": 6,
			"tafsir": "It has been decreed and sunatullah that everyone who associates partners with and denies Allah, and denies the messengers He sent, will be put into hell. Hell is the worst place prepared for them. In it they will feel the suffering and torment that is very painful and miserable. Then Allah explained the attitude of hell when the disbelievers were put into it, namely: 1. When the unbelievers were thrown into it, they heard a loud and terrible sound as a sign of their anger. 2. Hell is bubbling, like a big pot boiling the disbelievers with its boiling water. 3. It is as if Hell is about to burst when the disbelievers are thrown into it. 4. Hell is very fierce and angry with everyone who is in it. 5. Every time a group of disbelievers are brought into it, the guards of hell scold them, \"Hasn't an apostle ever come to you. Why don't you follow the call the apostles conveyed to you?\" 6. The inhabitants of hell admit that the apostles have come to them, but they deny it; even accused that it was the apostles who were in error"
		   },
		   {
			"id": 5248,
			"surah": 67,
			"ayat": 7,
			"tafsir": "In this verse, the condition of hell is explained as a place prepared for disbelievers and their attitude when they are thrown into it. When the disbelievers were thrown into it, they heard a very loud and frightening roar. The hell sounds like it's bubbling like a big pot and the disbelievers are being boiled in it with scalding water and bubbling from the heat."
		   },
		   {
			"id": 5249,
			"surah": 67,
			"ayat": 8,
			"tafsir": "It was further explained that hell accepts disbelievers with great anger. He was so angry that they almost broke into pieces. In such circumstances, the Zabaniyah angel also rebuked and insulted them, \"Has there never come to you an apostle sent by Allah who warns you of the doomsday doomsday that befalls you at this time?\" This also shows that Allah will not punish a people, but after He sent an apostle and they did not heed the call. In another verse, Allah says: ¦but We will not torment before We send an apostle. (al-Isra'\/17: 15) From this verse it can be understood that humans are required to carry out God's commands and leave His prohibitions if the call of the messenger sent to them has been conveyed to them. This applies whether the call is conveyed directly or indirectly, that is, by means of people who have faith in Him."
		   },
		   {
			"id": 5250,
			"surah": 67,
			"ayat": 9,
			"tafsir": "In this verse it is explained that the questions of the angels were answered by the disbelievers who were being punished by admitting that an apostle had come to them. He had read to them God's verses and had warned them of the consequences that would be met by those who did not heed those calls. However, they belied and even mocked the apostles by saying; O you who have claimed to receive revelations from Allah. In fact, there is no revelation that Allah has sent down to you because you are not an apostle sent to us. You are just an ordinary human being like us too, even you are poorer and lower in rank than us. There is no use and benefit in the slightest for all the words that you say for us, even all of you who claim that as apostles sent by God, are actually people who are in great error.\" In another verse, Allah says: Those who disbelieve are herded into the Hellfire in groups, so that when they reach it (hell) the doors are opened and the guards say to them, \"Have there not been messengers from among you who have recited the verses of your Lord? and warn you of the meeting (with) this day of yours?\" They replied, \"Yes, there is,\" but the doom will certainly apply to the disbelievers. (az-Zumar\/39: 71)"
		   },
		   {
			"id": 5251,
			"surah": 67,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that the disbelievers who are being punished in hell regret their attitudes and actions while living in the world by saying, \"If we want to use our minds and minds that have been bestowed by Allah, to evaluate and take advantage of the messenger's call, likewise if we use our ears to hear the verses of Allah that have been revealed and conveyed to us by the apostle who has been sent, we certainly will not deny and deny the truth that is conveyed. We will not be deceived by pleasure and the influence of this mortal world, will not be deceived by Satan's deception, and will not be put into this burning hell whose punishment we cannot bear in the slightest.\""
		   },
		   {
			"id": 5252,
			"surah": 67,
			"ayat": 11,
			"tafsir": "In this verse, Allah also explains that even though the disbelievers who are being punished in hell have confessed the sinful acts they have committed while living in the world and have truly repented, their confessions and statements of repentance are not of the slightest benefit. . Because, the repentance that God accepts is only repentance that is done by a person when he lives in the world, with the conditions: 1. Leave the sin that was committed immediately. 2. Regretting the sins that have been committed. 3. Promise not to commit the sinful acts he has done and other acts that are forbidden by God. In the hereafter, those disbelievers have been kept away from Allah's mercy so that they will not receive anything that is His mercy, such as forgiveness of sins, happiness in life, and so on. Only destruction will come upon them. From this verse it can be understood that actually the call to adhere to the religion of Allah and follow the messenger's call has reached almost all places in this world and to all mankind. Meanwhile, the religious teachings conveyed by the apostle are easily accepted and implemented by any human being who is mature and has reason, because the purpose of these religious teachings is for the benefit of humanity in life in this world and in the hereafter, not to burden and constrict. In addition, religious teachings are easily accepted by common sense because they are easy to understand and in accordance with human reason. However, because of their lust, position, rank, wealth, and wanting to gain sympathy, honor, and coupled with the devil's temptations whose purpose is only to lead people astray, they do not heed that call. As a result, they get a reward commensurahte with their disbelief and denial. How many people who previously believed and practiced the teachings of Islam well, but then because of the influence of lust and temptation by Satan, they did not hesitate to abandon the beliefs and beliefs that had grown well in their hearts, they even did not hesitate to destroy Islam. and Muslims. Allah Himself always reminds them by giving trials in the form of pleasure and suffering, but they are only aware until the trials are gone from them. After that, they again denied the teachings and calls of the apostles. Therefore, it is appropriate that in the hereafter they will not receive help from Allah and will be kept away from His mercy."
		   },
		   {
			"id": 5253,
			"surah": 67,
			"ayat": 12,
			"tafsir": "This verse explains the signs of pious people who are submissive and obedient to Allah, and believe that Allah knows everything they do both visible and hidden. These signs are: 1. Always fear Allah's punishment even though the punishment is something unseen, invisible and it is not certain when it will come. 2. Feeling afraid of the coming of the Doomsday, because they remember the havoc that will happen to them if they deny Allah, such as the events that will occur on the day of reckoning, the day of reckoning, and the unimaginable punishment of hell. 3. Have faith and believe that God is always watching, watching, and knows where and in what condition they are at all times. In the hadith of the Prophet Muhammad it is stated: From Abu Hurairah he said, the Messenger of Allah said, \"A person who cries out of fear of Allah will not enter hell. (History of at-Tirmidhi, an-Nasa'i, Ahmad, al-hakim, and others) Those who truly believe in Allah and do good deeds, there is no concern for themselves and they do not grieve over anything that escapes them, as Allah says: Indeed, those who believe, do good, pray , and paying zakat, they will be rewarded by their Lord. There is no fear of them and they are not sad.(al-Baqarah\/2: 277) Those who believe and obey Allah always feel that they are under supervision from Him. They believe that He sees and cares for them, as the Prophet Muhammad said in the context of ihsan: You worship Allah as if you see Him, so if you do not see Him, then truly God sees you. (History of al-Bukhari, Muslim, and Abu Hurairah) Allah promises that believers who are like that will be forgiven for their sins and will be given a great reward in the hereafter."
		   },
		   {
			"id": 5254,
			"surah": 67,
			"ayat": 13,
			"tafsir": "According to the history of Ibn 'Abbas, he said, \"At one time the polytheists gossiped about the Prophet Muhammad and badmouthed him, so Allah revealed to him everything they were talking about. Then some of them said to some of the others, \"Lower your voice so that the words -your words were not heard by the Lord Muhammad.\" So this verse was revealed which, among other things, explains that there is nothing that Allah escapes the knowledge of. In this verse, Allah again explains that He knows everything that is kept secret and everything that is born by His servants. Him, whether in the form of words, deeds, and everything that is felt by the heart and the five senses. All of this does not escape Allah's knowledge in the slightest, because He is All-Knowing of all the contents of the heart. From this verse it can also be concluded that all prayers offered to Allah, whether in a loud voice, whispering, gently or with the movement of the heart will be known by Allah."
		   },
		   {
			"id": 5255,
			"surah": 67,
			"ayat": 14,
			"tafsir": "This verse seems to warn polytheists who do not believe in the breadth and detail of Allah's knowledge, that God is All-Knowing of all that is in the heavens and the earth, however small, however far hidden, and knows the words that are kept secret. In fact, Allah's knowledge can penetrate even the thickest and strongest walls and even the most hidden things. If disbelievers were to use their reason, of course they would think that the one who created this entire universe, including the earth and everything in it, is God. The Creator must know the conditions and characteristics of His creation, both small and large. Therefore, whatever happens to His creation, Allah knows it in detail."
		   },
		   {
			"id": 5256,
			"surah": 67,
			"ayat": 15,
			"tafsir": "This verse explains the infinite blessings of Allah that He has bestowed on humans, by stating that Allah has created the earth and made it easy for them, so that they can take unlimited benefits for the benefit of their lives. He made the earth round and floated in the sky. Humans live on it like being in a flat place, calm, and not swaying. With the rotation of the earth there is night and day, so humans can work during the day and rest at night. The earth emits springs, which provide water for humans and their livestock to drink. With that water, humans irrigate their gardens and rice fields, as well as the ponds where they raise fish. With that water they also bathe and clean their dirty bodies, so they feel refreshed and comfortable. He also created hills, valleys, green mountains that soothe the hearts of those who look at them. From the crevices of the hills flowed rivers and between the hills and valleys that humans made roads that connected one country to another. How many blessings that Allah has bestowed upon mankind. If Allah withheld a favor from humans, for example not giving air to be inhaled, humans would experience great suffering. Who can deny Allah's many blessings? According to scientists, the Earth, which is enveloped in an atmosphere, is very dynamic. Geological processes ranging from erosion, deposition, sea level rise and fall, earthquakes, magma movement, to volcanic eruptions over a span of millions of years have made it possible for mineral and energy deposits to form. On the other hand, the sea and atmosphere are no less dynamic. Its interaction with the land and its journey with the moon around the sun shape the climate and seasons. These dynamic processes involving the land-sea and the atmosphere enable the hydrologic cycle to occur which in turn lowers rain and causes soil fertility and the formation of water reserves in lakes, rivers and in the soil. Oxygen and water, which are vital human needs, are abundant and very easy to obtain. This verse states that by His mercy to all mankind, God has not only provided all the facilities and infrastructure for humans. It has also made it easier for humans to live on the surface of the earth. Humans were commanded by God to walk on the surface of the earth to recognize both the place, its inhabitants, humans, animals and plants. Humans are not only given pleasant air, plants, animals and weather, but are also given the equipment and comfort to seek sustenance on earth with everything on it and contained within it. After Allah explained that this nature was created for humans and made it easy for their needs, He ordered them to walk on the face of the earth, to pay attention to the beauty of nature, try to cultivate this easy nature, trade, raise livestock, grow crops and seek halal sustenance. Because, everything that God has provided must be processed and cultivated first before it is used for the needs of human life. By understanding this verse, the following matters can be stated: 1. Allah commands humans to try and cultivate nature for their benefit in order to obtain lawful sustenance. This means that not wanting to try and being lazy is against God's commands. 2. Because trying and seeking sustenance includes carrying out God's commands, people who try and seek sustenance are people who obey Allah, and that includes worship. In other words, trying and seeking sustenance does not reduce worship, but strengthens and increases worship itself. Narrated by Ahmad from 'Umar bin al-Khatthab, in fact he heard the Messenger of Allah say: If you really put your trust in Allah, surely you will be given sustenance as Allah gives His sustenance to birds. Goes looking for sustenance with an empty stomach, and in the evening he returns to his nest with a full stomach. (History at-Tirmidhi, Ahmad, al-Baihaqi, and Abu Dawud from 'Umar bin al-Khaththab) This hadith shows that the time from morning to evening is the time to seek sustenance, as birds have done. If humans really want to try from morning to evening, Allah will surely give them sustenance. They will not starve. From this hadith it can also be understood that people who do not want to try will not be given sustenance by Allah. Narrated by al-hakim and at-Tirmidhi from Mu'awiyah bin Qurrah, he said, \"One day 'Umar bin Khaththab passed in the village of a people, then he asked the people, \"Who are you?\" They replied, \"We are people who put their trust in Allah.\" Umar said, \"You are not people who put your trust in Allah, but people who have been eaten by rust. As for those who put their trust in Allah, they are those who plant seeds in the ground, then put their trust in Allah.\" In seeking sustenance, Islamic teachings provide several guidelines: 1. So that every human being tries to provide for himself and his family. Therefore, people who leave from his house in the morning to seek sustenance, including people who were prayed by the Prophet Muhammad to be blessed by Allah. That the Prophet Muhammad said, \"O Allah, bless my people who set out to try early in the morning.\" (Narrated at-Tirmidhi from sakhr bin al-Gamidi ) 2.In trying, you should look for halal. The meaning is to seek sustenance by lawful means, not by stealing, cheating, corruption, and so on. The sustenance sought is halal sustenance, not haram, such as alcohol, carrion , and so on, in accordance with the hadith: From Ali that the Messenger of Allah said, \"Indeed, Allah Ta'ala likes to see His servants, in seeking lawful things.\" (History of ath-tha brani) Another hadith explains: From Anas bin Malik that the Messenger of Allah said, \"Seeking lawful sustenance is obligatory for every Muslim.\" (History of ath-thabrani) At the end of the verse, Allah gives a warning to humans that all creatures will return to Him on the Day of Judgment, and at that time all human deeds will be weighed. Good deeds are rewarded with multiple rewards, while bad deeds will be rewarded with the punishment of hell. Therefore, humans should always be introspective, try to do as many good deeds as possible and assess and examine the actions that will be done, try to ask Allah's forgiveness for mistakes that have already been committed or those that are unknowingly included in actions that are prohibited by Allah. So every Muslim should only seek halal sustenance, never eat sustenance obtained by illegal means or the object itself is an unlawful object. Remember that all beings without exception will return to Him. Allah is All-Knowing of everything."
		   },
		   {
			"id": 5257,
			"surah": 67,
			"ayat": 16,
			"tafsir": "In this verse, Allah warns the disbelievers about the punishment that will befall them if they remain in disbelief. This warning was given by Allah because they felt as if they would be spared from the torment of Allah that would be inflicted on them, they even felt that they had received grace, namely the worldly pleasures that they were feeling. The signs of disbelief can be seen in their attitudes, actions, and behavior. Therefore, Allah warned them by saying, \"O disbelievers, do you all feel safe and will be spared from the punishment of Allah, even though the punishment will surely befall you? Is it impossible for Allah to take away the power and pleasure that you gain, even though Allah's power and that pleasure comes solely from His grace? Is it not possible that it is a test from Allah to you? immersed into the earth. When God was about to immerse them into the earth, there was a great earthquake that shook the earth.\""
		   },
		   {
			"id": 5258,
			"surah": 67,
			"ayat": 17,
			"tafsir": "In this verse, Allah continues His warning, \"In the same way, do you feel safe and will you be spared from the punishment of Allah, which at any time can blow a wind mixed with stones that can destroy you all in an instant? Remember, this kind of punishment has befallen the people of Lut, because they have denied the Prophet Lut who was sent to them. At the time of the coming of the doom, you will all witness how terrible our punishment is, but your knowledge at that time will be of no use.\" In another verse, Allah says: Say (Muhammad), \"It is He who has the power to send doom upon you, from above or from under your feet or He mixes you in groups (which are contradictory to each other) and feels for some of you the ferocity of some others.\" Pay attention, how We explain repeatedly the signs (Our power) so that they understand (it). (al-An'am\/6: 65) Another word of Allah: So do you feel secure that He will not bury part of the land with you or He will blow (a strong wind that carries) small stones? And you won't get any protector. (al-Isra'\/17: 68)"
		   },
		   {
			"id": 5259,
			"surah": 67,
			"ayat": 18,
			"tafsir": "Then Allah ordered the disbelievers to pay attention to the suffering that the former nations had experienced, because they had denied the apostles who had been sent to them. Among them are like Noah's people who were drowned by a terrible flood, Shuaib's people who were destroyed by lightning, and Pharaoh and his people who were drowned in the Red Sea. They all just regretted what they had done when the doom came. Everything can be a lesson to contemplate and pay attention to how terrible God's punishment is inflicted on those who are disobedient to Him."
		   },
		   {
			"id": 5260,
			"surah": 67,
			"ayat": 19,
			"tafsir": "Allah explains that He is the Almighty, the Most Determining of all things. As one of the proofs is His power to hold back the birds that are in the sky, so they don't fall to earth. Birds that are in the sky sometimes fly by spreading their wings. It flies up or dives down, as if it were about to crash to the earth. Sometimes it flaps its wings. Who kept the bird from falling as it spread and closed its wings? Isn't this contrary to the law of nature that heavy objects will fall to the earth due to the attraction (gravity) of the earth? The same thing can also be seen in the verse below. Don't they see the subdued birds flying in the free sky. Nothing can hold him but Allah. Surely in that there are signs for those who believe. (an-Nahl\/16: 79) Scientifically it can be explained that birds can fly is unique. In order to fly, birds must be very light. In order to take off and continue to fly through the air, birds must be fairly light. At the same time, he must also be extremely strong and tough. Strength is needed to be able to stay aloft for long periods of time, and to maneuver to catch prey or when descending to where they perch. The bird's neck bones must be both strong and flexible. The number of cervical vertebrae varies, some are 11 some are more. Neck flexibility is obtained from a group of muscles that work very efficiently. Flexibility is required for various purposes. As in seabirds grabbing fish at very high speeds. Bird bones are generally hollow in the middle, and thin-walled. The weight of the bird's body is placed in the middle of the body. On the chest there is a large sternum which is attached to the large pectoral muscles. It is these pectoral muscles that move the wings. The pectoral muscles make up about 25-30% of the bird's total body weight. The chest muscles that work hard to move the wings are enough to interfere with the work of the lungs. To overcome this, birds have a different respiratory system. The respiratory system used is by spreading air sacs in all parts of the body. Such a pouch can also be found in the hollow central part of the bone. Air flows to all parts of the bird's body and is absorbed by the blood quickly. Absorption goes fast due to very strong heart rate. Sharp eyesight is the main requirement. Birds are animals that rely most on sight in their lives. In some birds, even the eyes are larger than the brain. Birds can see into the distance eight times better than humans. His eyes can adapt quickly to move from looking up close to seeing far, and vice versa. The most important thing for birds to fly is the presence of wing organs and feathers. The wings are a kind of hand that has a large and strong bullet joint at the shoulder. This joint is highly specialized, and is used for very complex mobility. Its purpose is for birds to maneuver properly in the air. Such a joint allows the wings to be positioned so that the bird can turn quickly, change direction, slow down, fly backwards, dive at high speed, and land gracefully. With the movement of expanding and closing its wings, the birds are actually flapping their wings to generate aerodynamic force, namely gathering sufficient air pressure under their wings, which will provide lift and thrust for the birds to be able to fly. . This lifting force is against the weight of the bird, while the thrust is against air resistance. Both of these forces are generated by the flapping motion of the bird's wings with continuous and periodic upward, downward and backward cycles. Truly Most Merciful Allah. If He wanted to remove air, surely the birds would not be able to fly. Wing feathers are a very beautiful creation of God. Light, yet strong, flexible, versatile, easy to care for, acts as a heat insulator, waterproof and replaceable. Feather color is very important for birds. Some birds have colors that match their environment so that they serve as camouflage. Another type uses its color to attract the opposite sex. Many types of birds migrate and travel great distances. In doing this, they have various ways to conserve energy for this long journey. The form of flying formations in groups that resemble the letter V in most ducks or grouse when migrating, actually has a specific purpose. This formation apparently saved energy for the entire group. This is because this V formation produces favorable airflow. At certain positions in this formation, individual birds can rest because they are supported by airflow patterns that allow them to rest. Who is teaching them? Now we know that birds disappear from one place because they move to another. We know when they left, where they headed, and which route they chose. Sometimes they travel very far, like sandpipers. This bird migrates from Canada (in the north of the Americas) to Tierro del-Fuego (at the southern tip of the Americas). Several types of swallows fly as far as 10,000 km from Alaska to Patagonia, Chile. Swallows in Scandinavia (northern Europe) fly south to Africa in winter. The tiny warbler, weighing less than an ounce, flies at night from Germany to Africa in the dead of winter. Uniquely, this bird flies individually. Does not fly in groups like other bird species. The Arctic Tern is a long-distance flying champion. They mate and raise their young at the North Pole during the summer, and spend the winter at the South Pole. Allah said: Do you not know that Allah: to Him exalts what is in the heavens and on earth and (also) birds by spreading their wings. Each of them already knows (how to) pray and his tasbih, and Allah is All-Knowing of what they do. (an-Nur\/24: 41) We know that birds can fly, because Allah 'holds them in the air. They migrated along mysterious paths to carry out God's plan. They fly as part of the tasbih to Allah the Creator. The turtledove doesn't want to be an eagle. The crow doesn't care that the color of its feathers is not as beautiful as the parrot. Honey-eating birds will not try to catch fish in exchange for honey. That is a lesson for all of us who can think. Who taught the bird to fly spread its wings? In fact, who created the bird with a certain shape, and equipped with organs (tools) so that it is able to fly and not fall to the earth? Why can't horses fly like birds? If humans want to think about all that has been mentioned, they will be sure that Allah is the Most Creator, Almighty, Most Gracious, and All-Knowing of all that He has created."
		   },
		   {
			"id": 5261,
			"surah": 67,
			"ayat": 20,
			"tafsir": "Allah denounces the disbelievers who worship idols other than Allah with the form of a question which states that no one will come to help them and release them from Allah's punishment. They have been deceived by Satan's whispers that instill confidence in their hearts that these idols can help and grant their requests. In reality this is not the case. The idols themselves cannot do anything at all, on the contrary it is man who determines everything for himself. The disbelievers were deceived by satan's whispers. Therefore, Allah says: And they worship besides Allah what does not benefit them and does not (also) bring them disaster. Disbelievers are helpers (devils to commit disobedience) against their Lord. (al-Furqan\/25: 55) The word \"min dunir-rahman\" (other than Allah, the Most Gracious) implies that Allah's mercy is bestowed on all creatures in this world, both those who believe in Allah and those who disbelieve. Likewise for animals, plants, and so on, so that all of them can live and develop. However, in the afterlife, this grace will only be given to those who believe. Allah said: Say (Muhammad), \"Who has forbidden the ornaments that Allah has prepared for His servants and the good sustenance? Say, \"All this is for those who believe in the life of this world, and especially only them) on the Day of Resurrection.\" Thus We explain the verses for those who know. (al-A'raf\/7: 32)"
		   },
		   {
			"id": 5262,
			"surah": 67,
			"ayat": 21,
			"tafsir": "To those disbelievers who deny Allah's sustenance, a statement is made in the form of a question that no one can provide sustenance, if Allah withholds from giving it to them. They were asked to contemplate if Allah would no longer send down rain, kill all vegetation so that the entire surface of the earth is dry and barren, kill all livestock that can be eaten, make the sun stop rising on the eastern horizon and make the day continuously bright without changing to darkness. , how and where will they get sustenance? Then it was explained that in fact the disbelievers believed in the oneness and power of Allah. They associate partners with Allah only because of their pride and reluctance to accept the truth for fear of losing their position and influence in society. Pride and denial arise and are nourished by Satan's deceit and temptation, which always creates a feeling in their minds and dreams that their bad deeds are good and commendable. Indeed, that is the purpose of Satan's life in this world. Allah said: (Allah) said, \"Then come down from it (Paradise); for you should not boast in it. Come out! Indeed, you are among the despicable creatures.\" (Devil) replied, \"Give me a reprieve, until the day they are raised.\" (Allah) said, \"Yes, you are among those who were given a reprieve.\" (al-A'raf\/7: 13-15)"
		   },
		   {
			"id": 5263,
			"surah": 67,
			"ayat": 22,
			"tafsir": "In this verse, Allah gives a comparison to humans between the journey of life taken by disbelievers and that taken by those who believe. This comparison is given in the form of a question which states that a person who always falls or falls over when walking and his feet always stumble because he is going through a rocky and potholed road, is unlikely to be safe and walk faster to reach his destination compared to someone who walks in an awkward atmosphere. in a good and safe way, on level and smooth roads, and in good weather. The comparison in the verse above is presented in the form of a question sentence. The sentence in question in this verse is not intended to ask something that is not known, but to state a purpose, namely that the actions of unbelievers are unrighteous. It is stated that the life journey of the disbelievers is a journey of life leading to extreme misery and suffering. It is as if this verse states that of course people who walk face down with their faces sweeping the ground will easily get lost on their way across the oceans of life in this mortal world, while in the hereafter they will be put into a fiery hell. Whereas a person who walks in a good way, takes a good and straight path, that is the path that Allah pleases, will not get lost in the journey of his life in this world and will surely arrive at the destination he wants and Allah approves. In the afterlife, they will occupy a paradise full of enjoyment that Allah has provided for those who are pious. Furthermore, it can also be understood from this verse that humans in carrying out their business, carrying out work, and fulfilling their obligations must be based on Islamic religious provisions, scientific instructions, common sense and experience, as well as the results of research by previous experts. It is intended that his efforts and work produce good results. Do not act blindly or work at will, because doing so will only invite failure and disaster, both for yourself and for others."
		   },
		   {
			"id": 5264,
			"surah": 67,
			"ayat": 23,
			"tafsir": "Furthermore, in this verse, Allah tells people to pay attention to their own events. Allah ordered the Prophet Muhammad to tell the disbelievers that it was Allah who bestowed on humans ears so that they could listen to the teachings of His religion conveyed to them by the apostles. Allah also bestows upon them eyes so that they can see, perceive, and pay attention to the events of this universe. He gave them hearts, minds, and minds to think, contemplate, weigh, and distinguish what is good for them and what is not good, what is beneficial and what is not. Actually, with God's grace, humans can achieve all that is good for themselves as His creatures. Verily hearing, sight and heart are one unit. Hearing and vision are tools used by humans to be able to understand the verses of Allah, sunatullah, which can be used (applied) in the development of science and technology, to be able to meet human needs. The method of observation (observation) in scientific and technological discoveries, is very dependent on the use of hearing and vision devices. However, if only hearing and visual aids are used, and ignoring the heart (al-af'idah) in the decision to implement them, then the result will be counter productive, that is, it will provide results that have more harm than benefits. In essence, the heart (al-af'idah) must be used as a guide in making decisions for the application of science and technology, which is produced by the hearing and sight method. From this al-af'idah can be developed ethics of science and technology (science ethics) which is based on Islamic values. Very few people want to thank God for the blessings He has given. Very few people are aware of their dependence on these blessings, even though if even a little bit of the favor is delayed or revoked by God, they feel they are in great trouble. It was then that they remembered Him. However, when they get back the favors and the hardships have passed, they return to disbelief in Allah."
		   },
		   {
			"id": 5265,
			"surah": 67,
			"ayat": 24,
			"tafsir": "Allah ordered the Prophet Muhammad to convey to the disbelievers that He had created them all in different shapes and colors of skin, prepared a place for them on earth and scattered them all over the earth. Allah is also the one who makes it easy for them to control and cultivate the earth for their lives and lives. Therefore, only to Allah will they return and be accountable for all the deeds they have done while living on earth. In the afterlife Allah will reward them fairly. Good deeds are rewarded with multiple rewards, while bad deeds are rewarded with the torments of hell fire in proportion to their bad deeds."
		   },
		   {
			"id": 5266,
			"surah": 67,
			"ayat": 25,
			"tafsir": "The disbelievers asked Rasulullah SAW with the intention of ridiculing and opposing them about when the crumbling of the earth would befall them, strong winds mixed with stones that blew and threw them, as the doom that is often mentioned will befall the disbelievers? When will the Day of Judgment come when on that day all human actions while living in the world will be accounted for, and they as disobedient people will go to hell? They asked for everything to be explained, if the Prophet was one of those whose words could be trusted. From the questions of these disbelievers it was understood that they were challenging the truth conveyed by the Prophet, because according to those who were threatened it was impossible. According to them, Muhammad and his followers should be punished, and in fact they have been punished by Allah in the world, in the form of misery and torment inflicted on them such as poverty, destitution, and the punishment given to them by the infidels of Mecca. Those disbelievers said that what Muhammad and his followers would receive in the afterlife would be heavier than the torments they would receive in this world."
		   },
		   {
			"id": 5267,
			"surah": 67,
			"ayat": 26,
			"tafsir": "In this verse, Allah ordered the Messenger of Allah to answer the words of the disbelievers by saying, \"O disbelievers, only Allah knows everything you are asking about. Because, regarding when the punishment will come, and the Day of Judgment will be included in the unseen knowledge, only Only Allah knows. Regarding me, I am none other than Allah's messenger and messenger who was given the task of conveying His religion to all of you, so that you will be happy living in this world and in the hereafter. I have been commanded by Him to convey the news to you that doom will surely come those who disbelieve and the Day of Judgment will surely occur. In another verse Allah says: People ask you (Muhammad) about the Day of Judgment. Say, \"Knowledge about the Day of Judgment is only with Allah.\" And do you know, maybe the Day of Judgment the time is near.(al-Ahzab\/33: 63) From that answer it can be understood that the Messenger of Allah was just an ordinary human being and had the qualities and abilities you are like a normal human being anyway. The strength lies only in the task given to him. Besides being like an ordinary human being, he was given the task of conveying Allah's religion. Therefore, he does not know the knowledge of the unseen unless Allah informs him. His job is not to make someone a believer, but solely to convey Allah's religion and explain it to people. In another verse, Allah says: We know better about what they say, and you (Muhammad) are not coercive against them. So give a warning with the Qur'an to anyone who fears My threat. (Qaf\/50: 45) Another Word of Allah: It is not your (Muhammad) obligation to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272)"
		   },
		   {
			"id": 5268,
			"surah": 67,
			"ayat": 27,
			"tafsir": "This verse explains that the hearts of disbelievers shrink and the color of their faces changes after believing in the imminent arrival of the doom promised on the Day of Resurrection and the awesomeness that will befall them on that day. They are in a state of constant fear and remorse. At that time the angel said, \"This is the Day of Judgment and Allah's punishment that you denied while living in the world before, even you always begged for his coming.\" In another verse, Allah says: And it is clear to them what evil they have done and they are overwhelmed by what they used to make fun of. (az-Zumar\/39: 48)"
		   },
		   {
			"id": 5269,
			"surah": 67,
			"ayat": 28,
			"tafsir": "Rasulullah SAW called on the disbelievers to believe in Allah Almighty and explained that those who worshiped idols were stupid people, because they worshiped something that could not bring benefits and harm. As a reaction to the Prophet's call, they said to their friends, \"Just wait until our god kills or harms Muhammad and his followers. If they have been destroyed or all killed, of course they will stop propagating their religion on their own. Only then will we be free from his disturbances and incitement.\" Isn't Allah sufficient for His servants? They frighten you with (worship) other than Him. Whoever is allowed to go astray by Allah, no one can guide him. (az-Zumar\/39: 36) Allah rebutted their words by ordering the Prophet Muhammad to tell them, \"O polytheists, try to explain to me, what benefits and benefits will you get, if your prayers are allowed by idols whom you worship besides Allah, while I and all those who believe are destroyed and all die? Will the destruction of me and those who believe with me free you from the punishment of Allah which you disobeyed? Do you not remember that it has become His decree, that the punishment is still given to everyone who disbelieves in Him and always does evil? Have you never thought about the result of your prayer, O disbelievers? If I and my followers all died and were put in heaven that He promised us, will you escape Allah's punishment, and who can deliver you from Allah's punishment?\" The answer given by Rasulullah SAW above was a very appropriate answer and influenced the hearts and minds of the polytheists, because those who conveyed these words to them were people they trusted, respected, and recognized for their leadership. That person was the Prophet Muhammad whom they entrusted to settle the disputes that occurred between them, and they acknowledged that the solution was the most appropriate and fair settlement. Even though the teachings conveyed by Muhammad were different from the beliefs they adhered to, Muhammad's personality was an answer that could be accepted by people who wanted to use their minds properly."
		   },
		   {
			"id": 5270,
			"surah": 67,
			"ayat": 29,
			"tafsir": "Allah commanded the Prophet Muhammad to say to the Meccan infidels, \"O disbelievers; I and my followers have believed in the Lord of the Worlds, God, the Most Gracious and Most Merciful to His servants, the Lord who decrees punish fairly. Only to Him do we surrender ourselves and all our affairs, because He is the one who determines our circumstances and only to Him do we ask for help, because only He gives help and gives us sustenance for our survival and life . Only He can deliver us from all the calamities and calamities that may befall us.\" This verse seems to denounce the attitude and actions of the disbelievers who worship the statues that they made themselves which cannot bring benefits and harm, and they even have to maintain and care for them themselves. Likewise the attitude of the disbelievers who are always proud of their wealth, power, and offspring, as Allah says: And they say, \"We have more wealth and children (than you) and we will not be punished.\" (Saba'\/34: 35) Because of this disbelief, they will not have the pleasures of life in the afterlife. Later they will know which of them and the believers have followed the right path and who has gone astray. Those who take the right path to a good place are full of enjoyment and those who take the wrong path will certainly arrive at a wrong place full of misery and suffering."
		   },
		   {
			"id": 5271,
			"surah": 67,
			"ayat": 30,
			"tafsir": "In this verse, Allah explains again the signs of His greatness and power, after in the last verse He ordered to put your trust in Him. Allah ordered Muhammad to say to the disbelievers, \"O disbelievers, try to explain to me, what has occurred to you, if by the will of Allah all the water that flows on the surface of this earth seeps into the ground, so that your water sources and wells dry up, your buckets can no longer draw water. Can another god of yours bring this water so that you can drink, your gardens become fertile again and your livestock can reproduce? Nothing can bring that water except Allah, Most Gracious and Merciful to His servants. Why do you still associate Him with something that is not worthy of Him?\" This verse instructs the disbelievers to compare the basis of divinity according to their understanding with the nature of the understanding of divinity according to the religion conveyed by Muhammad saw. The God who is worshiped according to what the Prophet taught is the God who created all creatures, and maintains the survival of all that lives in this world. He is Omnipotent and All-Determining of all things, does not need anything to help Him and so on. God is not created by humans or appointed by humans themselves to be worshiped, as the polytheists understand the divinity. This verse seems to remind them that the God who deserves to be worshiped is only God Almighty, who does not have children, is not born, is not associated with anything, and does not need other creatures to help Him carry out every matter."
		   }
	]
}
