{
	"tafseer": [
		{
			"id": 1902,
			"surah": 16,
			"ayat": 1,
			"tafsir": "God confirms that God's decree must come. The purpose of Allah's decree in this verse is the Day of Judgment which has been threatened to the polytheists and the disbelievers. They jokingly asked the Prophet that the doomsday doomsday would soon be brought. That is why, Allah commanded the Prophet Muhammad to say that Allah's punishment that would fall upon them would definitely occur. Allah swt forbade them not to ask for the doom to come hastily, because the doomsday doomsday will come at a time that has been determined and decided by Him. In this verse, Allah swt announces the coming of the Day of Judgment by using the past form of the verb (fi'il madhi) even though the punishment has not yet occurred. This gives an understanding that the doom will really happen. This verse contains a threat to disbelievers and at the same time contains a notification to them that the doom that will befall them and their destruction is near and certain to come. Allah swt states that He is the Most Holy of what they associate. He does not need allies and helpers to inflict punishment on them. This denial is in response to their statement that they will ask for help (syafa'at) to the statues they worship."
		   },
		   {
			"id": 1903,
			"surah": 16,
			"ayat": 2,
			"tafsir": "After the verse was revealed, the Quraysh asked, \"If Allah really has the power to punish His other servants, then who knows about this very occult thing that is not known by anyone except Him? This question only shows their denial regarding the events of the Day of Resurrection. Therefore, Allah ordered the Prophet Muhammad to say that the news was known from revelations sent down by Allah through angels. The explanation is put forward so that they can know that a person who receives a revelation means that he has received a prophetic task. What is meant by a spirit in this verse is revelation as it clearly means in another verse: ¦The one who sends down revelation by His command to whom He wills among His servants,¦ (al-Mu'min\/40: 15) And His word again: And thus We revealed to you (Muhammad) the spirit (Al-Qur'an) by Our command¦ (asy-Shura\/42: 52) The revelation was brought by the angels to the prophets solely because of Allah's command and not the will of the angels itself. As confirmed in other verses as follows: And we (Gabriel) did not come down except at the command of your Lord. (Maryam\/19: 64) And the word of Allah swt: They do not speak before Him and they carry out His commands. (al-Anbiya'\/21: 27) Revelation is given by Allah to His servants who are chosen and have the mental readiness to receive it. Use as a means to give a warning to the servants of God. Among other things, to convey the teachings of monotheism and convince them of the oneness of Allah, that there is no god who must be worshiped except Allah and He is the Lord of all creatures, while other gods are gods created by them who are far from the truth. Thus, it is obligatory for humans to devote themselves solely to Him because in this way humans will be safe from destruction and free from misguidance. In that verse there is an indication that the revelation came down from Allah to His prophet through the angels. In another verse it is stated: All believe in Allah, His angels, His books, and His messengers. (al-Baqarah\/2: 285) Angels are mentioned before the apostles to state that angels receive revelations from Allah without intermediaries. While what is meant by the books is the revelation conveyed by angels to His prophets. At the end of this verse, Allah swt emphasizes that humans should fear only Him. This is a call addressed to those who believe to remain fearful of Him. It is also addressed to the disbelievers of Quraysh who oppose the impending doomsday so that they stop their polytheism and leave the traits that oppose the provisions that come from Allah due to their haste in rejecting something that is not yet believed to be true."
		   },
		   {
			"id": 1904,
			"surah": 16,
			"ayat": 3,
			"tafsir": "Allah swt explained that He created the things that are in the heavens and the things that are on the earth correctly. The meaning is according to His wisdom and wisdom and nothing is in vain. He created everything without anyone's help and assistance. It is enough for him to create things and laws that apply to him, so that things function according to his laws. There is no other substance that has the power to create, regulate, and control the heavens, the earth and all that is in it. As a consequence, it is not appropriate if there are people who serve themselves to gods other than Him. Therefore, Allah states at the end of this verse that He is Holy from what they associate. (Further information can be seen in the tafsir of surahh Ibrahim\/14: 19). The creation of the heavens and the earth with truth (true) can also mean that God created the earth not in a playful way. Everything was just so right for the start of life on this earth. How comfortable the earth is compared to several other planets in the same solar system, we can see in the description below. In the comparisons made, especially at the distance between the sun and each planet, it can be seen that the effect of the distance with each planet. What is written above is only part of the \"design decisions\" that God made so that life on earth can exist and survive. But even this bit is enough to show that the existence of the earth is not by chance. Nor is it formed by a series of random events. These and countless other details reassure a simple and pure truth. Allah and Allah alone created the universe, stars, planets, mountains and seas perfectly, gave life to humans and other living things, and placed His creation under human control. Allah and Allah alone, the source of forgiveness and power, is powerful enough to create something out of nothing."
		   },
		   {
			"id": 1905,
			"surah": 16,
			"ayat": 4,
			"tafsir": "Then in this verse, Allah explains the process of the occurrence of human beings that He created them from nutfah. In another verse it is explained that Allah created man from weak water. The incident went through a developmental process. In the womb, semen turns into 'alaqah (something that hangs on the wall of the uterus), then becomes a lump of flesh. After experiencing a period of 4 months, a perfect fetus begins to form, and after 9 months of events, the baby is released from its mother's womb into the natural world. After that, the baby still needs the help and care of his mother to be breastfed, cared for, and educated until he is an adult and can think perfectly. Man, who underwent a complicated and gradual process of creation, from a weak creature to a mighty one, suddenly denied the oneness of his creator and the day of resurrection, and became hostile to Allah's apostles, even though he was created only as a servant. Humans even forget the origin of the incident that he was created from a drop of water that does not have the slightest ability. They say frankly, as explained in the word of God: And surely they will say (also), \"Life is only in this world, and we will not be resurrected.\" (al-An'am\/6: 29) They also deny the resurrection of humans after death and becoming bones. God's Word: ¦He said, \"Who can give life to the bones that have been crushed?\" (Yasin\/36: 78)"
		   },
		   {
			"id": 1906,
			"surah": 16,
			"ayat": 5,
			"tafsir": "In this verse, Allah SWT explains the various kinds of pleasures that are provided for His servants in the form of livestock, such as camels, cows, goats, and so on. The pleasures obtained from these animals are such as their fur which can be made into woolen cloth, useful for protecting the body from cold air disturbances, and its skin can be made into shoes and other equipment. Likewise, milk and meat are beneficial to human health. In summary it can be said that livestock was created for humans so that they can be used as a source of fulfilling their needs."
		   },
		   {
			"id": 1907,
			"surah": 16,
			"ayat": 6,
			"tafsir": "Allah swt explained that humans get inner satisfaction and a beautiful view of livestock when they release and herd them in the morning to grazing places. The same feeling is also felt in the afternoon when they shoo and herd the cattle back to their pens. The beauty that humans get from livestock includes God's favors given to His servants."
		   },
		   {
			"id": 1908,
			"surah": 16,
			"ayat": 7,
			"tafsir": "Then Allah mentions another of His blessings that humans get from livestock, namely transporting goods or heavy human burdens from one place to another where they are unable to carry them themselves. Allah said: And verily in livestock, there is a lesson for you. We give you to drink from (the milk) that is in his stomach, and in it there is also a lot of benefit for you, and some of it you eat. (al-Mu'minun\/23: 21) And His words: It is Allah who made livestock for you, some for you to ride and some for you to eat. (al-Mu'min\/40: 79) Then Allah swt confirms that He is Most Gracious and Most Merciful. Allah's compassion is mentioned in this verse so that humans can be grateful for Allah's blessings that they get from livestock, which are very useful for them as a means of transportation which is very important for their lives. Allah swt said: And do they not see that We have created livestock for them, that is, part of what We have created with Our power, then they control it? (Yasin\/36: 71)"
		   },
		   {
			"id": 1909,
			"surah": 16,
			"ayat": 8,
			"tafsir": "Furthermore, Allah swt mentions several other livestock that are beneficial to human life, namely Allah created horses, mules, and donkeys to be ridden and used as pleasant pets. There is a group of jurists who forbid horse meat. They put forward the reason that the horse was created by Allah to be used as a vehicle not to be eaten. This reason is reinforced by the text of the verse which mentions three types of livestock. This shows that it is forbidden to eat horses, donkeys and mules alike. If these three animals could be eaten, they would certainly be mentioned in this verse, because a person's need to eat is more acute than their need for a vehicle. However, the reasons stated above are not agreed upon by other jurists on the grounds that if this verse indicates the prohibition of horses, donkeys kept are of course included in it. If this is indeed the meaning, of course at the time of the Khaibar war there was no need to affirm the prohibition of eating domestic donkeys because the verse was revealed long before the Khaibar war. In addition, there are many arguments that allow eating horse meat, among them are: From Asma' ra, \"We sacrificed a horse during the time of the Prophet, then we ate its meat.\" (Al-Bukhari and Muslim) From Jabir ra, \"Rasulullah ordered us to eat horse meat and forbade us to eat domestic donkey meat.\" (History of Abu 'Ubaid, Ibn Abi Syaibah, at-Tirmizi, an-Nasa'i, and others) From Jabir ra, \"Rasulullah forbade eating domestic donkey meat and allowed eating horse meat.\" (History of al-Bukhari and Abu Dawud) Besides these hadiths, there are indeed hadiths that prohibit eating the meat of mule horses, and donkeys the Prophet forbade eating the meat of every beast with fangs, the meat of mule horses and domestic donkeys. (Ahmad's history) The hadith which forbids horse meat is daif because it contains the name of Salah bin Yahya whose memorization is doubtful. If this hadith is deemed valid, its strength value does not exceed that of other more numerous authentic hadiths which allow the eating of horse meat. In short, it can be said that the hadith prohibiting eating mule and donkey meat occurred before the Khaibar War. Therefore, it can be said that this hadith is sanctioned by a hadith which explains its ability. At the end of the verse, Allah mentions that He created all creatures that are unknown to humans, whether land, sea or space animals, which they can benefit from. However, until now the human mind has not come to the knowledge of the benefits of these creatures. All of this is intended so that humans can understand how extensive the blessings of Allah SWT are given to them that are unfailing."
		   },
		   {
			"id": 1910,
			"surah": 16,
			"ayat": 9,
			"tafsir": "Allah swt mentions His blessings that are useful for the benefit of the human soul, so that they know and are grateful to the Creator of the universe and this vast blessing. Allah explains that it is He who has supreme power to guide mankind through revelations to His messengers and commands them to obey them. It aims to bring people to the truth. Thus, whoever follows the guidance means that he will get happiness that is very useful for himself. However, whoever takes a misguided path, the consequences will be suffered and felt by himself. Allah swt said: And indeed, this is My straight path. Then follow! Do not follow (other) paths that will separate you from His path. Thus He commands you to be pious. (al-An'am\/6: 153) And His words: He (Allah) said, \"This is the straight path (to) Me.\" (al-hijr\/15: 41) And His words: Verily, We are the ones who guide. (al-Lail\/92: 12) Beside the straight path, there are paths that deviate from the truth. If people follow that path, they will not attain happiness. That path is the path of misguidance, which leads humanity to division and destruction. According to this verse, the straight path that leads people to obtain happiness is only the religion of Islam, which is the hanif religion, ordained by Allah and revealed by Him to the Prophet Muhammad, and in accordance with human nature. Allah swt said: So keep your face straight towards religion (Islam); (according to) Allah's fitrah because He has created humans according to that (fitrah). There is no change in Allah's creation. (That is) the straight religion, but most people do not know. (ar-Rum\/30: 30) Indeed, Allah has the power to guide all human beings to the religion of monotheism. However, Allah is Most Wise. He gives the right to vote to humans because they have reason and mind to use it properly. Allah also gives revelation guidance to humans through His messengers, so that they carry out the guidance based on their choice. Allah's Word: And if your Lord had willed, everyone on earth would have believed entirely. (Yunus\/10: 99) To encourage human interest in doing good deeds, Allah swt promises a reward. In an effort to eliminate their tendency to do bad deeds, Allah also gave a warning with a painful threat. This is intended so that people want to follow His instructions and avoid His prohibitions."
		   },
		   {
			"id": 1911,
			"surah": 16,
			"ayat": 10,
			"tafsir": "Allah mentions the favors that humans get from the sky directly or indirectly. God's favor that they receive directly is rainwater which can be used as drinking water and other needs in their daily lives, such as bathing, washing clothes, and so on. The falling rain also makes the hot air cool and refreshes the body. Meanwhile, God's grace that is obtained indirectly from rainwater is that water can irrigate rice fields and revive all kinds of plants. All these plants are very useful for humans and other creatures, such as humans can graze their livestock in the meadows. This verse is one of many that speak of rain and the fertility that results from it. For details on rain see surahh an-Nur\/24: 43 and ar-Rum\/30: 48-49. Meanwhile, a description of how rain plays a very important role in fertility can be seen in surahh Qaf\/50: 9-11."
		   },
		   {
			"id": 1912,
			"surah": 16,
			"ayat": 11,
			"tafsir": "With the same rain, Allah swt grows plants whose fruit can meet the needs of human life. From this type of grasses, humans obtain food for their livestock, from olives they obtain the oil needed by the body, and from dates and grapes they can obtain fruits as nutritional supplements for their food. Then it is also called all kinds of fruits, so that people can know His unlimited power. From the same water, Allah swt has power to grow various plants and produce fruits of various shapes, colors and tastes. All kinds of plants that produce materials that can meet the needs of their lives are blessings bestowed by Allah and at the same time as proof of His oneness for those who deny Him. At the end of this verse it is explained that all kinds of blessings that are sent down either directly or indirectly are proof of the truth that there is no god except Allah. The evidence can be known by those who pay attention and think about the signs of Allah's power and think about the laws that apply in them. The proofs of Allah's power found in nature are sufficient to satisfy those who really pay attention to His power and believe in His oneness. For example, consider seeds, either single or in two pieces, that lie on the surface of rain-soaked soil. Over time the seeds split open and the roots penetrate the soil surface. Then grow stems and leaves, then develop into large, flowering, and fruitful. One thing that attracts attention is that seeds that are almost the same shape give rise to a variety of plants and produce fruits that vary in shape, color, and taste. People who witness this will certainly see that the creator of all kinds of plants is definitely the Most Perfect Substance that cannot be competed with by other substances. He is the one who deserves to be worshiped and worshipped."
		   },
		   {
			"id": 1913,
			"surah": 16,
			"ayat": 12,
			"tafsir": "Allah swt explained that it is He who controls the night and day, as well as the sun and moon. All of that is for the benefit of humans and as a blessing created by Allah for them. Allah controls the day and night alternately. Night as a time to rest and sleep so that the mind is calm during the day. While the afternoon is the time to try to find sustenance to meet the necessities of life. Allah mentioned the sun and the moon. The sun is the cause of day and night. When the sun appears on the horizon in the eastern sky, it means that it is already noon. The longer the sun rises and moves in the sky slowly and when it has sunk on the western horizon, it means night has come. The sun as a source of energy is very necessary for all living things on the surface of the earth, such as humans, animals and plants. The moon travels faster than the sun one moment it takes the form of a crescent, a few days later it increases in size, and finally becomes a full moon. After that, the light began to decrease and its shape returned to a crescent shape, and finally disappeared completely. From the various changes in the shape of this month, people can find out the calendar which is very useful for the implementation of worship. In short, it can be said that these celestial bodies are God's great blessings for humans, and are beneficial to their life or knowledge. Allah swt mentions that He controls the stars moving in their own orbits with the laws that He has established. His movements are so regular and fixed, so is his position. This gives instructions to humans to know their position on earth by referring to the positions of the stars, both on land, in the sea and in the air, especially when other identifying signs and markings cannot be seen. At the end of the verse, Allah swt emphasizes once again that the sun, moon and stars are clear signs for those who want to think about the signs of Allah's power and can understand the laws that apply in nature. This implies that contemplating the signs of Allah's power in the sky is not obtained by mere vision but by contemplating and thinking with common sense. This is caused by the location of these objects which are very far from the earth, so humans cannot see them with the naked eye. In contrast to paying attention to the signs of Allah's power found on the surface of the earth. In this case with a glance at the signs of Allah's power that are within their reach, people will be able to know the majesty of their Creator."
		   },
		   {
			"id": 1914,
			"surah": 16,
			"ayat": 13,
			"tafsir": "Allah explained that He also controls all kinds of objects that He created, both those objects that only exist on the surface of the earth, such as various kinds of livestock and plants, as well as objects that are found in the bowels of the earth, such as minerals and minerals. All that was created by Allah is diverse in types, forms, and benefits. At the end of the verse it is explained that actually in the blessings that Allah has created in various forms there are signs of Allah's power for those who take lessons. That is for those who understand how great the blessings of Allah that have been given to them and are grateful by using them as they should and according to their needs according to Allah's pleasure."
		   },
		   {
			"id": 1915,
			"surah": 16,
			"ayat": 14,
			"tafsir": "Furthermore, Allah swt mentions the blessings in the ocean that are given to His servants. It is explained that He has controlled the seas for humans. The purpose is to control all kinds of His blessings in the ocean so that humans can get food from the ocean in the form of fresh meat, namely all kinds of fish that humans get by catching them. The likening of fish to fresh meat is to understand that what is permissible to eat from all kinds of fish found in the ocean are those that are caught fresh, even if the animal dies without being slaughtered. However, if all kinds of fish obtained are not fresh, dead, especially if they have rotted, then they cannot be eaten for fear of endangering health. What is meant by animals that die in the sea are animals that die by themselves or due to other reasons so that they float on the surface of the water, not those that die because humans catch them. Rasulullah SAW said: Eat all sea animals that die from running out of water and eat all sea animals that are washed ashore from the ocean, but do not eat animals floating in the sea. (Hadith Daif narrated by Abu Dawud and Ibn Majah from Jabir) It is permissible to eat fish that die in the sea because the Prophet Muhammad saw said: The water in the sea is pure and its carcass is halal. (History of Imam Empat from Abu Hurairah) It should be understood once again that the carcasses of marine animals that are lawful to eat are animals caught by humans, those thrown ashore, those that died from running out of water, and those that were still fresh, not animals that died floating in the sea and has rotted. Furthermore, Allah SWT mentions another favor that can be obtained by humans from the ocean, namely in the form of jewelry. Among these are pearls and marjan . Pearls are jewelry obtained from the body of a type of lokan where the process begins with the insertion of some kind of hard object, sand or other foreign matter into the body of the lokan. Because it is very disturbing for his organs, lokan secretes a kind of liquid that can harden to wrap the hard object. This process continues continuously so that over time a kind of round and shiny object is formed, the color is bluish white, reddish or yellowish which is very beautiful to the eye. Those objects were taken out by humans from the lokan earlier, some were small and some were large according to how long the object had been in the lokan's body. That's what pearls mean. Another piece of jewelry is marjan, a type of plant that lives on the seabed and is similar to coral. Marjan is taken by humans from the ocean and made into necklaces, bracelets or other very beautiful jewelry. All of that is in the form of God's grace given to humans that is priceless. Another benefit given to humans from the sea is that they can make it a means of shipping traffic, both by sailing ships and engine ships. These ships go back and forth from one country to another to transport all kinds of trade goods, thus facilitating trade between these countries. From that trade, humans get sustenance because of the profits they get. Allah's favors are mentioned so that humans are grateful for all the blessings He has given them. It is also intended so that humans can understand how great the grace of Allah that has been bestowed upon them and take advantage of this incomparable blessing to worship Him and their own well-being."
		   },
		   {
			"id": 1916,
			"surah": 16,
			"ayat": 15,
			"tafsir": "Allah swt also mentions the favors that humans get indirectly. He created mountains on the earth so that the earth would not shake. Thus, the animals and humans who are on the surface can live in peace. The picture that can be taken from this verse is that mountains were created by Allah as maintainers of the earth's balance so that it can rotate calmly. Regarding the calmness of the earth because of the presence of mountains, it can be likened to the calmness of a boat on water. If the boat is not loaded, it is easily shaken by the waves. But if given a load that is heavy enough, then the boat is not easy to roll. Allah swt created rivers on the surface of the earth that flow from one place to another as a favor given to His servants. The river functions as a source of irrigation that can be regulated to irrigate rice fields and fields, so that humans can grow crops to meet all kinds of their needs. In addition, rivers can also be used as a means of traffic for the benefit of transporting human merchandise. Allah also created land that can be used as a means of communication and transportation from one country to another. These roads started from the coast, through the forests, and encircled the mountains, so that people could reach their destination without getting lost elsewhere. That is why at the end of this verse, Allah SWT mentions that the benefits of these paths are for humans to receive guidance. It means not getting lost without a destination. Allah's Word: And We have made solid mountains on this earth so that it (will not) shake with them, and We made (also) wide roads there, so that they may be guided. (al-Anbiya'\/21: 31) Verse 15 of surahh an-Nahl\/16 also implies how geological processes work, which are basically in the form of a never-ending cycle. When the erosion process occurs, all the eroded material is spread out and deposited in lower places, even reaching the lowest areas such as the troughs in the west of the island of Sumatra or in the south of the island of Java. This accumulation of material due to erosion over millions of years is simultaneously squeezed by plates that are constantly moving and gradually produce mountains. Geological processes always lead to a measurahble balance. In towering mountains, this weight presses down on the earth's crust beneath and causes the earth's crust to bend deeper, like a root that goes deep and stabilizes the earth. So, beneath the mountains there are roots whose thickness is proportional to their (measured) weight. An example of this phenomenon is under the towering Himalayas there are deep roots."
		   },
		   {
			"id": 1917,
			"surah": 16,
			"ayat": 16,
			"tafsir": "Besides that, Allah swt created the mountains as a sign that humans can use as a guide to know where they are. If someone sails on the ocean and can still see land signs, the mountains are a sign for him to determine the position and position of his boat. Furthermore, Allah SWT also explained that He created the stars which can also be used as a guide. Stars are used by travelers on land, sailors and pilots as a guide at night when signs cannot be used anymore. Because in the dark night, only the starlights were the clearest to them. Humans can take guidance from the stars by getting to know the clusters of stars which in astronomy have been given separate names. Of course, those who can use the stars as a guide are those who have been able to distinguish each star cluster and know when it rises and sets. The star clusters are used as a guide in determining their position on the earth's surface."
		   },
		   {
			"id": 1918,
			"surah": 16,
			"ayat": 17,
			"tafsir": "After that, Allah swt silenced the polytheists and broke the reasons they put forward because they did not want to pay attention to the signs of Allah's power and continued to wallow in their polytheism. Allah swt told them to pay attention to whether those who created all kinds of favors given to humans were the same as the statues they worshiped which could not create anything. Why don't they take lessons from the various kinds of favors so that they will know who really deserves the highest authority, and determines all kinds of events according to his will. In fact, if they want to contemplate natural events and all of its contents and all kinds of blessings that are obtained, they will certainly abandon the worship of statues which has become the tradition of their ancestors."
		   },
		   {
			"id": 1919,
			"surah": 16,
			"ayat": 18,
			"tafsir": "Allah then emphasized that if humans want to count His blessings, of course they will not be able to determine the number because the human mind is very limited, while Allah's blessings are so wide. Therefore, the human obligation is only to be grateful for these blessings and use them to meet the needs of his life and serve the community in accordance with the guidance and pleasure of Allah. At the end of the verse it is emphasized that Allah is Most Forgiving and Most Merciful. Forgiveness is mentioned in this verse because most people are grateful for a small portion of the blessings they receive, while they simply forget about the vast blessings. The mention of the words Most Merciful shows that Allah will not give punishment to them immediately because of their disobedience to Allah's Most Extensive grace."
		   },
		   {
			"id": 1920,
			"surah": 16,
			"ayat": 19,
			"tafsir": "Allah swt explained that He is All-Knowing of all that is kept secret by humans. That is, Allah knows what is in the hearts of people, which is different from what they say and do. Even though humans keep secret in their hearts what really happened and no one can know about it, later on the Day of Judgment that secret will be revealed by Allah to everyone. Allah will reward those who do good according to their virtues, and punish those who do evil according to their crimes. Allah Himself will ask them whether they are grateful or even deny the favors He has given them."
		   },
		   {
			"id": 1921,
			"surah": 16,
			"ayat": 20,
			"tafsir": "After that, Allah SWT explained to the polytheists how the actual statue was. This is an affirmation of their stupidity that cannot judge the true state of the statues they worship. Allah swt stated that people who worship gods other than Allah mean worshiping something that cannot create anything. What they worship are only creatures created by Allah. So the statues and other offerings cannot have any influence because they are only the result of the human sculpture itself. Allah swt said: He (Ibrahim) said, \"Do you worship the statues that you carve? Even though it was Allah who created you and what you did.\" (as-shaffat\/37: 95-96) This question was the expression of Prophet Abraham's feelings when he saw his people worshiping statues. This shows the truth of the words of the Prophet Abraham because the statues were mere human creations."
		   },
		   {
			"id": 1922,
			"surah": 16,
			"ayat": 21,
			"tafsir": "Allah swt then explained that the idols were inanimate objects. The idols cannot think of how to grant the prayers they ask. Allah swt emphasized that the statues are not living things that can have an effect, both for himself and outside himself. Those idols, whether worshiped or not, will not provide any benefit and will not cause harm. At the end of the verse, Allah swt confirms that the idols will not know and feel when their worshipers are resurrected. Only Allah, the creator of the universe and its contents, knows about it, while the statues will not know anything because they are only inanimate objects."
		   },
		   {
			"id": 1923,
			"surah": 16,
			"ayat": 22,
			"tafsir": "Allah swt explains that the God that all human beings must worship and obey is God Almighty. Affirmation with the Almighty, gives an understanding that only He deserves to be worshiped. Therefore, it is He who must be obeyed by all human beings and may not appoint other gods as His allies. After that, in this verse it is explained that disbelievers associate partners with Allah with other gods because they do not want to acknowledge the oneness of Allah, His promises and threats, and the occurrence of the Last Day. That is why they disobeyed anything that was conveyed by the Prophet Muhammad, even though the news conveyed contained news about the power and truth of Allah and the extent of the blessings given to humans. Their hearts have been closed, even though they have been told that their worship is not true. The one who should have the right to be worshiped is Allah Almighty, but they still don't want to believe. At the end of the verse, Allah swt confirms that they are arrogant people and do not want to accept the truth. They do not want to submit to the truth, continue to deny it, and blindly follow their ancestors. Allah swt said: Did he make the gods only one God? Really, this is really something very astonishing. (shad\/38: 5) And when only the name of Allah is mentioned, the hearts of those who do not believe in the hereafter are very upset. However, when the names of worshipers other than Allah are mentioned, they suddenly become happy. (az-Zumar\/39: 45) They even said, \"Indeed, we found our ancestors adhering to a religion, and we received instructions to follow in their footsteps.\" And so it is also when We send a warner before you (Muhammad) in a country, people who live luxuriously (in that country) always say, \"Indeed we found our ancestors following a (religion) and indeed we are only followers of the footsteps of -trace them.\" (az-Zukhruf\/43: 22-23) (23) There can be no doubt, Allah already knew the polytheists' denial of the revelations that had been given to the Prophet Muhammad that they had hidden in their hearts. Allah also knows what they claimed against the Prophet Muhammad and their accusations that he made up fake news. At the end of the verse it is explained that Allah does not like arrogant people who do not want to believe in His oneness and are reluctant to follow the call of His prophets and messengers. This statement shows how angry and hated Allah is towards them and their attitude that does not understand their own position. In another verse, Allah swt threatens that arrogant people will be put into hell. Allah swt says: Verily, those who are arrogant and do not want to worship Me will enter the Hellfire in a state of humiliation. (al-Mu'min\/40: 60) The Messenger of Allah said: The person in his heart will not enter paradise with the arrogance of a mustard seed, and he will not enter hell in whose heart there is a mustard seed of faith, then said a man, \" O Messenger of Allah, what if a man wants his clothes to be nice and his sandals to be nice? Then the Messenger of Allah replied, \"Indeed Allah is beautiful, loves beauty. Arrogance is not wanting to accept the truth and insulting humans.\" (History of Muslim, Abu Dawud, at-Tirmidhi, and Ibn Majah, from Ibn Mas'ud)"
		   },
		   {
			"id": 1924,
			"surah": 16,
			"ayat": 23,
			"tafsir": "Allah swt explains that the God that all human beings must worship and obey is God Almighty. Affirmation with the Almighty, gives an understanding that only He deserves to be worshiped. Therefore, it is He who must be obeyed by all human beings and may not appoint other gods as His allies. After that, in this verse it is explained that disbelievers associate partners with Allah with other gods because they do not want to acknowledge the oneness of Allah, His promises and threats, and the occurrence of the Last Day. That is why they disobeyed anything that was conveyed by the Prophet Muhammad, even though the news conveyed contained news about the power and truth of Allah and the extent of the blessings given to humans. Their hearts have been closed, even though they have been told that their worship is not true. The one who should have the right to be worshiped is Allah Almighty, but they still don't want to believe. At the end of the verse, Allah swt confirms that they are arrogant people and do not want to accept the truth. They do not want to submit to the truth, continue to deny it, and blindly follow their ancestors. Allah swt said: Did he make the gods only one God? Really, this is really something very astonishing. (shad\/38: 5) And when only the name of Allah is mentioned, the hearts of those who do not believe in the hereafter are very upset. However, when the names of worshipers other than Allah are mentioned, they suddenly become happy. (az-Zumar\/39: 45) They even said, \"Indeed, we found our ancestors adhering to a religion, and we received instructions to follow in their footsteps.\" And so it is also when We send a warner before you (Muhammad) in a country, people who live luxuriously (in that country) always say, \"Indeed we found our ancestors following a (religion) and indeed we are only followers of the footsteps of -trace them.\" (az-Zukhruf\/43: 22-23)"
		   },
		   {
			"id": 1925,
			"surah": 16,
			"ayat": 24,
			"tafsir": "Allah swt explains the arrogance of polytheists, that is, when asked what Allah has sent down? They also replied that Allah did not reveal anything to Muhammad. What Muhammad recited was nothing but the tales of the ancients which he took from ancient books. Such remarks illustrate their arrogance towards the Messenger of Allah and the word of Allah. Allah swt said: And they said, \"(It's just) the fairy tales of the ancients, who were asked to write down, then read the fairy tales to him every morning and evening.\" (al-Furqan\/25: 5) Their arrogance towards the Prophet Muhammad is described in words such as their accusation that the Prophet Muhammad was a sorcerer, poet, and sorcerer. Some even exaggeratedly accused him of being mad. Their arrogance towards the Prophet Muhammad was not only seen from their words, but really had penetrated their souls and flesh and blood. Allah swt said: Verily he has thought and determined (what he determined), so woe to him! How did he determine? Again, woe to him! How did he determine? Then he (contemplated) thought, then his face was sour and sullen, then turned away (from the truth) and boasted, then he said, \"This (Qur'an) is only magic learned (from the ancients). This is only human words.\" (al-Muddatstsir\/74: 18-25)"
		   },
		   {
			"id": 1926,
			"surah": 16,
			"ayat": 25,
			"tafsir": "Allah swt explained that their arrogant words caused them to bear their own sins and the sins of those who blindly followed those words. The person who follows is equated with the law of the person being followed because each of them has been given reason to judge the words of the people being followed. However, they do not use that reason so they follow without the slightest foundation. Meanwhile, those who are followed, besides bearing their own sins, also bear the sins of those who are led astray. They are considered heretics and the cause of other people's beliefs like theirs. The Messenger of Allah said: Whoever invites people to guidance (the religion of Islam), he will get the reward of those who follow him, and that does not reduce their rewards in the least. And whoever invites him to go astray, he will get a sin like the following sins, which does not reduce their sins in the least. (Ahmad and Muslim's history from Abu Hurairah) And the word of Allah: And they will really bear their own sins, and other sins along with their sins, and on the Day of Judgment they will surely be asked about the lies that they always had -held. (al-'Ankabut\/29: 13) They were threatened with serious threats because they judged the word of Allah conveyed to the Messenger of Allah with an unfair assessment. They have polluted their own minds and souls so that they dare to do all kinds of tricks to bring down the personality of the Apostle in front of his followers. They were given harsh threats because of the sins they had committed. They even bear the sins of those who follow them at the end of the day. Then God declared that the sin they carried was the most serious sin."
		   },
		   {
			"id": 1927,
			"surah": 16,
			"ayat": 26,
			"tafsir": "Allah explained that the deceit of the polytheists would only harm themselves. They will experience suffering as experienced by the previous people where they also belied their apostles with various kinds of deceit and various reasons. An example is what Pharaoh did when he asked his ministers to build a high tower to see the Lord Musa as the Word of Allah: And Pharaoh said, \"O Haman! Make me a tall building so that I can reach the doors, (i.e. ) the gates of heaven, so that I may see the God of Moses, but I still see him as a liar.\" And thus it was made pleasing to Pharaoh his bad deed, and he was shut off from the (right) way; and the Pharaoh's trickery was nothing but harm. (al-Mu'min\/40: 36-37) Then Allah swt described that the deceit they did to Rasulullah saw was like those who build houses. After the house was finished, God demolished the house from its foundations. After the foundation was destroyed and the pillars began to fall, the roof and the whole building fell down, so that they fell on themselves. They themselves did not feel in advance what would happen and what consequences they would have to accept for the actions they had committed. The consequences of their actions not only destroyed themselves, but also destroyed their families and descendants. This is an exact picture of how Allah swt thwarted their deception. Then Allah swt explained that they would receive punishment at a time when they did not expect it before and they were not aware of it. This shows that the results they encountered were not what they had previously expected. What happened to the previous ummah also applies to Muslims, where they think that with various kinds of deception, they can obstruct and destroy the message of Islam. However, on the contrary, the da'wah of Islam is increasingly widespread and the enthusiasm of its followers is becoming more and more steely. Finally they will experience destruction in various battlefields, especially during the Badr war."
		   },
		   {
			"id": 1928,
			"surah": 16,
			"ayat": 27,
			"tafsir": "The catastrophe mentioned above is the doom of the world for them, whereas in the hereafter Allah will give them a painful torment and they will feel incomparable humiliation. Their humiliation is illustrated by their confused state, looking for their allies who once invited them to do tricks. They regret that the people who invited them before were no longer able to support them in releasing themselves from God's torment. Because at that time, humans had no power and no one could provide help. Allah's Word: So humans no longer have a power and there is no helper. (ath-thariq\/86: 10) Then Allah swt explained that on the day of resurrection, people who have been given knowledge, namely people who know and follow the instructions of revelation and are sure of the truth of the guidance they receive, and believe in the oneness of Allah and the apostle Muhammad, will smile with satisfaction. They say that the disgrace and doom on that day will be truly inflicted on disbelievers as a result of denying Allah, being hostile to His messengers, and denying the coming of the resurrection day. Allah's Word: So today, it is the believers who laugh at the disbelievers, they (sit) on the couches looking away. (al-Muthaffifin\/83: 34-35)"
		   },
		   {
			"id": 1929,
			"surah": 16,
			"ayat": 28,
			"tafsir": "Then Allah swt describes the condition of the polytheists at the end of their lives, namely when the angel of death will take their lives while they are still in a state of self-harm. They cannot escape death and the angel of death, even though they have denied the creator of the universe. At that time, they imagined the torment they would receive for denying God Almighty and mistreating themselves. At that time, it was their conscience that spoke, they acknowledged His truth, saying we do not associate partners with Allah. As Allah says: By Allah, O our Lord, we do not associate partners with Allah. (al-An'am\/6: 23) Such recognition is too late because in the moment before death, they in the world deny the oneness of Allah and wallow in evil. It is not true if they expect happiness, because they have been given a mind that can judge good and bad. They are aware of how big a sin is to deny the oneness of Allah and the revelations received by the Prophet Muhammad. Therefore, the appropriate punishment for them is to receive punishment according to their deeds. They can no longer cover up the crimes they have committed, because in fact they themselves have realized and confessed their crimes and indeed Allah is All-Knowing of what they are doing."
		   },
		   {
			"id": 1930,
			"surah": 16,
			"ayat": 29,
			"tafsir": "Allah swt emphasized that what they will receive in the hereafter is nothing but hell and feel various kinds of punishment. They will stay in hell forever and receive punishment according to the severity of the sins they have committed. This is the appropriate punishment and appropriate suffering for people who are arrogant, arrogant, and do not want to follow the guidelines of life and instructions brought by the Apostle. Allah says: And those who disbelieve, for them Hellfire. They were not destroyed until they died, and their punishment was not relieved from them. Thus We repay every person who is very disbelieved. (Fathir\/35: 36)"
		   },
		   {
			"id": 1931,
			"surah": 16,
			"ayat": 30,
			"tafsir": "Allah swt describes the condition of the believers when asked how they feel about what Allah sent down. Those who adhere to the verses of Allah will give the answer that what is revealed is the goodness and mercy of Allah given to His servants who obey their religion and believe in His Messenger, and practice these verses in society. They will become servants of God who do good and receive happiness in life, while in the hereafter they will receive even better rewards than what they received in this world. At the end of the verse, Allah swt confirms that the hereafter is better and the best place for those who are pious. The happiness they will receive in the hereafter is eternal, while the happiness in this world is only temporary. Happiness in the hereafter gives satisfaction in its truest sense, while happiness in this world is temporary and limited. The happiness that believers will receive is explained in the following verse: So Allah will reward them in this world and a good reward in the hereafter. And Allah loves those who do good. (Ali 'Imran\/3: 148)"
		   },
		   {
			"id": 1932,
			"surah": 16,
			"ayat": 31,
			"tafsir": "Allah swt describes the condition of the believers when asked how they feel about what Allah sent down. Those who adhere to the verses of Allah will give the answer that what is revealed is the goodness and mercy of Allah given to His servants who obey their religion and believe in His Messenger, and practice these verses in society. They will become servants of God who do good and receive happiness in life, while in the hereafter they will receive even better rewards than what they received in this world. At the end of the verse, Allah swt confirms that the hereafter is better and the best place for those who are pious. The happiness they will receive in the hereafter is eternal, while the happiness in this world is only temporary. Happiness in the hereafter gives satisfaction in its truest sense, while happiness in this world is temporary and limited. The happiness that believers will receive is explained in the following verse: So Allah will reward them in this world and a good reward in the hereafter. And Allah loves those who do good. (Ali 'Imran\/3: 148)"
		   },
		   {
			"id": 1933,
			"surah": 16,
			"ayat": 32,
			"tafsir": "Allah swt describes that people who are pious, who always obey all of Allah's commandments and stay away from all His prohibitions, when the angel of death comes to take their lives, they die in a state of husnul khatimah and receive peace from the angels. This is because they are clean from the stains of polytheism and disobedience, and their souls are still under the guidance of Allah's revelation. Their entire journey is decorated with noble morals and avoids despicable traits. A person like this faces his Lord with an open heart and surrenders, because he feels he will leave the mortal world, and go to accept the conditions set by his Lord. At that time, he faced death calmly and happily. Allah swt said: Indeed, those who say, \"Our Lord is Allah\" then they firm their stand, then the angels will come down to them (saying), \"Do not be afraid and do not grieve; and be happy you by (acquiring) the paradise that has been promised to you.\" (Fussilat\/41: 30) Then Allah swt explained that the angels gave the good news that they would enter heaven which was prepared for them, according to the good deeds they had done. The good news that the angels conveyed to them is God's promise that they will experience later after the resurrection day. It was narrated from Muhammad bin Ka'ab Al-Quradhi that he said, \"When a believing servant has arrived at his death an angel comes and says, \"Peace be upon you, O Wali Allah, Allah sends greetings to you and gives you the good news that you will enter heaven. \" (History of Ibn Jarir ath-Tabari and al-Baihaqi)"
		   },
		   {
			"id": 1934,
			"surah": 16,
			"ayat": 33,
			"tafsir": "Allah swt explained that there was no point in giving the polytheists of Mecca a chance to change their attitude. They will continue to hold such an stance, so that the time comes for angels to take their lives, or God's order comes to bring down their doom in the world as experienced by the disbelievers before them. Among the polytheists who disobeyed the prophets and apostles, there were those who were destroyed by the sound of thunder, destroyed by earthquakes, and some were destroyed by great floods and hurricanes that they did not expect. This verse is a strong threat to them with the intention that they believe in Allah and His Messenger and immediately leave falsehood and return to the truth before disaster strikes like what happened to people before them. Then Allah swt explained that their ancestors who had the same characteristics and behavior as them had experienced destruction earlier because of Allah's punishment as a result of not wanting to listen to the calls of Allah's apostles and prophets who guided them to the truth. Those who continue to wallow in evil have been annihilated by Allah with severe torment. This does not mean that God has wronged them, but that they have wronged themselves. Allah has sufficiently provided revelation guidance and clear evidence regarding the truth of that revelation. However, they still disobey and deny the truth and pollute their souls by creating statues as gods associated with Allah."
		   },
		   {
			"id": 1935,
			"surah": 16,
			"ayat": 34,
			"tafsir": "They were struck by a terrible calamity because of the crimes they had committed. None of them could escape this terrible disaster because everything was according to the provisions and sunnah of Allah. They have been warned repeatedly that at some point Allah's punishment will come. However, they did not accept it consciously, instead they belied and ridiculed the apostle who brought news about the destruction they would experience as a result of that deed. In the afterlife, they will also experience something even more terrifying, namely when they have been decided to enter the gates of Hell which they cannot escape. Allah swt said: This is the day of judgment that you used to deny. (as-shaffat\/37: 21)"
		   },
		   {
			"id": 1936,
			"surah": 16,
			"ayat": 35,
			"tafsir": "Allah swt then explained the deceit of the polytheists and their reasons for belittling the Prophet Muhammad and his followers. They argued that they worshiped idols because God had approved that worship. If Allah wanted them to worship Allah Almighty, surely they would not worship anything other than Allah. Likewise their stipulation of: bahirah (a female camel that has given birth five times and the fifth child is a male), sibah (a female camel that is allowed to go anywhere because of a vow), wasilah (a female lamb that gives birth to twins while the sons and daughters ), and ham (a male camel that cannot be contested anymore because it has fertilized a female camel ten times), as an unclean animal, according to them, God has blessed it. If Allah did not like what they had done, they would have been guided to the right path, or Allah would have punished them immediately. Those are some of the reasons put forward by polytheists for rejecting the revelation that was revealed to the Prophet Muhammad. The reason they put forward was the same as the actions of those before them in terms of denying the apostle. Allah swt denies the reasons they put forward and rejects their wrong assumptions. Allah does not justify what they are doing because Allah has conveyed instructions through His messenger. The Apostle has conveyed guidance to his people to the right path through the intercession of His revelation. Allah swt said: And We did not send any messenger before you (Muhammad), but We revealed to him, that there is no god (who has the right to be worshiped) besides Me, so worship Me. (al-Anbiya'\/21: 25) God's guidance conveyed through His apostles will be enjoyed by those who really try to get it. Allah swt said: And those who strive for (seek our pleasure), We will show them Our paths. And indeed, Allah is with those who do good. (al-'Ankabut\/29: 69) Therefore, if there are people who do not want to listen to the apostle's invitation, then it is not the apostle's duty to force them to accept his da'wah. That is not the duty and responsibility of the apostle nor is it a characteristic of the Islamic religion. Islam does not force those who do not want to accept the truth."
		   },
		   {
			"id": 1937,
			"surah": 16,
			"ayat": 36,
			"tafsir": "Allah swt explained that the apostles were sent in accordance with the sunatullah that applied to the previous people. They are the guides of mankind to the straight path. The guidance of the apostles was accepted by those who were willed by Allah and brought them to the welfare of the world and the happiness of the hereafter. Allah swt explained that He had sent a messenger to each of the previous nations, just as He sent the Prophet Muhammad to all mankind. Therefore, humans should follow his call and leave all his prohibitions. Allah swt says: Indeed, We have sent you with the truth as a bearer of glad tidings and as a warner. And there was not a single community but there had come a warner. (Fathir\/35: 24) And His words: And ask (Muhammad) Our messengers whom We have sent before you, \"Have We appointed gods other than (Allah) the Most Compassionate to be worshiped?\" (az-Zukhruf\/43: 45) From this description it can be understood that Allah does not want His servants to become disbelievers, because Allah SWT has forbidden them to deny Him. The prohibition has been conveyed through His apostles. However, in terms of human nature, it is possible that some of them deny Allah, because humans have been given reason and the freedom to choose according to their will. God's destiny applies according to their choice. Therefore, if there are among His servants who are still wallowing in disbelief and are sent to Hell, then there is no reason for them to argue. Allah has given enough reason and freedom to choose and determine which path they will take. Meanwhile, Allah himself does not want His servants to become disbelievers. Then it was explained further that Allah had warned His servants who denied the truth of the apostles with threats of punishment in the world if they did not want to change their stance and accept the instructions brought by the apostles. Therefore, Allah destroyed them with His very painful punishment. But there are also those among them who are guided by Allah, so they accept and follow the instructions and revelations that His messengers bring. These are the people who are happy and safe from the punishment of Allah. After that, Allah swt ordered them to travel all over the earth and witness the countries inhabited by unjust people. They were told to see how the end of the life of those who deny the religion of Allah. In this verse, Allah SWT orders people to conduct research on the history of other nations and compare nations that obey Allah and His messengers with those who deny the call of Allah and His messengers. This is nothing but because Allah wants them to follow the messenger's call."
		   },
		   {
			"id": 1938,
			"surah": 16,
			"ayat": 37,
			"tafsir": "Allah swt then explained to Prophet Muhammad saw not to be disappointed in facing the denial of his people and excessive disobedience, even though the Prophet himself really wanted them to become believers. Allah swt explained to Rasulullah saw that even though he really hoped that his people would receive guidance and follow his call, this hope would be useless if Allah did not want them to be guided because they had made their own choice. They turned away from the guidance of revelation and were attracted to Satan's tricks so that they fell into the valley of disobedience and polytheism. Allah swt said: Indeed, you (Muhammad) cannot guide those you love, but Allah guides those whom He wills, and He knows better those who are willing to receive guidance. (al-Qasas\/28: 56) And His words: And my advice will not benefit you even if I want to give advice to you, if Allah wants to lead you astray. He is your Lord, and to Him you will be returned.\" (Hud\/11: 34) And the word of Allah: And whoever Allah leads astray, there is no one to guide him. (ar-Ra'd\/13: 33) That's why Allah will no longer give them instructions, because they have chosen misguidance and have been given an explanation of the consequences that will befall them.At the end of the verse, Allah SWT explains that if He wants to torture them, no one can provide help Allah has power over His creatures and Allah determines the fate of these creatures."
		   },
		   {
			"id": 1939,
			"surah": 16,
			"ayat": 38,
			"tafsir": "Allah swt explained to Prophet Muhammad saw that they swore in the name of Allah in a serious manner that they still stubbornly refused to believe in the resurrection day after the life of this world. Their disobedience to the day of resurrection is the result of their disobedience to the apostle's call. They think that death is nothing but destruction and annihilation, so how can there be a resurrection after the body is destroyed and the bones are decayed. It is impossible to return things that have been destroyed to their original form. Allah swt corrected their wrong beliefs and confirmed that this was not true. The true belief is to resurrect all human beings who have died is a promise that has been set by God and is sure to happen. Because most of them do not understand the characteristics of Allah who has unlimited power, they do not believe in the resurrection day where at this time all creatures that have been destroyed will be resurrected from their graves. They will be revived to be responsible for their deeds in the world."
		   },
		   {
			"id": 1940,
			"surah": 16,
			"ayat": 39,
			"tafsir": "Allah swt explains the wisdom of the day of resurrection, namely explaining to them about the truth of the revelation brought by the messenger that they deny and dispute. On that day, they could witness the truth of revelation and realize the error of their opinion of the teachings conveyed by the apostles. This is the remorse experienced by those who mistreat themselves. At that time, they will feel that the messenger's call is the true guidance of Allah, while they regret their denial with useless regrets. At the end of the verse, Allah swt confirms that He will raise them up on the Day of Judgment so that those who deny the truth of His revelations can know that the day of resurrection and vengeance that they deny has actually taken place. They turned out to be liars and they lied to nothing but themselves. On that day, they actually witnessed Allah's punishment that was threatened to them and they were no longer able to avoid this punishment. Allah swt said: (It was said to them), \"This is the hell that you used to deny.\" (ath-thur\/52: 14) His words again: Enter it (feel the heat of the fire); whether you are patient or not, it's all the same to you; Verily, you are only rewarded for what you have done. (ath-thur\/52: 16)"
		   },
		   {
			"id": 1941,
			"surah": 16,
			"ayat": 40,
			"tafsir": "Allah swt explains that His power is unlimited and cannot be limited in the least by all creatures, both those in the heavens and those on earth. Allah swt states that if he wishes to bring a dead person back to life, He simply says to him, \"Be.\" Be it according to God's will. In another verse, Allah SWT explains that the realization of something that is desired does not require a long time, but it is enough in a short time. Allah swt said: And Our command is only (with) one word like the twinkling of an eye. (al-Qamar\/54: 50) Allah also explains that resurrecting those who have died for Him is the same as creating a soul. Allah swt said: Creating and resurrecting you (for Allah) is just like (creating and resurrecting) one soul (easy). Verily, Allah is All-Hearing, All-Seeing. (Luqman\/31: 28)"
		   },
		   {
			"id": 1942,
			"surah": 16,
			"ayat": 41,
			"tafsir": "Allah swt explained that those who emigrate leaving their loved ones and their hometown solely hoping for the reward and pleasure of Allah, will surely be given a good place by His side. What is meant by migration in this verse is the migration of Muslims from Mecca to Habasyah, the first migration of 83 Muslims. This understanding is based on the opinion which says that this verse is a Makkiyyah verse, and is also corroborated by the narrations of Abdullah bin Humaid, Ibn Jarir ath-Tabari, and Ibn Munzir from Qatadah who say that the Prophet's companions were persecuted by the inhabitants of Mecca. They were expelled from their hometowns, so some of them joined the migration to Habasyah's country. After that, Allah ordered them to prepare to migrate to Medina, then the city was made a city of migration and they were given helpers consisting of believing residents of Medina. Then they are promised victory over those who have wronged them and a good place in the world. All of this was obtained because they were willing to leave their homes and possessions, solely hoping for the pleasure of Allah. The promise of victory given to the Muslims is that they will be given a place that is free from the power of polytheists and they can manage their own social order. They will be pious leaders and rule over pious people. In addition, they are also promised a greater reward in the hereafter. If they knew, of course they would say that the reward in the hereafter is more important than the happiness they feel in this world. Ibn Jarir ath-Tabari narrated from Umar bin Khaththab that when an Ansar gave a gift to a man from the Muhajirin group, he said, \"Receive this gift, may Allah bless you in enjoying it. This is what Allah has promised you in this world. , while in the hereafter you will get even better\"."
		   },
		   {
			"id": 1943,
			"surah": 16,
			"ayat": 42,
			"tafsir": "This verse describes the characteristics of a Muslim who is promised by Allah will gain the victory of the world and the happiness of the hereafter. They are people who are patient with what happens to them, such as accepting the torment of the infidels of Quraysh, enduring suffering because of longing for their abandoned homeland, and carrying the burden of living overseas because of all the deprivation and being isolated from families who are still in Mecca. Allah's Word: Those who have believed and emigrated and fought in the way of Allah, with their wealth and their souls, are of a higher rank in the sight of Allah. They are the ones who get the victory. (at-Taubah\/9: 20) At the end of the verse, Allah SWT mentions their character as patient people and surrenders their affairs to Allah. Namely those who surrender the end of their struggle to Allah because that struggle is what they are going through to achieve happiness in this world and the hereafter. Patience and trustworthiness are among the most important qualities that must be possessed by those who defend the truth. Because, these two characteristics are very decisive whether or not the ideals are achieved."
		   },
		   {
			"id": 1944,
			"surah": 16,
			"ayat": 43,
			"tafsir": "Allah stated that He did not send any messenger before the Prophet Muhammad except humans who He gave revelation. This verse illustrates that the messengers who were sent were only men from the descendants of Adam as to the Prophet Muhammad who had the task of guiding their people so that they believed in monotheism and followed the guidance of revelation. Therefore, those who deserved to be sent to carry out this task were apostles of their kind and of their language. When the Prophet Muhammad was sent, the Arabs denied that Allah could not have sent a messenger who was human like them. They wanted that the one who was sent should be an angel, as Allah says: And they said, \"Why did this Apostle (Muhammad) eat food and walk in the markets? Why wasn't an angel sent down to him (so that the angel) gave warning with him. \" (al-Furqan\/25: 7) And His words: Is it appropriate for people to be surprised that We gave a revelation to a man among them, \"Give warning to people and make the believers happy that they have a high position on the side of God.\" Lord.\" The disbelievers said, \"This man (Muhammad) is a real magician.\" (Yunus\/10: 2) Regarding the rejection of the Arabs against Muhammad's apostleship because he was an ordinary human being, it can be read from a history of adh-ahhak that was based on Ibn 'Abbas that after Muhammad was appointed as a messenger, the Arabs who denied his prophethood said , \"God is greater if His apostles are not human.\" Then down the verses of surahh Yunus above. In this verse, Allah SWT asks the polytheists to ask the People of the Book, both Jews and Christians, whether their books contain information that Allah has sent angels to them. If it is indeed stated in their book that Allah sent down an angel as a messenger of Allah, they may deny Muhammad's apostleship. However, if it is stated in their book that Allah only sent a messenger to them a human being of their own kind, then their attitude of denying Muhammad's apostleship is not true."
		   },
		   {
			"id": 1945,
			"surah": 16,
			"ayat": 44,
			"tafsir": "After that Allah swt explained that the apostles were sent with clear evidence about their truth. What is meant by concrete evidence in this verse are miracles that prove the truth of their apostolate. While what is meant by az-zubur is a book that contains guidance for life and the rule of law given by God to humans. This verse also explains that Allah sent down the Qur'an to the Prophet Muhammad so that he would explain to people the teachings, commands, prohibitions and rules of life that they must pay attention to and practice. The Al-Qur'an also contains stories of previous peoples so that they become role models in living life in the world. The Prophet Muhammad was also ordered to explain the laws contained in the Qur'an and detail the verses that are global, specializing the general ones, limiting the absolute and others so that they are easy to digest and according to their thinking ability. At the end of the verse, Allah swt emphasizes that they think about the contents of the Qur'an with clear thoughts in order to obtain welfare in this world and happiness in the hereafter, apart from various kinds of punishments and disasters like those that befell the previous peoples."
		   },
		   {
			"id": 1946,
			"surah": 16,
			"ayat": 45,
			"tafsir": "Allah gives a warning to polytheists, who always try to make evil plans and tricks and hinder the propagation of Islam, that they will never feel safe from the threats Allah will inflict on them. The threats are: First: Allah will drown them from the surface of the earth and destroy them from this world, as experienced by Qarun. Second: Allah will bring down punishment for them from the sky at a time when they did not expect it before, as experienced by the people of the Prophet Lut. Third: They are overwritten by punishment while on their way to seek sustenance or are busy in trading, so they do not have the opportunity to refuse it. Meaning, they would not be able to run to protect their trade and their souls, for the doom struck suddenly. Fourth: They will experience torment as punishment after suffering loss of property and life, so they cannot escape the torment. Then Allah swt ends His word by declaring that Allah is Most Gracious and Most Merciful. This is to show that Allah will not punish them immediately, but threatens them with severe torments. This is to give them the opportunity to think and time to change their attitude towards the apostle's invitation. This is proof of Allah's vast mercy for His servants."
		   },
		   {
			"id": 1947,
			"surah": 16,
			"ayat": 46,
			"tafsir": "Allah gives a warning to polytheists, who always try to make evil plans and tricks and hinder the propagation of Islam, that they will never feel safe from the threats Allah will inflict on them. The threats are: First: Allah will drown them from the surface of the earth and destroy them from this world, as experienced by Qarun. Second: Allah will bring down punishment for them from the sky at a time when they did not expect it before, as experienced by the people of the Prophet Lut. Third: They are overwritten by punishment while on their way to seek sustenance or are busy in trading, so they do not have the opportunity to refuse it. Meaning, they would not be able to run to protect their trade and their souls, for the doom struck suddenly. Fourth: They will experience torment as punishment after suffering loss of property and life, so they cannot escape the torment. Then Allah swt ends His word by declaring that Allah is Most Gracious and Most Merciful. This is to show that Allah will not punish them immediately, but threatens them with severe torments. This is to give them the opportunity to think and time to change their attitude towards the apostle's invitation. This is proof of Allah's vast mercy for His servants."
		   },
		   {
			"id": 1948,
			"surah": 16,
			"ayat": 47,
			"tafsir": "Allah gives a warning to polytheists, who always try to make evil plans and tricks and hinder the propagation of Islam, that they will never feel safe from the threats Allah will inflict on them. The threats are: First: Allah will drown them from the surface of the earth and destroy them from this world, as experienced by Qarun. Second: Allah will bring down punishment for them from the sky at a time when they did not expect it before, as experienced by the people of the Prophet Lut. Third: They are overwritten by punishment while on their way to seek sustenance or are busy in trading, so they do not have the opportunity to refuse it. Meaning, they would not be able to run to protect their trade and their souls, for the doom struck suddenly. Fourth: They will experience torment as punishment after suffering loss of property and life, so they cannot escape the torment. Then Allah swt ends His word by declaring that Allah is Most Gracious and Most Merciful. This is to show that Allah will not punish them immediately, but threatens them with severe torments. This is to give them the opportunity to think and time to change their attitude towards the apostle's invitation. This is proof of Allah's vast mercy for His servants."
		   },
		   {
			"id": 1949,
			"surah": 16,
			"ayat": 48,
			"tafsir": "Then Allah swt mentions the signs of His power that apply to all of His creatures with the intention that people who always make evil tricks think of everything that has been created by Allah swt, for example shadows. When the sun rises in the east, the shadows from all objects extend westward, then when the sun rises, the shadows recede, and finally when the sun crosses the meridian, the shadows change direction. As the sun begins to set, the shadow is getting longer and longer towards the east, until when the sun is approaching the horizon on the western horizon, the shadow is already stretching east. The shadows change this way because they are subject to the laws that God has established. The shadow changes direction not only west and east, but also north and south every year. When the sun is directly on the equator on the meridian, there are no shadows at all. However, for the following days, namely after March 21, when the sun is on the meridian, the sun casts a shadow facing south. Then on June 21 at the same time that is when the sun is on the meridian of the shadows of every body pointing south all its length. Then the days got shorter, until September 23. Since then the sun has begun to move south and the shadows have begun to point north, getting longer and longer until on December 22, the sun casts shadows all the way to the north. Then the next day the sun began to move north, the shadows began to shorten day by day. Finally, on March 21, the sun returns to the equator so that when the sun reaches the meridian, the shadows at that time are not visible at all. Thus for the next. This happens because the sun's annual motion is subject to the legal system created by Allah and applies to all of His creatures. Such an explanation by Allah is addressed to humans so that they will examine it so that they come to a conclusion that all things in nature do not oppose Allah's law but are subject to His rule."
		   },
		   {
			"id": 1950,
			"surah": 16,
			"ayat": 49,
			"tafsir": "Then Allah swt explained that all creatures in the heavens and on earth are subject to His power. They prostrate to Allah in their own way according to their natural fitrah. Even the angels who are in the sky do not want to be arrogant and do not disobey God's provisions."
		   },
		   {
			"id": 1951,
			"surah": 16,
			"ayat": 50,
			"tafsir": "In this verse, Allah SWT specifically explains the obedience of angels, namely that the angels submit to Allah's authority and diligently carry out what He commands. Creatures that exist in the heavens and on earth cannot and cannot avoid the laws and regulations of Allah that apply. Thus, this explanation is given to those who deny the existence of Allah and always make such tricks, so that they realize that nothing created by Allah can escape from His power. Allah said: He said to him and to the earth, \"Come both of you according to My commands obediently or by force.\" The two replied, \"We came obediently.\" (Fussilat\/41: 11) And His word again: And all prostrate to Allah, both in the heavens and on earth, both of their own free will and forced (and also prostrate) their shadows, in the morning and evening. (ar-Ra'd\/13: 15) With this explanation it is hoped that they will be able to end their denial, and return to their original nature, namely submitting to Allah's authority and believing in the truth of the revelation revealed to His chosen servant, namely Muhammad saw."
		   },
		   {
			"id": 1952,
			"surah": 16,
			"ayat": 51,
			"tafsir": "Allah swt explained to His servants not to worship other gods besides Him, because that means associating partners with Allah, even though Allah is the Most Holy of partners. It is impossible for Allah Almighty in this universe to be more than one. He is one and only He has the right to be worshipped. God commands people to fear His threats and punishments. He also forbade people to associate partners with Him and make other worship besides Him. Clearly, the prohibition contained in this verse is worshiping two Gods. However, the number does not only show the number two, but shows the number that is the least. What is meant is worshiping gods other than Allah and so that people do not imagine that there are gods other than Him."
		   },
		   {
			"id": 1953,
			"surah": 16,
			"ayat": 52,
			"tafsir": "Allah swt then explains that everything in nature belongs to Him. Allah does not share His power with others in managing everything in the heavens and on earth. He does not need helpers or guilds. Therefore, the only one who has the right to be obeyed is Him. Obedient in the truest sense, sincere, and never ending. Thus, it is not right if there are humans who fear other than Him because the gods do not have the power to eliminate the blessings that already exist or bring about torment. Therefore, piety must be based only on Allah."
		   },
		   {
			"id": 1954,
			"surah": 16,
			"ayat": 53,
			"tafsir": "Furthermore, Allah SWT explains why the only thing that must be feared is Allah. That's because all the blessings they get, such as health and happiness, solely from Allah. So it is the obligation of humans to be grateful for favors and praise His uninterrupted kindness to His creatures. On the other hand, when people are beset by life's difficulties, difficulties, illnesses, and so on, it is to Allah that they complain and ask for help. It is human nature that when they are in trouble, they imagine in their minds their weaknesses and the existence of powers outside themselves that control them."
		   },
		   {
			"id": 1955,
			"surah": 16,
			"ayat": 54,
			"tafsir": "Then Allah swt revealed that if Allah granted their request, namely to eliminate the difficulties they were suffering, they immediately turned to associate partners with other gods to Allah, and worshiped the statues again. They no longer want to be grateful for the blessings that God has given. Such is their deception. Allah swt said: And if you are in danger at sea, everything that (usual) you call for will disappear, except Him. But when He saved you to land, you turned away (from Him). And humans are always in denial (not grateful). (al-Isra\/17: 67)"
		   },
		   {
			"id": 1956,
			"surah": 16,
			"ayat": 55,
			"tafsir": "This verse states that Allah allows the disbelievers and polytheists to deny the blessings He has bestowed upon them. Allah also allows them to deny Him as the Almighty substance to remove the danger that befalls them, so that they deny Allah the Almighty to save themselves from that danger. At the end of the verse, Allah swt confirms that they are allowed to enjoy worldly life and satisfy their lusts until death takes them. After that, they will definitely return to Allah. It was then that they knew with certainty the consequences of their denial and defiance. They will regret their actions with useless remorse."
		   },
		   {
			"id": 1957,
			"surah": 16,
			"ayat": 56,
			"tafsir": "Allah swt explained that among the actions of polytheists is to provide offerings to their idols, even though the offerings provided are a blessing from Allah given to them. The various offerings given to the idols were the produce of their agriculture or livestock. They did this with the intention that the idols could help them. Even though they don't know for a second that these idols are not able to benefit them and prevent them from the dangers that will befall them. Their actions are acts of shirk, namely worshiping others besides Allah. Allah swt said: And they provide some of the crops and animals (shares) for Allah while saying according to their estimates, \"This is for Allah and this one is for our idols.\" The portion that is for their idols will not reach God, and the portion that is for God will reach their idols. Their decision is very bad. (al-An'am\/6: 136) Then Allah threatened them with a strong threat. Allah swears by His name, that He will really hold them accountable for their actions inventing gods other than Allah. Then they will be punished according to their disbelief and their deeds. Allah swt said: So by your Lord, We will definitely question all of them, (al-hijr\/15: 92) what they did."
		   },
		   {
			"id": 1958,
			"surah": 16,
			"ayat": 57,
			"tafsir": "Then Allah swt revealed another form of their shirk, namely giving Allah a daughter, while they had a son. Allah swt says: And they make the angels of the Most Merciful servants (Allah) as women. Did they witness the creation (of the angels)? Later their testimonies will be written down and they will be held accountable. (az-Zukhruf\/43: 19) The polytheists think that the angels are the daughters of God. Their actions like this are considered a grave sin, because they accuse God of something that is not right, that is, God has daughters, even though they themselves are not happy to have daughters. Allah swt said: Is it (appropriate) for you who are men and for Him who are women? That is certainly an unfair distribution. (an-Najm\/53: 21-22) And His words: Remember, among their lies they actually said, \"God has a son.\" And really, they are total liars. Did He (Allah) choose daughters over sons? Why are you here? How (how) do you determine? (as-shaffat\/37: 151-154) Allah swt confirms that He is the Holy of Holies from all their accusations. Truly, it is abominable that they only want sons and not daughters."
		   },
		   {
			"id": 1959,
			"surah": 16,
			"ayat": 58,
			"tafsir": "Furthermore, Allah SWT revealed their attitude regarding daughters, namely when they were given the news that their wives had given birth to daughters, their faces became gloomy because of irritation and embarrassment. Such feelings are caused by their own feelings that the daughters only bring shame to their people, because the daughters cannot help in the war, and if they lose the war, the daughters become booty. In fact, they are punished by their own feelings because of the notion that a woman's dignity is nothing more than something that can be transferred."
		   },
		   {
			"id": 1960,
			"surah": 16,
			"ayat": 59,
			"tafsir": "Allah swt explains further the behavior of polytheists when they have daughters. They withdrew from their community because they received bad news about the daughter's birth. They hid from the crowd for fear of being insulted, and did not want anyone to know about the disgrace that had befallen them. Then they imagined in their minds whether the child who brought disgrace would be cared for in enduring humiliation, because the girl had no right to inheritance and community respect, and only as a male servant, or whether they would bury her in the ground alive. . Their habit of burying their daughters alive is seen as a grave sin which they must be held accountable for on the day of reckoning, because this act is against human conscience and common sense. Allah swt said: And when the baby girl who was buried alive was asked, for what sin was she killed? (at-Takwir\/81: 8-9) At the end of the verse, Allah swt stated that how bad what they decided and concluded was that they were ashamed to have daughters so they hid themselves from the crowd. So ashamed were they that they felt they had to choose whether to keep their daughter in shame, or to bury her alive. Allah confirmed that their view of the daughter was very wrong."
		   },
		   {
			"id": 1961,
			"surah": 16,
			"ayat": 60,
			"tafsir": "Allah swt explained that the bad luck belongs to those disbelievers, namely they will be humiliated because they are put in hell. Meanwhile, Allah will remain noble, not requiring children or anyone to create and manage this world. Even if all the people in nature disobeyed Him, it would not undermine His glory and almighty power. Even humans themselves are the losers in this world because they do not enjoy the benefits derived from the implementation of the noble values that He teaches and will go to hell in the afterlife. That is what Allah affirms at the end of this verse, that He is All-Mighty in His omnipotence and All-Wise in imposing punishment on those who disbelieve. That is, the doom is indeed something that is appropriate for those who deny it."
		   },
		   {
			"id": 1962,
			"surah": 16,
			"ayat": 61,
			"tafsir": "Allah swt threatens the polytheists who wallow in sin. The threat is that if God wants to punish people for their injustice, He is able to do it. They will be wiped off the face of this earth, not a single one will remain. However, God does not want that to be the case. Because of His broad mercy, Allah postponed His torment until a predetermined moment, that is, when death had overtaken them. The point is that they can change their views and behavior. However, if they remain unchanged, Allah will bring down their doom when their death comes. And when death comes, they will not be able to postpone it or hasten it for a moment. Then in the afterlife they will be put into hell."
		   },
		   {
			"id": 1963,
			"surah": 16,
			"ayat": 62,
			"tafsir": "Once again Allah explains that they always throw everything they don't like at Allah, including girls. They don't want to have daughters, because according to them daughters are only for Allah. So it is Allah who is contemptible. It was also explained that they always tell lies, that is, they will always be happy both in this world and in the hereafter, even though they are wallowing in sin. This was denied by Allah while saying that their place was hell and they were forced into it. From the information above, it is clear that they really don't want to believe in the resurrection day and don't want to realize their crimes. That is why Allah swt emphasized that they will undoubtedly become residents of hell and will experience a very painful doom at a predetermined time, namely the hereafter."
		   },
		   {
			"id": 1964,
			"surah": 16,
			"ayat": 63,
			"tafsir": "In this verse Allah swt swears by His own name that He has indeed sent many messengers to people before the Prophet Muhammad. The apostles invited them to believe and worship Allah SWT. However, these people have been deceived by Satan's deception so that they think their deeds are good, when in fact they are evil deeds. It was Satan who eventually became their friend, and would accompany them into hell."
		   },
		   {
			"id": 1965,
			"surah": 16,
			"ayat": 64,
			"tafsir": "In this verse Allah swt explains the function of the Qur'an, namely as a basis and guide that can open their minds to be able to judge the truth of the guidance of revelation. Allah swt explained that He revealed the book to the Prophet Muhammad to be used as guidance for his people. Also so that the Prophet could explain the issues that they doubted or did not believe in, so that they could see what is right and what is wrong, what is right and what is wrong. In addition, the Qur'an serves as a guide that can guide its people to the truth so that they avoid going astray. Al-Qur'an also functions as God's greatest mercy to servants who want to believe. Guided by the Qur'an, they will be guided in life in this world and will be happy in this world and in the hereafter."
		   },
		   {
			"id": 1966,
			"surah": 16,
			"ayat": 65,
			"tafsir": "Allah SWT invites His servants to pay attention to the arguments and evidence that show the truth that Allah SWT is the One and Only God who has the right to be worshiped and worthy of worship. In this case, Allah explains that it is He who sends down rain from the sky, which is needed by various kinds of plants on the earth's surface. If there were no rain, the earth would have become dry, barren, and it would be impossible for plants and grass to grow. This shows that Allah has the power to revive the soil and make it fertile after there are no signs of life. Those who pay attention to the incident will certainly see clear proofs and definite signs for the existence of Almighty Allah. This can only be understood by those who are willing to listen to God's explanation, pay attention and think about the signs of His oneness. This can sometimes be done by direct research or by listening and understanding the experiences or research results of others as well as possible."
		   },
		   {
			"id": 1967,
			"surah": 16,
			"ayat": 66,
			"tafsir": "Furthermore, Allah swt asks the attention of His servants to pay attention to livestock because actually in livestock there is a valuable lesson, namely that Allah separates milk from blood and excrement. The livestock eat the grass, then from the food it produces blood and dirt. Between the two, Allah produces clean and nutritious milk. It shows that Allah is the Almighty and the Most Extensive of His Mercy for His servants. Scientifically it can be explained that in the breasts of mammals there is a gland that functions to produce milk. Through the veins or arteries, the glands get supplies in the form of substances formed from blood and substances from digested food extracts (chyle). These two components cannot be consumed directly. The mammary glands will process these two components with existing enzymes, and produce milk that can be consumed directly. The milk it produces has a color and aroma that is completely different from the original substance. Mother's milk (ASI) has the right components to meet the nutritional needs of infants and protect against diseases that may arise. The balance of nutrients contained in breast milk is ideal for a very young baby's body. At the same time, baby milk also contains nutrients that stimulate the development of the brain and nervous system. Artificial baby milk made based on high technology cannot replace this baby food at this time. Another anti-infective element is that breast milk provides a good environment for the growth of \"good\" bacteria, which are known as \"normal flora\". The role of these bacteria is to protect against bacteria, viruses and parasites that cause disease. Furthermore, ASI also regulates the occurrence of the immune system (immune system) against various infectious diseases. Thus the scientific explanation."
		   },
		   {
			"id": 1968,
			"surah": 16,
			"ayat": 67,
			"tafsir": "Furthermore, Allah SWT asked His servants to pay attention to dates and grapes. From these two fruits, humans can produce sackar, namely intoxicants which are forbidden and good drinks which are permitted. A history from Ibn 'Abbas explains, \"Sakar is a forbidden drink that comes from dates and grapes. Good sustenance is halal food that can be produced from dates and grapes. So from dates and grapes, humans can produce various types of food. In some of them are detrimental and some are beneficial. What is harmful is prohibited by religion, while those which are beneficial are allowed to be produced. Thus, this verse already contains a hint for those who have a pure mind that drinking liquor is unlawful and may not be produced. At the end of the verse, Allah swt confirms that in the creation of the two types of plants there are clear signs to show the oneness of God for those who use their minds to research, pay attention to, and take lessons from the creation of the plants mentioned in the verse."
		   },
		   {
			"id": 1969,
			"surah": 16,
			"ayat": 68,
			"tafsir": "Then Allah swt asked the attention of His servants to pay attention to bees. Allah has given instincts to bees so that they have the ability to make nests in hills, trees and buildings built by humans. Someone who wants to pay attention to how skilled bees make their nests, of course he will be amazed. Honeycomb is made of wax-like material and has a series of hexagon shapes which according to structural experts is the room that contains the most content compared to other aspects. If you pay attention to the weight, the beehive is very light, but can withstand heavy loads, namely honey, eggs and embryos. This is also evidence that shows the power of God Almighty. The verse above describes the life of honey bees briefly but accurately as follows. 1.\"...Build nests in parts of the mountains and parts of trees, and in some of the high places they make...\". The bee group is estimated to consist of at least 20,000 species. Each type has its own way of making nests. They use all means, from caves located in the mountains, holes in old trees, or make their own nests and hang them on tree branches. Considering that this verse is specifically aimed at honey bees, the description of honey bee hives will be explained in more detail. The honey bee hive, or bees in general, is a strategic and central place for the entire life of the group. Starting from the place to raise the puppies (larvae) to the information center, everything is in the nest. The honey bee hive consists of almost perfect hexagonal holes. Construction experts recognize that the hexagon shape is the strongest form, saving materials and space. This shape also prevents other insects from entering between the chambers and building nests. 2.\"...Then eat of every fruit¦.\" The main ingredient used as food for honey bees is nectar, a sweet liquid found in flowers. While there are other types of bees that obtain food from fruit juices. 3.\"...And walk the ways of your Lord in ease....\" In the process of searching for flower fields, some worker bees are sent as guides to look for potential areas. They can fly up to five kilometers and will keep searching until they find enough to harvest and then pass on to other bees. \"Allah revealed to the bees\" has a figurative meaning. Why can the revelation that is usually passed down to humans be passed down to the bee nation. We must understand this verse by understanding what the function and purpose of Allah sent down revelation. Revelation aims to provide guidance. So Allah gave instructions to the bee nation to be obeyed throughout his life by every bee until doomsday. It's different from humans, where there are those who obey and there are those who disobey and even deny the revelations from Allah SWT. Bees (and other animals and plants) without exception will obey and make it their guide and life guidance. In this verse, God's instructions are to make nests (bees) in places made by humans. This means that Allah helps humans to cultivate and use it as explained in An-Naá¸¥l 16:69. Many benefits can be obtained from the plant world, and some of them are very beneficial after further processing by animals, for example honey obtained from the activity of honey bees. Aristotle was the first person to study and study honey bees. Even though many of his theories don't make sense, when examined with current knowledge, it must be admitted that he was a pioneer in research and disclosure of bee life. Human attention is estimated to have started between 8,000 to 15,000 years ago. Many prehistoric cave paintings show how humans harvested honey from honey bee hives. Beekeeping is thought to have started in Egypt around 2400 BC."
		   },
		   {
			"id": 1970,
			"surah": 16,
			"ayat": 69,
			"tafsir": "Allah then calls the attention of His servants to think about how Allah has given the skills to the bees to gather food from various kinds of flowers and turn it into long-lasting and nutritious honey. This skill is passed down from generation to generation. The bees suck food from the flowers and then enter into their stomachs and from their stomachs produce honey of various colors. Some are white, some are yellowish, and some are reddish, according to the type of bee and the flowers around it. Among the benefits of honey is for body resistance and maybe also as a medicine for various diseases. This is accepted by science, partly because honey is easily digested and contains various vitamins. An explanation of the function of this honey can be read in a hadith: That someone came to the Messenger of Allah while saying, \"Indeed my brother has a stomach ache.\" So the Messenger of Allah said, \"Drink him some honey,\" then that person gave him some honey. Then the man came again to Rasulullah saw and said, \"O Messenger of Allah, I have given him honey, but his stomach is growing heartburn.\" Rasulullah saw said, \"Go and drink (again) him honey.\" So that person went and gave him some more honey, then that person came back to Rasulullah SAW and said, \"O Messenger of Allah, his stomach just got worse,\" then Rasulullah said, \"Allah is right and your brother's stomach is a lie. Go and give your brother honey again. \" So the man went and gave him more honey, and he recovered. (Al-Bukhari and Muslim from Abu Sa'id al-Khudri) And the hadith of the Prophet saw: There are three kinds of medicine: bleeding with cupping, drinking honey and burning the skin with fire (hot iron), and I forbid my people to burn the skin . (Al-Bukhari and Muslim history from Ibn 'Abbas) Some of the benefits that bees provide are as follows: 1. Honey is a delicious drink useful for health. The nest can be made of candles, materials for batik, and others. 2. Bees help pollinate flowers so that fertilization occurs."
		   },
		   {
			"id": 1971,
			"surah": 16,
			"ayat": 70,
			"tafsir": "Allah swt explained that it was He who created man and determined his age. Among humans there are those who die when they are still in the womb, there are those who die at birth, there are those who die when they are small, there are those who die when they reach the peak of their glory, and there are also those who die after reaching a very old age, after being weak and weak. senile. Allah swt said: And whoever We extend his life, We will return him to the beginning of events (it). So why don't they understand? (Yasin\/36: 68) Most people want a long life, but stay healthy, and don't want to become senile. In the hadith of the Prophet, it is stated: That the Messenger of Allah, said in his prayer, \"I seek refuge in You, O Allah, from stinginess, laziness, old age (senile), torment of the grave, slander (trials) of the Dajjal and slander (trials) in life and at death.\" (Narrated by al-Bukhari from Anas bin Malik) When humans are given old age, their physical strength decreases gradually to the point where they are like being returned to their childhood again. They become weak, senile and can no longer remember what they once knew. At the end of the verse, Allah swt confirms that He is All-Knowing of everything. It means He is the one who knows the wisdom of human creation and the wisdom of dying. Allah is also the Almighty to pass away humans when they were babies or after old age."
		   },
		   {
			"id": 1972,
			"surah": 16,
			"ayat": 71,
			"tafsir": "After Allah explained the difference in human ages in this verse, He mentioned the difference in their sustenance. Allah swt explains that Allah gives more to the sustenance of some people than others. There are people who are rich, there are people who are poor, there are people who control sources of sustenance, and there are people who do not get adequate sustenance for their lives. Everything aims to help each other because they need each other. Then Allah swt explained that among those who are given more sustenance, there are those who do not want to give even a bit of their sustenance to the people who work for them who should receive their share. In fact, among people who control and are controlled, between masters and slaves, both are entitled to that fortune. Therefore, the sustenance should be distributed fairly and evenly to all parties. If the owner of capital feels entitled to benefit because of the capital he owns, the worker should be given income according to his ability, so that the owner of capital and the worker both enjoy these sources of income. Allah swt said: He makes a parable for you from yourself. Are (you willing if) any of the slaves that you have become partners with you in (having) the sustenance that We have given you, so that you become equal to them in this matter, then you fear them as you fear your neighbor . Thus We explain the verses for people who understand. (ar-Rum\/30: 28) At the end of the verse, Allah reminds us that all of this is His grace. Therefore, they should be grateful for this blessing by not monopolizing these sources of income for the benefit of certain groups or groups."
		   },
		   {
			"id": 1973,
			"surah": 16,
			"ayat": 72,
			"tafsir": "Then Allah explained His favor, namely that Allah had created partners for them from their own kind. The couples are partners in working together to build a family and society. With this partner, humans can have offspring to maintain and develop human species in carrying out their duties as caliphs on this earth. Furthermore, Allah explained that it was He who had given them sustenance in good and useful food and drink. Therefore, humans should not be afraid of difficulties in obtaining sustenance because of children. On the contrary, they must educate these children so that they are capable later when they grow up to carry out their duties as caliphs on earth. At the end of the verse, Allah swt denounces the disbelievers who believe in idols as gods, even though those idols cannot do anything. Meanwhile, they deny Allah's favors as if the sustenance was not from Allah."
		   },
		   {
			"id": 1974,
			"surah": 16,
			"ayat": 73,
			"tafsir": "Furthermore, Allah SWT explained that polytheists worship statues or other gods besides Allah, even though their gods are not able to provide them with sustenance from the sky such as sending down rain, growing plants, and so on. The statues do not have any power because the statues are inanimate objects. Statues couldn't possibly give him any advantage, even if they were destroyed, he couldn't do anything about it."
		   },
		   {
			"id": 1975,
			"surah": 16,
			"ayat": 74,
			"tafsir": "Allah forbids His servants to equate Allah's attributes with His creatures, because Allah's attributes cannot be matched and matched. To strengthen the meaning of this verse, a history can be put forward from Ibn Mundzir and Abi Hatim from Ibn 'Abbas that he said regarding the meaning of the verse that Allah said, \"So do not think that there are other gods besides Me, because in fact there is no god but I.\" Then Allah swt emphasized that Allah is All-Knowing of everything in the heavens and on earth. He knows the crimes committed by His creatures and it is He who has the power to punish them with grievous torments. They do not know in the slightest what torment they must feel."
		   },
		   {
			"id": 1976,
			"surah": 16,
			"ayat": 75,
			"tafsir": "In this verse, Allah SWT makes a parable about polytheists in relation to their belief that they equate their worship in the form of statues and idols with Allah, the Most Perfect. The error and falsity of their belief is the same as the error of people who equate a slave who does not have any rights and powers with a free person, who has the right to own, develop and spend wealth as he wishes, either secretly or secretly. or openly. Everyone easily knows that the two are very different, both in glory, power, or nobility. The same goes for the polytheists. They make inanimate objects their foundation and goal when they offer their prayers and hang on to their hopes. How far are those who equate God, the creator of the universe, with beings who have limitations. All praise belongs to Allah swt. He is the most entitled to receive all kinds of praise because He is the great and perfect. All praiseworthy qualities are collected in Him. All praise is only directed to Him, not to statues, idols, or anything else. Other than Allah, there is none worthy of praise. However, many people do not know or are aware that all the attributes of perfection belong only to Allah SWT. Because of ignorance, they see the nature of perfection also exists in other than Allah. They make the creature as the goal of worship or worship."
		   },
		   {
			"id": 1977,
			"surah": 16,
			"ayat": 76,
			"tafsir": "As with the previous verse, in this verse Allah SWT re-explains the parable for polytheists in a clearer form regarding their belief in the statue they worship. Allah swt takes a parable between two people: one is mute, stupid, and does not understand anything and the other one is able to speak again fluently. The first person is a parable for the statue worshiped by polytheists, while the second is a parable for Allah. Is it necessary to equate the two? If this is inappropriate, it is even more inappropriate to equate a statue with God. Allah swt in this verse explains the similarities in the characteristics between a statue and a mute person who not only does not have the ability to speak, but also does not have the ability to think. He didn't understand other people's intentions, and other people couldn't understand his meaning either. Because of that, he was unable to settle his own affairs let alone those of others. He is only a burden to other people, wherever he is placed, and whatever task is given to him certainly does not bring good results. The nature of Allah \"calls for justice or truth\", implies that He knows, teaches, and likes justice and truth and commands His servants to be fair. Allah loves those who do justice and are fair and do not order His servants except to uphold justice. In fact, Allah SWT is Most Holy from traits that are contrary to justice, such as injustice, persecution, ignorance, and curmudgeon. His commands and Shari'a are entirely just. Those who are good natured and act justly are the beloved and trustees of Allah. They live beside Allah and under His light. The nature of Allah swt \"on the straight path\" implies that Allah does not command anything other than truth and justice. Allah does not hold or create anything except for benefit, mercy, wisdom, and justice. God is always above the truth in His words and deeds. Allah does not punish His servants unjustly, does not torture the servant without sin, does not reduce the slightest good that he has done, and does not burden someone with other people's sins. God's actions and deeds are always full of wisdom and end in goodness. All of that is because Allah always wants His servants to be in a straight state."
		   },
		   {
			"id": 1978,
			"surah": 16,
			"ayat": 77,
			"tafsir": "In this verse, Allah swt emphasizes the perfection of His knowledge of the unseen and His omnipotence. Among the things that are unseen are all that is beyond the reach of the senses and the human mind, both in the heavens and on earth. Only Allah swt knows about what is outside this real world. Although humankind's knowledge of outer space and the current state of the earth is very advanced, what they don't know is far greater. When people came to the moon, they still faced the mysteries and mysteries that existed on the planets Mars, Venus and others. Even though these planets are like grains of sand in the middle of a vast sahara when compared to the vastness of this universe. Likewise regarding the condition of this earth. No single geologist can predict exactly when an earthquake or a volcano will erupt. Even in man himself there are still things which are the mysteries or secrets of Allah that are not yet known to man, even though for centuries experts in their respective fields have tried to think about and express them. No one can say for sure what will happen tomorrow, when death will come to him, and where he will be buried. All of that is a supernatural matter for humans. However, ignorance is God's great mercy to humans. They can formulate plans and actions according to their wishes. The Day of Judgment is also part of the occult. Allah swt specifically mentions about the Day of Judgment because this issue has received a lot of rejection and disapproval in every age and every nation. In fact, many people deny it, and state it as something that can't possibly happen. Allah keeps the time of the Day of Judgment a secret so that humans do not stop their life activities. Humans should not have to think about when the Day of Judgment will occur, because that is God's business. What is important for them is to live life according to the instructions set by Allah SWT. The issue of doomsday for Allah swt is very easy. The speed at which events occur is as fast as the blink of an eye or even faster. This speed according to time can be described by human calculations because God's arrangement of the universe actually cannot be related to space and time. Easy or difficult, and sooner or later is human size. Allah is truly powerful over all things. When Allah wills for something, He also says, \"Kun (Be),\" then that something is created. Nothing can stand in the way of His will."
		   },
		   {
			"id": 1979,
			"surah": 16,
			"ayat": 78,
			"tafsir": "In this verse, Allah SWT explains the mysteries and miracles that are very close to humans. They know the phases of fetal growth, but do not know how the process of fetal development occurs in the womb so that it reaches perfection. Since the meeting of sperm cells and egg cells to become a new human being who carries the characteristics of both parents and ancestors. In the process of this incident, there is a hidden secret of life. After attaining perfection, Allah takes man out of his mother's womb in a state of ignorance. But while still in the womb, God bestows potential, talents, and abilities such as thinking, being happy, sensing, and so on in human beings. After humans are born, with Allah's guidance all potentials and talents develop. His mind can think about good and evil, right and wrong, and right and wrong. With hearing and vision that have developed, humans recognize the world around them, maintain their lives, and establish relationships with fellow humans. With the mediation of reason and senses, human experience and knowledge are increasing and developing day by day. All of that is God's mercy and grace to human beings who are not limited. Therefore, they should be grateful to Him, either by believing in the oneness of Allah, and not associating Him with others or by using all of Allah's blessings to worship and obey Him. Hadith of the Prophet saw: From Abu Hurairah ra, he said, \"Rasulullah said, \"Verily, Allah swt said, \"Who is hostile to my beloved, then I declare war on him. And there is no closer to Me a servant of mine with something more I like it more than doing the work that I oblige him to. My servant always draws closer to Me by carrying out sunnah rituals so I like him. When I like him, then I become his hearing with which he hears, his sight with which he sees, his hands which he uses to beat, and his feet which he uses to walk. If he begs Me, I will surely grant his request, and if he asks Me for protection, I will surely protect him. (Al-Bukhari)"
		   },
		   {
			"id": 1980,
			"surah": 16,
			"ayat": 79,
			"tafsir": "Another miracle that is witnessed daily by humans is put forward by Allah in this verse to show His power. The beauty of the scenery when the birds fly in the air, hover, and sometimes it seems as if they are floating in the wind is a very impressive sight for those who believe in the greatness and majesty of Allah. The heart of a believer is like the heart of a poet. He has always been fascinated by the beauty of creatures and events. The beauty thrilled his feelings and touched his conscience. A believer expresses his feelings towards this natural beauty by faith, worship, and saying tasbih to God. If a believer has the talent of a writer\/broadcaster, then he will express his feelings with beautiful language or composition of words about the beauty and greatness of nature and its Creator. This cannot be expressed by a poet whose heart has never been touched by the delights of faith. A believer can see signs of God's power and greatness as in the ease with which a bird flies through the air. That birds can fly is a miracle. In order to fly and take off, birds must be very light. However, at the same time, he must also be extremely strong and formidable. Strength is needed to be able to stay aloft for long periods of time, and to maneuver to catch prey or when descending to where they perch. To keep the body light, bird bones are generally hollow in the middle, and have thin walls. The weight of the bird's body is placed in the middle of the body. On the chest there is a large sternum which is attached to the large pectoral muscles. It is these pectoral muscles that move the wings. The pectoral muscles make up about 25-30% of the bird's total body weight. The most important thing for birds to fly is the presence of wing organs and feathers. The wings are a kind of hand that has a large and strong bullet joint at the shoulder. This joint is highly specialized, and is used for very complex mobility. Its purpose is for birds to maneuver properly in the air. Wing feathers are a very beautiful creation of God. Light, yet strong, flexible, versatile, easy to care for, acts as a heat insulator, waterproof and replaceable. Feather color is very important for birds. Some birds have colors that match their environment so that they serve as camouflage. Another type uses its color to attract the opposite sex."
		   },
		   {
			"id": 1981,
			"surah": 16,
			"ayat": 80,
			"tafsir": "This verse explains the blessings that Allah has bestowed on humans to be used as a sign of His oneness, just as Allah bestows homes on humans. These houses not only function as a place to live or shelter from rain and heat, but also a place to create an atmosphere of security, peace and serenity as well as to foster affection and a sense of loyalty among the residents. From a good household, a good human being is born. The Islamic religion stipulates rules to guarantee the honor of the house as a place to live. A person is prohibited from entering other people's homes before greeting and asking permission from the occupants, even if he is a state official. It is not permissible for someone to inspect other people's homes for any reason, and it is not permissible to spy on the occupants, causing a feeling of insecurity for the families of the occupants of the house. That is the meaning of the house and its function for humans who live in one place. To the nomadic nation, Allah swt bestowed favors on them in the form of animal skins for housing purposes. They built tents and huts from the skins and hair of the cattle while wandering in the desert tending their flocks. These objects are easy and light to move from one place to another. Another gift from Allah to humans is the fur and skins of livestock, which can be used for clothing, household items, and other things. Sheep fur (wool), camel skin, and goat skin are goods that they can trade from ancient times until now. From this verse, a legal argument can be taken that the skin and hair of animals that are lawful to eat are sacred."
		   },
		   {
			"id": 1982,
			"surah": 16,
			"ayat": 81,
			"tafsir": "In this verse, Allah swt mentions His favors apart from the favors already mentioned, which give a sense of security, peace, and serenity. To nations that have settled or developed, God gives gifts of shelter such as houses, hotels, and buildings which are generally made of wood, iron, stone, and so on. God provides materials (materials) from the mountains such as stones and sand to build buildings, fortifications, or shelter in the mountains. All of which create a sense of security and calm in the souls of its inhabitants. Allah swt provided them with clothing made of wool or cotton and cotton to protect them from heat and cold, as well as clothing made of iron to protect their bodies from sharp weapons when fighting. These are the blessings that God has bestowed upon man. Allah will perfect the worldly favors to the Muslims by giving them power and kingdom, and setting the goal of their struggle to seek Allah's pleasure and establish the benefit of mankind. So let them be aware of all the great pleasures from Allah and also acknowledge the obligation towards the giver of these favors, to then believe in Him, leave other offerings, and do good deeds. Allah says: And indeed, We have glorified the children of Adam, and We carried them on land and in the sea, and We gave them sustenance from the good and We have preferred them above the many creatures We have created with perfect advantages. (al-Isra'\/17: 70) (82) After Allah explained His favors and gifts to humans, then in this verse Allah confirmed to the Messenger of Allah that if the disbelievers still turn away from the teachings of the Apostle and reject all explanations and a description of the proofs of the truth of religion that is conveyed to them, let it not sadden him and do not create a feeling of despair in his soul. The Apostle's task is only to convey and he has fulfilled it perfectly, namely conveying and explaining the Islamic religious law, its ideals, and the lessons contained in the Islamic religious law. Growing faith in the human soul or making people become true believers is beyond the ability of the Prophet (s)."
		   },
		   {
			"id": 1983,
			"surah": 16,
			"ayat": 82,
			"tafsir": "In this verse, Allah swt mentions His favors apart from the favors already mentioned, which give a sense of security, peace, and serenity. To nations that have settled or developed, God gives gifts of shelter such as houses, hotels, and buildings which are generally made of wood, iron, stone, and so on. God provides materials (materials) from the mountains such as stones and sand to build buildings, fortifications, or shelter in the mountains. All of which create a sense of security and calm in the souls of its inhabitants. Allah swt provided them with clothing made of wool or cotton and cotton to protect them from heat and cold, as well as clothing made of iron to protect their bodies from sharp weapons when fighting. These are the blessings that God has bestowed upon man. Allah will perfect the worldly favors to the Muslims by giving them power and kingdom, and setting the goal of their struggle to seek Allah's pleasure and establish the benefit of mankind. So let them be aware of all the great pleasures from Allah and also acknowledge the obligation towards the giver of these favors, to then believe in Him, leave other offerings, and do good deeds. Allah says: And indeed, We have glorified the children of Adam, and We carried them on land and in the sea, and We gave them sustenance from the good and We have preferred them above the many creatures We have created with perfect advantages. (al-Isra'\/17: 70)"
		   },
		   {
			"id": 1984,
			"surah": 16,
			"ayat": 83,
			"tafsir": "Allah explains in this verse about the pride and pride of most people. They clearly know that things such as stone, wood, iron, and other things are used as building materials for their shelter, and cotton, cotton, wool, and other animal skins are the material for their clothing and daily necessities. day, is a gift that comes from Allah SWT, not from their idols besides Allah, not even from the efforts of their own hands. However, they deny that the blessings are from Allah, so they feel no need to thank, pray, worship, and worship God, the Creator and Giver of these favors. They see that the grace of grace is due to statues and idols other than Allah or see it as a mere gift from the universe, which exists by itself. In fact, most people are disbelievers who oppose and deny the revelations conveyed by the apostles. They do not want to believe in him even though they know the truth of the religion he brings, because of their pride and high-spirited hearts."
		   },
		   {
			"id": 1985,
			"surah": 16,
			"ayat": 84,
			"tafsir": "Allah swt explained that on the Day of Resurrection, the apostles will be witnesses for their respective people. They are the ones who know the attitude of their people when they preach, whether the people accept well the invitations and calls that are conveyed, or they are kufr and reject it. The testimonies of the apostles on the acceptance and rejection of their people are accompanied by sufficient explanations and correct evidence. Based on that testimony, the sentence was handed down to them. They are not given the opportunity to convey reasons to defend themselves or apologize for all their actions and actions during their lifetime on earth. Allah said: This is the day when they will not be able to speak, and it will not be permitted for them to make excuses for them to be forgiven. (al-Mursalat\/77: 35-36) And the word of Allah: And similarly We have made you (Muslims) \"middle people\" so that you may be witnesses of (the deeds of) mankind and that the Messenger (Muhammad) be a witness of (the actions of) ) You. We did not make the Qiblah that you (formerly) turned towards but so that We would know who followed the Messenger and who turned back. Indeed, (removing the Qiblah) is very heavy, except for those who have been guided by Allah. And Allah will not waste your faith. Truly, Allah is Most Gracious, Most Merciful to mankind. (al-Baqarah\/2: 143) And His words: (Remember), on the day (when) We call every nation with its leaders; and whoever is given a record of his deeds in his right hand they will read his notes (well), and they will not be harmed in the least. (al-Isra'\/17: 71) The day of the hereafter is the day of recompense for the deeds in this world and not the time to repent and do good deeds to atone for sins. On the Day of Judgment, humans only accept a decision from Allah who makes the most just decision, go to heaven or go to hell. Allah said: So whoever does an atom's weight of good, surely he will see it (reply), and whoever does an atom's weight of evil, surely he will see it (reply). (az-Zalzalah\/99: 7-8)"
		   },
		   {
			"id": 1986,
			"surah": 16,
			"ayat": 85,
			"tafsir": "In this verse, it is explained about the punishment for the unjust people, namely the polytheists who belied the apostles and made enemies of them, just like the polytheists of Mecca. When witnessing the punishment that will be meted out to them, they try to defend themselves to mitigate their punishment. However, their defense was not accepted because there was no reason to reduce their sentences. The time to repent has passed, and the Day of Judgment is the Day of Judgment. Every human being is brought before the court of God, the All-wise and All-Knowing. Everyone in court must speak the truth and be honest, whether he is a witness or an accused. If the witness has said the truth with correct evidence, the accused must also speak honestly and truthfully so that the judge determines the correct sentence. It is not right if the judge increases or reduces the sentence and it is also not right if he delays it. Likewise the disbelievers on the Day of Resurrection. Because their sins were obvious, their punishment was immediately meted out to them, neither was it lightened nor suspended. Sinners who commit injustice, commit great crimes, and fight against the religion brought by the prophets will not be able to escape the punishment of hell. Allah says: And the sinners see hell, and they think that they will fall into it, and they find no place to turn from it. (al-Kahf\/18: 53)"
		   },
		   {
			"id": 1987,
			"surah": 16,
			"ayat": 86,
			"tafsir": "In this verse it is stated that when those who associate partners with Allah see their idols on the Day of Resurrection, they will also say to Allah while accusing those idols, \"These are our partners whom we used to worship besides You.\" They pointed to the idol to transfer the sins they carried onto him. They think that by doing this they can avoid the punishment of hell or lessen it. Actually, they already know for sure that they will be put into hell, but it is human nature, they are still looking for ways to free themselves from this destruction. Their condition is like someone who is about to drown, so they will hold on to whatever their hands touch to save themselves. When they try to pass the suffering on to their idols, those idols immediately accuse them of being outright liars. The polytheists worship other than Allah swt on their own awareness and will, not because of orders from those idols. As in the word of Allah: And they have chosen gods besides Allah, so that these gods will be a protector for them. Absolutely not! Later they (gods) will deny their worship of him, and will become enemies to them. (Maryam\/19: 81-82)"
		   },
		   {
			"id": 1988,
			"surah": 16,
			"ayat": 87,
			"tafsir": "Then Allah swt in this verse explains that those who worship idols other than Allah swt submit themselves to Allah swt on the Day of Resurrection as a sign of regret. In another verse, Allah SWT says: And (what a horror), if you see those who sin bow their heads before their Lord, (they say), \"O our Lord, we have seen and heard, then return us (to world), surely we will do good deeds. Indeed, we are people who believe. (as-Sajdah\/32: 12) The polytheists ultimately believe in their error and feel sorry for themselves. All their offerings so far seemed to have vanished without a trace. Whereas in the past, they thought that these offerings were partners of God who could help them. Before declaring their submission to Allah swt, the polytheists first denied that they had associated partners with Him, as explained by Allah swt: (Remember) on the day (when) Allah raised them all, then they swore to Him (that they were not polytheists) as they swear to you; and they think that they will get something (benefits). Know that they are liars. (al-MujaLAH\/58: 18) On the Day of Judgment, the polytheists first turn their backs and then submit to Allah swt. Perhaps it is due to the thickness of the rust of polytheism that covers their souls so that they are far from the light of faith. The human nature which tends to acknowledge the oneness of God becomes covered by the darkness of shirk so that the light of human nature is powerless to penetrate it. But then after going through development and a long time, the rust that covers the human soul is getting thinner, while the light of human nature that continues to live tries to penetrate those walls, so that finally it returns to acknowledging the oneness of Allah and surrendering to Him. Such is the development of the souls of polytheists, from denying the oneness of God to becoming an acknowledgment of His oneness. However, this recognition was too late so that it was no longer of any use to them."
		   },
		   {
			"id": 1989,
			"surah": 16,
			"ayat": 88,
			"tafsir": "After mentioning the punishment for those who go astray, in this verse, Allah SWT explains the punishment for people who go astray and lead astray. They are unbelievers who oppose the prophethood and apostleship of Muhammad and deny the Qur'an. In addition, they deliberately hinder other people who want to convert to Islam, and want to believe in Allah and His messenger. Allah inflicts a greater punishment upon them than the punishment of those who go astray, because they not only disbelieve, but also lead other people to disbelief or prevent others from believing. So, they commit two kinds of sins: sins caused by disbelief and sins for misleading others, as Allah says: And they forbid (others) to listen to (the Qur'an) and they themselves abstain from it, and they only destroy themselves, while they are not aware. (al-An'am\/6: 26) Therefore, there are also two kinds of punishments that are inflicted on them: punishments for their own disbelief and punishments for their actions misleading others. In this verse, there is evidence showing that the punishment for disbelievers varies just as believers have different positions in heaven."
		   },
		   {
			"id": 1990,
			"surah": 16,
			"ayat": 89,
			"tafsir": "In this verse, Allah swt explains again what will happen on the Day of Resurrection for every people, namely the presence of a prophet from among themselves, who will be a witness for their actions. The Prophet Muhammad saw was also a witness for his people. On the last day, he explained the attitude of his people towards the message he brought, whether they believed and obeyed his call, or they opposed and denied it. The prophets are the most appropriate to answer all the reasons from their people. When giving testimony, the apostles were of course based on their own feelings or from Allah's statement because they no longer knew what happened to their people after they died. The Messenger of Allah shed tears when his friend, 'Abdullah bin Mas'ud, read a verse similar in meaning to the verse above: And what (the condition of the disbelievers will be), if We bring a witness (rasul) from every nation and We bring you (Muhammad ) as a witness against them. (an-Nisa'\/4: 41) 'Abdullah bin Mas'ud stopped reading when it came to this verse, because the Messenger of Allah said to him, \"Enough.\" 'Abdullah bin Mas'ud then turned to the Messenger of Allah, and saw him shedding tears. Bearing witness on the Day of Resurrection is a noble but difficult position. The Messenger of Allah will explain to Allah on the Day of Judgment the condition of his people to what extent they practice the instructions of the Qur'an which was revealed to him. On that day, there will be no more reason for people not to be accountable for their deeds in the world, because the Qur'an has explained to them everything, good or bad, what is lawful and what is unlawful, and what is right and what is wrong. . The Qur'an provides guidance for humans which path is straight and which is astray, and which direction brings happiness and which leads to misery. Whoever justifies the Qur'an and practices all the instructions contained in it, surely he will receive mercy in the life of this world and the hereafter. The Qur'an gives good news to those who obey and repent to Allah with great rewards in the hereafter and great glory for them. The Messenger of Allah who was given the task of conveying the Qur'an, will later be held accountable for his duties and obligations on the Day of Resurrection, as Allah says: ask (also) the apostles. (al-A'raf\/7: 6) Among the duties of the Messenger of Allah was to explain the Qur'an to people regarding religious matters because some of the verses of the Qur'an are detailed and some are general in content. The Prophet explained the general verses of Allah. Word of Allah swt: And We sent down Adz-dhikr (Al-Qur'an) to you, so that you explain to people what has been revealed to them and so that they think about it. (an-Nahl\/16: 44) In addition to explaining general verses, the Prophet also stipulated instructions and laws related to matters of religion and morals."
		   },
		   {
			"id": 1991,
			"surah": 16,
			"ayat": 90,
			"tafsir": "Allah swt commands Muslims to do justice in all aspects of life and carry out the commands of the Qur'an, and do ihsan (virtue). Fair means realizing equality and balance between rights and obligations. Human rights may not be reduced due to obligations. This verse includes verses that are very broad in its meaning. Ibn Mas'ud said: And the most extensive verse in the Qur'an about good and evil is the verse in surahh An-Nahl (which means): \"Verily Allah commands (you) to act justly and do good\". (Bukhari's history from Ibn Masud in the book of al-Adab al-Mufrad) It was narrated by Ibn Jarir from Ikrimah that the Prophet Muhammad recited this verse to al-Walid. \"Repeat, my brother,\" said al-Walid, so the Prophet repeated the verse again. Then al-Walid said, \"By Allah, this Qur'an really has delicacy and beauty, on it is fruitful, underneath it is rooted, and it is not human words. Imam Ahmad narrated that there was a friend who was initially displeased with the Prophet saw. When this verse was read to him by the Prophet saw, the faith in his soul became firm and he became affectionate to the Prophet saw. In this verse mentioned three commandments and three prohibitions. The three commands are to act justly, do good (ihsan), and do kind to relatives. Meanwhile the three prohibitions are cruel, unjust, and hostility. Injustice is the opposite of justice, so it must be avoided. Everyone's rights must be given accordingly. Happiness is only felt by humans when their rights are guaranteed in society, the rights of every people are valued, and the strong protect the weak. Deviations from justice are deviations from the sunnah of Allah in creating this world. This has This will certainly cause chaos and shock in society, such as the breaking of loving relationships among human beings, as well as the instilling of feelings of revenge, hatred, envy, envy, and so on in the human heart. All that is mentioned will give rise to enmity that leads to destruction. Therefore, Islam upholds the principles of justice to maintain the survival of society. In the Al-Qur'an there are many verses that were revealed in Mecca and Medina, which command humans to act justly and forbid tyranny. Among them are: The word of Allah swt: O you who believe! Be ye upholders of justice because of Allah, (when) bear witness fairly. And let not your hatred of a people encourage you to act unjustly. Be fair. Because (fair) is closer to piety. And fear Allah, indeed, Allah is Aware of what you do. (al-Ma'idah\/5: 8) Allah swt establishes justice as the general basis for social life for every nation at all times. Justice is the goal of sending the apostles to the world and the goal of the Shari'a and laws that were revealed to them. Word of Allah swt: Indeed, We have sent Our messengers with clear evidence and We have sent down with them the book and balance (justice) so that humans can act fairly. And We created iron which has great power and many benefits for mankind, and so that Allah will know who helps His (religion) and His messengers even though (Allah) does not see him. Verily Allah is Powerful, Mighty. (al-hadid\/57: 25) According to Mahmud Shaltut, Allah SWT mentioned iron in a series of fostering justice, containing a strong and clear sign that the development and implementation of justice is a divine provision that must be carried out. The executors can use the power justified by God, such as with iron tools (weapons) that have tremendous power. The various kinds of justice put forward by Islam are as follows: First: Justice in Belief According to the Qur'an, the belief in shirk is an injustice. As the word of Allah swt: Do not associate partners with Allah, actually associating (Allah) is really a great injustice. (Luqman\/31: 13) Saying God is a justice, because only He is the source of life and life. He gives physical and spiritual pleasures. All worship, thanksgiving, and praise are only for Allah SWT. Directing worship and praise to other than Allah is an unjust act or an injustice. Human rights get mercy and favors from Allah, therefore humans are obliged to unite Allah in faith and worship. Second: Justice in the Household The household is part of society. If the household is prosperous, society will also be prosperous and the state will be strong. Good individuals are born from good households. Therefore, Islam stipulates regulations in managing households that are quite flexible and perfect. Justice does not only underlie formal provisions concerning the rights and obligations of husband and wife, but also justice underlies the loving relationship with the wife. Third: Justice in the Covenant In meeting the necessities of life, every person or nation definitely needs the help of others. Mutual help and assistance to fellow human beings in an effort to achieve their respective needs is a characteristic of human life. Islam provides guidance in carrying out this life of mutual help. For example in matters of muamalah, such as accounts payable, buying and selling, leasing, and so on, with an agreement, Islam orders that the agreement be written. Word of Allah swt: O you who believe! If you pay debts for a specified time, you should write it down. And let a writer among you write it correctly. ¦ That is more just in the sight of Allah, more able to strengthen testimony, and closer to you to no doubt¦. (al-Baqarah\/2: 282) In the many testimonies that occur in agreements, Islam also stipulates the existence of justice. Justice in testimony is carrying out honestly the contents of the testimony without distortion and falsification. Word of Allah swt: ¦And do not hide testimony, because whoever hides it, indeed, his heart is dirty (sinful)¦. (al-Baqarah\/2: 283) Word of Allah swt: O you who believe! Be upholders of justice, witnesses for Allah, even against yourselves or against your parents and relatives. (an-Nisa'\/4: 135) Fourth: Justice in Law In Islam all human beings are equal before God, there is no difference between white and black people, between children of kings and children of the people, all are equal in legal treatment. Implementing legal justice is seen by Islam as carrying out the mandate. Word of Allah swt: Truly, Allah commands you to convey the mandate to those who are entitled to receive it, and when you establish laws among humans you should determine them fairly¦. (an-Nisa'\/4: 58) Hadith of the Prophet SAW: In fact, the destruction of the people before you is because if a respected person steals they don't punish him, but if a weak person steals, they punish him. By Allah, if Fatimah bint Muhammad had stolen, I would have cut off her hands. (Muslim History) In addition to being fair, Allah SWT also commands to do ihsan such as repaying the kindness of others with better\/greater goodness or forgiving others. Allah's Word: And if you are honored with a (greeting) honor, then repay that honor with a better one, or repay (the honor, which is commensurahte) with it. Indeed, Allah takes into account all things. (an-Nisa'\/4: 86) Al-Ihsan is divided into three categories: 1.Al-Ihsan in worship: you worship Allah as if you see Him. If you don't see Him, surely Allah sees you. Hadith of the Prophet Muhammad saw: Ihsan is that you worship Allah as if you see Him, if you don't see Him, He will definitely see you. (Al-Bukhari's history from Abu Hurairah) 2.Al-Ihsan in rewards and sanctions in balance, and completes rights in killing and wounding with qisas. 3. Al-Ihsan in fulfilling rights or debts by paying them without stalling for time, or accompanied by unconditional additions. The highest level of al-ihsan is doing good to the guilty. It was narrated that Isa (as) once said, \"Indeed al-ihsan is that you do good to those who are guilty of you. It is not al-ihsan if you do good to those who have done good to you.\" Allah swt also commands in this verse to give alms to relatives for their needs. Giving alms to relatives is actually included in the acknowledgment of doing justice and al-ihsan. However, it is specifically mentioned to give an understanding that matters of providing assistance to relatives should be considered and prioritized. After explaining the three things that were ordered to mankind, Allah swt continues by explaining three more things that must be abandoned. First: Prohibition of abominable acts (fahisyah), namely actions based on the gratification of lust such as adultery, intoxicating drinks, and stealing. Second: Forbidding wrongdoing, namely bad actions that are contrary to a sane mind, such as killing and robbing the rights of others. Third: Prohibit arbitrary hostility towards others. Thus in this verse, Allah SWT orders three things to be done, namely to do justice, al-ihsan, and strengthen brotherhood. Allah also forbids three things, namely committing heinous, unjust, and enmity. All of that is teaching to humans that will bring them happiness in the world and the hereafter, so naturally they practice it."
		   },
		   {
			"id": 1992,
			"surah": 16,
			"ayat": 91,
			"tafsir": "In this verse, Allah swt commands Muslims to keep their promises with Allah if they have made that promise. According to Ibn Jarir, these verses were revealed with a bai'at (pledge of allegiance) to the Prophet Muhammad which was carried out by people who had just converted to Islam. They were commanded to keep the pledge of allegiance they had confirmed by oath, and to prevent them from breaking it. The small number of Muslims should not encourage them to cancel the bai'at after seeing the large number of polytheists. According to this verse, all agreements made with one's own will must be fulfilled whether the agreement is among Muslims or against people outside of Islam. Allah swt forbids Muslims from violating an oath made by using Allah's name, because in such an oath, Allah has been placed as a witness. Allah will reward those who fulfill what he said with an oath or repay with punishment for those who betray that oath. Indeed, Allah knows all the deeds of human beings. He is the one who knows all the agreements that they strengthen with oaths, and also knows how they fulfill those promises and oaths."
		   },
		   {
			"id": 1993,
			"surah": 16,
			"ayat": 92,
			"tafsir": "In this verse, Allah likens the person who violates the agreement and oath to a woman who unravels a thread that has been spun tightly, becoming divorced again. Such is the description of the behavior of madmen and fools. Violation of the bai'at agreement or oath means making the oath a means of deceiving fellow human beings. Because if one group or someone makes an agreement with another group that is bigger and stronger than it is to reassure them, then if there is an opportunity, he betrays the agreement, then such behavior is seen as a fraud. Allah swt forbids such behavior because it is a stupid and crazy act, even though he is from a small group dealing with a large group. It is even more forbidden if the big group cancels the agreement with the smaller group. It is narrated that Mu'awiyah, the first caliph of the Umayyad dynasty, had made a peace treaty with the Roman emperor for a certain period. Towards the end of the peace agreement, Mu'awiyah brought his troops to the border with the plan that when the agreement ended he would immediately attack. Then a friend named Amr bin Anbasah said to him, \"Allahu Akbar, O Mu'awiyah, keep your promise, don't betray, I've heard the Messenger of Allah say: Whoever has a time agreement between him and another group, then never let him cancel the agreement until it expires. (History of Imam Ahmad) After Mu'awiyah listened to his friend's warning, he returned home with his troops. Thus Islam establishes provisions in the social system between humans to test which of them is the strongest in sticking to the agreement which they made themselves, whether the agreement was to Allah and His messenger like bai'at, or to fellow human beings. On the Day of Judgment it will be seen: which is right and which is false and which is honest and which is treacherous. All disputes will be explained, each will get a reward from Allah swt."
		   },
		   {
			"id": 1994,
			"surah": 16,
			"ayat": 93,
			"tafsir": "Then Allah SWT in this verse stated that if He had willed, He would have been able to unite humans into one religion according to human nature, and negate the ability of endeavor and consideration of what is done. Thus, humans live like ants or bees, or live like angels who were created like robots who are full of obedience to Allah, will not deviate from the right provisions in the slightest, or stray to the wrong path. However, Allah swt did not wish that in creating humans. God created man by bestowing the ability to seek and try with full consideration. The power of judgment was originally given to man. Rewards and punishments are closely related to human choices and considerations. Each is held accountable for all actions resulting from their considerations and choices. As Allah says: And that man only gets what he has worked for, and indeed his efforts will be shown (to him). (an-Najm\/53: 39-40)"
		   },
		   {
			"id": 1995,
			"surah": 16,
			"ayat": 94,
			"tafsir": "Allah swt reiterates to the Muslims about His prohibition of making oaths a means of deception among them. After Allah swt forbade canceling agreements and oaths in general, in this verse, Allah swt specifically emphasized the prohibition of canceling agreements that Muslims had made with the Prophet Muhammad while he was still in Mecca, before moving to Medina. Allah swt does not justify making an agreement just to trick people. The emergence of this prohibition was caused by the desire of the Muslims to cancel their allegiance which had been strengthened by an oath. If they do so, it means that their feet are slipping after standing on a steady place. They will experience suffering because of their actions that make oaths a tool of deceit among humans. There are three penalties for those who violate if they do such an act. First: They grow further away from the truth and guidance of Allah SWT, even though they are already in the line of truth. Second: They set an example in deviation from the way of Allah. With these bad habits, they deserve punishment in this world, such as murder, arrest, looting, and expulsion from their homeland. Third: They will be punished in the hereafter as a reward for their impudence away from the truth. They are included in the class of people who are miserable and misguided."
		   },
		   {
			"id": 1996,
			"surah": 16,
			"ayat": 95,
			"tafsir": "In this verse, Allah reiterates His prohibition on canceling the pledge of allegiance (bai'at) by stating that such action is tantamount to exchanging a covenant with Allah for a small price. For example, in order to gain worldly benefits and little wealth, they cancel an agreement that they made themselves. This warning from Allah relates to the people of Mecca who had taken allegiance to the Prophet and then they intended to cancel the allegiance after seeing the strength of the Quraysh and their persecution of the Muslims. Then the Quraysh also promised the Muslims that they would give something if they wanted to return to the religion of polytheism. Therefore, Allah warned them with this verse and prevented them from canceling their allegiance to the Prophet, just to gain worldly wealth. Because what Allah has, such as the reward in the hereafter and the religion that the Prophet brought to worldly life, is far better than what the polytheist leader promised. If they used their common sense and pondered over these issues, they would certainly be more inclined to remain loyal to the Prophet and reject the invitations of the polytheistic leaders."
		   },
		   {
			"id": 1997,
			"surah": 16,
			"ayat": 96,
			"tafsir": "In this verse, Allah SWT explains that everything that is owned and comes from humans, in the form of giving worldly goods, is limited and has an end, while what is with Allah, in the form of rewards and rewards in heaven, has no limit, never ends. -break even forever. So to those who have faith, are patient with religious duties, and are steadfast in the face of suffering, Allah will surely reward them more than what they do. God highlights the character of patience or steadfastness because that trait is the basis of all good deeds. Allah's Word: Whatever (enjoyment) is given to you, it is the pleasure of living in this world. Whereas what (pleasure) is with Allah is better and more lasting for those who believe, and only in Allah they put their trust. (asy-Shura\/42: 36) God's Word also: Wealth and children are the adornments of the life of the world but continuous good deeds are better rewarded by your Lord and better to be hope. (al-Kahf\/18: 46)"
		   },
		   {
			"id": 1998,
			"surah": 16,
			"ayat": 97,
			"tafsir": "Then Allah swt in this verse promises that Allah swt will truly give a happy and prosperous life in the world to His servants, both male and female, who do good deeds, that is, all deeds according to the instructions of the Qur'an and sunnah of the Prophet, while their hearts are full of faith. The Messenger of Allah said: From 'Abdullah bin 'Umar that the Messenger of Allah said, \"It is fortunate that people who convert to Islam, are given sufficient sustenance and accept happily the gifts of Allah. (Ahmad's history) A happy and prosperous life in this world is a life in where the human soul gains calm and peace because it feels the delights of faith and the enjoyment of belief. His soul is full of longing for God's promises, but is willing and sincere to accept destiny. His soul is free from slavery to worldly objects, and only focuses on God Almighty, and gets abundance of light from Him. His soul is always satisfied with everything that is destined for him, because he knows that the sustenance he receives is the result of Allah's provision. As for in the hereafter he will receive the greatest reward and the best reward from Allah because of his wisdom and good deeds the godly deeds he has done and the clean faith that fills his soul."
		   },
		   {
			"id": 1999,
			"surah": 16,
			"ayat": 98,
			"tafsir": "Then in this verse Allah SWT teaches the adab of reading the Qur'an so that reading and understanding it is far from interference by Satan. The Qur'an gives instructions to humans to the path of happiness, and determines which are good deeds that are useful for human life and which are actions that lead to misery. However, the instructions of the Al-Qur'an will be understood and understood correctly, if the reader's mind is clean from Satan's temptations. Word of Allah swt: Indeed, those who are pious when they are overshadowed by evil thoughts (sinning) from satan, they immediately remember Allah, then immediately they see (his mistakes). (al-A'raf\/7: 201) And the word of Allah: Indeed, satan is an enemy to you, so treat him as an enemy, because in fact satan only invites his group so that they become residents of the burning hell. (Fathir\/35: 6) If the Messenger of Allah was ordered by Allah to take refuge in Him when reading the Qur'an, even though it has been declared preserved, what about humans who are not apostles. Indeed, humans are weak and easily influenced by Satan in understanding the Qur'an. Reading the Qur'an is a human effort to get closer to Allah. Satan tries hard to keep people away from God's guidance in various ways. Therefore, Allah commands to ask Him for help with the words: I seek refuge in Allah from the temptations of the accursed devil."
		   },
		   {
			"id": 2000,
			"surah": 16,
			"ayat": 99,
			"tafsir": "In this verse, Allah swt explains that satan has no influence on believers, people who surrender to Allah swt, and are patient and trustful in enduring suffering in the struggle to uphold religion. They are able to resist Satan's temptations and refuse to follow his steps and become his followers. Thanks to the light of faith in their breasts, they can know and overcome Satan's tricks. Satan only affects those who have obeyed his domain, those who see Satan as a leader and then love him and follow him and obey all his orders. Because of Satan's deception and temptation, they end up associating partners with God or worshiping Satan in addition to worshiping Allah."
		   },
		   {
			"id": 2001,
			"surah": 16,
			"ayat": 100,
			"tafsir": "In this verse, Allah swt explains that satan has no influence on believers, people who surrender to Allah swt, and are patient and trustful in enduring suffering in the struggle to uphold religion. They are able to resist Satan's temptations and refuse to follow his steps and become his followers. Thanks to the light of faith in their breasts, they can know and overcome Satan's tricks. Satan only affects those who have obeyed his domain, those who see Satan as a leader and then love him and follow him and obey all his orders. Because of Satan's deception and temptation, they end up associating partners with God or worshiping Satan in addition to worshiping Allah."
		   },
		   {
			"id": 2002,
			"surah": 16,
			"ayat": 101,
			"tafsir": "In this verse, it is explained that Allah has replaced a verse in the Qur'an with another verse. The substitution was intended for the benefit of mankind, because only Allah knows which law is more appropriate for a time for a people. The polytheists criticized the Prophet Muhammad because according to them, the Prophet at one time ordered a matter, and at another time forbade it. They say that the apostle likes to make things up. Such an attitude arises because they do not know the wisdom contained in substituting verses. Replacing verses or Al-Qur'an laws in only a few verses, for example in the matter of changing the customs of a people. If the change was made all at once, it would cause a stir among them. It is very wise in fostering change in a society to always pay attention to the psychological aspects of that society. But for those whose hearts are closed by pride and enmity towards the Prophet, the substitution of verses that support and contain wisdom is used as a source of slander for him. (See tafsir of al-Baqarah\/2: 106)."
		   },
		   {
			"id": 2003,
			"surah": 16,
			"ayat": 102,
			"tafsir": "Allah swt in this verse ordered Rasulullah saw to explain to the polytheists that the verses were not engineered by him, but were sent down by the angel Gabriel as from Allah Rabbul 'Alamin, group after group with perfect wisdom, according to the development of society and its needs. Allah also reveals His rububiyah attribute and relates it to the Prophet Muhammad (saw) (Rabbika = your God), to give the understanding that Allah's guidance to the Messenger is in a gradual way towards perfection. Allah will bestow the radiance of the rububiyah nature on His Prophet. The Qur'an was revealed in stages to the Messenger to strengthen the faith of the believers, to provide guidance for them in the oneness of Allah, and to be a guide in seeking a happy life in this world and the hereafter. Al-Qur'an also explains to those who believe that they will get heaven in the hereafter as a reward for their good deeds in this world."
		   },
		   {
			"id": 2004,
			"surah": 16,
			"ayat": 103,
			"tafsir": "Allah swt explained that the polytheists of Mecca accused the Prophet Muhammad of receiving lessons from the Qur'an from someone. According to them, the man was a foreign man, not an Arab, who always taught old books among them. But the accusation is not true because the Qur'an is composed in Arabic which is beautiful and full of content, how can foreigners create it? To what extent do people who are not Arab Quraysh feel the beauty of the Arabic language and then compile it in a beautiful and concise language like the Qur'an? Especially if it is said that the person was a teacher of the Prophet. Regarding who the foreigner was, various narrations explain it. Some of them said that the foreigner was a Roman slave who was a Christian who was cared for by the Hadrami Bani. However, from the various histories, none can be relied upon. It is very likely that the accusation was only a trick of polytheists who were deliberately leveled at the Prophet and the Muslims. Quraysh leaders who traded in Syria (Syria) had more or less heard of the contents of the Torah and the Bible because of their relationship with the People of the Book. Because the Koran contains the contents of the Torah, they think that there must be foreigners ('ajam) who are Christians who teach the contents of the Koran to the Prophet."
		   },
		   {
			"id": 2005,
			"surah": 16,
			"ayat": 104,
			"tafsir": "In this verse, Allah swt confirms that without faith in Allah swt and the Al-Qur'an as His revelation, a person will not get guidance to the ultimate truth that will release him from punishment. Those who say that the Qur'an is man-made or ancient tales, of course, are far from Allah's guidance, and will not be able to find the way of truth. Al-Qur'an which should be a guide left behind, so they become lost. Therefore, they easily fall into evil so that their souls become dirty and covered with the stains of sin. They must be miserable and tormented in this world and in the hereafter."
		   },
		   {
			"id": 2006,
			"surah": 16,
			"ayat": 105,
			"tafsir": "This verse refutes the accusations of unbelievers who say that the Qur'an is the creation of Muhammad. In fact, those who fabricated lies were not the Messenger of Allah, but people who did not believe in Allah's verses, both the Kauniyah verses which explain the oneness and power of Allah in this universe, as well as the Qur'aniyah verses which guide in life. So actually they are liars, not the Prophet Muhammad because he is the most honest person, perfect in knowledge and deeds, strong in belief, and most trusted. Because of his honesty and purity of soul, he was given the name al-Amin (an honest person)."
		   },
		   {
			"id": 2007,
			"surah": 16,
			"ayat": 106,
			"tafsir": "In this verse, Allah SWT explains about the severe threat to riddah (apostasy), namely kufr returning after believing, prioritizing misguidance from His guidance (guidance). They get the wrath and punishment of Allah, except in conditions of necessity. For example, they declare apostasy with their tongues because their lives are threatened, but their hearts are still full of faith. There is no sin or lawsuit against him, as long as he remains faithful. The Messenger of Allah said: The deeds of my people are not recorded (because of) mistakes, forgetfulness, and they are forced to. (History of ath-thabrani from sauban)"
		   },
		   {
			"id": 2008,
			"surah": 16,
			"ayat": 107,
			"tafsir": "In this verse, the causes of Allah's wrath are explained to those who have truly returned to disbelief after believing. They are considered to prioritize the life of this world rather than the afterlife with all the pleasures promised by Allah for those who truly believe and have their faith tested by various trials and slander in the world. Allah will not give His guidance to apostates, not because they have to. In the afterlife they get a painful torment. Allah will not give taufik to people who deny his verses, and people who have deliberately eliminated the willingness of their souls to accept good and then exchange it for sin and evil."
		   },
		   {
			"id": 2009,
			"surah": 16,
			"ayat": 108,
			"tafsir": "Another punishment for apostates is explained by Allah in this verse, namely that Allah closes their hearts (souls), sights, and eyesight. Their hearts are closed because of their hardness and disbelief, so they cannot be open to understand and respond to the signs of Allah's existence. Their eyesight and vision are closed because the understanding and impression of what they hear and see do not reach their hearts. Divine light and knowledge cannot penetrate and illuminate their hearts towards the Divine path. Their minds are also unable to absorb scientific facts as a sign of the oneness and greatness of Allah SWT. Humans like this that Allah says are like animals, even worse. Word of Allah swt: Whoever among you apostates from his religion, then he dies in disbelief, then their deeds in this world and in the hereafter have been in vain, and they are the inhabitants of hell, they will abide therein forever. (al-Baqarah\/2: 217) The next punishment for those who apostatize is to make them negligent about the essence of truth. They really don't pay attention to the environment at all, so they become passive (old) and isolated. The punishment for Muslims who knowingly apostate from Islam is the death penalty, as was done by Ali ra and Mu'adz bin Jabal against apostates in their time, based on the history of Imam Ahmad. The two friends adhered to the words of the Apostle: Whoever changes his religion (Islam) kill him. (History of Ahmad, al-Bukhari and Muslim from Ibn 'Abbas)"
		   },
		   {
			"id": 2010,
			"surah": 16,
			"ayat": 109,
			"tafsir": "In this verse, Allah swt emphasizes that those who apostatize are people who really lose out in the hereafter because they have tarnished their own souls and plunged themselves into the abyss of hellfire. They get the following things: 1. God's wrath. 2. A painful torment. 3. Not getting the guidance of Allah. 4. Their hearts, ears and eyes are closed. 5. On the Day of Resurrection, they will lose money. They lose the worldly pleasures that they expend their energy and spend their lives after. In the afterlife they get nothing but suffering. They don't realize that the main capital to live in the world is age. If the capital is not used for the main purposes, of course the capital will be used up in vain."
		   },
		   {
			"id": 2011,
			"surah": 16,
			"ayat": 110,
			"tafsir": "Allah explained the condition of the Muslims in Mecca who were very depressed, so they did not dare to show their Islam. Whenever they appeared to be worshiping, they were forced and tortured to return to their ancestral religion, namely the religion of shirk, like what 'Ammar bin Yasir, Khabbab, and others experienced. Because of the insults and threats of persecution, they then pretended to return to the religion of shirk. They followed the will of the Quraysh under the threat of torture. When they get the opportunity to migrate to leave the city of Mecca, they also go to migrate. They willingly parted ways with relatives, possessions, and hometown just because they hoped to please Allah. The various kinds of suffering and difficulties they faced in the migration, both on the way and upon arriving at the destination. They faced all the suffering and difficulties with patience and trust in Allah. The place that became their destination was the land of Habasyah (Ethiopia), which was very far from Mecca. They covered long distances on foot. When they arrived at their destination, they had to fight again to maintain their faith while preaching. After they had experienced these trials and sufferings, Allah forgave them the mistakes they made under threat of torture such as repeating kufr words. Allah swt gives His mercy and compassion by giving them a great reward in the hereafter."
		   },
		   {
			"id": 2012,
			"surah": 16,
			"ayat": 111,
			"tafsir": "On the day of reckoning, everyone will be held accountable for every action they committed while living in the world, whether in the form of good or evil. Word of Allah swt: (Remember) on the day (when) every soul gets (return) for the good that has been done before it, (as well as the reward) for the evil that he has done. (Ali 'Imran\/3: 30) No one on that day can defend another person. Each bears his own burden and will not shoulder the sins of others. Word of Allah swt: And a person who sins will not bear the sins of others. (Fathir\/35: 18) All good or evil deeds on that day will be rewarded and no one will be harmed. Everyone will fully get the reward of every action. Those who do good are fully rewarded for their good deeds, and those who commit immorality are fully punished for their immoral acts. Word of Allah swt: And fear the day (when) you are all returned to Allah. Then everyone is given a perfect reward according to what he has done, and they are not wronged (harmed). (al-Baqarah\/2: 281)"
		   },
		   {
			"id": 2013,
			"surah": 16,
			"ayat": 112,
			"tafsir": "In the history of the past, there are many examples that should serve as a lesson for mankind afterwards. A people who live in a country, originally lived happily inside and out, safe and secure. They are protected from enemy threats and far from famine and misery. Allah bestows sustenance upon them, both sustenance found in their own country, as well as sustenance that comes from outside. All of that makes them live in prosperity and peace. However, they are not grateful for all of Allah's abundant blessings, they even become disbelievers and deny Him. Their lives are no longer bound by moral and religious norms. They are drunk with wealth and luxury so that they forget their responsibilities towards the nation and state. Therefore, Allah sent down punishment in the form of famine and anxiety that covered their lives. that's their payback. Word of Allah swt: Do you not see those who have exchanged Allah's favor with disbelief of Allah and plunged their people into the valley of destruction? Namely Hell Hell; they enter into it; and that's the worst place to live. (Ibrahim\/14: 28-29) They should be grateful for all these great blessings, and not do otherwise. Because of disbelief, Allah changed the atmosphere of safety and peace and full of prosperity, to an atmosphere of hunger and fear. Likewise the condition of the city of Mecca and its inhabitants. The city of Mecca because of its strategic location, in the middle of the Arabian Peninsula, has become a city of cross-trade between the north and south. There are three famous markets in the vicinity, namely: Ukaz Market near Taif Market, Majannah near Mecca, and Dzulmajaz near Arafah. These markets are crowded during the months of Zulkaidah and Zulhijah by Arabs from all tribes. In addition to those months for performing the pilgrimage to the Kaaba, they also held various activities, such as trading and reciting beautiful poetry. The city of Mecca since before Islam was already a bustling city. Many people who visit the city of Mecca bring fortune and prosperity. Al-Qur'an tells the location of the city of Mecca which is between the two great countries of Syria and Yemen. The Word of Allah swt: Indeed, for the Sabaean people there is a sign (of God's greatness) in their residence, namely two gardens on the right and on the left, (they are told), \"Eat from you of the sustenance that (bestowed) your Lord and give thanks to Him. (Your country) is a good (comfortable) country while (your God) is the Most Forgiving God.\" But they turned away, so We sent on them a great flood and We replaced their two gardens with two gardens growing (trees) with bitter fruit, the Asl tree and a few Sidr trees. (Saba'\/34: 15-16) That the city of Mecca is a safe and peaceful country, Allah declared in the Qur'an with His words: And they said, \"If we follow the instructions with you, surely we will be expelled from our country.\" (Allah said) Did We not confirm their position in the safe land of the forbidden (holy land), which brought to that place fruits of all kinds (plants) as sustenance (for you) from Us? But most of them don't know. (al-Qasas\/28: 57)"
		   },
		   {
			"id": 2014,
			"surah": 16,
			"ayat": 113,
			"tafsir": "Among their actions that show kufr favors are denial and hostility to the Prophet as explained by Allah in this verse. When the Apostle came to them to give instruction and guidance, they belied and opposed him, even though they knew the Prophet's origins and his morals and association. They also understand that the teachings taught by the Apostle are true, but because they are driven by interest and hatred for no reason, they reject and oppose it. According to the sunnah of Allah, every ummah who has the arrival of the Messenger, but they deny and oppose him, will be overwritten by punishment. Word of Allah swt: ¦But We will not torture before We send a messenger. (al-Isra'\/17: 15) The polytheists of Mecca were also not spared from Allah's punishment due to their actions against the Prophet Muhammad, like the ancient peoples. They experienced suffering and misery due to years of hunger. Allah sent down punishment on them because of the request of the Prophet Muhammad after he suffered many hardships. The Prophet's prayer: O Allah, send down Your harsh punishment on the Mudhar, (Mushrikin Quraysh) and make their punishment for years like the year of famine in the time of the Prophet Yusuf as. (Al-Bukhari history from Ibn Mas'ud) For a year the polytheists of Mecca suffered from hunger which consumed their wealth, so they were forced to eat camel skins, dogs, carrion and burnt bones. Previously, they always had abundant sustenance and food coming from all over. However, everything has changed so they have to live in deprivation. Likewise, their life which was originally safe and peaceful turned into hostility and fear of the Prophet and his companions. This fear arose after the Prophet and his companions migrated to Medina. They were worried about the strength of the Islamic army, which at one time could ambush their trading tribes or livestock. That is the punishment of Allah that was revealed to them, namely hunger and fear that covered their lives due to disbelief in Allah's favors. They are unjust people, do wrong, and do not want to be grateful for God's blessings. Muhammad SAW and his friends and followers experienced life changes. They were once in fear they became serene and peaceful, and from distress they became prosperous and happy. They eventually become the leaders of mankind and the rulers of the world."
		   },
		   {
			"id": 2015,
			"surah": 16,
			"ayat": 114,
			"tafsir": "In this verse, Allah orders Muslims to eat halal and good food from the sustenance that Allah has given them, whether the food comes from animals or plants. Halal food is food and drink that is permitted by religion to eat and drink. Good food is food and drink that is allowed to be eaten or drunk by health, including food that is nutritious, tasty and healthy. Halal and good food is what God ordered to eat and drink. There are a lot of foods that are approved by health science, and are basically okay to eat and drink. Word of Allah swt: O you who believe! Eat from the good sustenance that We give you (al-Baqarah\/2: 172) Allah SWT says: They ask you (Muhammad), \"What is lawful for them?\" Say, \"What is lawful for you (is food) that is good and (game caught) by hunting animals that you have trained to hunt, which you have trained according to what Allah has taught you.\" (al-Ma'idah\/5: 4) Good food and drink are not forbidden to eat, except when Allah swt or His Messenger forbade it. The word of Allah swt: O you who believe! Do not forbid what is good that Allah has made lawful for you, and do not transgress Allah does not like those who transgress limits. (al-Ma'idah\/5: 87) Food that is spread over the earth from animals and plants is a great blessing from Allah SWT. Humans should be grateful for it by saying \"Alhamdulillah\" and use it according to the instructions of Allah and His Messenger, such as eating or trading it. The Prophet said: Verily Allah is pleased with the servant who says \"Alhamdulillah\". (History ath-thabrani from al-Aswad bin Sari') Included in the meaning of being grateful is maintaining and developing food sources so they don't become extinct from the surface of the earth and to meet the nutritional needs of humankind. In caring for and developing these animals or plants, Muslims must submit to the applicable laws of Allah, for example regarding the provisions of zakat and its social functions. Being grateful for God's blessings means saying words of gratitude when using, maintaining, and developing them based on God's instructions, because He is the one who gives these gifts and pleasures. Every believer must obey Allah's provisions and commands, and stay away from His prohibitions if you truly believe in Him."
		   },
		   {
			"id": 2016,
			"surah": 16,
			"ayat": 115,
			"tafsir": "In this verse, Allah explains the foods that are haraam for Muslims. Foods that are forbidden in this verse are carrion, blood, pork, and animals slaughtered in the name of idols or other things other than the name of Allah. The prohibition against food is solely the right and wisdom of Allah SWT in guiding His servants. As Allah says: Verily Allah determines the law according to what He wills. (al-Ma'idah\/5: 1) Among the wisdom or intentions of prohibiting food, some are accessible to reason (ta'aqquli), some are not accessible to reason (ta'abbudi). For every Muslim, it is obligatory to obey Allah's prohibitions with sincerity and full of faith. Carcass is an animal that dies naturally due to natural causes, or dies because it was not slaughtered according to Islamic rules. Included in the definition of carrion here are animals that have been suffocated, crushed to death (beaten), fallen to death, gored, and eaten by wild animals. Word of Allah swt: Prohibited for you (to eat) carrion, blood, pork, and (meat) animals slaughtered not in (the name of) Allah, who are strangled, who are beaten, who fall, who are gored, and which are attacked by wild animals, except those you could slaughter, and (also forbidden) slaughtered for idols. (al-Ma'idah\/5: 3) All unclean carcasses are eaten except fish carcasses, as the word of Allah swt: It is lawful for you sea game and food (which comes) from the sea as delicious food for you, and for those who are deep in journey. (al-Ma'idah\/5: 96) Blood that is forbidden is flowing blood or frozen blood (marus). Liver and kidney are not considered as unclean blood to eat. Hadith of the Prophet saw: Halal for us two kinds of carrion and blood. The two carcasses were fish and locusts, and the two bloods were the liver and spleen. (Ahmad and Ibn Majah's history from Ibn 'Umar) Included in the meaning of pork are fat, bones and all their parts and all products made from pork and its derivatives. Pigs are classified as the dirtiest livestock in the way they live and eat. The meat contains tapeworm seeds which cause many diseases in the human body. Allah forbids slaughtering animals that deliberately mention names other than Allah, such as the names of statues, jinns, gods, guardians, and so on. The prohibition aims to prevent things that tend to shirk. An-Nawawi in the Syarah Muslim book says that if the intention of the slaughterer to mention a name other than Allah is to magnify that name and intend it as worship to him, then this act is considered shirk. If the slaughterer behaves like this, it can be judged that he leaves religion (apostasy). This was explained by an-Nawawi when giving a description of the Prophet's Hadith: Allah curses those who slaughter animals for other than Allah. (Muslim history from Ali bin Abi Talib) Islam is a religion that always gives room to its adherents. There are no things in Islam that make things difficult and make things difficult. Therefore, all foods that are forbidden may be eaten when someone is in a state of necessity or emergency. For example, a hunter in the middle of a forest on an empty stomach if left alone can destroy himself while there is no other food, he is allowed to eat unclean food to overcome his condition, provided that he is not driven by the desire to eat unclean food itself. If he eats the food more than what is needed, it is not justified. Because, it can lead to new difficulties associated with foods that contain the disease. Indeed, Allah swt forgives what His servants do when they are in trouble, and loves them by making concessions in their life in this world."
		   },
		   {
			"id": 2017,
			"surah": 16,
			"ayat": 116,
			"tafsir": "In this verse, Allah swt forbids Muslims from forbidding or making food lawful according to their tastes and desires, just like polytheists. They have a habit of forbidding or making animals lawful solely based on the terms they have set for the animals themselves, for example: bahirah, sa'ibah, wasilah, and ham, as Allah says: Allah has never prescribed bahirah, sa' ibah, wasilah, and ham. But the disbelievers fabricate lies against Allah, and most of them don't understand. (al-Ma'idah\/5: 103) In determining whether a food or drink is halal or unlawful, it must be based on Islamic arguments originating from the Al-Qur'an and sunnah. Determination of law without syara's arguments is not justified. This includes making things up and lying to God. In the Al-Qur'an it is mentioned about the words of the polytheists regarding the provisions of young animals that are still in the womb of their mothers. Word of Allah swt: And they said (also), \"What is in the bellies of these livestock is exclusively for our men, unlawful for our wives.\" (al-An'am\/6: 139) Because it has a very bad effect on religious life, Allah gives a strong threat to those who invent lies against Allah. Allah confirms that those who do so will not achieve success in their lives, either in this world or in the hereafter. In the world, those who like to make up laws without valid reasons will be criticized and abandoned by society. Their lies will become known to society and they will become the target of ridicule and humiliation. In Tafsir Ibn Kathir it is revealed that included in the meaning of this verse is anyone who invents bid'ah (religious affairs) that has no sharia basis, or justifies something that is unlawful or makes something lawful for Allah solely based on his own thoughts and tastes."
		   },
		   {
			"id": 2018,
			"surah": 16,
			"ayat": 117,
			"tafsir": "Allah confirms again that those who invent provisions and laws that have absolutely no basis from the book of Allah and His Messenger, but solely from lust, will definitely not gain success in this world and the hereafter. If there is gain from the behavior, then the gain is very small compared to the loss and harm that results from that action. In history, many sad events occurred as a result of religious opinions that did not come from the scriptures. This opinion is sometimes held only to fulfill the desires and interests of those in power who make religion a tool to strengthen their power and enhance their desires. What is lawful is forbidden and what is unlawful is made lawful by people who want to gain worldly benefits. They forget that worldly pleasures are few and limited to their short lives. But in the eternal afterlife, they will receive punishment from Allah because of the impudence of their tongues when they lied to Allah. They have committed crimes, which polluted their own souls with sin and lies against God. In fact, other people also fall into sin and mistakes because of their fatwa which justifies what is unlawful or forbids what is lawful. Sin will be heaped upon them for desiring the little worldly gains."
		   },
		   {
			"id": 2019,
			"surah": 16,
			"ayat": 118,
			"tafsir": "In this verse, Allah swt recalls what is forbidden to the Jews. Halal and unlawful things in Judaism are actually not the same as what is forbidden or permitted by the polytheists. This shows that the determination of halal and haram by polytheists for their livestock did not come from the shari'a of previous religions. Some foods have been forbidden by Allah to the Jews, as explained in the word of Allah: And to the Jews, We have forbidden all (animals) with hooves, and We have forbidden them the fat of cattle and sheep, except that which sticks to their backs, or that which in the contents of his stomach, or mixed with bones. Thus We punished them for their iniquity. And verily, We are Truthful. (al-An'am\/6: 146) Allah forbade the meat and fat of livestock specifically for the Jews as a punishment for their wrongful deeds such as killing prophets, eating usury, and obtaining wealth in an unlawful way. Word of Allah swt: Because of the tyranny of the Jews, We have made forbidden for them the good food that was (formerly) made lawful; and because they often hinder (others) from the path of Allah. (an-Nisa'\/4: 160) From this verse, a clear difference can be understood between the reason Allah forbade certain types of food to the Jews and the reasons that apply to Muslims. To Muslims, Allah swt does not forbid food except because in that food there is something harmful that can harm him. As for the Jews, Allah forbids these good foods as a punishment for them. So it is not correct to say that the Children of Israel themselves forbade this food to themselves. All food, before the Torah was revealed to them, is halal, except for food that was forbidden by the Prophet Jacob (Israil) for himself. According to history, the food that was forbidden by the Prophet Jacob was camel meat and milk. He did so to curb lust in an effort to cleanse the soul and to draw closer to Allah. Word of Allah swt: All food is lawful for the Children of Israel, except for food that Israel (Jacob) made unlawful for him before the Torah was revealed. (Ali 'Imran\/3: 93) As for food, such as the meat of hoofed animals, fat of cattle and goats, it was forbidden to all the Children of Israel at the time the Torah was sent down as a punishment for them."
		   },
		   {
			"id": 2020,
			"surah": 16,
			"ayat": 119,
			"tafsir": "Then Allah explains the greatness of mercy and compassion for His servants by giving forgiveness to those who commit crimes in general, both crimes that offend Allah and other crimes and immoral acts. However, Allah SWT linked several provisions to obtain His love and forgiveness, such as: First: People who commit crimes because of their ignorance or ignorance of religious laws. He did not know that what he was doing violated religious orders besides causing harm to himself. Second: Arise in him a deep sense of remorse after committing a crime and then saying istighfar and immediately repenting to Allah swt. Repentance should not be delayed after he realizes his mistake, because such things damage his faith and soul. Word of Allah swt: Indeed repentance to Allah is only (appropriate) for those who commit crimes because they do not understand, then immediately repent. Their repentance is what Allah accepts. Allah is All-Knowing, All-Wise. (an-Nisa'\/4: 17) Third: Do good deeds and stay away from Allah's prohibitions as proof of his regret. With a strong intention and a firm heart, promise not to repeat the crimes that have been committed and are determined to obey Allah swt. Word of Allah swt: And whoever repents and does good deeds, then indeed he repents to Allah with true repentance. (al-Furqan\/25: 71)"
		   },
		   {
			"id": 2021,
			"surah": 16,
			"ayat": 120,
			"tafsir": "In this verse, Allah swt praises His servant, Ibrahim as, as His messenger and khalil. He is the imam of the hunafa or the leader of people who like the truth and the father of the prophets. Allah swt states in this verse ummah which means leaders who are role models. According to 'Abdullah bin Mas'ud, ummah means teachers of wisdom. Meanwhile, according to Ibn Umar, ummah means those who teach people about their religion. Such a title shows that the Prophet Abraham had several noble qualities. According to this verse, his characteristics are as follows: 1. He is actually the only Imam. Ibn 'Abbas ra said, \"Indeed he has the same virtues as the virtues of one people.\" He is the leader of the people who unite God. He who destroys statues, opposes disbelievers, and seeks the essence of Allah the Creator through His signs in the firmament. 2. He is a person who obeys and submits to Allah and carries out all orders and keeps away from His prohibitions. 3. He is a person who is far from falsehood, always follows the truth, and does not deviate from that truth. 4. He does not follow the religion of his people who are shirk, but is a person who unites Allah from childhood to old age. He was the one who dared to speak out loud in front of a king who was a shirk religion, as Allah tells in the Qur'an: My Lord is the One who gives life and causes death. (al-Baqarah\/2: 258) He also stated that the worship of images and stars was wrong with his words quoted in the Qur'an: So when the star set he said, \"I do not like those that set.\" (al-An'am\/6: 76) With such a personal explanation of Prophet Ibrahim, the polytheists of Quraysh were pressured because they declared that they adhered to the religion of Prophet Abraham, when in fact, their worship was far from that exemplified by Prophet Abraham. Likewise the Jews and Christians who glorify the Prophet Abraham, it turns out that they deviate a lot from the teachings of monotheism. Allah's explanation about Abraham exposed the falsehood and fallacy of their beliefs. Word of Allah swt: Ibrahim was not a Jew and not (also) a Christian, but he was a straight man, a Muslim and he was not one of the polytheists. (Ali 'Imran\/3: 67) 5. Prophet Ibrahim was a grateful person who was grateful for the blessings of Allah SWT that were bestowed on him, as also explained in the word of Allah: And (the leaves) Abraham who always fulfilled the promise? (an-Najm\/53: 37) The meaning is that the Prophet Abraham was a person who always carried out all of God's commands. Allah's description of this trait is a sharp satire on the Quraysh because they denied Allah's favor, so they were punished with hunger and fear. 6. He is actually Allah's choice for prophethood, as He says: And indeed, before him (Moses and Harun) We have given guidance to Abraham, and We have known him. (al-Anbiya'\/21: 51) 7. That Allah swt guided Abraham to the straight path, namely worshiping Him alone, none worthy of worship except Him, and Him having no partners. Furthermore, Abraham taught people to the path of monotheism and invited people to the religion of Allah. The Word of Allah swt: And remember Our servants: Abraham, Isaac and Jacob who have great powers and (high) knowledge. Indeed, We have purified them by (bestowing) high morals on them, namely always reminding (people) of the hereafter. And verily, with Us they are among the best of the elect. (as-shad\/38: 45-47) 8. Ibrahim was made by Allah as the favorite prophet of mankind and is recognized by all adherents of the major religions in the world. Jews, Christians and Muslims acknowledge the prophethood of Ibrahim as. Even the Quraysh infidels were very proud of Prophet Abraham's prayer so that he would become a human favorite in the future. Word of Allah swt: (Ibrahim prays), \"O my Lord, give me knowledge and put me among the pious, and make me a good speech for the people (who come) later. (asy-Syu') ara'\/26: 83-84) 9. That in the hereafter he was included in the ranks of pious people and occupies a high degree in heaven, according to his own request. These are some of the perfect characteristics of the personality of the Prophet Abraham. In short it can be said that he has leadership qualities, is obedient (disciplined), has a noble character (moralist), is firm (consistent) in truth, is a muwahhid (monotheist) who is clean, likes to be grateful and ungrateful, is a teacher, and has a name that fragrant and famous among mankind, and including people who are pious. Apart from the general characteristics as mentioned above, there are still very prominent characteristics of the Prophet Abraham, as explained in the Al-Qur'an, namely: 1. people with the result of finding the oneness of Allah after a long process of searching through the signs of Allah's power in the firmament. Therefore, he is called the Father of Tauhid (Monotheism). 2. People who are very persistent and tenacious in upholding monotheism and destroying polytheism, tirelessly and hopelessly. 3. People who are very resigned and surrender to Allah swt. As an example of his perfect submission to Allah SWT, when he received an order to sacrifice his son, Ismail AS, he did not hesitate in the slightest to carry it out."
		   },
		   {
			"id": 2022,
			"surah": 16,
			"ayat": 121,
			"tafsir": "In this verse, Allah swt praises His servant, Ibrahim as, as His messenger and khalil. He is the imam of the hunafa or the leader of people who like the truth and the father of the prophets. Allah swt states in this verse ummah which means leaders who are role models. According to 'Abdullah bin Mas'ud, ummah means teachers of wisdom. Meanwhile, according to Ibn Umar, ummah means those who teach people about their religion. Such a title shows that the Prophet Abraham had several noble qualities. According to this verse, his characteristics are as follows: 1. He is actually the only Imam. Ibn 'Abbas ra said, \"Indeed he has the same virtues as the virtues of one people.\" He is the leader of the people who unite God. He who destroys statues, opposes disbelievers, and seeks the essence of Allah the Creator through His signs in the firmament. 2. He is a person who obeys and submits to Allah and carries out all orders and keeps away from His prohibitions. 3. He is a person who is far from falsehood, always follows the truth, and does not deviate from that truth. 4. He does not follow the religion of his people who are shirk, but is a person who unites Allah from childhood to old age. He was the one who dared to speak out loud in front of a king who was a shirk religion, as Allah tells in the Qur'an: My Lord is the One who gives life and causes death. (al-Baqarah\/2: 258) He also stated that the worship of images and stars was wrong with his words quoted in the Qur'an: So when the star set he said, \"I do not like those that set.\" (al-An'am\/6: 76) With such a personal explanation of Prophet Ibrahim, the polytheists of Quraysh were pressured because they declared that they adhered to the religion of Prophet Abraham, when in fact, their worship was far from that exemplified by Prophet Abraham. Likewise the Jews and Christians who glorify the Prophet Abraham, it turns out that they deviate a lot from the teachings of monotheism. Allah's explanation about Abraham exposed the falsehood and fallacy of their beliefs. Word of Allah swt: Ibrahim was not a Jew and not (also) a Christian, but he was a straight man, a Muslim and he was not one of the polytheists. (Ali 'Imran\/3: 67) 5. Prophet Ibrahim was a grateful person who was grateful for the blessings of Allah SWT that were bestowed on him, as also explained in the word of Allah: And (the leaves) Abraham who always fulfilled the promise? (an-Najm\/53: 37) The meaning is that the Prophet Abraham was a person who always carried out all of God's commands. Allah's description of this trait is a sharp satire on the Quraysh because they denied Allah's favor, so they were punished with hunger and fear. 6. He is actually Allah's choice for prophethood, as He says: And indeed, before him (Moses and Harun) We have given guidance to Abraham, and We have known him. (al-Anbiya'\/21: 51) 7. That Allah swt guided Abraham to the straight path, namely worshiping Him alone, none worthy of worship except Him, and Him having no partners. Furthermore, Abraham taught people to the path of monotheism and invited people to the religion of Allah. The Word of Allah swt: And remember Our servants: Abraham, Isaac and Jacob who have great powers and (high) knowledge. Indeed, We have purified them by (bestowing) high morals on them, namely always reminding (people) of the hereafter. And verily, with Us they are among the best of the elect. (as-shad\/38: 45-47) 8. Ibrahim was made by Allah as the favorite prophet of mankind and is recognized by all adherents of the major religions in the world. Jews, Christians and Muslims acknowledge the prophethood of Ibrahim as. Even the Quraysh infidels were very proud of Prophet Abraham's prayer so that he would become a human favorite in the future. Word of Allah swt: (Ibrahim prays), \"O my Lord, give me knowledge and put me among the pious, and make me a good speech for the people (who come) later. (asy-Syu') ara'\/26: 83-84) 9. That in the hereafter he was included in the ranks of pious people and occupies a high degree in heaven, according to his own request. These are some of the perfect characteristics of the personality of the Prophet Abraham. In short it can be said that he has leadership qualities, is obedient (disciplined), has a noble character (moralist), is firm (consistent) in truth, is a muwahhid (monotheist) who is clean, likes to be grateful and ungrateful, is a teacher, and has a name that fragrant and famous among mankind, and including people who are pious. Apart from the general characteristics as mentioned above, there are still very prominent characteristics of the Prophet Abraham, as explained in the Al-Qur'an, namely: 1. people with the result of finding the oneness of Allah after a long process of searching through the signs of Allah's power in the firmament. Therefore, he is called the Father of Tauhid (Monotheism). 2. People who are very persistent and tenacious in upholding monotheism and destroying polytheism, tirelessly and hopelessly. 3. People who are very resigned and surrender to Allah swt. As an example of his perfect submission to Allah SWT, when he received an order to sacrifice his son, Ismail AS, he did not hesitate in the slightest to carry it out."
		   },
		   {
			"id": 2023,
			"surah": 16,
			"ayat": 122,
			"tafsir": "In this verse, Allah swt praises His servant, Ibrahim as, as His messenger and khalil. He is the imam of the hunafa or the leader of people who like the truth and the father of the prophets. Allah swt states in this verse ummah which means leaders who are role models. According to 'Abdullah bin Mas'ud, ummah means teachers of wisdom. Meanwhile, according to Ibn Umar, ummah means those who teach people about their religion. Such a title shows that the Prophet Abraham had several noble qualities. According to this verse, his characteristics are as follows: 1. He is actually the only Imam. Ibn 'Abbas ra said, \"Indeed he has the same virtues as the virtues of one people.\" He is the leader of the people who unite God. He who destroys statues, opposes disbelievers, and seeks the essence of Allah the Creator through His signs in the firmament. 2. He is a person who obeys and submits to Allah and carries out all orders and keeps away from His prohibitions. 3. He is a person who is far from falsehood, always follows the truth, and does not deviate from that truth. 4. He does not follow the religion of his people who are shirk, but is a person who unites Allah from childhood to old age. He was the one who dared to speak out loud in front of a king who was a shirk religion, as Allah tells in the Qur'an: My Lord is the One who gives life and causes death. (al-Baqarah\/2: 258) He also stated that the worship of images and stars was wrong with his words quoted in the Qur'an: So when the star set he said, \"I do not like those that set.\" (al-An'am\/6: 76) With such a personal explanation of Prophet Ibrahim, the polytheists of Quraysh were pressured because they declared that they adhered to the religion of Prophet Abraham, when in fact, their worship was far from that exemplified by Prophet Abraham. Likewise the Jews and Christians who glorify the Prophet Abraham, it turns out that they deviate a lot from the teachings of monotheism. Allah's explanation about Abraham exposed the falsehood and fallacy of their beliefs. Word of Allah swt: Ibrahim was not a Jew and not (also) a Christian, but he was a straight man, a Muslim and he was not one of the polytheists. (Ali 'Imran\/3: 67) 5. Prophet Ibrahim was a grateful person who was grateful for the blessings of Allah SWT that were bestowed on him, as also explained in the word of Allah: And (the leaves) Abraham who always fulfilled the promise? (an-Najm\/53: 37) The meaning is that the Prophet Abraham was a person who always carried out all of God's commands. Allah's description of this trait is a sharp satire on the Quraysh because they denied Allah's favor, so they were punished with hunger and fear. 6. He is actually Allah's choice for prophethood, as He says: And indeed, before him (Moses and Harun) We have given guidance to Abraham, and We have known him. (al-Anbiya'\/21: 51) 7. That Allah swt guided Abraham to the straight path, namely worshiping Him alone, none worthy of worship except Him, and Him having no partners. Furthermore, Abraham taught people to the path of monotheism and invited people to the religion of Allah. The Word of Allah swt: And remember Our servants: Abraham, Isaac and Jacob who have great powers and (high) knowledge. Indeed, We have purified them by (bestowing) high morals on them, namely always reminding (people) of the hereafter. And verily, with Us they are among the best of the elect. (as-shad\/38: 45-47) 8. Ibrahim was made by Allah as the favorite prophet of mankind and is recognized by all adherents of the major religions in the world. Jews, Christians and Muslims acknowledge the prophethood of Ibrahim as. Even the Quraysh infidels were very proud of Prophet Abraham's prayer so that he would become a human favorite in the future. Word of Allah swt: (Ibrahim prays), \"O my Lord, give me knowledge and put me among the pious, and make me a good speech for the people (who come) later. (asy-Syu') ara'\/26: 83-84) 9. That in the hereafter he was included in the ranks of pious people and occupies a high degree in heaven, according to his own request. These are some of the perfect characteristics of the personality of the Prophet Abraham. In short it can be said that he has leadership qualities, is obedient (disciplined), has a noble character (moralist), is firm (consistent) in truth, is a muwahhid (monotheist) who is clean, likes to be grateful and ungrateful, is a teacher, and has a name that fragrant and famous among mankind, and including people who are pious. Apart from the general characteristics as mentioned above, there are still very prominent characteristics of the Prophet Abraham, as explained in the Al-Qur'an, namely: 1. people with the result of finding the oneness of Allah after a long process of searching through the signs of Allah's power in the firmament. Therefore, he is called the Father of Tauhid (Monotheism). 2. People who are very persistent and tenacious in upholding monotheism and destroying polytheism, tirelessly and hopelessly. 3. People who are very resigned and surrender to Allah swt. As an example of his perfect submission to Allah SWT, when he received an order to sacrifice his son, Ismail AS, he did not hesitate in the slightest to carry it out."
		   },
		   {
			"id": 2024,
			"surah": 16,
			"ayat": 123,
			"tafsir": "This verse emphasizes the close relationship between the religion of the Prophet Abraham and the religion brought by the Prophet Muhammad. The Word of Allah swt: Say (Muhammad), \"Surely my Lord has guided me to the straight path, the true religion, the straight religion of Abraham. He (Ibrahim) is not one of the polytheists.\" (al-An'am\/6: 161) Among the laws of the Prophet Abraham which were still valid during the time of the Prophet Muhammad, was the implementation of circumcision. Some scholars stipulate that circumcision is obligatory because the circumcision law was not abolished by the Prophet Muhammad's law. Word of Allah swt: And strive in the way of Allah with true jihad. He has chosen you, and He has not made it difficult for you in religion. (Follow) the religion of your forefather Abraham. He (Allah) has named you Muslims long ago, and (in the same way) in this (Qur'an), so that the Messenger (Muhammad) may be a witness over you and so that all of you may be witnesses over all mankind. Then carry out the prayer; pay zakat, and hold fast to Allah. He is your Protector; He is the best protector and the best helper. (al-hajj\/22: 78) Repeatedly in the Qur'an, Allah swt emphasized that Abraham was not a polytheist as well as the polytheists of Quraysh who claimed to be followers and descendants of the Prophet Abraham."
		   },
		   {
			"id": 2025,
			"surah": 16,
			"ayat": 124,
			"tafsir": "In this verse, Allah swt criticizes the Jews because they disagree about the status of Saturday. Saturday is the day when Allah's wrath fell on some of the Children of Israel because their disobedience violated the obligations on that day, as Allah swt explained: And indeed, you knew those who committed transgressions among you on the Sabbath, so We said to them, \"Be you despicable ape!\" (al-Baqarah\/2: 65) Allah swt obliged the Children of Israel to perform worship on Saturday and forbade them and their animals from doing other work. However, some of them disobeyed Allah's prohibition and looked for ways to justify their actions on that day. Because they justify what is unlawful, God's punishment fell by turning them into monkeys. The stipulation of Saturday as a holy day and for worship is not inherited from the law of the Prophet Abraham, but the stipulation of the law of the Prophet Musa, as Sunday is for the law of Prophet Isa and Friday is for the law of Prophet Muhammad. Allah misled those before us from Friday, so for Jews it is Saturday and for Christians it is Sunday, so Allah came to us whom He gave us guidance for Friday and then Allah made Friday, Saturday and Sunday. And thus they will become our followers on the Day of Judgment. We are the last of the inhabitants of the world but the first people on the Day of Resurrection and will be judged among them before other creatures are judged. (Muslim history from Abu Hurairah and hudzaifah) The description of the glorious days is not the main issue of the Shari'a that Allah revealed to the prophets, but includes the issue of furuiyah (branches). Each of them has its own provisions. The Prophet Muhammad was not ordered to follow the Shari'a of the Prophet Musa as, but he was ordered to follow the Prophet Abraham as. Disputes between groups within the Jewish religion could not be resolved between themselves, because they had taken root and spread. Only Allah swt determines the decision between them on the Day of Judgment in the future, regarding the issues they dispute."
		   },
		   {
			"id": 2026,
			"surah": 16,
			"ayat": 125,
			"tafsir": "In this verse, Allah swt gives guidance to His Messenger on how to invite people (dakwah) to the way of Allah. The way of Allah here means the religion of Allah, namely the Islamic Shari'a which was revealed to the Prophet Muhammad. Allah swt laid the foundations of da'wah for guidance for his people in the future in carrying out the mission of preaching. First, Allah swt explained to His Messenger that in fact this da'wah is preaching for Allah's religion as a way to please Him, not preaching for the individual preacher (who preaches) or for his class and people. Rasulullah saw was ordered to lead people to the way of Allah and for the religion of Allah alone. Second, Allah swt explained to Rasulullah saw to preach with wisdom. Wisdom contains several meanings: a. Knowledge of the secrets and benefits of everything. With that knowledge something can be believed to exist. b. Precise and true words that become arguments (arguments) to explain which are right and which are false or doubtful (doubtful). c. Knowing the laws of the Qur'an, understanding the Qur'an, understanding religion, fearing Allah, and correct words and deeds. The meaning of wisdom that is closest to the truth is the first meaning, namely knowledge about the secrets and benefits of something, namely knowledge that benefits. Da'wah with wisdom is preaching with knowledge related to the secrets, benefits, and intentions of Divine revelation, in a way that is adapted to circumstances and conditions, so that people can easily understand it. Third, Allah swt explained to the Apostle that the da'wah was carried out with good, gentle, and soothing teachings, so that it could be well received. It is inappropriate if teaching and recitation always cause feelings of anxiety, anxiety, and fear in the human soul. People who commit sinful acts out of ignorance or ignorance, it is not natural for their mistakes to be exposed openly in front of others so that they hurt. Sermons or recitations that are delivered in gentle language are very good for softening wild hearts and provide more peace than sermons and recitations which contain terrible threats and curses. However, conveying warnings and threats is permissible if conditions permit and require it. To avoid boredom in his recitation, Rasulullah SAW inserted and processed fun recitation materials with materials that caused fear. Thus, there is no boredom caused by the explanation of the recitation which contains orders and prohibitions without providing recitation material that broadens the chest or stimulates the heart to obey and stay away from prohibitions. Fourth, Allah swt explained that if there is a debate with polytheists or people of the book, the Apostle should refute them in a good way. An example of a good debate is the debate of the Prophet Abraham with his people who invited them to think about correcting their own mistakes, so they found the truth. It is not good to provoke opponents in arguing with sharp words, because this creates a heated atmosphere. It is better to create a comfortable and relaxed atmosphere so that the goal in the debate to find the truth can be achieved satisfactorily. A good debate is a debate that can prevent the emergence of negative human traits such as being arrogant, arrogant, and trying to maintain self-esteem because these traits are very despicable. The opponent argues so that he is faced in such a way that he feels that his dignity is respected, and he shows that the main goal is to find the truth in the religion of Allah SWT. Fifth, the end of all efforts and struggles is faith in Allah SWT, because only He bestows faith on the human soul, not other people or the preacher himself. He is the All-Knowing God who among His servants is unable to defend his insaniah nature (faith in Allah) from misleading influences, so that he becomes astray, and who among the servants whose human nature is maintained so that he is open to receiving guidance (guidance) Allah swt."
		   },
		   {
			"id": 2027,
			"surah": 16,
			"ayat": 126,
			"tafsir": "Based on the narration of Abu Hurairah that the Prophet actually stood before Hamza when he was killed as a martyr in the Battle of Uhud. There was no sight that hurt the Prophet more than seeing Hamzah's mutilated corpse. Then the Prophet said, \"May Allah pour out blessings on you. In fact, you \"as far as I know\" are people who enjoy friendship and do a lot of good. will recompense seventy of them in your stead.\" So Jibril came down with the verses at the end of surahh an-Nahl, \"And if you reply, then repay with (reply) the same as the punishment that was inflicted on you. But if you are patient, that is actually better for those who are patient. \" At that time Rasulullah stood in front of Hamzah's corpse. In this verse Allah swt confirms to the Muslims, who will inherit the struggle of the Prophet Muhammad in spreading Islam, to make the Prophet's attitude above as their guide in facing opponents. The guidelines for da'wah given by Allah in the last verse are guidelines in the field of preaching verbally, hujjah versus hujjah. Da'wah runs in a peaceful atmosphere. However, if the preaching is met with harsh resistance, for example preachers are tortured or killed, Islam takes a firm stance to deal with this situation while upholding the truth. There are two kinds of paths explained by Allah in this verse, first: replying with a balanced reward. Second: accept the act of hostility with a patient heart and forgive the mistake if it can have a better influence on the course of da'wah. According to Ibn Kathir, this verse has the same meaning and purpose as several verses in the Qur'an, which contain the necessity of justice and encouragement to do virtue, as Allah says: (to those who do evil) then the reward is from Allah. Indeed, He does not like unjust people. (asy-Syura\/42: 40) Word of Allah swt: ¦And wounds (even) have qisas (same reply). Whoever releases his (qisas rights), then that (becomes) a penance for him. (al-Ma'idah\/5: 45)"
		   },
		   {
			"id": 2028,
			"surah": 16,
			"ayat": 127,
			"tafsir": "Allah emphasized again His command to the Apostle to be patient and steadfast in facing the disturbances of the Quraysh infidels and their obstacles to their da'wah. However, Allah revealed to the Prophet that patience manifests itself in the heart because Allah gives help and taufik to him. Patience is resistance to symptoms of human emotion and resistance to turbulent passions. That is the guidance of Allah given to His desired servant. This statement of Allah encouraged the Prophet saw, difficulties became lightened by the grace of Allah. The Messenger of Allah does not need to feel worried, anxious and sad about the attitude of his opponents who stay away from his call, or the hostility of those who deny and deny the revelations sent down to Him. Moreover, if the Messenger of Allah felt discouraged and despaired of the denial that they had committed, such as when he was accused of being a witch, witch doctor, poet and so on, such things would not be justified by Allah. In fact, all these accusations were intended to prevent other people from believing in the Prophet Muhammad. In another verse Allah forbade the Prophet to be discouraged by the harassment of the disbelievers. His Word: (This is) the Book that was revealed to you (Muhammad), so don't get short of breath over it, so that you give warning with (the Book) and become a lesson for those who believe. (al-A'raf\/7: 2) Although the above lessons are addressed to the Prophet, they apply to his followers."
		   },
		   {
			"id": 2029,
			"surah": 16,
			"ayat": 128,
			"tafsir": "In this verse, Allah swt explains the reasons why the Prophet was ordered to be patient and forbidden to be anxious and discouraged. Allah swt confirms that He is always there with those who are pious and those who do good as their helpers. Allah always fulfills their requests, strengthens them, and wins them over the disbelievers. People who are pious are always with Allah SWT because they continue to purify themselves to draw closer to Him and eliminate the troubles that exist in their souls. They are never disappointed if they miss an opportunity, but they are also not happy when they get one. Likewise, Allah always accompanies those who do good, carry out their obligations to Him, and always obey His commands and stay away from His prohibitions. Allah's statement to those who are pious and do ihsan (good) in this verse has the same meaning as Allah's statement in His words to the Prophet Musa and Harun as: He (Allah) said, \"Don't worry both of you, verily I am with you both , I hear and see. (thaha\/20: 46) Also has the same meaning as the word of God to the angels: (Remember), when your Lord revealed to the angels, \"Indeed I am with you, so firm (the stand) of those who have believed.\" (al-Anfal \/ 8: 12)"
		   }
	]
}
