{
	"tafseer": [
		{
			"id": 6214,
			"surah": 110,
			"ayat": 1,
			"tafsir": "In these verses, Allah commands what the Prophet Muhammad should do at the time of the liberation of Mecca, that is, when he has seen that Allah's help for His religion has arrived, with the defeat of the polytheists and the victory of the Prophet, and also seeing the people convert to Allah's religion in crowds and flocks, not individually as was the case at the beginning of da'wah. The Arabs said, \"When Muhammad wins over the Meccans whom Allah has saved them from the elephant troops, then you are powerless against him.\" Finally they converted to Islam in large numbers, in groups and one group of 40 people."
		   },
		   {
			"id": 6215,
			"surah": 110,
			"ayat": 2,
			"tafsir": "In these verses, Allah commands what the Prophet Muhammad should do at the time of the liberation of Mecca, that is, when he has seen that Allah's help for His religion has arrived, with the defeat of the polytheists and the victory of the Prophet, and also seeing the people convert to Allah's religion in crowds and flocks, not individually as was the case at the beginning of da'wah. The Arabs said, \"When Muhammad wins over the Meccans whom Allah has saved them from the elephant troops, then you are powerless against him.\" Finally they converted to Islam in large numbers, in groups and one group of 40 people."
		   },
		   {
			"id": 6216,
			"surah": 110,
			"ayat": 3,
			"tafsir": "If this had happened, the Prophet was ordered to glorify and purify his Lord from things that were not worthy of Him, such as considering the arrival of help too late and thinking that God had not kept His promise to help the Prophet against unbelievers. To purify Allah should be by praising Him for the blessings He has bestowed and being grateful for all the goodness that He has bestowed and praising Him properly. If Allah Almighty and All-Wise gives opportunities to disbelievers, it does not mean that He has wasted the rewards of those who do good deeds. Then the Prophet Muhammad was advised to ask Allah's forgiveness for himself and his companions who had shown sadness and despair because they felt Allah's help had come too late. To repent from complaints is to fully believe in God's promises and cleanse the soul from idle thoughts when facing difficulties. Even though this is heavy for an ordinary human soul, it is light for the Prophet Muhammad as a perfect human being. Therefore, Allah told the Prophet to ask His forgiveness. This situation also happens to friends who have perfect souls and accept their repentance, because Allah always accepts the repentance of His servants. Allah educates His servants through various trials and if they feel unable to face them they must ask for His help and have faith that it will come. If he always does this, his soul will become strong and perfect. That is, when help has arrived and victory has been achieved and people flock to Islam, fear will disappear and the Prophet should glorify his Lord and give thanks for Him and cleanse the soul from thoughts that occur in times of trouble. Thus, complaints and disappointment will no longer affect the souls of sincere people as long as they have sincerity and are in harmony with words and love and love. With the revelation of this surahh an-Nasr, the Prophet understood that the task of his treatise had been completed and then he was only waiting for a call to return to Rahmatullah. Ibn 'AbbAs said: \"When the verse of Idha jaa nasrullahi wal fath was revealed, the Messenger of Allah called Fatimah, then said: \"My death is near.\" Fatimah also cried. Rasulullah saw said, \"Don't cry, because you are the first member of my family to will follow me.\" Fatimah laughed happily (hearing this). The wives of the Prophet who saw this said, \"O Fatimah, we saw you crying and laughing.\" Fatimah said, \"Rasulullah SAW told me that his death was near, so I cried. However, he said, \"Don't cry, because you are the first member of my family to follow me.\" So I laughed happily. (Riwayat al-Darimi) Ibn 'Umar said, \"This surahh was revealed in Mina when the Prophet was doing Hajj Farewell', after that the word of Allah was revealed: On this day I have perfected your religion for you, and I have completed My favors for you, and have I accept Islam as your religion. (al-Ma'idah\/5: 3) The Prophet lived only eighty days after this verse was revealed. Then after that, the verse of the Kalalah was revealed, and the Prophet lived after it fifty days. After that the verse was revealed: Indeed , there has come to you an apostle from your own people. (at-Taubah\/9:128) So the Prophet lived after him thirty-five days. Then came down the word of Allah: And fear the day (when) you are all returned to Allah. (al Baqarah \/2:281) So the Holy Prophet lived thereafter only twenty-one days."
		   }
	]
}
