{
	"tafseer": [
		{
			"id": 6091,
			"surah": 94,
			"ayat": 1,
			"tafsir": "In this verse it is stated that Allah has enlarged the chest of the Prophet Muhammad and saved him from ignorance of the Shari'a. The Prophet was also worried about the stupidity and stubbornness of his people. They did not want to follow the truth, while the Prophet saw was always looking for a way to release them from the valley of ignorance, so he found a way for it and saved them from the destruction they were experiencing. The meaning of this verse is that Allah has cleansed the Prophet's soul from all kinds of feelings of anxiety, so that he is not anxious, troubled, and upset. The Prophet was also made always calm and believed in Allah's help and assistance to him. The Prophet also believed that He who commissioned him as a messenger would never help his enemies."
		   },
		   {
			"id": 6092,
			"surah": 94,
			"ayat": 2,
			"tafsir": "In these verses, Allah reveals that He is willing to lighten the burden that was borne on the Prophet Muhammad in carrying out the spread of His message. Thus, the Prophet could easily convey it to humans, and with a calm soul faced the challenges of his enemies even though sometimes these challenges were dangerous. After Muhammad was appointed as an apostle, he began to carry out the task of conveying Allah's religion to the Quraysh. Because there was a strong reaction from them, he broadcast Islam secretly. Therefore, he found it very difficult to do the task. With the conversion of several Quraysh dignitaries such as Umar bin al-Khaththab, Hamza, and others, the Prophet felt light in carrying out his duties. This was coupled with the coming of God's command to spread Islam openly and the existence of God's guarantee to help him, as His word: So convey (Muhammad) openly everything that is ordered (to you) and turn away from those who polytheist. Indeed, We protect you (Muhammad) from (the crimes of) people who make fun of (you), (ie) people who think there is a god besides Allah. They will know later (the result). (al-hijr\/15: 94-96)"
		   },
		   {
			"id": 6093,
			"surah": 94,
			"ayat": 3,
			"tafsir": "In these verses, Allah reveals that He is willing to lighten the burden that was borne on the Prophet Muhammad in carrying out the spread of His message. Thus, the Prophet could easily convey it to humans, and with a calm soul faced the challenges of his enemies even though sometimes these challenges were dangerous. After Muhammad was appointed as an apostle, he began to carry out the task of conveying Allah's religion to the Quraysh. Because there was a strong reaction from them, he broadcast Islam secretly. Therefore, he found it very difficult to do the task. With the conversion of several Quraysh dignitaries such as Umar bin al-Khaththab, Hamza, and others, the Prophet felt light in carrying out his duties. This was coupled with the coming of God's command to spread Islam openly and the existence of God's guarantee to help him, as His word: So convey (Muhammad) openly everything that is ordered (to you) and turn away from those who polytheist. Indeed, We protect you (Muhammad) from (the crimes of) people who make fun of (you), (ie) people who think there is a god besides Allah. They will know later (the result). (al-hijr\/15: 94-96)"
		   },
		   {
			"id": 6094,
			"surah": 94,
			"ayat": 4,
			"tafsir": "In this verse it is explained that Allah raised the rank of the Prophet Muhammad, elevated his position and enlarged his influence. Is there a position that is more noble than the position of prophecy (prophecy) that Allah has bestowed upon him? Is there anything more important than spreading throughout the world loyal followers who obediently carry out all the commands and stay away from all the prohibitions. They do so because they believe that in carrying out his orders there is a great advantage, while disobeying them is a great loss. Is there a title that is more noble and can be proud of than saying his name with the name of Allah, the Most Compassionate, as a sign of human perfection? Which other title is more noble than the title that is used as a sign of his apostolic recognition and this recognition is made a condition for someone to become a resident of heaven. Apart from that, the Holy Prophet has liberated humanity from slavery, ignorance, and corrupted minds, and brought humans back to nature which guarantees freedom of thought and will. Thus, humans can find the right and know who really should be worshiped. They then unite in faith and worship God Almighty, after they differ in their healing. He is the one who removes the clouds of darkness from them, and illuminates the path that must be taken to lead to glory and happiness."
		   },
		   {
			"id": 6095,
			"surah": 94,
			"ayat": 5,
			"tafsir": "In this verse, Allah reveals that actually in every narrowness, there is spaciousness, and in every lack of means to achieve a desire, there is also a way out. However, in an effort to achieve something, one must stick to patience and trust in Allah. This was the nature of the Prophet, both before he was appointed as an apostle and afterward, when he was forced to face the challenges of his people. Even so, he was never agitated nor did he change his goals, but he was patient with the crimes of his people and continued to carry out his da'wah while submitting himself with trust in Allah and hoping for a reward from Him. That was the condition of the Prophet (s) from the beginning of his preaching. In the end, Allah gave him supporters who loved him wholeheartedly and were determined to take care of him and his religion. They believe that their life will not be perfect except by destroying all joints of polytheism and disbelief. Then they are willing to redeem the rewards and favors provided by Allah for those who strive in His way with their lives, property and all that they have. Thus, they were able to destroy the strongholds of the Persian and Roman kings. The verse seems to state that if the situation is too dire, then naturally we want to get out safely from this difficulty by taking all possible ways, while putting our trust in Allah. Thus, victory can be achieved no matter how great the obstacles and trials are faced. With this also, Allah informed the Prophet Muhammad that his situation would change from being poor to being rich, from having no friends to having many brothers and sisters and from the hatred of his people to a love that was incomparable."
		   },
		   {
			"id": 6096,
			"surah": 94,
			"ayat": 6,
			"tafsir": "This verse is a repetition of the previous verse to strengthen the meaning contained in the previous verse. If the difficulty is faced with real determination and try with all your might and mind to get rid of it, persevere and be patient and do not complain about the delay in the arrival of ease, the ease will surely come."
		   },
		   {
			"id": 6097,
			"surah": 94,
			"ayat": 7,
			"tafsir": "After declaring His favors on the Prophet Muhammad and His promise to save him from the dangers that befell him, Allah ordered him to be grateful for these blessings by diligently doing good deeds while putting his trust in Him. When he has finished doing a deed, then let him do another deed. Because, in a state of continuing to do good deeds, he will find peace of mind and ease of heart. This verse recommends that the Prophet be diligent and persistent in doing good deeds."
		   },
		   {
			"id": 6098,
			"surah": 94,
			"ayat": 8,
			"tafsir": "In this verse, Allah confirms that the Prophet Muhammad did not expect a reward from the results of his deeds, but only demanded Allah's pleasure. Because He is actually the one who is addressed in charity worship and to Him is the place to humble oneself."
		   }
	]
}
