{
	"tafseer": [
		{
			"id": 5801,
			"surah": 81,
			"ayat": 1,
			"tafsir": "In this verse, Allah explains that if the sun has been rolled up, its light has gone out and it has fallen apart along with the destruction of the universe that was once inhabited by the creatures that live in the world, then all worlds will perish because they move to another world."
		   },
		   {
			"id": 5802,
			"surah": 81,
			"ayat": 2,
			"tafsir": "When the stars fall and their light goes out."
		   },
		   {
			"id": 5803,
			"surah": 81,
			"ayat": 3,
			"tafsir": "And when the mountains are crushed after being uprooted from the earth, they are sent flying through the sky when there is a great earthquake so that the mountains are separated from their base and thrown into the sky like clouds that are blown by the wind like cotton. For the scientific study of surahh at-Takwir\/81: 1-3, see also the scientific study of surahh al-haqqah\/69: 13-16 and surahh al-Ma'arij\/70: 8. When there is a process towards the Big Crunch, namely the process of condensing or shrinking the universe, then all matter breaks back into fundamental matter such as quarks, electrons and so on. Forces such as gravitational, electromagnetic, strong nuclear and weak nuclear forces are starting to come together again. It was then that the celestial bodies began to lose their gravitational forces, and as a result there were violent collisions between stars, this is the description of 'stars falling, because they have lost their gravitational forces. The sun, which is also a type of star, experiences the same thing. When the celestial bodies approach each other, the outer gravitational forces will probably exceed the grip of the plasma forces inside the stars (including the sun). The result is that the volume of the sun and other stars will expand. The sun will become larger in volume, but its internal pressure will be reduced, and enough to stop the energy that produces its nuclear fusion reactions. As a result, sunlight (which expands it) will fade to red. When the expansion of the sun's volume has reached its maximum, the sun will experience contraction and its volume will continue to decrease and decrease, shrinking which eventually becomes a super-dense black spot (dwarf black hole or dwarf black spot). Is this what is meant by the sun being rolled up in verse 1 above? Clashes also occur between planets, so that the earth collides with other planets. As a result of this event the destruction of the mountains. All of these processes will lead to Big Crunch and back into a singularity."
		   },
		   {
			"id": 5804,
			"surah": 81,
			"ayat": 4,
			"tafsir": "And if pregnant camels, which are among the objects most valued by the Arabs, are abandoned and ignored by their owners because of the awesomeness of the Day of Judgment. This illustrates the enormity of the Day of Judgment which, if it is estimated, if a man has a pregnant camel he will certainly be left behind because he is too busy thinking about his own safety."
		   },
		   {
			"id": 5805,
			"surah": 81,
			"ayat": 5,
			"tafsir": "And when wild animals are collected and destroyed."
		   },
		   {
			"id": 5806,
			"surah": 81,
			"ayat": 6,
			"tafsir": "And when the seas are overflowed, so that they become one, then they burn with the fire that was buried under the earth. After Allah explained several events that were the beginning of the destruction of the universe and the death of all creatures that were above it, then Allah explained what happened after that regarding the resurrection."
		   },
		   {
			"id": 5807,
			"surah": 81,
			"ayat": 7,
			"tafsir": "And when the spirits are reunited with the body to enter life in the afterlife. This verse contains a hint that the spirits remain intact after death and on the Day of Judgment are returned to their bodies. Another opinion mentions the meaning of this verse by meeting groups of people including the ashabul-yamin and the ashabusy-syimal group. Ibn 'Abbas said that the meaning of this verse is that the souls of believers meet with their spouses in heaven and the spirits of disbelievers meet with their demons."
		   },
		   {
			"id": 5808,
			"surah": 81,
			"ayat": 8,
			"tafsir": "And when the baby girl who was buried alive is asked, for what sin was she killed? In this verse Allah explains that babies who have been buried alive will be brought back to life in front of the person who buried them and asked for what sin he was killed. The answer to this question gives a deeper impression to the killer because the baby girl will answer that she was buried alive without sin at all, simply because her parents were afraid of poverty and poverty. The customs of the Arabs during the Jahiliyyah era were beyond humanity. Among them there was one who did not bury his daughter alive, but gave her a job by tending goats in the desert in furs and letting her live in solitude. And there are also those who let their daughter live until she is six years old and then she says to her mother, \"Dress up this child in good clothes, because she will be taken on a pilgrimage to visit her aunt.\" Previously he had dug a well in the desert. After he arrived with his daughter at the edge of the well, then said, \"Look, what's in that well.\" Then the girl was kicked from behind and after she fell into the well she was buried and leveled to the ground. And among them there are those who do even more cruel than this. After coming to Islam, the out-of-human cruelty was replaced by a friendly and loving attitude. Among the reasons for killing girls during the Jahiliyyah was because girls were considered to have no economic value that could benefit the family. Another reason is because girls are seen as very weak, often victims of sexual abuse or because women are seen as seducers of men who can bring shame to the family. In surahh an-Nahl\/16: 58, Allah describes a man who had his daughter born with a black face because he was holding back his anger. Yet when one of them is informed of (the birth of) a daughter, his face becomes black (bright red), and he is very angry. (an-Nahl\/16: 58) Islam is a religion that respects women, just as it respects men. Therefore, Islam prohibits the killing of male and female babies, either because of poverty or because of fear of poverty. Allah said: Do not kill your children because they are poor. It is We who provide sustenance for you and for them. (al-An'am\/6: 151)"
		   },
		   {
			"id": 5809,
			"surah": 81,
			"ayat": 9,
			"tafsir": "And when the baby girl who was buried alive is asked, for what sin was she killed? In this verse Allah explains that babies who have been buried alive will be brought back to life in front of the person who buried them and asked for what sin he was killed. The answer to this question gives a deeper impression to the killer because the baby girl will answer that she was buried alive without sin at all, simply because her parents were afraid of poverty and poverty. The customs of the Arabs during the Jahiliyyah era were beyond humanity. Among them there was one who did not bury his daughter alive, but gave her a job by tending goats in the desert in furs and letting her live in solitude. And there are also those who let their daughter live until she is six years old and then she says to her mother, \"Dress up this child in good clothes, because she will be taken on a pilgrimage to visit her aunt.\" Previously he had dug a well in the desert. After he arrived with his daughter at the edge of the well, then said, \"Look, what's in that well.\" Then the girl was kicked from behind and after she fell into the well she was buried and leveled to the ground. And among them there are those who do even more cruel than this. After coming to Islam, the out-of-human cruelty was replaced by a friendly and loving attitude. Among the reasons for killing girls during the Jahiliyyah was because girls were considered to have no economic value that could benefit the family. Another reason is because girls are seen as very weak, often victims of sexual abuse or because women are seen as seducers of men who can bring shame to the family. In surahh an-Nahl\/16: 58, Allah describes a man who had his daughter born with a black face because he was holding back his anger. Yet when one of them is informed of (the birth of) a daughter, his face becomes black (bright red), and he is very angry. (an-Nahl\/16: 58) Islam is a religion that respects women, just as it respects men. Therefore, Islam prohibits the killing of male and female babies, either because of poverty or because of fear of poverty. Allah said: Do not kill your children because they are poor. It is We who provide sustenance for you and for them. (al-An'am\/6: 151)"
		   },
		   {
			"id": 5810,
			"surah": 81,
			"ayat": 10,
			"tafsir": "In this verse it is explained that if the records of human deeds are opened, then they will see the good or evil they did while in the world. They will be amazed because they did not expect everything to be recorded neatly and thoroughly. Allah said: And put the book (record of charity), then you will see the sinners are afraid of what is (written) in it, and they say, \"How unfortunate we are, what book is this, there is nothing left, the small and great but everything is recorded,\" and they find (all) what they have done (written). And your Lord does not wrong anyone. (al-Kahf\/18: 49) We do not know the form of the book or record of human deeds in Padang Mahsyar. However, if only humans were able to create various recording devices that were so sophisticated and precise, we believe that Allah, the Creator of humans, has a system and a way to record human actions, words, and feelings with better results than what humans can make."
		   },
		   {
			"id": 5811,
			"surah": 81,
			"ayat": 11,
			"tafsir": "And when the heavens are obliterated because of the destruction of the planets that are in them. The vast sky can be folded like folding paper. Allah's Word: (Remember) on the day of heaven We roll up like sheets of paper. (al-Anbiya'\/21: 104)"
		   },
		   {
			"id": 5812,
			"surah": 81,
			"ayat": 12,
			"tafsir": "And when the hell of Jahim which is prepared to torture disbelievers and disobedient people has been kindled as fiercely as possible so that those who enter it feel the most terrible pain. That is the punishment that Allah threatens those who deny Him. Allah's Word: Indeed, We have prepared for the disbelievers chains, fetters and a fiery hell. (al-Insan\/76: 4)"
		   },
		   {
			"id": 5813,
			"surah": 81,
			"ayat": 13,
			"tafsir": "And when heaven is brought closer to those who will enter it, namely the believers who are pious. This is the reward for their hard work and efforts in jihad to uphold the religion of Allah and carry out religious orders. Allah says: And Paradise will be brought closer to those who fear Allah. (asy-Syu'ara'\/26: 90)"
		   },
		   {
			"id": 5814,
			"surah": 81,
			"ayat": 14,
			"tafsir": "If all the events mentioned before this verse had taken place, every soul would have known what he had done. Most of humans when living in the world are deceived by Satan's temptations. They will find their deeds on the Day of Judgment not accepted by Allah and even kept away from His mercy and under His wrath. People whose deeds are shrouded in joy, do not benefit from their deeds except for fatigue and difficulties. Everyone is obliged to look at his deeds with a religious lens and weigh them with the right balance, because Allah does not accept deeds except those that come from a heart full of faith and sincerity."
		   },
		   {
			"id": 5815,
			"surah": 81,
			"ayat": 15,
			"tafsir": "In these verses, Allah swears by the rising and setting of the stars. The stars are all invisible to the eye during the day, but will appear to shine at night. Allah swears by the stars because in their alternating state, invisible during the day and shining at night, is a sign of Allah's power that governs their journey."
		   },
		   {
			"id": 5816,
			"surah": 81,
			"ayat": 16,
			"tafsir": "In these verses, Allah swears by the rising and setting of the stars. The stars are all invisible to the eye during the day, but will appear to shine at night. Allah swears by the stars because in their alternating state, invisible during the day and shining at night, is a sign of Allah's power that governs their journey."
		   },
		   {
			"id": 5817,
			"surah": 81,
			"ayat": 17,
			"tafsir": "In this verse, Allah swears by the night when it has almost left its darkness."
		   },
		   {
			"id": 5818,
			"surah": 81,
			"ayat": 18,
			"tafsir": "Then in this verse Allah swears by the dawn when the dawn starts to break and shine. The time of dawn is used by Allah in swearing because this time raises joyful hopes for every human being who wakes up early to face a new day. At that time they can find their necessities of life, replace what they lost, and get ready for what will come next. Then Allah explained what was made the object of his oath, with His word in the following verse."
		   },
		   {
			"id": 5819,
			"surah": 81,
			"ayat": 19,
			"tafsir": "In these verses, Allah explains the object of the oath mentioned in verses 15-18 above, that is, in fact what Muhammad was told about the events of the Day of Judgment were not the words of a sorcerer or a figment of imagination. However, really the revelation brought by the Archangel Gabriel from his Lord. Allah has characterized the messenger who brought the Qur'an, namely the Archangel Jibril, with five kinds of qualities that contain virtue: 1. Honorable in the sight of God because Allah gave him the most valuable thing, namely guidance, and ordered him to convey that guidance to His prophets are passed on to His servants. 2. Those who have the power to keep the Qur'an far from being forgetful or mistaken. 3. Those who have a high position in the sight of Allah who has the Throne. 4. Who are obeyed among the angels because of their authority. 5. Those who are entrusted with conveying revelations because they are preserved from the traits of betrayal and deviation."
		   },
		   {
			"id": 5820,
			"surah": 81,
			"ayat": 20,
			"tafsir": "In these verses, Allah explains the object of the oath mentioned in verses 15-18 above, that is, in fact what Muhammad was told about the events of the Day of Judgment were not the words of a sorcerer or a figment of imagination. However, really the revelation brought by the Archangel Gabriel from his Lord. Allah has characterized the messenger who brought the Qur'an, namely the Archangel Jibril, with five kinds of qualities that contain virtue: 1. Honorable in the sight of God because Allah gave him the most valuable thing, namely guidance, and ordered him to convey that guidance to His prophets are passed on to His servants. 2. Those who have the power to keep the Qur'an far from being forgetful or mistaken. 3. Those who have a high position in the sight of Allah who has the Throne. 4. Who are obeyed among the angels because of their authority. 5. Those who are entrusted with conveying revelations because they are preserved from the traits of betrayal and deviation."
		   },
		   {
			"id": 5821,
			"surah": 81,
			"ayat": 21,
			"tafsir": "In these verses, Allah explains the object of the oath mentioned in verses 15-18 above, that is, in fact what Muhammad was told about the events of the Day of Judgment were not the words of a sorcerer or a figment of imagination. However, really the revelation brought by the Archangel Gabriel from his Lord. Allah has characterized the messenger who brought the Qur'an, namely the Archangel Jibril, with five kinds of qualities that contain virtue: 1. Honorable in the sight of God because Allah gave him the most valuable thing, namely guidance, and ordered him to convey that guidance to His prophets are passed on to His servants. 2. Those who have the power to keep the Qur'an far from being forgetful or mistaken. 3. Those who have a high position in the sight of Allah who has the Throne. 4. Who are obeyed among the angels because of their authority. 5. Those who are entrusted with conveying revelations because they are preserved from the traits of betrayal and deviation."
		   },
		   {
			"id": 5822,
			"surah": 81,
			"ayat": 22,
			"tafsir": "In this verse, Allah characterizes the Prophet Muhammad by saying that Muhammad was not a madman, as alleged by the Meccan infidels. The phrase \"your friend\" in this verse is an excuse to explain their lie. Because, everyone will know the character of his friends who associate with him every day. The Quraysh people always associated with the Prophet Muhammad since he was a child and knew his honesty. Therefore, they gave him an honorary title with the words \"al-Amin\" before he became a prophet. He never lied, broke promises, or betrayed, so that what was accused of the Prophet Muhammad about being crazy, being a sorcerer, or lying was simply a lie."
		   },
		   {
			"id": 5823,
			"surah": 81,
			"ayat": 23,
			"tafsir": "Prophet Muhammad saw Gabriel in his original form twice in his life. First, when he was in Hira Cave before the revelation of surahh al-Muddatstsir, and secondly, when he ascended to the seventh heaven. The Word of Allah And indeed, he (Muhammad) saw it (in its original form) at another time, (namely) at Sidratul Muntaka. (an-Najm\/53: 13-14)"
		   },
		   {
			"id": 5824,
			"surah": 81,
			"ayat": 24,
			"tafsir": "This verse explains that the Prophet Muhammad was not a curmudgeon in conveying all the revelations that the angel Gabriel conveyed to him. In addition, he is a person who is very trusted because he has never changed a revelation, even one letter with his own words."
		   },
		   {
			"id": 5825,
			"surah": 81,
			"ayat": 25,
			"tafsir": "In this verse, Allah explains that the Qur'an is not the accursed word of Satan, and it is not the words that Satan put on Muhammad's tongue when it disturbed his mind as alleged by the Quraysh. Muhammad was famous since his childhood with a sound mind and never betrayed. Therefore, what Muhammad explained about the news of the hereafter, heaven and hell was not the words of Satan."
		   },
		   {
			"id": 5826,
			"surah": 81,
			"ayat": 26,
			"tafsir": "Then Allah explained that the Quraysh had gone astray, far from the path of truth, and did not know the way of wisdom, so Allah asked them, \"Then where are you going?\" The point is that after it has been explained that the Qur'an really came from Allah and in it contains lessons and instructions that guide people to the straight path, they are asked to the disbelievers, \"Which path are you going to follow again?\""
		   },
		   {
			"id": 5827,
			"surah": 81,
			"ayat": 27,
			"tafsir": "Then Allah stated that the Qur'an is nothing but a warning to the universe, for those whose hearts are inclined towards goodness. However, not all humans can benefit from this Al-Qur'an. Those who benefit are those who want to take the straight path. As for those who deviate from that path, then he cannot benefit from the warnings of the Qur'an."
		   },
		   {
			"id": 5828,
			"surah": 81,
			"ayat": 28,
			"tafsir": "Then Allah stated that the Qur'an is nothing but a warning to the universe, for those whose hearts are inclined towards goodness. However, not all humans can benefit from this Al-Qur'an. Those who benefit are those who want to take the straight path. As for those who deviate from that path, then he cannot benefit from the warnings of the Qur'an."
		   },
		   {
			"id": 5829,
			"surah": 81,
			"ayat": 29,
			"tafsir": "In this verse, Allah says that humans do not have their own will to do something they want if it is not in accordance with Allah's will."
		   }
	]
}
