{
	"tafseer": [
		{
			"id": 2141,
			"surah": 18,
			"ayat": 1,
			"tafsir": "In this verse, Allah swt praises Himself, because it was He who revealed the holy book of the Qur'an to the Prophet saw as a clear guide to life. Through the Qur'an, Allah guides the truth and the straight path. The verses of the Qur'an justify and confirm other verses, so that there is no doubt. The Prophet Muhammad, who received His mandate to convey the Qur'an to mankind, is referred to in this verse by the word 'His servant to show great honor to him, as big as the mandate that was placed on his shoulders."
		   },
		   {
			"id": 2142,
			"surah": 18,
			"ayat": 2,
			"tafsir": "Allah swt explains that the Al-Qur'an is straight, which means it does not tend to exaggerate in containing regulations, thus burdening His servants. But also not too short so that humans need another book to set the rules of their life. The Qur'an was revealed to Muhammad so that he would warn the disbelievers of a great punishment from Allah, because of their disobedience to the Qur'an. It also gives good news to those who believe and do good deeds that they will receive a great reward from Him, because of their faith in Allah and His Messenger, and the good deeds they have done while living in the world."
		   },
		   {
			"id": 2143,
			"surah": 18,
			"ayat": 3,
			"tafsir": "The great reward is none other than the heaven they occupy forever, they will not move or be moved from that paradise, according to Allah's promise to them. Word of Allah swt: And that is the heaven that you have inherited because of the deeds that you have done. (az-Zukhruf\/43: 72)"
		   },
		   {
			"id": 2144,
			"surah": 18,
			"ayat": 4,
			"tafsir": "In this verse, Allah again mentions the Prophet's duty to give a warning to the disbelievers, because their disbelief is seen as a big matter by Allah, especially the disbelievers who say that Allah has children. They are divided into three groups, namely: first, the polytheists of Mecca (Arabs) who say that angels are daughters of God; secondly, the group of Jews who said that Uzair was the son of God; and third, the group of Christians who say that Jesus is the son of God. The Qur'an was sent down to the world to restore mankind's belief in pure monotheism. There are many verses that threaten beliefs in other than Allah which are considered very wrong beliefs. Word of Allah swt: And the Jews said, \"Uzair son of Allah,\" and the Christians said, \"Christ is the son of Allah.\" Those were the words that came out of their mouths. They imitated the words of the former disbelievers. Allah cursed them; how did they turn around? (at-Taubah\/9: 30)"
		   },
		   {
			"id": 2145,
			"surah": 18,
			"ayat": 5,
			"tafsir": "Their assumption that God has a child is not at all based on their own knowledge and beliefs, but based on incorrect assumptions or blind faith in their ancestors. In fact, their ancestors also did not have the knowledge and basic beliefs about such beliefs. It was too bad what they said, which was not born from a sound mind, but just came out of a presumptuous mouth. Allah confirms that what they say is a very big disbelief, because it is not based on belief, and should not be said by a human being. Their impudence in uttering kufr sentences was confirmed by Allah as a lie, which contains no truth. Allah swt reminded the Prophet to order his people to return to the religion of monotheism, as taught by the Qur'an. Allah's Word: Say (Muhammad), \"O People of the Book! Let (we) go to the same sentence (handle) between us and you, that we do not worship other than Allah and we do not associate anything with Him, and that we do not make each other gods besides Allah (ali 'Imran\/3: 64)"
		   },
		   {
			"id": 2146,
			"surah": 18,
			"ayat": 6,
			"tafsir": "According to the history of Ibn 'Abbas that 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Abu Jahal bin Hisham, an-Nadhar bin Harith, Umayyah bin Khalaf, al-Asya bin Wa'il, al-Aswad bin Muttalib, and Abu Buhturi in the presence of several Quraysh held a meeting. Rasulullah SAW found it difficult to see the resistance of his people to him and their denial of the teachings he brought, so that it hurt him very much. Then came down this verse. In this verse, Allah swt reminds Rasulullah saw not to grieve, to the point that it damages his health, just because his people do not want to believe in the Al-Qur'an and its prophethood. Such a thing should not make the Prophet sad because his task is only to convey Divine revelations to them, while the willingness of their souls to accept the truth of these verses depends on Allah's guidance. Word of Allah swt: It is not your duty (Muhammad) to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272) Indeed, the Prophet Muhammad grieved because his great desire and deep love for his people so that they would believe, was not achieved. He was given the title habibullah meaning God's lover, so his very prominent affection for fellow human beings is a reflection of his love for God. The stronger the love for God, the greater his love for humans, even humans are felt as themselves. Therefore, when his people distanced themselves from the guidance of Allah and His Messenger, he felt that this incident was a heavy blow to him. Will not the people who are far from Allah's guidance eventually be destroyed, and he himself will witness their destruction. A heart full of compassion for them becomes a hindrance to the truth, whatever its impetus, and can block the path of truth itself. So Allah swt reminded Rasulullah saw not to heed the response of the polytheists who were an obstacle to the spread of Islam, but to continue delivering his da'wah wisely. Because they are human beings who have been endowed with reason. With that mind, humans can meditate on the truth of the verses of the Qur'an and the verses of kauniyah (nature) like things found in nature."
		   },
		   {
			"id": 2147,
			"surah": 18,
			"ayat": 7,
			"tafsir": "In this verse, Allah SWT explains that everything that exists on this earth was created as an ornament for the earth, both animals and plants consisting of various types in the seas and on land, as well as various minerals and so on. All of this is to test people whether they can understand with their minds that the earth's ornaments can give an idea of the existence of the Creator, to then obey His commands and stay away from His prohibitions. When they use all natural objects, animals and plants for self-devotion to Allah and the benefit of humans, Allah will give them the greatest reward. However, if they use it to disobey Allah and destroy civilization and humanity, then Allah will inflict a great punishment on them as well. The history of mankind proves that they are always vying to acquire the earth's jewelry objects, because they are economic objects which are the source of life for mankind. Because of these things, they kill each other and eventually cause destruction. This will not happen if they realize that the earth's decorative objects are gifts from Allah, and are used for humanity and devotion to God Rabbul Alamin. Thus, whoever can understand and take lessons and wisdom from the earth's ornaments will be happy in this world and in the hereafter. All these natural objects are meant for humans, it's up to them what they want to do with these decorative objects on the surface of the earth? Word of Allah swt: Have you not noticed that Allah has subjected to you (humans) what is in the earth and the ships that sail in the sea by His command. (al-hajj\/22: 65) Words of the Prophet Muhammad saw: Indeed, this world is sweet and green. And indeed Allah appointed you as ruler over it, then He saw what you did. (Muslim history from Abu Sa'id al-Khudri)"
		   },
		   {
			"id": 2148,
			"surah": 18,
			"ayat": 8,
			"tafsir": "This verse explains that Allah is truly able to make what is on this earth a flat and barren land, there are no plants to decorate it. The beauty that originally captivates the eye turns into a dry and faded sight. Such changes can occur due to climate change, and can also be caused by human hands themselves who do not consider the consequences of their own actions, such as wrong urban planning, deforestation, excessive use of land without maintenance, war, and so on. Thus, it is inappropriate for the Prophet Muhammad to grieve for those who are anti to the teachings of Islam that he brought, because Allah SWT will test them by creating beauty on this earth by creating various objects such as plants, animals and minerals. . Who among humans does good deeds, Allah will reward those who are the best for using the earth's ornaments according to God's instructions for humanity. But if they use the decorative objects of this earth to not follow His instructions, then Allah swt will make this earth flat and barren. Every human being will be rewarded for his disobedient deeds. With this verse the Prophet Muhammad was comforted. For the Prophet it was clear, the path taken by each group of people, both those who believe in the Qur'an and those who turn their backs on Him. Blessed are those who pass God's test and miserable those who fail. The Prophet's duty was only to convey the instructions of Allah. Whether humans believe in these instructions or turn away from Him, Allah determines it."
		   },
		   {
			"id": 2149,
			"surah": 18,
			"ayat": 9,
			"tafsir": "Allah explained that did the Prophet Muhammad think that the story of Ashhabul Kahf and the raqim (written stones) as mentioned in the old books are the most amazing signs of Allah's power. Indeed, if you look at it, the Ashabul Kahf event is contrary to natural law. However, when compared with the various occurrences in the plants, animals, and all the minerals that make up the ornaments on this earth, this incident is indeed amazing. The goal is to show the greatness and power of Allah. However, the Ashhabul Kahf event is not the only sign of Allah's power, but only a small part of the proof of His majesty. If the scholars of other religions were amazed and fascinated by this event, then the Prophet and his people should be even more fascinated by the various phenomena of the universe with all its wonders. The events of the heavens and the earth, the alternation of day and night, the circulation of the sun, moon, planets and stars or how Allah revives everything that has died are all evidences that show Allah's power. He does according to His will, no one rejects His decrees. Therefore, the Qur'an always invites people to investigate the secrets of this universe. According to the history of Israiliyat, Christians have made many mistakes. Their kings persecuted them to the point of worshiping idols, even forcing their people to worship them too. A king of them named Decianus issued strict orders to his people to worship these idols and to torture those who opposed them. Several youths from the nobility were forced to participate in worshiping the idols, even threatened with death if they dared to refuse the order. But they refused and persisted in their religion. Then Decianus stripped them of their clothes and jewels. Because he still loved the youths, the king let them live in the hope that they would follow his orders later. The king also went to other countries to force the people to worship idols and those who refused his orders were killed. The youths then went to a cave, which was located on a mountain called Tychayus, near their city, Aphasus. In the cave they worship worship God. If the king Decianus attacked and killed, then they died in obedience. Their number is seven people. On the way to the cave, they met a shepherd with a dog who followed them. In the cave that they diligently worship God. Among them was a person named Tamlikha. He was in charge of buying food and drink for his friends and broke the news that Decianus was still looking for them. After returning from his journey, the king immediately looked for worshipers of Allah to be killed, unless they wanted to worship idols. This news was heard by Tamlikha when she was shopping and then conveyed to her friends. They cry. Allah swt then closed their hearing so they fell asleep. Meanwhile, Decianus thought back to the youths above, then forced their parents to bring him over. The old men finally showed me the cave where they worshiped. Decianus immediately went there and closed the mouth of the cave so that they would die inside. In the royal staff, there are two men who still hide their faith, their names are Petrus and Runas. The story of the young men who believed in the cave was immortalized by writing on two pieces of stone which were then stored in a copper casket. The coffin was implanted into the building so that in the future it would become an example and warning for mankind. Time goes on, times change, king Decianus has been forgotten by people. A godly king also named Peter ruled the land for 68 years. During his reign, there was a conflict of opinion among the people about the Day of Judgment so that they were divided into two groups, namely those who believed and those who denied it. The king was very sad because of this problem. He prayed to God that He would show his people signs that would convince them that the end of the world would definitely come. Meanwhile, a goat herder named Ulyas intends to build a stable for his goats in the cave where the youths were. Then broke the lid that closed the cave door. Immediately, the believing youths awoke simultaneously from their sleep. They sat with beaming faces and then they prayed. They say to each other, \"How long did you sleep?\" Answered by another, \"A day or half a day.\" Another said, \"God knows best how long you sleep. Let one of you go into town with these silver coins and buy some good food and serve it to us.\" So Tamlikha set off, as she had always done, to shop in secret for fear of king Decianus. As he was walking, he heard people calling Isa al-Masih in all corners of the city. He thought to himself, \"How strange, why wasn't that believer killed by Decianus?\" He still wondered, \"Maybe I'm dreaming or this city is not my city before,\" he said to himself. Then he asked a man about the name of the city. The man replied, \"This is the city of Aphasus.\" At the end of the trip, he came to a man and gave him a coin to buy food. The man was shocked after seeing the coins because he had never seen one before. He flipped through the coins and then showed it to his friends. They were astonished and said, \"Is this money from a treasure you found hidden in the ground? This coin is from the time of king Decianus, an era that has passed for many centuries.\" Then Tamlikha was brought before two judges in the city. At first Tamlikha thought she would be taken to king Decianus so she wept. But after knowing the king had changed, his sadness disappeared. The two magistrates of the city, Areus and Tanteus, asked Tamlikha, \"Where is that hidden treasure you found, young man?\" After a conversation took place between them, Tamlikha told the story of the youths and king Decianus, and he invited the two judges to go to the cave to prove the truth of his story. Then the two of them went with Tamlikha, up to the door of the cave, and they heard all the stories about the inhabitants of the cave from Tamlikha. The two judges were amazed to learn that they had slept in that cave for 309 years. They are awakened from sleep to be a sign of God's power to mankind. Then Areus entered and saw a chest of copper, sealed with a seal. Inside there are two inscribed stones that tell the story of the young man, since they fled from the kingdom of Decianus in order to maintain their faith and religion, until then Decianus closed the cave door with a stone. After Areus and his friends read this story, they gave thanks and immediately prostrated themselves to God and they immediately sent messengers to king Peter to come quickly to witness the sign of God's power in the youths who were resurrected after 300 years of sleep. The king then departed with his entourage of bodyguards and residents of his country to the country of Aphasus. Today is the day of decision making regarding the day of resurrection, a memorable day. When the king saw the youths, he immediately prostrated himself to Allah, embraced the youths, and wept. The youths continued to praise God. They said to the king, \"O king, goodbye, may Allah protect you from the evil of men and jinn.\" Then they returned to the bed and at that time Allah swt removed his spirit. To pay homage to the souls of these servants of the holy God, the king ordered that each of them be made a coffin of gold. But at night the king saw them in a dream, and said to him: \"Let us be as we are in this cave, we sleep on the ground until the Day of Judgment comes.\" Therefore, the king ordered that the bodies be spread out in a wooden coffin and forbade everyone to enter the cave. The king also ordered that a place of worship was built at the door of the cave, and the day he died was made a big day. Christians make this story as proof of God's power to show the existence of the Day of Judgment. But the Qur'an makes it clear that the signs of Allah's power to institute the day of resurrection and return the spirit to its body after death are not limited to that story. The verses that show His power to indicate the existence of the Day of Judgment are countless. Therefore, pay attention to this universe with everything in it."
		   },
		   {
			"id": 2150,
			"surah": 18,
			"ayat": 10,
			"tafsir": "In this verse, Allah swt begins to describe the story of Ashhabul Kahf to Rasulullah saw. Allah swt reminded His Messenger that when long ago some youths of noble descent in a country, fearing persecution from their king, went to seek refuge in a cave on a mountain. It was in this cave that they made up their mind to spend their youth serving Allah SWT. They pray to Allah to be blessed with mercy from His side. They expect forgiveness, peace, and sustenance from Allah as a great gift for them. Apart from that, they also ask Allah to make it easy for them to follow the right path to avoid the temptations and tyranny of the disbelievers and gain fortitude in obeying God so as to achieve happiness in this world and the hereafter. Indeed Allah has helped them. When the infidel king managed to find their tracks at the door of the cave, then entered it, Allah closed their eyes so they could not see the youths. Therefore, finally the king decided to close the cave door with the expectation that they would die of hunger and thirst."
		   },
		   {
			"id": 2151,
			"surah": 18,
			"ayat": 11,
			"tafsir": "Allah granted the prayers of the youths by covering their sight and hearing, until they fell into a deep sleep and no sound would wake them from sleeping in the cave for hundreds of years. God's grace is very great given to them. It's not easy for someone to sleep, when his soul is restless and afraid. By sleeping, a person gets peace of mind. In this verse it is said to \"cover the ears\" because the ear is where the sound enters which causes a person to wake up from sleep. A person can be said to be sleeping, when his ears do not hear anything anymore."
		   },
		   {
			"id": 2152,
			"surah": 18,
			"ayat": 12,
			"tafsir": "This verse explains that after the youths had slept in the cave for 300 years, Allah then woke them up. Their hearing was restored by Allah swt. When a goatherd pounded on the stone wall that closed the mouth of the cave, the sound of the ruins woke them up from their long sleep. This verse tells us that Allah knows which of the two disputing factions can accurately calculate how long they lived in the cave. But eventually they realized that they didn't know exactly how long the youths had lived in the cave. Then they admit that it is Allah who takes care of their bodies so that they are not destroyed, and are increasingly convinced of the perfection of Allah's power and His knowledge. Therefore, with the events that are experienced, they can reflect on the matter of the Day of Judgment. For the believers at that time, this event strengthened their faith, while for the disbelievers it became a clear proof of Allah's power. Commentators differ in explaining the meaning of the word \"two groups\" in this verse. Some say that what is meant by the two groups is that the first group are the youths who live in the cave, and the second group are the townspeople who know the history of the disappearance of the youths. Another opinion says that the two groups that disagreed were the youths who lived in the cave and the kings who ruled successively in the land of Aphasus. Opinions that are closer to the truth are those who argue that the two groups are the youths who live in the cave itself. After waking up from sleep, they asked each other questions. Some said, \"We stay in this cave for a day or half a day.\" Others said, \"Your Lord knows better how long you lived in this cave.\""
		   },
		   {
			"id": 2153,
			"surah": 18,
			"ayat": 13,
			"tafsir": "In this verse, Allah begins to describe the story of Ashhabul Kahf, which in the previous verses has been delivered globally. Allah told Rasulullah saw that the story that was conveyed contained the truth. Its meaning is told according to events, not as known by the Arabs. They already know the story of the youths of this cave, but in a different form. Umayyah bin Abi Salt, an Arab poet from the early days of Islam from the Umayyads (d. 9 H), once mentioned this cave in a verse, which shows that the Arabs were familiar with this story. The verse reads: There is nothing there except ar-Raqim (inscribed stone) who is near him and his dog. While the people were sleeping in the cave. Then Allah explained that in fact the inhabitants of the cave were young men who believed in Allah Almighty with full confidence. Even though their people adhere to the shirk religion, they can defend their faith from the influence of polytheism. Indeed, young people generally have an easy nature to accept the truth, they are quicker to receive guidance to the right path compared to old people who are already immersed in false teachings. Therefore, in history, especially the history of the development of Islam, it was the youth who first received the teachings of Allah and His Messenger. As for parents, like Quraysh figures, who still defend wrong religious teachings, very few of them accept Islamic teachings."
		   },
		   {
			"id": 2154,
			"surah": 18,
			"ayat": 14,
			"tafsir": "In this verse it is explained that Allah swt strengthened the hearts of the youths with the power of faith, made their determination to believe in the monotheistic religion, and gave them the courage to speak the truth of that religion before the disbelieving and arbitrary king Decianus. When the king taunted them and forced them to worship idols, they loudly said, \"Our God is the God who created the heavens and the earth, we never call on any god but Him.\" In their statement, there are two confessions about God's power. First, their acknowledgment of the oneness of God in sustaining and creating this universe. Second, their acknowledgment of the oneness of God and His right to be worshiped by creatures. The polytheists acknowledge the oneness of God in creating and sustaining this universe, as explained by Allah in His word: And if you ask them, \"Who created the heavens and the earth and subjected the sun and the moon?\" Surely they will answer, \"Allah.\" So why can they be turned away (from the truth). (al-'Ankabut\/29: 61) However, polytheists do not recognize the oneness of God and His right to be worshiped by His servants. They worship idols as God's partners who will bring them closer to Him, as explained in the word of Allah SWT: ¦We do not worship them but (hope) that they draw us closer to Allah as closely as possible.\" (az-Zumar\/39: 3 ) After the youths declared their acknowledgment of the oneness of God, they gave reasons for rejecting the worship of idols as desired by King Decianus. They stated that if they worshiped and prayed to other than Allah, that would mean doing something far from the truth."
		   },
		   {
			"id": 2155,
			"surah": 18,
			"ayat": 15,
			"tafsir": "In this verse, Allah swt recounts the conversation between the youths. They say that his people under Decianus' rule, though older and more experienced, associate partners with God without using reason. Why don't they come up with good reasons, or hard and clear evidence to substantiate the truths they say and believe. The youths stated that their people should do as they did, namely to show evidence of the truth of the religion they professed. The youths also stated that there is no greater injustice than the injustice of a person who lies against Allah, such as saying that God has partners. Their people have equated the dignity of idols with the high dignity of God, but they cannot give the right reasons, even though religion should be based on beliefs or right reasons. They made up names for God's title by only following their desires. Word of Allah swt: Those are nothing but names that you and your ancestors made up; Allah did not send down any information to (worship) Him. They just follow conjecture, and what the will wants. In fact, guidance has come from their Lord. (an-Najm\/53: 23) The names given to the partners of Allah are various such as al-Lata, al-Manat, al-Uzza, namely names for idols given by people Arab Jahiliyah."
		   },
		   {
			"id": 2156,
			"surah": 18,
			"ayat": 16,
			"tafsir": "In this verse it is explained that the conversation between them continued, some of them said to others, \"When you distance yourself from your people and your homeland physically and mentally, refuse to follow their customs, and do not want to worship other than Allah, so cause their anger against you, then you should seek shelter like a cave.\" \"In that place you can worship diligently and fervently and avoid the disturbances of your people. When you have completely submitted yourself to Allah, and asked for His care, then He will certainly pour out His grace on you. You will not die of hunger or thirst in that cave. Allah swt will provide a way out for you in overcoming difficulties in eating and drinking or other things. Allah will widen the way of perfect worship to Him so that you can feel the delicacy of worship that exceeds other delicacy.\" Thus the contents of their conversation. What they said was born out of their belief and hope in God's grace and thanks to their complete submission and faith in Him. Allah swt has moved the hearts of the youths to become pious people, cave dwellers. Their story is finally always remembered in the history of religious people. Such is the nature of these youths, forever their hearts are purer and love the truth more, which is a very good quality that is needed for a leader. Ibn 'Abbas said: \r Allah does not send a prophet unless he is a young man, and knowledge is not given to a pious person, unless he is a young man. Then he read the verses as follows: They (the others) said, \"We heard there was a young man who denounced (these idols), his name was Ibrahim.\" (al-Anbiya\/21: 60) And the word of Allah swt: And (remember) when Musa said to his helpers. (al-Kahf\/18: 60) And the word of Allah swt: Verily they are youths who believe in their Lord, and We add guidance to them. (al-Kahf\/18: 13) This verse shows the fortitude of the youth of Ashhabul Kahf when he was alone in a cave because he hid his religion. Al-Gazali, in his book Ihya' 'Ulumuddin, refuses to use this verse as an argument for the primacy of uzlah life. He said, \"Ashhabul Kahf do not alienate themselves from one another. They are all believers. They alienate themselves from unbelievers.\" So it is only natural that they use uzlah so that they are protected from the torture of the infidels and the king who wants to kill them. Living in solitude in the sense of isolating oneself from evil and evil that cannot be repaired or they are unable to fix it, then this kind of uzlah is justified. As-Suyuti in his book Al-Iklil argues that from this verse it can be understood that uzlah, isolating oneself, running away from tyranny, and living in a cave are prescribed when the religious situation is not conducive or damaged. His opinion needs explanation because it is still vague. Which era is clean from corruption? In fact, what can be understood from this verse is that the young people exiled themselves because of the rape of the right to religious life. Live uzlah because of frustration and despair in facing the reality of life is not justified by religion. In order to understand this verse, one must pay attention to the atmosphere at the time when the young man's uzlah incident took place. They escape by escaping into the cave to be killed by the arbitrary king. The atmosphere at that time was also not conducive to fighting against the king's arbitrariness, and showing their faith. In the early days of Islam, the Prophet ordered his companions to migrate to the country of Habsyah, then to Medina, and he himself also migrated there because of the ferocity of the Quraysh polytheists, while the Muslims could not do anything about it, because they were still weak. In fact, for the Holy Prophet in particular, they had prepared to kill him. They surrounded the Prophet's house at night to carry out the assassination plan. Because the polytheists had conspired to kill the Prophet, Allah ordered the Prophet to migrate. On the basis of that order, the Prophet migrated. So, not for running away from the battlefield, being alone or uzlah, and so on. Living uzlah in the sense of isolating oneself from the luxury of life and slavery to wealth and passions, then living a simple life in the midst of society, as shown by the companions of the Prophet Abu dzar Al-Gifari, is not reprehensible, even justified by the Islamic religion. Ibn Kathir said, \"Abu Dharr is of the opinion that it is not proper for a Muslim to have more wealth than his daily food supply, or from something that he uses for war, or from something that is provided for guests. He adheres to the dhahir verse: And the people who keep gold and silver and do not spend it in the way of Allah, then give them good news, (that they will receive) a painful punishment.(at-Taubah\/9: 34) Abu dzar lives in simplicity because he does not want to be involved in a luxurious life which began to spread at the time of the caliph Usman ra."
		   },
		   {
			"id": 2157,
			"surah": 18,
			"ayat": 17,
			"tafsir": "After the youths talked about their people and themselves, they decided to uzlah into a cave on a mountain which they agreed to. In this verse, Allah explains the condition of their place of refuge. The cave door faces north. In the morning the sun rises from the east and in the afternoon the sun leans west across the cave door. Thus, the sunlight only directly hits the cave door from the left and right. The cave dwellers themselves were not exposed to sunlight even though they were in a large area. The cave room gets sunlight that refracts from the mouth of the cave. So the room is not dark and always gets cool air. Regarding where the location of this cave, experts differ opinion. Some say that the cave is in the area near Aela (Jerusalem) in Palestine. Ibn Ishak said in Nainawa, which is an old town in the Mousul area. Some say in the land of Rome. In the above statement it is stated that these stories took place in the city of Ephesus, based on narrations from the Arabs. However, until now there is no strong evidence of where the cave actually is. If there are benefits, of course Rasulullah saw will tell us where that place is. Those are the signs of Allah's power shown to His believing servants. All the events that were experienced by the youths, since they received guidance to the path of monotheism, became enemies with their people and their families without regard to personal interests, even though they were still young, then they chose a healthy cave to live in, then they woke up again after 300 years of being asleep in the cave, showing the signs of God's power in this world. But all these signs can only be lived by those who have been given the taufik by Allah SWT to receive guidance to the path of truth like the youths who live in the cave. They are the ones who receive guidance and correctly choose the path of truth, so that they are happy in worldly and spiritual life. They have achieved and experienced all the grace and help of Allah SWT that they had always hoped for. Unlike the case with them are people who do not get a clue. They are people who go astray because they chose the wrong path to take. The inclination to worldly desires causes them to be wrong in choosing the path of truth. They fall into misguided paths that do not bring happiness. Allah led them astray because that was the case. It is very difficult for them to find a guide who returns them to the straight path and frees them from going astray, because faith and disbelief lie in the will of Allah. He gives taufik to His servants whom He wills and let those whom He wills go astray."
		   },
		   {
			"id": 2158,
			"surah": 18,
			"ayat": 18,
			"tafsir": "After finding a safe place in the cave, they worshiped diligently in it until God closed their ears, so they fell asleep. In this verse, Allah SWT explains their condition while sleeping. They seem to be awake, but in fact they are sleeping. Ibn Kathir said, \"Some scientists explain that when Allah covered their hearing by putting them to sleep, their eyes were not closed tightly so that air could enter. Because their eyes were open, they were thought to be awake; it was as if they saw who was standing next to them. in front of them. Even though they are really asleep, it is different from normal human sleep. Generally, during normal sleep there are signs of rest from the organs of the body, especially in the eyes and face. The sleep of the cave dwellers deviates from the prevailing sunatullah , because the Creator of Nature wants to show His power and sovereignty over this universe to human beings who are unfaithful. Even though they are sleeping, they are moved by Allah by turning them left and right, as is usually the case with living people who are sleeping. However, that does not detract from the extraordinaryness of the sleep events themselves.In turn they cannot be equated with berba like someone who sleeps normally so that the body is maintained. Allah Almighty takes care of their bodies, even though they do not turn left and right. Allah moved them at certain times to indicate the presence of life and to distinguish them from statues or mummies which are inanimate objects. Even if they turned left and right once a year, it was enough to show a tremendous miracle for the people who witnessed because they slept for more than three hundred years. Opinions of commentators vary in this regard. Some say once every six months they turn around, some say once a year on the day of Ashura, some say nine years, and so on. The time calculation is not important to know. Their pet dog is in a state of stretching with both front legs near the cave door. The atmosphere in the cave was very scary. Anyone who wants to enter will see the situation, they will naturally be afraid, and run away. No one dared to enter the cave. According to Ibn Kathir, God created a spooky and frightening atmosphere in the cave, so that no one would approach and touch them until later the conditions set by Allah swt came. Because, that event contains great wisdom, and a strong reason that God's promise is true and the Day of Judgment will surely come."
		   },
		   {
			"id": 2159,
			"surah": 18,
			"ayat": 19,
			"tafsir": "In this verse, Allah SWT explains about the youths of Ashhabul Kahf when they wake up from sleep. Their condition, whether body, skin, hair, or anything else, is still the same as before they went to bed. All of them are healthy and all are intact, even the clothes attached to their bodies are intact. Allah swt shows them His majesty, greatness, and power, as well as the wonders and extraordinary deeds of His towards His creatures. Because of this, their faith grew stronger to break away from the worship of gods, and their hearts became more sincere to worship only God Almighty. After waking up from a long sleep, they asked each other to find out how they were. One of them said to his friends, \"How long have you been in this cave?\" He confessed his ignorance of his own state of sleep, then asked the others to provide information. His friends replied, \"We stay in this cave a day or half a day.\" Even those who answered could not tell how long they had stayed, a day or half a day, for the effects of sleep had not yet left their souls. They had seen no sign of how long they had been in the cave. Most commentators say that when they first entered the cave it was in the morning, then when God woke them from sleep it was in the afternoon. That's why the person answering this thought they were in the cave for a day or half. Then his other friends said, \"Your God knows better how long you have lived here.\" This last young man's words are very wise to refute the statements and answers of his former friends. The statement seems to be inspired by Allah swt, or based on real evidence. In fact, that long period can only be known and determined with certainty by Allah SWT. They finally realized the limitations of their ability to know the unseen. After realizing, then their attention turns to basic needs, namely eating and drinking. One of them was ordered to go into town with silver coins to buy food. According to history his name is Tamlikha. Before buying, he is asked to pay attention to the food, which is halal and which is haram, and which is good and which is not good. Halal and good food is what is brought back to their sanctuary. Tamlikha was asked to be careful on the way, both when entering the city and returning from the city, lest he tell anyone about their condition and where they were hiding. From the snippet of the verse \"fab'atsu ahadakum biwariqikum hadzih(i)\", which means \"(then order) one of you to go to the city with your silver money\", there is a legal term related to wakalah (representative). That is, a person is allowed to hand over to another person, in exchange for himself, matters of property and rights during his lifetime. Ibn al-'Arabi is of the opinion that this verse is the strongest basis for wakalah (representation)."
		   },
		   {
			"id": 2160,
			"surah": 18,
			"ayat": 20,
			"tafsir": "Then the cave dwellers warned Tamlikha that if the townspeople, who he thought were still unbelievers, found out where they were hiding, they would certainly be forced to follow the religion of idols. If they refused, of course they would be killed by throwing stones, the way of killing in the past for those who dared to oppose the king's political policies or state religion. The city to be visited is the city of Ephesus and its king, they think, is still the tyrannical Decianus. Even though the king was no longer there because he ruled three centuries ago. If they are forced to return to embrace the Decianus religion, they will never gain happiness and luck forever, either in worldly life or in the hereafter. The soul of a person who adheres to a religion out of compulsion, at first, will reject all the provisions of that religion. However, over time it is likely that his soul will not reject and continue to look favorably at his new religion. If such a thing happened, he would be lost and miserable forever. However, if someone is forced by threats to convert to disbelief, then he shows disbelief, but his heart is still Muslim, and until the end of his life he never looks at the religion that was forced upon him, then he is still in Islam."
		   },
		   {
			"id": 2161,
			"surah": 18,
			"ayat": 21,
			"tafsir": "In this verse, their next condition is explained. After Tamlikha went into town to shop with silver coins from her friends, she saw the atmosphere of the city of Ephesus which was much different from what she expected. When he came to the city, he found that his people had faith in God Almighty. However, among its people there are full faith in the events of the Day of Judgment, and there are those who still have doubts. There are those who say the doomsday is with the spirit alone, there are also those who say the doomsday is with the spirit and the body. Just as Allah raised Ashhabul Kahf from his sleep, so that they would ask each other about themselves, so that their faith would grow perfect, so God brought together the residents of the city with Ashhabul Kahf, when they disagreed about the issue of the Day of Resurrection. With the Ashabul Kahf event, their disputes will disappear and their faith in God's power will be perfect. They believe that the Day of Judgment will really happen and humans will be resurrected from their graves with their bodies and spirits, like the resurrection of Ashhabul Kahf. According to Israiliyat's history, the beginning of their meeting with Tamlikha occurred when he took out his silver money to pay for the food he bought. On the silver coins there is a picture of the king Decianus. The grocer became astonished and shocked. He then brought the coins to the officials in the city, Tamlikha was asked and examined. The end of the examination was Tamlikha's confession about who he was and showing the cave where they were hiding. This incident caused an uproar in the community. The people and the king witnessed extraordinary events that led them to believe in the resurrection day. Those who previously doubted the Day of Judgment, with their testimony of this event, turned into believers with perfect faith that Allah swt has the power to revive the dead, and restore their bodies to their original shape when the spirit leaves the body. So in this verse, Allah swt states that Ashhabul Kahf met with the residents of the city of Ephesus so that they know for sure that Allah's promise is true and the coming of the Day of Judgment (the day of resurrection) is not in doubt. After the meeting between the king and community leaders with Ashhabul Kahf ended, Ashhabul Kahf returned to his bed. At that time, Allah swt removed their spirits to be raised to His side. Then the king and the community leaders held a deliberation. Some of them said to the others, \"Build a large building as a memorial near the mouth of the cave.\" The powerful man among them said, \"We will actually build a place of worship near the mouth of their cave.\" Both parties want to glorify Ashhabul Kahf, but they differ on how to do it. One party wants to build a large building, while the other party wants to build a mosque as a place of worship for them. As to whether the people of Ephesus erected a building as a memorial or they built a mosque as a place of worship over the cave, only Allah knows. Building a mosque near a grave is not prohibited by religion. But religion strictly prohibits making graves as places of worship, as the words of the Prophet Muhammad said: Allah curses the Jews and Christians who make their Prophet's grave a place of worship.\" (Al-Bukhari history from 'aisyah and 'Abdullah bin 'Abbas) Islam strictly prohibits its followers make the grave as a place of worship to honor the people who are buried. Even some scholars, such as Ibn Hajar in his book az-Zawajir view this act as a grave sin, based on the hadiths mentioned.In history it is proven that the tombs of the prophets or saints were built in places of worship tend to bring people to excessive respect for the grave.This opens the opportunity for shirk to occur."
		   },
		   {
			"id": 2162,
			"surah": 18,
			"ayat": 22,
			"tafsir": "In this verse, Allah swt explains the disagreement that occurred at the time of Rasulullah saw regarding this story. The Christians from the Malkaniyah sect said, \"There are three of them, the fourth is the dog.\" The Christians from the Ya'qubiyah sect argue, \"They number five and the sixth is the dog.\" While the Nasthuriyah group said, \"They are seven people and the eighth is the dog.\" In this case Allah said that they say three or five people are only estimates, and are not accompanied by knowledge, like throwing stones at night to a target that is not visible to the eye. But Allah does not reveal those who say seven people as an uncertain estimate. Therefore, according to Ibn 'Abbas, the opinion that says that their number is seven people and the eighth is the dog is the correct one. Because Allah swt stated the two previous opinions as uncertain estimates, but did not say the same thing for the third opinion. This shows that the third saying is true and also shows that it is based on knowledge, faith, and mental stability. Regarding the names of the seven of them, which have various pronunciations, according to al-hafidh Ibn Hajar in the Book of Chronicles by Bukhari, nothing can be used as a reference, because they are not Arabic names. In Tafsir Ibn Kathir their names are mentioned as follows: Maksalmina (the oldest), Tamlikha (the second), Marthunus, Birunus, Dominus, Yathbunus, Falyastathyunus, and the name of the dog Hamran or Qitmir. These names are taken from the People of the Book, so the truth is still in doubt. Only Allah knows better. Then Allah swt ordered His Messenger to convey to those who were in dispute about how many youths were in the cave that Allah swt knew better about their number. There is no need to talk about such things without knowledge, it is better to leave it to Allah. If Allah had told His Messenger about it, surely he would have conveyed it to his people if it was beneficial for their lives in this world and the hereafter. If it wasn't mentioned, there shouldn't be any need to waste energy thinking about it. But later, Allah confirmed \"no one knows their number except a few\". Here Allah hinted at the existence of a handful of people who were given knowledge by Allah to know the real situation about the inhabitants of the cave. Who are the few? Ibn 'Abbas, a friend who was young in his time and was regarded as a scientific figure in all fields, said that he was among the few. Historians, archaeologists, may be included in that small group if they, through their research activities, obtain historical facts about past peoples. However, the most important thing for Muslims from this verse is not to seek information about the number of these young men, but how to take inspiration and lessons from this event, which are beneficial for building faith and piety to Allah SWT. After Allah mentioned this story, Allah forbade the Prophet two things: First, it is not permissible to argue about Ashhabul Kahf to the People of the Book. The Prophet was forbidden to argue about it except in a gentle way, without determining the number of Ashhabul Kahf, and not making a fool of them because it was not beneficial. The main purpose of this story is to believe that the resurrection day will definitely happen. In another surahh with the same intention Allah says: And do not argue with the People of the Book, but in a good way, except with those who are unjust among them. (al-'Ankabut\/29: 46) The second prohibition, Allah swt ordered the Prophet not to ask the Christians about the youths because they also had no basic knowledge about it. They only estimate it and without strong arguments."
		   },
		   {
			"id": 2163,
			"surah": 18,
			"ayat": 23,
			"tafsir": "When the polytheists asked three questions to the Prophet Muhammad, on the advice of the Jewish priests in Medina, namely regarding Ashhabul Kahf, dzul Qarnain, and spirits, he said, \"Tomorrow morning I will answer what you asked.\" He did not mention in his speech the words insha Allah. Before ending the story of Ashhabul Kahf, in this verse, Allah swt reminded His Apostle so that he would not make a promise or a statement for a job with certainty by saying, \"Tomorrow morning I will do it.\" He should have known that no one knew for sure what would happen the next morning. Allah's Word: And no one can know (with certainty) what he will do tomorrow. (Luqman\/31: 34) What he promised to the polytheists turned out to be fulfilled fifteen days later, namely after the revelation to answer the questions was revealed."
		   },
		   {
			"id": 2164,
			"surah": 18,
			"ayat": 24,
			"tafsir": "In this verse, Allah swt explained that the Prophet's answer to the question of the polytheists of Mecca should be accompanied by the words \"insha Allah\" which means \"if Allah permits\". Because there is a possibility that someone will die before tomorrow comes and maybe there is an obstacle, so that he cannot do what he said. If he accompanies it with the word insya Allah, surely he will not be considered a liar in his promise. If someone forgets to say the words God willing in his promise, let him say the sentence when he remembers at any time. For example, the Prophet once said the word insya Allah after he remembered. As narrated by Abu Dawud that he said, \"By Allah, he will surely fight the Quraysh,\" then he was silent and said, \"Insya Allah .....\" Allah swt then told His Messenger to expect very much from Him so that Allah will guide him to a path that is closer to goodness and stronger to be used as an excuse for religious truth. Allah swt has fulfilled the hope of the Prophet saw by bringing down the stories of the prophets and their respective people at all times. From the stories of the prophets and their people, Muslims get lessons that are very useful for their lives in this world and the hereafter."
		   },
		   {
			"id": 2165,
			"surah": 18,
			"ayat": 25,
			"tafsir": "Allah then explained about how long Ashhabul Kahf stayed in the cave after their ears were closed. They slept in the cave for three hundred years according to the calculation of the scribes based on the solar year (syamsiah) or three hundred years plus nine years according to the calculation of the Arabs based on the lunar year (qamariah). Allah's explanation of how long Ashhabul Kahf slept in the cave was a miracle for the Prophet Muhammad. He did not study astronomy but knew the nine year calculation difference between the calculations with the solar system for 300 years and the lunar year calculation system. Every 100 solar years, three years are different from the lunar year. Every thirty solar years, the difference is one year from the lunar year and every one solar year is eleven days from the lunar year. The above knowledge certainly comes from God. Allah is also the one who diverts human attention to the beauty that is found on the surface of the earth, such as the sun, moonlight, and all the beauty that is caused by the sunlight. The change of seasons gives rise to various beauties, and the change of the seasons itself is due to the changing position of the sun. In the same way, plants and animals, which vary in their life, depend on the sunlight they cast on the earth. The Prophet Muhammad was sent to mankind to explain that studying all the beauty that exists on this earth is closer to the truth and oneness of Allah. The creation of this universe is more complicated than the creation of man himself. Allah says: Indeed, the creation of the heavens and the earth is greater than the creation of man, but most people do not know. (Gafir\/40: 57)"
		   },
		   {
			"id": 2166,
			"surah": 18,
			"ayat": 26,
			"tafsir": "In this verse, Allah SWT orders Rasulullah SAW to tell those who are still in dispute about how long Ashhabul Kahf slept in the cave, that God knows better how long they slept in the cave. What Allah has explained must be true, there is no doubt about it. The scribes differed about the length of time they slept just as they differed over the amount. Only Allah knows how long they sleep, because He is the All-Knowing and has knowledge of all that is unseen, both on earth and in the sky. He is the Knower of all hidden human affairs, and nothing is hidden from Him. Therefore, humans no longer need to talk about how long the occupants of the cave slept in their place, but leave it to Allah, because He is the one who knows unseen things, let alone real things. How bright is God's vision of everything that happens in this universe, and how sharp is His hearing of all kinds of voices and sounds from His creatures. No one can be a protector for the inhabitants of the cave besides Allah. He is the one who maintains and takes care of all their affairs in the best way. And He does not partner with anyone in making decisions."
		   },
		   {
			"id": 2167,
			"surah": 18,
			"ayat": 27,
			"tafsir": "In this verse, Allah SWT commands His Messenger to read the Qur'an that was revealed to him, practice its contents, convey it to mankind, and follow the commands and prohibitions contained in it. The task of the Messenger of Allah is to convey Allah's revelation to mankind, as explained in His words: O Messenger! Convey what your Lord has revealed to you. If you don't do (what was ordered) it means you are not conveying His message. And Allah keeps you from (disturbing) humans. Indeed, Allah does not guide the disbelievers. (al-Ma'idah\/5: 67) The Messenger of Allah did not need to care about the words of those who wanted the verses of the Qur'an to be brought according to their interests. They said, \"Bring another verse of the Qur'an instead of this or replace it with something else.\" In fact, no one can replace or change the sentences of the Qur'an, whether it is commands or prohibitions, whether it is threats against those who commit disobedience or Allah's promises to those who are obedient and do good. Only Allah Almighty changes or replaces the sentence based on His wisdom. Word of Allah swt: Allah erases and determines what He wills. And with Him is the Ummul of the Book (Lauh Mahfudh). (ar-Ra'd\/13: 39) Substitution of verses by Allah in the Qur'an is intended to achieve a greater purpose, as He says: And when We replace a verse with another verse, and Allah knows best what He sent down¦. (an-Nahl\/16: 101) All provisions or laws that have been ordained by Allah must be obeyed. If not, surely there will be a punishment given by Allah in accordance with what has previously been threatened to those who violate the lines set by Him. No one can be a protector, except Allah swt because His power covers His creatures. No one can escape the punishment that He has ordained."
		   },
		   {
			"id": 2168,
			"surah": 18,
			"ayat": 28,
			"tafsir": "It is narrated that 'Uyainah bin Hishn al-Fazary came to Prophet Muhammad peace be upon him before he converted to Islam. At that time several of the Prophet's friends who were indigent were beside him, including Salman al-Farisi who was covered in a robe and his body was sweating, because he was plaiting date palm leaves. 'Uyainah said to the Messenger of Allah, \"Does their smell (poor friends) not bother you? We are noble leaders of the Mudar tribe. If we convert to Islam, then all the Mudar tribes will convert to Islam. Nothing prevents us from following you. , except for their presence. Therefore, keep them away so that we follow you or hold a separate assembly for them, and we have a separate assembly as well.\" Then came down this verse. In this verse, Allah swt commands His Messenger to be patient and able to refrain from sitting with some of his friends who are diligent in worship all day long because they only hope to please Allah swt. The friends live in simplicity away from worldly pleasures. They include: Ammar bin Yasir, Bilal, Shuhaib, Ibn Mas'ud, and other friends. In another surahh, Allah says: Do not expel those who call on their Lord in the morning and evening, they hope for His pleasure. You do not bear the slightest responsibility for their actions and they do not bear the slightest responsibility for your actions, which causes you (have the right) to expel them, so you are among the wrongdoers. (al-An'am\/6: 52) The attitude of the polytheists towards the indigent companions of the Prophet was the same as the attitude of the Nuh people towards the followers of Prophet Noah as said by Allah SWT: They said, \"Should we believe in you, whereas your followers are despicable people?\" (asy-Syu'ara'\/26: 111) The Messenger of Allah should have paid no heed to the attitude of the disbelievers. Allah swt warned him not to leave and belittle his friends who are poor, because they are only driven by worldly interests or because there is hope for the faith of people who are rich from polytheists. These friends are people who sincerely choose a simple way of life and are willing to leave all worldly delights solely to seek the pleasure of Allah. Rasulullah SAW thanked Allah for their presence in the midst of his people. He said: Praise be to Allah who has presented among my people a person whom I was commanded to endure patiently with him. (History of Ibn Jarir ath-thabari, Ath-thabrani, and Ibn Mardawaih) Thus, looking down on and belittling people who live in poverty and poverty is not justified by the Islamic religion, especially if they are people of worship and piety. Allah strictly forbade Muhammad SAW to comply with the wishes of the leaders of the polytheists to get rid of poor people from his assembly. People who make requests like that are people who have closed their souls to return to God, and have bad character. Their transgressive actions, ungodliness, and disobedience add to the darkness of their hearts, so that they end up wallowing in sin. (29) In this verse, Allah swt commands His Messenger to confirm to the disbelievers that the truth conveyed to them comes from Allah, the Lord of the worlds. Their duty is to follow the truth and put it into practice. The benefits of that truth, of course, return to those who practice it. Vice versa, the bad consequences of denying the truth return to those who deny it. Therefore, whoever wants to believe in Him and join the ranks of those who believe, should act immediately without putting forward conditions and reasons that are made up like the polytheists who look down on those who poor believers. Likewise for those who deny and belittle the truth. Rasulullah SAW will not get any loss because of that denial, just as he will not gain anything if they believe. Allah swt said: If you do good (it means) you do good for yourself. And if you do evil, then (the loss of evil) is for yourself. (al-Isra'\/17: 7) But if humans choose disbelief and give up faith, it means they have committed tyranny, namely putting something out of place. Therefore, Allah gives them a strong threat, which is to throw them into hell. They will not escape from that hell, because the raging fires of hell surround them from all sides, so that they are like people who are closed in a cage. When in hell they ask each other for a drink out of thirst, they will be given water as hot as boiling iron which will scorch their faces. The water they drink is really very bad. There is no way such hot drinking water can refresh the throat, and quench the thirst of people who are hot, on the contrary, destroy them. The hell they live in is the worst place and full of torment."
		   },
		   {
			"id": 2169,
			"surah": 18,
			"ayat": 29,
			"tafsir": "It is narrated that 'Uyainah bin Hishn al-Fazary came to Prophet Muhammad peace be upon him before he converted to Islam. At that time several of the Prophet's friends who were indigent were beside him, including Salman al-Farisi who was covered in a robe and his body was sweating, because he was plaiting date palm leaves. 'Uyainah said to the Messenger of Allah, \"Does their smell (poor friends) not bother you? We are noble leaders of the Mudar tribe. If we convert to Islam, then all the Mudar tribes will convert to Islam. Nothing prevents us from following you. , except for their presence. Therefore, keep them away so that we follow you or hold a separate assembly for them, and we have a separate assembly as well.\" Then came down this verse. In this verse, Allah swt commands His Messenger to be patient and able to refrain from sitting with some of his friends who are diligent in worship all day long because they only hope to please Allah swt. The friends live in simplicity away from worldly pleasures. They include: Ammar bin Yasir, Bilal, Shuhaib, Ibn Mas'ud, and other friends. In another surahh, Allah says: Do not expel those who call on their Lord in the morning and evening, they hope for His pleasure. You do not bear the slightest responsibility for their actions and they do not bear the slightest responsibility for your actions, which causes you (have the right) to expel them, so you are among the wrongdoers. (al-An'am\/6: 52) The attitude of the polytheists towards the indigent companions of the Prophet was the same as the attitude of the Nuh people towards the followers of Prophet Noah as said by Allah SWT: They said, \"Should we believe in you, whereas your followers are despicable people?” (asy-Syu'ara'\/26: 111) The Messenger of Allah should have paid no heed to the attitude of the disbelievers. Allah swt warned him not to leave and belittle his friends who are poor, because they are only driven by worldly interests or because there is hope for the faith of people who are rich from polytheists. These friends are people who sincerely choose a simple way of life and are willing to leave all worldly delights solely to seek the pleasure of Allah. Rasulullah SAW thanked Allah for their presence in the midst of his people. He said: Praise be to Allah who has presented among my people a person whom I was commanded to endure patiently with him. (History of Ibn Jarir ath-thabari, Ath-thabrani, and Ibn Mardawaih) Thus, looking down on and belittling people who live in poverty and poverty is not justified by the Islamic religion, especially if they are people of worship and piety. Allah strictly forbade Muhammad SAW to comply with the wishes of the leaders of the polytheists to get rid of poor people from his assembly. People who make requests like that are people who have closed their souls to return to God, and have bad character. Their transgressive actions, ungodliness, and disobedience add to the darkness of their hearts, so that they end up wallowing in sin."
		   },
		   {
			"id": 2170,
			"surah": 18,
			"ayat": 30,
			"tafsir": "In this verse, Allah explains the reward for those who believe in the Qur'an and practice all the commands of Allah and the Messenger to the best of their ability, that is, they will be given a great reward. Allah will not waste the reward of the good deeds they have done, nor will they reduce their rights in the least. Many of Allah's promises in the Qur'an to believers include that when they do good deeds, Allah will not waste them even a little. Every good deed, even if it is only the size of a mustard seed, is certainly rewarded by Allah SWT, as He says: So whoever does an atom's weight of good, surely he will see (reply) it, and whoever does an atom's weight of evil, surely he will see (reply). (al-Zalzalah\/99: 7-8)"
		   },
		   {
			"id": 2171,
			"surah": 18,
			"ayat": 31,
			"tafsir": "In this verse, Allah (swt) outlines the rewards for those who believe in the Qur'an and do good deeds. Allah swt has prepared for them paradise 'Adn beneath which rivers flow. Heaven 'Adn is very wide, so that the gardens in it are like a separate paradise. They were also awarded beautiful jewelry, namely gold bracelets that adorned their hands. The sparkling jewelery only filled their hands which had previously been touched by the ablution water. Rasulullah saw said: The jewelry of the believers (in heaven) fills the place reached by ablution. (Al-Bukhari and Muslim history from Abu Hurairah) In addition to the jewelry, they also wear silk clothes that are smooth and thick green and covered with gold threads. Indeed, the clothes are counted as very luxurious clothes in worldly life. Green is a natural color, a color that soothes the eyes and feelings. For their place to rest in heaven, several arikah (sofa) are provided, a kind of place to sit while reclining, enjoying their rest. Thus is heaven, the best reward and a beautiful place, which Allah has prepared for His servants who believe and do good deeds."
		   },
		   {
			"id": 2172,
			"surah": 18,
			"ayat": 32,
			"tafsir": "In this verse, two men are used by Allah as a parable to explain to the rich polytheists the difference between faith and kufr, or between a noble servant at His sight and an ignoble one. Scholars differ on whether the story in this verse is just a parable, does not exist in historical reality, or is this a true story. Those who argue that this story is a true story differ as to who these two people are meant to be. According to the history mentioned by Imam al-Qurthubi, some say the two men were residents of Mecca from the Bani Makhzum tribe. The two of them were brothers, the believer named Yahuza and the unbeliever named Qurthus. The two were originally together in a business, then separated and divided their wealth. Each received thousands of dinars. Yahuza used his thousand dinars to free slaves, a thousand dinars to buy food for displaced people, and a thousand dinars to buy clothes for hungry people. As for Qurthus, he used his money to marry a rich woman and buy livestock, so that his wealth grew. The rest of the money was used for trading and always brought profit, so he became the richest man in his country at that time. A history says that this story is about a rich man with extensive gardens and plants. He owned two vineyards surrounded by date palms and between them was a field where all kinds of plants and fruit were grown."
		   },
		   {
			"id": 2173,
			"surah": 18,
			"ayat": 33,
			"tafsir": "In this verse, Allah swt explains about the condition of the two gardens which were full of fruit all that year. The trees are always shady and dense. The two gardens never suffered a setback and were lacking throughout the season. Both always produce results that bring prosperity to their owner. In the middle of the garden flows a river which at any time can irrigate the land and the surrounding fields. Regular irrigation causes the plants to always be fertile, and the flowing river really adds to its beauty. That is the great pleasure that Allah has bestowed on the owner."
		   },
		   {
			"id": 2174,
			"surah": 18,
			"ayat": 34,
			"tafsir": "Allah swt explains in this verse that the owner of the garden still has other wealth in the form of trading assets of gold, silver and other things obtained from the sale of garden and field products. Qurthus lived a life of luxury, with enormous wealth, and had a large number of servants, labourers, and bodyguards. Such circumstances make him arrogant and deny God who gave him this favor. He said to his believing friend, who had previously called on him to believe in Allah and the Resurrection Day, \"I have more treasure than you, as you can see, and my followers are more numerous. At times they are ready to defend themselves and my family from my enemies, and guard and defend my wealth.\" With these words, he implied that a person can live happily and gloriously without having faith in the God of all the worlds. He thinks that all the glory he has and the pleasure he gets are solely due to his abilities. There is no God that he feels helps and gives him sustenance and enjoyment."
		   },
		   {
			"id": 2175,
			"surah": 18,
			"ayat": 35,
			"tafsir": "In this verse Allah swt explains that when he entered his garden with his brother, he told his believing brother, pointing to his garden, that the gardens would not perish forever. There are two reasons that prompted him to say that: First: Full confidence in the ability of human power to maintain these gardens, so that they are safe from destruction. With wealth in the form of gold and silver as capital, and human resources who are experienced and knowledgeable about the care and maintenance of plants and gardens, he believes he can maintain the sustainability, beauty and fertility of his gardens and plants. He is completely unaware of the limitations of human power and common sense and does not believe that there is a supernatural power that has the power to do something about all that wealth. Second: Belief in the eternity of nature and time and disbelief in the Day of Judgment. He believes that everything that exists is eternal. Nothing will perish from this nature, what happens is only changes and changes according to applicable law. Water, plants, soil and others will continue to be available and there will be no interruption. That's the view of the owner of the garden. In fact, he has been unjust and dishonest to himself. He should be grateful to Allah who has given him all the pleasures. No one lives happily in this world by just standing on their own feet, without the help or cooperation of others. Why was he boasting, when he actually realized it. Why does he deny God, even though he realizes that he is involved in the changes in nature itself, why doesn't he want to admit who actually created all the changes in this world and created its laws. Why is he not being honest with his own conscience's confession of the existence of a Creator God? Indeed, such an attitude is a great injustice."
		   },
		   {
			"id": 2176,
			"surah": 18,
			"ayat": 36,
			"tafsir": "This verse reveals what the owner of the garden said to his believing brother about his disbelief that the Day of Judgment would come. If the Day of Judgment comes and he is returned to God, he will certainly return to get something better than the gardens he has in this world. The attitude of the garden owner shows his denial of the existence of the Day of Judgment (last day). His guess that he will get better gardens than his in this world on the Day of Resurrection is based on his experience that the two gardens that God has and entrusted to him continue to bear fruit and develop only because of the ability and effort of those who have them. Therefore, wherever and whenever, destruction always accompanies it. Allah swt also describes the nature of these disbelievers in another verse with His words: \"¦And if I am returned to my Lord, then indeed I will find goodness with Him.....\" (Fushshilat\/41: 50) lead to disbelief are: first, its recognition of the eternity of nature; second, about the absence of human resurrection from the grave; and third, the assumption that the reward in the hereafter is reflected by the conditions in the world. This view of the eternity of nature negates the decisions and wills of God the Creator of Nature. His denial of the resurrection of humans from the grave shows that he negates the power of Allah to restore humans to their original form. The view that the rewards in the afterlife are reflected by the life of the world, for example if someone in this world lives as a garden owner, then the rewards in the hereafter will also be for him as a garden owner. These are primitive beliefs, or beliefs based on culture. Such belief is contrary to religion which is based on the revelation of Allah SWT who has wisdom in giving rewards to His servants."
		   },
		   {
			"id": 2177,
			"surah": 18,
			"ayat": 37,
			"tafsir": "In this verse, Allah swt explains Yahuza's answer to refute his brother's thoughts. Qurthus, the wealthy gardener, looked down on Yahuza because of his poverty. On the other hand, Yahuza looked down on Qurthus because of his disbelief. In his conversation with Qurthus, he stated that he should not deny the power of Allah who created him from dust? Isn't food that comes from plants or animals from the ground too? From the food and drink, cells are formed which eventually become germs. Nuthfah developed step by step because she got food, either from vegetable or animal protein, so that she became a man like Qurthus. How can someone deny the power of Allah, when events clearly show the existence of that power. Every human being is aware of himself, that at first he did not exist, then came into existence. It is impossible for his presence to this plane of existence to be associated with himself. The only Substance that can connect the incident is the Creator, namely Allah Rabbul Alamin. To ensure the existence of the day of resurrection, Allah explains the process of human events, as His words: O people! If you doubt the (day) of resurrection, then surely We have created you from dust, then from a drop of sperm. (al-hajj\/22: 5)"
		   },
		   {
			"id": 2178,
			"surah": 18,
			"ayat": 38,
			"tafsir": "In this verse, Allah swt explains Yahuza's statement to his disbelieving brother that he did not agree with him. He believes that there is no God to be worshiped except Allah who takes care of creatures, the One and Only Almighty. Yahuza also said that he did not associate anything with Allah. His brother's stance that God had no power to raise him from the grave was completely unacceptable to Yahuza because he considered God to be weak and the same as creatures. This, according to him, is the same as shirk. Yahuza's firm demeanor in front of his rich brother was highly commendable, even though he was in a poor condition who had a position as a person asking for work, he boldly stated his differences in personal identity (essentials), namely differences concerning aqidah or faith in God."
		   },
		   {
			"id": 2179,
			"surah": 18,
			"ayat": 39,
			"tafsir": "Yahuza then continued his words to Qurthus, \"You should give thanks to Allah when you enter your gardens and feel amazed at their beauty. Why don't you praise Allah for all the blessings He has bestowed upon you, in the form of wealth and many children that He has never given to anyone else.\" \"Say \"masha Allah\" at that time, as a sign of acknowledging your weakness before Him, and that everything that exists is impossible without His permission and mercy. In His hands the fate of the gardens, to be fertilized according to His will or destroyed according to His will anyway. Why don't you say la quwwata illa billahi (there is no power except with Allah's help) as a sign of acknowledgment that there is no power that can prosper and manage it except with Allah's help.\" This verse contains a lesson about good practice of remembrance. The Prophet Muhammad said to his friend, Abu Hurairah: May I show you one of the treasures of heaven which is located under the Throne? I replied, \"Yes, I will.\" The Apostle said, \"You read la quwwata illa billahi.\" (History of Imam Ahmad from Abu Hurairah) Similarly, there are many hadiths of the Prophet who taught his people when they received favors from Allah so that he recited the reading, Rasulullah saw said: Every time Allah gives a servant a favor to his family, wealth or children then he said \"masya' Allah, la quwwata illa billah\", of course Allah prevented him from all disasters until his death, then Rasulullah read this verse 39 of surahh al-Kahf. (History of al-Baihaqi and Ibn Mardawaih from Anas ra) After Yahuza had finished advising his brother to believe, and had explained about the power of Allah, he began to respond to the words of his brother who was proud of his wealth and people. Yahuza said, \"If you see me as poorer than you, both in terms of wealth and in terms of men, then that's okay with me.\""
		   },
		   {
			"id": 2180,
			"surah": 18,
			"ayat": 40,
			"tafsir": "But I hope that Allah will change my situation, give me wealth, and grant me a garden that is better than yours because of my faith in Him. On the other hand, Allah swt will destroy the pleasure He has bestowed upon you because of your disbelief, and He will destroy your gardens by sending lightning from the sky which burns everything down, so that it becomes a slippery barren land."
		   },
		   {
			"id": 2181,
			"surah": 18,
			"ayat": 41,
			"tafsir": "\"Or Allah destroys the gardens with a disaster from the earth by sucking the water that flows through it and enters the bowels of the earth, so that you can't do anything to look for that water again.\" Such is the hope of the believing Yahuza, that Allah will show His power in a real way to these disbelieving and arrogant people. With this punishment, whether in the form of a disaster from the sky or from the earth, the disbelieving human being can become aware."
		   },
		   {
			"id": 2182,
			"surah": 18,
			"ayat": 42,
			"tafsir": "In this verse, Allah swt explains that what Yahuza hoped for would soon come true. Allah swt then destroyed all of Qurthus' wealth. He had said with pride that his gardens would not perish forever. But after he witnessed the destruction of his wealth, deep sadness and regret arose, while turning his palms back and forth as a sign of regret for the disappearance of all the costs he had spent on building his gardens so far. All the plants and vines that were in the garden fell down on their supports. At the peak of his sadness, he remembered the advice and teachings of his brother, so he understood that the disaster had come because of polytheism and tyranny towards himself. Then came the words of regret from his mouth, \"Oh, if I had faith and were grateful, surely God would not destroy my gardens.\" Such words of regret were born from someone who was already in great, unavoidable trouble. When everyone is squeezed and in disaster, he complains and from his mouth words that reflect his deep regret. Meanwhile, if he is not squeezed or in misery, he will not utter such words. The Word of Allah swt: So when they saw Our punishment, they said, \"We only believe in Allah and we disbelieve in the idols that we have associated with Allah.\" (al-Mu'min\/40: 84)"
		   },
		   {
			"id": 2183,
			"surah": 18,
			"ayat": 43,
			"tafsir": "In this verse, Allah SWT explains that no group of people can help the owner of the garden, be it his family, bodyguards, laborers, children, or anyone who used to be his pride. Only Allah can help him from destruction and destruction. While the person himself cannot help himself with the power that is in him."
		   },
		   {
			"id": 2184,
			"surah": 18,
			"ayat": 44,
			"tafsir": "Then Allah swt confirms in this verse that in difficulties and tribulations like that experienced by the owner of the garden, really only Allah Himself has the right and power to provide help. However, this help is only given to those who believe in Him, are grateful for His blessings, and are obedient and obedient to His commands. God will defend, reassure, and save them from all kinds of tricks and tricks of their enemies. He is the best in rewarding and rewarding."
		   },
		   {
			"id": 2185,
			"surah": 18,
			"ayat": 45,
			"tafsir": "Allah swt likens the atmosphere of life in this world and all its beauty and splendor, which will then gradually disappear, like the condition of rainwater that is sent down from the sky, so that it nourishes green, flowering and fruitful plants. The green gradually turned into a dry yellow, and finally vanished in the wind. Everything that exists on this earth certainly goes through a process of change from being born, growing, developing, withering, and disappearing. Therefore, humans who are inhabitants of this earth should not be deceived by the splendor of the world. Those who have great wealth should not be proud of their wealth and should not look down on others who have no material possessions. Indeed, the property, sooner or later, will disappear. Allah, the Most Perfect and Most Glorious, who creates all things and maintains them, grows them, destroys them, then returns them to the earth. He is the Almighty and established the laws of those changes. In the Al-Qur'an, there are many verses which liken the life of this world to the life of plants, including the word of Allah SWT: Know, in fact the life of this world is just games and jesting, jewelry and mutual pride among you and compete in wealth and progeny, like the rain whose crops amaze the farmers; then it (the plant) dries up and you see it turns yellow and then it crumbles. And in the hereafter (later) there will be a severe punishment and forgiveness from Allah and His pleasure. And the life of this world is nothing but false pleasures. (al-Hadid\/57: 20)"
		   },
		   {
			"id": 2186,
			"surah": 18,
			"ayat": 46,
			"tafsir": "Allah explains that the things people are proud of in this world are property and children, because humans really care about both of them. Many possessions and children can give an honorable life and dignity to those who possess them. Like 'Uyainah, the rich Quraysh leader, or Qurthus, who has a noble position among his people, because he has wealth and many subordinates. Because of wealth and children too, people become arrogant and look down on others. Allah confirms that both of them are just jewelry for worldly life, not jewelry and provisions for ukhrawi. Even though humans have realized that both of them will soon perish and should not be used as material for pride. In the order of this verse, property takes precedence over children, even though children are closer to the human heart, because wealth as jewelery is more perfect than children. Wealth can help parents and children at any time and with it the survival of offspring can be guaranteed. Man's need for wealth is greater than his need for children, but not vice versa. Then Allah swt explained that what should be proud of are the good deeds whose fruits are felt by humans throughout the ages until the hereafter, such as the charity of prayer, fasting, zakat, jihad in the way of Allah, as well as social acts of worship such as building schools, orphanages, homes for the poor. the elderly, and so on. These good deeds are better rewarded by Allah than wealth and children who are far from Allah's guidance, and certainly become defenders and intercessors for those who have them in the Hereafter when wealth and children are no longer useful."
		   },
		   {
			"id": 2187,
			"surah": 18,
			"ayat": 47,
			"tafsir": "In this verse, Allah swt explains various events that will occur on the Day of Resurrection. These events include: On that day, Allah swt uprooted the mountains from the grip of the earth, so that they crumbled into dust and then flew into the air as Allah flies clouds. In another verse, Allah swt says: When the earth is shaken violently, and the mountains are crushed to pieces, then dust will fly. (al-Waqi'ah\/56: 4-6) The state of the earth's surface at that time looked plain. There are no remnants of human civilization objects, wooden trees, rivers and seas that have been on the surface of the earth. All human beings appear clear before God, no one covers their condition as explained by Allah in His word: And they ask you (Muhammad) about the mountains, then say, \"My Lord will destroy them (on the Day of Judgment) destroyed, then He will make (the former mountains) completely flat, (so that) you will no longer see any low and high places there.\" (thaha\/20: 105-107) On that day, Allah swt gathered mankind from the beginning to the end, after being resurrected from their respective graves. No one that day was left behind to be examined, neither the king nor the people. Such a situation is explained by Allah SWT in His word: Say, \"(Yes), indeed those who were before and after, surely all will be gathered at a certain time, on an understandable day. (al-Waqi'ah\/56: 49-50) Word of Allah swt: ¦ That is the day when all humans are gathered (to be reckoned with), and that is the day that is witnessed (by all creatures). (Hud\/11: 103) The Messenger of Allah also recounts the circumstances of that terrible day as follows: It was narrated from 'Aisyah ra that she said, \"I heard the Messenger of Allah say, \"On the Day of Judgment people will be gathered (in Padang Mahsyar) barefoot, naked, again without circumcision.\" I then asked, \"O Messenger of Allah, do men and women see each other?\" Rasulullah SAW replied, \"Yes 'Aisyah, the affairs of the Day of Judgment are more terrible than looking at each other.\" (Muslim history in its sahih)"
		   },
		   {
			"id": 2188,
			"surah": 18,
			"ayat": 48,
			"tafsir": "In this verse, Allah SWT explains again what will happen on the Day of Resurrection, that is, angels and humans are presented to Allah by lining up row by row (lines) as in congregational prayers, one does not cover one another, each one is in a row. Their atmosphere was like an army before a king. Then Allah declares to those who disbelieve and deny the Day of Judgment with a statement that shakes their hearts, that they were brought before God without possessions and children, even without clothes and shoes like when they were first created. As explained by Allah in another verse with His words: And you really came to Us individually as We created you in the beginning, and what We have bestowed upon you, you leave behind you (in the world). (al-An'am\/6: 94) The Messenger of Allah also explained about the events of this doomsday with his words: Indeed, Allah Most High calls on the Day of Resurrection, \"O My servants. I am Allah, there is no god but I, the Most High. Merciful among those who are loving, Most Wise among the wise, and the most quick to take account. Prepare your reasons, make your answers easy. You will all be questioned and will be brought to account. O angels, set My servants on their feet in a tight line to be judged.\" (History of Ibn Mandah from Mu'adz bin Jabal) Allah railed against them because they used to think that the day of resurrection promised by God would not happen. In the past they always boasted before Muslims with their wealth and children while denying the Day of Resurrection. But when the Day of Judgment happened, they didn't move anymore."
		   },
		   {
			"id": 2189,
			"surah": 18,
			"ayat": 49,
			"tafsir": "In this verse, Allah swt adds information about the events that will occur on the Day of Judgment, that is, a record of one's deeds during his lifetime in this world is given to him. The contents of the notes are good and bad, and some are given from the right, some are from the left. Believers and do good deeds receive it from the right side, then he saw its contents. It turned out that his good was greater than his evil, and the crime was immediately forgiven by Allah swt. So he was put into heaven, as Allah says: As for the person whose book was given in his right hand, he said, \"Take it, read my book (this).\" Truly I am sure that (one day) I will receive a reckoning against myself. Then that person is in a blessed life, in a high heaven. (al-haqqah\/69: 19-22) To the unbelievers and the guilty, the book of their deeds in the world is given from the left. Then they looked at its contents, and found it was full of records of various crimes, whether in the form of deeds or words. Such proofs strike fear into their hearts at God's judgments and men's censures. With regret they said, \"Oh, woe to us, why does this notebook not leave even the slightest of our small mistakes let alone the big ones, all of them are recorded.\" Their situation was further explained by Allah in His words: And as for the person whose book is given in his left hand, he said, \"It would be better if my book (this) was not given to me, so that I do not know how my calculations are, O, would it be (death) that is what settles everything. My wealth is of no use to me at all. My power has been lost to me.\" (Allah said), \"Catch him and shackle his hands around his neck.\" Then put him into the burning fire of hell. (al-haqqah\/69: 25-31) They get all their actions that violate the rules of religion and humanity written before them. They forget that while living in the world there are angels who always carefully record all their actions and words. Word of Allah swt: And verily for you there are (angels) who watch over (your work), who are noble (with Allah) and who record (your deeds), they know what you do. (al-Infithar\/82: 10-12) All human deeds are deliberately written in a charity notebook to be shown to them on the Day of Judgment. Word of Allah swt: (Remember) on the day (when) every soul gets (return) for the good that has been done before it, (as well as the reward) for the evil that he has done.... (ali 'Imran \/ 3: 30) No one on the Day of Resurrection will be wronged. Every deed will be weighed however small. Allah swt guarantees the upholding of justice on that day. His Word: And We will set the balance right on the Day of Resurrection, so no one will be harmed even a little; even if it is only the weight of a mustard seed, We will certainly bring it (reward). And it is sufficient for Us to make calculations. (al-Anbiya'\/21: 47) Allah swt will not harm his servants, on the contrary will give forgiveness to those who are guilty, except for the sins of disbelief. He gave punishment to them based on His wisdom and justice. Allah rewards those who obey, and punishes those who commit immorality."
		   },
		   {
			"id": 2190,
			"surah": 18,
			"ayat": 50,
			"tafsir": "In this verse it is explained that when Allah ordered the angels to prostrate to Adam, they obeyed that order and prostrated themselves to Him. Only devils refuse that order. Angels who are always obedient to Allah are supernatural beings, no one knows their essence. According to the explanation of the Qur'an, angels are divided into several groups. Each group has its own duties. In Islam, it is angels who inspire people to tend to truth and goodness, as happened in the story of Maryam as. Meanwhile, those who tempt and cause anxiety in human hearts are Satan. He wants to encourage people to do evil, as the word of Allah swt: Satan promises (scares) poverty to you and orders you to do heinous (miserable). (al-Baqarah\/2: 268) Angels and demons are spiritual beings who have a relationship with the human soul, but their nature is unknown. Humans must have faith as instructed in the pillars of faith without adding or subtracting it. Every human being can feel that if he intends to do something, there is an upheaval in his soul between tending to good or evil, so that one desire overpowers the other. If we tend to goodness, it is the result of an angel's encouragement, and if we tend to evil, then it is a devil's encouragement. In terms of events, both come from different elements. Angels are created from light, while jinns or demons are created from flames. Word of Allah swt: And He created the jinn from a flame without smoke. (ar-Rahman\/55: 15) Words of Rasulullah saw: Angels were created from light, Devils were created from flames of fire, and Adam was created as told to you. (Muslim history from 'a'isyah ra) Satan refused to prostrate to Adam because according to him, the element of fire is higher than the ground. Because Adam was made from the element of earth, Satan felt humiliated if he was asked to prostrate and respect him, as Allah tells in His Word: (Allah) said, \"What prevented you (so) you did not prostrate (to Adam) when I told you to?\" (Satan) replied, \"I am better than him. You created me from fire, while you created him from clay.\" (al-A'raf\/7: 12) The Devil's opinion is very wrong because the height of rank and glory does not depend on origin, but on obedience to Allah. Because he did not want to bow down to Adam, Satan became wicked in the sense of disobeying God's commands. Satan refuses to obey because the contents of God's command are contrary to his way of thinking. So, he objected to bow down to Adam. Satan has the gift of being rebellious and always puts up a fight according to the origins of the flames. After explaining Satan's ungodliness, God reminds people not to put Satan and its descendants at the head, for they are man's enemy and God's enemy. Many narrations, both from the Prophet Muhammad and from his companions, show that the Devil and his descendants (satan) are constantly proliferating, and mankind is warned not to be tempted by his seductions to follow him. Satan is scattered on this earth to tempt humans. Only unjust humans succumb to Satan's temptations and make them their leaders and protectors. Indeed, satan is the worst creature of Allah. People who follow satan are said to be unjust because Allah SWT, who has sent down mercy and pleasure to them, is abandoned and prefers Satan's invitation."
		   },
		   {
			"id": 2191,
			"surah": 18,
			"ayat": 51,
			"tafsir": "In this verse, Allah SWT explains about His power, and states that Satan has no right to be a guide or protector for humans. Satan has no right as a protector, not only because it came from the flames of fire but also because they had no stake in creating the heavens and the earth. Allah swt emphasized that the Devil and Satan were not presented to witness the creation of the heavens and the earth when Allah created them, not even the creation of themselves, nor did some of them witness the creation of others. If they do not have a hand in the creation, how can they provide assistance in the creation. Thus, should the demons be made partners with Allah? Allah swt in creating the heavens and the earth has never made demons, idols and other offerings as helpers. Only Allah created this universe, without anyone's help. Therefore, demons and idols should not be made partners to Allah in the worship of a servant of Him. Because, only those who are worshiped who helped create the earth and the sky. Partners in creation, partners also in receiving worship. And conversely not partnering in creation, nor partnering in receiving worship. Then the right to receive worship is only Allah swt. Allah swt said: Say (Muhammad), \"Call those whom you consider (as gods) other than Allah! They do not have (power) even an atom's weight in the heavens and on earth, and they have absolutely no participation in (creation) of the sky and the earth and none of them is a helper to Him.\" (Saba\/34: 22)"
		   },
		   {
			"id": 2192,
			"surah": 18,
			"ayat": 52,
			"tafsir": "Allah in this verse reminds the Messenger of Allah about the Day of Judgment. Allah calls on the polytheists with his exclamation, \"Try to summon people or gods that you glorified while in the world, and you consider them as My partners. Perhaps they are able to provide protection and intercession for you, then deliver you from the punishment you are facing.\" At the moment.\" Then they immediately called the gods to ask for help and intercede for them. However, it turned out that even the slightest bit of worship could do nothing to help them, not even answering the call. Allah made the disbelievers and their gods a place of destruction (maubiq\/hell fire). Maubiq in this verse can also mean enmity, meaning that there is enmity between these idols and their worshipers, as in the word of Allah SWT: And they have chosen gods other than Allah, so that these gods will be protectors for them. Absolutely not! Later they (gods) will deny their worship of him, and will become enemies to them. (Maryam\/19: 81-82)"
		   },
		   {
			"id": 2193,
			"surah": 18,
			"ayat": 53,
			"tafsir": "In this verse, Allah SWT explains that sinners, namely idol worshipers or other than Allah, will witness the fire of hell on the Day of Judgment. They realized that they were about to enter that hell, and there was no escape from that threat at all. Allah has decreed punishment for them. There is no longer any possibility for them to escape punishment, because they are surrounded from all directions. How great their sorrow was while waiting for the sentence to be meted out to them."
		   },
		   {
			"id": 2194,
			"surah": 18,
			"ayat": 54,
			"tafsir": "This verse explains that various kinds of parables are put forward by Allah in the Qur'an, either in the form of comparisons to something or in the form of stories. This is intended as a comparison mirror for humans, because he has a mind. From small animals, such as mosquitoes, ants, flies, and bees, to large natural objects, such as mountains and oceans, are used as examples to attract human attention. However, humans are very argumentative creatures. That is, when Allah awakens their minds and nobility with these various parables, they also find excuses to deny them and not want to obey them. It is caused by the influence of lust, pride, and the deception of Satan and Satan. In a hadith it is narrated that the Messenger of Allah came to Ali and Fatima one night and asked: \"Are you both praying?\" So I (Ali) replied, \"O Messenger of Allah, we are actually in the hands of Allah, if He wants to raise us up, surely He can raise us up.\" So he turned away when I said that, and he didn't answer me one bit. Then I heard him hitting his own thigh while turning around and saying, \"But man is the creature who argues the most.\" (Al-Bukhari history from Ali bin Abu Talib)"
		   },
		   {
			"id": 2195,
			"surah": 18,
			"ayat": 55,
			"tafsir": "After quite a number of parables and allusions have been presented in the Qur'an, but it turned out that many people were in denial, Allah returned to provide an explanation regarding the arrogance of the disbelievers in the past. They belied the apostle and did not want to follow the instructions he brought. Even though they have witnessed clear signs and proofs of the truth of these instructions, they are not fully aware and still do not want to follow them. However, if they follow the instructions of the apostles and leave polytheism, ask Allah's forgiveness and repent for the sins they committed in the past, they will be forgiven. But all that they did not do. Likewise the Quraysh polytheists, they did not want to follow the instructions of the Qur'an, because of the nature of denial and stubbornness that had taken root in their souls. It is this nature that encourages them to ask for punishment to be inflicted on them, as was previously inflicted on people before, namely punishment that destroys them to the roots (istishal punishment), or punishment that is inflicted on them successively, punishment after punishment for real. The request of the Quraysh polytheists who opposed Allah and mocked the Messenger of Allah was explained by Allah in His words: And (remember), when they (the polytheists) said, \"O Allah, if (the Qur'an) this is true (revelation) from You, so shower us with stones from the sky, or bring us a painful punishment.\" (al-Anfal\/8: 32) Their attitude shows excessive disbelief which is harmful to themselves."
		   },
		   {
			"id": 2196,
			"surah": 18,
			"ayat": 56,
			"tafsir": "In this verse, Allah explains the task of His messengers, namely conveying instructions and awakening people to carry out their duties in two ways: First: by way of tabsyir, namely conveying joyful news. Whoever obeys and obeys Allah's instructions, surely He will provide safety in this world and in the hereafter. Second: by way of indzar, namely conveying news containing threats. Whoever does not want to obey Allah's instructions, but obeys Satan and his passions, he will suffer losses and accidents, both in this world and in the hereafter. The instructions brought by the apostles are absolute truth instructions because of and come from God. Whoever denies it as the disbelievers do, means he denies the absolute truth. In other words, those disbelievers made an absolute mistake. Moreover, the way they take is the wrong way. They are not walking the straight path, meaning they are on a crooked path. They are against chastity, meaning they follow a dirty path. Their desire to destroy the truth will only be in vain. Because the truth will stand still. This is what every apostle has always experienced in carrying out his duty of conveying the truth and instructions of God. The apostles received challenges and resistance from arrogant people. The cries of truth and God's threats are only the object of their ridicule and ridicule. In fact, it is not uncommon for the disbelievers to be pressured and overwhelmed, they issue threats directly aimed at the apostles or their followers."
		   },
		   {
			"id": 2197,
			"surah": 18,
			"ayat": 57,
			"tafsir": "In this verse Allah explains that rejecting the truth is a very big injustice. Allah has warned in a pleasant way, in the form of glad tidings, or by means of threats, but the disbelievers and polytheists are stubborn, and still choose disbelief and the immoral acts that they continue to do. By being stubborn and rejecting the truth, it means that they have wronged or wronged themselves. The injustice to themselves that they commit invites God's punishment that comes successively upon them. After they rejected the truth brought by the apostle, they also forgot about their disbelief and disobedience. Their rejection of the truth causes them to be dragged into acts of disobedience. The mistakes that were made caused them to forget the blessings that God had given them. In the end, they are completely unable to think about the consequences that will befall themselves. His heart was so stoned, that he could not comprehend any truth. They don't hear the call for the truth of Islamic law anymore, they are getting worse day by day, so that any medicine given will not be able to help. This verse is very appropriate to be applied to the polytheists of Mecca who died in disbelief."
		   },
		   {
			"id": 2198,
			"surah": 18,
			"ayat": 58,
			"tafsir": "In this verse, Allah SWT explains that He is Forgiving, and His Mercy is Widespread, encompassing the entire universe, all that is in the heavens and on earth. One of the proofs of the generous nature and mercy of Allah, the Most Extensive, is that He does not immediately impose punishment on the disbelieving polytheists. This is intended to provide an opportunity for them to become aware again, because every human being has a seed of goodness within him. It is hoped that his clear mind will nourish his human nature to develop and remember to return to God. So if they want to ask for forgiveness, even though their sins pile up and pile up, Allah, the Most Gracious and Most Compassionate, will surely forgive them. Indeed there are among those who go astray who can escape from the error, then return to the right path. Even though Allah has the nature of restraining anger, Most Forgiving and Most Merciful, but if the time limit that has been given is not also used to self-realize, then the time that has been promised by Allah will come to punish the polytheists and those who disbelieve. When the time limit has arrived, they must be held accountable for all their deeds. They must bear the punishment of Allah due to their own actions. At that time, there was no one to defend him, and nowhere to take refuge."
		   },
		   {
			"id": 2199,
			"surah": 18,
			"ayat": 59,
			"tafsir": "In this verse, Allah reminds the countries that have been destroyed and their inhabitants, because they continued to act unjustly and disbelieved in Allah's verses, even though they had been given warnings and threats by the messengers sent to them. The countries and their inhabitants include: Madyan (the land of the Shuaib people), Hijr (the land of the Samud people), al-Ahqaf (the country of the 'ad) and Sodom (the land of the Lut people). Their destruction was deliberately mentioned again with the intention that even though Allah has the nature of Forgiving and Most Merciful, but if a nation or the inhabitants of a country continue to act unjustly and disbelieve in Allah's verses, they will be destroyed along with their country. Apart from the characteristics mentioned above, Allah also has the nature of the Most Just. He will impose doom and punishment according to the actions of His own servant. This also applies to the infidels and polytheists of Quraysh. When the time comes, the leaders of the Meccan Quraysh will be destroyed by God, namely during the Battle of Badr. This warning is also intended to strengthen and strengthen the faith of those who have faith."
		   },
		   {
			"id": 2200,
			"surah": 18,
			"ayat": 60,
			"tafsir": "In this verse, Allah tells how persistent the determination of the Prophet Musa was to get to the meeting place of the two seas. How many years and how long the journey must be taken, does not matter to him, as long as the place is found and what is sought is found. The cause of the Prophet Musa as being so persistent in finding that place was that he received a reprimand and command from Allah, as narrated in a hadith which among other things reads as follows: That Musa as (one day) preached before the Children of Israel. Then someone asked him, \"Who is the most pious human being.\" He replied, \"I do.\" So Allah rebuked him because he did not return the knowledge to Allah Taala. Then Allah revealed to him, \"I have a servant at the meeting place of the two seas who is more pious than you.\" (Al-Bukhari's history from Ubay bin Ka'ab) In this revelation, Allah told Prophet Musa to meet that person by bringing a fish in a kampil (basket), and wherever the fish was loose and lost that's where the person was found. Then Musa went to meet the person mentioned, and the hadith does not explain where he was. Such is the determination possessed by a person whose heart is close to his Lord. With dexterity and zeal, he carries out His call. Most scholars are of the opinion that what Musa meant in this verse was the Prophet Musa bin Imran, the prophet of the Children of Israel whom Allah sent down to him the book of the Torah containing the Shari'a. Prophet Musa is a prophet who has extraordinary miracles. Their reasons include the fact that the Moses mentioned in the Qur'an is the Moses who received the Torah. Thus, Moses here is certainly Moses who received the Torah as well. If what is meant in this verse is another Moses, of course there is an explanation. According to Nauf al-Bukali, what Musa refers to here is Musa bin Misya bin Yusuf bin Jacob, a prophet appointed before Prophet Musa bin Imran. Their reasons include: 1. It makes no sense if what is meant by Musa here is the Prophet Musa bin Imran. Because he was a prophet who had spoken directly with God, received the Torah from Him, and was able to defeat his enemies with extraordinary miracles. How can it be accepted by reason, an extraordinary person like that was told by God to go meet other people and still have to study from him. 2. Musa bin Imran, the prophet of the Children of Israel, after leaving Egypt and going to the Sinai Desert, never left that place and he died there. Their reasons can be refuted. Someone no matter how high his knowledge, of course there are still aspects of weakness. Likewise with the Prophet Musa, of course there are aspects of shortcomings and weaknesses. In this aspect the advantages of Prophet Khidir from Prophet Musa. This is what the Prophet Musa had to learn from him, namely the things that Allah SWT tells us in the following verses. The departure of the Prophet Musa from the Sinai Peninsula may not have been notified to the Children of Israel, so that they thought that his departure was to worship Allah. After returning, Prophet Musa did not recount the events of his meeting with Khidir because his people may not have understood the event. Therefore, it was ordered to the youth who came with him to keep it a secret. The young man who accompanied Prophet Musa was named Yusya bin Nun bin Afratim bin Yusuf as. He was his assistant and student. It was Yusya who led the Children of Israel to enter Palestine when the Prophet Musa had died. In this verse, Allah has given an example of politeness according to Islamic teachings, namely to call bachelors or housemaids as fata (youth) for male helpers, and fatat for female helpers. The Prophet Muhammad once said: Do not let someone among you call my servant or my female servant, but let one call fataya or fatati. (Al-Bukhari and Muslim narration from Abu Hurairah) Regarding the person whom the Prophet Musa (as) wanted to meet, it was Balya bin Malkan. Most commentators call him Khidir. They also argue that he is a prophet by reason of the word of Allah swt: ¦that We have bestowed mercy on him from Our side, and which We have taught him knowledge from Our side. Musa said to him, \"May I follow you so that you teach me (true knowledge) that has been taught to you (to be) guidance?\" (al-Kahf\/18: 65-66) What is meant by mercy in this verse is prophetic revelation. Because the connection (end) of this verse states that mercy is taught directly from Allah without intermediaries and the only ones entitled to receive it like that are the prophets. Moreover, in the next verse it is stated that (the Prophet) Khidir taught the true knowledge to Prophet Musa. There are no prophets who learn from non-prophets. Even in verse 82 it is also stated: What I did was not according to my own will. (al-Kahf\/18: 82) The meaning of the verse above is that after the Prophet Musa and Yusya followed him, the Prophet Khidir did strange and unreasonable things. But when Prophet Musa asked him, that was the answer. This means that the actions of Prophet Khidir were based on revelations from Allah, and this is a strong proof for his prophethood. From the descriptions above, it can be concluded and learned that humility has a much better value than being arrogant."
		   },
		   {
			"id": 2201,
			"surah": 18,
			"ayat": 61,
			"tafsir": "In this verse, Allah tells us that after the Prophet Musa and Yusya got to the confluence of the two seas, they stopped, but did not know that this was the place to go. Because, God does not tell exactly where it is. It's just that Allah gave instructions when asked by Prophet Musa before leaving, as the Prophet said when narrating the question of Prophet Musa: O my Lord, how can I find him? Allah said, \"Take a fish and put it in a kampil, when the fish disappears, that's where it belongs.\" (Al-Bukhari history from Ubay bin Ka'ab) On a large rock in that place, Prophet Musa and his students felt sleepy and tired. Both fell asleep and forgot the fish. At that time, the fish in the campal came to life and floundered, then came out and slid into the sea. Even though at that time Kampil was in Yusya's hands. This event, namely dead fish come to life, is a miracle for the Prophet Musa as. After waking up, they continued their journey. Yusya also forgot not to tell Prophet Musa about the strange incident about a dead fish coming back to life."
		   },
		   {
			"id": 2202,
			"surah": 18,
			"ayat": 62,
			"tafsir": "In this verse, Allah tells us that the two of them continued their journey day and night. Prophet Musa was hungry and said to his students, \"Bring here our food, in fact we are tired from this trip.\" Feelings of hunger and fatigue after crossing the meeting place of the two seas turned out to contain wisdom, namely to return the memory of Prophet Musa to the fish they brought. In this verse, Allah reveals how noble the character of Musa (as) was in treating his students. What his students brought as stock belonged together, not just their own. How subtle he felt when he realized that fatigue and hunger were not only felt by him, but also felt by others."
		   },
		   {
			"id": 2203,
			"surah": 18,
			"ayat": 63,
			"tafsir": "In this verse, Yusya answered honestly that when they rested and took shelter in the rock where the two seas met, the fish came back to life and floundered, then entered the sea in a very surprising way. However, he forgot and did not tell Prophet Musa. This oversight was not because he was irresponsible, but Satan caused it."
		   },
		   {
			"id": 2204,
			"surah": 18,
			"ayat": 64,
			"tafsir": "Hearing answers like those above, Prophet Musa welcomed him happily saying, \"That is the place we are looking for. In that place, we will meet the person we are looking for, namely Prophet Khidir.\" They also followed the original trail, to get the stone that they made shelter. According to al-Biqa'i, the word of God in this verse shows that they were walking in the desert, so there are no signs, but there are their tracks. So there is a possibility that what is meant in God's word about the meeting of the two seas is the meeting of fresh water (the Nile) with salt water (the Mediterranean), namely the city in Dimyath or Rashid in Egypt."
		   },
		   {
			"id": 2205,
			"surah": 18,
			"ayat": 65,
			"tafsir": "In this verse, it is told that after the Prophet Musa and Yusya retraced the path they had traveled earlier, they arrived at a rock that had been used as a resting place. At this place, they met someone covered in a clean white cloth. This person is called Khidir, while his real name is Balya bin Mulkan. He was nicknamed Khidir because he sat in a white place, while behind him was a green plant. This explanation is based on the following hadith: It was narrated from Abu Hurairah that the Prophet said, \"It is called Khidir because he sits on a white animal skin. When the place moves, behind him a green plant appears.\" (Al-Bukhari) In this verse, Allah swt also mentions that Khidir is a person who gets knowledge directly from Allah. This knowledge was not given to Prophet Musa, as Allah has bestowed knowledge on Prophet Musa which was not given to Khidir. According to Hujjatul Islam al-Gazali, that in broad outline, there are two ways for a person to gain knowledge: 1. The process of teaching from humans, is called at-ta'lim al-insani, which is further divided into two, namely: a. Learn from others (outside of himself). b. Self-study by using the ability of the mind. 2. Teachings that were directly given by Allah to someone called at-ta'lim ar-rabbani, which are also divided into two, namely: a. It is given by way of revelation, whose knowledge is called: 'ilm al-anbiya' (knowledge of the prophets) and this is especially for the prophets. b. Given by means of inspiration whose knowledge is called 'ilm ladunni (knowledge from God). 'Ilm ladunni is obtained directly from God without intermediaries. Its occurrence can be likened to the light from a magic lamp that directly hits a pure, clean, empty and soft heart. This inspiration is an ornament given by Allah to His lovers (walis)."
		   },
		   {
			"id": 2206,
			"surah": 18,
			"ayat": 66,
			"tafsir": "In this verse, Allah states that the purpose of Prophet Musa as came to meet Khidir, namely to study with him. Prophet Musa greeted Khidir and said to him, \"I am Musa.\" Khidir asked, \"Moses from the Children of Israel?\" Musa replied, \"Yes, it is!\" So Khidr saluted him and said, \"What did you need to come here for?\" The Prophet Musa replied that he had come to him so that he would be allowed to follow him with the intention that Khidir would teach him some of the knowledge that Allah had taught him, namely beneficial knowledge and good deeds. In this verse, Allah clearly describes the attitude of Prophet Musa as a prospective student to his prospective teacher by submitting a request in the form of a question. That means that the Prophet Musa was very polite and humble. He positioned himself as a fool and begged to be allowed to follow him, so that Khidir would be willing to teach some of the knowledge he had been given. According to al-Qadhi, this attitude should be owned by every student in asking questions to his teacher."
		   },
		   {
			"id": 2207,
			"surah": 18,
			"ayat": 67,
			"tafsir": "In this verse Khidir answered Musa's question as follows, \"O Musa, you will not be patient with me. Because I have knowledge that Allah has taught me that you do not know, and you have knowledge that Allah has taught you that I do not know. \" Khidir's ability to predict the attitude of the Prophet Musa when he came to accompany him was based on the ladunni knowledge that he had received from Allah in addition to his anbiya' knowledge, as mentioned in verse 65 above. And indeed that was the character and attitude of the Prophet Musa who was tough in facing facts that were contrary to the Shari'a that he had received from Allah."
		   },
		   {
			"id": 2208,
			"surah": 18,
			"ayat": 68,
			"tafsir": "In this verse, Khidir emphasized to Prophet Musa about why he would not be patient later if he continued to be with him. There the Prophet Musa will see the fact that Khidir's work is outwardly contrary to the Shari'a of Prophet Musa. you will find that my works are outwardly unwholesome, but in essence you do not know their intent or benefit. Actually, that is the nature of a person who is impatient with the wrongdoing he sees. In fact, he immediately denies it."
		   },
		   {
			"id": 2209,
			"surah": 18,
			"ayat": 69,
			"tafsir": "In this verse, Prophet Musa promised not to deny and not to violate what Khidir was doing. He also promised to carry out Khidir's order as long as the order did not conflict with God's order. The promise he makes in this verse is based on the words \"God willing\" because he realizes that patience is a very big and heavy matter, especially when you see evil."
		   },
		   {
			"id": 2210,
			"surah": 18,
			"ayat": 70,
			"tafsir": "In this verse, Khidir can receive Musa as with the message, \"If you (Prophet Musa) walk with me (Khidir) then don't ask me about something I'm doing and about the secret, until I myself explain to you the problem. Don't you reprimand me for something deeds that you can't justify until I start calling them out myself to explain the true state of affairs.\" Prophet Musa was willing to accept this condition, in fact the attitude of Prophet Musa was the courtesy of an educated person towards scholars, the politeness of students with their teachers or the attitude of followers with those they followed. Sometimes the secret of the teacher or the person being followed is not necessarily understood by the students or followers right away, but can only be understood at a later date."
		   },
		   {
			"id": 2211,
			"surah": 18,
			"ayat": 71,
			"tafsir": "In this verse, Allah narrates that the two of them (Musa and Khidir) had been walking on the seaside to look for a ship, and then got it. The two of them then boarded the ship without paying their wages, because the crew members already knew Khidir and the waiver of wages was a tribute to him. When the ship was moving in the deep sea, suddenly Khidir took an ax and made a hole and damaged a piece of board on the ship's wall. Seeing such an incident, Prophet Musa immediately said to Khidir, \"Why did you make a hole in the boat? It can drown all the innocent passengers? Really you have caused great damage and are not grateful for the kindness of the crew members who have freed us. of the rent for this boat.\" Then Prophet Musa took his cloth to cover the hole."
		   },
		   {
			"id": 2212,
			"surah": 18,
			"ayat": 72,
			"tafsir": "In this verse, Khidir reminds Prophet Musa of the requirements he must fulfill if he still wants to accompany Khidir on his journey. Khidir also reminded that Prophet Musa would not be able to be patient for the actions he was doing, he would even fight and name the actions he was doing as a big mistake, because Prophet Musa did not have the knowledge to know what secrets were contained behind his actions. that deed. Khidir said to Prophet Musa, \"Didn't I say that you will never be able to be patient with me?\""
		   },
		   {
			"id": 2213,
			"surah": 18,
			"ayat": 73,
			"tafsir": "In this verse, Prophet Musa realized and realized his failure to fulfill his promise. Therefore, he asked Khidir not to punish him for his negligence, nor to burden him with difficult work. Prophet Musa also asked Khidir to be given the opportunity to follow him back in order to gain knowledge from him, and to forgive his mistakes."
		   },
		   {
			"id": 2214,
			"surah": 18,
			"ayat": 74,
			"tafsir": "In this verse, Allah tells us that both of them landed safely and did not sink, then both of them got off the ship and continued their journey along the coast. Then Khidir saw a child playing with his friends, and he killed the child. Some say that Khidir killed him by beheading him, some say by strangling him. However, the Qur'an does not mention how Khidir killed the child, whether by beheading him, hitting his head against a stone wall, or some other way. We don't need to pay attention to it or investigate it. Seeing this incident, the Prophet Musa immediately said to Khidir, \"Why did you kill a soul that was still pure from sin and not because he killed another person? Really you have done something wrong, which is contrary to common sense. In this verse , killers are called nukr (munkar), while punching a hole in a boat in verse 71 is called imr (a big mistake). The reason is that killing a child is more heinous than punching a hole in a boat. Punching a boat does not kill people if they don't drown. But murder or taking lives that are not in line with religious teachings is clearly an unlawful act. Murder that can be justified by religious teachings is only because of apostasy, adultery, or qishash."
		   },
		   {
			"id": 2215,
			"surah": 18,
			"ayat": 75,
			"tafsir": "In this verse it is explained how Khidir denied Musa's question, saying to Musa as, \"Didn't I tell you that in fact you will not be able to be patient to study the science of nature with me.\" Indeed, Musa had twice denied and disapproved of Khidir's actions, even though Musa had promised not to hold any denial against what the Prophet Khidir had done. Khidr's warning to Musa was the last warning."
		   },
		   {
			"id": 2216,
			"surah": 18,
			"ayat": 76,
			"tafsir": "Next Musa said, \"If I ask you again about a strange act of yours that I have witnessed, because I want to know the lesson, it's not just to ask. So if I ask one more time after this time, then don't let me I'll be with you again, because you've forgiven me enough.\" These are the words of Musa who are full of regret for his actions that he is forced to admit and realize. It is narrated in an authentic hadith that the Prophet Muhammad said about the condition of Prophet Musa as follows: May Allah have mercy on us and on Moses. Had he been patient with his friend (Khidir), of course he would have witnessed many miracles about the science of nature, but because he felt embarrassed to face another reproach from his friend (Khidir), he said, \"If I ask you again about something after this, then don't You accompany me. In fact, you have forgiven me enough.\" (Muslim history from Ubay bin Ka'ab)"
		   },
		   {
			"id": 2217,
			"surah": 18,
			"ayat": 77,
			"tafsir": "Then Musa and Khidir continued their journey together to a country. They asked the people of that country to entertain them, but the people of that country were very stingy and did not want to give them a banquet. They were very low morals, because according to the custom of that time, if a wealthy person did not want to give alms to a beggar, then such a thing was highly reprehensible and if he refused to give a banquet to his guests then it showed a very low level of moral decline. In this case the Arabs expressed their very strong reproaches in words. The returnee refuses guests (throws them away) from his house. Qatadah said, \"The worst country is one where the people don't like to receive guests and don't want to acknowledge the rights of Ibn Sabil (a person who runs out of supplies on his way).\" In that country Musa and Khidir found a wall of a house that was about to collapse, so Khidir repaired it with his hands, so that the wall became straight again. The strangeness includes the miracle. Musa, who saw that the wall was being erected again by Khidir without taking any wages, Musa wanted to propose to Khidir to receive payment for his services in erecting the wall, with which payment he could buy the food and drink he really needed."
		   },
		   {
			"id": 2218,
			"surah": 18,
			"ayat": 78,
			"tafsir": "This verse explains Khidr's answer to Musa, \"Your question for the third time is the reason for the separation between me and you.\" Some Ulama Tafsir say that the reason for the separation did not occur in the first and second questions, because the first and second questions concern unlawful acts, namely killing innocent children and punching (damaging) holes in the ship's walls, so it is only natural that they be forgiven. The third question is that Khidir did good to a miserly person who did not want to give him a banquet, and this is a good deed that does not need to be denied or questioned. Khidir said, \"I will tell you the various wisdoms of my deeds, which you are impatient with, namely killing children, making holes in ships and erecting house walls. The aim is to save the ship from confiscation of the wrongdoers, save the mothers of the children who were killed from disbelief if only he lived and replaced him with his pious brother and saved the inheritance belonging to the two orphans who were under the wall that was about to collapse.\""
		   },
		   {
			"id": 2219,
			"surah": 18,
			"ayat": 79,
			"tafsir": "Khidir explained why he was doing the various actions he had done. As for Khidir's actions, he punched a hole in the boat because the boat belonged to a weak and poor people. They were unable to resist the tyranny of the king who would seize the boat, and they used the boat to increase their income by transporting merchandise or renting it out to other people. Khidir intentionally damaged the boat by making holes in it because in front of him there was an unjust king who liked to seize and confiscate every intact boat and did not want to take a boat that was damaged, so because of this defect the boat would be safe. The Prophets usually stipulate something according to the facts that appear before them, while matters which are internal secrets are left to the wisdom of Allah in accordance with the sound of a hadith quoted from the Book of Tafsir al-Maragi volume VI page 7 as follows: \"We ( the Prophets) stipulates something in accordance with the facts that appear in the eye, while Allah knows the truth.\" The laws that apply in this world are based on essential causes, namely actual facts and this is only shown by Allah to a few of His servants. Therefore the Prophet Musa denied Khidir's actions and he did not know that Khidir had been given laduni knowledge which could know the secrets of unseen matters. The dignity of the Prophet Musa was in the field of Shari'a knowledge and laws based on the real world, while Khidir was given knowledge of the essence so that he knows the secrets of unseen matters. In the first and second questions of the Prophet Musa there is the application of a rule in the science of usul fiqh which means, if there are two unavoidable harms, then take the lightest loss to avoid the bigger one. If the boat had not had holes in the walls, it would have been confiscated by the king of an unjust country who would have passed through it."
		   },
		   {
			"id": 2220,
			"surah": 18,
			"ayat": 80,
			"tafsir": "As for the child who was killed, he was a disbelieving child while his parents were truly believers. So we were worried that because of the love of the parents for the child both of them would be attracted to disbelief. Qatadah said, \"Both parents were happy when the child was born, and both were sad when the child was killed.\" And if he is still alive, it will cause trouble and destruction to his parents. Therefore, everyone should accept Allah's provision with pleasure because Allah's provision for a believer in matters that he does not like is better than Allah's provisions for him in matters that he likes. It is mentioned in a hadith that the Prophet said: \"Allah does not assign a believer a stipulation, unless that stipulation is good for him.\" (History of Ahmad and Abu Ya'la) In accordance with the word of Allah: \"It is obligatory for you to fight, even though it is not pleasant for you. But it may be that you do not like something, even though it is good for you, and it may be that you like something, even though it is not good for you. Allah knows, while you do not know.\" (al-Baqarah\/2: 216) Khidir said, \"We already know that the child, when he grows up, will invite his parents to disbelief and they will both follow his invitation because they really love their child.\""
		   },
		   {
			"id": 2221,
			"surah": 18,
			"ayat": 81,
			"tafsir": "This verse explains that Khidir hopes that Allah will give sustenance to his parents and a son who is better than his son who was killed, and has more affection for his parents. Khidir's action of killing the child was based on the desire that in due time Allah could replace the child with a better moral one."
		   },
		   {
			"id": 2222,
			"surah": 18,
			"ayat": 82,
			"tafsir": "As for what motivated Khidir to erect the wall, there was under it the savings belonging to two orphans in the city, while his father was a pious man. Allah ordered Khidir to erect the wall, because if the wall fell (collapsed) surely the treasure would be seen and it was feared that someone would steal it. Allah willed that the two orphans reach the age of maturity and remove their savings themselves from under the wall, as a mercy from Him. Khidir did not do all of this work on his own encouragement and will, but solely on God's command, because an action that results in harm to human property and bloodshed cannot be done except with permission and revelation from God. Thus Khidir's explanation of his various unusual actions that made Prophet Musa impatient, so he questioned him. Khidir's effort to erect the wall that was about to collapse can also be understood as his wisdom because the collapse of the wall resulted in the confiscation of the two orphans' belongings. Allah has given Khidir the knowledge of the essence and it is impossible for him to have this except after cleansing himself and his heart from the bondage of physical lust. The Prophet Musa, when he had perfected his knowledge of Shari'a, was sent by God to meet Khidir in order to learn from him the basic knowledge, so that the knowledge that must be demanded by every believer was perfect, namely monotheism, fiqh and tasawuf or faith, Islam and ihsan."
		   },
		   {
			"id": 2223,
			"surah": 18,
			"ayat": 83,
			"tafsir": "The Quraysh asked Muhammad after they had held discussions with the Jews about what they should ask Muhammad to test the truth of his prophethood. They asked Muhammad about Zulkarnain, so Allah told Muhammad to tell them, \"I will read you the complete stories about what you are asking because I have been given information by my Lord.\" Then he gave the details as explained in the following verse:"
		   },
		   {
			"id": 2224,
			"surah": 18,
			"ayat": 84,
			"tafsir": "Truly God has given power to Zulkarnain to explore this nature as he wishes so that he reaches all corners of the world and controls the kingdoms of the earth, and God has given him ways to achieve all his aims and objectives because God has given him knowledge. sufficient, extensive powers and equipment needed to achieve its goals."
		   },
		   {
			"id": 2225,
			"surah": 18,
			"ayat": 85,
			"tafsir": "This verse explains that Zulkarnain took the road towards the West. After he took that road, he came to the western end of the earth where it was seen that the sun was setting as if it had entered the Atlantic ocean. Where he saw the sun setting in the sea that looked blackish like mud. He had passed through the lands of Tunis and Morocco and came to the west coast of Africa, and there met some infidels. Allah had told him to choose between two things, namely to torture them with bloodshed or invite them to believe in Allah. This is explained in the word of God which was conveyed to Zulkarnain by inspiration. Zulkarnain was ordered to kill them if they did not want to acknowledge the Oneness of Allah and did not want to submit to his invitation, or taught them instructions so that they would know the law and religious law with complete confidence."
		   },
		   {
			"id": 2226,
			"surah": 18,
			"ayat": 86,
			"tafsir": "This verse explains that Zulkarnain took the road towards the West. After he took that road, he came to the western end of the earth where it was seen that the sun was setting as if it had entered the Atlantic ocean. Where he saw the sun setting in the sea that looked blackish like mud. He had passed through the lands of Tunis and Morocco and came to the west coast of Africa, and there met some infidels. Allah had told him to choose between two things, namely to torture them with bloodshed or invite them to believe in Allah. This is explained in the word of God which was conveyed to Zulkarnain by inspiration. Zulkarnain was ordered to kill them if they did not want to acknowledge the Oneness of Allah and did not want to submit to his invitation, or taught them instructions so that they would know the law and religious law with complete confidence."
		   },
		   {
			"id": 2227,
			"surah": 18,
			"ayat": 87,
			"tafsir": "Zulkarnain said to some of his army commanders, \"As for those who persecute themselves and continue to live in polytheism of Allah, we will punish them and then in the hereafter they will be returned to their Lord to be punished with an incomparable punishment in the hell of Jahannam.\""
		   },
		   {
			"id": 2228,
			"surah": 18,
			"ayat": 88,
			"tafsir": "As for those who justify Allah and His Oneness and do good deeds, then for him the best reward will be provided in return for all the wisdom he has done while he was living in the world, and you will give him instructions in the world that are easy for him to do, namely some practices that are easy for him to do. can draw closer to Allah such as prayer, zakat, jihad and so on."
		   },
		   {
			"id": 2229,
			"surah": 18,
			"ayat": 89,
			"tafsir": "As for those who justify Allah and His Oneness and do good deeds, then for him the best reward will be provided in return for all the wisdom he has done while he was living in the world, and you will give him instructions in the world that are easy for him to do, namely some practices that are easy for him to do. can draw closer to Allah such as prayer, zakat, jihad and so on."
		   },
		   {
			"id": 2230,
			"surah": 18,
			"ayat": 90,
			"tafsir": "The verse explains that Zulkarnain took the road to the east. After he got to the west coast of Africa, then he headed back east until he came to the place where the sun rises around China, where he met a group of people who lived not under houses and no trees to shelter him from. hot sun. They get direct sunlight because they are not protected by roofs or the hills around them. During the day they are in underground burrows and only emerge above the earth's surface after sunset, to seek their livelihood. Their situation is very different from other inhabitants of the world, because they still live a primitive life and have no buildings to live in."
		   },
		   {
			"id": 2231,
			"surah": 18,
			"ayat": 91,
			"tafsir": "Furthermore, Zulkarnain's journey, as described above, reached the ends of the West and East and reached the height of his greatness in his reign, which is rarely matched. Indeed, We know what is in him and what he and his army do, even though they are widely spread over the surface of the earth."
		   },
		   {
			"id": 2232,
			"surah": 18,
			"ayat": 92,
			"tafsir": "Then he took another road, namely the road between Masyriq (to the east) and Maghrib (to the west) turning north. Namely in the direction of the two mountains in Armenia and Ajerbaijan."
		   },
		   {
			"id": 2233,
			"surah": 18,
			"ayat": 93,
			"tafsir": "When he came to a place between two mountains which is behind the river Jihun in the country of Balkh near the city of Tirmiz. He encountered a group of humans who could barely understand the speech of their own comrades let alone other languages, because their language was very different from the languages known to mankind and their level of intelligence was very low."
		   },
		   {
			"id": 2234,
			"surah": 18,
			"ayat": 94,
			"tafsir": "They said through their spokesperson, \"O Zulkarnain, actually Yakjuj and Magjuj by some researchers are identified as Tartars and Mongols, who have caused great damage to the earth by killing, plundering and all kinds of violence, so you are willing to accept something from us that we collect from our possessions so that you build a fort to protect us from their attack.\""
		   },
		   {
			"id": 2235,
			"surah": 18,
			"ayat": 95,
			"tafsir": "Zulkarnain replied, \"What Allah has bestowed on me, namely knowledge, sufficient knowledge, great empire, extensive power and abundant wealth is better than the wages you offered me, so we thank you for all your kindness. that and I only need the help of human strength and tools so that I can make a fortress between you and them."
		   },
		   {
			"id": 2236,
			"surah": 18,
			"ayat": 96,
			"tafsir": "\"Bring me the pieces of iron.\" And after they brought the pieces of iron, then Zulkarnain assembled and installed the iron so that the height was the same as the two peaks of the mountain. Then he said to his workers, \"Move the blowers to light the fire and heat the iron.\" So that when the iron was red like fire, he also said, \"Now give me boiling copper so I can pour it on the hot iron,\" so that the holes were sealed and a strong and strong iron fortress was formed."
		   },
		   {
			"id": 2237,
			"surah": 18,
			"ayat": 97,
			"tafsir": "And when the Gog and Magog raided that place, they couldn't climb it because it was so tall and they couldn't make a hole in it either because it was so hard and thick."
		   },
		   {
			"id": 2238,
			"surah": 18,
			"ayat": 98,
			"tafsir": "Zulkarnain then said, \"This fort is a gift from my Lord to His servant, therefore it becomes a strong fortress that protects them from the attacks of Gog and Magog. But when the promise of my Lord about their exit from behind the fort, He will make it destroyed to the ground because Allah gave power to a people to destroy it, and the promise of my Lord is true beyond doubt. According to historians, Zulkarnain's words are proven by the case of the emergence of king Genghis Khan who has caused havoc on the face of the earth from the East to the to the West and carried out an attack that destroyed the iron fortress and the Islamic empire in Baghdad. As for why this king Genghis Khan carried out an invasion of Baghdad, because Sultan Khuwarazmi from the Bani Seljuq had killed several envoys and traders sent from his country. Their property seized and raids were also carried out to the borders of his country, causing the anger of King Genghis Khan. Then he wrote a letter to the Sultan of Baghdad with the following scathing words, \"Why do you dare to kill my friends and plunder my trade assets. Do you awaken the sleeping lion and cause hidden crimes.\" Didn't your Prophet give you a will not to do wrong? Therefore leave the Turks while they do not bother you. Why do you hurt your neighbors when your Prophet himself has made a will to respect neighbors. And this is my message to you, \"Take good care of and consider your wisdom before revenge arises and before the iron fortress opens. And Allah will certainly help everyone who is being persecuted, so wait for the arrival of Gog and Magog who will descend from every high place. .\" \"From Umu Habibah ra from Zainab bint Jahsyin ra, that Rasulullah saw one day entered the house of his wife, Siti Zaenab bint Jahsy and with surprise he said, \"La ilaha illallah, woe to the Arabs from an evil that has approached, today open from Fort Yakjuj and Makjuj a big hole like this.\" And he encircled his thumb with his index finger. Then Zaenab asked, \"O Messenger of Allah, will we perish even though there are many pious people among us.\" He replied, \"Yes , when the crimes are numerous.\" (History of al-Bukhari) Since that day the hole in the fort was getting bigger and bigger. In the 7th century Hijri, the army of King Genghis Khan came to invade and cause various damage to the earth, especially in the land of Baghdad ."
		   },
		   {
			"id": 2239,
			"surah": 18,
			"ayat": 99,
			"tafsir": "On the day the iron fort was destroyed, Gog and Magog came out from behind the fort wave after wave, destroying crops and property as stated in Allah's word: \"Until when the (wall of) Gog and Magog is opened and they descend quickly from all places tall one.\" (al-Anbiya'\/21: 96) On the day the wall was opened, We let them mix in a state of chaos, then this situation will remind the inhabitants of the earth when the trumpet is blown by the angel Israfil on the Day of Judgment, then they will be gathered in the Mahsyar field to be judged . In accordance with the word of Allah: Say, \"(Yes), indeed those who were before and after, surely all will be gathered at a certain time, on a day that has been understood.\" (al-Waqi'ah\/56: 49-50) And the word of Allah: And (remember) on the day (when) We traveled the mountains and you will see the earth is flat and We gather them (all mankind), and not We leave none of them. (al-Kahf\/18: 47)"
		   },
		   {
			"id": 2240,
			"surah": 18,
			"ayat": 100,
			"tafsir": "And We show Hell Hell on the day when the trumpet is blown to the disbelievers so that they see its awesomeness and extraordinary ferocity and they hear its voice and its terrifying flames, where they are sure that they will soon be plunged into it and will not be able to avoid it. himself from it. It was narrated by Abu Sa'id al-Khudri that the Messenger of Allah said: \"How can I have fun when the angel Israfil has brought his mouth close to the end of the trumpet and has lowered his forehead and his ears are ready to hear when the order comes from Allah to blow the trumpet And if the pilgrims who gathered in Mina together would raise the trumpet from the earth, surely they would not be able to (because it is very heavy).\" So the companions of the Prophet were silent and felt heavy hearing the news. So Rasulullah saw said, \"Read (sufficient) Allah as our savior, and He is the best helper. Only to Allah (we put our trust).\" (History of Ahmad and at-Tirmidhi)"
		   },
		   {
			"id": 2241,
			"surah": 18,
			"ayat": 101,
			"tafsir": "This verse explains that the painful doom is prepared for those whose eyes are always closed from paying attention to the signs of Allah's greatness in this world. They never think about the proofs of His power, never repent to their Lord, never follow His commands and stay away from His prohibitions, as if they plug their ears and don't want to hear the warnings from God. Such punishment was inflicted on them as a result of their actions of dabbling (wandering) in sin and transgression, following the temptations of Satan to enter into traps set by Satan, so that their hearts were sealed by God so that they could no longer use their eyes and ears to receive clues and truth. And Allah makes it clear that whatever they worship besides Allah will not benefit them in the slightest."
		   },
		   {
			"id": 2242,
			"surah": 18,
			"ayat": 102,
			"tafsir": "Do the disbelievers who associate Me with others think that My servants who are in the grip of My power, such as the angels, Jesus the son of Maryam and the idols they worship, they can help them to save themselves from wrath? and my doom? Their supposition was misguided and wrong and Allah emphatically stated again, \"We have prepared hell for the disbelievers as a place to live and in exchange for what they serve for their gods."
		   },
		   {
			"id": 2243,
			"surah": 18,
			"ayat": 103,
			"tafsir": "This verse explains Allah's command to the Prophet Muhammad to say to those who disputed it among the People of the Book, namely Jews and Christians, \"Would you like to be informed about those who have suffered the most from their deeds, namely those who have taken great pains to carry out an act that by doing that he hopes for rewards and bounties, but what they get is only calamity and destruction, like people who have bought things hoping for profit, but what they get are only losses."
		   },
		   {
			"id": 2244,
			"surah": 18,
			"ayat": 104,
			"tafsir": "That is, people whose deeds are in vain in accumulating goodness in the world, they do deeds that are contrary to actions that are pleasing to Allah and they think that they have done the best they can. Then it turns out that they have made a mistake and have taken a misguided path so that the deeds they have done have not benefited one bit like dust that is blown away by the wind."
		   },
		   {
			"id": 2245,
			"surah": 18,
			"ayat": 105,
			"tafsir": "Those whose efforts are in vain are those who are displeased with God's verses and also disbelieved in the Resurrection Day, even though on that day they will be confronted with the day of meeting with Allah. Therefore all their deeds will be erased so that no more good deeds will be weighed on their scales. Because only good deeds that will weigh on the scales on the Day of Judgment are clean from polytheism."
		   },
		   {
			"id": 2246,
			"surah": 18,
			"ayat": 106,
			"tafsir": "Such a reply was due to their disbelief in the messengers of Allah and the miracles they brought which they always made fun of. They not only do not believe but also make fun of and humiliate the messengers of Allah which also means insulting Allah who sent them."
		   },
		   {
			"id": 2247,
			"surah": 18,
			"ayat": 107,
			"tafsir": "Indeed, those who believe in Allah and His messenger and confirm the message of the apostles and do good deeds solely to please Him, Paradise has been prepared for them as a place to live. Narrated by al-Bukhari and Muslim from Abu Hurairah ra, said Rasulullah saw: If you ask Allah, then ask for paradise, because it is the most glorious and highest heaven and above it is the Throne Ar Rahman, and from heaven Paradise flows the rivers of heaven. (History of al-Bukhari and Muslim from Abu Hurairah)"
		   },
		   {
			"id": 2248,
			"surah": 18,
			"ayat": 108,
			"tafsir": "They are eternally in heaven and do not want to move to another place, because there is no place that is more glorious and more glorious beside them than the paradise of Paradise."
		   },
		   {
			"id": 2249,
			"surah": 18,
			"ayat": 109,
			"tafsir": "It is narrated that the Jews said to the Prophet Muhammad, \"You say that Allah has given us wisdom, while in your book (the Qur'an) there is a verse: And whoever is bestowed with al-wisdom, he has truly been awarded many gifts. (al-Baqarah \/ 2: 269) Then you also say as mentioned in the Qur'an: And you are not given knowledge but a little. (al-Isra \/ 17: 85) They argue, there is a conflict between the two this verse, then this verse came down as an answer to their criticism. The Apostle was ordered to tell them, \"Say if the ocean were ink to write (with a pen) the sentences of my Lord and His knowledge, then the sea would be used up before finished (written) the sentences of my Lord even though the sea water was added as much, because the ocean is limited while Allah's knowledge and wisdom are unlimited.\" As Allah says: \"And if the trees in the earth becomes a pen and the sea (into ink), added to it seven seas (again) after (dry) it, surely the words of Allah will not run out (written). Indeed, Allah is Mighty, Wise.\" (Luqman\/31: 27)"
		   },
		   {
			"id": 2250,
			"surah": 18,
			"ayat": 110,
			"tafsir": "Say to them, \"Indeed I am only a human being like you, admitting that all my knowledge is not comparable to the knowledge of Allah, I know only what Allah has revealed to me, and do not know anything else except what Allah has taught me. Allah has revealed to me that , \"What is worshiped by me and by you is only God Almighty, who has no partner for Him.\" Therefore, whoever hopes for a reward from Allah on the day of meeting Him, let him be sincere in his worship, and oneness of Allah in rububiyah and uluhiyah His and do not shirk whether openly or hidden like riya, because doing something with the motive of wanting to be praised by that person is classified as hidden shirk. achieve His pleasure. It was narrated by Muslim from Abu Hurairah ra, that Rasulullah saw. be rabda: Verily Allah says, \"I am the richest among all those who associate from their partners. And whoever makes a deed by associating Me with another, then I leave him with his partners.\" (Muslim history from Abu Hurairah)"
		   }
	]
}
