{
	"tafseer": [
		{
			"id": 2596,
			"surah": 22,
			"ayat": 1,
			"tafsir": "This verse urges humans to be self-aware and protect themselves from Allah's punishment, by following His commands and staying away from His prohibitions. This order applies from the time this verse was revealed until the Day of Judgment comes, which is marked by the occurrence of a very powerful earthquake, destroying everything in this universe. Allah ordered this because the shocks and calamities that occurred on that great day were incomparable. In another word of God, it is explained that the shaking and earthquake that occurred that day. Allah says: \"When the earth is shaken with a violent shock, and the earth has issued its heavy burdens (which it contains). (az-Zalzalah\/99: 1-2) And the word of Allah: \"And the earth and the mountains were lifted up, then the two of them collided once. So on that day the Doomsday will occur.\" (al-Haqqah\/69: 14-15) From this verse it is understood that those who are pious, are not horrified and afraid of the Day of Judgment, because they have believed that the Day of Judgment will definitely happen, that they are sure that they will receive Allah's protection and help on that day, and also believe that no one can provide protection and help on that day apart from Allah Almighty, Most Compassionate to His servants. On the other hand, those who disbelieve in Allah; those who do not follow His commands and do not stop His prohibitions will feel the consequences of the shaking of the earth and the destruction of the world at that time, as incomparable torment. They cannot escape it in the slightest and no one can help them, because Allah will only help and protect His servants. According to a history, that this verse was revealed at night, during the Bani Mustalik war, then the Prophet Muhammad recited this verse to his companions. After he recited this verse, he cried and some of his friends also cried, some were discouraged and some pondered this verse. This shows how the fear of the Prophet Muhammad and his companions for the great catastrophe that will occur on the Day of Judgment, even though they have been imprinted with firm faith and patience, and they also believe that Allah will definitely help the Muslims. The Day of Judgment is the day of the destruction of the world, is a transitional period from the life of this mortal world to the eternal life of the hereafter. At that time a very terrible incident occurred, all the planets and celestial bodies collided with one another, so that they shattered into fine pieces. At that time everything in nature disappeared. Only that which did not vanish at that time was God Almighty, Almighty. After this mortal world all disappeared, Allah replaced it with another world, namely the afterlife. At that time all humans were resurrected from their graves to be weighed for their deeds. Good deeds are rewarded with a paradise full of pleasure, while evil and bad deeds are rewarded with painful torments in a flaming hell. It was at that time that humans obtained true justice from their Lord, which they did not receive while living in the world. Belief in the existence of the Last Day is one of the pillars of faith that must be believed and believed by everyone who claims to have faith in Allah and in the Prophet Muhammad who was sent by him. The Day of Judgment is one of the things that are unseen, because it is difficult to provide clear evidence about the Day of Judgment. However, if someone truly believes that Allah is Almighty and Just, He loves and has mercy on His believing servants, then that person will come to believe in the Doomsday."
		   },
		   {
			"id": 2597,
			"surah": 22,
			"ayat": 2,
			"tafsir": "In this verse, it is explained how terrible the events that took place on the Day of Judgment and how big they will affect a person, including: 1. On that day the mother who is nursing her child is neglectful of her child. Even though the relationship between mother and child is the closest relationship compared to human relationships with other humans. Likewise, the loving relationship between a mother and her child is a relationship of love that will never end. One of the manifestations of the mother's loving relationship with her child is that the mother selflessly breastfeeds her young child and breast milk is the staple food for the baby. Without food, the baby can starve to death and every mother is aware of this. Therefore, the mother is obliged to breastfeed her child, which is the heart of her heart, whenever needed. On the Day of Judgment, such a terrible and enormous event will occur, it will be as if such a relationship has been cut off. Inside the mother at that time there was fear and horror at seeing the chaotic atmosphere, so that the mother forgot to breastfeed her child, and forgot everything including the child who was being breastfed. 2. On the Day of Resurrection all pregnant women will fall. Usually, a miscarriage of a pregnant woman's womb occurs when an event that is very shocking and frightening occurs or due to a fall or a strong shock, such as a vehicle shock and so on. On the Day of Judgment there will be a great earthquake and shaking that will destroy living people, including pregnant women and the children they are carrying. Al-Hasan said, what is meant by \"negligence of all women who suckle children from their breasts\", is negligence that is not caused by weaning the child, and what is meant by \"abortion of all pregnant women's wombs\" is that the child that is conceived is born before birth. perfect timing. 3. On that day a man looks like someone who is drunk, even though he is not drunk. This shows their confusion, not knowing what to do, all in a state of fear, in a state of looking for shelter, and trying to avoid the catastrophe that is befalling it. The circumstances and events described above are to describe and illustrate to humans how terrible the catastrophe that will occur on the Day of Judgment, so that this description can serve as a lesson and warning for them, even though the actual events are even more terrible than those described. While the actual events that occurred on the Day of Judgment cannot be described as terrible, because there was no previous incident that could be used as a comparison."
		   },
		   {
			"id": 2598,
			"surah": 22,
			"ayat": 3,
			"tafsir": "This verse explains that even though Allah has explained the events that will occur on the Day of Judgment, many people deny it, and they even act more than that. They not only say that Allah has no power to resurrect and bring people back to life after being destroyed and scattered into the ground, Allah has children and has a company, the contents of the Qur'an are nothing but the stories of ancient people, but they do more than that. that is challenging God. They said, \"If Allah is truly Almighty, try to bring down the painful doom that was promised,\" and other challenges. According to Ibn Abi Hatim, this verse was revealed in connection with Nadhar bin Harish, he denied the oneness and power of Allah by saying, \"Angels are the daughters of Allah, the Qur'an is nothing but the tales of ancient people. Allah is not power to give life to the dead whose bodies have been reduced to dust.\" According to Zamakhsyari, \"Even though this verse was addressed to Nadhar bin Haris at the time of his descent, this verse is generally accepted and is addressed to all those who argue against Allah, without knowledge and define qualities that are not worthy of Him.\" Allah denounces those who argue about Allah, deny His oneness and power, without the basis of true knowledge and strong evidence. If they want to say something about Allah, they should use strong arguments and proofs. Meanwhile Allah warns that the human mind and mind will not be able to know and think about Allah's substance, because Allah's substance is something unseen. But if you want to know the existence of God, His oneness and power think about the creatures He has created such as the universe and everything in it, the laws that govern it, the earth and everything in it, the mountains with their valleys, the vast oceans. with all its content and themselves and all the creatures that God has created. Allah said: And why did they not think about (the incident) themselves? Allah did not create the heavens and the earth and what is between them except for the right (purpose) and in an appointed time. And actually most of the people really deny meeting with their Lord. (ar-Rum\/30: 8) And the word of Allah: And He planted a mountain in the earth so that the earth would not shake with you, (and He created) rivers and roads so that you may receive guidance, and (He created) signs -signs (signposts). And with the stars they got a clue. So is (Allah) the one who creates the same as the one who cannot create (something)? Why don't you take a lesson? (an-Nahl\/16: 15-17) Allah denounces people with bad manners, namely people who follow Satan. Satan had bad manners because he followed and indulged his desires, because of his arrogance he was reluctant to bow down to Adam as God had commanded him. He commits acts that are forbidden by Allah, wants others to follow his despicable deeds, tries with all his tricks so that humans look good at all actions that are forbidden by Allah, such as associating partners with God, drinking intoxicants, gambling, adultery, accumulating wealth. for self-interest, oppressing others and so on. There are demons in the form of jinn demons and some are in the form of human demons."
		   },
		   {
			"id": 2599,
			"surah": 22,
			"ayat": 4,
			"tafsir": "This verse explains that Allah has given Satan the opportunity to do all kinds of efforts to mislead and deceive humans, so that humans become astray and disbelievers as he has done. But that effort can only be made against those who disbelieve and do not believe in Allah and His Messenger. As for the faithful and sincere servants of Allah, they cannot disturb and deceive them in the slightest. Allah said: He (Iblis) said, \"My Lord, because You have decided that I am astray, I will certainly make (evil) pleasing to them on earth, and I will lead them all astray, except Your chosen servants. among them.\" (al-Hijr\/15: 39-40) From this verse it can be understood that God reminds people to be wary of Satan's temptations. Whoever follows Satan's temptations and follows his path, Allah will mislead them by widening the path laid out by Satan so that it is easy for them to go through it. Because of that they will be put into hell with the devil who tempts them. A person who has been accustomed to following the path of the devil is very difficult for him to return to the right path, because his heart has been covered by the desire of the devil. Allah says: Whoever is allowed to go astray by Allah, then no one can guide him. God let him drift in error. (al-A'raf\/7: 186)"
		   },
		   {
			"id": 2600,
			"surah": 22,
			"ayat": 5,
			"tafsir": "In this verse Allah opposes those who do not believe in the existence of the Day of Judgment and the Day of Resurrection. If they still do not believe it, they should present reasons and evidence that can support their opinion. But they couldn't put it out there. Because of that Allah gave examples of themselves, namely starting from sperm-ovum, then becoming zygat, 'alaqah, fetus, then being born to be big and then dying, if creating from nothing Allah is able to, of course repeating human creation again is easier than first creation. People who do not believe in the existence of the resurrection day consider that the resurrection is an impossible event. In their view, it is impossible for the bones that have been weathered and scattered, and the flesh that has crumbled into the ground, will come back together in their original form. The ability and power of God they measure the same as their own ability and power. If they feel unable to do a job, of course God will not be able to do it either. Those who don't believe it are solely because of their denial, because they are controlled by lust and temptation by Satan, while their hearts and minds actually admit it. They are worried that their position and rank will be threatened if they follow the beliefs and religion brought by Muhammad saw. Therefore they argue against Allah without any scientific basis. In this verse Allah gives instructions about the existence of the resurrection day by giving two reasons. The first is related to the process of human occurrence and the second is related to the process of life and growth of plants. The process of human occurrence in the womb of his mother and his life from birth to death is as follows: 1. Allah created the first human, namely Adam as, from the ground. Then from Adam his wife Eve was created, and from the two creatures humans reproduced through a fairly long process. It can also mean that God created humans through the fertilization of an ovum by a sperm in a woman's womb. The two cells come from blood, blood comes from food that humans eat, and human food comes from plants and some comes from livestock or other animals. Everything comes from the ground even though it has gone through several processes. Because it is not wrong to say that humans come from the ground. 2. In this verse it is stated that humans come from nutfah. What is meant by nutfah is zygat, which is an ovum that has been fertilized by sperm. 3. 'Alaqah, namely the zygat that has been attached to the woman's uterus. 4. Mudhgah, namely 'alaqah which has been in the form of a collection of meat cells, as big as being chewed. (mudhgah means to chew). There are those who grow perfectly and are not disabled and some grow imperfectly and are disabled. It is this perfect and imperfect event that gives rise to human physical perfection, disability or miscarriage. The process of the occurrence of nutfah to become 'alaqah is forty days, from 'alaqah to mudhgah\" is also forty days. Then after those forty days, Allah, blows the spirit, determines sustenance, charity, happiness and misery, determines death and so on, as mentioned in the hadith: In fact, the creation of someone among you is united in his mother's stomach for 40 nights in the form of a nutfah, then becomes 'alaqah for that period and then becomes mudhgah for that period too. Then Allah sends an angel, then breathes a spirit into it, then (the angel ) was ordered to write four sentences, namely to write down his sustenance, his charity, his death, happiness or misery.(Al-Bukhari and Muslim from Ibn Mas'ud) In another hadith it is explained: The Messenger of Allah said, \"An angel came to the nutfah after settling in the womb 40 or 45 days, then he said, \"O my Lord: Is it bad or good?\" (Then Allah says bad or good), then both are written (ie bad or good). So the Angel said again, \"O my Lord, is he male or female?\" (Then Allah says whether he is male or female), then both are written (ie male or female), and his work, inheritance, death and sustenance are written. Then close the sheets, then what has been written in them cannot be added or subtracted. (History of Ibn Abi Hatim and Muslim) Allah ordained the process of such an event, namely allowing the nutfah, 'alaqah, mudhgah to form a perfect fetus within the allotted time, is to explain to humans the signs of power, greatness and robustness of the rules that He made, and to serve as food for thought for mankind, that if God had the power to create man the first time, surely He would also have the power to create him the second time, and creating something the second time is usually easier than creating it the second time. First. Raising humans from the grave is essentially creating humans a second time. Of course it is very easy for Allah. Even if Allah wants something to happen without going through such a process, it is not difficult for Allah. For if He willed something to exist, it would suffice for Him to say to it, \"Be it.\" So that something happened. As He says: Truly His business, if He wills something, He only says to it, \"Be it!\" Then be that something. (Yasin\/36: 82) 5. Then the fetus is carried by the mother during the time determined by Allah. The normal gestation period is nine months and ten days. The minimum gestational age is six months, as understood from the verse that the duration of pregnancy and breastfeeding is thirty months, while the duration of breastfeeding is only two years or twenty-four months. 6. Next comes the time of birth. Babies day by day grow into children. 7. Children continue to grow into adults until they are in perfect condition, both physically and spiritually. 8. Among humans there are those who die before that ideal condition. But there are humans who just die after old age until they are senile so they can't remember anything anymore. The process of human development from a weak condition to being strong from a strong condition to being weak again or from birth, to maturity and growing old is described in the word of Allah: It is Allah who created you from a weak state, then He made (you) after that weak condition to become strong , then He made (you) after being strong weak (back) and gray. He creates what He wills. And He is All-Knowing, All-Powerful. (ar-Rum\/30: 54) Furthermore, after humans die, life does not end. But they will be resurrected for their deeds to be examined. Then they will be rewarded or rewarded. Allah said: Then after that, surely you will die. Then, verily you will be resurrected (from your graves) on the Day of Judgment. (al-Mu'minun\/23: 15-16) Then Allah gave instructions for the existence of the Day of Judgment and the Day of Resurrection, in addition to those stated above by giving examples of plant life that grows on the surface of the earth. Look at the land that is barren and dry, not growing any vegetation. Then it rained, wetting the surface of the earth. So the surface of the earth began to be loose and fertile and then plants began to grow on it. The longer the plants grow bigger, even the leaves have covered the surface of the earth which was originally barren, with various colors, some are green, some are whitish, some are red and so on. The combination of the colors of the leaves was very beautiful and amazing and made even more beautiful by the colors of the flowers of various hues. So the surface of the earth that was once barren has turned into a stretch of trees and plants of various colors. When the time comes, the flowers turn into pistils which gradually grow bigger, until they become fruit. When the ripe fruit is ready to be picked, people will come to pick it. These fruits are lawful sustenance for humans, both for eating and for other purposes that are beneficial to them. After that comes another dry season, the earth returns to being dry and barren as before. Such is the condition of the earth, which changes its state every season, from dead and barren to alive and fertile when it is watered with rain, producing fruit that is beneficial to humans, then the plants die in the summer and dry up to be revived in the rainy season. Humans who think, of course, will think about the process of life and death of the earth and everything on its surface. His mind will certainly come to the Substance that determines life and death. Humans who believe and think, of course for him all the processes of events that strengthen his faith in the power and oneness of God, who gives life to and dies His creatures, according to what He wills. If Allah had done that, surely He would have been able to create and resurrect human beings at a later date, because re-creating something again is easier than creating it the first time."
		   },
		   {
			"id": 2601,
			"surah": 22,
			"ayat": 6,
			"tafsir": "After Allah revealed the process of human and plant development in the previous verses, five things can be concluded in the following verses: 1. The God described in the above verses is the real God, God Almighty, who determine everything. No one is capable of creating a human being in such a process, namely creating a human from the ground, then becoming sperm, germ (zygat), cells, mudhgah, fetus, then being born into the world, then becoming an adult, having offspring, growing old. , eventually died into a creature that died again. Who can make the process of human events like that. Who can change the dead and barren land into fertile land and overgrown with various plants. Who made such neat and precise rules and regulations, apart from Allah, who must be worshiped? 2. It is he who gives life to the dead. Bringing life to the dead means giving life to the dead, as well as providing equipment for the survival of the creature, both for the survival of the creature itself and for the survival of its kind. Then He turned it off again. Substance that can revive the dead, then put them to death, of course, that Substance can also bring them back to life on the Day of Resurrection. Bringing the creature back to life was easier than creating it the first time. 3. He is the Almighty over all things. He does things according to His will; nothing can change and hinder His will. 4. The promised Doomsday will surely come; there is not the slightest doubt, so that those who deny it know. 5. That after the apocalypse humans will be revived to examine their deeds and receive rewards for those deeds."
		   },
		   {
			"id": 2602,
			"surah": 22,
			"ayat": 7,
			"tafsir": "After Allah revealed the process of human and plant development in the previous verses, five things can be concluded in the following verses: 1. The God described in the above verses is the real God, God Almighty, who determine everything. No one is capable of creating a human being in such a process, namely creating a human from the ground, then becoming sperm, germ (zygat), cells, mudhgah, fetus, then being born into the world, then becoming an adult, having offspring, growing old. , eventually died into a creature that died again. Who can make the process of human events like that. Who can change the dead and barren land into fertile land and overgrown with various plants. Who made such neat and precise rules and regulations, apart from Allah, who must be worshiped? 2. It is he who gives life to the dead. Bringing life to the dead means giving life to the dead, as well as providing equipment for the survival of the creature, both for the survival of the creature itself and for the survival of its kind. Then He turned it off again. Substance that can revive the dead, then put them to death, of course, that Substance can also bring them back to life on the Day of Resurrection. Bringing the creature back to life was easier than creating it the first time. 3. He is the Almighty over all things. He does things according to His will; nothing can change and hinder His will. 4. The promised Doomsday will surely come; there is not the slightest doubt, so that those who deny it know. 5. That after the apocalypse humans will be revived to examine their deeds and receive rewards for those deeds."
		   },
		   {
			"id": 2603,
			"surah": 22,
			"ayat": 8,
			"tafsir": "This verse explains that among humans there are those who really act and do beyond limits, there are those who deny and deny Allah and His attributes, without any basis of knowledge, without strong arguments and without the guidance of true revelation. Their attitude is like that solely because of their arrogance so they turn their backs on humans, that is, turn their backs on other people. Their hearts are dead and closed. As God says: Actually it is not the eyes that are blind, but what is blind is the heart that is in the chest. (al-Hajj\/22: 46) People like that, if given a warning they will not accept it, they even grow in denial and arrogance. Allah says: And when Our verses are recited to him, he turns away arrogantly as if he had not heard it, as if he has a blockage in his ears, so rejoice him with a painful doom. (Luqman\/31: 7) People who are blind in their hearts and proud of themselves, they are the ones who have denied Allah and the existence of the Last Day. Their intention is to lead astray from the right path so that they are far from Allah. According to some commentators, this verse was revealed as an affirmation and a stern warning from Allah to those who deny and argue against Him, as mentioned in the previous verses. In verses 3 and 4 of this surahh it is stated that the leaders of the Meccan polytheists, especially Nadhar bin Haris, have denied and denied Allah, without knowledge, and followed Satan's temptations. In this verse it is emphasized that Nadhar bin Haris and his friends, as well as those who behaved like them, really denied and denied Allah. Thus this verse actually gives a strong warning and threat to them, that their actions will have very bad consequences for themselves, namely humiliation in this world and in the hereafter. From these verses and the previous verses it can be understood that there were two main things that were denied by the Meccan polytheists. In the previous verses it was stated that they deny and deny the existence of the Day of Judgment and the Day of Resurrection, while in these verses they deny and deny the existence of Allah and all of His majesty and greatness. These two things are included in the pillars of faith which are the points that must be believed and believed. Therefore, their actions not only cause harm to themselves, but also mislead other humans from the way of Allah, because their actions will directly or indirectly affect other humans. They will be humiliated in this world, like the humiliation experienced by Abu Lahab and his wife, and in the hereafter they will be overwritten by the torment of a very hot hell that will scorch their bodies."
		   },
		   {
			"id": 2604,
			"surah": 22,
			"ayat": 9,
			"tafsir": "This verse explains that among humans there are those who really act and do beyond limits, there are those who deny and deny Allah and His attributes, without any basis of knowledge, without strong arguments and without the guidance of true revelation. Their attitude is like that solely because of their arrogance so they turn their backs on humans, that is, turn their backs on other people. Their hearts are dead and closed. As God says: Actually it is not the eyes that are blind, but what is blind is the heart that is in the chest. (al-Hajj\/22: 46) People like that, if given a warning they will not accept it, they even grow in denial and arrogance. Allah says: And when Our verses are recited to him, he turns away arrogantly as if he had not heard it, as if he has a blockage in his ears, so rejoice him with a painful doom. (Luqman\/31: 7) People who are blind in their hearts and proud of themselves, they are the ones who have denied Allah and the existence of the Last Day. Their intention is to lead astray from the right path so that they are far from Allah. According to some commentators, this verse was revealed as an affirmation and a stern warning from Allah to those who deny and argue against Him, as mentioned in the previous verses. In verses 3 and 4 of this surahh it is stated that the leaders of the Meccan polytheists, especially Nadhar bin Haris, have denied and denied Allah, without knowledge, and followed Satan's temptations. In this verse it is emphasized that Nadhar bin Haris and his friends, as well as those who behaved like them, really denied and denied Allah. Thus this verse actually gives a strong warning and threat to them, that their actions will have very bad consequences for themselves, namely humiliation in this world and in the hereafter. From these verses and the previous verses it can be understood that there were two main things that were denied by the Meccan polytheists. In the previous verses it was stated that they deny and deny the existence of the Day of Judgment and the Day of Resurrection, while in these verses they deny and deny the existence of Allah and all of His majesty and greatness. These two things are included in the pillars of faith which are the points that must be believed and believed. Therefore, their actions not only cause harm to themselves, but also mislead other humans from the way of Allah, because their actions will directly or indirectly affect other humans. They will be humiliated in this world, like the humiliation experienced by Abu Lahab and his wife, and in the hereafter they will be overwritten by the torment of a very hot hell that will scorch their bodies."
		   },
		   {
			"id": 2605,
			"surah": 22,
			"ayat": 10,
			"tafsir": "This verse explains that the punishment received by the disbelievers is in proportion to the unjust deeds they did in the world before, according to the word of Allah: He will reward those who do evil according to what they have done and He will reward those who do good with a better reward (heaven). (an-Najm\/53: 31) Allah punishes disobedient humans not because He intends to abuse His servants, but solely because of the sins of the servants themselves, punishing those who sin according to Allah's justice"
		   },
		   {
			"id": 2606,
			"surah": 22,
			"ayat": 11,
			"tafsir": "This verse explains that there are also some people who claim to have faith and worship Allah in a state of doubt and doubt; they are in worry and anxiety; whether the Islamic religion that they have professed can really give them happiness in this world and in the hereafter. They are like the situation of people who go to war, while their hearts are hesitant to join it. If they see signs that their troops will win and will get a lot of booty, then they carry out their duties with all seriousness, like true believers. On the other hand, if they see signs that their troops will suffer defeat and the enemy will win, they hasten to avoid themselves, even if there is an opportunity they try to join forces with the enemy. Their condition is described by Allah in this verse. If they get the happiness of life, a lot of fortune, power or position, they are happy to embrace Islam, they worship sincerely, do good deeds and so on. But if they experience adversity, hardships, trials or calamities, they claim that they experienced all of this because they embraced Islam. They convert to Islam not because of the belief that Islam is the only true religion, the religion approved by Allah, but they convert to Islam with the intention of seeking worldly happiness, seeking a lot of wealth, seeking rank and position or to gain great power. That's why they return to being disbelievers, if the goal they want is not achieved. In other verses Allah explains their behavior: (namely) people who are waiting for (events) that will happen to you. When you get victory from Allah they say, \"Didn't we (participate in the fight) with you?\" And if the disbelievers get a share, they say, \"Didn't we also win you, and defend you from the believers?\" So Allah will judge between you on the Day of Resurrection. Allah will not give way to disbelievers to defeat believers. (an-Nisa'\/4: 141) Their purpose in carrying out such actions is explained by Allah in the following verse: Indeed, the hypocrites want to deceive Allah, but Allah is the one who deceives them. When they stand up to pray they do it lazily. They intend to be happy (want to be praised) in front of humans. And they do not remember Allah except a little bit. (an-Nisa'\/4: 142) Then Allah explained that such people are people who have wasted something that is very beneficial for themselves both in this world, let alone in the hereafter. As a result, in this world they will receive disaster, misery and physical and mental suffering, and in the hereafter they will receive very severe torment by being put into the fires of hell. Because of their impatience and impatience they will incur heavy losses and cause eternal regret."
		   },
		   {
			"id": 2607,
			"surah": 22,
			"ayat": 12,
			"tafsir": "In this verse Allah explains the form of the great loss that they will experience, namely they worship gods other than Allah or they acknowledge the existence of supernatural powers other than Allah and then they worship, or they think that there are beings who can be used as intermediaries to convey a request or prayer to Allah, even though those gods do not bring harm or benefit to them, either in this world or in the hereafter. Such an act is an act that is very far from the truth. They are like someone who has lost far away in the middle of the desert, will return to the path that was originally very far and tiring."
		   },
		   {
			"id": 2608,
			"surah": 22,
			"ayat": 13,
			"tafsir": "The disbelievers as mentioned in this verse are those who worship something that does more harm than good. They worship something other than Allah, whether in the form of humans, or objects or statues. Because of their disbelief, Allah will punish them in this world and in the hereafter. In the afterlife they will know that everything they worshiped and worshiped while living in this world, and everything they considered as a helper, as something that can grant all their requests and as a good friend, in the afterlife will not have the slightest meaning, even all of that will be friends who are equally afflicted by the wrath and punishment of Allah."
		   },
		   {
			"id": 2609,
			"surah": 22,
			"ayat": 14,
			"tafsir": "For people who only worship Allah alone, do not associate anything with Him, follow the teachings conveyed by His Prophet, do pious deeds, then Allah bestows His gifts on them, by providing a place full of enjoyment and happiness. in the form of heaven with rivers flowing underneath, with shady and cool trees, as a reward from Allah for all the worship and good deeds they have done. They enjoy the gift of the joy of life forever. Allah, God Almighty, whose knowledge encompasses all things, who does things according to His own will, will give glory to those who believe and obey Him and will give humiliation and tribulation to those who disbelieve and disobey -His. Nothing can change, add, subtract or remove His statutes and power"
		   },
		   {
			"id": 2610,
			"surah": 22,
			"ayat": 15,
			"tafsir": "The commentators differed in interpreting this verse. According to Abu Ja'far an-Nahhas the best tafsir of this verse is, \"Whoever thinks that Allah will not help Muhammad in this world and in the hereafter or wants to stop Allah's help that will be given to him, then let him ascend to the sky and try from there to stop the help. Let them see, whether the effort is successful or not. And efforts like that are impossible to do.\" Az-Zamakhsyari interpreted, \"Allah will definitely help His Messenger in this world and in the hereafter. If Muhammad's enemies thought that Allah would not help him or intended not to help him, while they knew Allah's guarantee of His help, they would surely be angry. . They tried in every way to get rid of their anger, namely doing anything and even hanging themselves. After that he should pay attention to whether his actions by hanging himself could stop Allah's help to Muhammad.\" Some commentators interpret, \"Whoever believes that Allah does not help Muhammad, then let him stretch a rope to the attic of his house, then hang himself with that rope. They will know that all their efforts and tricks are useless in the slightest. Even if the commentators different opinions regarding the tafsir of the verse above, but that is only outwardly, while the meaning is the same, that is, if those who were hostile to the Prophet Muhammad were not happy with the progress of Islam and the Muslims, they were invited to ascend to the sky and then they would see the situation from there of the progress of Islam and Muslims. As it is known in history that with the development of Islam in a short time in the city of Mecca, and more and more adherents to it, efforts arose among the polytheists of Mecca to hinder the development of Islam or eliminate Islam. All kinds of efforts to achieve the goal that, they do as disconnect gan, holding boycotts, carrying out persecution of people who converted to Islam, especially against slaves who converted to Islam, so that the Muslims felt mistreated and tortured. At the same time, the polytheists themselves stated that Allah did not help Muhammad and the Muslims, because the religion he brought was not the religion that Allah pleased with. Under these circumstances this verse was revealed to give encouragement and hope to the Muslims. So that the belief arises in them that the religion they have professed is the true religion, therefore they are obliged to continue spreading it, and God will surely help them. According to Muqatil, this verse was revealed regarding the Bani Asad and Bani Gathfan who had converted to Islam, they were worried that Allah would not help Muhammad, then their relationship with the Jewish leaders was severed which resulted in their life being no longer assisted. With the revelation of this verse, all the worries that arose in their hearts disappeared. From the verse above it is understood that the enemies of Islam do not have the slightest ability to break the struggle of the Prophet Muhammad and the Muslims in their efforts to spread Islam because they always receive Allah's help in this world and in the hereafter. Allah's help is confirmed in another verse: Verily, We will help Our messengers and those who believe in the life of the world and on the day when the witnesses appear (the Day of Resurrection). (al-Mu'min\/40: 51)"
		   },
		   {
			"id": 2611,
			"surah": 22,
			"ayat": 16,
			"tafsir": "This verse explains that Allah has sent down strong proofs and arguments to Muhammad to refute the infidels, namely the Qur'an. The meaning and instructions are quite clear, easy to understand for people who are willing to seek the truth. Therefore, humans should follow and practice Islamic teachings, namely the teachings of the Qur'an so that Allah will give them help and victory in this world and the hereafter. Al-Qur'an is useful for people who have no envy in their heart, soul and heart are clean, want to seek the truth and have a willingness to believe in the unseen. People like the one described, if they read the Qur'an they will surely believe, the more they read and practice the teachings of the Qur'an the more their faith will increase. This is in line with the word of Allah: And Allah will add guidance to those who have been guided. And the eternal good deeds are better rewarded with your Lord and better outcome. (Maryam\/19: 76) On the other hand, a person who is envious, has a diseased heart, does not want to seek the truth and does not have the willingness to believe in the unseen, then the verses of the Qur'an will not be of any benefit to him and will even add to his denial and disbelief."
		   },
		   {
			"id": 2612,
			"surah": 22,
			"ayat": 17,
			"tafsir": "In this verse Allah explains that all believers, Jews, shabi'in, Christians, Zoroastrians and polytheists, will be given a fair decision by Allah on the Day of Judgment. Those who believe in this verse are those who believe in what the Prophet Muhammad taught, namely believing in Allah, His angels, His books, the messengers He has sent, the Day of Judgment and to the existence of good and bad levels. What is meant by the Jews are the descendants of the Prophet Jacob as who multiplied in Egypt and then brought back by Prophet Musa as to Palestine. They are followers of the Prophet Musa and his teachings are contained in the Torah. shabi'in are people who acknowledge the oneness of Allah but they are not believers, not Jews and not Christians. The Christians are the followers of the Prophet Isa with their holy book the Bible. And those who are shirk, namely those who worship other than Allah, whether in the form of objects, humans or idols, as worshiped by the polytheists of Mecca before Islam. Against all groups above Allah will give a fair decision on the Day of Judgment, who really follows Allah and His Messengers while living in the world, and who is making up something in Allah's religion and who is denying religion that God. Real justice has not been obtained by humans while living in this mortal world. How many people willingly change Allah's religion and then force that religion to be followed by other people. How many religions have deviated from God's teachings, but that religion can live and prosper with its many followers, so that if you look at it at a glance, that religion is the right one and is approved by God, on the other hand, God's religion itself is only embraced by those who are oppressed by poverty and do not have the slightest power or are oppressed in their country, as if that religion is not a religion that pleases Allah. All of them have not obtained true justice while living in the world. Therefore, in the hereafter, Allah will provide true justice. Everything will be rewarded according to faith, charity and deeds that have been done. Making decisions fairly and carrying out justice is not something that is impossible for Allah, because Allah is Almighty over all His creatures, He witnesses and knows all actions and what happens to creatures, both visible and invisible, whether big or small. even the smallest, even He knows everything that is etched in the heart."
		   },
		   {
			"id": 2613,
			"surah": 22,
			"ayat": 18,
			"tafsir": "Sujud in this verse means following the will and following the laws that have been outlined and established by Allah. It can also mean self-serving, worshiping and carrying out everything that Allah has commanded and staying away from everything that is prohibited. Sujud when associated with God's creatures other than humans, jinn and angels means submitting to the will and laws or nature determined by God, they cannot be separated from these provisions, either voluntarily or forced. As for humans, jinn and angels, prostration means obedience and obedience to God's laws, obedience to carrying out God's commands and stopping His prohibitions. In this verse, Allah reaffirms His power over all creatures, that is, everything in the heavens, on earth, the sun, moon, stars, mountains, plants and all reptiles are subject to and follow the rules and regulations. the terms he gave. Allah created this universe and rules it with His laws and regulations. Like the orbit of every planet in space. Each planet follows a predetermined orbit. If it gets out of its orbit, it will collide with other planets. Likewise, plants and animals grow big and develop according to God's provisions. In al-Maragi's tafsir it is stated that in this verse the mention of the sun, moon, stars and so on is specifically to remind that these creatures are among the creatures worshiped by humans besides Allah, such as the inhabitants of Himyar worshiping the sun, Bani Kinanah worshiping the moon, stars Shi'ra was worshiped by the Bani Lahm, the star surahyya was worshiped by the thayyai people, the inhabitants of ancient Egypt worshiped a calf statue or an ibis bird. It is as if this verse emphasizes that all of these things are not worthy of worship because all of them include God's creatures who follow God's will and laws. Only Allah has the right to be worshiped. Allah explains that many people believe, obey and obey Allah properly, because they feel greatness and power over themselves. Therefore they worship earnestly, carry out all God's commands and stop all His prohibitions. They do all the deeds that cause God to love them, so that God rewards and glorifies them. There are also people who do not truly believe in Allah or do not want to feel His greatness and power, they commit acts that cause Allah to be angry with them, therefore they deserve the wrath and humiliation of Allah. Whoever gets the humiliation and wrath of Allah will go to hell, no one can defend him and deliver him from Allah's punishment, because all power is in the hands of Allah. On the other hand, Allah glorifies those who have true faith, do good, Allah will enter them into heaven."
		   },
		   {
			"id": 2614,
			"surah": 22,
			"ayat": 19,
			"tafsir": "This verse explains that the six groups of people mentioned above can be divided into only two groups, namely the unbelievers and the believers. Those who belong to the infidel group are the Jews, the Shabi'ins, the Christians, the Magi and those who associate partners with Allah. These five groups have different principles of belief, one group does not admit and even denies the main points of belief of the other group, so that between them there is a dispute of opinion which sometimes escalates into hostility. The second group is the group of believers, namely those who obey Allah. Between the first group and the second group there is often debate and hostility, as described in the sabab nuzul verse above. In this verse and the following verses, the forms of punishment and punishment that will be received by disbelievers will be described as well as the forms of favors that will be received by believers in the future. The punishment that disbelievers will receive is explained by Allah as follows: 1. Those disbelievers will be put into a blazing hot hell fire, so that the fire covers their entire bodies, like clothes that wrap around and cover a person's entire body. who wears it. In another verse, it is also explained the condition of the disbelievers in hell; they are covered with hell fire until it covers their entire body. Allah says: For them is a sleeping mat from the fire of hell and on them is a blanket (fire of hell). Thus We recompense the wrongdoers. (al-A'raf\/7: 41) Some scholars are of the opinion that the clothes that cover their entire bodies, are made of very hot tar, as Allah says: Their clothes are of asphalt liquid, and their faces are covered by the fires of hell. (Ibrahim\/14: 50) 2. Poured over their heads very hot boiling water. The Hadith of the Prophet Muhammad also explains this from Abi Hurairah, in fact he read this verse, he said, \"I heard the Messenger of Allah, saying, \"Indeed, boiling hot water is poured over their heads (unbelievers), then the hot water penetrates the top of his head to his abdominal cavity, then he destroys what is in the abdominal cavity, until the hot water reaches his heels and is in a liquid state, then (the person's body) returns to normal. (History of at-Tirmidhi) 3. They were whipped with whips made of iron, hitting their faces, heads and all over their bodies. From Abi Sa'id al-Khudriy, the Messenger of Allah said, \"If the whip and iron were placed on the earth then humans and jinns gathered, they could not lift them from the earth. (Ahmad's history) 4. Every time they tried to run out of hell, they were chased away and whipped with the whip, while saying to them, \"Take this punishment by you, as a reward for denial and iniquity.\" This is a description of the punishment of the ukhrawi that Allah explained to humans. disbelievers on the Day of Judgment, so that description is frightening news for him. This is one way of the Qur'an to convince people and make them aware of the denial and iniquity that they have committed. What is the true nature of the ukhrawi punishment, including knowledge the unseen, only Allah is the All-Knowing, maybe according to what is described in the form of doom j asmani or maybe also in the form of physical punishment and spiritual punishment."
		   },
		   {
			"id": 2615,
			"surah": 22,
			"ayat": 20,
			"tafsir": "This verse explains that the six groups of people mentioned above can be divided into only two groups, namely the unbelievers and the believers. Those who belong to the infidel group are the Jews, the Shabi'ins, the Christians, the Magi and those who associate partners with Allah. These five groups have different principles of belief, one group does not admit and even denies the main points of belief of the other group, so that between them there is a dispute of opinion which sometimes escalates into hostility. The second group is the group of believers, namely those who obey Allah. Between the first group and the second group there is often debate and hostility, as described in the sabab nuzul verse above. In this verse and the following verses, the forms of punishment and punishment that will be received by disbelievers will be described as well as the forms of favors that will be received by believers in the future. The punishment that disbelievers will receive is explained by Allah as follows: 1. Those disbelievers will be put into a blazing hot hell fire, so that the fire covers their entire bodies, like clothes that wrap around and cover a person's entire body. who wears it. In another verse, it is also explained the condition of the disbelievers in hell; they are covered with hell fire until it covers their entire body. Allah says: For them is a sleeping mat from the fire of hell and on them is a blanket (fire of hell). Thus We recompense the wrongdoers. (al-A'raf\/7: 41) Some scholars are of the opinion that the clothes that cover their entire bodies, are made of very hot tar, as Allah says: Their clothes are of asphalt liquid, and their faces are covered by the fires of hell. (Ibrahim\/14: 50) 2. Poured over their heads very hot boiling water. The Hadith of the Prophet Muhammad also explains this from Abi Hurairah, in fact he read this verse, he said, \"I heard the Messenger of Allah, saying, \"Indeed, boiling hot water is poured over their heads (unbelievers), then the hot water penetrates the top of his head to his abdominal cavity, then he destroys what is in the abdominal cavity, until the hot water reaches his heels and is in a liquid state, then (the person's body) returns to normal. (History of at-Tirmidhi) 3. They were whipped with whips made of iron, hitting their faces, heads and all over their bodies. From Abi Sa'id al-Khudriy, the Messenger of Allah said, \"If the whip and iron were placed on the earth then humans and jinns gathered, they could not lift them from the earth. (Ahmad's history) 4. Every time they tried to run out of hell, they were chased away and whipped with the whip, while saying to them, \"Take this punishment by you, as a reward for denial and iniquity.\" This is a description of the punishment of the ukhrawi that Allah explained to humans. disbelievers on the Day of Judgment, so that description is frightening news for him. This is one way of the Qur'an to convince people and make them aware of the denial and iniquity that they have committed. What is the true nature of the ukhrawi punishment, including knowledge the unseen, only Allah is the All-Knowing, maybe according to what is described in the form of doom j asmani or maybe also in the form of physical punishment and spiritual punishment."
		   },
		   {
			"id": 2616,
			"surah": 22,
			"ayat": 21,
			"tafsir": "This verse explains that the six groups of people mentioned above can be divided into only two groups, namely the unbelievers and the believers. Those who belong to the infidel group are the Jews, the Shabi'ins, the Christians, the Magi and those who associate partners with Allah. These five groups have different principles of belief, one group does not admit and even denies the main points of belief of the other group, so that between them there is a dispute of opinion which sometimes escalates into hostility. The second group is the group of believers, namely those who obey Allah. Between the first group and the second group there is often debate and hostility, as described in the sabab nuzul verse above. In this verse and the following verses, the forms of punishment and punishment that will be received by disbelievers will be described as well as the forms of favors that will be received by believers in the future. The punishment that disbelievers will receive is explained by Allah as follows: 1. Those disbelievers will be put into a blazing hot hell fire, so that the fire covers their entire bodies, like clothes that wrap around and cover a person's entire body. who wears it. In another verse, it is also explained the condition of the disbelievers in hell; they are covered with hell fire until it covers their entire body. Allah says: For them is a sleeping mat from the fire of hell and on them is a blanket (fire of hell). Thus We recompense the wrongdoers. (al-A'raf\/7: 41) Some scholars are of the opinion that the clothes that cover their entire bodies, are made of very hot tar, as Allah says: Their clothes are of asphalt liquid, and their faces are covered by the fires of hell. (Ibrahim\/14: 50) 2. Poured over their heads very hot boiling water. The Hadith of the Prophet Muhammad also explains this from Abi Hurairah, in fact he read this verse, he said, \"I heard the Messenger of Allah, saying, \"Indeed, boiling hot water is poured over their heads (unbelievers), then the hot water penetrates the top of his head to his abdominal cavity, then he destroys what is in the abdominal cavity, until the hot water reaches his heels and is in a liquid state, then (the person's body) returns to normal. (History of at-Tirmidhi) 3. They were whipped with whips made of iron, hitting their faces, heads and all over their bodies. From Abi Sa'id al-Khudriy, the Messenger of Allah said, \"If the whip and iron were placed on the earth then humans and jinns gathered, they could not lift them from the earth. (Ahmad's history) 4. Every time they tried to run out of hell, they were chased away and whipped with the whip, while saying to them, \"Take this punishment by you, as a reward for denial and iniquity.\" This is a description of the punishment of the ukhrawi that Allah explained to humans. disbelievers on the Day of Judgment, so that description is frightening news for him. This is one way of the Qur'an to convince people and make them aware of the denial and iniquity that they have committed. What is the true nature of the ukhrawi punishment, including knowledge the unseen, only Allah is the All-Knowing, maybe according to what is described in the form of doom j asmani or maybe also in the form of physical punishment and spiritual punishment."
		   },
		   {
			"id": 2617,
			"surah": 22,
			"ayat": 22,
			"tafsir": "This verse explains that the six groups of people mentioned above can be divided into only two groups, namely the unbelievers and the believers. Those who belong to the infidel group are the Jews, the Shabi'ins, the Christians, the Magi and those who associate partners with Allah. These five groups have different principles of belief, one group does not admit and even denies the main points of belief of the other group, so that between them there is a dispute of opinion which sometimes escalates into hostility. The second group is the group of believers, namely those who obey Allah. Between the first group and the second group there is often debate and hostility, as described in the sabab nuzul verse above. In this verse and the following verses, the forms of punishment and punishment that will be received by disbelievers will be described as well as the forms of favors that will be received by believers in the future. The punishment that disbelievers will receive is explained by Allah as follows: 1. Those disbelievers will be put into a blazing hot hell fire, so that the fire covers their entire bodies, like clothes that wrap around and cover a person's entire body. who wears it. In another verse, it is also explained the condition of the disbelievers in hell; they are covered with hell fire until it covers their entire body. Allah says: For them is a sleeping mat from the fire of hell and on them is a blanket (fire of hell). Thus We recompense the wrongdoers. (al-A'raf\/7: 41) Some scholars are of the opinion that the clothes that cover their entire bodies, are made of very hot tar, as Allah says: Their clothes are of asphalt liquid, and their faces are covered by the fires of hell. (Ibrahim\/14: 50) 2. Poured over their heads very hot boiling water. The Hadith of the Prophet Muhammad also explains this from Abi Hurairah, in fact he read this verse, he said, \"I heard the Messenger of Allah, saying, \"Indeed, boiling hot water is poured over their heads (unbelievers), then the hot water penetrates the top of his head to his abdominal cavity, then he destroys what is in the abdominal cavity, until the hot water reaches his heels and is in a liquid state, then (the person's body) returns to normal. (History of at-Tirmidhi) 3. They were whipped with whips made of iron, hitting their faces, heads and all over their bodies. From Abi Sa'id al-Khudriy, the Messenger of Allah said, \"If the whip and iron were placed on the earth then humans and jinns gathered, they could not lift them from the earth. (Ahmad's history) 4. Every time they tried to run out of hell, they were chased away and whipped with the whip, while saying to them, \"Take this punishment by you, as a reward for denial and iniquity.\" This is a description of the punishment of the ukhrawi that Allah explained to humans. disbelievers on the Day of Judgment, so that description is frightening news for him. This is one way of the Qur'an to convince people and make them aware of the denial and iniquity that they have committed. What is the true nature of the ukhrawi punishment, including knowledge the unseen, only Allah is the All-Knowing, maybe according to what is described in the form of doom j asmani or maybe also in the form of physical punishment and spiritual punishment."
		   },
		   {
			"id": 2618,
			"surah": 22,
			"ayat": 23,
			"tafsir": "In this verse Allah explains the various pleasures that will be received by those who believe and do good deeds who purify themselves and their hearts and always try to get closer to Allah. The various pleasures that will be received are: 1. They will be entered into a paradise full of enjoyment, beneath which rivers flow. 2. They were given beautiful jewelry, such as gold bracelets, crowns studded with beautiful jewels and pearls. 3. For them provided beautiful silk clothing. 4. They are given instructions and lessons, so that they speak polite and pleasant words, do deeds that please people's hearts, get along well with other residents of heaven, live as brothers, and love one another. As Allah's statement regarding the punishment above, the description of pleasure and pleasure described in this verse, as a reward that will be received by those who believe and do good deeds in the hereafter, is the same as the enjoyment and pleasure that humans always dream of while they live in world. In general, when people live in the world, they want abundant wealth, have an honorable position and unlimited power, have beautiful wives and luxurious household utensils. Even though Allah has explained in His verses such things, but the matter of heaven and hell is included in the unseen for humans, only Allah knows the true nature, but Muslims must believe that heaven and hell are certain. There is. The description given by God, is part of the promised pleasure. The real pleasure is more than the picture because for man himself there is nothing to compare it to. What is clear is that those who believe will experience incomparable pleasures and pleasures, never before experienced while living in the world, all pleasing to the heart, feelings, thoughts, sights, hearing and so on."
		   },
		   {
			"id": 2619,
			"surah": 22,
			"ayat": 24,
			"tafsir": "In this verse Allah explains the various pleasures that will be received by those who believe and do good deeds who purify themselves and their hearts and always try to get closer to Allah. The various pleasures that will be received are: 1. They will be entered into a paradise full of enjoyment, beneath which rivers flow. 2. They were given beautiful jewelry, such as gold bracelets, crowns studded with beautiful jewels and pearls. 3. For them provided beautiful silk clothing. 4. They are given instructions and lessons, so that they speak polite and pleasant words, do deeds that please people's hearts, get along well with other residents of heaven, live as brothers, and love one another. As Allah's statement regarding the punishment above, the description of pleasure and pleasure described in this verse, as a reward that will be received by those who believe and do good deeds in the hereafter, is the same as the enjoyment and pleasure that humans always dream of while they live in world. In general, when people live in the world, they want abundant wealth, have an honorable position and unlimited power, have beautiful wives and luxurious household utensils. Even though Allah has explained in His verses such things, but the matter of heaven and hell is included in the unseen for humans, only Allah knows the true nature, but Muslims must believe that heaven and hell are certain. There is. The description given by God, is part of the promised pleasure. The real pleasure is more than the picture because for man himself there is nothing to compare it to. What is clear is that those who believe will experience incomparable pleasures and pleasures, never before experienced while living in the world, all pleasing to the heart, feelings, thoughts, sights, hearing and so on."
		   },
		   {
			"id": 2620,
			"surah": 22,
			"ayat": 25,
			"tafsir": "According to the history of Ibn 'Abbas ra this verse was actually revealed in connection with Abi Sufyan bin Harb and his friends. They prevented Rasulullah saw and his companions from entering the Grand Mosque to perform Umrah in the year of \"Hudaibiyah peace\". Therefore the Prophet was reluctant to fight them because the Prophet was in a state of ihram. Then an agreement was made which gave birth to the Hudaibiyah agreement, in which it was stated that the Prophet did not perform Umrah in that year, but it was postponed until next year and they would not prevent the Prophet and his companions from entering the Grand Mosque to perform worship, in the following year. This verse explains that everyone who denies the oneness and power of Allah, denies the apostle and denies the religion he brought, hinders people from converting to Islam and upholds Allah's sentence, hinders Muslims from entering the Grand Mosque to worship, both residents of Mecca natives and immigrants from other lands and prevent people from worshiping in it, surely Allah will inflict on them a very painful punishment. From the verse above it is understood that the Grand Mosque which is located around the Kaaba is a place for Muslims to perform the Hajj, Umrah and other acts of worship, such as tawaf, prayer, i'tikaf, remembrance, and so on, whether they originating from Mecca itself as well as originating from outside Mecca. In other words, that all Muslims have the right to worship in that place, wherever they come from. Allah threatens with a severe punishment against those who prevent and hinder him. Because of this, there are scholars who question the position of the land around the Grand Mosque, whether that land can be owned by individuals or the government, or whether the land is the right of all Muslims. The arrangement is now left to the Kingdom of Saudi Arabia, because the Grand Mosque is located in this country, as long as the country carries out God's commands to serve people who want to worship there. According to Imam Mujahid and Malik, the Grand Mosque belongs to all Muslims, no one or any country can own it. This opinion is also followed by Imam Abu Hanifah, their reason is that the words \"both those who live and those who visit\" mean that the Grand Mosque is made for humans, so that they respect it, worship there both for the people of Mecca and those who come from outside Mecca . Therefore it cannot be said that residents of Mecca have more rights over the Grand Mosque than residents from outside Mecca. Their other reasons are: 1. According to history, that Umar, Ibn 'Abbas and many of their companions were of the opinion, \"Visitors of the Grand Mosque may occupy the houses they find empty, uninhabited in Mecca, and the Meccans themselves have that empty house, let him allow it.\" 2. Hadith of the Prophet Muhammad saw: From Abdullah bin Umar, he said, \"The Messenger of Allah said, \"Mecca is a gift, the results cannot be sold and the house cannot be rented out. (History of ad-Daruquthni) 3. And the hadith of the Prophet again: From 'Aisyah ra he said, \"O Messenger of Allah, can I build for you a house in Mina or a house that can protect you from the hot sun? He replied, \"No, actually the land is a gift for those who get it first.\" (History of Abu Daud) 4. According to a history, at the beginning of Islam, the Grand Mosque had no entrances, so that at one time, many thieves came, then a man men made doors, but Umar forbade it and said, \"Did you close the doors of the pilgrims to the Baitullah? The man replied, I made doors to protect visitors' belongings from thieves.\" Therefore Umar ra let him. Imam Syafi'i was of the opinion that the land around the Grand Mosque could be owned and traded, as long as it did not hinder the Muslims. worship there. From Umamah bin Zaid, he said, \"O Messenger of Allah, may I visit your house in Mecca tomorrow? The Messenger of Allah replied, \"Did Aqil's family leave the house? (History of ash-Syaikhan) This difference of opinion stems from the problem; Did the Prophet Muhammad and his companions at the time of the conquest of Mecca (fathu Makkah) by force or by peaceful means? If it was taken from the hand polytheists with violence, of course the land around the Grand Mosque is booty for the Muslims which must be divided according to religious provisions. But the Prophet did not divide it, so that land still belongs to the Muslims until now. this was also done by Sayidina 'Umar in an area that had been seized from unbelievers. The second opinion states that the land of Mecca was seized by the Prophet Muhammad in a peaceful manner, therefore it is not a spoil, and remains the property of the time owner. Then it was inherited or sold by its former owner, so that it became the property of the buyer in sa chat this. Even though there are such differences of opinion, the scholars agree that the Grand Mosque is a place of worship for all Muslims who come from all over the world. They may come whenever they wish, with no one to interrupt or hinder them. If personal or group interests conflict with the interests of the Islamic religion, then the interests of the Islamic religion must be prioritized and prioritized. Of course the Muslims who have settled and become residents of Mecca have the right and may earn a living from the results of their efforts to serve and manage the pilgrims who come from all over the world. Even so, the business of managing and serving the pilgrims should not be commercialized, but solely to seek great rewards. The Grand Mosque as a holy place and the Qiblah of Muslims, has privileges and advantages, including: a. In that place, people who just plan to commit immorality \/ treason, Allah will punish them. Ibn Mas'ud, Ibn 'Umar, ad-dhahhak and Ibn Zaid, stated that if someone is in the Grand Mosque, then he plans to kill someone who lives in Aden, then Allah will punish him. b. Worship performed in the Grand Mosque has added value compared to worship in other places, even one prayer at the Grand Mosque has the same value as one hundred thousand prayers outside the Grand Mosque. Rasulullah said: From Jabir that Rasulullah SAW said, \"Praying in my mosque (Nabawi's Mosque) is a thousand times more important than praying outside my mosque, except in the Grand Mosque. And praying in the Grand Mosque is a hundred thousand times more important than praying outside the Grand Mosque. (Ahmad's history with sahih sanad)"
		   },
		   {
			"id": 2621,
			"surah": 22,
			"ayat": 26,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to remind the polytheists of Mecca who prevented people from converting to Islam and entering the Grand Mosque about an event that had happened before, namely when Allah showed Prophet Abraham the location of the Baitullah that would be rebuilt and when he announced to all people in the world at the command of Allah that Baitullah became the center of worship for all people. By remembering these events, it is hoped that the polytheists of Mecca will no longer hinder people from converting to Islam and entering the Grand Mosque, because Islam was the religion of their ancestor Abraham and the Grand Mosque was founded by their ancestors too. According to this verse, it was Ibrahim who first built the Kaaba. But according to a history that Ibrahim was only in charge of rebuilding the Kaaba back with his son Ismail as, previously the Kaaba had been built, then it collapsed and its remains were buried by sand. According to this history, after Ishmael, the son of Abraham and his wife Hajar, who he left in Mecca, became an adult, Abraham came to Mecca from Palestine to carry out Allah's commands, namely to rebuild the Kaaba with his son Ismail. Allah informed Ibrahim that the place where the collapsed Kaaba had stood was cleared by a strong wind blowing it clean, then Ibrahim a.s. and his son Ismail a.s. built the Kaaba in that place. Then Allah ordered Abraham and his people to obey Allah; do not associate anything with it, cleanse the Kaaba of all kinds of acts that contain elements of shirk, purify it of all kinds of uncleanness and filth, make the Kaaba the center of worship for believers, such as doing tawaf (walking around Kaaba). The words \"salat, bowing and prostration\", are a sign that the Kaaba was built for Muslims, because prayer, bowing down, is a characteristic of Muslim worship which is performed facing the Kaaba. Allah has bestowed His great gift upon the Muslims, who have prepared their center of worship long before their messenger was sent with the message of Islamiyah. In other words, it can be said that the erection of the Kaaba, which was carried out by the Prophet Abraham at the behest of Allah, was a preparation for the delivery of the Islamic treatise. Because in the future the Kaaba was made by Allah as a prayer center for Muslims and a place for them to perform the Hajj and Umrah pilgrimages."
		   },
		   {
			"id": 2622,
			"surah": 22,
			"ayat": 27,
			"tafsir": "In this verse, Allah ordered Prophet Ibrahim as to call on people to perform the pilgrimage to the House of Allah and convey to them that the pilgrimage is one of the obligatory worships for Muslims. Most commentators are of the opinion that Allah's command in this verse is addressed to Prophet Ibrahim as who had just finished building the Kaaba. This opinion is in accordance with this verse, especially if you pay attention to its relationship with the previous verses. In the previous verses, Allah's command was mentioned to the Prophet Muhammad to remind the polytheists of Mecca of the incident when Allah ordered Abraham to build the Kaaba, while these verses told the polytheists to remember the incident when Allah ordered Ibrahim to call people to perform the pilgrimage. This opinion is also in accordance with the history of Ibn 'Abbas from Jubair who explained that when Ibrahim as finished building the Kaaba, Allah ordered him, \"Call people to perform the pilgrimage.\" Ibrahim (as) replied, \"O God, will my voice reach them?\" Allah said, \"Call them, I will convey it.\" So Ibrahim went up to the top of Abi Qubais hill, then said in a loud voice, \"O people, in fact Allah has really ordered you all to visit this house, so that He will give you heaven and protect you from the punishment of hell, therefore perform the pilgrimage by you.\" So that voice was introduced by people who are in the male sulbi bones and people who have been in the womb of women, with the answer, \"Labbaika, Allahumma labbaika\". Then apply \"talbiyah\" in that way. Talbiyah is a prayer that is recited by people who are performing the Hajj or Umrah pilgrimage, that prayer is, \"Labbaika, Allahumma Labbaika.\" Al-Hasan argues that Allah's command in this verse is addressed to the Prophet Muhammad. His reasoning was that all the words and discussions in the verses of the Qur'an were addressed to the Prophet Muhammad, including the order to carry out this pilgrimage. This order was carried out by Rasulullah and his companions by performing the pilgrimage wada' (the last pilgrimage), as stated in the hadith: From Abi Hurairah, he said, \"Rasulullah has preached before us, he said, \"O people, Allah has made it obligatory upon you pilgrimage, then perform the pilgrimage.\" , then the order was also given to him, so that the Prophet Muhammad and his people were also obliged to perform the pilgrimage, even it was determined as the fifth pillar of Islam.In this verse there are words, \"... they will surely come to you ...\" From the words this is understood, as if God told Abraham that if Abraham calls on people to perform worship pilgrimage, surely people will fulfill his call, they will come from all corners of the world even though they have traveled a difficult and arduous journey. Anyone who fulfills that call, either at that time or in the future, means that he has come to fulfill God's call as Abraham did in the past. Abraham had once been ordered by Allah to come to Mecca which was still deserted, Abraham complied even though his journey was difficult, through the scorching heat of the desert that stretched between Mecca and Syria. The order was carried out properly, even Abraham was willing to slaughter his biological son Ismail, solely to carry out God's command, because of that God would provide a great reward for Abraham, and such a reward would also be given by God to those who visit this Baitullah. , especially for people who deliberately come to Mecca to perform the pilgrimage. These words are a tribute to Ibrahim and show how great the reward that Allah has provided for those who perform the pilgrimage solely because of Allah. The scholars agree that it is permissible to come to Baitullah to perform the pilgrimage by using any vehicle and in any way that is lawful, such as by foot, by ship or by airplane or by vehicle by land and so on. But Imam Malik and Imam Asy-Shafi'i are of the opinion that going to perform the pilgrimage by using a vehicle by land is better and has greater reward, because that way follows the actions of the Prophet. In this way, it requires a lot of spending, taking difficult journeys and adding symbols to the pilgrimage, especially when passing through countries that are traveled during the trip. Some scholars argue that walking is more important than driving, because walking has more difficulties than driving. In this case driving or not is a technical matter only. In general, Islam does not want difficulty but ease. Islam also does not burden a person with something that he is not able to do. Carrying out the pilgrimage either by vehicle or on foot, will surely get a great reward from Allah, if the worship is carried out solely for Allah's sake. What is assessed is the intention and sincerity of a person and the ways of carrying it out. Even though the journey is difficult, but the intention to perform Hajj is not because of Allah, then he will not get anything from Allah, on the contrary he will be punished with a very painful punishment because of his intention. If someone has arrived in Mecca and sees Baitullah, it is sunnah to raise their hands, as stated in the hadith: Narrated by Ibn 'Abbas ra from the Prophet saw, he said, \"Both hands are raised in seven places, namely at the opening of the prayer, when facing the Baitullah, when facing the hills of Safa and the hills of Marwah, when facing two places (Arafah and Muzdalifah) and when throwing two jamrahs.\" (Ahmad's history) This hadith was practiced by Ibn Umar ra."
		   },
		   {
			"id": 2623,
			"surah": 22,
			"ayat": 28,
			"tafsir": "This verse explains that the purpose of the Hajj is prescribed, namely to obtain benefits. There is no mention in this verse of the forms of these benefits, they are only mentioned in general terms. The general mention of the benefits that will be obtained by people who perform the pilgrimage in this verse shows the many kinds and types of benefits that will be obtained. It is difficult to explain these benefits in detail, only those who can explain and feel them are people who have performed the pilgrimage and have carried it out with sincere intentions. Some of these benefits relate to the spiritual and some to the physical, and some are directly felt by the individual who implements them, and some are felt by the community, both related to the world and those related to the hereafter. Many scholars have tried to reveal the forms of benefits that pilgrims might get, after they have experienced and studied it most of them stated that they had not been able to reveal all the benefits. Among the benefits disclosed are: 1. Train yourself by using all abilities to remember Allah humbly' on the days that have been determined by purifying obedience and submission only to Him alone. When a person tries to control his desires by following Allah's commands and fighting against His prohibitions, no matter what hinders and hinders him. It is hoped that the exercises carried out during the pilgrimage will leave an impression on the soul and then be repeated after returning from the holy land, so that they become good habits in life and life. 2. Generating a sense of peace and brotherhood among fellow Muslims. Since a pilgrim wears ihram clothes, white clothes that are not sewn, as a sign that he is performing the pilgrimage, since then he has put off worldly clothes, his favorite clothes, oversized clothes, luxury clothes and so on. All humans look the same in that ihram dress; cannot be distinguished between the rich and the poor, between the rulers and the common people, between the smart and the stupid, between masters and slaves, all are equally submissive and servile to the Lord of the worlds, both are tawaf, both are running between hills Safa and the hills of Marwa, both jostling to throw Jamrah, both bowing and contemplating in the middle of the plains of Arafah. In such circumstances it will feel that we are the same as other people. What distinguishes one degree from another is the level of piety and obedience to Allah. Because of this, a feeling of wanting to help each other, a sense of religion, a sense of shared destiny and responsibility, respect for fellow human beings arises. 3. Trying to imagine life in the afterlife, at that time no one can provide help except Allah, God Almighty. Standing at Arafah, where many people gather on the day of Arafah, is a picture of life in Padang Mahsyar later. All of them describe the times when humans stand before Allah's Court in the hereafter. 4. Get rid of excessive self-esteem. When someone is in their country, they are usually bound by the customs that they usually carry out every day in their association. The slightest change can lead to misunderstandings, disputes and contradictions. At the time of performing the pilgrimage, Muslims who come from all over the world meet, from different countries, each of them has different customs and habits of life and procedures, so there is contact between these customs and habits of life. . Such as how to speak, how to eat, how to dress, how to respect guests and so on. At the time of performing the pilgrimage there is contact and body clashes between pilgrims from one country, and congregations from other countries, such as the time of tawaf, time of sa'i, time of standing at Arafah, time of stoning the jumrah and so on. During prayers at the Grand Mosque, the body of a person sitting is stepped over by another friend because they want to get the front row, as well as language and sign issues, all of which easily lead to misunderstandings and disputes. For someone who is performing the pilgrimage, all of this must be faced patiently, with an open mind, must be faced based on the assumption that all pilgrims do this not to hurt their friends and not to offend other people, but solely eyes to achieve the maximum goal of the pilgrimage. They all want to get hajj mabrur, whether he is a rich man or a poor man and so on. 5. Living the life and struggles of Prophet Ibrahim and his son Prophet Ismail and Prophet Muhammad and his companions. When Ibrahim first arrived in Mecca with his wife Hajar and his young son Ismail, the city of Mecca was still a desert where no human lived. In such circumstances Abraham left his wife and son there, while he returned to Palestine. Hajar and her young son experienced various kinds of suffering. There was no place to complain and ask for help except to God alone. As faint as the eye can see, there is only a rocky mountain, without any vegetation that can be used as shelter. You can feel the difficulty of Hajar running between Safa and Marwa looking for a drop of water for her child to drink. It can be contemplated and made an example of Abraham's obedience and obedience to Allah. After that he slaughtered his beloved son, Ishmael, as a sacrifice, solely to fulfill and carry out Allah's command. During the pilgrimage, Muslims can see traces and places related to the struggle of the Prophet Muhammad and his companions in upholding the religion of Allah. From Mecca when he received obstacles, obstacles and even torture from the polytheists of Mecca, then he migrated to Medina, on foot, while being chased by unbelievers. This was also the case with the efforts he made in Medina, fighting with the infidels, facing the cunning and slander of the hypocrites and the Jews. All of this can be remembered and internalized while performing the pilgrimage and it is hoped that this will increase faith and piety in Allah, the Most Gracious and Most Merciful. 6. Every Islamic Conference around the world. During the pilgrimage season, Muslims from all over the world come. Indirectly there were meetings between fellow Muslims, between ethnic groups and between nations and nations of various styles. Between them they can talk and exchange experiences with others, so that one's experience and thoughts can be taken and used by others, especially after each of them arrives in their country later. If a meeting like this is well organized, it will certainly be of great benefit, it will be able to solve the difficult problems faced by Muslims in their respective countries. All of this will also benefit individuals, society and religion. It would be nice if at that time a meeting was held between heads of state who perform the pilgrimage, a meeting of experts, scholars, community leaders, businessmen and so on. Even though there are many benefits that will be obtained by people who perform the pilgrimage, only Allah can know for sure all these benefits. From the experience of people who have performed Hajj, information is obtained that their desire to perform the pilgrimage increases after they have completed the first pilgrimage. The more often someone performs the pilgrimage, the more this desire increases. The secrets and benefits of the pilgrimage can also be understood from the prayer of the Prophet Abraham to Allah, as stated in His words: So make the hearts of some people incline towards them. (Ibrahim\/14: 37) Another benefit of the pilgrimage is that people recite the name of Allah on designated days and carry out sacrifices by slaughtering sacrificial animals or hadyu (dam) for pilgrims who violate the obligation of pilgrimage. As for the implementation, namely after throwing the jamrah 'aqabah and only carried out in the Haram land of Mecca. Meanwhile, hadyu (dam) meat is only intended for the poor in Mecca, unless there are no poor in Mecca anymore, then the meat may be given to poor people in other cities\/countries. What is meant by designated days are the Hajj holidays and tasyriq days, namely the 11th, 12th and 13th of Zulhijjah. On these days, sacrificial animals are slaughtered. The time to slaughter the sacrificial animal is after the Eid al-Adha prayer until the sun sets on the 13th of Zulhijjah. The Messenger of Allah said: Whoever slaughters a sacrifice before the Eid al-Adha prayer then in fact he is only slaughtering for himself and whoever slaughters after the Eid al-Adha prayer (and after reading two Sermons) then in fact he has perfected his worship and has carried out the sunnah of the Muslims. (Al-Bukhari's history from al-Barra) And the words of the Messenger of Allah saw: \"All the tasyriq days are when the sacrifice is made.\" (Ahmad's history from Jubair bin Mut'im) After the sacrificial animal has been slaughtered, the meat may be eaten by the sacrificer and some of it can be given as charity to the needy and poor. According to the majority of scholars, it is better for those who sacrifice to eat a small portion of the sacrificial meat, while most of it should be donated to the poor. It is permissible for the person who sacrifices to give all the meat of the sacrifice to the poor."
		   },
		   {
			"id": 2624,
			"surah": 22,
			"ayat": 29,
			"tafsir": "This verse explains that after people who perform the pilgrimage have finished slaughtering their sacrificial animals, they should do three things: 1. Get rid of envy or dirt that is in them, namely by cutting their mustaches, cutting their hair, cutting their nails and so on. This is ordered because these actions are forbidden to do during the pilgrimage. 2. Carry out vows that have been made, because at this time, place and condition is the best for completing vows. 3. Performing tawaf at the Kaaba. The meaning of tawaf is circumambulating the Kaaba seven times. There are three kinds of Tawaf, namely: a. Tawaf qudum, namely tawaf which is done when you first enter\/come to Mecca. b. Tawaf Wada 'that is the tawaf performed when leaving Mecca after completing the pilgrimage. c. Tawaf Ifadhah, namely tawaf performed in order to carry out the pillars of Hajj. In this verse Baitullah is called Baitul 'Atiq, which means \"old house\" because Baitullah was the first house of worship founded by Prophet Ibrahim as and his son Prophet Ismail as and then Baitul Maqdis Palestine was founded by Prophet David as and Prophet Sulaiman as."
		   },
		   {
			"id": 2625,
			"surah": 22,
			"ayat": 30,
			"tafsir": "This verse explains that everything mentioned in the previous verses, such as shaving hair, cutting nails, fulfilling vows, circumambulating the Kaaba, is an obligation that must be carried out by everyone who performs the pilgrimage. Whoever carries out all that has been ordered while they are in ihram, because they want to glorify and seek the pleasure of Allah, then that act is the best deed in the sight of Allah and will be rewarded with multiple rewards and paradise full of pleasures. According to Ibn 'Abbas what is meant by \"hurumatillah\", is what people who are performing the pilgrimage are prohibited from doing, such as acting wickedly, fighting, having sex with their wives, hunting and so on. Respect \"hurumatullah\", is to stay away from all the prohibitions. Meanwhile according to the history of Zaid bin Aslam, what is meant by \"hurumatillah\", is al-Masy'aril Haram, the Grand Mosque, the Baitul Haram (Kaaba), the Sacred Months and the Haram Land. Respecting \"hurumatillah\" is doing good in those places, not committing immorality and that is the best deed in the sight of Allah. In the pilgrimage there are two kinds of worship, namely worship related to the limbs, called \"badaniyah\" worship, such as tawaf, sa'i, throwing the jumrah and so on. The second is worship related to property, called \"maliyah\", such as slaughtering sacrificial animals and so on. In this verse it is mentioned that food is lawful, and the command to stay away from lying. Even though the order is addressed to all Muslims, it is highly prioritized for those who are performing the pilgrimage. Allah explains that it is lawful for those who believe to eat and slaughter camels, cattle and so on, except for animals that have been forbidden, as stated in Allah's word: It is forbidden for you (to eat) carrion, blood, pork and (meat) animals slaughtered not for Allah's (name), strangled, beaten, fallen, gored, and eaten by wild animals, except those that you could slaughter, and (also forbidden) those slaughtered for idols.... (al- Ma'idah\/5: 3) And the word of Allah: Say, \"I did not find in what was revealed to me, something that is forbidden to eat for those who want to eat it, except for the flesh of dead animals (carcasses), flowing blood, pork\" because all that is dirty or animals slaughtered not by (name) Allah.... (al-An'am\/6: 145) Allah never forbids eating animal flesh as it is forbidden by the polytheists of Mecca, that act is an act that they just made it up. They forbid Bahirah, Sa'ibah, Washilah, Ham and so on, as Allah says: Allah has never prescribed Bahirah, Saibah, Washilah and Ham. But the disbelievers fabricate lies against Allah, and most of them don't understand. (al-Ma'idah\/5: 103) This verse mentions two kinds of commandments from Allah, namely: 1. The command to stay away from worshiping statues or idols, because that act is an act that causes dirtiness in the self and soul of someone who does it and that action comes from the devil. Satan always tries to pollute the human soul and self. 2. The commandment to stay away from lying words and carrying out false testimonies. In this verse, the mention of false testimony and idol worship are simultaneously, because the two actions are essentially the same, all lie and deny the truth. From this verse it can also be understood how big a sin it is to bear false witness because it is mentioned after the prohibition against associating partners with Allah. In the hadith of the Prophet Muhammad, it is also explained that false testimony is as heavy as associating with Allah: From the Prophet that he prayed the dawn prayer, after he finished greeting, he stood up and faced people and said, \"A false testimony is as heavy as associating with Allah, a false testimony as heavy as associating with Allah, false testimony is as heavy as associating with Allah.\" (History of Ahmad, Abu Daud, Ibn Majah and ath-thabarani)"
		   },
		   {
			"id": 2626,
			"surah": 22,
			"ayat": 31,
			"tafsir": "This verse emphasizes that humans must stay away from idols and lying words by purifying obedience to Allah, not associating anything with Him. Then Allah explained about the magnitude of sin as a result of doing shirk. Whoever associates partners with Allah means he has destroyed himself, because the person who commits shirk will receive great calamity in this world and the hereafter, there is no hope of gaining salvation for himself. This verse is likening a person who commits shirk to a person who fell from a high sky, then his body was grabbed by wild birds flying in the sky, the birds fought over his body, so it was torn into pieces, then his flesh was eaten by the birds, or the body was blown up by the wind until it was thrown far away, some fell into the sea, some fell into a deep ravine and so on. Then there is nothing that can be expected anymore from that person, except to receive eternal misery and doom. Allah says: Verily, those who disbelieve and hinder (others) from the path of Allah, have indeed strayed as far as they can. (an-Nisa'\/4: 167) And the word of Allah: Say (Muhammad), \"Are we going to ask something other than Allah, which cannot benefit us and does not (also) bring harm to us, and (whether) we will turned back, after Allah has guided us, like a person who has been led astray by satan on earth, in a state of confusion.\" (al-An'am\/6: 71)"
		   },
		   {
			"id": 2627,
			"surah": 22,
			"ayat": 32,
			"tafsir": "Whoever respects the symbols of Allah, chooses a good, fat and large sacrificial animal, then in fact this is an act of a person who truly fears Allah and an act that originates from the heart of a person who is sincere about his obedience to Allah. In the hadith it is explained that the animals that are usually slaughtered by the companions. From Abu Umamah bin Sahal, \"We fatten the sacrificial animals in Medina, and the Muslims fatten them too.\" (Al-Bukhari) And the hadith of the Prophet Muhammad saw: From al-Bara, he said he had said the Messenger of Allah, \"Four types that cannot be found in sacrificial animals, namely those who are blind in one eye, those whose blindness is obvious, those who are sick and clearly sick , who is lame and clearly crippled and who has a broken leg, and who cannot clean himself (which is severe).\" (Narrated by al-Bukhari and Ahmad)"
		   },
		   {
			"id": 2628,
			"surah": 22,
			"ayat": 33,
			"tafsir": "In this verse it is emphasized that the sacrificial animal can be taken advantage of before being slaughtered, that is, it can be used as a vehicle on the way to the holy land, its milk can be drunk and so on. After being slaughtered, the fur can be used, the meat can be eaten, donated to the needy and the poor, as explained in the hadith of the Prophet saw: From Anas that the Messenger of Allah saw a herding a body (a fattened camel to be used as a sacrifice) then he said, \"Rise!\" The man answered, \"He is being fattened up for the sacrifice! So the Prophet said, \"Get on! Lose you!\" on the second or third. (Al-Bukhari and Muslim) The place where the sacrificial animals were slaughtered is in the area around the Haram or in the vicinity of the Kaaba. Allah said: O you who believe! Do not kill game animals while you are in ihram (hajj or umrah). Whoever among you kills him on purpose, then the penalty is to replace it with livestock commensurahte with the game he killed, according to the verdict of two fair people among you as hadyu brought to the Kaaba, or expiation (paying ransom by) feeding people -a poor person, or fasting, is balanced with the food that is issued, so that he feels the bad consequences of his actions. Allah has forgiven what was past. And whoever returns to work on it, surely Allah will punish him. And Allah is Mighty, has (the power to) torture. (al-Ma'idah\/5: 95) The purpose of being brought to the Kaaba according to the verse above is to bring it to the Haram area to be slaughtered there."
		   },
		   {
			"id": 2629,
			"surah": 22,
			"ayat": 34,
			"tafsir": "Allah has set the sharia for every human being including the sharia of sacrifice. Someone who sacrifices means he has shed animal blood to get closer to Allah and wants to seek Allah's pleasure. Allah commands those who make sacrifices so that they chant and glorify Allah's name when slaughtering the sacrificial animals, and that they are grateful for the blessings Allah has bestowed upon them. Among the blessings of Allah are livestock, such as camels, oxen, goats and so on which are sustenance and lawful food for them. From this verse it can be understood that believers are prohibited from exalting any name other than the name of Allah. After the arrival of the Prophet Muhammad as the last prophet who brought the message to all mankind, the only true religion that must be followed by all mankind is Islam which is based on the Qur'an and the sunnah of the Prophet Muhammad. Allah's Word: Indeed, the religion with Allah is Islam. There is no dispute among those who have been given the Book. (Ali 'Imran\/3: 19) More clearly, anyone who seeks or adheres to a religion other than Islam will not be accepted by Allah and will be among the losers. Allah's Word: And whoever seeks a religion other than Islam, he will not be accepted, and in the hereafter he will be among the losers. (Ali 'Imran\/3: 85) Rasulullah saw slaughtered the sacrificial animal by mentioning the name of Allah and saying takbir, as mentioned in his hadith: From Anas, he said, \"Rasulullah saw brought two good sheep (the two sheep had white mixed with black) with good horns, then he mentions the name of Allah and recites takbir (when slaughtering it) and puts his foot on the animal's rib.\" (History of al-Bukhari and Muslim) At the end of the verse it is emphasized that Allah, who has the right to be worshiped, is God Almighty, and the belief in monotheism was also shared by the ancients, therefore, obey and obey only Allah, follow all the commandments His commands, stay away from all His prohibitions and do all work solely for His sake and to seek His pleasure. Allah ordered the Prophet Muhammad to convey the good news to those who submit, obey, obey, repent and humble themselves to Him that a double reward is provided for them, in the form of heaven in the hereafter. The words \"then your God is God Almighty\" warns that sacrifice, respecting the symbols of Allah, and worshiping according to the instructions of the apostles sent to them, even though the worship and the Shari'a are different for each community, but included in the religion of Allah, including the straight path that must be taken by anyone who claims to be a servant of Allah, in obeying and seeking His pleasure. Differences in the ways of worship between people who were before and people who came later, including the people of the Prophet Muhammad, should not be used as an excuse that can cause divisions among believers. Everything was done with the aim of serving oneself to God Almighty."
		   },
		   {
			"id": 2630,
			"surah": 22,
			"ayat": 35,
			"tafsir": "This verse mentions the signs of a person who obeys and obeys Allah, namely: 1. When Allah's name is mentioned before them, their hearts tremble, because they feel His greatness and power. Hearing the name of Allah, a sense of hope and fear arose in their hearts. They hope for His pleasure, as they also hope for the forgiveness and reward that Allah provides for those who are pious. They really wanted to be included in the group of pious people. They are afraid to hear the name of Allah, because they have not had sufficient preparation to face Him, such as the worship they have done, the good deeds and jihad they have done, all of which they feel have not done enough, therefore they are afraid of Allah's punishment, which will fall upon the disbelievers. They want to avoid that torment. 2. They are patient in facing all trials from God. When they receive a lot of sustenance and gifts from Allah, they remember that in their assets there are the rights of the needy and the poor, therefore they issue zakat and alms. When they become poor, they realize that it is a test of their faith, therefore poverty does not shake their faith in the slightest. They believe that trials from Allah come in many forms and varieties, some are in the form of pleasure and some are in the form of misery. Only a servant of Allah who is patient and steadfast will get good luck. 3. They always offer prayers which are obligatory upon them at predetermined times. 4. They spend part of the sustenance that Allah has bestowed upon them. The act of giving away the treasure they did solely to seek the pleasure of Allah."
		   },
		   {
			"id": 2631,
			"surah": 22,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains that He created the camel to be used by humans and made the camel one of the symbols of Allah by slaughtering it as a sacrificial animal to get closer to Allah. Then He rewards those who sacrifice with multiple rewards in the hereafter. According to Imam Abu Hanifah, who came from the opinion of Atha' and Sa'id bin Musayyab from the tabi'in group, what is meant by \"Budna\" referred to in the verse is a camel or a cow. This opinion is also reinforced by the opinion of Ibn Umar that there is no known meaning of \"badanah\" (mufrad budna) apart from the meaning of camels and cows. A camel or an ox can be sacrificed by seven people based on the hadith of the Prophet Muhammad: Jabir ra said, \"We performed the pilgrimage with the Messenger of Allah, so we sacrificed a camel for seven people and a cow for seven people.\" (Muslim history) If someone does not get a camel\/cow, he may replace it with seven goats based on the hadith: \"From Ibn 'Abbas ra that the Prophet saw someone visited him, he said, \"Indeed it is obligatory for me to slaughter a camel\/cow, while I someone who can do it, but I didn't get it for me to buy. So the Messenger of Allah ordered him to buy seven goats, then he slaughtered them.\" (Ahmad and Ibn Majah's history with valid sanad) Allah commanded to mention Allah's name when slaughtering them. From this verse it can be understood that it is unlawful to mention names other than Allah when slaughtering them. If the sacrificial animal has been slaughtered, has collapsed and is believed to have really died, then skin it, eat some of the meat, and give some of it to the poor who ask and those who do not ask because they are ashamed to do so. Of course, giving the whole (meat) is is better and the reward is greater. The ignorant Arabs did not want to eat the meat of the sacrifice they had slaughtered, so in this verse Allah allows the Muslims to eat the meat of their sacrifice. Thus Allah has made it easy for believers to control the sacrificed animal, even though the beast is stronger than them. That can be done n lessons so that humans are grateful to Allah for the blessings that have been bestowed upon them."
		   },
		   {
			"id": 2632,
			"surah": 22,
			"ayat": 37,
			"tafsir": "Allah reaffirms the purpose of sacrifice, is to draw closer to Allah and seek His pleasure. Closeness to Allah and His pleasure will not be obtained from the meat of the animal being slaughtered nor from the blood that has been shed, but all of this will be obtained if the sacrifice is made with sincere intentions, done solely for Allah and as a gratitude for the countless blessings that He has bestowed upon His servants. Mujahid said, \"The Muslims once intended to imitate the actions of the polytheists of Mecca. When they slaughtered sacrificial animals, they spread the meat of the animals around the Kaaba, while their blood was smeared on the walls of the Kaaba with the intention of seeking God's pleasure.\" the god they worship. With the revelation of this verse, the Muslims abandoned that intention.\" Allah also emphasized that He has made it easy for human sacrifice animals, easy to get, easy to control, and easy to slaughter. With this convenience, humans should be more grateful for the blessings that Allah has bestowed upon them and glorify Him because of the instructions He has given. At the end of this verse, Allah commands the Messenger of Allah to convey good news to those who believe and do good deeds, as well as those who make sacrifices sincerely that they will receive His pleasure and grace. In the previous verse Allah ordered to say His name when slaughtering the sacrificial animal, while in this verse Allah commands to recite the takbir when slaughtering the sacrificial animal. Most commentators collect these two readings, namely by saying the name of Allah and saying takbir. The words spoken were: In the name of Allah, Allah is the Greatest, from You and for You! The reason of the mufasir is the hadith of the Prophet Muhammad. From Jabir bin Abdillah, he said, \"The Prophet saw slaughtered on the day of sacrifice two lambs which had sharp horns and were white and black in color. who created the heavens and the earth in a state of inclination towards the true religion,\" to the point of saying, 'and I am the first to surrender. O Lord! From You to You, from Muhammad and his people, in the name of Allah and Allah is Greatest, then he slaughtered it.\" (History of Abu Dawud)"
		   },
		   {
			"id": 2633,
			"surah": 22,
			"ayat": 38,
			"tafsir": "This verse implies that believers always face trials and obstacles from the enemies of Allah and those who want Allah's religion to disappear from the face of the earth. Despite this, Allah still defends the believers by strengthening their hearts, steadying their steps to follow the straight path that Allah has laid out, and strengthening their patience and fortitude. Allah's guarantee of His defense of the believers is confirmed in His words: Allah has decreed, \"I and My messengers will surely win.\" Truly, Allah is Powerful, Mighty. (al-MujaLAH\/58: 21) Because it is obligatory upon those who have faith who have been helped by Allah, to defend and uphold Allah's religion, as a sign of gratitude for His help. Allah defends those who believe because they have kept their promise to uphold Allah's religion, therefore, Allah hates traitors and disbelievers who have betrayed Allah's promises that He has established, as explained in the word Allah: And (remember) when your Lord brought out from the sulbi (spine) the children and grandchildren of Adam their descendants and Allah took testimony against their spirits (while saying), \"Am I not your Lord?\" They replied, \"Yes (You are our God), we testify.\" (We did that) so that on the Day of Resurrection you would not say, \"Indeed, at that time we were negligent of this.\" (al-A'raf\/7: 172) They deny Allah's commandments and ignore His prohibitions, deny Allah's verses, so that they are not ignored by Allah in the hereafter, Allah believes: Indeed, those who hide what which Allah has sent down, namely the Book, and sells it at a cheap price, they only swallow the fire of hell into their stomachs, and Allah will not greet them on the Day of Resurrection, and will not purify them. They will get a very painful punishment. (al-Baqarah\/2: 174)"
		   },
		   {
			"id": 2634,
			"surah": 22,
			"ayat": 39,
			"tafsir": "This verse allows believers to fight unbelievers, if they have done wrong on earth, persecuted believers and opposed the religion of Allah. Since the Prophet Muhammad delivered his message and preached to the Quraysh, since then the attitude of the polytheists of Mecca has changed towards the Prophet and his companions. At first they thought of Muhammad as someone who could be trusted, a just person who could resolve matters that occurred between them fairly. But after the Prophet Muhammad delivered his message, they then threatened, hurt and carried out actions that were detrimental to the Prophet saw, his companions and so on. Once they also pelted the Prophet with animal dung and abused his companions, so that the suffering experienced by the Prophet and his companions was almost unbearable. The Companions once complained about this to the Prophet and begged him to allow them to repay the actions of the disbelievers. The Messenger of Allah tried to calm and be patient with the hearts of his friends, because there were no orders from Allah or verses that were revealed to hold resistance and defend themselves. As the days passed, the suffering became more and more severe and to avoid clashes with unbelievers, the Muslims had migrated several times, such as migrating to Habasyah, to Taif, where the Prophet and his companions migrated together to Medina. After the Muslims migrated to Medina, then verses came down which ordered the Muslims to fight those who persecute believers and try to destroy the religion of Islam. This verse is the first verse that was revealed which relates to the command to fight. The second verse related to the command to fight is that it is permissible for Muslims to fight non-believers but in a limited manner, namely: And fight in the way of Allah those who fight you, but do not transgress. Indeed, Allah does not like those who transgress. (al-Baqarah\/2: 190) The third verse of the command to fight is: Fight those who do not believe in Allah and the Last Day, those who do not forbid what Allah and His Messenger have forbidden and those who do not believe in the true religion (God's religion), (namely people) who have been given the Book, until they pay the jizya (tax) obediently while they are in a state of submission. (at-Taubah\/9: 29) dhahhak said, \"The companions asked permission from Rasulullah saw to fight the unbelievers who hurt them in Mecca, then verse 38 of this surahh was revealed. After moving to Medina, this verse 39 was revealed, which is the qital verse that was first revealed. With this verse the Muslims are allowed to fight. This verse was revealed after Allah forbade the believers to fight for a long time and after the Messenger of Allah tried several times to be patient, and restrain the spirits of the believers in facing all kinds of actions disbelievers who offend them. Therefore it can be concluded that permission to fight is given to Muslims, if war is the only way out for difficulties that cannot be overcome. In other words: That war is permissible for to defend oneself and to uphold and defend Allah's sentence.Verily Allah Almighty defends and wins people who believe, without doing any war and without experiencing misery and suffering. However, Allah wants to test the hearts of His believing servants, to what extent is their steadfastness and patience in facing Allah's trials, to what extent is their obedience and obedience in carrying out Allah's commands. How many people who were originally thought to have good faith, but after experiencing just a little trial, they are back to being disbelievers. With the command of jihad, there is an opportunity for believers to obtain the greatest reward from Allah, namely the reward provided for those who die martyrs in defending Allah's religion."
		   },
		   {
			"id": 2635,
			"surah": 22,
			"ayat": 40,
			"tafsir": "In this verse Allah explains the condition of those who are allowed to fight, because the polytheists of Mecca have committed inhumane acts against the Muslims. They are tortured, abused, hurt and so on, not because of any mistakes or crimes they have committed, but solely because they have believed that there is no God who has the right to be worshiped, other than God Almighty. They no longer believe in the beliefs of their ancestors. They have surrendered to Allah the Almighty God and they have become Muslims. The actions of the polytheists of Mecca towards the Muslims are explained in the word of Allah: \"... they expelled the Apostle and you yourself because you believe in Allah, your Lord...\" (al-Mumtahanah\/60: 1) The suffering and tribulations experienced by the Prophet and the Companions because they believe in Allah, the apostles and their people who were sent first also experienced this. Allah said: And the disbelievers said to their messengers, \"We will certainly expel you from our country or you will really return to our religion.\" (Ibrahim\/14: 13) Those who were allowed to fight had previously been expelled by the polytheists from their hometowns, had been tortured and hurt for no good reason. If the actions of the polytheists were allowed to continue, their tyranny would surely increase, the longer they go crazy over power, they will destroy the monasteries, churches, houses of worship and mosques in which the name of Allah is called and glorified. Therefore, Allah has decreed in His religion that every believer is prevented from worshiping his Lord, defending his religion, fighting in the cause of Allah, but defending the truth, rejecting falsehood and tyranny. In essence, the war that occurs is a war between the right and the wrong, a war between people who have received guidance from Allah and those who deny that guidance. A war like that is a war whose goal is to build human life, namely a prosperous world life that pleases God and a happy and eternal ukhrawi life. This verse also implies that every Muslim group has a mosque built by the members of that group. Inside the mosque, Allah's name is glorified, congregational prayers are held at all times, the life and lives of the Muslims are discussed, the mosque is made a place of gathering and a place for deliberations. In this verse Allah strengthens the command to fight in the verse above, by giving orders and promises. What Allah has ordered is for the Muslims to help and defend Allah's religion, to wage jihad and carry out Allah's commands. What is promised is that whoever defends Allah's religion, he is entitled to Allah's help, in the form of victory and reward in the hereafter. Allah said: And it is Our right to help those who believe. (ar-Rum\/30: 47) He will definitely keep God's promise, because He is Almighty and Mighty. Allah said: O you who believe! If you help Allah (religion), He will help you and strengthen your position. (Muhammad\/47: 7) At the beginning of the verse above Allah promises victory for those who believe. Then at the end of the verse, Allah confirms again that the victory must be obtained by those who believe. In the beginning, the Muslims did not believe in the truth of the promise, so the second statement needed to be strengthened. The aim is to calm and reassure the heart, to strengthen one's stance at a time when Muslims are being tested by Allah. At the end of the verse Allah fulfills the promise He has promised to those who believe. He is almighty and does everything and no one can prevent something from His will from happening. Allah said: And indeed, Our promise has been fixed for Our slaves who are messengers, (namely) they will surely receive help. And verily it is Our army that will surely win. (ash-shaffat\/37: 171-173)"
		   },
		   {
			"id": 2636,
			"surah": 22,
			"ayat": 41,
			"tafsir": "Then Allah describes the characteristics of those who were expelled from their hometowns without a valid reason. They are the companions of the Prophet Muhammad, to whom Allah has promised victory. If they have won the victory, they will not be like the polytheists and people who are crazy about power, but they will continue to carry out: 1. Pray at every appointed time according to what Allah has commanded. They truly believe that prayer is the pillar of religion, is a direct link between Allah and His servants, purifies the soul and body, prevents humans from committing heinous and unjust acts and is the true manifestation of piety. 2. They pay zakat. They believe that in the assets of the rich there are the rights of the poor and the poor. Therefore, they pay zakat not because they love the poor and needy, but solely to give up the rights of the poor and poor contained in their assets. If they are appointed as rulers, they try to ensure that the rights of the needy and poor really reach their hands. 3. Commands to order people to do good and prevent wrongdoing. They encourage people to do good deeds, lead people along the straight path that God has laid out. They really hate people who used to violate Allah's prohibitions. God's promise is so true. They obtained the promised victory. They are ordained by Allah as caretakers of worldly affairs and leaders of religious communities well. In a short time the Muslims have been able to control areas outside the Arabian Peninsula. Their actions are in accordance with the word of Allah: You (Muslims) are the best people born for humans, (because you) command (do) what is good, and prevent what is wrong, and believe in Allah. If the People of the Book had believed, it would have been better for them. Among them there are those who believe, but most of them are wicked people. (Ali 'Imran \/ 3: 110)"
		   },
		   {
			"id": 2637,
			"surah": 22,
			"ayat": 42,
			"tafsir": "These verses are antidote to the hearts of the Prophet Muhammad and the hearts of his companions who were in trouble and distress due to the arbitrary actions committed by the polytheists of Mecca against them. It is as if Allah said to the Prophet Muhammad, O Muhammad, if the polytheists of Mecca belie you, do not heed you, even oppose your call, do mischief on earth, hurt and torture your companions in various ways, do not grieve, do not give up and strengthen your heart in facing them, because the ancients also denied the apostles who were sent to them, but I give help to them, so that the victory is on them. Allah said: So that when the apostles have no more hope (about the faith of their people) and have believed that they have been lied to, come to them (the apostles) is Our help, then those whom We want are saved. And Our punishment is not averted from sinners. (Yusuf\/12: 110) Thus Nuh as was lied to by his people, they threatened and disobeyed him, including his own son. Prophet Hud was belied by his people, namely the people of 'Ad, Prophet Saleh by his people, namely the people of Samud, as well as Ibrahim, Lut, Syu'aib. All of them were lied to by their people, hurt and tortured, but they remained steadfast and patient. The more severe the torture and opposition from his people, the stronger their faith became. Finally the victory was on their side. Musa had been lied to by Pharaoh and his people, they did not believe all the miracles that Moses showed, even though they could not beat Musa as or bring miracles like the miracles of Prophet Musa. Because they still deny, the sunnah of Allah applies to them, namely Allah helps those who believe and destroys all the disbelievers who disobey Him, at the time He determines. Pay attention to the history of the ancient peoples who opposed the apostles who were sent to them, in the end all were struck by a terrible calamity, so that the pride, joy and pleasure that were in them turned instantly into incomparable sorrow and misery. Then after experiencing that terrible catastrophe, in the afterlife they will be overwritten by a painful doom. Changing a luxury and pleasure into a misery and suffering, a victory turned into a defeat in a very short time is very easy for Almighty and All-Wise God to do. Allah said: Indeed, the punishment of your Lord is very severe. (al-Buruj\/85: 12) And the word of Allah: And thus will your Lord punish you when He torments (the inhabitants of) countries that do wrong. Truly, His torment is very painful, very heavy. (Hud\/11:102)"
		   },
		   {
			"id": 2638,
			"surah": 22,
			"ayat": 43,
			"tafsir": "These verses are antidote to the hearts of the Prophet Muhammad and the hearts of his companions who were in trouble and distress due to the arbitrary actions committed by the polytheists of Mecca against them. It is as if Allah said to the Prophet Muhammad, O Muhammad, if the polytheists of Mecca belie you, do not heed you, even oppose your call, do mischief on earth, hurt and torture your companions in various ways, do not grieve, do not give up and strengthen your heart in facing them, because the ancients also denied the apostles who were sent to them, but I give help to them, so that the victory is on them. Allah said: So that when the apostles have no more hope (about the faith of their people) and have believed that they have been lied to, come to them (the apostles) is Our help, then those whom We want are saved. And Our punishment is not averted from sinners. (Yusuf\/12: 110) Thus Nuh as was lied to by his people, they threatened and disobeyed him, including his own son. Prophet Hud was belied by his people, namely the people of 'Ad, Prophet Saleh by his people, namely the people of Samud, as well as Ibrahim, Lut, Syu'aib. All of them were lied to by their people, hurt and tortured, but they remained steadfast and patient. The more severe the torture and opposition from his people, the stronger their faith became. Finally the victory was on their side. Musa had been lied to by Pharaoh and his people, they did not believe all the miracles that Moses showed, even though they could not beat Musa as or bring miracles like the miracles of Prophet Musa. Because they still deny, the sunnah of Allah applies to them, namely Allah helps those who believe and destroys all the disbelievers who disobey Him, at the time He determines. Pay attention to the history of the ancient peoples who opposed the apostles who were sent to them, in the end all were struck by a terrible calamity, so that the pride, joy and pleasure that were in them turned instantly into incomparable sorrow and misery. Then after experiencing that terrible catastrophe, in the afterlife they will be overwritten by a painful doom. Changing a luxury and pleasure into a misery and suffering, a victory turned into a defeat in a very short time is very easy for Almighty and All-Wise God to do. Allah said: Indeed, the punishment of your Lord is very severe. (al-Buruj\/85: 12) And the word of Allah: And thus will your Lord punish you when He torments (the inhabitants of) countries that do wrong. Truly, His torment is very painful, very heavy. (Hud\/11:102)"
		   },
		   {
			"id": 2639,
			"surah": 22,
			"ayat": 44,
			"tafsir": "These verses are antidote to the hearts of the Prophet Muhammad and the hearts of his companions who were in trouble and distress due to the arbitrary actions committed by the polytheists of Mecca against them. It is as if Allah said to the Prophet Muhammad, O Muhammad, if the polytheists of Mecca belie you, do not heed you, even oppose your call, do mischief on earth, hurt and torture your companions in various ways, do not grieve, do not give up and strengthen your heart in facing them, because the ancients also denied the apostles who were sent to them, but I give help to them, so that the victory is on them. Allah said: So that when the apostles have no more hope (about the faith of their people) and have believed that they have been lied to, come to them (the apostles) is Our help, then those whom We want are saved. And Our punishment is not averted from sinners. (Yusuf\/12: 110) Thus Nuh as was lied to by his people, they threatened and disobeyed him, including his own son. Prophet Hud was belied by his people, namely the people of 'Ad, Prophet Saleh by his people, namely the people of Samud, as well as Ibrahim, Lut, Syu'aib. All of them were lied to by their people, hurt and tortured, but they remained steadfast and patient. The more severe the torture and opposition from his people, the stronger their faith became. Finally the victory was on their side. Musa had been lied to by Pharaoh and his people, they did not believe all the miracles that Moses showed, even though they could not beat Musa as or bring miracles like the miracles of Prophet Musa. Because they still deny, the sunnah of Allah applies to them, namely Allah helps those who believe and destroys all the disbelievers who disobey Him, at the time He determines. Pay attention to the history of the ancient peoples who opposed the apostles who were sent to them, in the end all were struck by a terrible calamity, so that the pride, joy and pleasure that were in them turned instantly into incomparable sorrow and misery. Then after experiencing that terrible catastrophe, in the afterlife they will be overwritten by a painful doom. Changing a luxury and pleasure into a misery and suffering, a victory turned into a defeat in a very short time is very easy for Almighty and All-Wise God to do. Allah said: Indeed, the punishment of your Lord is very severe. (al-Buruj\/85: 12) And the word of Allah: And thus will your Lord punish you when He torments (the inhabitants of) countries that do wrong. Truly, His torment is very painful, very heavy. (Hud\/11:102)"
		   },
		   {
			"id": 2640,
			"surah": 22,
			"ayat": 45,
			"tafsir": "This verse explains that many countries have been destroyed by Allah, because their inhabitants have associated partners with Allah, have caused corruption on earth and have been unjust. Many lands were ravaged in ruins, the roofs of their houses caved in, and then the ruins of their walls were overwritten. Many wells are no longer used by their owners because the owners have died or perished along with the destruction of those countries, because of their disobedience to Allah. Likewise, many towering palaces and palaces have become empty, uninhabited, because their arrogant and arbitrary inhabitants have been destroyed. All of that for them is the reward for their rebellion and ferocity and becomes a valuable lesson, for humans who come later, who want to get happiness in this world and in the hereafter."
		   },
		   {
			"id": 2641,
			"surah": 22,
			"ayat": 46,
			"tafsir": "The polytheists of Mecca who denied the verses of Allah, and denied the call of the Prophet Muhammad saw, in fact they often traveled between Mecca and Syria, as well as to the countries around the Arabian Peninsula. They brought merchandise on their way to see the ruins of the lands of the peoples who had previously been destroyed by Allah, such as the former lands of the 'Ad people and the Samud people, the former ruins of the land of the people of Lut and the Shu'aib people and so on. The polytheists of Mecca had also heard the tragic story of the disobedient people. Did they not think about and think about all these incidents and incidents that their actions of denying Muhammad's call and torturing the companions were the same as the actions of the ancient peoples towards the apostles who were sent to them? If the actions are the same, of course the consequences will be the same, that is, they will receive severe calamity and punishment from Allah. Almighty God does whatever He wills, no one can stop him. Seeing the attitude of the polytheists of Mecca, it turns out that their eyes are not blind, because they can see the traces of the ruins of the land of the rebellious people, but in fact it is their hearts that are blind, have been closed to accept the truth. What closes their hearts is the influence of their customs and beliefs from their ancestors. Therefore they feel jealous of the Prophet Muhammad and his companions, so that they can no longer think and contemplate all kinds of sad events that have happened and befell the previous peoples."
		   },
		   {
			"id": 2642,
			"surah": 22,
			"ayat": 47,
			"tafsir": "In this verse, Allah explains that the Meccan polytheists who denied Allah's verses, denied the Prophet Muhammad's call, did not believe in the existence of the Day of Judgment, they asked Prophet Muhammad saw to inflict on them the punishment that had been inflicted on the people of Mecca. ancient people. They did this request, because they were sure that the punishment would not come. Their request was answered by Allah that the punishment they asked for would surely come, because that is Sunnatullah. God will never deny His promise. It's just that the punishment was inflicted on them at the time that God had determined, not according to the time they wanted. Only Allah knows the time of the coming of the punishment, as the time of the coming of the punishment on the earlier people, which came suddenly, without anyone knowing where and when it came. As Allah says: So do the inhabitants of the land feel safe from Our torment which comes at night when they are sleeping? Or do the people of the land feel safe from Our torment that comes in the morning when they are playing? (al-A'raf\/7: 97-98) If the Meccan polytheists feel that a long time has passed, but the promised punishment has not yet come, so they think that the punishment will not come again, then they should remember that a thousand years according to their feelings is equal to a day with Allah. Therefore, they should remember that God must keep His promise after a long time according to their feelings. God slowing down the arrival of doom does not mean that He has violated the promises He has promised. Scientifically, this verse implies the concept of relativity of time. A concept introduced by Albert Einstein through the Theory of Relativity. Previously, for almost 200 years, the world of physics was dominated by Newtonian physics which stated that time is constant; one hour is the same everywhere under any circumstances. The following example will illustrate the concept of constant time. For example, Hamza and Wildan have matched the time on their watches. Then, using a plane that has a high speed, close to the speed of light, Hamzah left Wildan. After an hour (according to his watch) Hamza returned from his trip and met Wildan. So, Newton would say that even Wildan would feel that he had been waiting for Hamza for an hour. Wildan's watch will show the same time as Hamzah's. Einstein would not agree with this. According to him, time is relative, depending on the moving speed of someone or something. If Hamzah, who is moving at speeds close to the speed of light, feels that he has left Wildan for an hour (according to the watch on his hand), then Wildan's watch will show that Hamzah has been gone for 10 hours. If Hamza leaves at 8 am, then when he comes back, Hamza's watch will show 9 am, while Wildan's watch will show 6 pm or 6 pm. Likewise, if at the time Hamza and Wildan were both 20 years old, then Hamza traveled from Wildan at a speed close to light for 5 years (according to Hamzah's time), then when they met, Hamzah would be 25 years old, while Wildan was already 20 years old. 70 years. Thus time is relative. The Qur'an has hinted at this since 14 centuries ago. Allah arranges affairs from heaven to earth and back to heaven with such great speed that all this lasts only one day which is equal to 1000 years according to our calculation of time. This relativity of time is also found in as-Sajdah\/32:5; al-Ma'arij\/70: 4. In this verse, one day is equivalent to 50,000 years. This could happen, depending on the movement speed of the angel."
		   },
		   {
			"id": 2643,
			"surah": 22,
			"ayat": 48,
			"tafsir": "Allah does everything according to His will and wisdom. Meanwhile, humans must also remember one of God's characteristics, that is, He does not immediately punish His sinful servants before giving them the opportunity to repent by believing and doing good deeds. If the opportunity to repent is not also used by His servants, then they will be overwritten by the promised punishment. Because of that, how many countries where the inhabitants act unjustly, after a while, they don't repent, they even become more unjust, so Allah inflicts punishment on them suddenly from a direction they don't know. Humans should remember that everything in this universe belongs to God, including what is in it, everything will return to God. When they return to Him, all their deeds will be weighed, good deeds will be rewarded with heaven full of pleasure, while bad deeds and evil deeds will be rewarded with a fiery hell."
		   },
		   {
			"id": 2644,
			"surah": 22,
			"ayat": 49,
			"tafsir": "Allah ordered the Prophet Muhammad to convey to those who asked for the punishment to be hastened that it was not the task of the apostles to inflict the punishment. The task of the apostles is only to convey God's warnings and threats to humans, including themselves. The task of the apostles is also to convey that the actions that have been carried out by the polytheists have brought them to the threshold of the threatened doom. The apostles are not authorized to judge the deeds of servants because the one who gives taufik and guidance is only Allah himself. Allah said: It is not your duty (Muhammad) to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272) If Allah wanted to inflict the promised punishment, He would have done it, and doing it was easy for Him, therefore, do not ever ask the messenger to hasten or postpone the punishment, because everything it is the authority of God. With the delivery of threats and warnings, people whose hearts are open to receiving God's guidance, have the opportunity to avoid themselves from God's punishment that is threatened, namely by doing everything that God commands, stopping everything that is prohibited and trying to erase all his sins by doing good deeds. pious. If they remain in disbelief, surely Allah will carry out His threat by inflicting a painful punishment on them whenever desired."
		   },
		   {
			"id": 2645,
			"surah": 22,
			"ayat": 50,
			"tafsir": "In this verse Allah explains the form of warnings and threats by mentioning good rewards for those who believe, and threats of punishment for those who disbelieve. Those who believe in the true sense and the embodiment of their faith is seen in their actions of doing good deeds, then Allah will forgive all their sins, repay their good deeds with multiple rewards and glorious sustenance. In the afterlife they will be put into heaven, a place where they will get everything they want, as Allah says: Enter you into heaven, you and your partner will be overjoyed. Gold plates and cups are passed around them, and in Paradise there will be whatever the heart desires and all that is pleasing to the eye. And you stay in it. (az-Zukhruf\/43: 70-71) Even in the hadith it is explained that in heaven there is pleasure and happiness that humans have never felt while living on earth as Allah says in the hadith qudsi: In heaven there are things that have never been seen eye, and what no ear has heard, and what has never entered the human heart. (History of ath-thabrani)"
		   },
		   {
			"id": 2646,
			"surah": 22,
			"ayat": 51,
			"tafsir": "As for those who continue to try to oppose the apostles, want to destroy Islam and the Muslims, they will be put into the fire of hell, and that is the worst place that Allah has prepared for them, Allah says: Those who disbelieve and prevent (people) from way of Allah, We add to them torment after torment because they always do mischief. (an-Nahl\/16: 88)"
		   },
		   {
			"id": 2647,
			"surah": 22,
			"ayat": 52,
			"tafsir": "In this verse Allah warns the believers of the efforts made by satan; both the devil in the form of a jinn, and the devil in human form to lead people astray from the way of Allah. Among the efforts of the devil is when the Apostle talks about Allah's verses, or explains and conveys the Shari'a that he brought to his companions, then the demons wake up and try to instill into the hearts of the listeners a wrong tafsir, so that they believe that the verses or shari'a conveyed by the Apostle did not come from Allah, but were merely the sayings of the Apostle, which were fabricated to convince people of his prophethood and apostleship. There are also some of the demons who insert wrong tafsirs of these verses, so that without the listeners realizing it, they have deviated from their own tafsir of the true meaning of the verses. Satan's efforts were not only carried out on the Al-Qur'an and the traditions of the Prophet, but also on religion and holy books that were sent down to the apostles. Satan's efforts there are successful. If studied in earnest the history of religion brought by the apostles and the history of the holy books that Allah revealed to them. Many things have been inserted by Satan into these religions that can lead people astray from the way of Allah. What has been inserted is not only something that is light and not a principle, but many have succeeded in inserting something that can change the principles and substance of that religion, Allah says: They like to change the word (of Allah) from its place, and they (deliberately) forget some of it. the message they had been warned about. You (Muhammad) will always see betrayal from them except for a small group of them (who do not betray). (al-Ma'idah\/5: 13) The religion revealed by Allah to the earlier messengers which had been interfered with by the deeds of Satan, among them the religion of the Prophets Abraham, Prophet Musa, Prophet David and Prophet Isa as. In the history of the Muslims after the Prophet Muhammad and his closest companions passed away, it is clear that attempts to undermine and change the religion of Islam, although attempts to change, add or subtract verses from the Al-Qur'an were not successful, because the Al-Qur'an and preserved by Allah, but they almost managed to include fake hadiths in the collections of the Prophet's traditions. In addition, they almost succeeded in interpreting the verses of the Qur'an with tafsirs or takwil that were far from the intended meaning of the Qur'an. In addition to their efforts to change the holy verses of the Qur'an, the hadith of the Prophet and Islamic law, they also try to destroy life and human life, such as if someone aspires to have something good in him, then the devil will bring it. in that person's self and mind there is an opinion or belief that it is difficult to obtain the desired goals, so that the person's self and will arises a feeling of fear and a feeling of not being able to achieve those good goals. Regarding the Al-Qur'an, there have been many attempts to imitate it, inserting wrong tafsirs and tafsirs into it, inserting superstitions and so on, but all of these attempts have failed. This is in accordance with Allah's guarantee for the maintenance of the Qur'an, Allah says: Verily, it is We who sent down the Qur'an, and surely We (also) will maintain it. (al-Hijr\/15: 9) If one pays attention to the history of the Qur'an, there are many ways that have been done to maintain the authenticity of the Qur'an, among which are: 1. During the time the Prophet was still alive, every verse Al-Qur'an was sent down he ordered to write down and memorize it. 2. Not long after the Prophet Muhammad died, the entire Qur'an was collected and written on sheets which were then bound and kept by Abu Bakr, after Abu Bakr's death was kept by Umar, then by Hafsah bint Umar. During Usman's time, the Koran written on these sheets was made into a book. The Qur'an is called \"Mushaf\". There were five mushafs written during Uthman's time. It was from the five mushafs that Muslims throughout the Islamic world at that time copied the Qur'an. 3. Encouraging and increasing the enthusiasm of knowledgeable people, so that they deepen their knowledge. With the ability of existing knowledge, they can maintain the purity of the Qur'an from all kinds of subhat and wrong tafsir. 4. From the time of the Prophet until now, there have always been people who memorized the entire Qur'an, so it was difficult to make insertions into it. Even the slightest typographical error in the verses of the Qur'an has elicited a strong reaction from among Muslims. In every period of Islamic history, there have always been scholars who were able to defend and defend Islamic teachings from attacks that came from outside Islam in various forms. At a time when there were many efforts to falsify hadith at the beginning of the second century Hijriyah, the Caliph Umar bin Abdul Aziz appeared. He tried to collect and record the hadiths of the Prophet which were still in the memory of the tabi'in, and some of them had been written down by the companions. He ordered officials in the regions and scholars to collect the hadiths of the Prophet in their respective areas. Among the scholars who wrote it was Imam az-Zuhri. So Imam az-Zuhri collected the hadiths of the Prophet. Even though at that time there had not yet been research and separation of which hadiths were fake and which were really from the Prophet, this effort was the foundation and basis for the efforts to be carried out by the Imams of hadith who would come later after the az generation. -Zuhri, such as Imam al-Bukhari, Muslim, an-Nasa'i, Abu Daud and others. It was these priests who conducted research on the hadiths that had been collected during the time of Caliph Umar bin Abdul Aziz. Similarly, Imam al-Asy'ari has succeeded in maintaining the purity of Islamic teachings from the influence of Greek philosophy which was widely studied by Islamic scholars at that time. Then al-Ghazali also succeeded in defending Islamic teachings from the strong teaching or influence of Neoplatonist philosophy. Ibn Taimiyah has cleared Islamic teachings from various misleading superstitions. Allah is All-Knowing of everything, including all forms of Satan's efforts to destroy and change Islamic teachings, everything that occurs in the human heart, everything that is visible and everything that is hidden. With His knowledge He paralyzed the deceptions of Satan who wanted to undermine His religion, then exacted retribution upon them."
		   },
		   {
			"id": 2648,
			"surah": 22,
			"ayat": 53,
			"tafsir": "Allah explains the various attempts of satans and their followers to deceive people by adding to the erroneous understandings in the verses of the Qur'an and in the religion of Islam. Their actions are a trial for humans, especially for those who believe, those who deny and go astray in their hearts and those who are hypocrites. Satan's temptations add error and cause disease in their hearts, so that their disbelief and hypocrisy increase. Meanwhile, those who have strong faith will not be deceived by Satan, every temptation of Satan that comes to them will strengthen their faith. On the other hand, those whose hearts have gone astray and have disease in them will deviate far from the right path, because it will be difficult for them to return to the right path. They can no longer expect Allah's pleasure and will not escape Allah's torment"
		   },
		   {
			"id": 2649,
			"surah": 22,
			"ayat": 54,
			"tafsir": "Allah does this so that knowledgeable people know and reflect on all kinds of laws that have been ordained by Allah, the main points of sunnatullah, all kinds of subhats and tafsirs of verses in the wrong way made by satan and his followers. With this knowledge and experience, it is hoped that their faith will increase, believing that the Qur'an really comes from God. as they believe that Allah guarantees the authenticity of the Qur'an from human intervention in it and from wrong tafsir. Therefore let those who have faith who have been able to distinguish between right and wrong, between faith and disbelief submit and surrender to Allah. Read the verses of the Qur'an seriously, carry out everything He commands, stop all His prohibitions, whether related to worship, muamalat, manners, laws and procedures for getting along in people's lives. Then it was emphasized that Allah will really give guidance and taufik to His servants who believe and follow all the messengers. The instructions and taufik that Allah has given to His servants are carried out in various ways. There is a direct way and there is also an indirect way, sometimes man himself realizes that he has received the instructions. In the history of the life of the Prophet Muhammad there were many times when Allah gave direct instructions to him. Among Allah's instructions to him were Allah's rebuke to the Prophet, when the Prophet committed an act that was considered inappropriate by the apostle, for example His rebuke to the Prophet for belittling a friend who asked him, the Prophet was busy with the Quraysh authorities. Among the examples are as follows: Imam Ibn Jarir narrated that Ibn Umm Maktum, a friend of the Prophet who was blind and poor. One day he came to the Prophet and he said, \"O Messenger of Allah, read and teach me what Allah has taught you.\" He repeated the words three times. When Ibn Ummi Maktum asked, Rasulullah saw was receiving the leader of Quraysh, namely Walid bin Mugirah and who was said to be an enemy of the Muslims, while Ibn Ummi Maktum did not see and also knew that Rasulullah SAW was busy receiving his guests. Because of that Rasulullah SAW was not happy with Ibn Umm Maktum's request, he turned sour and turned away from him. The Prophet's attitude toward Ibn Ummi Maktum was rebuked by Allah with His words: He (Muhammad) had a sour face and turned away, because a blind man had come to him (Abdullah bin Ummi Maktum). And do you know (Muhammad) maybe he wants to purify himself (from sin), or he (wants) to get teaching, which benefits him? As for the person who thinks he is self-sufficient (the dignitaries of Quraysh), then you (Muhammad) pay attention to him, even though there is no (reproach) upon you if he does not purify himself (faith). And as for those who come to you in haste (to get teaching), while he is afraid (of Allah), you (Muhammad) instead ignore him. Never (like that)! Indeed, (God's teachings) is a warning. ('Abasa\/80: 1-11) With Allah's rebuke, Rasulullah SAW became aware of his mistake, since then he has increased respect for his friends, including respect for Ibn Umm Maktum himself. God's rebuke is what distinguishes the position of the Prophet with ordinary people."
		   },
		   {
			"id": 2650,
			"surah": 22,
			"ayat": 55,
			"tafsir": "This verse explains the attitude of unbelievers towards the Qur'an, they do not believe in the Qur'an, even though evidence has come that the truth of the Qur'an is the word of Allah and not the creation of Muhammad. With Allah's rebuke to the Prophet who is not worthy of the above, the disbelievers remain in doubt and do not want to believe in Allah until the Day of Judgment or until the punishment comes to them."
		   },
		   {
			"id": 2651,
			"surah": 22,
			"ayat": 56,
			"tafsir": "Allah explained that when the Doomsday has come, then everything is in the hands of Allah. He was the one who reigned at that time and had the power to finish everything by giving proper recompense to humans, according to the deeds he had done while living on earth. Those who believe in the Qur'an, practice everything contained in it, believe in Muhammad as God's Messenger, practice his hadiths, carry out God's commands and stop His prohibitions, will be rewarded with a paradise full of pleasures. . They get what they want, feel happiness, pleasure that they have never felt while living in the world."
		   },
		   {
			"id": 2652,
			"surah": 22,
			"ayat": 57,
			"tafsir": "Those disbelievers who deny Allah's verses, insert wrong tafsirs and make doubts into His verses, proclaim that the Quran is the creation of Muhammad, they will be subject to a very severe punishment, incomparably harsh and the weight of it with the torment or calamity that has occurred as long as they live in the world."
		   },
		   {
			"id": 2653,
			"surah": 22,
			"ayat": 58,
			"tafsir": "This verse explains that all people who migrated in the way of Allah, left their hometowns, left their families and possessions, only to seek the pleasure of Allah, with the aim of upholding the religion of Islam with the Prophet Muhammad. Then they are killed in battle or die normally in such circumstances, then Allah will open up glorious sustenance for them in the hereafter. Some commentators are of the opinion that in essence people who are killed or die in a normal state while migrating to defend and defend Allah's religion are equally blessed with noble sustenance from Allah. That is what is meant by this verse, and it is also mentioned in the word of Allah: And whoever migrates in the way of Allah, surely they will find in this earth a place of migration that is wide and (sustenance) a lot. Whoever leaves his house with the intention of emigrating for the sake of Allah and His Messenger, then death befalls him (before arriving at the destination), then indeed, his reward has been fixed with Allah. And Allah is Forgiving, Most Merciful. (an-Nisa'\/4: 100) And in the hadith of the Prophet saw: From Salman al-Farisi he said, \"I have heard the Messenger of Allah say, \"Whoever dies in a state of duty (ready to fight in the way of Allah), he is given sustenance , and safe from all that slander him. And read by you if you wish (this verse).\" (History of Ibn Abi Hatim) From this verse it can also be determined the law, that if there is a good deed, in accordance with what is commanded by religion and done by several people, in carrying out the work there are people Muslims who die because of that work, and there are those who die normally while carrying out that work, then those people who die normally are given the same reward by Allah. what is meant by this noble sustenance, and when the sustenance is given. This will be explained in the next verse (verse 59). Then Allah explains that He is the best provider of sustenance. The meaning is that Allah gives sustenance to His servants , solely because of his affection for them, so he gives it infinitely to whomever He wills, without expecting anything in return from them. his servant."
		   },
		   {
			"id": 2654,
			"surah": 22,
			"ayat": 59,
			"tafsir": "Allah will include all those who were killed in His way and those who died in that state of hijrah into a paradise full of enjoyment in the hereafter, as a reward for what they have done. This is what is meant by sustenance in verse 58, and when does He give that sustenance. Allah explained that He knows all the deeds that have been done by those who emigrated, knows all the deeds they have done, both small and large, both visible and hidden. As Allah also knows the deeds of the wrongdoers. Even so, Allah does not immediately inflict punishment on the wrongdoers, because He is also Most Forbearing, Allah always gives opportunities for sinful people to repent and return to doing good deeds that are pleasing to Allah."
		   },
		   {
			"id": 2655,
			"surah": 22,
			"ayat": 60,
			"tafsir": "Thus, Allah will provide good sustenance and a paradise full of enjoyment to those who died in a state of migration and jihad in the way of Allah, in fighting their enemies. Then Allah emphasized the guarantee of His help to those who migrated and fought jihad, that is, who among the believers avenge the torment of the disbelievers, because they have been fought, then their enemies forced them to migrate away from their hometown, surely Allah will help them and will repay the deed back. Meanwhile, Allah is Forgiving, Most Merciful to His servants. Therefore, do not believe those who fight against their enemies who have surrendered and they should protect those who ask for protection from them. If the disbelievers let the Muslims practice their religion, do not disturb and harm them, Allah forbids fighting those disbelievers. Allah commands to forgive their mistakes, as Allah has forgiven the mistakes of those who believe. Allah says: And (for) those who, when they are treated unjustly, they defend themselves. And the recompense for an evil is a commensurahte crime, but whoever forgives and does good (to those who do evil), the reward will be from Allah. Indeed, He does not like unjust people. (asy-Shura\/42: 39-40)"
		   },
		   {
			"id": 2656,
			"surah": 22,
			"ayat": 61,
			"tafsir": "Providing help and guaranteeing victory for those who believe is a definite promise from Allah. Because He is in control of all things. Among the signs of His power, He in a summer causes the night to enter into the day, so the day becomes long, and in a winter season, he causes the day to enter into the night, so the night becomes long. In the equator, the difference between night time and day time is not so pronounced. But in the sub-tropics and the North or South polar regions, this difference is very visible. In winter the nights are very long, while in summer the days are longer than the nights. The verse above is one of the many verses in the Al-Qur'an which repeatedly reveal the events of the day and night. (QS 10:67, 16:12, 17:12, 21:33, etc.). And it happened solely because of His power which is reflected in the sound of the beginning of the verse. According to scientists, night and day are natural phenomena that occur because of the position of the earth which moves around the sun in a fixed trajectory \"almost circular\". Because of that, the earth is also spared from experiencing deadly extreme temperatures. The earth is round when it circles the sun while continuing to rotate on its axis. Night occurs on the part of the earth that is not illuminated by sunlight and day when the rest of the earth is exposed to sunlight. The night is dark and the day is light. Regarding the rotation (rotation) of the earth on its axis, the data shows that its speed is 1,670 km per hour. Compare that with the speed of bullets when released from modern weapons, which is 1,800 km per hour. How fast the earth rotates. Meanwhile, the speed of the earth's orbit towards the sun is 60 times the speed of a bullet, which is about 108,000 km per hour. At this speed an airplane will be able to circle the earth in just 22 minutes. The earth's rotation on its axis occurs once a day which according to the observations of experts is the right speed to produce moderate and comfortable temperatures for life on the earth's surface. And what is even more astonishing is that the large angle of the earth's axis of rotation has made it possible for 4 seasons to occur in the northern and southern hemispheres of the equator and only 2 seasons in areas that are located right on the earth's equator. This verse confirms the accuracy of the rotation which results in the regularity of the occurrence of day and night on earth,... It is impossible for the sun to find the moon and the night cannot precede the day, and each of them revolves in its orbit \"(Yasin\/ 36:40) With the regular and regular alternation of day and night, a decree of Allah to be a calculation of time for human life on earth. One round of day and night, Allah SWT determines 24 hours. This is what we know as a day count. One day is 24 hours. Meanwhile, one rotation of the moon (as the earth's satellite) that revolves around the earth takes 29 or 30 days. Or it is called a month. Meanwhile, the duration of the earth around or orbiting the sun for one full rotation takes 360 days, and is known as one year. this is the basis for compiling the calculation of time or the calendar, substituting night for day, and substituting day for night according to human standards It's harder to do than to give victory. Therefore giving victory to persecuted people is very easy for Allah to do. Allah hears all the prayers that the servant asks of Him and sees all the deeds that His servant does."
		   },
		   {
			"id": 2657,
			"surah": 22,
			"ayat": 62,
			"tafsir": "Such characteristics, namely perfect power, extensive and perfect knowledge, encompassing all kinds of knowledge are with Allah, because He is the One who is obligatory, definite, has all kinds of perfect characteristics, does not have the slightest flaw. He is the one who has the true religion, which was conveyed by the prophets and messengers he sent, the most recent being the Prophet Muhammad. He is the One and Only God, no one is a partner for Him. Therefore worshiping Him is a must, something that is most correct, so is His help, His promise is a right. Everything that is worshiped besides Allah is worship that is wrong, and worship is worship that has no basis. He has power to create whatever He wills. If He wants to create something, it is sufficient for Him to say, \"Be\". So that thing happened. Truly Allah is Most High, all is under Him and He is above all things. There is nothing that equals him in power, height and majesty and knowledge."
		   },
		   {
			"id": 2658,
			"surah": 22,
			"ayat": 63,
			"tafsir": "In this verse, Allah mentions the signs of His greatness which are also blessings that have been bestowed on humans, that is, do humans not see and notice that Allah spreads clouds, then from the clouds rain falls on the earth, the rain water fertilizes the earth, then various kinds of plants and vegetation appeared in beautiful shapes, as if the earth adorned itself with the growth of plants and herbs of various colors. Among those that grow are some that humans can eat, so that their survival is maintained, some can be used as clothing materials, beauty materials, and various other human needs. Verily, Allah is Most Extensive in His knowledge, because His knowledge encompasses all of His creatures. There is nothing that escapes His knowledge, from the small to the great, from the easy to the difficult and complicated that people sometimes don't know. Therefore Allah arranges, maintains the survival and continuity of the existence of His creatures. Then set the laws and provisions to govern His creatures. Regarding Allah's knowledge of His creatures, is explained in His words: Do not be unaware of the knowledge of your Lord, even if it is as small as a particle, whether in the earth or in the sky. There is nothing smaller or greater than that, but everything is recorded in a real Book (Lauh Mahfuz). (Yunus\/10: 61)"
		   },
		   {
			"id": 2659,
			"surah": 22,
			"ayat": 64,
			"tafsir": "Only Allah owns all that is in the heavens and all that is on earth, nothing is associated with Him in that ownership. Therefore only He also determines what He does to His creatures, there is nothing that hinders His will. He doesn't need anything, only His creatures need Him. He is Most Praised for the infinite kindness and favors that have been bestowed upon His creatures."
		   },
		   {
			"id": 2660,
			"surah": 22,
			"ayat": 65,
			"tafsir": "Among the blessings that Allah has given to His servants is that He subdues and makes it easy for humans to take advantage of everything contained in the earth and everything on its surface, so that it can be used for the benefit of life and human life. Humans were given the knowledge and ability to plant and fertilize plants, to dig up various kinds of minerals. Then God showed us how to use them all. Allah says: And He has subjected what is in the heavens and what is on the earth to you all (as mercy) from Him. (al-Jashiyah\/45: 13) Humans have been awarded by Allah a lot of knowledge. Sometimes some of them become arrogant and arrogant with the knowledge they have, let people remember that the knowledge that is given, is only a little when compared to Allah's knowledge that humans do not yet know. Human knowledge is nothing when compared to Allah's knowledge, as Allah says: And they ask you (Muhammad) about spirits. Say, \"The Spirit is in the business of my Lord, while you were given only a little knowledge.\" (al-Isra'\/17: 85) Thus Allah subdues and makes it easy for humans to control ships and seas. It makes it easy for ships to sail to the ocean, bringing people and human needs to all corners of the world. It is also with this ship that humans seek sustenance in the ocean in the form of fish, pearls, minerals and the treasures of the ocean in the form of countless fish. Allah created the universe, which consists of space and its innumerable planets. Everything floats and circulates through the orbit that God has determined. Each of these planets has an attraction, so it does not fall apart, unless Allah wills. Allah's Word: When the heavens are split open, and when the stars fall and scatter. (al-Infithar\/82: 1-2) All of this was not created by Allah by chance alone, but with a specific purpose, with neat and thorough laws and regulations. With these laws and regulations humans can benefit from them, they can fly in the universe, ascend to other planets, they can predict weather conditions. They can travel from one country to another in a short time, and many other benefits they can get by using God's provisions and laws. All of this shows God's love for man."
		   },
		   {
			"id": 2661,
			"surah": 22,
			"ayat": 66,
			"tafsir": "Among God's greatest blessings bestowed on humans is creating living humans from inanimate objects, giving spirits, souls, minds and feelings, so that humans can live and enjoy life, can cultivate the earth for their pleasure. With that soul, mind and feelings, humans can carry out God's commands and stop His prohibitions, so that in the hereafter they are again bestowed with the greatest, incomparable blessing, namely the heaven that He has promised. Even though there are so many blessings from Allah that have been bestowed on humans, few humans are grateful for Him, many of them even deny Him, and some even disobey Him and associate Him with other creatures. Allah says: How can you disbelieve in Allah, even though you (were) dead, then He gives you life, then He causes you to die and then He brings you back to life. Then to Him you will be returned. (al-Baqarah\/2: 28) And the word of Allah: Say, \"Allah who gives life to you and then causes you to die, after that gathers you on the Day of Resurrection which is beyond doubt; but most people do not know.\" (al-Jashiyah\/45: 26)"
		   },
		   {
			"id": 2662,
			"surah": 22,
			"ayat": 67,
			"tafsir": "Allah has sent messengers to every nation up to the time of the Prophet Muhammad. Each apostle brings a different Shari'a from the other messengers, according to the circumstances, place and time where the community is located so that they can carry out the Shari'a properly and in accordance with their abilities, benefits and necessities of life. The Torah was revealed to Musa as, which will be conveyed to the Children of Israel. The Israelites at that time were infected with materialism and a materialistic life. His life is based on material things. For him life is all things. When the Israelites left the Prophet Musa, that is, when he went up to the Tursina hill to receive the Torah, they made a golden calf to worship. The contents of the Torah give many instructions to humans about ways to develop themselves and the people so that they avoid materialism and materialistic life. Similarly, the Bible was revealed to the Prophet Isa as, giving many instructions on how to develop psychologically and spiritually, also according to the situation of the Jews at that time. In the end the Qur'an was revealed to the Prophet Muhammad. The Shari'a contained in the Qur'an is the Shari'a for all mankind until the end of time. In the Al-Qur'an there are many verses that give instructions to humans so that besides thinking about spiritual life they also think about worldly life, worldly life is a preparation for the afterlife. This is God's decree that applies to all mankind from ancient times until now. So the disbelievers should not oppose the call the Prophet Muhammad conveyed to them. Because of that Allah warned the Prophet Muhammad and his people not to be swayed by the challenges and defiance of the disbelievers. Keep doing da'wah, calling on them with wisdom and wisdom, inviting them to monotheism, which shows the happiness of life in this world and in the hereafter."
		   },
		   {
			"id": 2663,
			"surah": 22,
			"ayat": 68,
			"tafsir": "If those disbelievers oppose and deny the Prophet's message, even though evidence and statements have been conveyed to them that show the truth of the religion conveyed to them, then the Prophet Muhammad's task is to convey religion, not to make someone a disbeliever or a believer. . Everything belongs to God. Allah said: And if they (still) belie you (Muhammad), then say, \"For me is my work and for you is yours. You are not responsible for what I do and I am not responsible for what you do.\" (Yunus\/10: 41) Tell them that Allah knows better about what they are doing and will repay them for the work they have done in this world."
		   },
		   {
			"id": 2664,
			"surah": 22,
			"ayat": 69,
			"tafsir": "After Allah ordered in the previous verses that the Messenger of Allah turned away from the disbelievers, then in this verse Allah emphasized that Allah will determine the decision and the ruling on the Day of Judgment between those who are in dispute over the matter of religion, so that it is proven which one is right and which one is wrong. Those who believe they are patient, and strengthen their faith, according to the word of Allah: which Allah sent down and I was ordered to be fair among you (asy-Shura\/42: 15)"
		   },
		   {
			"id": 2665,
			"surah": 22,
			"ayat": 70,
			"tafsir": "This verse confirms to the Prophet Muhammad, about the vastness of Allah's knowledge. Even though the Prophet Muhammad is addressed but in this verse includes all his people. It was as if Allah had said to him, \"Don't you know, O Muhammad, that Allah's knowledge is very broad, encompassing everything in the heavens and everything that is on earth, there is nothing that escapes His knowledge, even though that thing is as big as a zarroh (atom) or even smaller than that atom, even He knows everything that happens in the human heart.\" All of Allah's knowledge is written in the Lawh Mahfuz, which is a book in which everything that exists is mentioned and that book already exists and is complete, has records before Allah created the heavens and the earth. According to Abu Muslim al-Ashfahni, what is meant by the book in this verse is the maintenance of something and its perfect recording. There is nothing that is not recorded in it. This is the knowledge of Allah. Very perfect knowledge and complete record of everything as well as the determination of the law which is used as material for court in the hereafter is not difficult for Allah to stipulate. He stipulates something in the hereafter as fairly as possible, because everything that is taken into consideration has been recorded by Him, nothing is lacking in the slightest."
		   },
		   {
			"id": 2666,
			"surah": 22,
			"ayat": 71,
			"tafsir": "Allah explains that the beliefs of the polytheists are wrong, both in terms of revelation, reasoning, and from the attitude of the polytheists themselves when they hear the verses of Allah. 1. The polytheists of Mecca worshiped other than Allah, by worshiping idols that they made themselves. Their belief is not based on the revelation that Allah sent down to His Messenger, even though a true belief is a belief based on revelation from Allah. Their belief is only based on the customs of their ancestors first, then they follow and believe it. 2. They worship other than Allah, that is not based on right thinking, and is not based on science. They made the idols they worshiped themselves. Therefore they will not find a helper who will help them to uphold their opinions and thoughts, or who will ward off their punishment in the hereafter. 3. When Allah's verses are read to them, signs of arrogance, arrogance and stubbornness appear in their faces, as well as angry words that arise in their hearts. When verses of the Qur'an are recited to them, they want to attack and beat those who are reciting the verses. If they wanted to seek the truth, they would have listened to the verses that were read, then they pondered and thought about it, and if there was something they did not like, they would have asked or looked for strong reasons to disprove the truth of Allah's verses. Then Allah threatens them that their hatred and anger for hearing Allah's verses is actually less than the pain of punishment they will feel later on the Day of Resurrection. Allah confirmed His threat to the polytheists by ordering the prophet Muhammad saw to tell them, \"O polytheists, do you want to hear bigger and more evil news from your anger towards those who read verses -the verses of Allah, so that you almost attacked and beat them?\" Then the question above was immediately answered, that the big and worse news than his anger was the punishment of hell which had been promised to unbelievers as a reward for their actions while living in the world. Hell is the worst place to return to for polytheists."
		   },
		   {
			"id": 2667,
			"surah": 22,
			"ayat": 72,
			"tafsir": "Allah explains that the beliefs of the polytheists are wrong, both in terms of revelation, reasoning, and from the attitude of the polytheists themselves when they hear the verses of Allah. 1. The polytheists of Mecca worshiped other than Allah, by worshiping idols that they made themselves. Their belief is not based on the revelation that Allah sent down to His Messenger, even though a true belief is a belief based on revelation from Allah. Their belief is only based on the customs of their ancestors first, then they follow and believe it. 2. They worship other than Allah, that is not based on right thinking, and is not based on science. They made the idols they worshiped themselves. Therefore they will not find a helper who will help them to uphold their opinions and thoughts, or who will ward off their punishment in the hereafter. 3. When Allah's verses are read to them, signs of arrogance, arrogance and stubbornness appear in their faces, as well as angry words that arise in their hearts. When verses of the Qur'an are recited to them, they want to attack and beat those who are reciting the verses. If they wanted to seek the truth, they would have listened to the verses that were read, then they pondered and thought about it, and if there was something they did not like, they would have asked or looked for strong reasons to disprove the truth of Allah's verses. Then Allah threatens them that their hatred and anger for hearing Allah's verses is actually less than the pain of punishment they will feel later on the Day of Resurrection. Allah confirmed His threat to the polytheists by ordering the prophet Muhammad saw to tell them, \"O polytheists, do you want to hear bigger and more evil news from your anger towards those who read verses -the verses of Allah, so that you almost attacked and beat them?\" Then the question above was immediately answered, that the big and worse news than his anger was the punishment of hell which had been promised to unbelievers as a reward for their actions while living in the world. Hell is the worst place to return to for polytheists."
		   },
		   {
			"id": 2668,
			"surah": 22,
			"ayat": 73,
			"tafsir": "This verse calls on people, especially those who associate partners with Allah by worshiping statues made of inanimate objects and made by themselves, so that they pay attention to the parables that Allah has made for them, then ponder and think about them as best they can. Whether what they have done is in accordance with the right mind, let them meditate again on the verses of Allah that were read, so that they will receive guidance. The parable is all the idols that they worship, with the aim of getting closer to Allah, and they ask him for something, even though the statues cannot create anything. Likewise, if the statue had something, then a small fly, weak and powerless, grabbed the object, surely the statues they worshiped would not be able to snatch the item back from the small fly. The parable that Allah presents in this verse seems to warn those who worship the statue or inanimate object that the God who has the right to be worshiped is God Almighty, the Creator, and no force can overcome His power. If the disbelievers worship an image, it means they worship an inanimate object, which does not know anything, it cannot even defend what it has, if a fly that is powerless snatches it away from it. Is such an image worthy of worship? The actions of the polytheists show their stupidity. How wrong were those who worshiped the image, and so did the image that was worshiped."
		   },
		   {
			"id": 2669,
			"surah": 22,
			"ayat": 74,
			"tafsir": "The polytheists admit that they worship idols or statues to get closer to Allah. But their confession was denied by Allah that the way they did it, not only insulted Allah, they even considered that Allah could not immediately accept requests and grant the prayers of His servants, so that someone needed to help him as an intermediary. Truly Allah, who has the right to be worshiped, is Almighty and Powerful, Almighty, nothing can defeat Him. He does according to what He wills, unlike the statue worshiped by the polytheists, which cannot be reclaimed, the object that the fly has snatched from it. Allah says: Indeed Allah, He is the Giver of sustenance Who Has Strength and is Very Sturdy. (adz-dzariyat\/51: 58)"
		   },
		   {
			"id": 2670,
			"surah": 22,
			"ayat": 75,
			"tafsir": "It was narrated that Walid bin Mugirah once said, \"Has a revelation ever been sent down on it among us?\" So Allah sent down this verse. In this verse Allah explains that He has chosen several people from among the angels, to intercede between Him and the Apostles He sent, to deliver revelations, like the angel Gabriel. Similarly, Allah has chosen several apostles who will convey His religion to humans. The right to choose the apostles is the right of Allah, no one has the authority to determine it apart from Him. Allah is All-Hearing everything that is said by His servants, sees the situation and knows the level of their ability, so that He can determine and choose who should be an apostle or prophet among them. The hadith of the Prophet saw, he said: Verily Allah has chosen Musa as Kalimullah and Ibrahim as Khalilullah. (History of al-Hakim in al-Mustadrak from Ibn 'Abbas)."
		   },
		   {
			"id": 2671,
			"surah": 22,
			"ayat": 76,
			"tafsir": "Allah is All-Knowing of the condition of the angels and the condition of humans, both before they were created and after they were created and also knows their condition after they are gone. Allah is All-Knowing of what will happen, what has happened, and also knows the end of all things, because to Him is the return of all matters."
		   },
		   {
			"id": 2672,
			"surah": 22,
			"ayat": 77,
			"tafsir": "In this verse, Allah orders believers to: 1. Perform prayers at predetermined times, complete with conditions and pillars. In this verse the prayer is called \"bowing\" and \"prostrating\", because bowing and prostration are the characteristics of prayer and are included in its pillars. 2. Serving oneself, repenting to Allah, and worshiping Him is a manifestation of faith in the heart of the heart that has felt the greatness, power and majesty of Allah, because human beings are very dependent on Him. Only He creates, sustains life and governs all of His creatures. Worshiping God is done directly, such as praying, fasting in Ramadan, paying zakat and performing the pilgrimage. There are also worships that are carried out indirectly, such as doing good to fellow human beings, helping each other, cultivating nature created by Allah for the benefit of humans. 3. Doing good deeds, such as strengthening friendly relations, having good manners, being respectful, loving fellow human beings. Including carrying out God's commands. If humans carry out the three kinds of commands above, then they will succeed in life to get the happiness of life, and in the afterlife they will get a paradise full of pleasure."
		   },
		   {
			"id": 2673,
			"surah": 22,
			"ayat": 78,
			"tafsir": "In addition to the commands above, Allah also commands believers to strive in the cause of Allah in earnest, solely for the sake of Allah and that Muslims should not be worried or afraid of anyone in jihad other than Allah. There are four kinds of jihad in the way of Allah, namely: 1. Jihad in the sense of defending yourself from enemy attacks, as Allah says: And fight in the way of Allah those who fight you, but do not transgress. (al-Baqarah\/2: 190) 2. Jihad in the sense of upholding Allah's religion and to elevate it, as Allah says: And fight them until there is no more slander, and religion is for Allah alone. If they stop (from disbelief), then surely Allah is Seeing of what they do. (al- Anfal\/8: 39) 3. Jihad in the sense of trying to escape Satan's temptations, which leads to humanitarian problems such as helping people, serving for good and so on, as Allah says: Those who believe, they fight in the way of Allah, and those who disbelieve fight on the road of Tagut, so fight the satanic friends, (because) actually the devil's deception is weak. (an-Nisa'\/4:76) 4. Jihad with the meaning of fighting lust, as explained in the hadith of the Prophet: From Jabir he said, \"There has come to the Messenger of Allah a people who are fresh from war. So he said, \"You come with a good arrival, you have come from a small jihad and will enter a great jihad.\" Someone said, \"What is the big jihad?\" The Messenger of Allah replied, \"Servant's struggle against lust.\" (History of al-Khatib al-Baghdadi ) At first the war was hated by the Muslims, as Allah says: It is obligatory for you to fight, even though it is not pleasing to you (al-Baqarah\/2: 216) Even though the war was hated by the Muslims, but because of its purpose to defend themselves and uphold the religion of Allah, then fighting is permissible and Muslims must do it. Meanwhile, Allah forbids Muslims from committing acts that exceed the limits in war. In this verse it is explained that Allah h has chosen the Ummah of Muhammad to wage jihad. The order came because the religion that Muhammad brought was a religion that had been perfected by Allah, in which there were provisions regarding Jihad. This is God's help to the Prophet Muhammad and his people. Allah explained that the religion that He had revealed to Muhammad was not a narrow and difficult religion, but a broad religion and did not cause difficulties for those who practiced it. All the commands and prohibitions contained in the Islamic religion aim to broaden and facilitate human life, so that they live happily in this world and in the hereafter. It's just that it is human passions that influence and create in their minds that God's commands and prohibitions feel hard to carry out. The Messenger of Allah said that the religion of Islam is easy, those who burden religion will be defeated by their own religion, as stated in the hadith: From Abi Hurairah ra, from the Prophet saw, he said, \"Verily religion is easy and this time no one will burden religion, except that religion will overcome him. Therefore do it right, keep yourself close, be happy, and ask for help in the morning and evening and when going out early in the evening.\" (Al-Bukhari) Rasulullah saw once gave a harsh warning to a group that burdened religion, as stated in the hadith. From 'Aisyah ra, he said, \"Rasulullah saw once made something, then he relieved it, then it came to some of his friends. It was as if they didn't like it and left it. So the matter came to him. He then stood up to give a speech and said: What is the condition of those who have come to them about an act that I lighten it, then they do not like it and leave it?By Allah (said the Prophet): Verily I am the most knowledgeable among them about Allah and those who most of them fear Him.\" (Al-Bukhari and Muslim) It is narrated that some of the Prophet's companions wanted to emulate him, so some said, \"I will fast every day.\" Still others say, \"I will not marry a woman.\" So it came to the Messenger of Allah, then he said: What is the condition of a person who has forbidden women, eating and sleeping? Know that I pray and sleep, fast and break my fast and marry women. Whoever hates my Sunnah, then he is not one of my people. (An-Nasa'i History) With the explanation of the above hadiths it is clear that Islam is a religion that is broad, lightens the burden, is not petty and does not make it difficult. If there are practices and practices of the Islamic religion that are burdensome, petty and narrow, then those things do not originate from the Islamic religion, but originate from people who do not know the essence of Islam. In everyday life, it can be seen that there are still many Muslims who do not understand well the purpose of Allah to pass down His Shari'a to the Prophet. Like Allah ordained prayer with the aim that humans are protected from heinous and unjust acts, but some Muslims find it difficult to pray the five daily prayers, some even say that prayer disturbs their precious time. The same is true for their opinion of other acts of worship. Then Allah explained that the religion that Muhammad brought was in accordance with the religion of Abraham, the ancestor of the Arab nation and both religions were both based on monotheism. It was as if Allah had warned the Arabs at that time, \"O Arabs, you claim to embrace the religion brought by your ancestor Abraham, therefore follow the religion brought by Muhammad, a religion that is based on monotheism, there is no narrowness and pettiness in it. And Allah named people who embrace the monotheistic religion with \"muslim\".\" In this verse it is stated that Rasulullah SAW will be a witness on the Day of Judgment for his people. The point is that he testifies that he has conveyed Allah's message to them, calls on them to believe in Allah and so that they stick to Allah's religion, and worship Allah and carry out His commands and stay away from His prohibitions. Meanwhile, the Muslims will be witnesses to mankind on the Day of Resurrection, meaning that they have done what the Messenger did for them, that is, they have called on people to believe, convey Allah's religion, carry out the tasks that Allah and the Messenger have assigned to them as well as possible. . After that they submitted their affairs to Allah, whether their invitation was accepted or rejected. Some commentators in interpreting this verse state that the Muslims bear witness to humans, including in their testimony to the previous peoples, who were sent to them by the Messengers. They know this from Allah through the Qur'an which explains that the Prophet used to convey a religion based on monotheism to them. All of Allah's mentioned commands can be carried out properly, so that the people of Muhammad who are assigned to be witnesses against humans on the Day of Judgment can carry out the testimony as well as possible, so Allah commands them: 1. Always perform the five daily prayers, because prayers keep away human beings from heinous and unjust acts and is a strong link between the God who is worshiped and His servants. 2. Pay zakat, in order to purify souls and property, in order to narrow the gap between the rich and the poor. 3. Hold fast to God's rope by carrying out His commands and keeping away from all His prohibitions."
		   }
	]
}
