{
	"tafseer": [
		{
			"id": 5849,
			"surah": 83,
			"ayat": 1,
			"tafsir": "The punishment and great humiliation on the Day of Judgment are prepared for those who cheat in measuring and weighing. Allah has delivered a scathing threat to those who cheated in measuring and weighing what happened at the buying and selling places in Mecca and Medina at that time. It was narrated that in Medina there was a man named Abu Juhainah. It has two kinds of measures, large and small. If he buys wheat or dates from farmers, he uses a large amount, but if he sells it to other people he uses a small amount. Actions like that show the existence of greed, wanting to seek profit for himself even at the cost of harming others. Against such a person, the Prophet Muhammad has given a very scathing threat like that in this hadith: There are five cases that are rewarded with five cases: Never a people who break a promise, but Allah will allow the people to be controlled by their enemies. Never those who decide a case with a punishment that was not sent down by Allah, but poverty will spread among them. Adultery will never spread among them widely, but will spread the danger of death. Never those who cheat in measuring and weighing, but they will lose the fertility of plants and be overwritten by the dry season. And never those who withhold zakat, but will be punished by withholding rain (long drought). (History of ath-thabrani from Ibn 'Abbas)"
		   },
		   {
			"id": 5850,
			"surah": 83,
			"ayat": 2,
			"tafsir": "In these two verses, Allah describes the behavior of people who will be the inhabitants of hell. They are people who want to be filled with measurements or scales when buying because they don't want to lose. On the other hand, if they sell to other people, they will reduce their measure or weight. People who reduce the measure and scales get a big sin because by doing that, he is considered to have eaten other people's property without the consent of the owner. God forbids such acts. Allah said: And do not eat the wealth among you in a vanity way. (al-Baqarah\/2: 188) What is meant by measure here includes all measurements and weights that are commonly used in buying and selling and related to the reduction of other people's rights. In today's life, we often encounter reductions that harm other people, such as selling gas cylinders whose contents are not up to standard, reducing the liters of gasoline sold, cloth sellers reducing the size of the cloth they sell. Included in the dose reduction which is very detrimental and dangerous is corruption. Corruption offenders reduce the funds of a project from the original plan in order to gain profit for themselves, or reduce the quality of materials needed in the project and replace them with materials of lower quality. This verse reminds people to stay away from practices that harm other people and the threat of punishment is very large in this world and the hereafter. The same verse that commands humans to fulfill and perfect the scales is the word of God: And perfect the measure when you measure, and weigh it with the right scales. That is more important (to you) and better as a result. (al-Isra'\/17: 35)"
		   },
		   {
			"id": 5851,
			"surah": 83,
			"ayat": 3,
			"tafsir": "In these two verses, Allah describes the behavior of people who will be the inhabitants of hell. They are people who want to be filled with measurements or scales when buying because they don't want to lose. On the other hand, if they sell to other people, they will reduce their measure or weight. People who reduce the measure and scales get a big sin because by doing that, he is considered to have eaten other people's property without the consent of the owner. God forbids such acts. Allah said: And do not eat the wealth among you in a vanity way. (al-Baqarah\/2: 188) What is meant by measure here includes all measurements and weights that are commonly used in buying and selling and related to the reduction of other people's rights. In today's life, we often encounter reductions that harm other people, such as selling gas cylinders whose contents are not up to standard, reducing the liters of gasoline sold, cloth sellers reducing the size of the cloth they sell. Included in the dose reduction which is very detrimental and dangerous is corruption. Corruption offenders reduce the funds of a project from the original plan in order to gain profit for themselves, or reduce the quality of materials needed in the project and replace them with materials of lower quality. This verse reminds people to stay away from practices that harm other people and the threat of punishment is very large in this world and the hereafter. The same verse that commands humans to fulfill and perfect the scales is the word of God: And perfect the measure when you measure, and weigh it with the right scales. That is more important (to you) and better as a result. (al-Isra'\/17: 35)"
		   },
		   {
			"id": 5852,
			"surah": 83,
			"ayat": 4,
			"tafsir": "This verse criticizes those who reduce their measure and scales with the question whether they thought the day of resurrection would never exist. Because, if they just think, they don't believe in the existence of the resurrection day, of course they won't be moved to avoid cheating. Indeed, they do not expect a day of reckoning, as Allah says: In fact, they never expected reckoning before. (an-Naba'\/78: 27)"
		   },
		   {
			"id": 5853,
			"surah": 83,
			"ayat": 5,
			"tafsir": "They will be resurrected to be held accountable on the Day of Judgment. Allah explained that at that time all human beings stood before Allah Rabbul 'Alamin to be accounted for and examined for all their deeds while living in the world. Everything is brought to account with full justice because Allah is Most Just. The scales are a symbol of justice that must always be upheld and maintained."
		   },
		   {
			"id": 5854,
			"surah": 83,
			"ayat": 6,
			"tafsir": "They will be resurrected to be held accountable on the Day of Judgment. Allah explained that at that time all human beings stood before Allah Rabbul 'Alamin to be accounted for and examined for all their deeds while living in the world. Everything is brought to account with full justice because Allah is Most Just. The scales are a symbol of justice that must always be upheld and maintained."
		   },
		   {
			"id": 5855,
			"surah": 83,
			"ayat": 7,
			"tafsir": "These verses explain to those who do not believe in the resurrection day that their actions must be accounted for. They cannot avoid Allah's punishment because each human being is watched over by an angel who records all his actions. The notebooks of those who disobey Allah will be kept in the Sijjin, which is a written book. It contains crimes and human fraud. These records will be used as a measure for their reckoning."
		   },
		   {
			"id": 5856,
			"surah": 83,
			"ayat": 8,
			"tafsir": "These verses explain to those who do not believe in the resurrection day that their actions must be accounted for. They cannot avoid Allah's punishment because each human being is watched over by an angel who records all his actions. The notebooks of those who disobey Allah will be kept in the Sijjin, which is a written book. It contains crimes and human fraud. These records will be used as a measure for their reckoning."
		   },
		   {
			"id": 5857,
			"surah": 83,
			"ayat": 9,
			"tafsir": "These verses explain to those who do not believe in the resurrection day that their actions must be accounted for. They cannot avoid Allah's punishment because each human being is watched over by an angel who records all his actions. The notebooks of those who disobey Allah will be kept in the Sijjin, which is a written book. It contains crimes and human fraud. These records will be used as a measure for their reckoning."
		   },
		   {
			"id": 5858,
			"surah": 83,
			"ayat": 10,
			"tafsir": "These two verses again threaten those who deny the Day of Judgment with a very painful punishment, namely hell. Threats and punishments for those who deny the Day of Resurrection are indeed very painful, because denying the Day of Resurrection means denying Allah's justice and the religious Shari'a laws that apply in this world and have consequences in the hereafter."
		   },
		   {
			"id": 5859,
			"surah": 83,
			"ayat": 11,
			"tafsir": "These two verses again threaten those who deny the Day of Judgment with a very painful punishment, namely hell. Threats and punishments for those who deny the Day of Resurrection are indeed very painful, because denying the Day of Resurrection means denying Allah's justice and the religious Shari'a laws that apply in this world and have consequences in the hereafter."
		   },
		   {
			"id": 5860,
			"surah": 83,
			"ayat": 12,
			"tafsir": "This verse explains that there is no human who denies the Day of Judgment except for people who always transgress religious boundaries, whose hearts are closed by disbelief, and who are no longer useful for him with various warnings and threats. Allah said: Verily those who disbelieve, it is the same to them, you (Muhammad) give warning or you do not warn, they will not believe. (al-Baqarah\/2: 6) Another characteristic of humans who deny the Day of Judgment is drowning in grave sins, indifferent to God's commands and prohibitions, more concerned with worldly pleasures than the afterlife. Allah's Word: So as for those who transgress the limits, and prioritize the life of the world, then indeed, hell is his place of residence. (an-Nazi'at\/79: 37-39)"
		   },
		   {
			"id": 5861,
			"surah": 83,
			"ayat": 13,
			"tafsir": "This verse explains that when the verses of the Qur'an are recited to people who transgress limits, are always sinful, do not believe in the hereafter and the Qur'an is a holy book that contains God's instructions to lead people to the right path. straight to the happiness of this world and the hereafter, they don't want to listen to it intently or listen to its contents. They even say that the Qur'an is the tales of the ancients dictated to the Prophet Muhammad. Allah's Word: And those who disbelieve say, \"This (Qur'an) is nothing but a lie concocted by him (Muhammad), assisted by other people,\" Verily, they have committed injustice and a lie that big. And they said, \"(It's just) the tales of the ancients, who were asked to write down, then read those tales to him every morning and evening.\" Say (Muhammad), \"(The Qur'an) was sent down by (Allah) who knows the secrets of the heavens and the earth. Indeed, He is Forgiving, Most Merciful.\" (al-Furqan\/25: 4-6)"
		   },
		   {
			"id": 5862,
			"surah": 83,
			"ayat": 14,
			"tafsir": "In this verse, Allah refutes the accusations of the Meccan disbelievers who said that the Qur'an was a myth from the ancients. Not at all. Actually, what they always try to close their hearts. Their habit of sin has caused their hearts to become hard, dark, and covered up like rusty metal. Therefore, they are unable to distinguish between grave lies and blatant truths. Such a heart can only be cleansed with perfect repentance."
		   },
		   {
			"id": 5863,
			"surah": 83,
			"ayat": 15,
			"tafsir": "This verse explains that disbelievers who do not want to acknowledge the Qur'an as Allah's revelation are hindered from His mercy in this world and the hereafter. They are prevented from the greatest favor for a servant, which is to look and see Allah in the hereafter. Imam Syafi'i said that this verse can be used as an argument that believers will not be prevented from seeing Allah in the hereafter, as He says: The faces (of believers) on that day will be radiant, looking at their Lord. (al-Qiyamah\/75: 22-23)"
		   },
		   {
			"id": 5864,
			"surah": 83,
			"ayat": 16,
			"tafsir": "After being kept away from Allah's mercy and unable to achieve their ideals on the Day of Judgment, those disbelievers actually enter the very hot hell of Jahim."
		   },
		   {
			"id": 5865,
			"surah": 83,
			"ayat": 17,
			"tafsir": "Then said to them words that contain insults so that their suffering was multiplied. In addition to physical suffering, they also suffer psychologically (psychologically). This is the doom that they always deny when they are in the world. This is the response to their attitude of denying the true messenger's news, such as their assumption that humans will not be resurrected, the Qur'an is the story of the ancients, Muhammad saw was just a sorcerer or a liar, and various other accusations . In the afterlife, it will become clear how the real facts of truth can be witnessed by their senses. How sad it will be felt by someone who is suffering punishment if he is given criticism that stabs his heart, even though he had taken the path of salvation if he truly believed and was pious."
		   },
		   {
			"id": 5866,
			"surah": 83,
			"ayat": 18,
			"tafsir": "In this verse, Allah refutes the accusations of disobedient people who deny the Day of Resurrection and the truth of the Qur'an. Never. In fact, the books of those who are devoted are kept in a high place which is named 'Illiyyun, which is witnessed by the angels of the muqarrabin (those who are close to Allah)."
		   },
		   {
			"id": 5867,
			"surah": 83,
			"ayat": 19,
			"tafsir": "To show the majesty of 'Illiyyun, Allah asked the question, \"Do you know what 'Illiyyun is?\" Allah then explained directly, \"That is a book that was written and witnessed by angels who were brought closer to Allah.\""
		   },
		   {
			"id": 5868,
			"surah": 83,
			"ayat": 20,
			"tafsir": "To show the majesty of 'Illiyyun, Allah asked the question, \"Do you know what 'Illiyyun is?\" Allah then explained directly, \"That is a book that was written and witnessed by angels who were brought closer to Allah.\""
		   },
		   {
			"id": 5869,
			"surah": 83,
			"ayat": 21,
			"tafsir": "To show the majesty of 'Illiyyun, Allah asked the question, \"Do you know what 'Illiyyun is?\" Allah then explained directly, \"That is a book that was written and witnessed by angels who were brought closer to Allah.\""
		   },
		   {
			"id": 5870,
			"surah": 83,
			"ayat": 22,
			"tafsir": "After explaining the book of those who are devoted which is named 'Illiyyun, Allah then explains the condition of those who are devoted (al-abrar) in detail. In fact, those who justify what Muhammad brought, are truly in great pleasure, namely heaven."
		   },
		   {
			"id": 5871,
			"surah": 83,
			"ayat": 23,
			"tafsir": "They sit on the couches while looking at various kinds of heavenly pleasures such as angels, their children who die before reaching adulthood which are provided in heaven to serve their parents, various kinds of food and drink, and so on."
		   },
		   {
			"id": 5872,
			"surah": 83,
			"ayat": 24,
			"tafsir": "In this verse it is explained that the signs of happiness appear on their faces. People who see it can feel the joy of their life which is full of enjoyment as stated in the word of God: On that day there will be faces beaming, laughing and rejoicing. ('Abasa\/80: 38-39)"
		   },
		   {
			"id": 5873,
			"surah": 83,
			"ayat": 25,
			"tafsir": "In this verse it is explained that those who are devoted are given to drink from pure khamar which is clean from mixtures and does not intoxicate. The khamar is stored in a sealed place so that it is protected from contamination."
		   },
		   {
			"id": 5874,
			"surah": 83,
			"ayat": 26,
			"tafsir": "The seal is kasturi and in order to achieve such pleasure, people must compete in order to carry out obedience and piety to Allah. Whoever is diligent in worshiping Him, will quickly cross the as-sirathal-mustaqim bridge which is above the fires of hell."
		   },
		   {
			"id": 5875,
			"surah": 83,
			"ayat": 27,
			"tafsir": "In these two verses it is explained that the mixture of pure khamar is from tasnim that comes from a high area. Tasnim is a spring which is a source of drinking water for people who are closer to Allah."
		   },
		   {
			"id": 5876,
			"surah": 83,
			"ayat": 28,
			"tafsir": "In these two verses it is explained that the mixture of pure khamar is from tasnim that comes from a high area. Tasnim is a spring which is a source of drinking water for people who are closer to Allah."
		   },
		   {
			"id": 5877,
			"surah": 83,
			"ayat": 29,
			"tafsir": "Verily, those who transgressed and sinned before used to laugh at the believers. When the Prophet Muhammad brought the Qur'an with Islamic teachings which contain the virtues, he received great resistance from the polytheists of Mecca. This resistance was mainly from his superiors, who had been used to worshiping idols since their ancestors. They are against any teaching that comes from outside that is contrary to their beliefs. It has become a habit for great people who rely on power and property or wealth that they are always cynical or ridicule other parties who are not in line with their beliefs and culture."
		   },
		   {
			"id": 5878,
			"surah": 83,
			"ayat": 30,
			"tafsir": "When believers pass in front of them, the sinners signal to one another with a wink that contains an element of ridicule and ridicule. When they return to their relatives, they are proud of themselves because they have taken action against Muhammad's followers with various actions that contain elements of ridicule, ridicule, and hostility."
		   },
		   {
			"id": 5879,
			"surah": 83,
			"ayat": 31,
			"tafsir": "When believers pass in front of them, the sinners signal to one another with a wink that contains an element of ridicule and ridicule. When they return to their relatives, they are proud of themselves because they have taken action against Muhammad's followers with various actions that contain elements of ridicule, ridicule, and hostility."
		   },
		   {
			"id": 5880,
			"surah": 83,
			"ayat": 32,
			"tafsir": "When they see believers, those who sin say that they actually see people who are truly astray and deviate from the truth, because they changed the beliefs that they inherited from their forefathers regarding idol worship."
		   },
		   {
			"id": 5881,
			"surah": 83,
			"ayat": 33,
			"tafsir": "Allah confirms that those disbelievers living in the world are not assigned to protect or look after the believers. They are not authorized to look after the believers because the believers are not under their control. Therefore, they have no right to ridicule, monitor, and harm believers who sincerely believe in Allah."
		   },
		   {
			"id": 5882,
			"surah": 83,
			"ayat": 34,
			"tafsir": "In this verse, Allah explains that on the Day of Judgment it is the turn of the believers in heaven to mock the disbelievers who are suffering the punishment of hell. On that day, those who believe will laugh out loud because they witness the rewards and various kinds of pleasures that are in accordance with God's promises. They also laugh at the disbelievers who used to mock them in the world."
		   },
		   {
			"id": 5883,
			"surah": 83,
			"ayat": 35,
			"tafsir": "They sit relaxed on the couches watching what God has done to the disbelievers in hell."
		   },
		   {
			"id": 5884,
			"surah": 83,
			"ayat": 36,
			"tafsir": "They assured that in fact the disbelievers were not wronged, but only given recompense for what they used to do. Because, the reward is usually taken from the type of deed, the good is rewarded with good, and the evil is rewarded with evil."
		   }
	]
}
