{
	"tafseer": [
		{
			"id": 294,
			"surah": 3,
			"ayat": 1,
			"tafsir": "Alif Lam Mim includes the letters muqaththa'ah (abbreviation) which are located at the beginning of several surahhs of the Qur'an. The interpreters differed on the meaning of the letters. Then, see this issue in the title \"Fawatihus-suwar\" at the beginning of volume I of this commentary."
		   },
		   {
			"id": 295,
			"surah": 3,
			"ayat": 2,
			"tafsir": "This verse emphasizes that God who has the right to be worshiped is none other than Allah, Who lives eternally, continuously governs and protects His creatures. Next, see the tafsir of verse 255 al-Baqarah."
		   },
		   {
			"id": 296,
			"surah": 3,
			"ayat": 3,
			"tafsir": "This verse explains that God who has the right to be worshiped really sent down the Qur'an to the Prophet Muhammad through Gabriel, and emphasized that before sending down the Qur'an, Allah had also sent down books to the previous prophets, sent before the arrival of the Prophet Muhammad, for example the Torah which was revealed to Prophet Musa, the Bible which was revealed to Prophet Isa and so on. The Al-Qur'an acknowledges the truth of the contents of the previous books just as the previous books justify the contents of the Al-Qur'an according to what the books imply. This affirmation and acknowledgment is only in outline, not in detail, namely that God has sent messengers to the ancient peoples, and God has revealed revelations to them, such as the Torah, the Bible and so on. The Qur'an does not explain the contents of these books. Believing in the affirmation and acknowledgment of that verse includes faith in Allah. As is the case with the Al-Qur'an which acknowledges that prophets and messengers were sent to earlier peoples and books were revealed to them, the previous books also indicate and acknowledge that at the end of time Allah will send a final prophet, the closing prophet and to that prophet Allah will also send down a book containing the main points of the treatises brought by the previous prophets. According to this verse, the entire contents of the Torah and the Gospels are revelations from Allah, which were conveyed to the Prophet Musa and Prophet Isa which contain the main points of the treatises they brought, there is not the slightest in them in the form of human essays and so on. Regarding the existing Torah, it is not the Torah which was revealed to the Prophet Musa, nor is the Injeel revealed to the Prophet Isa, because both of these books contain the compositions of the followers of the two Prophets who came later. ¦. They like to change the word (Allah) from its place, and they (deliberately) forget some of the messages they have been warned about. You (Muhammad) will always see betrayal from them except for a small group of them (who do not betray), ¦(al-Ma'idah\/5:13. See also an-Nisa'\/4:46)."
		   },
		   {
			"id": 297,
			"surah": 3,
			"ayat": 4,
			"tafsir": "Before the Al-Qur'an was revealed, the Torah and the Gospel became a guide for humans, and then the Al-Furqan was revealed, namely the Al-Qur'an, a book that can distinguish between right and wrong. At the end of this verse, Allah threatens with a painful punishment for those who remain in denial and do not want to know about the books that Allah has revealed to the apostles, people who do not want to use their minds to distinguish between true beliefs and wrong, between religions that are acceptable to Allah and those that are not approved by Him. They will all be put into hell. Nothing can change God's decision and nothing can escape and defend themselves from His punishment. Allah will repay all forms of denial and disobedience to His laws and punish the perpetrators with a fitting punishment."
		   },
		   {
			"id": 298,
			"surah": 3,
			"ayat": 5,
			"tafsir": "Allah's knowledge encompasses everything, nothing can match Allah's knowledge and nothing escapes His knowledge."
		   },
		   {
			"id": 299,
			"surah": 3,
			"ayat": 6,
			"tafsir": "By His nature, He makes human beings take various forms after going through process after process, starting from a sperm cell that penetrates into the uterus, then it becomes something that is attached to the wall of the uterus, and from something that is attached it becomes a lump of flesh that is attached. finally took the form of a human and he was born into the world (al-Mu'minun\/23:12-14). Everything was made by Allah according to the sunnah (law) and His knowledge."
		   },
		   {
			"id": 300,
			"surah": 3,
			"ayat": 7,
			"tafsir": "The Qur'an, which was revealed by Allah, contains in it verses which are muhkamat and which are mutasyabihat. \"Muhkamat verses\" are verses that have a clear meaning, such as legal verses, and so on. \"Mutasyabihat verse\" is a verse whose meaning is unclear, which can be interpreted in various ways. Like verses related to things that are unseen and so on. According to some commentators, the purpose of the revelation of these verses is: 1. To test a Muslim's faith and determination in Allah. True faith should be accompanied by surrender in the broadest sense to God. Allah sends down verses that can be understood easily and He sends down verses that are difficult to know the true meaning and meaning of, namely mutasyabihat verses. In the face of these mutasyabihat verses, man will feel that he is not a perfect being, he was only given a little knowledge by Allah, therefore he will surrender the understanding of the verses to Allah, the All-Knowing. 2. With the existence of muhkamat and mutasyabihat verses, Muslims will think according to the limits given by Allah; some can be thought about deeply and some are difficult to think about, then leave it to God. 3. The prophets and the apostles were sent to all mankind who were different, for example: They had different intelligence, abilities, wealth, different nations, languages and regions. Therefore, the method of conveying religion to them should be adapted to their circumstances and their language readiness according to their abilities. The human attitude in understanding and dealing with mutasyabihat verses, namely: 1. People whose hearts do not want the truth, they make these verses as material for slander which they spread among humans and they look for meanings that can be used as reasons to strengthen their opinions and wishes. 2. People who have deep knowledge and want to seek the truth, they must seek the correct understanding, from that verse. If they haven't or can't figure it out, they surrender to Allah while praying and asking for guidance. At the end of this verse Allah explains the nature of people who are knowledgeable, namely people who like to pay attention to Allah's creatures, like to think about and meditate on them. He thinks solely for Allah and to seek the truth."
		   },
		   {
			"id": 301,
			"surah": 3,
			"ayat": 8,
			"tafsir": "The attitude of people whose knowledge is deep, they always pray and surrender to Allah, if they can no longer think about the verses of Allah. They pray to Allah to always be cared for, led, guided, and not to let them slip into the wrong path after they have been guided. From their prayers it is understood that what they are asking for is not merely worldly safety and happiness, but they are also asking for happiness and safety in the hereafter."
		   },
		   {
			"id": 302,
			"surah": 3,
			"ayat": 9,
			"tafsir": "In the prayers of those whose knowledge is deep, their belief is also illustrated, that is, they believe in the arrival of the Day of Judgment, and after that Allah gathers all His creatures to account for all the deeds they have done while they lived in this world. They believe that on that day Allah repays good deeds with multiple rewards, and repays all sins with the punishment they deserve. The arrival of the hereafter and the collection of creatures on that day is God's promise to humans. People whose knowledge is deep, are sure that Allah will surely keep His promises."
		   },
		   {
			"id": 303,
			"surah": 3,
			"ayat": 10,
			"tafsir": "People who disbelieve and deny the prophethood of Muhammad, even though they know the truth from both the People of the Book and the Arab polytheists, they will not be able to avoid the punishment of Allah. Furthermore, Allah explained that their possessions and their children and grandchildren would not intercede for them in the slightest. Wealth that can be used to benefit and reject harm in the world and children who can help in all important matters and in war, all of that will not save them from the fire of hell, as Allah says: (That is) on the day (when) wealth and useless children. (asy-Syu'ara'\/26:88) Even though they say what Allah says: And they say, \"We have more wealth and children (than you) and we will not be punished.\" (Saba'\/34: 35) Their statement was refuted by Allah with His word: And it is not your possessions or your children that bring you closer to Us; but those who believe and do good, ¦. (Saba'\/34: 37)"
		   },
		   {
			"id": 304,
			"surah": 3,
			"ayat": 11,
			"tafsir": "The matter of those who disobeyed was the same as that of Pharaoh and his followers, also similar to what the previous people did to Prophet Musa and other prophets. They belied the verses of Allah brought by the apostles. Because of that Allah sent down punishment on them no matter how great their power. The enemies of the prophet were crushed, and the prophets and their followers gained the victory. Unbelievers cannot escape the punishment that Allah has sent down. Because God's punishment is as a natural result of their own sins. The Jews were afraid of the revelation of this verse because they knew what Pharaoh and his followers had experienced. What is meant by the unbelievers in this verse are the Jews of Medina. According to the history of Ibn 'Abbas, the Jews of Medina when they witnessed the victory of the Prophet over the polytheists in the Battle of Badr, they said, \"By Allah, in fact he is an unborn prophet, which the Prophet Musa announced to us, and in the Torah there are signs of it\" . Then they intend to follow the Prophet Muhammad saw. But some of them said, \"Don't be in a hurry until you see other proofs.\" When the Battle of Uhud came, they hesitated, so they canceled the agreement they had made with the Prophet (pbuh). Then Ka'ab bin al-Ashraf (Jewish leader) along with sixty members of the cavalry immediately departed for Mecca to gather forces to fight the Messenger of Allah. So at that time this verse was revealed. It was also narrated by Abu Dawud in his Sunan, and by al-Baihaqi in Dala'il through Ibn Ishaq from Ibn 'Abbas that when the Prophet defeated the Quraysh in the Battle of Badr, he returned to Medina, he gathered the Jews in the Bani Qainuqa market '. He said, \"O Jews, enter into Islam before you are overwritten by what Allah has inflicted on the Quraysh. They replied, \"O Muhammad, do not be fooled by yourself. You have killed a number of Quraysh, and they are people who are inexperienced, do not understand war. By Allah, if you fight against us, you will know that we are the real men, you have never faced us.\" With this incident, verses 12 and 13 were revealed."
		   },
		   {
			"id": 305,
			"surah": 3,
			"ayat": 12,
			"tafsir": "In this verse Allah strictly warns them; that they will certainly perish in this world, before the hereafter. Prophet Muhammad saw was ordered to tell the Jews that they would be defeated in this world. God will keep His promise, and in the afterlife they will be placed in Hell Hell. The truth of this verse was proven later. The Muslims succeeded in defeating the Bani Quraizah Jews because of their betrayal and expelling the Bani Nadir from Medina, because of their hypocrisy, and conquered the city of Khaibar the city of the Jews, and collected jizyah from the Jews. Even though this verse explains the collection of jizyah from the Jews, the meaning of this verse includes all non-believers in general."
		   },
		   {
			"id": 306,
			"surah": 3,
			"ayat": 13,
			"tafsir": "Furthermore, God warned them not to feel strong with the amount of wealth and energy they have. Because they should have taken lessons from the Badr War. The large amount of funds and manpower and the many allies who help, will not guarantee victory in war. The history of wars in this world proves the fallacy of such an assumption. What happened in the Battle of Badr, where the two armies faced each other, the small number of Muslim armies fighting in the way of Allah, were destined to win over the much larger army of the polytheists. Those who have a sound mind and use it to reflect on all the things that happened, and benefit from it, will certainly learn a lot from the Badr War incident. It turns out that there is another power above all the visible power. It is this strength that often strengthens a weak army so that it can defeat a strong, larger army with Allah's permission. Fighting in the way of Allah is the key to victory. If the purpose of struggle and war is to defend the truth, protect religion and its adherents, then the souls of the fighters will find peace in facing the battlefield and can concentrate with all the strength they have. Because they believe that behind them there is a driving force and there is help from Allah. Allah confirms that this help will be given to His servants who strive in His way, as long as they remain steadfast and patient and always remember Allah and obey their leaders. In the second Battle of Badr which took place on the 17th of Ramadan in the year 2 Hijriah, the Muslims tried to comply with God's provisions and the provisions of His Messenger with all their capabilities, and with unanimous determination. They fought bravely, and with God's help they won the battle. O you who believe! If you help Allah (religion), He will help you and strengthen your position. (Muhammad\/47: 7). According to historians, the Muslim army in the Battle of Badr numbered 313 people. Consists of 77 Muhajirin and 236 Ansar. The one holding the flag in the Muhajirin army was Ali bin Abi Talib, while the Ansar troop flag was held by Sa'ad bin 'Ubadah. In the Muslim army there were 90 camels and 2 war horses, each ridden by Miqdad bin al-Aswad and Martsad bin Abi Martsad. The number killed on the part of the Muslims was 14 men, consisting of 6 Muhajirin and 8 Ansar. The number of polytheists was 950 people, led by 'Utbah bin Rabi'ah, and among them were Abu Sufyan and Abu Jahal. In their army were a hundred horses, 700 camels, and an innumerable number of weapons. In the Battle of Badr the number of Muslim troops was only 313 people. But in the vision of the polytheists when the war raged on, the number multiplied, so that it created fear in their hearts. Finally they fled from the battlefield. Thus Allah sends down help to the Muslims. Before the war raged, the Muslim army in the eyes of the polytheists looked very small, because of that they dared to face and attack the enemy, as happened in the Battle of Badr. And when Allah shows them to you when you meet, they are few in number according to your eyes and He shows you to be few according to their eyes, it is because Allah wants to carry out an affair that must be carried out. Only to Allah all matters are returned. (al-Anfal\/8: 44) It is with this help that Allah strengthens those whom He wills, and indeed in such help there is a lesson for people who have reason and mind."
		   },
		   {
			"id": 307,
			"surah": 3,
			"ayat": 14,
			"tafsir": "After explaining in the previous verse about the erroneous views of disbelievers regarding wealth and children and their deviation from the truth, this verse explains the aspect of their error caused by wealth and children on which their hopes are based. It is wrong if humans make wealth and children the goal of their life. Women, children, gold and silver, vehicles, pets, and all wealth is a delight to man and dear to him. In fact, it is not something that is forbidden to love those things, because humans cannot avoid loving them. But very few people understand the evil or danger of it, even though the evidence is quite clear and many show the evil and danger. Sometimes humans like something, even though they know something is bad and useless. Who likes something but he thinks it is not good for him, he can escape from its influence. Indeed, Allah made human nature to love wealth and pleasures. Therefore, Allah makes possessions and pleasures as a means of testing one's faith, whether he will use all these possessions and pleasures for worldly life only, or will he use his possessions to achieve Allah's pleasure. Indeed, We have made what is on the earth as an adornment for him, for We will test them, which of them is the best in deeds. (al-Kahf\/18: 7) The objects of human pleasure in detail are as follows: First: Women (wives) ), the wife is the foundation of love and affection. The human soul always tends towards the wife, as Allah says in the Qur'an: And among His signs (of greatness) is that He creates partners for you from your own kind, so that you are inclined and feel at ease with them, and He make between you love and compassion. ¦. (ar-Rum\/30: 21) Most of the hard-earned results of men's efforts are intended for children and wives. Men are the guides who are responsible for women, because men have the strength and ability to protect them. But loving women excessively has an adverse effect on the family, society and nation, and can also affect the balance of rights and obligations between men and women. In this verse, loving one's wife is mentioned before loving children, even though love for one's wife may fade, while love for children does not; for love for children is seldom as excessive as love for women. In general, loving children does not cause problems. In society, it often happens that a man prioritizes love for women by ignoring love for children. Like a man who marries more than one, he devotes his love to another wife, he gives a lot of maintenance, while his old wife is neglected. Thus their children become neglected, because their education is no longer considered. There are also many children of rulers and rich people whose morals are corrupted because their father loves another woman. Second: Child, boy or girl. Love for children is human nature. It's the same with love for a wife because the goal is to continue offspring. Children are actually household ornaments, successors of offspring from generation to generation. But he can turn into a trial: Truly your wealth and your children are only a trial (for you), ¦ (at-Tagabun\/64: 15) Third: Abundant wealth. Ar-Razi said in his commentary, \"Gold and silver are very popular, because both are tools for assessing the value of something. People who have it are the same as people who have everything. To own means to control. To be in power is one of the perfections, and that perfection is desired by all human beings. . Because gold and silver are the most appropriate tools for obtaining perfection, they are wanted and loved. If something that is loved cannot be obtained except with something else, then something else is also loved. So that's why gold and silver are loved \" . Abundant wealth will tempt people's hearts and keep them busy all day long to take care of it. This, of course, will make people forget about God and life in the hereafter. The Bedouins who are left behind (not coming to Hudaibiah) will say to you, \"We have been preoccupied with our wealth and family, so ask forgiveness for us¦ (al-Fath\/48: 11) The love of wealth has become a bad human character, because wealth is a tool to fulfill desires. Human desires have no limit. So they pursue wealth incessantly. Rasulullah saw said: If a human had one valley of wealth, surely he would want the second (one more valley). If he had two valley, surely he wants the third. Nothing can fill the stomach of the Children of Adam except the ground. And Allah forgives those who repent to Him. (Narrated by al-Bukhari from Ibn 'Abbas). Fourth: Horses kept in pastures , especially horses that are white on the forehead and legs, so that they appear as a sign. For Arab people, horses like this are the best and most beautiful horses. They compete to be able to choose this is it. They take pride in such horses and sometimes compete to buy them at exorbitant prices. Fifth: Other livestock, such as cows, camels, goats. These animals include the treasures of the Bedouin Arabs. Their life needs such as clothing, food, household equipment and so on, are mostly met from the results of raising these animals. Allah says explaining His favors: And livestock He has created for you, in which there is (fur) that warms and various benefits, and some of it you eat. And you find beauty in it when you bring it back to the stable and when you release it (to a grazing place). And it carries your burdens to a land that you cannot reach, except with difficulty. Verily, your Lord is Most Gracious, Most Merciful. And (He has created) horses, mules and donkeys, for you to ride and (to be) ornaments. Allah created what you do not know. (an-Nahl\/16: 5-8). Sixth: Paddy fields are the source of human and animal life. Human needs for paddy fields exceed their needs for other preferred assets, because farm fields are a source of fulfilling one's needs. These are the six kinds of treasures that are loved by people in this world, and are accessories for their life, which fulfill all their needs and desires. Satan tempts man so that he deems it good to love these possessions. But humans should realize that all possessions are only for worldly life which is not eternal. It is not true, if property is made by humans as the ultimate goal and goal of life in this mortal world, so that he is hindered from preparing himself for the real life, namely the eternal afterlife. Isn't there a good place to return (heaven) with Allah? How happy man would be, if he used those possessions within the limits of Allah's guidance."
		   },
		   {
			"id": 308,
			"surah": 3,
			"ayat": 15,
			"tafsir": "In this verse Allah commands His Messenger to explain to people what is meant by a good place of return so that they are encouraged to do good. The Prophet Muhammad was ordered to ask his people whether they like to be told about things that are better than all kinds of pleasures mentioned in verse 14. By asking them they will be more interested in giving answers. The definition of \"better\" is the reward that will be obtained by a pious person, which can be divided into two kinds of blessings, namely: 1. Physical in nature, favors in the form of beauty in heaven which cannot be described by humans, including a life partner who is clean from all kinds of defects and weaknesses, such as those found in humans in the world, both in terms of appearance and temperament and so on. 2. Spiritual in nature, pleasing Allah who does not mix in the slightest with His anger, and this is the greatest favor in the hereafter for those who are pious. The Messenger of Allah said: Verily Allah 'Azza wa Jalla said to the people of heaven, \"O inhabitants of heaven,\" they replied, \"Labbaika Rabbana Wasa'daika.\" God said, \"Are you all satisfied?\" They replied, \"Why are we not satisfied. Truly You have given us something that You have never given to one of Your creatures.\" So Allah said, \"I will give you something better than that?\" They said, \"O our Lord! What could be more than that? So Allah replied, \"I will bestow on you My pleasure. Then I will not be angry with you forever.\" (Al-Bukhari and Muslim from Abi Sa'id al-Khudri). the pleasure of the Divine, even though the pleasure of the Divine encourages them to do good or renounce evil. They only want outward pleasures as they experience in the world. Some of them have high thinking abilities and are able to draw closer to God. They hope for the pleasure Allah and make it the ultimate goal and the highest happiness for his life. Allah is All-Knowing about human affairs, the contents of their hearts and all their secrets. Nothing is hidden from Allah. Therefore He will reward all human actions according to the degree of piety each -respectively."
		   },
		   {
			"id": 309,
			"surah": 3,
			"ayat": 16,
			"tafsir": "The characteristics of a pious person are those whose hearts already feel the joy of faith, those whose tongue trembles pronounce this confession of faith when praying and worshiping. They protect themselves from committing immorality, submit to Allah fervently and beg Him, \"O our Lord, we really have believed in what You have sent down to the Messenger of Allah with faith that seeps into the depths of our hearts, which guides the intellect. our minds, and master our bodily works. So O our Lord, erase our sins with Your forgiveness and keep us away from the punishment of hell. Truly You are Forgiving, Most Merciful \". Prayers to avoid the punishment of hell are specific, because people who are freed from the punishments of hell mean that they have won and the best place to return. What is meant by faith in the confession of pious people is pure faith, which is manifested in the ability to protect oneself from disobedience, and to do many good deeds. Salaf scholars have agreed that what is meant by faith includes intentions, words and deeds. It is this faith that gives guidance to reason and human actions in accordance with their nature."
		   },
		   {
			"id": 310,
			"surah": 3,
			"ayat": 17,
			"tafsir": "This verse mentions the qualities of believers that distinguish them from others. With these characteristics they get the pleasure of Allah swt. All of these characteristics they have, and each of these characteristics has a level of excellence, thanks to these characteristics they get what Allah promised them. These characteristics are: 1. Patience. The most perfect patience, is patient and steadfast in suffering in carrying out obedience and avoiding God's prohibitions. When the passions are already agitated, and the soul is already subject to committing disobedience, it is patience that will stem it. Patience is also what determines (strengthens) faith and maintains obedience to the limits set by the Shari'a (religious law). It is patience that can maintain human dignity in times of trouble in the world, and preserve people's rights from the hands of greedy people. Patience is a condition for achieving honest, obedient, and istighfar traits. 2. is correct. Truth is the pinnacle of perfection. True and honest in faith, words and intentions. 3. Obey. Obedience is perseverance in carrying out God's commands and avoiding His prohibitions by submitting and being submissive to God. Being submissive and solemn is the soul and essence of worship. Without submission and solemn worship becomes empty, like a tree without fruit. 4. Spending wealth in the way of Allah, both obligatory and sunnah, because spending wealth for good deeds is highly emphasized and recommended by religion. 5. Beristighfar at dawn, which is the time before dawn, close to dawn. It means the midnight prayer at the end of the night, which is the best time to sleep and it is difficult to leave it. But the soul and heart at that time was very clear and calm. This prayer is followed by istighfar reading and prayer. It is found in the hadith books of Sahih Bukhari and Muslim, and in the books of the musnad and sunan, the narrations of a number of friends. Rasulullah said: 'Our Lord, the Most Holy and Most High, descends every night to the sky of the world in the last third of the night. He said, \"Whoever prays to Me, I will grant it. Whoever asks Me, I will give it. Whoever asks Me for forgiveness, I will forgive him.\" (Al-Bukhari and Muslim) As for istighfar (ask for forgiveness) what is meant by religion is istighfar accompanied by repentance nasuha, and adjusting actions according to religious provisions. Nasuha repentance is repentance by actually stopping sinful acts and not repeating them again, and trying to replace them with good deeds."
		   },
		   {
			"id": 311,
			"surah": 3,
			"ayat": 18,
			"tafsir": "The oneness of Allah is stated by upholding the arguments and with evidence of His creation in nature and human beings, as well as sending down verses that explain it. The angels also stated the oneness of Allah and conveyed it to the prophets. The prophets stated testimony that was strengthened by the knowledge that had been instilled in their souls which was higher than other knowledge obtained by experience. Likewise the scholars, also stated the oneness of Allah and explained it. They witness Allah with testimony accompanied by scientific evidence and reasons. This verse shows the high dignity of the scholars because they have been aligned with the noble angels, that is, both can witness the oneness of Allah. \"Upholding justice\" is upholding balance in faith, because monotheism is a straight belief, pure monotheism that is not interfered with in the slightest by disbelief in Allah and associating partners with Him. Also upholding a balance in worship, manners and deeds, meaning upholding a balance between spiritual strength and physical strength. Allah commands us to perform prayer services and other acts of worship to purify the soul. God commands us to eat good food, to nourish the body. Allah forbids us to be excessive in religion and too much in loving the world. Likewise, Allah put the law of balance in this nature. Whoever looks closely at this natural law and its order, it will be clear to him that the law of balance is the most perfect. Allah establishes a perfect balance in this world as a clear proof of the truth of His wisdom. The unity of order in nature shows the oneness of His creator. At the end of this verse, the oneness of His Essence is affirmed in the divine nature. \"There is no God but He, the Almighty, the All-Wise.\" The attribute \"Almighty\" in this verse implies the perfection of His nature and the attribute \"All-Wise\" indicates the perfection of His knowledge. A power cannot be perfect unless there is an absolute right to act. Justice (balance) will also not be perfect, except by knowing all circumstances and benefits. So whoever's perfection has reached this point, no one can influence him in carrying out that balance and there is not a single creature that escapes His law."
		   },
		   {
			"id": 312,
			"surah": 3,
			"ayat": 19,
			"tafsir": "The only religion recognized by Allah is Islam, the religion of monotheism, the religion that unites Allah. He explained that the only legitimate religion in the sight of Allah is Islam. All religions and Shari'a brought by the previous prophets have one essence, namely \"Islam\", that is surrender to Allah Almighty, uphold His commandments and humble themselves to Him, even though the Shari'a differ in several ways. religious obligations and others. A true Muslim is someone who is sincere in carrying out all his deeds, and has strong faith and is clean from shirk. Allah ordains religion for two kinds of purposes: 1. Cleansing the human soul and mind from untrue beliefs. 2. Repairing the human soul with good deeds and purifying sincerity to Allah. Then Allah described the disputes of the People of the Book about the true religion. In fact, they would not have left the religion of Islam, the monotheistic religion brought by the prophets, had their leaders not persecuted and transgressed so that they split into several sects and killed the prophets. Division and war between them should not happen because they are one religion. But because of the jealousy among their leaders, and their support for one sect to defeat another, the schism arose. The split grew fiercer after the leaders misled their opponents by interpreting religious texts according to their desires. At the end of this verse, a warning is given to those who disbelieve in Allah's verses by emphasizing the punishment that will be meted out to them."
		   },
		   {
			"id": 313,
			"surah": 3,
			"ayat": 20,
			"tafsir": "In this verse, it is explained how the Prophet Muhammad should be. facing the attitude of the People of the Book against Islam. In dealing with them, the Prophet was ordered to answer when they raised objections to the teachings he brought, by telling them that he only submitted himself to Allah as well as those who followed him. Such an answer is to avoid useless debates, because the evidence of their fallacy is clear. Then Allah ordered the Prophet to say to the Jews, Christians and Arab polytheists he was facing: \"Do you (want to) convert to Islam?\" It means do you want to accept Islam so that you submit yourself to Allah. The question was asked by the Prophet after he had repeatedly shown the proofs of its truth, and in fact they had also understood it. Or do they actually still want to continue their disbelief and resistance. Indirectly the expression of the Prophet's question showed their stupidity and dullness of mind and denounced their hard attitude. \"Indeed, if they become Muslims, they will receive guidance. Becoming a Muslim means surrendering absolutely to the oneness of Allah. This is where the soul of all religions was brought by the apostles, namely surrendering to Allah Almighty. They will surely get great benefits and survived the abyss of misery. Because their surrender to Allah Almighty will encourage them to follow the teachings brought by the Prophet Muhammad, namely the teachings of Islam. But if they refuse, then it is not his responsibility, because his job is only to convey the teachings of Allah. \"Allah is All-Seeing of His servants\", Allah is All-Knowing whose hearts are closed among His servants, whose eyes are blind to see the truth, and who is desperate to seek Divine guidance. Allah Knows everyone among His servants who can receive taufik and guidance from Him."
		   },
		   {
			"id": 314,
			"surah": 3,
			"ayat": 21,
			"tafsir": "In this verse Allah denounces the attitude of the Jews in the days of the apostles before the Prophet Muhammad, who blindly followed the actions of their forefathers. When in fact they already know the mistakes and crimes of their ancestors. With the description of this verse, it becomes clearer the badness of the Jews. It is difficult for them to find reasons to purify themselves by declaring faith. Their crimes are proven in history, causing them to be reproached and cursed. The Jews at the time of the Prophet Muhammad were considered guilty, because they did not show disapproval of the crimes of their forefathers. In addition to killing the prophets, the ancient Jews also killed hukama' (wise men), namely those who are referred to in this verse as \"those who order people to act justly\". They consist of clever people, who make justice the pillar of priority. The dignity of the hukama' in giving instructions is below the dignity of the prophets and so is their influence. Killing hukama' means killing reason and destroying justice. This is a great sin and very detrimental. For this reason, Allah gave a warning to the Jews that they would receive a painful punishment in this world and in the hereafter. Who is more deserving of this painful doom if not those who are cruel and exceed the limit in committing crimes, such as killing prophets and geniuses?"
		   },
		   {
			"id": 315,
			"surah": 3,
			"ayat": 22,
			"tafsir": "In this verse, it is emphasized that people who commit crimes then all the deeds they do in this world are canceled. In the world they will not get human praise, because they are in error and evil. Allah cursed them, and exposed the crimes that they covered up through His prophets and apostles. Such is the meaning of the cancellation of their deeds in the world. As for the hereafter, they will not be rewarded for all their deeds, they will even be plunged into a painful punishment. They will live in hell. No one can help them from the pressure of Allah's punishment. Allah has abolished the reward of the killers of the prophets and the hukamas who uphold justice, and deprived them of help from anyone. The killers will be rewarded with immeasurahble punishment and no one can help them. Allah has prepared three kinds of doom for them: a. All pain and misery is accumulated on them. This is a painful doom. b. All kinds of favors that they hope for disappear, with the deletion of the rewards of the deeds they do in the world. In this world they are cursed and reproached, and in the hereafter they suffer. c. Constantly suffering from the punishment, because no one will help release them from the punishment. This is what Allah meant in the verse which means \"and they never find a helper\"."
		   },
		   {
			"id": 316,
			"surah": 3,
			"ayat": 23,
			"tafsir": "They turn away from practicing the book that they believe in themselves when the book is not according to their wishes. This is the behavior of adherents of Judaism at the time of the Prophet Muhammad. The Jews came to the Prophet with their strong will to accept a decision. But if the decision given is not in accordance with what they want, they refuse to carry it out. They only memorize part of the contents of the Torah, while the rest they forget. They don't understand the part they memorize well and they don't practice it either."
		   },
		   {
			"id": 317,
			"surah": 3,
			"ayat": 24,
			"tafsir": "This verse explains the reasons or reasons that prompted the Jews to oppose and turn away from the truth. They have an understanding that has been embedded in their commitment that they will not be punished by the fires of hell except for a certain number of days. This firmly attached notion permeates their soul, and eventually forms their mental attitude. So they take lightly the punishment that will befall them. This is because they feel there is a blood relationship with the prophets, and think that they will be saved from the torment of hell fire as long as they remain Jewish. So according to their understanding, a hereditary relationship with the prophet, as well as being registered as a follower of the Jewish religion, guarantees entry to heaven. Those who take God's threats lightly, believing that punishment will not come upon them, means that they have underestimated God's commandments and His prohibitions. Such is the condition of a people, when they start to leave their religion, they no longer hesitate to commit crimes. This symptom of turning away from religion is seen in Jews, Christians and also among Muslims. The Jews think that if they go to hell they will only be punished in \"countable days\" which is 40 days; the number of days they used to worship the calf. Actually there is no reliable information to confirm when the day in question, except for the empty assumption of the Jews. All the lies they have concocted have deceived them in religion, for example their saying, \"We are the children of God and His beloved\" and their words, \"Indeed, our forefathers were the prophets who will intercede for us\" and \" Indeed, Allah has promised Jacob not to punish his descendants, except for a short time.\""
		   },
		   {
			"id": 318,
			"surah": 3,
			"ayat": 25,
			"tafsir": "This verse refutes and invalidates what the Jews said in the previous verse. This verse is structured in the form of a sentence asking what will be the condition of the Jews when the Doomsday, which is beyond doubt, has come. This form of the sentence describes the greatness of the commotion that occurred that day, and the great torment that would be inflicted on the Jewish people. They will fall into the abyss of suffering, there will be no way to save themselves. In fact, the notion of the Jews that they would be able to escape the doom easily was simply wishful thinking. On that terrible day people will see clearly what they have done, good or bad will be presented to them. Then all deeds will be rewarded with happiness if the charity is good or with sorrow if the charity is bad. There is no special privilege that can be given to adherents of a certain religion and certain groups. Nor does a nation have privileges over other nations even if they call themselves sya'bullah al-mukhtar (God's chosen people) or God's children. Retribution on the Day of Judgment is in accordance with the good and bad intentions contained in the heart and in accordance with the good and bad deeds that have been done. On that day there will be perfect justice. There will not be reduced in the slightest in return for an act and will not be added. What is considered on that day is a person's faith and the influence of that faith on his deeds while in the world. If he does not believe, then he will go to hell, because of his bad deeds. If his faith is not damaged, because it is balanced with good deeds or balanced between good and bad, then he gets a reward according to the degree and level of each."
		   },
		   {
			"id": 319,
			"surah": 3,
			"ayat": 26,
			"tafsir": "In this verse, Allah instructs the Prophet to declare that Allah, the Most Holy, has the highest authority and is the All-Wise with His perfect actions in compiling, administering and completing all matters and upholding the balance of laws in this world. So Allah gives government affairs to whom He wills among His servants. There were times when Allah gave this power along with the rank of prophethood like the family of Abraham, and there were times when he only gave the power to govern according to social law, namely by governing tribes and nations. Allah is also the one who revokes power from those He wills, because they turn away from the straight path, namely the path that can maintain power because they leave justice and cheat in government. Thus it has also applied to the Children of Israel and other nations due to their tyranny and corruption of mind. Allah also gives power to whom He wills, and humiliates whom He wills. People who are given power are people whose words are heard, have many helpers, influence the human soul with their authority and knowledge, have broad sustenance and do good to all humans. As for those who are humiliated, they are people who are lowly in morals, feel weak in their spirit to defend their honor, are unable to repel their invading enemies and are unable to unite their followers. Even though no glory can be achieved without unity to uphold the truth and oppose tyranny. If the community is united and runs according to sunatullah, it means that they have prepared everything to face all eventualities. The number or number of a people is not a guarantee to be able to realize power and gather strength. The polytheists of Mecca, the Jews and the Arab hypocrites were deceived by the large number of followers compared to the followers of the Holy Prophet, even though this did not benefit them in the slightest. As Allah says: They said, \"Indeed, if we return to Medina (back from the Bani Mustalik war), surely the strong people will expel the weak people from there.\" Even though the power is only for Allah, His Messenger and for the believers, but the hypocrites do not know. (al-Munafiqun\/63: 8) Historical facts prove that a large number alone does not show strength. Look at the Eastern nations, they are many in number but can be controlled by Western nations which are less in number, due to rampant ignorance and enmity, or divisions that occur among themselves. In this verse it is also explained that all virtue lies in His hands whether prophethood, power or wealth. This shows that it is God Himself who gives it according to His will. No one has virtue except Allah. In this verse only virtue is mentioned. Actually all that is bad and evil is also under the power of God. This is understood from Allah's statement that He is Almighty over all things. In this verse, virtue is only mentioned because it is adapted to circumstances. The circumstances that prompted the disbelievers to oppose and belittle the message of the Prophet Muhammad were his poverty, the weakness of his followers and their small numbers. Therefore Allah ordered the Prophet to take refuge in those who have all the kingdoms. In His hands is all power and glory. Allah reminds Rasulullah SAW that all goodness and wealth is in His hands. So nothing can prevent Him when Allah gives poverty and wealth to His Prophet or to the believers who He wills, as explained by Allah in His word: And We want to give gifts to those who are oppressed in the earth (Egypt), and want to make them leaders and make them inheritors (of the earth). (al-Qasas\/28: 5)"
		   },
		   {
			"id": 320,
			"surah": 3,
			"ayat": 27,
			"tafsir": "The night part is included in the day, so the night time is shorter than the day time. Allah included part of the day in the night, causing the night to be long and the day to be short. This is common in countries that have four seasons, so the nights are longer than the days in winter. It is not surprising that after this fact, Allah, the All-Wise, grants prophethood or kingdom to whomever He wills, or revokes the prophethood and kingdom from whoever He wishes. Allah takes care of all human affairs, just as He takes care of the changes of day and night. Allah brings out the living from the dead like he takes out the coconut stalk from the seed, brings out the human from the nutfah, or brings out the fowl from the egg. Thus Allah brings out the dead from the living like bringing out a foolish child from a pious person, and an infidel from a believer. God's nature is also explained in language that is easy to understand, with examples that can be witnessed by humans, in everyday events. Night is put into day, day is put into night, living plants are brought out from the soil which are inanimate things, eggs which are inanimate things, from chickens which are living things. The verse above talks about the seeds of plants and about \"bringing out the living from the dead and bringing out the dead from the living\". Another verse that is similar and even clearer is surahh al-An'am\/6: 95, which means the following: \"Indeed, it is Allah Who causes grains (grains) and seeds (dates) to grow. He brings out the living from the dead and brings out the dead from the living. That is (the power of) Allah, so why do you still turn away?\". (al-An'am\/6: 95) From a scientific point of view, these things can be interpreted as follows: 1. This verse contains a message that creation is not a coincidence, because if this is a coincidence, then it cannot be sustainable. Creation takes place in two opposite ways. Who can do this must be the Almighty. The words \"bring out the living from the dead\" reveal God's power to resurrect the dead in the hereafter. But the raising of the dead to life and vice versa is also seen in the daily occurrences in the process of developing plant seeds. 2. The second tafsir is that the seed is used as an example in setting the cycle between life and death which continues to roll. ï‚§How the seed exemplifies the cycle is like this. For plants, seeds are the main breeding tool, because seeds contain new plant candidates called institutions or embryos. With these seeds, plants can maintain their kind and can spread them to other places. In plant morphology, it is known that there are closed seeds called Angiosperms, and naked\/open seeds called Gymnosperms. Seeds vary in size, shape with layered seed coats, and hardness (ranging from soft to hard as rock). When the seed reaches the required condition, the seed will grow and the seed coat which protects the part of the seed inside will be penetrated by the institution. Even a layer of seed coat that is as hard as a rock can be broken. ï‚§The cycle of life and death is the secret of nature's wonders and the secret of life. The main feature of this cycle is that non-organic hydrogen, carbon dioxide, nitrogen and salts on earth turn into organic substances which are the material of life for animals and plants thanks to the help of sunlight. Furthermore, these substances die again in the form of excrement of living things and in the form of bodies that are worn out due to bacterial and chemical dissolution, which turn them into non-organic substances to enter a new life cycle. That's how the Creator brings out life from death and brings death out of life at every moment. This cycle continues to rotate and only occurs in creatures that are given life. The Qur'an also uses the word \"dead\" to mean \"infidel\", and the word \"life\" to mean \"faith\" such as: And what is a person who has died and then We revived and We gave him a light that enables him to walk in the midst of in a crowd, like a person who is in darkness, so he cannot get out of there? Thus it is made pleasing to the disbelievers in what they are doing. (al-An'am\/6: 122) The term \"living\" is used to mean the opposite of \"dead\", whether the living are á¸¥issiyyah such as animal and plant life or the artiwiyyah such as knowledge and faith. \"The living are brought forth from the dead\" and so on is a fact, that Allah has the power that He gives to those whom He wills. Allah brought out a prince of the apostles from the illiterate Arab nation. It was the Prophet, Muhammad saw, who prepared them with the strength and will to become the strongest ummah, who could destroy the fortresses of slavery and uphold independence. Meanwhile the Jews (the Children of Israel) wallow in taqlid, slavery and oppression of kings or rulers. Allah gives power to whoever He wants, then withdraws His gift from whoever He wants, only based on His sunnah and law. All matters are in the hands of Allah. No one can judge and estimate His calculations. It is He who has the power to revoke power from whoever He wills and humiliate it, and only He also has the power to give that power to a nation and glorify it. That way, it is very easy for Allah. Allah gives sustenance to whom He wills without reward."
		   },
		   {
			"id": 321,
			"surah": 3,
			"ayat": 28,
			"tafsir": "Muslims are prohibited from making infidels as close friends, leaders or helpers, because this will harm them both in matters of religion and in the interests of the people, especially if in this case the interests of the infidels take precedence over the interests of the Muslims themselves, that is will help spread disbelief. This is strictly prohibited by religion. Believers are prohibited from having close relations with unbelievers, either because of kinship, old friends from the time of ignorance, or because they are neighbors. This prohibition is nothing but to protect and maintain the benefit of religion, and so that Muslims are not disturbed in their efforts to achieve the goals desired by their religion. As for forms of friendship and cooperation agreements, which presumably can guarantee the benefit of Muslims are not prohibited. The Prophet himself had entered into a friendship agreement with the Bani Khuza'ah while they were still polytheists. Then it is stated that whoever makes a disbeliever as his helper, by leaving believers, in matters that harm religion, means he has released himself from God's guardianship, disobeys God and does not help his religion. This also means that his faith in Allah has been cut off, and he has been included among the disbelievers. ¦ Whoever among you makes them a loyal friend, then in fact he is one of them ¦ (al-Ma'idah \/ 5: 51) A believer may enter into intimate relations with an infidel, in a state of fear of harm or to provide benefits to Muslim. It is not forbidden for an Islamic government to enter into friendship treaties with non-Islamic governments; with the intention to refuse harm, or to gain benefits. The permissibility of making friendship is not specific only in a weak condition, but it is permissible at any time, in accordance with the rules: Rejecting harm is prioritized over bringing benefit Based on this rule, the scholars allow \"taqiyah\", namely saying or doing something contrary truth to ward off calamity from enemies or for the salvation of souls or to preserve honor and property. So whoever utters kufr words because he is forced, while his heart (soul) remains a believer, because to protect himself from destruction, he does not become a disbeliever. As had been done by 'Ammar bin Yasir who was forced by Quraysh to become a disbeliever, while his heart remained faithful. Allah says: Whoever disbelieves in Allah after he believes (he earns Allah's wrath), except for the one who is forced to disbelieve while his heart remains calm in believing (he has not sinned), but he who expands his chest for disbelief, Allah's wrath will fall on him and they will get a big punishment. (an-Nahl\/16: 106) As happened to a friend who was pressured when answering Musailamah's question, \"Do you admit that I am Allah's apostle? The answer was, \"Yes\". Because of that the friend was left alone and not killed. Then a friend others when asked the same question, he replied, \"I am deaf\" (three times), then this friend was arrested and killed. After this news reached the Prophet Muhammad he said: \"The person who has been killed returns to Allah with confidence and his honesty, as for the others, then he has used the leniency that Allah has given him, therefore there is no demand for him\". from a place where he cannot carry out religious orders and is forced to do \"taqiyyah\" there. It is a sign of the perfection of faith if someone who are not afraid of reproach in practicing Allah's religion. Allah said: ¦..therefore do not be afraid of them, but fear Me, if you are believers¦ (Ali 'Imran\/3: 175) Allah said: ...Therefore do not be afraid of people, (but) fear Me. ¦. (al-Ma'idah\/5: 44). Included in \"taqiyah\", being kind, gentle to infidels, wrongdoers, wicked people, and giving them wealth to reject their disturbances. It is not close friendship that is prohibited, but rather the way it is in accordance with the guidance of the rules: \"An act that can maintain the honor of a believer, is included in charity.\" (History of ath-thabrani). In another hadith from Aisyah ra: Someone came to ask permission to meet the Messenger of Allah and at that time I was beside him. Then Rasulullah said, \"(He is) the worst citizen of this people\". Then Rasulullah allowed him to face, then he spoke to the person in a friendly and gentle manner. The Prophet said, \"O, 'Aisyah, in fact among the worst people are those who are abandoned by other people because they are afraid of their crimes.\" (Al-Bukhari) Against those who violate Allah's prohibition above, Allah warns them with direct punishment from Him and no one can stop them. Finally to Allah is the return of all creatures. Everyone will be rewarded according to their deeds."
		   },
		   {
			"id": 322,
			"surah": 3,
			"ayat": 29,
			"tafsir": "Allah knows everything that is contained in the heart of a Muslim when he enters into an intimate relationship with an infidel. Was it because they liked the disbelievers, or was it done for the purpose of saving themselves. If a Muslim does this because he tends to disbelief, Allah will surely punish them. Meanwhile, if they do this to keep themselves and their hearts in the faith, Allah will forgive them and will not punish them for work that does not harm religion and people. Allah rewards them according to His own knowledge which covers all the contents of the heavens and the earth. At the end of this verse Allah says that: \"God has power over all things\". Therefore, do not you Muslims dare to disobey Him and do not cooperate with His enemies. All forms of immorality, whether hidden or visible, are always known to Allah and He has the power to repay them."
		   },
		   {
			"id": 323,
			"surah": 3,
			"ayat": 30,
			"tafsir": "Furthermore, in this verse Allah warns of a certain day when every human being will witness all his actions during his lifetime. People who get the reward of their good deeds, feel happy and happy for the reward they receive. People will also see his crimes, and want them to be kept away from him. Then Allah repeated His threat by warning people against His torment, that is, humans should fear the wrath of Allah, by doing good deeds, rejecting the wiles of Satan and repenting to Him. Then this verse closes with the statement that Allah is Most Merciful to His servants. Al-Hasan al-Basri said, \"Among Allah's affections is that He warns people of His Self-power, introduces them to the perfection of His knowledge and nature, for whoever knows this perfectly, then he must feel called to seeking His pleasure and avoiding His wrath. Among Allah's mercy are: Allah makes human nature inclined to goodness and always hates things that lead to evil, so that the influence of evil in the soul can be removed by repentance and good deeds."
		   },
		   {
			"id": 324,
			"surah": 3,
			"ayat": 31,
			"tafsir": "In this verse Allah commands the Prophet to say to the Jews, if they truly obey Allah then they should acknowledge the apostleship of the Prophet Muhammad, namely by carrying out everything that is contained in the revelations that Allah revealed to him. If they had done this, Allah would be pleased with them and forgive them all the mistakes they have made and forgive their sins. Following the Apostle seriously both in good faith and good deeds will eliminate the impact of immorality and abomination of their souls and eliminate the injustices they committed before. This verse provides strong information to disprove the confessions of those who claim to love Allah at any time, while their deeds are contrary to those words. How is it possible to gather in oneself love for Allah and at the same time turn away from His commandments. Whoever loves Allah, but does not follow the path and instructions of the Messenger of Allah, then the confession of love is fake and a lie. The Messenger of Allah said: \"Whoever does an action not based on our orders, the action is rejected.\" (History of al-Bukhari). Whoever loves Allah with complete obedience, and draws closer to Him by following the orders of His Prophet, and cleanses himself with good deeds, Allah will forgive his sins."
		   },
		   {
			"id": 325,
			"surah": 3,
			"ayat": 32,
			"tafsir": "It was narrated that when the Prophet Muhammad, peace be upon him, recited verse 31 above, Abdullah bin Ubayy said, \"Muhammad has equated obedience to him with obedience to Allah, and he told us to love him as the Christians love Jesus.\" So Allah revealed this verse 32. The meaning of this verse is, \"Tell them, O Muhammad. Obey Allah by following all His commandments and stay away from all His prohibitions. Obey the Messenger of Allah by following his sunna, and make his instructions as (guidelines) in life. This verse gives also understanding that Allah swt made it obligatory for us to follow the Prophet Muhammad saw, because he is Allah's Messenger. If those disbelievers turn away and refuse to accept the messenger's call because of their acknowledgment that they are Allah's children and His beloved, then Allah does not loves disbelievers, namely people who have been diverted by their lust from Allah's verses. Therefore Allah does not like them and even keeps them away from the pleasures of His heaven and will be angry with them on the Day of Judgment."
		   },
		   {
			"id": 326,
			"surah": 3,
			"ayat": 33,
			"tafsir": "Allah has chosen Adam and the Abrahamic family, as well as Imran's family, and made them human beings of choice in their respective times, and given them prophecies and treatises. ) Adam was the first messenger as the father of all human beings who had been chosen by Allah as a Prophet. Then his Lord chose him, so He accepted his repentance and gave him guidance. (thaha\/20: 122) From the descendants of Adam, the prophets and apostles were born. The second apostle is Noah, as the second father of mankind even though there is an opinion that says that Noah was the first apostle. In his time there was a great flood that destroyed most of humanity. God had saved him and part of his family from that terrible disaster in one ark. Many of his descendants became prophets and apostles. Then his descendants spread to several countries. Then came Abraham as a prophet and apostle. After Abraham came successively several prophets and apostles from his descendants, such as Ishmael, Isaac, Jacob and Asbath (grandchildren of the Children of Israel). Among the prominent descendants of the Prophet Abraham are: The Ismail family, and Imran's family, namely Isa and his mother, Maryam bint Imran descended from Jacob. Then the prophethood was closed with a son from the descendants of the Prophet Ismail namely Muhammad saw."
		   },
		   {
			"id": 327,
			"surah": 3,
			"ayat": 34,
			"tafsir": "The two families - Ibrahim's family and Imran's family are one descendant which has branches into several generations). Abraham's descendants were \"Ishmael and Isaac.\" Ibrahim himself is a descendant of Prophet Noah, and Prophet Noah is from Prophet Adam. Imran's family namely Musa, Harun, 'Isa and his mother were the grandchildren of Prophet Ibrahim."
		   },
		   {
			"id": 328,
			"surah": 3,
			"ayat": 35,
			"tafsir": "In the last verse it was explained that the two big families, namely the Ibrahim family and Imran's family, were intertwined with each other, so this verse explained the story of one of their prominent descendants, namely Imran's wife who was pregnant. He offered a child who was still in his womb to be a servant who always served and worshiped at Baitulmakdis. He will not burden his child with anything later, because that child has only been willing to serve there. At the end of verse 34 it has been explained that Allah hears what Imran's wife says, knows his holy intentions, and hears his praise to Allah when he is munajat. These things caused his prayers to be answered, and his hopes fulfilled as a gift and goodness from God. In some of these verses the name Imran is mentioned twice. The first is in verse 33, namely Imran the father of the Prophet Musa as; while the second is in verse 35, namely Imran father Maryam. The span of time between the two people was extremely long. This verse shows that a mother may make an offer to her child, and may benefit from the child for herself. In this verse there is also a lesson, namely that we should pray to Allah so that our children become people who are diligent in worship and are useful for their religion, like the prayer of the Prophet Zakaria which is narrated in the Qur'an. After Imran's wife gave birth, and it turned out that it was a girl when she expected a boy, sadness appeared on her face and she gave up hope to carry out her vows, she said, \"O my Lord, I gave birth to a girl.\" It was as if he was begging God for forgiveness, that the girl was not worthy of fulfilling her vows, namely to serve in Baitulmakdis. But Allah knows better the dignity of the baby girl who was born, even he is much better than the baby boy he begged."
		   },
		   {
			"id": 329,
			"surah": 3,
			"ayat": 36,
			"tafsir": "This verse emphasizes the nobility of the daughters who are born, and rejects the notion that baby girls who are born are lower in dignity than baby boys as expected by Imran's wife. After Imran's wife realized the fact that her child was a girl, and believed that there was wisdom and a secret behind this fact, she declared that the baby would be named Maryam. He will not take back what he has vowed to give up his child to serve in Baitulmakdis, even though the baby is a girl and according to his opinion it is not appropriate to guard Baitulmakdis, but he will become a servant of God who is solemn. Imran's wife begged Allah to guard and protect her baby from the devil's temptations that might keep him away from virtue. Regarding this matter, Rasulullah SAW said as follows: \"Every child and grandson of Adam who was born was touched by Satan at the time of his birth except for Maryam and her son\". (History of al-Bukhari and Muslim from Abu Hurairah)."
		   },
		   {
			"id": 330,
			"surah": 3,
			"ayat": 37,
			"tafsir": "Allah accepted Maryam as a vow because of her mother's request. Allah pleased him to be a person who solely worships and serves in Baitul Makdis even though Maryam is still small and only a woman. Even though the people who are set apart to serve in Baitulmakdis are usually men who are mature and able to carry out the service. Allah also maintains and educates him and raises him in the best way. The education given by Allah to Maryam includes spiritual and physical education. Then he becomes a person who is healthy and strong in body and has good character, clean spiritually and physically. Allah has also made the Prophet Zakaria as his caretaker and protector. It was narrated that his mother picked him up and took him to the mosque, then placed him in front of the monks who were there. He said, \"Take this child I promised you\". So they fought over the baby, because she was the daughter of their leader. Each wanted to be his caretaker. Prophet Zakaria then said, \"I have more right to care for her, because her aunt is my wife.\" But they refused unless it was determined by lot. So they went to the Jordan River, releasing their respective arrows into the river, with the intention that whose arrows can withstand the flow of the river water and can quickly rise, it is he who has the right to care for Maryam's baby. It turned out that it was Prophet Zakaria's arrows that survived and appeared to slide on the surface of the water, while the other arrows were washed away by the current. So in the lottery, Prophet Zakaria won and Maryam was immediately handed over to him to be cared for and educated under the care of his own aunt. When Maryam was getting older, she started worshiping at the mihrab. Every time the Prophet Zakaria entered the mihrab, he found there food and various fruits which were not available at that time because the season had not yet come. Zakaria once asked Maryam where she got the fruits from, even though it was the dry season. So Maryam replied, \"The food is from Allah. Verily, Allah gives sustenance to those whom He wills without calculation.\" The story was put forward to confirm the prophethood of Muhammad, and divert the minds of the People of the Book who limited the gift of prophecy to the descendants of the Children of Israel. Also to correct the opinion of Arab polytheists who reject the prophethood of Muhammad. for assuming he was only human like them. Allah has made Adam the chosen one and caliph on earth, and made Noah the second chosen one and father of mankind and then chose Abraham and his family to be the chosen people and guides of mankind. The Arabs and the People of the Book know this, but the Arab polytheists boast of being descendants of Ishmael and adherents of the Abrahamic religion, and the People of the Book are proud of their election to the Imran family from the descendants of the Children of Israel, the grandson of the Prophet Abraham. Many Arabs and people of the Book know that Allah has chosen them solely at His will, as His grace and mercy. So what is preventing Allah from making Muhammad the chosen one on this earth, just as Allah chose them too? Allah chooses whoever He wills among His creatures. Allah has chosen Muhammad peace be upon him and made him the leader of mankind and brought them out of the darkness of shirk and ignorance to the light of truth and faith. No one from the family of Ibrahim and Imran was more influential than Muhammad peace be upon him."
		   },
		   {
			"id": 331,
			"surah": 3,
			"ayat": 38,
			"tafsir": "In the previous verse, it was told about Imran's family, so in this verse, the story about Zakaria's family is explained, between the two of them there is a very close relationship, in order to express the priority of Imran's family. When Zakaria saw Maryam's high honor and dignity before God, his desire arose to have a child similar to Maryam in intelligence and glory before God. Even though Zakaria knows that his wife is a barren and old woman, he still hopes for a gift from God. In the mihrab where Maryam worshiped, Zakaria offered a prayer to Allah, may He be pleased to bestow upon her a pious offspring, and obedient to serve Allah. Prayers that arise from the bottom of a heart that is sincere and full of trust in the love of Allah, who is All-Hearing and allows all prayers, then Allah will immediately answer his prayers."
		   },
		   {
			"id": 332,
			"surah": 3,
			"ayat": 39,
			"tafsir": "When Zakaria was still standing at the mihrab, and had just finished praying, the Angel Gabriel came to him informing him that God would grant him a son named Yahya. Yahya will later confirm the prophet created by Allah, who was born not like other babies, through a mother and father, namely Prophet Isa. Yahya was a prophet who led his people to glory and happiness. The prophet who distanced himself from lust and lust, because he solely served Allah. He was a prophet who was born from a noble lineage, namely the prophets salawatullahi 'alaihim. It is narrated that the Prophet Yahya when he was a child, once walked past children who were playing. They asked him to play. He said, \"I was created not to play around\"."
		   },
		   {
			"id": 333,
			"surah": 3,
			"ayat": 40,
			"tafsir": "After Zakaria was convinced of the truth of the good news, he began to wonder at the possibility of having a child from his old self. Glide the words from his tongue, \"Oh my God, how is it possible that I will have a son, when I am old and my wife is barren\". Allah said and His words were conveyed by angels, \"Thus Allah does whatever He wills. If Allah wills something, Allah causes it or He makes it not through the usual causes. Nothing happens without His will. All things are in His power, and there is no need to ask how God made them, because the human mind cannot know that."
		   },
		   {
			"id": 334,
			"surah": 3,
			"ayat": 41,
			"tafsir": "After Zakaria heard the answer from the Angel Gabriel, he said, \"My Lord, give me a sign that my wife will become pregnant.\" According to al-Hasan al-Basri, Prophet Zakaria asked this to immediately get joy in his heart or to welcome favors with gratitude, without waiting for the child to be born. Then Allah explained that the sign that his wife was pregnant was that he himself did not speak to other people for three days, except by using hand signals, head and so on, and he made dhikr and glorified Allah. God ordered Zakaria not to speak for three days, so that all his time would be used for remembrance and glorification of Him, as an expression of true gratitude. According to al-Qurthubi, some commentators said that the three days that Zakaria became mute was as Allah's punishment against him, because he asked an angel for a sign after their conversation. At the end of this verse, Allah commands Zakaria to always remember Allah and recite as much as possible in the morning and evening, as a sign of gratitude to Him."
		   },
		   {
			"id": 335,
			"surah": 3,
			"ayat": 42,
			"tafsir": "This verse recounts Imran's family, after the previous verse tells about the affairs of Zakaria's family which also includes Imran's family. In this verse Allah reminds the Prophet Muhammad, about the events experienced by Maryam when she was visited by the Angel Gabriel (Maryam\/19: 19-21). Jibril and Maryam's conversation here is not like Gabriel's conversation with the prophets, which is the transmission of Allah's revelation to them, but as an angel's talk with Allah's saints, which is in the form of inspiration. Maryam's expression of gratitude to Allah for her uninterrupted worship and obedience, added to the maintenance of her personal glory and perfection, and increased her distance from all bad traits. Because it is natural that Maryam received inspiration from Allah through Gabriel as a tribute to her. Jibril emphasized that God had chosen Mary to serve in Baitul Makdis, and cleansed her from physical and spiritual shame, and had determined her to give birth to a prophet even though she had never been touched by a man. Allah made Maryam special over all women in her time. Word of the Apostle saw: The best women in this world are four people: Maryam bint Imran, Asiyah the wife of Pharaoh, Khadijah bint Khuwailid and Fatimah bint Muhammad. (Al-Bukhari and Muslim history from Hisham bin Hakim)"
		   },
		   {
			"id": 336,
			"surah": 3,
			"ayat": 43,
			"tafsir": "Allah made it obligatory for Maryam to obey Him as a sign of gratitude for the blessings He bestowed on her, with His words which mean, \"Obey Maryam your Lord, prostrate, and bow with those who bow\"'. What is meant by \"sujud\" here is prostration like prostration in prayer and what is meant by \"bowing\" is the prayer itself. This verse instructs Maryam to pray in congregation with other people. Prayer according to the understanding of the Jews at that time was: prayer or prostration. Prostrating by placing their foreheads on the ground or on the floor is their prayer, all the worship that Maryam does takes place in the mihrab."
		   },
		   {
			"id": 337,
			"surah": 3,
			"ayat": 44,
			"tafsir": "This verse closes by directing the conversation to the Prophet Muhammad that the story is a story that he did not know yet, while it is in accordance with the contents of the Torah. Allah states in this verse that what has been narrated, namely the story of Maryam and Zakaria are stories that the Prophet Muhammad, or his family, never witnessed, nor did Muhammad ever read them in a book, nor were they taught by a teacher. That is the revelation, which Allah sent down to him through the intermediary of Ruhul-Amin, to prove the truth of his prophethood, and to break hujjah (argument) of people who deny it. Then Allah also stated that the Prophet Muhammad, was not yet present and of course did not witness them when he drew lots between Zakaria and them, to determine who would care for Maryam. The Prophet Muhammad was not present in their dispute to care for Maryam. They were forced to draw lots to settle the dispute. Those who disputed were prominent people namely their priests. The dispute was solely driven by a great desire to nurture and care for Maryam. It is possible that this wish was due to the fact that their father, Imran, was their leader, so they hoped to receive blessings from the task of caring for Maryam. It could also be because they know in religious books that in the future a major event will occur for Maryam and her son. Or maybe it's because they think that raising a baby girl is a religious obligation, because the baby is promised to serve in Baitulmakdis. This verse is placed after explaining the story of Maryam, to explain that the Prophet Muhammad never read the story of Imran's family (the Children of Israel), because he was an Ummi. Besides, he had never heard from anyone because he was also living in the midst of people who were ummi. There is no way for the Prophet to know the ins and outs of this story except by witnessing it with his own eyes, or by way of revelation. Witnessing it with your own eyes is an impossible thing, because the event occurred in the era before the birth of the Prophet Muhammad. If so, the Prophet Muhammad would have known it by way of revelation. The People of the Book who deny the Qur'an say that the contents of the Qur'an that are in accordance with the contents of their book are from their book, while those that contradict the contents of their book they say are not true. The contents of the Qur'an that are not contained in their book are also considered untrue. Such an attitude is simply due to their arrogant and enmity nature. Muslims believe that everything explained in the Qur'an is true. Because there are enough arguments to prove that Muhammad is a prophet. Verses of the Qur'an that contradict the previous books are seen as a correction to the errors contained in those books, because they have been changed or are no longer suitable for the benefit of the people."
		   },
		   {
			"id": 338,
			"surah": 3,
			"ayat": 45,
			"tafsir": "In this verse Allah reminds the Prophet Muhammad, of Maryam's story when Jibril came to her, bringing her the good news that she would give birth to a pious son. When Jibril delivered the good news, Allah had chosen him, purified him to continue to worship Allah and always be grateful to Him. What is meant by the angel here is Jibril, as in the word of Allah: \"¦ Then We sent Our Spirit (Gabriel) to him, so he appeared to him in perfect human form.\" (Maryam\/19: 17). Jesus is called the \"word of God\", as a notification of the process of his creation which is different from ordinary human events. Isa as is named al-Masih, while Almasih is the title of king, because the word Almasih in the Torah and the Bible means \"the one who is swept or who is anointed\". Sweeping and anointing it is a stipulation in their customs that whoever has been wiped with holy oil by the head of a religion, then he has become holy too, is capable of holding a kingdom, has knowledge and power, and receives blessings. Here God shows that Jesus always gets blessings even though he has never been wiped with this holy oil. There are also those who say that the name Isa comes from the Greek word \"yasu\", meaning \"the saved one who is chosen\". The prophets used to explain that there would come a Messiah, he was a king who would restore the lost power of the Children of Israel. So when Jesus was born and named al-Masih, a group of them believed in him. The Jews who denied it argued that the promised one had not yet come. He was named Ibn Maryam (son of Maryam) to give the sense that Isa was born without a father, which is why he was attributed to his mother. Isa as has a prominent position in the world, because he has a place in the hearts of believers and is respected. The improvements that Isa left behind will remain in the future. His greatness is far more evident than the greatness of rulers or kings because people respect those rulers and kings to escape their persecution, out of fear of their tyranny, or to take advantage of being given a worldly position. Such greatness is sheer grandeur, without the slightest trace in the soul, perhaps even causing hatred. Apart from that, Jesus has greatness in the afterlife, namely a high position and glory, because he is always close to Allah."
		   },
		   {
			"id": 339,
			"surah": 3,
			"ayat": 46,
			"tafsir": "Jesus had spoken to humans as a child in his cradle to explain his mother's cleansing from the accusations leveled against him, and to prove his prophethood. Jesus also spoke with humans when he was an adult, that is, after Allah appointed him to be an apostle and sent down revelations to him, to convey His commands and prohibitions to humans. He belongs to the pious people who have been given favors by Allah, namely the prophets, the sidiqin and the martyrs'."
		   },
		   {
			"id": 340,
			"surah": 3,
			"ayat": 47,
			"tafsir": "Maryam directed her words to God who had sent Jibril, namely, \"how will I get a son, even though I have no husband. Is this an incident with a previous marriage, or is it solely by God's nature\". Perhaps the meaning of Maryam's words was to express her admiration for Allah's power and see this as a great miracle. Allah explains that such a birth will happen when Allah wills Him, Allah creates what He wills. If Allah wants to determine something, it is enough to say to him \"you will be\", then he will be. Allah creates whatever He wills, including creating miraculous things, which deviate from customs such as creating children without fathers. Even the Prophet Adam has been created without a father and mother. The verse above inspires people to study, study and research, but the results or outputs of research cannot always be applied or used. This depends on studies that are based on the principle of benefit for humans and do not contradict Islamic values and laws. As long as it does not conflict with Islamic law, the research results can be used or applied in society. Genetics, for example, like other branches of science, is encouraged by Islam to be studied. However, if in his research there are sections that lead to violations of Islamic law, its application must be reconsidered. So is the science of genetics. If the direction of a research has entered the \"prone\" area, it is better to do an evaluation to make a decision to continue or stop it, or to divert the direction of research in a direction that further promotes the realization of welfare for humans. Perceptions about cloning there are various opinions. Cloning is not creation. When viewed carefully, what is done in cloning activities is simply destroying the cell nuclei from the ovaries and replacing them with the cell nuclei from individual donors. The nucleus can be taken from somatic cells, and not necessarily from reproductive cells. This process will produce offspring that are identical to the donor individual. Everything is done on the same type. If cloning is seen as an illustration of the Islamic belief regarding being \"born again\", then this is not true, because in the verse below it is clear that the \"rebirth\" of humans is controlled by Allah swt. Allah says: \"And it is He who begins creation and then repeats it again, and that is easier for Him. He has the highest nature in the heavens and on earth. And He is the Most Mighty, All-Wise.\" (ar-Rum\/30: 27). The Islamic view of genetics can be exemplified in the verse below: \"We will show them Our signs (greatness) in all directions and in themselves, so that it is clear to them that the Qur'an is true. Isn't it enough (to you) that your Lord is a witness over everything?\" (Fussilat\/41: 53) This verse inspires humans to try to \"read\" their own genes. This is in the framework of his efforts to recognize himself and give thanks to Allah swt. By reading genetic mapping, we will find out about, among other things, the presence or absence of hereditary diseases. Thus, this knowledge will contribute to human health in an effort to prevent certain diseases and how to deal with them. However, if in the process of disclosing knowledge, then branching out into something that tends to harm humans, then Islam will reject it. Human cloning for example, Islam firmly rejects it. Several things that can be stated regarding the reasons for Islam's rejection of human cloning, include: 1. Humans were created by Allah in the most perfect form, and higher than other creatures. The verse below says this: \"And indeed, We have glorified the children of Adam, and We carried them on land and in the sea, and We gave them sustenance from the good and We preferred them over many of the creatures We created with perfect advantage.\" (al-Isra'\/17: 70) By cloning himself, humans have humbled themselves in front of other creatures created by God. Everything is back up to ourselves. 2. Cloning is contrary to the diversity of creation. God created the universe on the basis of diversity. Meanwhile, human cloning is based on uniformity by duplicating all the characters of the human donor. Uniformity, for example in appearance and physique, will greatly interfere with the activities of daily life. For example, in one class, all students are clones of the same individual. If one of the students made a mistake, it was very difficult for the teacher to tell which child was wrong, because all the students looked and physically looked exactly the same. 3. If human cloning is permitted, how should we regulate kinship and kinship between cloned individuals and donor individuals. Can these two be said to be brothers, or sons and fathers, or are they both himself? This situation would greatly confuse everyone. It is even possible that this situation will destroy the social order that already exists today. 4. Cloning is contrary to the pattern of natural law which states that every creation consists of pairs as described in surahh adz-dzariyat\/51 verse 49 (\"And We created everything in pairs so you understand.\"). Cloning violates this verse, because the baby is not produced from the meeting of the sperm and the ovary. What is needed in cloning is only one person (whether male or female) as a donor. 5. The emotional connection between parents and children will not occur. While this relationship is very important in shaping the character of the child. From the few lists above, it can be seen that there are too many laws of nature that would be violated if human cloning was permitted. There are still many other sciences that need to be disclosed in order to support the welfare of human life. Such is the description of God's nature and the certainty of His will. The description of the speed at which what Allah wills is realized without time limits and without any causative factors, Allah explains in His word: And Our command is only (with) one word like the twinkling of an eye. (al-Qamar\/54: 50) What was ordered must have happened soon. Such an order is called the takwin command. People who deny Allah's verses do not justify Jesus being born without a father, because their minds are only limited to ordinary events. They are not aware of how this universe came to be, while they also do not have an 'aqli' argument that improbable the occurrence of a child without a father. Every day we witness extraordinary events that were never thought possible. Some of them have known causes, so they are called new discoveries. There are also those whose reasons are unknown and are then called natural deviations from its laws. Believers believe that something that happens not according to the usual causes, proves the power of Allah and that the causes for something to happen do not always have to be in accordance with reasoning. The present generation has seen and witnessed strange and extraordinary events. If something like that was seen by the ancients, they would have considered it an act of magic, or an act of a jinn. They do not try to find reasons to deny something that has happened that they themselves do not know the causes of. Philosophers and scientists today have determined that it is possible that an animal was born from something that was not an animal. So if that's the case, if an animal is born from another animal of a different kind, it is very possible and reasonable."
		   },
		   {
			"id": 341,
			"surah": 3,
			"ayat": 48,
			"tafsir": "In this verse it is explained that God, who taught Jesus the knowledge of writing and true knowledge, drives a person's will to do useful deeds, and God gives him the ability to understand the Torah and all the secrets of its laws. The Messiah knew all the secrets of the law, then explained them to his people. Also Allah taught Jesus (as) the Gospel which He revealed to him."
		   },
		   {
			"id": 342,
			"surah": 3,
			"ayat": 49,
			"tafsir": "Allah made Jesus as an apostle to the Children of Israel. Allah sent Jesus to the Children of Israel to tell them that his arrival brought several great signs namely \"miracles\" to them as a reinforcement of his message. These miracles include: First: Prophet Isa was able to make something in the shape of a bird out of the ground and after blowing it, it became a living bird like an ordinary bird, with Allah's permission. Actually it was Allah who created life in the bird's body, by His power when Jesus blew it, to make a miracle for his prophethood. It is narrated that when Jesus declared himself a prophet and performed his miracles, the Children of Israel asked him to make bats. So he took some dirt, formed it into a bat and blew it on it. So the bat flew in the sky. The bat flew as long as the man could see it, and when it was out of sight of them, it fell to the earth and died. This is very different from the occurrence of other creatures of God. It has become sunatullah that the miracles given to His prophets when their people ask for it and make their faith depend on that miracle. So if Isa's people asked him that, Allah also gave it. Second: Jesus as able to treat blindness and hair loss, even though these two diseases were diseases that were difficult for healers to treat at that time, even though medicine at Isa's time was advanced. It has also become sunatullah, that the miracles of the prophets were in the form of something that was very famous in their time. For example, Moses was given a stick that turned into a snake and swallowed all the snakes of the sorcerer. The Egyptians at that time were very famous for their skill in magic. To Jesus as, Allah gave miracles of a type of healing that exceeded the ability of the physicians of that era, even though they already had high expertise. Likewise, the Prophet Muhammad was given a miracle, namely the Qur'an, because what they were proud of at that time was literature. Third: He can bring the dead back to life, by Allah's permission. Many narrations explain that Jesus revived people who had died. Among them revived a daughter before being buried and revived Ya'azir before his body rotted. But there is no history that explains that he revived a corpse that had become bones. Fourth: 'Isa (as) can tell what people eat and what people keep in their homes. The difference between the occult messages conveyed by Isa (as) and the messages of astrologers and sorcerers, which are sometimes accurate and sometimes not, is that astrologers and soothsayers reveal something by paying attention to the causes that allow them to know something about it. Not so the message conveyed by the Prophet Isa as well as by the prophets and the apostles. They are not looking for or trying to find causes and also do not commit deceit, but merely a notification that Allah swt conveys to them. Thus the miracles of Prophet Isa witnessed by the Children of Israel. Indeed, in these miracles there are instructions for them to justify the apostleship and prophethood of Jesus. There is also a lesson for these miracles to think about and draw a conclusion, namely that Jesus (as) spoke the truth about them. They also know that what Isa called for was a true order from Allah SWT. If they justify Allah's verses, acknowledge His Oneness and believe in Prophet Musa and the Torah he brought, surely they will also believe in Prophet Isa as"
		   },
		   {
			"id": 343,
			"surah": 3,
			"ayat": 50,
			"tafsir": "Prophet Isa came to the Children of Israel to justify the Torah that they had, acknowledged and strengthened it. Not replacing or blaming the laws, except for mitigating some of the laws for its adherents, which were previously felt as a very heavy burden for them. Because of that Isa said, \"I have made lawful for you some of what has been made unlawful for you\", namely some of the food that was forbidden for them due to their tyranny and their many requests. Then by Jesus, made lawful again as explained by Allah in the Qur'an. Because of the injustice of the Jews, We have made forbidden for them the good food that was (formerly) made lawful; and because they often hinder (others) from the path of Allah. (an-Nisa'\/4:160). Among the foods that have been made lawful again are fish, camel meat, fat, and they are also allowed to return to work on the Sabbath. Prophet Isa also explained the issues that became their dispute, as explained in the Qur'an. ¦ And to explain to you some of what you dispute, then fear Allah and obey me. (az-Zukhruf\/43: 63). Then Prophet Isa repeated the description of the last verse, saying, \"I have come to you with miracles from your Lord.\" This miracle testifies to the truth of the message he brought as mentioned, namely creating birds, healing blindness since childhood and leprosy, bringing the dead back to life, and telling hidden things and so on. Because he came with clear miracles, clear verses, he also called on his people to fear Allah and not to offend Him, and to obey everything that was taught to them."
		   },
		   {
			"id": 344,
			"surah": 3,
			"ayat": 51,
			"tafsir": "This verse explains the words of the Prophet Isa to his people, that Allah swt is their Lord together who must be worshiped, with the statement of the oneness of Allah and the acknowledgment that Allah is the Lord of the universe, therefore worship Him. This is one of the commands of Prophet Isa to his people, so that they have the right belief, namely monotheism, always fulfilling all God's commands and staying away from all His prohibitions both physically and mentally. That is the straight and wide path outlined by the apostles, namely the path that leads to the happiness of the world and the hereafter\"."
		   },
		   {
			"id": 345,
			"surah": 3,
			"ayat": 52,
			"tafsir": "In this verse and the following verses, the relationship between Prophet Isa and his people is explained, and what he has done from them; whether in the form of obstacles, challenges, violence, and plans to kill him. In addition, Allah also explains the help that has been given to groups of people who acknowledge the oneness of Allah, as well as His threats delivered to unbelievers, and the torment that befalls them in this world and the hereafter. When Jesus (as) believed that his people, the Children of Israel, were still in disbelief and met with strong rejection from them, even intending to hurt him, he asked \"Who are my helpers to Allah?\" Isa really met a tough challenge from the Jews, they surrounded him and made fun of him. They said, \"What did such and such have eaten last night, what has he kept in his house for tomorrow morning?\" Even though Jesus (as) could answer it, they still made fun of him. In this story there is a lesson for the Prophet Muhammad, and at the same time it is a consolation for him. Here it is evident that even though many miracles were reported by the prophets, they did not automatically lead to faith. Faith depends on whether the person invited is willing to accept it. It was at this time of increasing challenges and threats that Jesus told the Hawari people who was willing to surrender his soul to Allah and help His apostles. Hawariyun replied, \"We are the helpers of Allah's religion\", they provided their energy to reinforce the da'wah of Allah's Apostle and were willing to uphold his teachings and abandon the wrong teachings of the past. The help that Isa asked for did not require them to join the war, but simply by practicing their religion and preaching. Hawariyun is a group of people among the Children of Israel who believe in Christ, and are willing to help, help him and follow the light that was sent down to him (As-shaff\/61:14). They declared to Isa (as) that they believe in Allah and asked for testimony that they were people who surrendered. This statement was a factor that led to victory in the face of the resistance of their enemies. God."
		   },
		   {
			"id": 346,
			"surah": 3,
			"ayat": 53,
			"tafsir": "After they had witnessed the apostleship of Isa as and witnessed the power of Allah who commanded to believe in the Book that was revealed to him, and obey all His commands, they said, \"O our Lord, we have believed in what You have sent down. \". This statement was an attitude of condescension to Allah, and revealed their situation to Allah, after having told His messenger to further explain their stand. \"We have followed the apostle\", and obeyed all the commands he brought from Allah. Placing the word \"follow\" after the word \"faith\" in this verse shows that the Hawariyun people's faith has reached a certain level, which gives direction to their soul in carrying out every action. True knowledge is knowledge that requires actions that are in accordance with that knowledge, while knowledge that does not influence actions is knowledge that is vague and lacking, does not give confidence and peace. Many people think that he is knowledgeable, but if he commits an act it turns out that his actions cannot be mastered and controlled, only then will he realize that he was wrong in his confession. After these Hawariyun people declared to Allah their testimony on the truth of His book and messenger, they also asked Allah to include them in the group of people who acknowledge the oneness of Allah."
		   },
		   {
			"id": 347,
			"surah": 3,
			"ayat": 54,
			"tafsir": "After Allah explained about the Hawariyun people, then in this verse Allah explained the attitude of the Children of Israel towards Jesus as, they tricked him and intended to destroy him by reporting and slandering Jesus to their king. But God deceived and thwarted their deception and they were not able to kill him. Isa as, was lifted into the sky by Allah and replaced with someone similar to him, so that people believed that it was Jesus who was crucified. Allah's plan, which is unknown to His servants, is actually to uphold His sunnah and perfect His wisdom."
		   },
		   {
			"id": 348,
			"surah": 3,
			"ayat": 55,
			"tafsir": "Allah replied to the deceit of the disbelievers by raising Jesus as to Him. In this case there is good news for the Prophet, about the arrival of Allah's help to save him from the deception of the disbelievers so that they will not succeed in carrying out the deception. Allah will raise the Prophet Isa to Him and will pass him on when he dies, after descending from the sky at the appointed time) in accordance with the words of the Prophet Muhammad, \"By (Allah), in whose hand my soul is, Jesus the son of Maryam will descend among you as a just judge, then he will break crosses, kill pigs, stop wars, and distribute wealth, so that no one will receive it (because it no longer needs) and feel that his prostration (worship) is more important than this world and everything in it.\" (Al-Bukhari's history from Abu Hurairah). \"Allah cleansed Jesus from the disbelievers\", by saving him from the crimes, insults and insults and accusations, which they will do, and will make his believing followers believe that he is Allah's servant and His messenger, believe in Isa's words that he was sent to give good news (as-shaff\/61:6) about the coming of a Messenger of Allah, who will come after him, whose name is Ahmad (Prophet Muhammad) (as-shaff\/61:6). Allah will elevate those who believe to a high degree, unlike the Jews who deceived and belied the Prophet Isa, who was humiliated by Allah. The elevation of this degree is sometimes in the field of faith which is spiritual in nature, and in the field of morals and the perfection of manners and their proximity to the right and far from the wrong. There are times when the worldly advantage is that they will hold the reins of leadership in the world. Then all humans will be returned to Allah, namely on the day of resurrection, and Allah will decide the matters they dispute in religious matters including disputes that occur between the followers of Jesus as and those who do not believe in him"
		   },
		   {
			"id": 349,
			"surah": 3,
			"ayat": 56,
			"tafsir": "Allah explained that the Jews who belied the Prophet Muhammad would be tortured with painful torments both in this world and in the hereafter. The torment of the world that will befall them is that they will be killed and captured and controlled by other nations. While the torment of the Hereafter is Allah's torment on the Day of Judgment which is very painful. At that time they will get no help from anyone."
		   },
		   {
			"id": 350,
			"surah": 3,
			"ayat": 57,
			"tafsir": "Allah, explains that those who believe and those who do good deeds, are people who justify the Prophet Muhammad and acknowledge his prophethood, acknowledge the Book he brought (the Qur'an), practice all of Allah's commands, and leave all the prohibitions. His. Allah will perfect their reward, without the slightest lack. It is further explained that people who have the opposite character mean that they have wronged themselves, they are not loved by Allah and will receive a very painful torment."
		   },
		   {
			"id": 351,
			"surah": 3,
			"ayat": 58,
			"tafsir": "Allah explained that the news that was conveyed to the Prophet Muhammad, about Prophet Isa, Maryam, Zakaria and his son Yahya, and the stories of the Hawariyun people and Jews from the descendants of Israel, were true stories and as a correction to various beliefs that were spread among the People of the Book at that time. In this story there are various kinds of examples and valuable lessons, so that people who believe can take guidance from it and understand Allah's law and principles regarding social life. In this story there is clear evidence that rejects the opinion of the Christian envoys from the inhabitants of Najran and the opinions of the Jews who belied Muhammad's message, and the religious truths he brought."
		   },
		   {
			"id": 352,
			"surah": 3,
			"ayat": 59,
			"tafsir": "This verse was revealed in connection with the arrival of the Christian envoy Najran who said to the Messenger of Allah, \"Why do you criticize our Prophet?\" Rasulullah said, \"What have I said?\" They replied, \"You say that Jesus is a servant of Allah.\" The Prophet Muhammad said, \"Yes, it is true that he is a servant of Allah, an apostle and His words that were conveyed to Maryam, a holy virgin.\" Then they got angry and said, \"Have you ever seen a human being born without a father? So if you are right, show us an example.\" Then Allah revealed this verse. In this verse it is explained that actually the amazing incident of Jesus is like the creation of Adam, who was made from clay, both of them were created by Allah in a different way from the creation of ordinary humans. The similarity is that Jesus was created without a father, and Adam was created without a father and without a mother. People's denial of the incident of Jesus without a father, while he acknowledged the incident of Adam without a mother and father, is something that is contrary to logic. God created Adam as a human being by giving a spirit to his body, solely because of His will and when God said: \"Be then he was.\" (Ali Imran\/3: 59) in another verse Allah says: ¦ Then, We made him a different (form) creature. ¦ (al-Mu'minun\/23: 14). The verse above (59) is a series with the next two verses, descended in the year of the mission, the 10th year of Hijri."
		   },
		   {
			"id": 353,
			"surah": 3,
			"ayat": 60,
			"tafsir": "What is meant by \"That is the truth that comes from God\" is that what Allah has announced to Muhammad saw, about the Prophet Isa and Maryam is the truth, not what the Christians have said that Christ is the son of God; nor is it like the opinion of the Jews that the Prophet Isa was the result of adultery between Maryam and Yusuf an-Najjar (Yusuf the carpenter or Yusuf the younger brother of Eli). Thus Muslims have received convincing knowledge about Jesus and Maryam. This prohibition was directed to the Prophet Muhammad so that he would not doubt, even though it was impossible for the Prophet Muhammad to doubt Allah's verses. This has two meanings: 1. That the Prophet Muhammad when he heard this verse increased his confidence and he was satisfied with his belief. 2. If the Prophet Muhammad, who had a high position, was prohibited from doubting the truth of the story, then his people were more affected by this prohibition."
		   },
		   {
			"id": 354,
			"surah": 3,
			"ayat": 61,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad if there are still people who dispute the truth of the news about the incident of Jesus (as), after receiving an explanation, they should be invited to mubaha (mubahalah) to prove who is right and pray that Allah will drop His curse on those who lie. This mubahalah is a reflection of the truth of that belief. Allah ordered the Prophet Muhammad, to invite each family both from his side and from their side, consisting of children and wives, to hold this mubahalah. In the verse, it is mentioned first that the wife and children of the Prophet in mubahalah, because someone is more worried about his family than himself. This implies that the Prophet Muhammad believed with full confidence that an unwanted disaster as a result of mubahalah would not befall his family and himself. Then this verse is known as the mubahalah verse. Regarding the invitation to the mubahalah, it has been narrated through various sources that the Prophet Muhammad had invited Christians from the city of Najran in Yemen to hold a mubahalah, but they refused. Imam al-Bukhari and Imam Muslim also narrated a hadith that the Najran delegation led by al-'Aqib and as-Sayid visited the Prophet. Then he wanted to hold mubahalah (oath) with them. So one of them said to his people, \"Do not discuss with him. By Allah, if he is really a prophet and then he talks with us, surely we will not be happy forever, and there will not be a generation that will carry on our lineage.\" Then they said to the Prophet, \"We will give you what you ask for, so send us a man who is trustworthy.\" Then the Prophet said, \"Stand up, O Abu 'Ubaidah,\" so after he stood up the Prophet said, \"This is a trusted person among this people.\" (Al-Bukhari's history from Huzaifah). Abu Nu'aim also narrated a hadith from Ibn 'Abbas in the book ad-Dala'il through the sanad of 'Atha' from Adh-ahak from Ibn 'Abbas that eight Christians from the people of Najran came to the Prophet. Among them were 'Aqib and as-Sayid. Then Allah revealed this verse. Then they said, \"Give us three days' respite.\" Then they went to Bani Qurayza, Bani Nadir and Bani Qainuqa from among the Jews. Then they signaled to make peace and not hold mubahalah with the Prophet. Then they said, \"He is the prophet whose arrival was announced in the Torah.\" Then they made peace with the Prophet with an agreement to pay 1,000 pieces of clothing in the month of Safar and another 1,000 pieces accompanied by some money in the month of Rajab. It was narrated that the Prophet Muhammad, had proposed Ali, Fatimah and their two sons (Hasan and Husain) besides himself, to muhabalah and the Prophet came out with them saying, \"When I pray, let you read, Amen\". Ibn 'Asakir narrated a hadith from Ja'far from his father, that after this verse was revealed, the Prophet took Abu Bakr with his children, Umar and his children and Usman with his children. It can be understood from these verses that the Prophet Muhammad, had ordered to invite those who opposed the nature of the incident of Jesus as from among the people of the Book to gather, whether men, women or children, and also the Prophet gathered people believers whether men, women or children. They also invite mubahalah to Allah SWT so that He will curse those who intentionally lie. The Prophet's invitation to mubahalah showed full confidence in the truth of what he said, whereas the reluctance of Christians and Jews who were invited to mubahalah showed the reasons and the falsity of their beliefs."
		   },
		   {
			"id": 355,
			"surah": 3,
			"ayat": 62,
			"tafsir": "The story that was revealed to the Prophet Muhammad, about the Prophet Isa, is the truth, not the opinion of the Christians and not the opinion of the Jews. There is no God who must be worshiped but Allah because Allah created all things and no one can equal Him. In this verse there is clearly a rebuttal against Christians who say that Allah is one of the three persons. In another verse Allah says: Indeed, those who say that Allah is the third of the three have disbelieved, ¦ (al-Ma'idah\/5: 73). Then Allah emphasized again that Allah is the Almighty, the Most Wise, no one can match Him."
		   },
		   {
			"id": 356,
			"surah": 3,
			"ayat": 63,
			"tafsir": "If they reject the religion of monotheism, it means they are among those who do damage. They were considered turned away because they refused to follow and justify Muhammad's apostleship, and did not want to accept the belief in the oneness of God that was brought by him and did not dare to grant mubahalah's invitation. Allah knows the mentality of those who make damage and have evil intentions that they keep in their hearts."
		   },
		   {
			"id": 357,
			"surah": 3,
			"ayat": 64,
			"tafsir": "Allah ordered the Prophet Muhammad to invite the People of the Book, namely Jews and Christians, to have a fair dialogue in seeking the principles of equality of the teachings brought by the apostles and the books revealed to them, namely the Torah, Bible and Al-Qur' an. Then Allah explained the purpose of the invitation, namely that they should not worship other than Allah, who has absolute power, who has the right to create shari'a and has the right to make lawful and forbidden things, and not associate partners with Him. This verse contains: Tawhid Uluhiyah for Allah, namely the oneness of Allah as mentioned in His word: ¦ that we do not worship other than Allah ¦ (Ali 'Imran\/3: 64). The nature of Tauhid Rububiyah in His word is the oneness in governing His creatures: ¦and that we do not make gods other than Allah. ¦. (Ali 'Imran\/3: 64) This provision was agreed upon by everyone, and it can be proven, Abraham as was sent by God to bring the religion of monotheism, as well as the Prophet Musa as found in the Torah; Allah said to the Prophet Musa, \"Verily the Lord is your idol, you have no other god beside Me, do not make sculptures, and do not make any images of anything that is in the heavens and on the earth, as well as that which is in water. Don't prostrate yourself to statues and pictures and don't surrender yourself to them. Likewise, the Prophet Isa was sent by Allah with such teachings. Then the Prophet Muhammad as the Seal of Prophets, he was sent with the same teachings. -The Qur'an contains the words of Allah: Allah, there is no god but Him. The Living One, who constantly takes care of (His creatures), does not get sleepy and does not sleep¦(al-Baqarah\/2: 255). The conclusion of the invitation is : Muslims and People of the Book both believe that nature is one of the creations of Allah the Almighty. It is He who created and manages it and it is He who sent prophets to them, to convey information explanations about actions that are pleasing and disapproving to Him. Then the Prophet Muhammad invited the People of the Book to agree to uphold religious principles, rejecting things that are doubtful, which are contrary to religious principles. So when Christians get information from the teachings brought by the Prophet Isa such as the words \"Son of God\" they should be interpreted with a tafsir that does not conflict with the principles agreed upon by the prophets, because we all will not get any of the words of the prophets who can be interpreted that in fact the Prophet Isa is the god who is worshiped. We also will not get information saying that Jesus invited people to worship himself and his mother, but Prophet Jesus invited people to worship the One God and sincerely worship Him. In the beginning, the Jews believed in monotheism, then disaster happened to them, namely when they recognized that any law that was enacted by the religious leaders was of the same status as the law that came from God. Likewise Christians walk the path like the Jews. They added an amalgamation of sin in their religion. This is a very dangerous problem in Christian society so that the selling of aflat letters (letters of atonement) from the church arose. That way they can collect a lot of money. Therefore, there is a movement that demands improvement. This group is known as Protestant. It was narrated from 'Adi bin hatim that he said, \"I came to the Messenger of Allah, while on my neck there was a cross necklace made of gold. Then the Messenger of Allah said, \"O 'Adi, throw the idol off your neck.\" I also heard the Prophet Muhammad read surahh at-Taubah: They make the pious (Jews) and their monks (Christians) gods besides Allah, ¦ (at-Taubah\/9: 31). Then 'Adi said to him, \"O Messenger of Allah, they don't worship priests\". the pastor.\" The Jews and Christians refused and disobeyed; and they remained in their position, namely worshiping other than Allah and believing in the existence of gods besides Allah, who were used as intermediaries to Allah. They obeyed the provisions their provisions, both regarding what is permitted and what is forbidden by the priests. Allah swt ordered the Muslims to tell them that, the Muslims only worship Allah and only obey Him solely. In this verse there is a stipulation that all matters related to worship or with halal and haram, are only in the Al-Qur'an and Hadith, which are used as the main guideline in determining them, not the lead priest and not even the opinion of famous jurists. . Because if so, surely this will lead to fellowship in the oneness of rububiyah and deviation from the guidance of the Qur'an as stated in the word of Allah: Do they have gods other than Allah who determines religious rules for those whom Allah does not allow? And if there had not been a provision that would delay (the punishment from Allah) the punishment would have been carried out between them. And indeed, the unjust people will get a very painful punishment. (asy-Shura\/42: 21) It is also stated in the word of Allah: And do not say to what your tongues lie about \"This is lawful and this is unlawful,\" ¦ (an-Nahl\/16: 116). As for issues that are not directly related to the hereafter and worship, such as judicial matters and political affairs, Allah has bestowed His power on knowledgeable people, such as Ahlul Halli wal 'Aqdi, namely experts in various fields in society. So what they stipulate should be obeyed as long as it does not conflict with religious principles. This verse became the basis and mainstay for the Prophet's da'wah to invite the People of the Book to practice it. At the time the Prophet invited them to convert to Islam, as contained in his letter addressed to Heraclius and Muqauqis and Kisra Persia."
		   },
		   {
			"id": 358,
			"surah": 3,
			"ayat": 65,
			"tafsir": "Allah denounces the actions of Jews and Christians who are always at odds in terms of the purity of their respective religions, because they think that their religion is the most correct. People of the Book, Jews and Christians are criticized, why they are at odds with each other and argue about the religion of their ancestor Prophet Abraham. Jews say that Prophet Abraham was a Jew and Christians say that Prophet Abraham embraced Christianity. They think so because the Prophet Abraham is considered a symbol of the high dignity of each group. In their book there is praise for Ibrahim as, both in the old agreement and in the new agreement, just as the Quraysh glorify his name, they also admit that their religion is in accordance with the religion of Abraham. According to the statement of the Qur'an, their confession is not even remotely grounded, because Abraham's teachings did not in the least leave an imprint on their religious ceremonies. The truth is that the Prophet Abraham embraced a religion according to the religion revealed to the Prophet Muhammad. This similar provision has been implied by the word of God, that the Torah and the Gospel were sent down by God after the arrival of Abraham. Logically, because the two books were revealed after Abraham, there should not have been disagreements and arguments like that. This violent dispute shows the untruth of the reasons put forward by them, because it is impossible for those who came first to follow those who came after them. That is why God rebuked them, \"Don't they think.\" This shows that if they were willing to think, such debates would not occur. In this case there is a strong sign, which shows the weakness of their thoughts and proofs (arguments). Regarding the sabab nuzul of this verse, Ibn Ishak and Ibn Jarir have put forward a history from Ibn 'Abbas, he said, \"Christians from Najran and some Jewish priests gathered before the Prophet Muhammad, then they disagreed. The priests said: The Prophet Abraham did not embrace any religion except Judaism, while the Christians said: Prophet Abraham did not embrace any religion other than Christianity."
		   },
		   {
			"id": 359,
			"surah": 3,
			"ayat": 66,
			"tafsir": "It is only natural for people to argue about the affairs of Prophet Isa and it is also natural for their debates to be based on things they know. But it turns out that among those who argued there were those who were involved in exaggerated matters, to the point of admitting that the Prophet Isa was God, even among them there were the opposite, accusing him of being a braggart and a liar. This happened because each party did not know the truth, so that each party could not avoid mistakes. Then Allah denounced the Jews and Christians who argued about the religion of the Prophet Abraham, because their actions were not based on sound reasons and science. So it is not better and reasonable if they just follow the revelations that have been revealed to the Prophet Muhammad, which really came from Allah who has infinite knowledge. Therefore God confirmed to them that God knows everything that is real and unreal, visible and invisible. This shows that there is an understanding that regarding things that are occult, people should not debate and not justify them except what has been explained by revelation. In other words, human knowledge is limited by scope, time and place, while Allah's knowledge is not related to these provisions."
		   },
		   {
			"id": 360,
			"surah": 3,
			"ayat": 67,
			"tafsir": "Allah gives firmness to those who argue who the real Prophet Abraham was (an-Nisa'\/4:125). This verse is the answer to the debate between Jews and Christians regarding the religion of the Prophet Abraham. They each argue that Abraham adhered to the religion they embraced. Their opinion is actually a lie because it is not based on real evidence. The truth is that the information is based on the revelation that Muslims believe in, because Muslims embrace a religion like the religion embraced by the Prophet Abraham and Islam has principles brought by the Prophet Abraham. So it is clear that the Prophet Abraham did not embrace Christianity nor was he a follower of Judaism, but Prophet Abraham was a man who obeyed Allah, kept to Allah's instructions and was submissive and obedient to everything He commanded. The Prophet Abraham did not adhere to the beliefs of the polytheists, namely the infidels of the Quraysh and other Arab tribes, who considered themselves to follow the religion of the Prophet Abraham. From this verse it can be understood that the Prophet Abraham was a person who was glorified by all parties, whether Jews, Christians or polytheists. But unfortunately their opinion is not true, because the Prophet Abraham was not religious like theirs. He is a Muslim who is sincere to Allah, never associates anything with Him."
		   },
		   {
			"id": 361,
			"surah": 3,
			"ayat": 68,
			"tafsir": "The person who has the most right to be a supporter of Prophet Abraham and the most loyal to his religion, is not the person who only admits that Prophet Abraham embraced his religion, but the person who follows in the footsteps of Prophet Abraham and continues his da'wah. Of course that person is a person who believes in monotheism and sincerely practices his religion. They must be people who surrender themselves to Allah alone, far from shirk traits. These characteristics are found in the Prophet Muhammad, and his followers. They embrace the monotheism religion, in the slightest there are no teachings on the worship of leaders and do not justify the existence of intermediaries in the relationship between humans and God. They are sincere and do good deeds solely because of Allah and not because of shirk and joy. All of these are the core teachings of Islam. Therefore, if there is a religion that does not have these principles, then that religion is far from deviating and only remnants remain. Then Allah promises that He will provide assistance, strength and taufik to the believers because Allah controls and controls their affairs, and improves their condition and rewards according to how much they practice Islam."
		   },
		   {
			"id": 362,
			"surah": 3,
			"ayat": 69,
			"tafsir": "The efforts of a group of People of the Book will be in vain, and their deceit will befall them themselves, because their actions are always directed towards the goal of misleading the believers. They don't have the opportunity to pay attention to how to get clues. Their views will be closed so that they cannot see the truth of the verses revealed to the Prophet Muhammad, which provide an explanation of the truth of his prophethood. It can be said that they don't think properly, they even waste their minds, and they have corrupted their own nature so they can't reach the truth. The attitude and actions of a group of People of the Book are criticized, because they are not aware of their bad condition. They eventually fall into the valley of error and can no longer see the truth that leads to the straight path. Many of the People of the Book wish that they could return you after you believed, became disbelievers again, because of envy in themselves, ¦. (al-Baqarah\/2: 109) They want you to become disbelievers as they have become disbelievers, so that you become equal (to them). ¦ (an-Nisa'\/4: 89) Thus it can be seen that the aim of the People of the Book raises doubtful issues among the Muslims, is nothing but to mislead the believers from the true religion, thus denying the teachings of the Prophet Muhammad ."
		   },
		   {
			"id": 363,
			"surah": 3,
			"ayat": 70,
			"tafsir": "Allah denounces the People of the Book who deny Allah's verses; even though they know in their own book the arrival of the Prophet Muhammad. Then Allah swt emphasized that they themselves did not only know that the Prophet Muhammad would come, they even knew his characteristics. They should have acknowledged Muhammad's prophethood, but because of the jealous nature that gripped their souls, they fell into the valley of humiliation. They can no longer see the radiance of truth, so they drift in error."
		   },
		   {
			"id": 364,
			"surah": 3,
			"ayat": 71,
			"tafsir": "Narrated by Ibn Ishaq from Ibn 'Abbas he said that 'Abdullah bin as-shaif, 'Adi bin Zaid and Haris bin 'Auf were talking to each other. \"Let us believe in the book that was revealed to the Messenger of Allah and his companions in the morning. Then we deny it in the evening, so that we can confuse them, hopefully they will do as we did, so they return to their original religion.\" Then came down these verses 71-73. Allah denounced the People of the Book because they mixed truth with falsehood. What is meant by the truth in this verse is the truth that was brought by the prophets contained in their book, namely monotheism, as well as the good news that the Prophet Muhammad will come who will serve like the previous prophets who will teach the Book and wisdom to all mankind. While what is meant by falsehood is all the deceptions made by the priests and leading leaders of the People of the Book by interpreting God's verses with false tafsirs and which are far from the truth. Such an tafsir is what they consider a religion that must be followed. Their actions were also reprehensible. ¦. And they say, \"It is from Allah,\" but it is not from Allah. They say lying things against Allah, even though they know. (Ali 'Imran\/3: 78). It is clear that what is meant by confusing the right and the wrong is: the deception of the People of the Book who interpret the verses of Allah and say that the tafsir comes from Allah. While the good news about the arrival of the Prophet Muhammad, they hid it. All of this shows that they did this not because of negligence or because they did not know, but because of denial and desire that had lodged in their hearts."
		   },
		   {
			"id": 365,
			"surah": 3,
			"ayat": 72,
			"tafsir": "There is a group from the People of the Book who invite their friends to pretend they believe in the book that was revealed to Muhammad in the morning, then deny it in the afternoon. They act in this way to create an impression in the hearts of Muslims, if the religion of Islam is true then surely the Jews who have just converted to Islam will not be apostates anymore. This attitude is nothing but their trick to influence Muslims to return to their disbelief. Ibn Jarir narrated from Imam Mujahid, he said that a group of Jews prayed at dawn with the Prophet. Then they disbelieved in the evening. When they do such deception, it is not strange, because knowing that one of the signs of truth is, if someone already knows something is true, of course he will not leave it. This can be understood from the statement of Heraclius, the Roman Emperor to Abu Sufyan when he asked him about Muhammad's condition, namely when the Prophet Muhammad called Heraclius with his letter to convert to Islam, \"Is there anyone who left his religion after he embraced him?\" Abu Sufyan replied, \"Nothing.\" This verse warns the Prophet Muhammad of the deception of the People of the Book and informs them of their strategy, so that the deception does not affect the weak hearts of the believers. This warning served to frustrate their efforts; for if the background of their deceit had been known, surely their efforts would not have been successful. This verse is a miracle for the Prophet Muhammad, because it contains occult news that reveals the secrets of the evil intentions of the Jews."
		   },
		   {
			"id": 366,
			"surah": 3,
			"ayat": 73,
			"tafsir": "Allah revealed that there were words of the Jewish leaders who forbade their people to express their beliefs to other people who were not Jews, that the prophethood may have been given by Allah to other people, besides the Jews. Because if this was said to Muslims, of course Muslims would make it an excuse to strengthen Muhammad's apostleship, which was sent by Allah from among the Arabs, not from among the Jews. Such an attitude arose because the Jews did know that Allah could send an apostle, even if not from among the Jewish nation, but they denied the prophethood of Muhammad because of their pride and envy. In fact, the new guidance followed is the guidance of Allah. It means that the instructions are not only for one particular nation among His servants. The instructions were conveyed through prophets who were appointed by God according to His will. Therefore, those who are guided by Allah SWT, he will not go astray and no one can lead him astray. So the tricks of the People of the Book will not have the slightest effect on Muslims and nothing can hinder Allah's will towards His prophets. The apostleship is a gift from God who is in His absolute dominion. Allah is the Giver and the All-Knowing, whoever has the right to receive His grace. Then Allah will give His gift to those who deserve it. In this statement there is a warning that the Jews. has narrowed the understanding of the grace of the Almighty God. God's gifts are very broad and His grace is given equally according to His will. This is a refutation of the accusations of the People of the Book who said that prophethood and apostleship were only for the Children of Israel. Thus it can be understood that God has the absolute right to send prophets and apostles according to His justice and mercy."
		   },
		   {
			"id": 367,
			"surah": 3,
			"ayat": 74,
			"tafsir": "The grace of Allah given to the prophet is a gift of Allah alone. God's grace is very broad and His grace is evenly distributed to each of His servants. No one can influence God to give that gift. So Allah has the right to add His mercy and grace to His servants according to His justice, unlike the opinion of the People of the Book that Allah's mercy and His gifts are for them only. Thus Allah has unlimited power to send prophets according to His will. If Allah sends a prophet from a certain nation, it is solely because of the abundance of His grace and mercy. From this verse it can be understood that God's assessment of a person is basically the same. There is no one who surpasses another person except with piety. That priority only comes from God who is given to someone according to His will."
		   },
		   {
			"id": 368,
			"surah": 3,
			"ayat": 75,
			"tafsir": "In this verse it is explained that among the People of the Book there is a group of people who, if they are entrusted with a large or small amount of wealth, they return it according to the trust given to them. But there are also those among them who, if they are entrusted with a small amount of assets, they do not want to return it unless they are billed, then they are willing to hand it over after going through the verification process. This shows that among the People of the Book there is a group of people whose job is to make things difficult for Muslims and to make tricks so that Muslims are not happy to embrace their religion and turn to follow their religion. Among them is also a group of people whose job is to overturn the law. They justify eating other people's property for the reason that: \"The Torah prohibits betraying the mandate of their brethren of the same religion. If the betrayal is committed against another nation they allow it. In summary it can be said that the People of the Book can be divided into two groups: 1. People of the Book who really hold on to the Torah book that can really be trusted. For example, for example Abdullah bin Salam who was entrusted with a large amount of wealth by the Quraysh and then returned the property. 2. People of the Book who cannot be trusted because if they are entrusted with even a small amount of wealth, they deny it and don't want to return it again unless it is proven by reasonable information or if it goes through the process of proving it before a court. An example is Ka'ab bin al-Ashraf who was entrusted with one dinar by Quraysh and then he denied the deposit. they do so, is because they think not There is no sin if they do not fulfill the mandate of a Muslim, because they think that there is no threat and there is no sin if they eat the property of a Muslim in a vanity way. In summary it can be said that in their opinion everyone other than the Jewish people will not be noticed by God, they even get the wrath of God. Therefore their property will not receive protection, and taking their property is not considered a sin. There is no doubt that such notions include denial, deceit and insults to religion. That is, they know and realize that they deliberately lied in that regard, even though they already know that in the Torah there is not the slightest provision that allows betraying Arabs and consuming Muslim property illegally. Actually they already know that, but they do not stick to the Torah. They are more inclined to believe in the words of their religious leaders, and regard them as provisions that they must follow. Even though their leaders expressed their opinions on matters related to religion by using tafsirs with reason and taste. They do not hesitate to change the original wording of the Torah to strengthen their point of view. They maintain that opinion by looking for reasons that can strengthen it. Ibn Munzir also narrated from Sa'id bin Jubair he said: After verse 75 was revealed, the Messenger of Allah said: The enemies of Allah (the Jews) have lied. There was no provision in the time of ignorance except that it was under the soles of my feet (was canceled) except for the mandate. This mandate is obligatory on good people and bad people. (History of Ibn Mundzir from Sa'id bin Jubair)"
		   },
		   {
			"id": 369,
			"surah": 3,
			"ayat": 76,
			"tafsir": "The opinion of the Children of Israel who say that there is no sin for them if they commit crimes against Muslims is denied. Then Allah emphasized that everyone always keeps all kinds of promises and fulfills the trust entrusted to him. If there is someone who lends you property at a set time, or someone sells goods that have been determined, or someone deposits goods, the terms that have been mutually agreed upon must be adhered to. Let someone's property be given on time without waiting for a bill or waiting until the matter is brought to court. This is what is required by the provisions of the Shari'a. In this verse there is a warning that the Jews did not want to keep their promise solely because of the promise, but they saw with whom they promised. If they entered into an agreement with the Children of Israel, they considered it obligatory to fulfill it, but if they entered into an agreement with other than the Children of Israel, they did not consider it obligatory to fulfill it. Allah mentions the reward of those who keep their promises to give the understanding that keeping promises is an act that is pleasing to Allah and those who keep these promises will receive His mercy in this world and in the hereafter. In this verse it is explained that the principles of religion namely keeping promises and not breaking them, and protecting oneself from committing immoral acts are actions that draw one closer to Allah, and deserve an abundance of His love."
		   },
		   {
			"id": 370,
			"surah": 3,
			"ayat": 77,
			"tafsir": "Regarding the sabab nuzul, this verse is explained in a hadith narrated by al-Bukhari and other hadith experts that al-Asy'ats bin Qais said, \"I had a land lease agreement with a Jew and he denied it. That's why I submitted it to Rasulullah SAW .\" Then Rasulullah said, \"Do you have proof?\" I said, \"No.\" After that the Prophet said to the Jew, \"Swear.\" Then I said, \"O Messenger of Allah! If so, he will swear. (And if he swears) then my wealth will disappear.\" So Allah sent down this verse. This verse explains the various consequences that will be suffered by those who break God's promises and break their oaths at low prices or rewards. What is meant by \"God's promises\" in this verse are God's commands and His prohibitions conveyed through the messengers mentioned in His books. Such as acting correctly, fulfilling promises that have been made, conveying mandates to those who are entitled to receive them, worshiping Allah without associating partners with Him, and fearing Him in all matters. By their oaths they meant the vows they had made that they would always follow the truth. What is meant by \"exchanging Allah's promises for a small price\" (cheap) is to deny Allah's promises with worldly actions that are considered better. All kinds of denial are looked down upon or have no value at all compared to the blessings that will be obtained when fulfilling God's promises. As for the consequences that will be suffered by those who dare to exchange Allah's promises for worldly favors, they will not receive even the slightest reward in the form of abundant favors in the hereafter. They will not receive Allah's attention on the Day of Resurrection, nor will they receive even the slightest forgiveness of their sins. According to al-Qaffal's statement that what is meant by the word of Allah, \"And Allah will not speak with them\", is a description of the mounting anger of Allah towards them. In summary it can be said that God threatens those who break the agreement and break the promise. They will not be rewarded in the hereafter, they will suffer painful torments, they will be hated by Allah and will no longer be rewarded by His mercy."
		   },
		   {
			"id": 371,
			"surah": 3,
			"ayat": 78,
			"tafsir": "This verse describes the condition of another group of People of the Book, namely a group of their priests who change the verses of the Book (Torah) by adding their pronunciations or changing their location and deleting some of the pronunciations, so that the original meaning changes. They read the verses that they have modified as verses of the Bible, so that their listeners think that what they are reading is really verses of the Bible, even though what they read does not actually come from Allah, but is their own creation. They know that what they are doing is wrong, but they do it anyway. This is because their devotion to Allah has disappeared, and they believe that Allah will forgive any sins they commit because they are religious people. This heinous act of the Jews served as a lesson for Muslims so that no Muslim should behave like this, no one would have the intention that Muslims would receive forgiveness from Allah, no matter how great the sins they committed. Nor should anyone who claims to be Muslim but whose actions are infidels and hypocrites, do not want to practice the teachings of the Qur'an and Sunnah of the Prophet, nor do they believe in accordance with Muslim beliefs."
		   },
		   {
			"id": 372,
			"surah": 3,
			"ayat": 79,
			"tafsir": "It is impossible and inappropriate for a human being to be given a book by Allah and taught about religious knowledge, and appointed as a prophet, then invites humans to worship themselves, not worship Allah. People who are given such virtues will certainly invite people to study the attributes of Allah and study religious laws, and set good examples in terms of obeying Allah and worshiping Him, and teaching the Book to all humans. The prophet as a human being who has been given the priority mentioned above, of course, is impossible and inappropriate to order others to worship him, because he is a creature of God. So the creator is Allah who must be worshiped. Emphasized to him is ordering people to fear Allah, teach the Bible and implement it, this has been confirmed by the word of Allah: Say, \"Only Allah whom I worship with full obedience to Him in (carrying out) my religion.\" (az-Zumar\/39: 14) Whoever orders people to worship himself means that he acknowledges that Allah has a partner, namely himself. Whoever associates partners with Allah with others, it means that he has removed the purity of worship to Allah alone. With the loss of the purity of worship, the meaning of worship also disappears. Keep in mind! Only belongs to Allah pure religion (from shirk). And those who take protectors other than Him (say), \"We do not worship them but (hope) that they draw us closer to Allah as closely as possible.\" Truly, Allah will give a verdict between them regarding what they dispute¦ (az-Zumar\/39: 3) Likewise the word of Allah which tells about the Prophet Hud's call to his people: So that you do not worship other than Allah. I am really afraid that you will be punished (on) a very painful day.\" (Hud\/11: 26) All the prophets ordered people to worship Allah: And to the samud (We sent) their brother, Saleh. He said, \" O my people! Worship Allah, there is no god for you but Him.¦. (Hud\/11:61)"
		   },
		   {
			"id": 373,
			"surah": 3,
			"ayat": 80,
			"tafsir": "It is inappropriate for a human being who has been given a revelation by Allah, then orders humans to make angels and prophets as God. This was entirely never done by the Prophets including the Prophet Muhammad. What ever happened was that Arabs worshiped angels. The Jews worshiped Uzair and the Christians worshiped Christ, who was considered the son of God. All of these actions are contrary to the teachings brought by the prophets because the prophets all told people to worship God Almighty."
		   },
		   {
			"id": 374,
			"surah": 3,
			"ayat": 81,
			"tafsir": "Allah has taken a promise from the prophets when an apostle comes who confirms the book they have, they will believe in the apostle and will help him, they will believe it, even though they themselves have been given the Book and also given wisdom, they will still believe and support it. This is because the purpose of the sending of the prophets and apostles is one, namely conveying the teachings of God. Therefore the apostles must help each other. In addition, if the Shari'a that came later brought provisions that changed or abolished the provisions of the previous Shari'a, of course it must be accepted, because the teachings related to religious principles related to faith and divinity brought by the prophets were The same. But those related to sharia (law) such as criminal law and civil law in each religion can vary, adjusted to the conditions of time and place. What is meant by \"The Prophet Muhammad saw confirms the previous messengers and the books he brought\", is to confirm that Allah has sent the messengers and sent down the books to them, and does not mean that Muhammad saw confirmed the entire contents of the books. it as it is now. In this verse there is a strong indication that religion should not become a source of enmity and hatred, as was done by the People of the Book who were enemies of Muhammad, so that they are difficult to persuade them to return to the same principles, they even obstruct, oppose and deny his invitation. In summary it can be said that if the People of the Book wanted to understand and think about the similarity of principles brought by the prophets, they would certainly be able to accept and follow the teachings brought by the Prophet Muhammad and justify His Shari'a, in accordance with the promises made by the Prophet Musa and Prophet Isa, namely that every time a prophet comes after them, who confirms the book they have, they will believe it. If Jews and Christians believe in the Prophet Musa and Prophet Isa, of course they also believe in what the two prophets believed. Furthermore, it was explained that the promises of the prophets that had been mutually agreed upon had been witnessed by each party, and Allah was also a witness of their vows."
		   },
		   {
			"id": 375,
			"surah": 3,
			"ayat": 82,
			"tafsir": "Whoever turns away from the covenant that has been made, they are the wicked. What is meant by those who turned their backs were the Jews who were at the time of the Prophet. They do not believe in the prophethood of Muhammad saw, which means they do not believe in the agreement made by Prophet Musa and Prophet Isa. They knew the agreement that had been made by Prophet Musa and Prophet Isa, and knew its contents, but they did not carry it out. That's why they are called the wicked."
		   },
		   {
			"id": 376,
			"surah": 3,
			"ayat": 83,
			"tafsir": "Allah did not justify the attitude of the People of the Book, even criticized them because they deviated from the truth, after the truth became clear to them and they did not want to embrace Islam which came from Allah. Allah swt rebuked them why they did that, even though all the heavens and the earth submit to Allah voluntarily and are subject to His provisions. In summary, it can be explained that the Jews did not believe in the religion brought by the Prophet Muhammad, even though their prophets believed in the Prophet Muhammad, who would come later. By not believing in the Prophet Muhammad means they do not believe in their own prophets; and means they are looking for a religion other than Islam. Their attitude was reproached by God because everything in the heavens and on this earth is all subject and obedient to God, why didn't they do that? Then Allah explained that to Allah all creatures return, whether Jews, Christians, or people other than them. At that time they will be rewarded, according to their deeds in the world. In this verse there is a strong threat to the people of the Book, both Jews and Christians, because they have deviated from the truth, and do not want to acknowledge the prophethood of Muhammad."
		   },
		   {
			"id": 377,
			"surah": 3,
			"ayat": 84,
			"tafsir": "In this verse, Allah swt commands Muhammad, including those who follow him, to believe that Allah must exist. Almighty One and has unlimited power over the entire contents of nature, and also commanded him to believe in the Book of the Qur'an which was revealed to him. In addition to having to believe that Allah swt has sent down revelations to the previous prophets, namely the Prophets Abraham, Ismail, Isaac. Jacob, the prophets descended from Jacob, and the revelations conveyed to Moses, Jesus and other prophets sent by God, who served as a guide for his people. The revelations conveyed to the prophets have the same principles and levels. Indeed, We have revealed to you (Muhammad) as We have revealed to Noah and the prophets after him¦ (an-Nisa'\/4: 163) Prophet Musa and Prophet Isa are mentioned in this verse specifically, because of the discussion in this verse and the previous verse and afterward associated with Christians and Jews. After that, other prophets were mentioned to give an idea to believers so that they also believe in other prophets and the revelations revealed to them, such as Prophet Dawud, Prophet Ayyub and others. This includes the prophets who received revelations, but Allah did not tell us about them in the Qur'an. The command to believe in the books revealed to the Prophet Muhammad takes precedence over the orders to believe in the books revealed to the prophets who were sent before. Even though according to reality, these books were revealed before the Al-Qur'an, this is to provide confirmation that the Al-Qur'an is the true source for knowing the books that were revealed to the previous prophets, and because the Al-Qur'an The an acknowledges the truth of the Books that were revealed before. It is for this reason that the prophethood of the prophets mentioned in the Qur'an is obligatory for us to believe in principle, in accordance with the information given by the Qur'an. Furthermore, Allah ordered the Prophet Muhammad and his people to say that he and his people did not discriminate between the degrees of the apostles, therefore people who believe, should not believe some of the contents of the Qur'an but deny some of the others, as has been done by Jews and Christians against their books. Believers should cleanse themselves from sinful acts. This verse begins with an injunction to believe in Allah and ends with an injunction to \"surrender, obey and obey\" before giving an explanation of the purpose of each of the religions that the prophets brought."
		   },
		   {
			"id": 378,
			"surah": 3,
			"ayat": 85,
			"tafsir": "Allah stipulates that whoever seeks a religion other than Islam, or does not want to submit to Allah's provisions, then his faith will not be accepted by Allah. As an example put forward, polytheists and people who claim to be monotheistic religion even though they associate partners with Allah. Like the People of the Book, adherents of Christianity, who failed to bring their adherents under the rule of Allah. This kind of religion is only a tradition, which cannot bring benefit to its adherents, even drags them into the abyss of destruction, and becomes a source of enmity between people in this world, and becomes a cause for their regret in the hereafter. People who seek a religion other than Islam to become their religion, in the hereafter will be among the losers, because they have wasted the monotheistic creed that is in accordance with human nature."
		   },
		   {
			"id": 379,
			"surah": 3,
			"ayat": 86,
			"tafsir": "Regarding the reason for the revelation of verses 86 to 89, a hadith narrated by Ibn Jarir, An-Nasa'i, al-hakim and Ibn hibban can be stated: That Ibn 'Abbas said, \"There was a person from the Ansar group who converted to Islam, then he apostatized and joined the group of polytheists but he regretted it. Then he asked his people to ask the Messenger of Allah, \"Can my repentance be accepted?\" Then he went down (verse 86) to (verse 89). Islam.\" People who return to being disbelievers after believing, Allah will not provide a way to get guidance. Because, they do not recognize the good news about the arrival of the Prophet Muhammad listed in their books. Initially they wanted to follow the Prophet Muhammad if they were given a long life, and if the new prophet was sent from among them. But after it turned out that the Prophet Muhammad saw had come, and he was not from among them, they denied it, even though the arrival of the Prophet Muhammad was accompanied by clear evidence about his prophethood. People who initially believed and then disbelieved returned, they wronged themselves, and Allah will not give guidance to those who wrong themselves, because Allah has explained that guidance to the right path can only have an effect, if the person is clean in spirit, so that he can accept the proof of the truth of the instructions. But if that person's heart has been tainted by injustice then he will deviate from the right path. Therefore they will no longer be possible to receive God's guidance."
		   },
		   {
			"id": 380,
			"surah": 3,
			"ayat": 87,
			"tafsir": "They deserve the wrath of Allah, angels and all humans, and humans will generally curse those who apostate from their faith, according to the word of Allah: And he (Ibrahim) said, \"Surely the idols that you worship besides Allah, only to create feelings of love love among you in the life of the world, then on the Day of Resurrection some of you will deny and curse each other¦ (al-'Ankabut\/29: 25)"
		   },
		   {
			"id": 381,
			"surah": 3,
			"ayat": 88,
			"tafsir": "Those who disbelieve after believing will receive wrath and punishment from Allah forever, they will remain in Hell Hell without the slightest relief, they will not receive forgiveness for any reason, because what causes them to experience this torment is the denial and disbelief that has permeated in their hearts. Because of that, Allah's wrath cannot be avoided for any reason, and Allah's punishment against them cannot be delayed."
		   },
		   {
			"id": 382,
			"surah": 3,
			"ayat": 89,
			"tafsir": "People who truly repent of their actions and return to the right path, by leaving their disbelief, then truly regret their wrong actions and improve the future by filling it with good deeds, are willing to cultivate their faith with true teachings, and are willing to change their evil behavior that pollutes their soul, the door of repentance is still opened for them as wide as possible. In this verse there is a sign that a person who repents, but is not proven by good deeds, then his repentance is meaningless from a religious viewpoint. Many people who claim to repent, with regret and forgiveness, but then they repeat their evil deeds. Such a person's repentance does not have the slightest effect on his soul, and is unable to cure his illness. If they could prove their repentance in the form of concrete actions, they would receive forgiveness from Allah and receive His grace."
		   },
		   {
			"id": 383,
			"surah": 3,
			"ayat": 90,
			"tafsir": "What is meant by infidels in this verse are the People of the Book who believe (believe) in the coming of the Prophet Muhammad mentioned in their books. But after the Prophet Muhammad came and was appointed as an apostle, they disbelieved, by denying, opposing and making enemies of him. Against such people, their repentance will never be accepted by Allah. Allah's affirmation that their repentance will not be accepted in this verse, is different from the affirmation in the past verses where Allah says: And it is He who accepts the repentance of His servants¦ (asy-Shura'\/42: 25) In this verse What is meant by infidels are the People of the Book who previously knew about the arrival of the Prophet Muhammad. Then after the Prophet Muhammad was sent they denied it. Their disbelief increases and increases, so that it is no longer possible to accept their repentance, as explained by the word of God: ¦. sin, then abstain from sin. Such souls can still be expected to receive forgiveness. However, a filthy soul, which has become a nest of polytheism and disbelief and gripped by sinful impulses, causes its heart to be shackled to see the light of truth, so that every time it wants to repent, there are always obstacles that prevent it from accepting the truth. A soul like this is very difficult to clean back to its original state. Then it was emphasized that they were truly lost people, because they had denied the truth. They have taken the wrong path, therefore they will not be happy. There is no hope for them to be guided and will not be forgiven forever."
		   },
		   {
			"id": 384,
			"surah": 3,
			"ayat": 91,
			"tafsir": "Those who wallow in disbelief and are swayed by evil deeds, until death overtakes them, while they are still in their disbelief, their ransom will not be accepted even in the slightest, even though the amount of ransom is equivalent to the riches of gold throughout the earth. The point is, if they give charity with the weight of the earth's weight of gold to be used as ransom for the sins they have committed, then the reward will not be able to save them from the torments of hell because disbelief destroys their good deeds. What Allah values in the Hereafter is only faith in Allah, and the Last Day, and good deeds that draw closer to Allah. So today no ransom will be accepted from you or from the unbelievers. Your place is in hell. That is your shelter, and that is the worst place to return to.\" (al-hadid\/57: 15) Thus it can be said that on that day there was no way for them to save themselves, either with their wealth or with their rank. that day is based solely on the purity of the soul, so whoever maintains the purity of his soul with their faith and good deeds will be happy. On the other hand, whoever pollutes it with disbelief and with evil deeds, he will lose in the true sense - true."
		   },
		   {
			"id": 385,
			"surah": 3,
			"ayat": 92,
			"tafsir": "person will not reach the level of virtue in the sight of Allah, before he sincerely spends the treasures he loves in the way of Allah. What is meant by treasures that are loved are treasures that we love. This verse is closely related to the word of God. O you who believe! Spend some of the results of your good efforts ¦ (al-Baqarah\/2:267). After this verse was revealed, the companions of the Prophet competed to do good. Among them, Abu Talhah al-Ansari, a wealthy man among the Ansar, came to the Prophet to give him a plot of date palms that he loved so much to spend in the way of Allah. The gift was received by the Prophet well and praised his sincerity. The Messenger of Allah advised that the wealth should be donated to his close relatives, then thalha distributed it among his close relatives. Thus he gets the reward of alms and the reward of strengthening friendly relations with his family. After that Umar bin al-Khatthab also came to hand over a piece of his garden in Khaibar, the Prophet also ordered that the garden be maintained, only the produce from the garden was a waqf from Umar."
		   },
		   {
			"id": 386,
			"surah": 3,
			"ayat": 93,
			"tafsir": "This verse explains that all food was lawful for the Children of Israel and also for the Prophet Abraham, including camel meat, as stated in the Old Testament (Imamat xi: 4), \"But this is what you may not eat from one that chews cud or one with cloven hooves: camels, because they chew the cud, but they don't have cloven hooves; it's unclean to you.\" Only a few foods were forbidden by the Prophet Jacob himself because he was suffering from an illness, and that all happened before the revelation of the Torah. Then there are several kinds of food that are forbidden to the Children of Israel (see an-Nisa'\/4:160, al-An'am\/6:146 and their tafsirs) as a punishment and a lesson for their tyranny, as stated in the word of Allah: And to the Jews , We have forbidden all (animals) with hooves, and We have forbidden them the fat of cattle and sheep, except that which sticks to their backs, or that which is in their stomach contents, or that which is mixed with bones. Thus We punished them for their iniquity. And verily, We are Truthful. (al-An'am\/6:146). Similarly, it is stated in the Qur'an: Because of the tyranny of the Jews, We have made forbidden for them good food that was (formerly) made lawful; and because they often hinder (others) from the way of Allah, and because they practice usury, even though they have actually been prohibited from it, and because they eat people's property in an illegal way (vanity). And We have prepared for those who disbelieve among them a painful punishment. (an-Nisa'\/4:160-161). It is clear that some types of food that were forbidden to the Children of Israel were not forbidden to followers of the Shari'a of the Prophet Abraham and other prophets before the Torah was revealed. Thus their accusations were nullified that Islamic law contradicts the Prophet Abraham's law because it is lawful to eat camel meat. Prohibiting some food for the Children of Israel was solely as a punishment because they had violated Allah's laws and had wronged themselves. This is also stated in the Torah, their own book. Therefore the Prophet Muhammad was commanded by Allah to oppose them by saying, \"If you say there is food that is forbidden by Allah before the Torah was sent down, then bring the Torah and read it, if you are truthful.\" It turned out that they did not dare to answer this challenge and did not want to open the Torah, because if they had dared to open the Torah, their lies would have been exposed and their accusations against Islam were false and groundless. This also proves the truth of Muhammad's prophethood, because he was able to refute the accusations of the Children of Israel with the contents of the Torah itself, even though he had never read it and the Jews had never been given the opportunity to know its contents."
		   },
		   {
			"id": 387,
			"surah": 3,
			"ayat": 94,
			"tafsir": "If the Jews still dare to invent lies against Allah even though their guise has been exposed and all the reasons they put forward have been lies, and the Prophet Muhammad with the help of revelation from his Lord had known some of the contents of their book, then surely they would be among the people - unjust people. They are not only unjust to themselves because they will no longer be trusted and will receive God's punishment and torment. But they are also unjust to other people, because with that crime they mislead people from the right path and prevent people, especially their followers, from believing in the Prophet Muhammad, the bringer of truth and as a mercy for all mankind. Everyone who does such things will meet with failure, will receive a bad fate, will be branded by society as a troublemaker and chaos and will be the wrath of Allah and be punished in the hereafter."
		   },
		   {
			"id": 388,
			"surah": 3,
			"ayat": 95,
			"tafsir": "Allah ordered the Prophet Muhammad, to tell the Jews that what Allah informed him by means of revelation, about all food which was originally lawful for the Children of Israel before the Torah was revealed and also halal for people before the Prophet Musa. Indeed there are several types of food that are forbidden for them in the Torah as punishment for their disobedience, all of that really comes from Allah whose truth cannot be denied, because He is All-Knowing and All-Wise. Therefore, let the Jews follow the teachings of the Prophet Muhammad, because the religion he brought was in principle the same as that brought by the Prophet Abraham. And they should not continue to forbid camel meat and milk, because there is no prohibition on eating its meat and drinking its milk, both in the Shari'a of the Prophet Abraham and in the Shari'a of other prophets, including Islamic Shari'a. Moreover, Prophet Ibrahim was not a polytheist and the religion he brought was a pure monotheism religion like Islam. Do not associate partners with Allah and do not worship other than Him, not like their group (Jews) who say, Uzair is the son of Allah and not like the Christians who say that Jesus is the son of Allah."
		   },
		   {
			"id": 389,
			"surah": 3,
			"ayat": 96,
			"tafsir": "This verse is an answer to the Jews about moving the Qibla from Baitulmakdis to the Kaaba. The Jews say that oriented to Baitulmakdis, has been justified by the prophets. Even Prophet Ibrahim himself oriented there. This Jewish accusation is refuted by verses 96 and 97. These two verses clearly explain that the first house that was used as a place of worship for humans in praying and praying was the Kaaba in Mecca, which was founded by the Prophets Abraham and Ismail. So Mecca with its Kaaba was the first spiritual center established for mankind. After the new Kaaba, the Masjidilaqsa was built in Baitulmakdis a few hundred years later by Prophet Sulaiman bin Daud. Since Abraham built Baitullah in Mecca, it is clear that the Prophet Muhammad followed the religion of Prophet Abraham and also followed his Qibla in prayer. Prophet Ibrahim as after erecting the Kaaba prayed that the place around it would be blessed by Allah: O Lord, indeed I have placed some of my descendants in a valley that has no plants near Your house (Baitullah) which is respected, O Lord (such) so that they pray, so make the hearts of some people inclined to them and give them sustenance from fruits, hopefully they will be grateful. (Ibrahim\/14:37). Historians in the field of religion, especially those from monotheistic-Abrahimic religions, have always questioned which house of worship is the oldest, whether the Haikal (Temple) Sulaiman (Solomon Temple) built by Prophet Sulayman as in Jerusalem, or Baitullah in Jerusalem. Mecca. Which came first? The verse above states that 'the first house built for (a place of worship) for humans is Baitullah which is in Bakkah. The ancient name of the city of Mecca is Bakkah, and this has been alluded to in the Psalms, which can be seen in the Old Testament, Psalm, 84: 5-6: \"Blessed is the man whose strength is in Thee; in whose hearth are the ways of them who passing through the valley of Baca make it well\" Good\"]. Marting Lings (1986) in Muhammad's book, His life based on the earliest sources-, stated that reading in the Psalms above is none other than the Bakkah listed in surahh Ä€li 'Imran\/3 verse 96 above. The date of the Prophet David as is around 900 years BC, or 2900 years ago. So Baka existed more than 2900 years ago, because it was alluded to in the Book of the Prophet David as, the Book of Zabur above. Meanwhile, the Temple of Solomon was founded by the son of Prophet David as, namely Prophet Sulaiman as. It is clear that Baitullah in the city of Baka is older than the Temple of Solomon in Jerusalem."
		   },
		   {
			"id": 390,
			"surah": 3,
			"ayat": 97,
			"tafsir": "Another proof that it was the Prophet Ibrahim who rebuilt the Kaaba, the existence of the maqam Ibrahim beside the Baitullah, namely a stone used as a place to stand by the Prophet Abraham when he built the Kaaba together with his son Ismail as The footprints of his feet are still there and can be witnessed so far. Whoever enters the land of Mecca (the forbidden area) is assured of his own safety from the dangers of enemies and that security is not only for humans but also the animals, they cannot be disturbed and the trees cannot be cut down. After the Prophet Abraham rebuilt the Kaaba, he was ordered by Allah to call on all mankind to make a pilgrimage to Baitullah to perform the pilgrimage. This pilgrimage was recommended by Prophet Ibrahim and is still carried out by Muslims until now as the fifth pillar of Islam. Every able-bodied Muslim is required to perform the pilgrimage once in a lifetime. Whoever denies the obligation of pilgrimage, then he is among the disbelievers."
		   },
		   {
			"id": 391,
			"surah": 3,
			"ayat": 98,
			"tafsir": "With this verse, the People of the Book who still do not justify the prophethood of Muhammad are being blamed even though the evidence for this prophethood is quite a lot and quite clear. With their denial and disbelief they always try to divide the Muslims and weaken their position."
		   },
		   {
			"id": 392,
			"surah": 3,
			"ayat": 99,
			"tafsir": "The People of the Book want Allah's religion to deviate from the true goal by changing the characteristics of Muhammad and fabricating lies against Allah, even though they are waiting for Muhammad's prophethood in their own little hearts. Allah cursed the jealous nature that was hidden in the breasts of the leaders of the People of the Book. God will never be indifferent about their falsehood."
		   },
		   {
			"id": 393,
			"surah": 3,
			"ayat": 100,
			"tafsir": "Believers are prohibited from following a group of People of the Book because they always trick the Muslims. If the Muslims follow the Jews, surely they will fall back into hostility and disbelief."
		   },
		   {
			"id": 394,
			"surah": 3,
			"ayat": 101,
			"tafsir": "Why do Muslims deny Allah and follow the People of the Book, even though they have heard the verses of Allah recited to them and these verses are a source of guidance that contains all kinds of goodness and always recommends maintaining faith while Rasulullah himself is still in the midst of they are symbols of truth, virtue and brotherhood. So is it appropriate for believers who have been given such great grace by Allah to follow a group of people who have clearly gone astray before and led many people astray from the straight path? Therefore let a believer hold fast to the teachings of Allah and His Messenger. Thus they will be maintained and always be in the environment of His guidance, will not go astray forever and will not feel afraid."
		   },
		   {
			"id": 395,
			"surah": 3,
			"ayat": 102,
			"tafsir": "It is called upon the Muslims, especially the Aws and Khazraj, to remain in Medina, have faith, fear Allah with true piety, and fulfill all the obligations of piety. By mobilizing all power and ability to carry out Allah's commands and stay away from His prohibitions, as a whole, and do not die, but in a state of embracing Islam."
		   },
		   {
			"id": 396,
			"surah": 3,
			"ayat": 103,
			"tafsir": "They are reminded to hold fast to Allah and His teachings and always remember the favors He has bestowed upon them. In the past, during the time of ignorance, they were enemies so that hundreds of years of civil war arose, such as the war between the 'Aus and Khazraj people. So Allah has united their hearts with the arrival of the Prophet Muhammad and they have entered into the religion of Islam in droves. Allah has uprooted from their hearts the nature of envy and extinguished from them the fire of enmity so that they become brothers and sisters who love each other towards happiness together. Also because of polytheism, they are on the edge of the abyss of hell, only prevented by death. But Allah has saved them. Thus Allah explains His verses, so that the Muslims will receive guidance and be grateful for favors so that these blessings are preserved."
		   },
		   {
			"id": 397,
			"surah": 3,
			"ayat": 104,
			"tafsir": "To achieve this goal, it is necessary to have a group of Muslims engaged in da'wah who always give warnings when signs of disunity and deviation appear. Because of this, in this verse it is commanded that among Muslims there is a group of people who are trained in the field of da'wah who emphatically call for virtue, order what is good (good) and prevent what is wrong (immoral). In this way, Muslims will be protected from division and infiltration by any party. Suggesting doing good is not enough but must be accompanied by eliminating bad traits. Anyone who wants to achieve victory must first know the conditions and tactics of struggle to achieve it, that is, victory will not be achieved except by force, and strength will not be realized except by unity. A strong and strong union will not be achieved except with virtues. This virtue is not maintained except by maintaining religion and finally it is impossible for religion to be maintained except by preaching. So the first obligation of Muslims is to activate da'wah so that religion can develop properly and perfectly so that there are many adherents. With the encouragement of religion various kinds of virtues will be achieved so that a strong unity is realized. From this strong union will arise a great ability to achieve victory in every struggle. Those who fulfill the conditions of struggle are the ones who are successful and lucky."
		   },
		   {
			"id": 398,
			"surah": 3,
			"ayat": 105,
			"tafsir": "Allah forbids the Muslim community from dividing, because with division, no matter how strong and strong the position of a people is, it will surely lead to collapse and destruction. Therefore Allah warns that Muslims do not fall into the abyss of division."
		   },
		   {
			"id": 399,
			"surah": 3,
			"ayat": 106,
			"tafsir": "This verse describes how the two groups will look different on the Day of Judgment, the first group of believers will have a pure white shining face. Secondly, the disbelievers from the People of the Book and hypocrites look gloomy and have black faces because they see the punishment that Allah has prepared for them. In addition to their receiving punishment that befalls their bodies, coupled with insults from Allah with the words, \"Why do you disbelieve after believing? Therefore feel our punishment because of your disbelief.\""
		   },
		   {
			"id": 400,
			"surah": 3,
			"ayat": 107,
			"tafsir": "As for the believers, they are in Allah's grace, namely heaven which is full of favors and pleasures so that signs of happiness appear on their pure white and radiant faces."
		   },
		   {
			"id": 401,
			"surah": 3,
			"ayat": 108,
			"tafsir": "These are the verses of Allah which have been recited correctly and everyone will receive a reward according to their behavior in the world, and Allah never wishes to mistreat His servants because He is Rich and Most Just, able to carry out His perfect will. don't depend on anyone."
		   },
		   {
			"id": 402,
			"surah": 3,
			"ayat": 109,
			"tafsir": "Besides that, all natural objects, both the category of planets and the stars, which are very numerous, belong to Allah. He has full authority to manage everything in it with wisdom without having to be accountable to anyone because He is the Creator of the universe and to Him all matters will be returned."
		   },
		   {
			"id": 403,
			"surah": 3,
			"ayat": 110,
			"tafsir": "This verse contains an encouragement to the believers to maintain these main qualities and to keep their spirits high. The best people in the world are people who have two kinds of characteristics, namely inviting good and forbidding evil, and always have faith in Allah. All these characteristics had been owned by the Muslims at the time of the Prophet and had become flesh and blood within them because of that they became strong and victorious. In a short time they have been able to make the entire Arab lands submissive and obedient under the auspices of Islam, live safely and peacefully under the banner of justice, even though they were previously a divided people who were always in an atmosphere of chaos and fighting each other among themselves. . This is due to their firmness of faith and obedience to carry out religious teachings and thanks to their steadfastness and tenacity to uphold good and forbid and prevent evil. The deep faith in their hearts always encourages jihad and strives to uphold truth and justice as stated in the word of Allah: \"Surely the true believers are those who believe in Allah and His Messenger then they do not hesitate and they strive with their wealth and their lives in the way of Allah. They are the truthful.\" (al-hujurat\/49: 15) So there are two conditions for becoming the best people in the world, as explained in this verse, first, strong faith and, second, upholding good and forbidding evil. So for every people who have these two characteristics, it is certain that the people are victorious and noble and if these two things are ignored and are not cared for anymore, then it cannot be regretted if the people fall into the valley of poverty. If the People of the Book believed, it would have been better for them. But very few of them believe like Abdullah bin Salam and his friends, and most of them are wicked, do not want to believe, they believe in some of the holy books and disbelieve in some of the others, or they believe in some of the apostles like Musa and Jesus and disbelieve in the Prophet Muhammad saw."
		   },
		   {
			"id": 404,
			"surah": 3,
			"ayat": 111,
			"tafsir": "The People of the Book do not harm Muslims, except for hurting them with vile words, or by vilifying the character of the Prophet and keeping people away from Islam. All their efforts and deceit will disappear without a trace being swallowed up by the steadfastness of faith and fortitude that is possessed by Muslims as expressed in this verse. (1) \"They will never bring you harm other than disturbances in the form of reproaches.\" They only abused, denounced, insulted Islam, tried to raise doubts and cursed the Prophet. (2) \"And if they fight with you they will surely turn back and flee.\" They have never succeeded in inflicting heavy losses among the Muslims. (3) \"Then they shall find no help,\" to achieve victory. Indeed, they have never won a victory in a war against Islam, even though they are allied with the polytheists."
		   },
		   {
			"id": 405,
			"surah": 3,
			"ayat": 112,
			"tafsir": "With the disbelief and denial of the People of the Book (Jews), as well as their actions that are too hostile to Muslims in various ways and efforts, Allah inflicts humiliation on them wherever they are, unless they submit and obey Allah's rules and laws by paying jizyah, namely taxes to obtain security guarantees (habl min Allah) and they obtain security from the Muslims (habl min al-nas). But they could not do this in their association with the Prophet and his companions in Medina, in fact they always opposed and tried to weaken the position of the Muslims and remained hostile to Islam. Because of that they earned the wrath of Allah, humiliated and expelled from Medina."
		   },
		   {
			"id": 406,
			"surah": 3,
			"ayat": 113,
			"tafsir": "The Jews are a people who have bad qualities and actions, including disbelief in Allah's verses, killing the prophets for no good reason, but they are not all the same. There are those among them who believe, even though most of them are wicked people. Abdullah bin Salam, sa'labah bin Sa'id, Usaid bin 'Ubaid and their friends are Jews from the People of the Book who uphold truth and justice, do not persecute people, embrace Islam and do not violate Allah's commandments. They read the verses of the Qur'an diligently and attentively at night, which begins with the setting of the sun and ends with the rising of the dawn, when people sleep soundly, and they also prostrate to make direct contact with Allah swt."
		   },
		   {
			"id": 407,
			"surah": 3,
			"ayat": 114,
			"tafsir": "They believe in Allah and in the Hereafter with a sincere faith, a faith that is not mixed with hypocrisy. Believing in Allah also means having faith in what one must believe in and believe in, including the pillars of faith such as believing in angels, the apostles, heavenly books, qada and qadar and so on. Believing in the hereafter means staying away from all kinds of immorality, because they are sure that if they commit immorality in this world they will be punished in the next day and they do good because they hope for reward and the pleasure of Allah. After they have perfected themselves with the good qualities and deeds as mentioned above, they also try to save others from going astray, guide them to the path of goodness by amar makruf, and prevent them from doing things that are prohibited by religion by means of nahi mungkar. Furthermore, they are together and competing to carry out various virtues. Because they already have such noble qualities and good deeds, Allah includes them among the pious people."
		   },
		   {
			"id": 408,
			"surah": 3,
			"ayat": 115,
			"tafsir": "The Jews who are still wicked are always provoking their friends who have believed and converted to Islam, that they will lose out by their faith. As an answer and refutation of their bad deeds, it is emphasized that whatever good has been done by those who have faith, they will still receive a reward from their deeds and will not be hindered in the slightest from accepting it. Allah is All-Knowing of those who truly believe and are pious among them. Therefore, their deeds will not be wasted but will be rewarded multiplied."
		   },
		   {
			"id": 409,
			"surah": 3,
			"ayat": 116,
			"tafsir": "This verse was revealed regarding the Jews and polytheists who always insulted and insulted the Prophet Muhammad and his followers. They said, \"If Muhammad and his followers are true and trustworthy people, why are they always in poverty and squalor, when we are the rich and the many children.\" They always boast about this to believers and try to win them over to their side and return to their ancestral religion. This was usually done by disbelievers in ancient times against the prophets sent by Allah as stated in His word: And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba\/34:35). So as an answer to the humiliation and challenge this verse was revealed which confirms that many possessions and children will not release them from torment in the afterlife."
		   },
		   {
			"id": 410,
			"surah": 3,
			"ayat": 117,
			"tafsir": "The parable of the wealth that they spend is like a cold wind that blows very fast and destroys all the plants that are planted, so that the owner cannot reap even the slightest fruit. Although at birth they have spent their wealth for the public interest such as building fortifications, bridges, schools, hospitals and others with the great hope that their kindness will be rewarded by Allah and can help them in their future. hereafter, but that hope will be in vain. Allah's Word: And We will show them all the deeds they do, then We will make those deeds (like) flying dust. (al-Furqan\/25:23). And those who disbelieve, their deeds are like a mirage on flat ground, which people who are thirsty think of water, but when (the water) comes there is nothing. (an-Nur\/24:39). In fact, Allah does not persecute the disbelievers because they do not reward them for their good deeds, but they themselves persecute themselves because they do not want to believe, even though there is a lot of evidence in their hands showing the truth and the apostleship of the Prophet Muhammad. According to scientific studies, one of the important phenomena that occurs in plants exposed to very cold weather (wind) is the phenomenon of damage to cells, especially leaf cells. It is well known that approximately 70% of the cell content is water. When exposed to extreme cold, the water inside the cell freezes. When water freezes, ice crystals form which are larger in volume than water. The existence of the freezing causes the cell walls to break down because it is eroded by the water molecules that expand due to freezing. Appearance of this phenomenon from the outside: the leaves look dry as if burnt. This phenomenon, which often occurs in tea plants in the mountains of West Java, is known as the Ibun Bajra (Dew of Fire) phenomenon. The parable of wealth that is spent not according to God's will, will bring destruction to the doer, like a cell fluid that destroys itself when exposed to cold. The verse above also shows the effects of changes in weather behavior on life, in this case agricultural crops. Biologically, an unusual change in weather, for example a sharp increase or decrease in temperature, will greatly disrupt plant metabolic processes. The result is clear, namely there will be dysfunction of various existing organs resulting in abnormal growth, or the plant will die."
		   },
		   {
			"id": 411,
			"surah": 3,
			"ayat": 118,
			"tafsir": "warning to believers not to associate closely with unbelievers whose bad qualities are evident, do not trust them and do not leave the affairs of the Muslims to them. This verse closes with the phrase \"Indeed, We have explained the verses to you so that you understand,\" so that believers really understand and are aware of the bad qualities of disbelievers and therefore it is not appropriate for them to be made close friends in association as long as they are it is bad attitude towards believers. Do not believe that believers make disbelievers as trusted friends who have the characteristics stated in this verse, namely they: a. Always hurt and harm Muslims and try to destroy them. b. Openly expressing anger and hatred towards Muslims, belittling the Prophet Muhammad and the Qur'an and accusing Muslims of being ignorant and fanatical. c. The hatred and anger that they speak with their mouths is very little compared to the hatred and anger that is hidden in their hearts. But if those qualities have changed into good qualities or they no longer have bad qualities towards Muslims, then Allah does not forbid them to associate with them. Allah's Word: Allah does not forbid you to do good and do justice to those who do not fight you in religious matters and do not expel you from your hometown. Verily, Allah loves those who act justly. Indeed, Allah only forbids you to make them your friends, those who fight you in religious matters and expel you from your homes and help (other people) to expel you. Whoever makes them friends, they are the wrongdoers. (al-Mumtahanah\/60:8-9). There are many important events related to the People of the Book in history, such as the betrayal of the Jews Banu Qainuqa, Banu Nadhir and Banu Quraidhah in Yasrib against the Prophet and the Muslims, until the Battle of the Khandaq. Then the Christians helped the Muslims in the struggle for Islam such as the conquest of Spain and the liberation of Egypt. They drove out the Romans with the help of the Qibtis. Many Christians were also appointed as employees in government offices during the time of Umar bin Khattab and during the Umayyad and Abbasid Daula, some of them were even appointed as ambassadors representing the Islamic government. Thus Allah has explained His verses to the Muslims so that they pay attention to it as well as possible, do not fall into the abyss of destruction due to carelessness and carelessness when making close friends with the disbelievers."
		   },
		   {
			"id": 412,
			"surah": 3,
			"ayat": 119,
			"tafsir": "This verse adds an explanation of the reasons why infidels cannot be made close friends, namely: 1. They do not like the success of the Muslims and want the Muslims to always be in trouble and trouble, even though they have been considered as brothers and they have been given the same rights as the rights of the Muslims themselves. 2. The Muslims believe in all the Books that were revealed to the prophets so there is no reason for them to hate the People of the Book because many of them love them and get along well with them. But they don't like Muslims either, they even have the desire to harm them. 3. Many of them are hypocrites, when dealing with Muslims they say sweet words as if they are really true friends, believe in the religious truths brought by the Prophet Muhammad, but when they return to their group, they behave differently and openly say their hatred and anger towards the Muslims. They even bite their fingers because they are jealous of seeing the Muslims sticking together, agreeing in one accord, and always succeeding in facing the enemies of Islam. Therefore Allah ordered the Prophet Muhammad to firmly say to them: ¦ \"You die because of your anger!\" Truly, Allah is All-Knowing of all that is in the heart. (Ali 'Imran\/3:119). Allah knows all the intentions that are stored in the hearts of Muslims who love unbelievers, just as He also knows the ugliness of the hearts of unbelievers. So He will repay the kindness of the Muslims with a double reward and will also repay the evil of the disbelievers with a proper reward."
		   },
		   {
			"id": 413,
			"surah": 3,
			"ayat": 120,
			"tafsir": "Apart from the characteristics mentioned above which cause the prohibition for Muslims to take them as loyal friends, this verse mentions again the attitude that describes how evil the hearts of unbelievers and the great jealousy that springs up in their hearts. Allah says: If you get good, (undoubtedly) they grieve, but if disaster strikes you, they rejoice over it. (Ali 'Imran\/3:120). Qatadah said in explaining this word of Allah as narrated by Ibn Jarir, \"When the disbelievers see strong unity among the Muslims and they gain victory over the enemies of Islam, they feel jealous and angry. But when there is division and strife among the Muslims and they find weakness in a battle, they feel happy and happy. Indeed it has been sunatullah, both in the past until the present and in the future until the Day of Resurrection, if a scholar appears among the disbelievers as a challenger to religion Islam, Allah will still reveal his lies, paralyze his arguments and show his reproach and disgrace.\" Therefore Allah commands Muslims in facing the cunning and evil intentions of the disbelievers to always be patient and pious and trust in Him. Thus their cunning will not harm the slightest. Allah is All-Knowing of all their actions."
		   },
		   {
			"id": 414,
			"surah": 3,
			"ayat": 121,
			"tafsir": "The hypocrites have incited the Muslims not to join the war. On their way to the battlefield they managed to bring back to Medina a third of the army that had been prepared to face the polytheists. Thanks to Allah's help, fortitude and patience in facing all trials and obeying and dutifully carrying out the orders of the Prophet Muhammad who had divided the Muslim army into several parts and placed them in strategic positions on the battlefield. As a result of this obedience, Muslims can avoid destruction."
		   },
		   {
			"id": 415,
			"surah": 3,
			"ayat": 122,
			"tafsir": "In this difficult and unfavorable situation, there were two groups among the Muslims who were almost discouraged after learning that three hundred people from the Muslim army did not want to join the fight and had returned to Medina. Those who were almost discouraged were Bani Salamah from the Khazraj tribe and Bani Haritsah from the Aus tribe, respectively, the right and left wings. They were affected by the extremely anxious atmosphere and felt that rather than being crushed by such a formidable enemy it would be better to retreat. Fortunately, this feeling of discouragement did not last long to affect them because they are people who are full of trust in Allah and still believe that Allah will not waste His servants who are patient and fearful of Him."
		   },
		   {
			"id": 416,
			"surah": 3,
			"ayat": 123,
			"tafsir": "As an increase in soul strength and courage in facing all dangers and difficulties, Allah reminded them of the battle of Badr when they were weak and their numbers were very few compared to the strength and number of the enemy. Thanks to Allah's help, they succeeded in ravaging the enemy so that many of the Quraysh princes fell victim and many were taken prisoner and not a few spoils were obtained by the Muslims. Because they remember God's command that they be patient and fearful of Him and with patience and piety they will receive help from Him and will gain victory."
		   },
		   {
			"id": 417,
			"surah": 3,
			"ayat": 124,
			"tafsir": "To further strengthen the hearts and resolve of the Muslims in facing this Battle of Uhud, the Prophet told them that they would be assisted by Allah with 3,000 angels. If they are patient and steadfast in facing all dangers and are pious, Allah will help them with 5,000 angels. According to the history of Adh-ahhak, this assistance with 5,000 angels is a promise from Allah which He promised to Muhammad if the Muslims are patient and pious. Ibn Zaid narrated, when the Muslims saw the large number of polytheists and their complete preparations, they asked the Prophet, \"Will Allah not help us in this battle of Uhud as He helped us in the Battle of Badr?\" Then come down this verse. Indeed, in the Battle of Badr Allah helped the Muslims with 1000 angels as mentioned in His word: (Remember), when you asked for help from your Lord, then He allowed it for you, \"Indeed, I will bring reinforcements to you with a thousand angels who come consecutive.\" (al-Anfal\/8:9). In the beginning, during the Uhud War, the Muslim troops were able to confuse the enemy so that many of the polytheists fled in disarray, leaving their property behind, and the Islamic soldiers began to scramble to take the property as booty. Seeing this situation, the archers were ordered by the Prophet Muhammad to remain in place, no matter what. Thinking that the polytheists had lost, the archers left their places and went down to take the treasure. Because that place had been abandoned by archers, Khalid bin Walid, the commander of the polytheists of Quraysh at that time, with his horsemen rode up to the place and occupied it, then showered arrows on the Muslims from behind so that there was chaos and panic among the Muslims. In this chaotic situation the polytheists tried to approach the Prophet's headquarters, but the companions were able to defend it even though the Prophet himself received injuries to his face, his lips and teeth were broken. Finally, thanks to their loyalty to defend the Prophet and their persistence in defending their position, they and the Prophet climbed back to Uhud hill safely. Thus the battle ended and the polytheists returned to Mecca disappointed because they could not defeat Muhammad and his troops, even though they themselves were still safe from destruction."
		   },
		   {
			"id": 418,
			"surah": 3,
			"ayat": 125,
			"tafsir": "To further strengthen the hearts and resolve of the Muslims in facing this Battle of Uhud, the Prophet told them that they would be assisted by Allah with 3,000 angels. If they are patient and steadfast in facing all dangers and are pious, Allah will help them with 5,000 angels. According to the history of Adh-ahhak, this assistance with 5,000 angels is a promise from Allah which He promised to Muhammad if the Muslims are patient and pious. Ibn Zaid narrated, when the Muslims saw the large number of polytheists and their complete preparations, they asked the Prophet, \"Will Allah not help us in this battle of Uhud as He helped us in the Battle of Badr?\" Then come down this verse. Indeed, in the Battle of Badr Allah helped the Muslims with 1000 angels as mentioned in His word: (Remember), when you asked for help from your Lord, then He allowed it for you, \"Indeed, I will bring reinforcements to you with a thousand angels who come consecutive.\" (al-Anfal\/8:9). In the beginning, during the Uhud War, the Muslim troops were able to confuse the enemy so that many of the polytheists fled in disarray, leaving their property behind, and the Islamic soldiers began to scramble to take the property as booty. Seeing this situation, the archers were ordered by the Prophet Muhammad to remain in place, no matter what. Thinking that the polytheists had lost, the archers left their places and went down to take the treasure. Because that place had been abandoned by archers, Khalid bin Walid, the commander of the polytheists of Quraysh at that time, with his horsemen rode up to the place and occupied it, then showered arrows on the Muslims from behind so that there was chaos and panic among the Muslims. In this chaotic situation the polytheists tried to approach the Prophet's headquarters, but the companions were able to defend it even though the Prophet himself received injuries to his face, his lips and teeth were broken. Finally, thanks to their loyalty to defend the Prophet and their persistence in defending their position, they and the Prophet climbed back to Uhud hill safely. Thus the battle ended and the polytheists returned to Mecca disappointed because they could not defeat Muhammad and his troops, even though they themselves were still safe from destruction."
		   },
		   {
			"id": 419,
			"surah": 3,
			"ayat": 126,
			"tafsir": "Whatever happens, actually the victory only comes from Allah, the Almighty and the Most Wise. So if the Muslims really practice the instructions of Allah and His Messenger and truly believe and are sure of victory and remain patient and pious with complete trust, Allah will surely give them victory. But at the battle of Uhud, there was no determination and no obedience to orders, except at the start of the battle. This was proven by the emergence of doubts in the hearts of two groups of Muslims and the descent of archers who were ordered not to leave their places. This is why the Muslims were so badly hit in the Battle of Uhud."
		   },
		   {
			"id": 420,
			"surah": 3,
			"ayat": 127,
			"tafsir": "At the beginning of the battle, as mentioned above, the Muslim troops were able to confuse the enemy's ranks, so that many of them fell victim. Some historians say that eighteen people were killed from the polytheists. But this opinion is rejected by some other historians. They said, \"Sayidina Hamzah alone, can kill dozens of them.\" Other historians say that the reason for this difference of opinion is because when the Muslims counted the victims among the polytheists, they only found eighteen bodies. Even though the polytheists before returning to Mecca had buried some of the victims and brought other victims with them. So the victory of the Muslims in this first battle was due to their determination and determination engendered by the words of the Prophet Muhammad mentioned in verses 124 and 125. The defeat of the polytheists and the many victims among them was indeed Allah's will to destroy a group of people. disbelievers, annoyed them and insulted them with the defeat."
		   },
		   {
			"id": 421,
			"surah": 3,
			"ayat": 128,
			"tafsir": "In the second battle the Muslims suffered a failure so that 70 of them died as martyrs and the Prophet was injured. This saddened the hearts of the Muslims and the heart of the Prophet himself."
		   },
		   {
			"id": 422,
			"surah": 3,
			"ayat": 129,
			"tafsir": "Indeed, such is the right of Allah upon His servants because He Who owns all that is in the heavens and on earth. He has full power over everything, no one has power over His creatures except Him. He is the one who punishes and decides all affairs. He has the right to forgive and accept the repentance of His servant who seems disobedient, but who knows that in His servant there are seeds of faith and kindness. He has the right to torture because He is the All-Knowing which of His servants deserves torment in this world or in the hereafter. In addition, Allah is Most Forgiving, Most Merciful"
		   },
		   {
			"id": 423,
			"surah": 3,
			"ayat": 130,
			"tafsir": "This verse is the first to be revealed about the prohibition of usury. The verses regarding the prohibition of usury in surahh al-Baqarah verses 275, 276 and 278 were revealed after this verse. Riba in this verse, is usury nasiah which is also called usury ignorance that people used to do at that time. Ibn Jarir said, \"that what Allah means in this verse is: O you who believe in Allah and His Messenger, do not eat doubled usury, as you did in the days of ignorance after you converted to Islam, even though you have been given guided by him.\" At that time, if someone borrowed money as agreed at the time of borrowing, then the person who had the money demanded that the debt be repaid according to the time promised. The person who owes (because there is no money to pay) asks for a suspension and promises to pay the specified additional amount. Each time a delayed payment is added to the interest. This is what is called usury multiplied, and Allah forbids, Muslims do something like that. Ar-Razi gave the following explanation, \"If someone owes another person a hundred dirhams and the time has come to pay the debt and the person who owes it has not been able to pay it, then the person who is in debt allows the postponement of payment of the debt as long as the debtor wants to make the debt become two hundred dirhams or doubled. Then when the time comes for the payment and the debtor is still unable to pay it, then the payment can be suspended provided that the debt is doubled again, and so on so that the debt becomes piled up. This is what is meant by the word \"multiply\" double\" in the word of Allah. This kind of usury is also called usury nasiah because there is a delay in non-cash payments. Apart from usury nasiah there is also usury which is called usury fadhal, namely exchanging goods for similar goods of different quality, for example exchanging 1 liter of high quality rice with 1Â½ liter b low quality eraser. The prohibition of usury fadal is based on the hadiths of the Prophet, and only applies to gold, silver and staple foods, or what is termed \"usury goods.\" Because of the severity of the law of usury and the great danger, Allah commands Muslims to stay away from usury and always take care of themselves and fear Allah so that they do not fall into it and so that they can live happily and fortunately in this world and in the hereafter."
		   },
		   {
			"id": 424,
			"surah": 3,
			"ayat": 131,
			"tafsir": "Allah commands that Muslims maintain and stay away from the actions of unbelievers who do not care whether the wealth they earn comes from sources that are not lawful such as usury, extorting the weak, and the poor and so on. All those unlawful ways will harm them in this world and lead them to hell in the future. Imam Abu Hanifah explained, that this verse contains a very frightening threat, because in this verse Allah threatens the Muslims to put them into hell which is provided for unbelievers if they do not protect themselves from the actions that He has forbidden."
		   },
		   {
			"id": 425,
			"surah": 3,
			"ayat": 132,
			"tafsir": "Then the order is accompanied by an order that Muslims always obey and obey the commands of Allah and His Messenger because by obeying Allah and His Messenger they will receive an abundance of His grace and be able to live happily in this world and in the hereafter."
		   },
		   {
			"id": 426,
			"surah": 3,
			"ayat": 133,
			"tafsir": "Allah orders Muslims to immediately ask for forgiveness from Him if they commit sins and immorality at any time, because humans are not free from mistakes and oversights. A Muslim will not want to do something that is prohibited, but sometimes because of the strong temptation and deceit of Satan he falls into the abyss of immorality, then when he realizes his mistake and regrets for that action he then repents and asks Allah's forgiveness, then Allah will forgive his sins. Allah is Most Repentant and Most Forgiving and Most Merciful. If a Muslim always obeys the commands of Allah and His Messenger and stays away from all His prohibitions and immediately repents when he falls into the abyss of sin and immorality, then Allah will forgive his sins and will enter him later in the hereafter into a very wide heaven as a reward for the good deeds he has done. he has done in the world, namely heaven which He has prepared for those who are pious."
		   },
		   {
			"id": 427,
			"surah": 3,
			"ayat": 134,
			"tafsir": "This verse immediately explains the characteristics of a pious person, namely: First: A person who always spends his wealth both in a state of adequacy and in a state of poverty (poor), according to his ability. It is not required to provide a specified amount of wealth so that there is an opportunity for the poor to provide a living. It is okay to give alms with goods or money of little value, because that is what can be given will still be rewarded by Allah SWT. Aisyah Ummul Mukminin narrated that she gave charity with a grain of grapes, and among the companions of the Prophet there were those who gave charity with an onion. It was narrated that the Messenger of Allah said: \"Keep yourself from the fire of hell even by giving a piece of date in charity, and accept the request of a requester even by giving a piece of hoof of a burnt animal.\" (Ahmad's history in his Musnad). ) For people who are rich and spacious, of course their alms and donations must be adjusted according to ability. It is very strange and even embarrassing when a person with abundant wealth only gives charity and alms as much as the poor. This shows that the awareness of a living has not yet been planted in his heart. Allah says: Let the person who has breadth provide a living according to his ability, and the person whose sustenance is limited, let him provide a living from the wealth that Allah has given him. Allah does not burden a person except (according to) what Allah has given him. Allah will later give spaciousness after narrowness. (ath-thalaq\/65:7). The miserly nature that is embedded in the human heart should be eradicated by all kinds of means and efforts, because this trait is the number one enemy of society. No nation can progress and live happily if miserliness is rampant in that nation. Miserliness is contrary to humanity. Therefore Allah ordered to spend and explained that the wealth for which zakat is paid and donated in part, will not decrease and will even increase. Allah's Word: Allah destroys usury and nourishes alms.¦ (al-Baqarah\/2:276). Imam Gazali explained that fighting a bad trait must be by getting used to fighting that trait. So if someone wants to eradicate miserliness in himself, he should make it a habit to give charity and give help to others. By getting used to it, it will gradually lose its miserly nature. Second: People who hold back their anger. Usually people who indulge their anger cannot control their minds and they will commit cruel and evil acts so that when they are conscious they will surely regret the actions they have committed and they will wonder why they went that far. Therefore, if someone is angry, he should try his best to suppress his anger first. When he has regained control of himself and his anger has begun to subside, then he will take a just action in return for how people treat him. If someone has trained himself like that then he will not take actions that exceed the limits, he will even assume that the unfair treatment towards him may be due to an oversight and is not intentional and he will forgive him. Allah explains that holding back anger is a way to piety. A person who is truly pious will surely be able to control himself when he is angry. Siti Aisyah was once angry because of her maid's actions, but she was able to control herself, because of her pious nature. He said, \"How good is piety, it can be a remedy for all anger.\" The Prophet Muhammad said, \"The strong person is not the one who can slam his opponent, but the truly strong person is the one who can restrain his anger.\" Allah says: ... And when they are angry they immediately forgive. (asy-Shura\/42:37). Third: People who forgive other people's mistakes. Forgiving other people's mistakes while we are able to repay them in kind, is a good quality that every Muslim must have. Perhaps this is difficult to practice because it has become a habit for humans to repay evil for evil, but for humans who have high morals and strong faith and have filled their souls with piety, forgiving mistakes is easy for him. Maybe repaying evil for evil is still within the framework of justice, but it must be realized that repaying evil for evil cannot eradicate or eliminate that evil. Maybe with reciprocity the crime will expand and develop. If the crime is rewarded with forgiveness and after that it is accompanied by good deeds, then the person who committed the crime will realize that he has done something very bad and unfair to someone who is clean in heart and likes to do good. Thus he will not do it again and closed the door of evil. Fourth: People who do good. Doing good is a characteristic of pious people, so besides forgiving other people's mistakes, forgiveness should be accompanied by doing good to those who make mistakes. Narrated by al-Baihaqi, there was a jariah (girl slave) belonging to Ali bin Husain helping his master pour water from a jug to take ablution. Then the jug fell from his hand and shattered into pieces. Then Ali bin Husayn looked at his face as if he was angry. The slave said, \"Allah said: ... And those who restrain their anger ... (Ali 'Imran\/3:134).\" Ali bin Husain replied, \"I have endured that anger.\" Then the slave also said, \"Allah said: ¦ And forgive (mistakes) of others ... (Ali 'Imran\/3:134).\" Answered by Ali bin Husain, \"I have forgiven you.\" Finally the slave, it said again, \"Allah said: ¦ And Allah loves those who do good. (Ali 'Imran\/3:134).\" Ali bin Husain replied, \"Go you I have freed you,\" in order to achieve the pleasure of Allah. Such was the action of one of the grandchildren of the Prophet Muhammad for the mistakes of a slave because indeed he was a believer who was pious, he not only forgave the mistakes of his slaves, even the forgiveness was accompanied by doing good to him by freeing him."
		   },
		   {
			"id": 428,
			"surah": 3,
			"ayat": 135,
			"tafsir": "People who commit heinous acts or self-harm then they immediately ask Allah's forgiveness and do not repeat those actions again. The commentators distinguish between heinous acts (fahisyah) and self-harm (dhulm). They said that a heinous act is an act whose danger not only befalls the person who commits the sin but also affects other people and society. Persecuting oneself is committing a sin whose danger is only felt by those who do it. Vile acts such as adultery, gambling, slander and so on. Acts of self-abuse such as eating unclean food, wasting property, wasting it and so on. Maybe a Muslim has already committed a grave sin because of a lack of strong faith, because of temptation by Satan or for other reasons, but he immediately realizes and regrets his actions and then asks Allah for forgiveness and repents with true repentance and promises himself that he will not do it again. Then Allah will accept his repentance and forgive his sins because Allah is the Most Accepting of repentance and the Most Forgiving. If a person commits a sin even though what he is committing is not a major sin but continues to do so without any awareness of wanting to stop it and no regret and no desire to repent to Allah, then his sin becomes a grave sin. The Prophet Muhammad once said: \"A big sin will not become a big sin if you immediately ask for forgiveness (from Allah). And a small sin will become a big sin if you always do it.\" (History of ad-Dailami from Ibn Abbas). Asking Allah for forgiveness is not just saying the sentence \"I ask Allah's forgiveness\", but must be accompanied by regret and a promise to yourself not to do that sin again. This is what is called repentance nasuha, repentance that is accepted by Allah."
		   },
		   {
			"id": 429,
			"surah": 3,
			"ayat": 136,
			"tafsir": "These are the five qualities among the qualities of a person who fears Allah that every Muslim must have. Every Muslim should strive for the five qualities to manifest within him perfectly because by possessing these qualities he will become a Muslim who can benefit himself and can also benefit other people and the community, homeland and nation. People who have these qualities will be rewarded by Allah by forgiving their sins and placing them in the hereafter in heaven. They are eternal in it and indeed that is the best reward for anyone who does good deeds and tries to improve himself, society and his people."
		   },
		   {
			"id": 430,
			"surah": 3,
			"ayat": 137,
			"tafsir": "Sunah Allah or sunatullah means the applicable provisions that those who are right will eventually win and those who are wrong will lose. In general, this verse is still in the framework of the description of the Battle of Uhud (which starts from verse 121). Regarding important events and the attitude of disbelievers towards believers which ended in the victory of the believers, thanks to faith and patience in facing all kinds of dangers and obstacles to defend and uphold the truth. Sunatullah (provisions that apply) to His creatures in the form of glory or decline, never changes and always repeats or happens to every people who are in the same causes. Thus, since the ummah before the ummah of Muhammad, it remains in force until now. Therefore, we are led to travel and investigate on earth, so that we come to the conclusion that Allah, in His provision, has linked causes with their causes. For example, if someone wants to be rich, then he must seek the causes that can bring wealth. If you want to win in war, you must be prepared for all the reasons to get victory, both in terms of material and in terms of tactics and so on. If you want to be happy in this world and the hereafter, do the reasons to get it, and so on. Verse 137 instructs us to investigate and pay attention to the causes of punishment for those who deny the truth."
		   },
		   {
			"id": 431,
			"surah": 3,
			"ayat": 138,
			"tafsir": "What is mentioned in verse 137 is a warning to all mankind and a guide and a lesson for pious people. Scholars of tafsir say that the purpose of this verse is to warn Muslims that their defeat in the Battle of Uhud is a lesson for Muslims, and that the provisions of Allah's Sunnah apply. They won the Battle of Badr, because they carried out and obeyed the Prophet's orders. In the Uhud War they almost won but because they were negligent and no longer obeyed the Prophet's orders, they were finally surrounded and attacked from behind by a much larger enemy army, so that dozens of martyrs from the Muslims died, and the Prophet himself suffered injuries. and broke one of his teeth."
		   },
		   {
			"id": 432,
			"surah": 3,
			"ayat": 139,
			"tafsir": "This verse wants the Muslims not to be weak and sad, even though they experienced heavy blows and quite bitter suffering in the Battle of Uhud, because losing or winning in a battle is a normal thing that is included in Allah's provisions. That should be used as a lesson. The Muslims in war actually have a strong mentality and high spirits and are superior if they truly believe."
		   },
		   {
			"id": 433,
			"surah": 3,
			"ayat": 140,
			"tafsir": "In this verse it is explained that if the Muslims suffer injuries or meet their death, then the disbelievers have also experienced the same thing in the Battle of Badr. Thus winning and losing in war is something that is passed by God among humans. Victory and defeat, victory and setback, are circumstances that will be experienced by every nation or human being. Because of that they should always be able to take guidance from this situation, so that they can learn a lesson, and so that Allah distinguishes between believers and unbelievers, and also gives Muslims the joy of martyrdom which has a very high value in the sight of Allah, because they willing to sacrifice body and soul to defend the truth, and Allah does not like those who do wrong."
		   },
		   {
			"id": 434,
			"surah": 3,
			"ayat": 141,
			"tafsir": "The unfortunate events of the Muslims in the Battle of Uhud after they won the previous Battle of Badr, were also intended to distinguish true believers from hypocrites and to cleanse the hearts of believers who were still weak, so that they truly became sincere, clean from sin. The degree of one's faith is still disguised, and its essence is not clear except through a severe test. If he passes the test, then he can be said to be a person who is clean and pure, just like gold, its authenticity can only be known after being sharpened, burned and tested with hard water. The archers disobeyed the Prophet's order in the Battle of Uhud by leaving their post on the mountain, then took part in fighting over the loot. Because of that the Muslim troops were finally pushed back, topsy-turvy by the enemy. This event is a lesson for Muslims to make them aware that Muslims were not created to play games, to be extravagant, to be lazy, to hoard wealth, but to really do good deeds, to obey the Prophet's commands and not to violate them, no matter what. will occur. The sincerity of the hearts of the Muslims and their obedience to the orders of the Prophet can be proven when the Hamraul Asad war took place after being hit in the Uhud War. The Prophet ordered that the people who were allowed to participate in the Hamraul Asad war were people who had participated in the Uhud war. They gladly obeyed the Prophet's orders with a sincere and sincere will, even though some of them still had serious injuries, sad and restless hearts. On the other hand, the disbelievers suffer destruction because their hearts are dirty, pride and arrogance are still entrenched in them, as a result of the victory they have won."
		   },
		   {
			"id": 435,
			"surah": 3,
			"ayat": 142,
			"tafsir": "Scholars of tafsir explained that after the Prophet saw, learned about the preparations of the Quraysh in the form of a large army to attack the Muslims as revenge for their defeat in the Battle of Badr, the Prophet consulted with his companions, whether they would just stay in the city of Medina or would they out to fight outside the city. Even though the Prophet himself was more inclined to defend in the city of Medina, he nevertheless followed the popular opinion which required him to attack enemies outside the city. Thus the Prophet left the city to Uhud hill with an army of 1,000 people to fight the Quraysh, who numbered more than 3,000 people. The Muslim army, which was much smaller, was almost victorious, but in the end the mood turned into failure due to their impatience in obeying the Prophet's orders as the commander in the battle. Many victims fell here and there and some fled in fear. The Prophet himself was pressed and threatened, even news spread that the Prophet had been killed. Those who were killed as martyrs were their companions such as Abu Dujanah, thalhah bin 'Ubaidillah, Umm 'Imarah and others who had sacrificed themselves and their lives as the Prophet's shield. Also killed in the Battle of Uhud, Hamzah bin 'Abdul Muttalib, the uncle of the Apostle he loved. In verse 142, Allah says, \"Do you think that you will enter paradise when it is not yet manifest to Allah those who strive among you, and those who are patient have not yet been manifested.\" This is a reproach and correction by God for some of the Muslims who participated in the Battle of Uhud, namely for those who originally wanted to fight with zeal and encouraged the Prophet to leave the city to fight the Quraysh and not just stay in the city of Medina. just. They emphatically stated that they were ready to do everything to face the enemy even though they would die like the heroes of Badr. But in fact, after they were in a difficult situation and in a critical situation, not only did they lose their enthusiasm and were unable to carry out what they had previously stated to the Messenger of Allah, in fact most of them had lost their grip, except for some whose fighting spirit and fighting spirit continued to burn. , because of the firmness of belief and faith that cannot be shaken by any circumstances and circumstances. These are the defenders of the Prophet, defenders of Islam and truth."
		   },
		   {
			"id": 436,
			"surah": 3,
			"ayat": 143,
			"tafsir": "The Muslims before the Uhud War promised to die martyrs following in the footsteps of the martyrs of Badr. But they did not keep that promise when they saw the enormity of the battle. As the culmination of the difficulties faced by the Muslims in the Battle of Uhud, was the spread of the news that the Prophet had been killed. At that time, people who were weak in faith wanted to get good favors from 'Abdullah bin Ubai, the head of the hypocrites in Medina, so that he would try to get protection from Abu Sufyan, some even shouted, saying, \"If Muhammad is dead, come on. Let's just go back to our original religion.\" In a state of confusion, the Prophet's companion (Anas bin an-Nadhar) spoke, \"If Muhammad had been killed, then the Lord Muhammad would not have been killed. Why did you live after the killing of the Prophet? Let us continue to fight, even though he was dead.\" Then Anas bin an-Nadhar prayed to God for forgiveness because of the words of those who were weak in faith, then he took his sword and continued to fight until he died a martyr."
		   },
		   {
			"id": 437,
			"surah": 3,
			"ayat": 144,
			"tafsir": "Muhammad is only a Messenger of Allah. If he is killed, then that is a normal thing, as has happened to the previous prophets and apostles. There are ordinary dead and there are killed. Why did some of the Muslims become apostates because they heard the news that Muhammad had been killed? Know that an apostate will not cause any harm to Allah. And Allah will reward those who thank Him. Gratitude is usually defined as thank you. Thanking in this verse is not just saying, but with an action and real evidence. Being grateful to humans is doing good to him as a reward, while being grateful to Allah is serving Him, according to His commands. In upholding the truth, we must try earnestly, struggle with faith and patience and be willing to accept all kinds of trials and suffering. It is these people who are truly grateful to Allah and who will surely receive the reward that He promised."
		   },
		   {
			"id": 438,
			"surah": 3,
			"ayat": 145,
			"tafsir": "Allah states, \"Every soul will not die except by His permission, at the exact time according to what He has determined.\" This means: the matter of death is only in the hands of God, not in the hands of anyone or in the hands of a feared enemy. This is a warning to the believers who fled from the battlefield of Uhud for fear of death, and is also a guide for every Muslim who is fighting in the way of Allah. Then Allah gave guidance to Muslims how to strive in the way of Allah with His words: ... Whoever wants the reward of this world, We will surely give him that (worldly) reward,¦(Ali 'Imran\/3:145). This means that every Muslim must straighten and correct his intention in carrying out every struggle. If the intention is just to get worldly rewards, then no matter how big the struggle is, then the rewards will only be worldly. And whoever intends to get the reward in the hereafter, Allah will reward him with the reward in the hereafter. Allah will reward those who are grateful, namely those who obey His commands and always accompany His Prophet."
		   },
		   {
			"id": 439,
			"surah": 3,
			"ayat": 146,
			"tafsir": "Allah again corrected some of the followers of the Prophet Muhammad who were weak and disloyal in the Battle of Uhud by pointing out the condition of the people of the previous prophets that in jihad fisabilillah, their spirit and faith remained strong, not weak, not lethargic and did not give up in times of disaster. . Such people are loved by Allah because of their patience."
		   },
		   {
			"id": 440,
			"surah": 3,
			"ayat": 147,
			"tafsir": "They, besides being patient and steadfast in jihad fisabilillah with the Prophet, did not forget to have a direct relationship with Allah SWT by praying that their sins and excessive actions would be forgiven by God, their stance was set so that they would win over the disbelievers."
		   },
		   {
			"id": 441,
			"surah": 3,
			"ayat": 148,
			"tafsir": "Because of the sincerity, sincerity, firmness of faith and patience of the followers of the previous prophets in facing all kinds of suffering in fighting for the truth in the way of Allah, Allah will give them a reward in this world and a reward that is appropriate in the hereafter."
		   },
		   {
			"id": 442,
			"surah": 3,
			"ayat": 149,
			"tafsir": "According to Ali bin Abi Talib, this verse was revealed in connection with the events of the believers when they received such a heavy blow in the Battle of Uhud that the hypocrites said to them, \"Go back to your brothers and enter their religion.\" Thus what is meant by unbelievers in this verse are hypocrites. This verse warns every believer in Allah who has suffered in the Battle of Uhud and others in every time and place, to remain vigilant so as not to fall into a weak attitude, give up and follow the venomous enticements of infidels, Jewish hypocrites, because of the consequences will cause great harm and loss."
		   },
		   {
			"id": 443,
			"surah": 3,
			"ayat": 150,
			"tafsir": "Muslims must obey Allah because He is their best Protector. Do not let them follow unbelievers like Abu Sufyan and his friends (at that time), or hypocrites like 'Abdullah bin Ubai or other infidels and hypocrites who will lead them astray and plunge them into a very dangerous abyss."
		   },
		   {
			"id": 444,
			"surah": 3,
			"ayat": 151,
			"tafsir": "The form of Allah's help given to believers, by whispering into the hearts of unbelievers the fear to continue the war, because they associate partners with Allah. Their place is hell and that is the worst place to live for the wrongdoers. Indeed, no matter how great and mighty a person is, he will feel weak and unable to do something, if he has been seized by a feeling of fear."
		   },
		   {
			"id": 445,
			"surah": 3,
			"ayat": 152,
			"tafsir": "Allah has fulfilled everything that has been promised to His faithful servants, where they have reached a stage of victory by destroying the enemy forces which are far more numerous and prepared. But because they were impatient, less obedient and less disciplined towards Muhammad's command which ordered that every team, especially the archers team not to leave their respective places before there was an order, but many of them disobeyed it, they even had disputes because they wanted worldly wealth, namely after the spoils of war, then what happened, the enemy became strong again, because they had seized strategic places, finally the Muslims became weak, so they suffered suffering because of their own actions and behavior, as a test from Allah on faith, patience and their discipline. At the end of this verse, Allah explains what has happened and they have regretted their mistakes, and Allah has forgiven them, because Allah always bestows His bounties on the believers. The commentators describe what is meant by Allah's promise mentioned in this verse as follows: 1. Allah's promise will help the believers in the Battle of Uhud by sending reinforcements of five thousand angels, if they are patient and pious. 2. God's promise will give victory delivered by the Prophet to the archers team as long as they don't leave their place. But apparently many have left the place. 3. Allah's promise will help every believer who is patient and pious which is mentioned in many verses and surahhs in the Qur'an. If we look at the three opinions mentioned above, they are not contradictory to one another, only the views are from a different perspective. The first opinion looks at it from a historical perspective and the relationship between verse 152 and verse 125. The second opinion looks at it from the perspective of historical facts about their violation of war tactics, which the Messenger of Allah ordered them to do, the third opinion looks at it in general, because in Al -The Qur'an has many verses that promise help and help to those who believe, are patient and fear him."
		   },
		   {
			"id": 446,
			"surah": 3,
			"ayat": 153,
			"tafsir": "Important events in the ranks of the Muslims in the Battle of Uhud, namely: the reasons for their failure, when most of them fled, while the Prophet called them from behind not to do so and return to their respective troops, but they did not heed it . Because of that, they were overtaken by quite heavy suffering. If they realized what they had done at that time, surely they would not be sad or surprised, why they failed in the Battle of Uhud, Allah knows all what they will do."
		   },
		   {
			"id": 447,
			"surah": 3,
			"ayat": 154,
			"tafsir": "Continuing events after they experienced difficulties and suffering, Allah gave a group of them who have strong faith and patience to feel sleepy to calm them from their fear, fatigue and anxiety. Thus they were able to gather back their strength which had been reduced by the fierceness of the battle and lost morale. While the other group does not receive this sleepiness, namely the group whose faith is weak, they even feel afraid and anxious. This verse states that the followers of the Prophet after the end of the war were divided into two groups. First: The group who realized that their blow in the Battle of Uhud was due to their mistake in the form of a lack of discipline towards the command of the Prophet as the commander of the battle. They remain confident and believe in Allah's help in the form of victory for those who believe. Because even though at this time they experienced disaster, Allah will still defend those who believe. It is this group that gets the pleasure of sleepiness. Second: The group whose faith is weak because they are filled with worry they don't really believe in the command of the Messenger of Allah because of the hypocrisy that has nested in their hearts. It is this second group who thinks that Allah and Muhammad are absurd as the ignorant people think. Among other things, they thought that if Muhammad was really a prophet and messenger, surely he and his companions would not lose in the Battle of Uhud. They said to abdicate, \"Do we have the right to interfere in this matter?\" Say, O Muhammad, \"All these matters are in the hands of Allah.\" They hid a lot of things that they did not reveal to you, they said, \"If there were rights to intervene in us, surely we would not be defeated here.\" But tell them if they were in their respective homes and did not participate in the war, but if it is destined to die outside the home, then they will definitely die in the place that has been determined. All of these incidents are to test what is stored in the hearts of Muslims and to cleanse their hearts from the doubts whispered by Satan, so that the faith in their hearts will grow stronger. Allah knows best what is in their hearts."
		   },
		   {
			"id": 448,
			"surah": 3,
			"ayat": 155,
			"tafsir": "During the decisive battle in the Battle of Uhud, some of the Muslims left their defenses which could not be left, especially by the archers, but they also left. They felt that the enemy had lost so they left their position with the intention of getting loot. Finally, the enemy occupied their position and they were in disarray and suffered from the enemy's repeated attacks. However, in the end they realized and regretted their mistake, so Allah forgave them. Indeed, Allah is Most Forgiving, Most Forbearing by freeing them from punishment in the hereafter. The wars that occurred in the history of Islam during the time of the Prophet, none of which were started by Muslims. The attitude of the Prophet and his companions in this matter was only defensive, self-defense, not offensive, in accordance with the principles in the Qur'an, \"Fight in the way of Allah those who fight you, but do not exceed your limits. Truly Allah does not like those who transgress the limits\" (al-Baqarah\/2: 190). But if the enemy invites peace, welcome it immediately (al-Anfal \/ 8: 61). We must always be ready to accept peace if the trend towards peace is on the other side. Our duty must be pioneers of peace, not pioneers of war. There is no point in fighting just for the sake of fighting. This was what happened in the Battle of Badr (Ali 'Imran\/3: 13, 123) in the month of Ramadan, the second year after the migration. Then in the Ahzab War (War of the Ditches, al-Ahzab\/33:9) around the 5th year after the Hijra, the Musyrikin of Mecca with a strength of 10,000 people, with the help of the Jews who betrayed after making an agreement with the Prophet. But they then fled and returned to Mecca bringing great failure. Then the last Hunain War shortly after the Liberation of Mecca in the 8th year. Likewise in the Battle of Uhud (Ali Imran\/3:121) which took place a year after the Battle of Badr, the enemy who had come all the way from Mecca wanted to attack Medina. Their arrival with a force of 3000 people came to Medina to avenge their defeat in the Battle of Badr. It was in this war that the Muslims and the Messenger of Allah were subjected to severe trials. The Prophet saw consulted with his companions, as had become the way of life of the Prophet who always consulted. Some of them wanted to stay in the city, arguing that the enemy did not know the ins and outs of the city. When the enemy has entered the city, we will surround it and we will attack it. People will also attack with stones from the roofs of the houses. Others wanted to meet the enemy outside the city, because if the enemy set foot in the city of Medina, the people would be victims, and they would think they had won and it would make them braver. On the basis of the decision with these considerations, the Muslims left the city under the leadership of the Prophet Muhammad. In this war no one wins and no one loses. In the face of this threat, the Prophet with his foresight, courage and responsibility, immediately decided to take a place at the foot of Mount Uhud, which encircled most of the city of Medina, about three miles to the north. On 7 Shawwal in the third year of Hijri (January 625) at dawn, he had made preparations to face the war. Medina is famous for its extreme winter, but the Muslim army (700 to 1000 people) at dawn was ready. To the south of them was a steep valley with a swift stream of water, while the hillsides behind them were occupied by 50 archers to prevent enemy attacks from behind. The enemy was getting ready to attack the walls of Medina, while the Muslim troops were behind them. At first the battle was in favor of the Muslims. The enemy had been ravaged, but the ranks of Muslim archers, who had disobeyed the Prophet's orders, left their posts. They joined the chase and fought over the spoils of war. The commandment was: Do not chase after the spoils of war, and keep strict discipline. Not a few enemies have been killed, and they have started to retreat. At that time a part of the Muslim army, disobeying orders, continued to pursue them because they were attracted by the possibility of getting spoils of war. The enemy seized the opportunity left by the archers, and it was then that a fierce hand-to-hand battle ensued, which reportedly proved to be of great benefit to the enemy. Many friends of the Ansar were killed. But they know no retreat. In this battle Hamzah, the uncle of the Prophet from the father's side, was killed as a martyr. Rasulullah himself also received injuries to the head and face, a tooth fell out. Had it not been for his steadfastness, courage and composure, the Muslims would have suffered a major defeat. Even though the Prophet was injured, so were the other Muslims who were injured, the next day they returned to the battlefield. Abu Sufyan and his Meccan troops cautiously withdrew quickly. Medina can be saved. The Muslims can learn from this event: faith, loyalty and steadfastness. (Abbreviated from Tafsir Al-Qur'an A. Yusuf Ali)."
		   },
		   {
			"id": 449,
			"surah": 3,
			"ayat": 156,
			"tafsir": "Regarding the spirit of jihad in those who believe that has been instilled, Allah forbids them from adopting beliefs like the beliefs of unbelievers who say about their friends who died while traveling or fighting. \"If they, the believers, had stayed with us and had not gone to war, surely they would not have died or been killed.\" Those beliefs and words are not only untrue, but also cause a deep sense of regret, even though the matter of life and death is in God's hands. It is He who gives life and death to all His creatures according to the appointed time, place and cause."
		   },
		   {
			"id": 450,
			"surah": 3,
			"ayat": 157,
			"tafsir": "Then the verse explains that there is nothing for believers to fear when they strive in the way of Allah, because if they fall or die, surely they will receive forgiveness and mercy from Allah. It is far better for them than the spoils of war or the wealth of this mortal world."
		   },
		   {
			"id": 451,
			"surah": 3,
			"ayat": 158,
			"tafsir": "Everyone will die or be killed for any reason, either because they die in war while traveling or in their own place. They will surely be returned to Allah and all their deeds will be accounted for in the hereafter. If you are evil you will be rewarded with the torments of hell and if you are good you will be rewarded with going to heaven. Therefore, a believer should choose and take a path that can draw him closer to Allah, in order to obtain His forgiveness and mercy. For this reason, let a Muslim not feel reluctant to wage jihad in the way of Allah, to draw closer to Him."
		   },
		   {
			"id": 452,
			"surah": 3,
			"ayat": 159,
			"tafsir": "Even though it was in a precarious situation, such as the violations committed by some Muslims in the Uhud War which caused the Muslims to suffer, the Prophet remained gentle and not angry with the offenders, even forgave them, and asked forgiveness from Allah for them. If the Prophet Muhammad had been tough, rough-hearted, they would have distanced themselves from him. In addition, the Prophet Muhammad always consulted with them in all matters, especially in matters of war. Therefore the Muslims obediently carry out the decisions of the deliberations because these decisions are their own decisions with the Prophet. They keep fighting and jihad in the way of Allah with unanimous determination regardless of the dangers and difficulties they face. They put their full trust in Allah, because no one can defend the Muslims besides Allah."
		   },
		   {
			"id": 453,
			"surah": 3,
			"ayat": 160,
			"tafsir": "If Allah wants to help the Muslim army, then nothing can prevent it, as Allah helped the Muslim army in the Battle of Badr because they surrendered to Allah. Likewise, if Allah wanted to offend them or wanted to wreak havoc on them, nothing could stop them, what happened in the Battle of Uhud due to lack of obedience and discipline towards the Messenger's commands Therefore, every believer should put his full trust in Allah, because no one can defend the Muslims besides Allah."
		   },
		   {
			"id": 454,
			"surah": 3,
			"ayat": 161,
			"tafsir": "In the Battle of Badr a red blanket of booty was lost before it was divided up. Some of the hypocrites said that the blanket might have been taken by the Prophet or the archers. It is inappropriate and impossible for the Messenger of Allah to commit treason by taking goods ganimah (spoils of war). This is contrary to the infallibility of the Prophet (preserved him from reprehensible actions), his high morals which is the prime example. Whoever commits such treachery, on the Day of Resurrection, he will come with the proceeds of his betrayal and he will not hide it. Everyone will receive a reward for his good or bad deeds, and in that case he will not be wronged. Like people who do good minus their reward or people who do bad plus their torment. What is meant by gulul in ayat 161 is to secretly take the property of many people. So taking is a kind of stealing. An apostle is characterized by being trustworthy, trustworthy. Because of that it is very unlikely that the Messenger of Allah did gulul even in this gulul problem Rasulullah saw once said: \"O all people! Whoever among you does something for us, then he hides a piece of stitching or more than that, then the act is gulul (corruption) ) must be accounted for later on the Day of Judgment.\" (Muslim history). \"Umar bin al-Khattab said, \"After the Khaibar war was over, several friends went to the Messenger of Allah and said, Person A was a martyr, Person B was a martyr until they called Person C a martyr. The apostle replied, \"No, I saw that C was in hell, because he stole a blanket or a piece of clothing.\" Then the Apostle said, 'O Umar, you go and announce to the crowd that Person C will not enter heaven, except for the believers. Umar said, then I came out, so I called, 'know that C will not enter heaven except the believers.\" (Muslim History)."
		   },
		   {
			"id": 455,
			"surah": 3,
			"ayat": 162,
			"tafsir": "People who seek Allah's pleasure by worshiping and doing good deeds are not the same as people who earn Allah's wrath, because they commit immorality, violate His prohibitions and leave their obligations. The person who earns Allah's wrath is in a hellish place, and that is the worst place to return. In the Al-Qur'an there are many verses that are strung together mentioning two different groups whose characteristics are different and opposite, for example the verse: So is a person who knows that what God has revealed to you is the truth, the same as a person who is blind? ... (ar-Rad\/13:19). So is it the same person We promised him a good promise (Paradise) and he got it, with the person We gave him the pleasures of worldly life? (al-Qasas\/28:61). The two groups each have levels, because on the Day of Judgment which is the Day of Judgment, the two groups will be rewarded according to their deeds in the world. People who do a lot of good will be high in rank and people who do a lot of evil will be at the lowest level. The highest level of the human group is usually called ar-rafiul ala, that is the level reached by the Prophet Muhammad, and the lowest is called ad-darkul asfal. This is explained in the Qur'an that humans in the sight of Allah, whether he is good or bad, are levels of goodness and badness. Allah is All-Knowing of the levels of their deeds and rewards them according to their deeds."
		   },
		   {
			"id": 456,
			"surah": 3,
			"ayat": 163,
			"tafsir": "All of God's visible creatures are divided into 3 types, namely nabatat (plants), hayawanat (animals) and jamadat (inanimate objects). The type of vegetable is a type of plant that grows on soil or water or grows in other places, for example on branches or logs. The type of hayawanat is a type of creature that lives animate. The types of jamadat are other than the types of nabatat and hayawanat. There are creatures of the hayawanat type which for the sake of their life are endowed with reason and understanding, for example humans and some which are not, namely the vegetal type. Humans should use their mind and understanding to distinguish between good and bad, between what is beneficial and what is harmful. Then he can choose which one is good for his own benefit. But because man is also given lust, if he is not good at controlling it, he will invite more evil and evil. Therefore, if humans sail the ark of their lives and lives without the leadership and guidance of an apostle, they will experience chaos, damage and destruction. This has been proven by the history of Prophet Adam. This means: every fatrah era (vacuum period between an apostle and the apostle after him) humans on this earth always experience chaos, commotion and destruction, so the sending of an apostle is a blessing and happiness for human society."
		   },
		   {
			"id": 457,
			"surah": 3,
			"ayat": 164,
			"tafsir": "Allah really gives benefits and favors to all believers in general and to those who believe together with the Messenger of Allah in particular, because Allah sent an apostle from among themselves, so that they can easily understand what he says and can witness his behavior to follow and imitated his deeds. The Prophet Muhammad immediately read the verses of Allah's greatness to purify them in charity and intention, and taught them the Bible and al-Hikmah. What is meant by al-Kitab is a compendium of all revealed knowledge, while al-Hikmah includes all acquired knowledge. If it is connected with the existence of kalam and philosophy, then kalam is heavier on al-Kitab while philosophy is heavier on al-Hikmah, even though both of them glorify one another with a certain high degree of harmony. Both of them met in the similarity of faith and depth of religious feeling."
		   },
		   {
			"id": 458,
			"surah": 3,
			"ayat": 165,
			"tafsir": "This verse still has something to do with the verse about the story of the Uhud War. During the Uhud War 70 of the Muslim troops died as martyrs. Some of them said where and why did we experience such a big disaster? While the Muslim troops in the Battle of Badr had won a major victory by making the enemy run topsy-turvy and were able to kill 70 enemies and take 70 more people prisoner. To this question, the Prophet received an order to answer that the disaster was due to their own fault. The archers were ordered by the Messenger of Allah to stay on the hill and were not allowed to leave it until there was an order from him. But they had disobeyed the order and left the hill to take part in the ganimah goods. It was from the top of the hill left by the archers that the enemy attacked the Islamic army, so that in the end they suffered defeat. Verily Allah is Almighty over all things."
		   },
		   {
			"id": 459,
			"surah": 3,
			"ayat": 166,
			"tafsir": "The victory that was obtained by the Islamic army in the Battle of Badr was due to Allah's permission and help. The defeat was originally bad luck, and conversely victory is good luck for the martyrs and a lesson for the Muslims. Allah says: Whatever goodness you get, is from Allah, and whatever bad things happen to you, it is from your own (errors). ¦. (an-Nisa\/4:79). The existence of victory and defeat at the beginning of the war for both the Muslim army and others is a common thing, but in the end the Muslim army will win. This is intended, among other things, to test the firmness of each other's faith and steadfastness so that the believers have a thicker faith so that they can be distinguished from other people."
		   },
		   {
			"id": 460,
			"surah": 3,
			"ayat": 167,
			"tafsir": "This is also so that the hypocrites can be known for their real hypocrisy. At the time of the Uhud War, the number of Muslim soldiers was 1,000 people. Then in the middle of the road, 300 people who were classified as hypocrites under the leadership of Abdullah bin Ubay had returned to Medina. So the Battle of Uhud was a separator between soldiers who truly believed and those who were half-faithful, namely the hypocrites. When the hypocrites are invited to fight fi sabilillah to uphold the religion of Allah, defend rights and justice and reject evil and evil in order to seek the pleasure of Allah or fight to protect themselves and defend their homeland, they answer, \"If we know that we can and are able to fight we follow the Muslims.\" But they judged that the Muslims fought at that time simply to plunge themselves into destruction. Actually they are more inclined towards disbelief than faith and what they say is not really what is in their hearts. Allah knows the hypocrisy they hide in their hearts."
		   },
		   {
			"id": 461,
			"surah": 3,
			"ayat": 168,
			"tafsir": "The hypocrites did not take part in the war and said to their friends who had been killed in the Battle of Uhud, \"If they had followed us and stayed in Medina without participating in the war, surely they would not have been killed.\" Say to them O Muhammad, \"Reject your own death if you are righteous.\" Actually they will not be able to resist death even if they just stay at home or take refuge in a strong fortress. In time people will surely die. The causes of death may vary. Allah says: Wherever you are, death will find you, even if you are in a high and firm fortress¦ (an-Nisa\/4:78)."
		   },
		   {
			"id": 462,
			"surah": 3,
			"ayat": 169,
			"tafsir": "People who have been killed as martyrs in the fi sabilillah war, do not think that they are dead, as the hypocrites think, but they are still alive with Allah, receiving abundant sustenance and favors. What is the condition of their life so on, only Allah knows. In the hadith narrated by Ibn Abbas, the Prophet said that the martyrs are on the banks of the river near the gates of heaven, they are in a green dome. Their dishes are out of that heaven every morning and evening. (History of al-hakim, Ahmad and at-thabrani from Ibn 'Abbas). The martyrs enjoyed the gifts of Allah, they wanted to be martyred again and again. This is explained in the words of the Prophet Muhammad: \"There is no one who has died and received pleasure from Allah, then wants to return to the world except for a martyr. He wants to be returned to the world, then dies martyr again. This is because of the great virtue of death martyrdom..\" (Muslim history)"
		   },
		   {
			"id": 463,
			"surah": 3,
			"ayat": 170,
			"tafsir": "The martyrs of the Uhud War after enjoying God's grace, they said, \"Hopefully our friends know about this pleasure.\" Then God answered, \"I am the one who conveyed this to them.\" The martyrs were happy for the favors and bounties that Allah had given them. And they hope that their comrades in arms who are not killed in the war fi sabilillah if they can also get the mercy and favors of Allah similar to what they got. For them there is no worry or trouble."
		   },
		   {
			"id": 464,
			"surah": 3,
			"ayat": 171,
			"tafsir": "Believers and mujahideen rejoice at the blessings of Allah as a reward for their deeds and for the addition of other gifts. Truly Allah will not reduce the reward that has been determined for the believers and mujahideen."
		   },
		   {
			"id": 465,
			"surah": 3,
			"ayat": 172,
			"tafsir": "Believers fulfill the call of Allah and His Messenger to remain in the way of Allah even though they have been injured. Those who do good and piety will get a great reward."
		   },
		   {
			"id": 466,
			"surah": 3,
			"ayat": 173,
			"tafsir": "The revelation of this verse relates to Abu Sufyan the warlord of the polytheists of Mecca and his army, who had returned from the Battle of Uhud. After arriving at a place called Ruha, they regretted it and intended to return to continue the war. This news reached Rasulullah, so he called back the Muslim troops to face Abu Sufyan and his soldiers. The Messenger of Allah said, \"No one should join the war today except for those who participated yesterday, while the Islamic soldiers at that time had many injuries. But in the end, Allah swt lowered fear in the hearts of the polytheists and then they returned home. the mujahideen were frightened by some of the enemies (hypocrites), by stating that the enemy had gathered new strength to face them. will continue to protect us and in Allah we put our trust.\""
		   },
		   {
			"id": 467,
			"surah": 3,
			"ayat": 174,
			"tafsir": "With faith and strong determination, they finally got to Medina. Abu Sufyan and his soldiers did not attack them. They experience no suffering at all and they remain in the good pleasure of Allah."
		   },
		   {
			"id": 468,
			"surah": 3,
			"ayat": 175,
			"tafsir": "The hypocritical enemies who try to frighten the believers are demons who invite their friends not to join the war and frighten the Muslims by declaring that the enemies are numerous and fully armed. Allah warns the mujahideen not to be influenced and not to follow them, but fear Allah and be prepared to fight alongside Rasulullah SAW if you truly believe."
		   },
		   {
			"id": 469,
			"surah": 3,
			"ayat": 176,
			"tafsir": "When the Prophet Muhammad saw the state of the Muslims in the Battle of Uhud, he felt sad and worried. It was then that this verse came down to comfort the Prophet, \"O Muhammad, do not feel sad and anxious, seeing the actions of some of your followers who are hypocrites who, together with the disbelievers, are gathering all their efforts and strength to defend disbelief. In essence, it is not you who are being fought and persecuted by them, but it is Allah they are fighting. Surely they will be powerless against Allah.\" Their intention is to harm and harm the Muslims, but in essence they are the ones who are hurting. Allah will not forgive them in the hereafter. They will receive a very painful and immeasurahble punishment."
		   },
		   {
			"id": 470,
			"surah": 3,
			"ayat": 177,
			"tafsir": "After Allah unmasked those who help and take the side of the disbelievers who oppose the Muslims, and emphasized that they are essentially opposing and fighting against Allah, then in this verse Allah explains that this also applies to everyone who prioritizes disbelief rather than disbelief. faith. They do not harm God in the slightest, and for them a painful punishment. They will not be able to do so, because Allah defends Islam. Instead they will receive severe punishment in the afterlife."
		   },
		   {
			"id": 471,
			"surah": 3,
			"ayat": 178,
			"tafsir": "Never should those disbelieves think that letting them live long is good for them. This is not the case, unless they are dignified and do good deeds that will purify and cleanse them from vile things and bad traits. Things like that will be useful for them and for other humans. But in reality, they still do immorality and sin. Thus they destroy themselves, so that they get a humiliating punishment."
		   },
		   {
			"id": 472,
			"surah": 3,
			"ayat": 179,
			"tafsir": "One of the sunnatullah to His servants that cannot be changed is that He will not let the believers remain in trouble as was the case in the Battle of Uhud. Allah will separate the believers from the hypocrites, and will improve the condition of the believers and strengthen their faith. In difficult and difficult circumstances, it can be judged and distinguished between people who have strong faith and those who have weak faith. The Muslims were tested to what extent their faith and sincerity faced the unbelievers. After the Muslims experienced difficulties in the Battle of Uhud because they were beaten back by the enemy, and they were almost discouraged, it was then that it was discovered that among the Muslims there were hypocrites who had deviated, sided with the enemy. People who are weak in faith experience confusion. Unlike the case with people who have strong faith, the difficulties they face encourage them to increase their faith and spirit strength. Unseen things and hidden wisdom in this incident were not shown except to certain people, such as the apostles who had been chosen by Allah. Among the messengers, Prophet Muhammad saw. chosen by Allah by giving him privileges in the form of knowledge to respond to the contents of the human heart, so that he can determine which of them is truly a believer and who is a hypocrite or an infidel. He is aware of the unseen, but He does not show anyone about the unseen, except for the apostles whom He pleases, so surely He made guardians (angels) in front of them and behind them. (al-Jinn\/72: 26-27). After explaining the reproaches of the hypocrites for Muhammad's prophethood after the Uhud War and explaining that the Uhud incident contained a lot of iktibar, the believers were ordered to continue to believe in Allah and His messengers, and in the Prophet Muhammad who confirmed the messengers. -the previous apostle. If they believe in him especially about the unseen and fear Allah by staying away from His prohibitions, obeying all His commandments, then they will get a very great reward. In the Qur'an, the word piety is often followed after the word faith, as is the case with the word zakat after the word prayer. It shows that faith is only perfect if it is accompanied by piety, just as prayer is only perfect if zakat is issued."
		   },
		   {
			"id": 473,
			"surah": 3,
			"ayat": 180,
			"tafsir": "People who have been given wealth and abundance of grace by Allah and then they are curmudgeonly, do not want to issue obligations regarding these assets, such as zakat and others, is very despicable. Never let stinginess be considered good and profitable for them. Wealth and wealth will remain intact and not lacking if it is spent in the way of Allah, it will even increase and be blessed. But miserliness is a bad thing and is detrimental to themselves, because the wealth that is not spent will be wrapped around their necks later on the Day of Resurrection as a very severe punishment and torment, because the wealth that is worn will turn into a snake that wraps around them with strong. The Prophet Muhammad saw said: Whoever has been given wealth by Allah, then does not pay zakat, will be shown his wealth in the form of a rice field snake that is bald, has two black spots above both eyes, then put a necklace on it on the Day of Judgment later. The snake opened its jaws and said, \"I am your treasure, I am your savings,\" then the Prophet recited this verse. (History of al-Bukhari and al-Nasai from Abu Hurairah). In fact, all that is in the heavens and on earth belongs to Allah, and is given to those whom He wills as a deposit and a trust. At any time it can be revoked and transferred to other people's hands according to His will. So what is the reason for those who are stingy and do not want to spend Allah's wealth to please Him? Whatever a person does, everything is known by Allah and rewarded according to his deeds and intentions. The Prophet Muhammad said: \"That charity depends on intention, and that everyone will get according to what he intended.\" (History of al-Bukhari and Muslim from 'Umar bin al-Khattab)."
		   },
		   {
			"id": 474,
			"surah": 3,
			"ayat": 181,
			"tafsir": "When Allah's revelation came down: Whoever lends Allah (spends his wealth) with a good loan ¦ (al-Baqarah \/ 2: 245), then a Jew came to the Messenger of Allah and said, \"Is your Lord poor? Then beg from his servants To give him a loan? We are rich people.\" Then come down this verse. Truly Allah hears the words of those who say, \"That Allah is poor and we are rich.\" And believe that their words and deeds killing the prophets without the right reasons will be recorded, then in return, they will be given the punishment they deserve. It was at that time that Allah would say to them, \"Feel this burning punishment as the followers of the apostles have felt the pain of your words in a world of piercing feelings.\""
		   },
		   {
			"id": 475,
			"surah": 3,
			"ayat": 182,
			"tafsir": "The painful punishment that applies to them (the Jews) is the result of their own actions in the world. They say that Allah is poor. They killed the Prophets, committed wicked deeds, immorality and others. Allah will never mistreat His servants. Allah treats His servants according to their deeds. The Word of God There is no reward for good other than good (too). (ar-Rahman\/55:60). If good deeds are rewarded with heaven, and if bad deeds are rewarded with hell. Allah will not treat people who commit immorality as pious people, so also disbelievers are not the same as believers. Do those who commit crimes think that We will treat them like those who believe and do good, that is, the same in their life and death? How bad their judgment was. (al-Jasiyah\/45:21)."
		   },
		   {
			"id": 476,
			"surah": 3,
			"ayat": 183,
			"tafsir": "Some Jews, including Kaab bin Asyraf, Malik bin as-saif, Finhas bin 'Azura and several others, came to the Messenger of Allah and said, \"O Muhammad! You claim to be Allah's Messenger and Allah has revealed to you the Book, while in the Torah (Leviticus ix) God forbade us to believe in an apostle, before he brought us a sacrifice eaten by fire. If you can prove that, then we will believe you.\" Then come down this verse. Thus said Ibn Abbas ra. Their request was just an excuse to distrust the Prophet Muhammad. For this reason, Allah ordered the Prophet Muhammad to tell their lies with the words, \"There have come to you messengers before me, such as Zakaria, Yahya and others, bringing miracles that show the truth of their prophethood, and bring anything that you propose such as bringing a sacrifice that is eaten by fire which does have a special characteristic, namely burning.Therefore in the past there was a belief that fire was always used as a yardstick to judge whether the sacrifice offered was accepted by God or not, if it burned it meant it was accepted, but you still don't believe in them, even kill them.So where lies your truth?Try to prove, if you are truly a righteous person."
		   },
		   {
			"id": 477,
			"surah": 3,
			"ayat": 184,
			"tafsir": "If they still continue to deny you, even though you have shown real miracles and the Book that guides you to the right path, then do not be upset and worried about their stubbornness and disbelief. Things like that have also been experienced by the apostles before you. They have been given what has been given to you like real miracles. Allah has brought in the suhuf, which are sheets containing the revelations given to the prophets before you whose contents contain wisdom and have also brought forth the Book which provides a perfect explanation, containing Shari'a laws such as the Torah, the Bible and the Psalms. They remain patient and steadfast in the face of the hurtful actions of those who deny them."
		   },
		   {
			"id": 478,
			"surah": 3,
			"ayat": 185,
			"tafsir": "Every soul will taste death and on the Day of Resurrection, each good will be rewarded with good, namely heaven and bad will be rewarded with bad, namely hell, according to the words of the Prophet Muhammad: The grave is a garden of gardens garden of heaven, or is the abyss of the abyss of hell. (History of at-Tirmidhi and at-thabrani). Who is kept away from hell and put into heaven, he is the happy one. To achieve the happiness above, let us pay attention to the words of the Prophet Muhammad as follows: \"Whoever wants to be kept away from hell and put into heaven, let him die in a state of faith in Allah and the hereafter, and so that he treats people as he pleases.\" people did to him.\" (History of Imam Ahmad). Life in this world is nothing but deceptive pleasure. The pleasures felt in this world in the form of food, drink, rank, position and so on, generally deceive people. He thought it was happiness, so he drowned and became engrossed in the pleasures of the world. Whereas if humans are not good at using it, then pleasure will be a disaster that causes losses in this world and in the hereafter will receive a painful punishment."
		   },
		   {
			"id": 479,
			"surah": 3,
			"ayat": 186,
			"tafsir": "In this verse Allah explains that the Prophet Muhammad and his followers will be tested as they were tested with difficulties in the Battle of Uhud. They will be tested again regarding their wealth and themselves. \"Surely you will be tested regarding your wealth and yourself.\" You will sacrifice your wealth to face your enemies to uphold the rank of your people. You will increase the struggle that results in the loss of family, loved comrades in arms to defend rights. You will be slandered by those who were given the book and those who associated partners with Allah. You will hear from them things that hurt your heart, disturb your peace of mind, such as the slander of adultery that was launched by them against Siti Aisyah. She was left behind from the Prophet's entourage when she returned from a war, somewhere because she was looking for her lost necklace, then Safwan bin Muattal came to pick her up. Hypocrites accuse Aisha of adultery with a safwan. A very embarrassing slander, and shocked the people of Medina at that time, the event was known as hadisul ifki (fake news). So great was the slander that was launched and so many heartbreaking disturbances aimed at you. But if you are patient with it and accept it with piety, then all of that will have no meaning and effect at all, and actually patience and piety are things that must be prioritized."
		   },
		   {
			"id": 480,
			"surah": 3,
			"ayat": 187,
			"tafsir": "Allah has taken a promise from those who have been given the book, namely the Jews and Christians through their respective prophets, that they will explain the contents of the Book to humans by explaining the meaning contained in it, the background it was revealed and nothing to hide. . But what happened? They paid no attention at all to these promises, instead they threw the promise backwards, hiding the information about the Prophet Muhammad that was clearly stated in their book, namely Deuteronomy xviii.18: \"I will raise up a prophet for them from among your brothers them, as you are; I will put My words in his mouth, and he will speak to them all that I command him.\" These characteristics in the Old Testament are only found in the Prophet Muhammad. Bd. John xv. 26 and xvi. 7 (see also as-saff\/61:6). They exchanged the eternal pleasure of Allah for a small price and value, that is, a position that is impermanent and destructive. What a mistake and a bad exchange they made it."
		   },
		   {
			"id": 481,
			"surah": 3,
			"ayat": 188,
			"tafsir": "The characteristics of the Jews and Christians that the believer must avoid, that is, they are always happy for the deviations and betrayals they have committed. They feel proud because they consider themselves community leaders and leaders who are obeyed. They like to be praised that they know in depth all the contents of the Book, and are experts in interpreting it, even though they are not experts. They do this to divert the attention of the people from the truth to what their superiors and ordinary people want even though it is wrong. Don't Muslims think that the People of the Book whose actions are ugly and deceitful will be spared from torment, they will even feel a painful punishment. Believers do not need to feel sad and worried about their deviations, but should still explain what is right and never hide it at all. Allah will fulfill what is the desire of the Muslims and eliminate the wrong things that have been forbidden."
		   },
		   {
			"id": 482,
			"surah": 3,
			"ayat": 189,
			"tafsir": "The kingdoms of heaven and earth are ruled by Allah, given to whomever He wills. Allah is the Almighty over all things, it is not difficult for Him to help and win the Muslims over the People of the Book and the polytheists who hurt them with their actions and words."
		   },
		   {
			"id": 483,
			"surah": 3,
			"ayat": 190,
			"tafsir": "It was narrated from Aisyah ra that the Messenger of Allah said: \"O Aisha, I am worshiping Allah tonight.\" Answered Aisyah ra \"In fact I am happy if the Messenger of Allah is beside me. I am happy to serve his will and will.\" But okay! I do not mind. So the Messenger of Allah woke up from his bed and took ablution water, not far from his place and then prayed. At prayer time he cried until his tears wet his cloth, because he pondered the verses of the Qur'an he was reading. After the prayer he sat praising Allah and returned to weeping bitterly. Then he raised both hands in prayer and wept again and his tears wet the ground. After Bilal came for the dawn call to prayer and saw the Prophet crying he asked, \"O Messenger of Allah! Why did the Messenger of Allah cry, even though Allah has forgiven the sins of the Prophet both past and future?\" The Prophet replied, \"Am I not a servant who deserves and deserves to be grateful to Allah? And how can I not cry? On this night Allah has revealed verses to me. Then he said, \"What a loss and harm to those who read this and do not thinking about and contemplating its meaning.\" Thinking about the change of day and night, following the rising and setting of the sun, the day is longer than the night and vice versa. All of this shows the greatness and power of its creator for people who are intelligent. Thinking about the creation of the heavens and the earth, the change of day and night regularly by producing certain times for human life is a challenge for intellectuals who believe in. They are expected to be able to explain these natural phenomena academically, so that the conclusion can be drawn that God did not create all these phenomena in vain."
		   },
		   {
			"id": 484,
			"surah": 3,
			"ayat": 191,
			"tafsir": "One of the characteristics of an intelligent person which is a special characteristic of humans and this completeness is considered as a creature that has superiority over other creatures, that is, when he pays attention to something, he always gets benefits and benefits, he always depicts the greatness of Allah, remembers and remembers wisdom, virtue and the many blessings of Allah upon him. He always remembers Allah at all times and circumstances, whether he is standing, sitting or lying down. There is not a single time and situation that is allowed to pass by, unless it is filled and used to think about the creation of the heavens and the earth. Thinking about the miracles contained in it, which describe the perfection of nature and the power of Allah. By repeatedly contemplating these things in depth, in accordance with the words of the Prophet, \"Think and meditate on everything about Allah's creatures, and don't ever think about and contemplate about the substance and the nature of its creator, because after all you will not until and will not be able to reach the essence of His Substance. Finally every reasonable person will conclude and say, \"O our Lord, you did not create all of this, namely the heavens and the earth and everything in it in vain, do not have deep wisdom and certain goals that will make us happy in this world and in the hereafter. Glory to You, O Allah, from all the preposterous thoughts directed at You, so protect us from the torment of the fire of hell which has been prepared for those who do not believe. The creation of the heavens and the earth and the alternation of night and day are indeed very complex phenomena, which have been the object of human research continuously since the birth of human civilization. In several surahhs, including surahh al-Araf\/7 verse 54, it is stated that the creation of the heavens and the earth took place within six periods (see also Scientific Study of surahh al-Araf\/7:54). Once the complexity of the creation of the heavens and the earth which took place in six periods has been explained by Dr. Achmad Marconi (see: How the Universe Was Created, Approaches to the Qur'an and Modern Science, Pustaka Jaya, 2003) as follows: The word ayyam is the plural of yum. The word yaum in the colloquial sense is used to denote the brightness of the day, interpreted as 'period. While the plural: ayyam, can mean 'several days' and can even mean 'a long time'. Judging from the use of the word ayyam in the verse above, it shows the relative nature of time by comparing human time with the time that applies to the motion of the universe's energy-matter. By Abdullah Yusuf Ali, (The Holy Qur'an, Text, Translation and Commentary, 1934), the word yaum (single form of ayyam) is equivalent to the English word age or aeon. By Abdus Suud, a 16th century commentator, the word yaum was equated with the meaning of \"event\" or naubat. It is more correct to translate the word yaum as \"stage\" or period or period. Thus the sentence fi sittati ayyam in verse-54 of surahh al-Araf\/7 above, is right to be translated as 'in six periods. Marconi (2003) explains the six periods are: First Period, Since the 'Big Bang' from the Singularity, until the separation of the Gravitational Force from the Single Force (Superforce), space-time begins to separate. However, the Space-Time Continuum that was born still exists in a vague form, where energy-matter and space-time are indistinct. The Second Period, the mass inflation of the Jagad Raya was formed, but the shape of this Jagad Raya was still unclear, and was referred to as Cosmic Soup (Cosmic Soup). The Strong-Nuclear Force broke away from the Electro-Weak Force, and the fundamental matter began to form: quarks, antiquarks, etc. The Universe began to expand. The Third Period, the period of formation of atomic nuclei in this Universe. The Weak-Nuclear Force begins to separate from the Electromagnetic Force. Atomic nuclei such as protons, neutrons and mesons are composed of these quarks. This period is known as the formation of atomic nuclei (Nucleosyntheses). Space, time as well as matter and energy, began to appear separate. The Fourth Period, electrons begin to form, but are still in a free state, not yet bound by atomic nuclei to form stable atoms. The Fifth Age, the formation of stable atoms, the separation of matter and radiation, and the Universe, continues to expand and begins to appear transparent. The Sixth Age, the universe continues to expand, atoms begin to form aggregates into molecules, macro-molecules, then form proto-galaxies, galaxies, stars, solar systems, and planets. Likewise, the alternation of night and day is a very complex phenomenon. This phenomenon involves the 'rotation of the earth (ie the earth rotates on its axis), as it 'goes around the sun with the earth's axis tilted. In the physical phenomenon of the earth rotating (precession) around the sun. So the alternation of night and day occurs because of the rotational movement of the earth which revolves around a star, namely the sun. Because the motion is tilted, the movement of the earth's rotation around the sun also affects the seasons, which vary, depending on the position of the place on the earth relative to the sun. Besides that, the earth's rotation around the sun is stabilized by the moon rotating around the earth, in astronomical terms, the moon provides rotational dynamic stability to the earth's rotation around the sun. Other planets that also revolve around the sun, also provide rotational dynamic stability to the earth's rotation around the sun, Subhanallah! It is proven that the existence of the moon is necessary so that the precession (circulation) of the earth on its axis is stable. The moon provides stability in the time dimension of 10-100 years, while Venus and Mars provide stability in the time dimension of 100-500 years. While the planets Jupiter and Saturn also contribute to providing rotational dynamic stability to our earth, as well as acting as a shield for the earth against the scattering of meteors that will hit the earth (personal communication with Prof. Dr. Ir. Said D. Jenie, expert Mechanics of Celestial Bodies ITB)(see also Scientific Study of surahh al-Anam, verse 96). It is clear, so complex is the phenomenon of Allah's creation. on 'The Creation of Heaven and Earth, and the alternation of this night and day. Only scientists and philosophers who are very accomplished and diligent and humble, who will be able to uncover the secrets of this nature. They are referred to as Ulil Albab in the verse above. The creation of Heaven and Earth was extremely complex, and only 'little did mankind know about it. Alternation of the night was also very complex. In this modern era, science has been able to reveal that the moon, the planets Venus, Mars, Jupiter and Saturn all have an influence in the form of rotational dynamic stability on the earth's rotation in its orbit around the sun. It was they (the ulil albab) who came to the conclusion: \"O our Lord, you did not create this in vain. Glory to you, so protect us from the torment of hell\"."
		   },
		   {
			"id": 485,
			"surah": 3,
			"ayat": 192,
			"tafsir": "Allah, O our Lord, we sincerely and humbly ask that we are truly kept away from the fires of hell, the fire that will burn down those who are arrogant and arrogant in this world, who do not want to accept what is right and the truth that comes from You, the Creator of all the worlds. We know that the people you put in hell are people you have truly humiliated because of the injustice and disbelief they have committed in this world. They constantly feel the torments of hell, because there is no helper for those who are unjust and disbelieving, who can get them out of the torment they are experiencing."
		   },
		   {
			"id": 486,
			"surah": 3,
			"ayat": 193,
			"tafsir": "After saying a prayer based on contemplation and contemplation about nature and all its wonders as mentioned above, it is followed again by a prayer that illustrates attention to the call that one hears. O Allah, we have heard the call of Your Messenger, who called us to believe in You and justify Your word, so immediately we believe, do all Your commandments, stay away from all Your prohibitions, in accordance with the advice brought by Your Messenger . Therefore, forgive the sins that we have committed and erase from us the small sins that we have committed, and die in husnul-khatimah, together with good people who do a lot of good deeds."
		   },
		   {
			"id": 487,
			"surah": 3,
			"ayat": 194,
			"tafsir": "our God! We have carried out all your commands. We always remember You every time and every situation. We have fulfilled the call of Your Apostle. Therefore, O our Lord, give us what You have promised through the apostles. You have promised dominion in this world with Your words: Allah has promised those among you who believe and do good, that He will truly, will make them rule in the earth, ¦.(an-Nur\/24:55) . You have promised victory and help for those who obey and uphold Your religion, with Your words: ¦. If you help Allah's (religion), surely He will help you ¦.. (Muhammad\/47:7). Then in another verse Allah says: Allah promises the believing men and women, (will get) paradise beneath which rivers flow,¦ (at-Taubah\/9:72). The things mentioned above are the happiness of the world and the hereafter that we really hope for and never humiliate us on the Day of Judgment according to Your word: ¦ On the day when Allah does not disappoint the Prophet and those who believe with him¦ (at -Tahrim\/66:8). All of this we ask with all humility, to strengthen our practice of all Your commands, because then we will gain happiness in this world and the hereafter, and never doubt Your promises, because we believe with full confidence that You will not break the promise one bit."
		   },
		   {
			"id": 488,
			"surah": 3,
			"ayat": 195,
			"tafsir": "Ummi Salamah once said, \"O Messenger of Allah! I did not hear Allah mentioning women in the slightest with regard to migration.\" Then come down this verse. For their persistence in doing good deeds, full of sincerity coupled with earnest prayer, Allah allowed their request. It was explained that Allah will not waste the deeds of someone who is obedient and will not discriminate between men and women in giving rewards and rewards, because these two types descend from each other, women come from men and vice versa. . Therefore, whoever emigrates, both male and female, is expelled from his hometown, tortured because he is diligent in the way of Allah, fights the enemies of Allah who ends up being martyred, killed on the battlefield, surely Allah will erase all his mistakes, forgive his sins and will surely enter into heaven, is a reward and reward from Him, as a manifestation of prayer from a request that is allowed by Him. How happy they are, to receive rewards and rewards from Allah, because indeed the best rewards and rewards are those that come from Allah."
		   },
		   {
			"id": 489,
			"surah": 3,
			"ayat": 196,
			"tafsir": "Even though this verse is addressed to the Prophet Muhammad, it is also intended for his people, as we can see many verses which according to the sound are addressed to the Prophet, but in essence are also addressed to all his followers. The Prophet Muhammad during his life was never deceived by anyone's persuasion and deceit, as narrated by Qatadah, he said, \"By Allah they never succeeded in deceiving the Prophet until he died.\" From this verse it can be understood that Muslims should not be deceived by the luxurious life of disbelievers whose only goal in life is to seek worldly wealth. Muslims should be steadfast and patient in dealing with things like this and keep fighting for happiness in this world and in the hereafter, as Allah says: be good (to others) as Allah has done good to you, and do not do mischief on earth. Indeed, Allah does not like people who do damage. (al-Qasas\/28:77)."
		   },
		   {
			"id": 490,
			"surah": 3,
			"ayat": 197,
			"tafsir": "Believers need not worry, nor should they be discouraged by the luxuries that disbelievers, enemies of God receive, because that is a pleasure that does not mean much compared to the rewards and pleasures that are provided for believers in the hereafter. The Prophet Muhammad said: \"The comparison between living in this world and living in the hereafter is just like a person's finger being put into the sea.\" (Muslim history). The water that sticks to the finger is the world, and the sea water is the hereafter. Life in the world is only temporary, because they have fun only during life, then after death, they will be placed in the worst possible place."
		   },
		   {
			"id": 491,
			"surah": 3,
			"ayat": 198,
			"tafsir": "In contrast to the disbelievers who will be placed in hell, then in the hereafter those who are pious, namely those who practice Allah's commandments, leave all His prohibitions, will be placed in heaven, eternally forever. How happy they are, because what is with Allah is the best for those who are devoted. Far better than the pleasures and luxuries that disbelievers experience in this world, because they are limited, namely while living in the world. The Messenger of Allah gave a real example as conveyed by Umar bin al-Khattab ra said: \"I visited the Messenger of Allah, at that time he was in a room, sleeping on a mat that was not grounded. Under his head was a pillow made of goat skin filled with coir. On his two feet tanning leaves were collected. On the base of his head, goat skin was hanging. I saw the marks of mats on his two sides, so I cried. He said, \"What makes you cry?\" I replied, \"O Messenger of Allah, Kisra and the Emperor are always with you in pleasure, luxury and self-sufficiency and You are the Messenger of Allah and in this state?\" The Messenger of Allah replied, \"Are you not pleased that this world is for them and the hereafter for us\" (History of al-Bukhari and Muslim)."
		   },
		   {
			"id": 492,
			"surah": 3,
			"ayat": 199,
			"tafsir": "Jabir bin Abdullah, Anas, Ibn Abbas, Qatadah and al-hasan said that this verse was revealed about an-Najasyi, the king of the Habasyi nation who had converted to Islam when he died. The angel Gabriel told the Prophet, so the Prophet said to his friend, \"Let us (pray the occult) for that an-Najasyi.\" Some of the friends asked in astonishment, \"Why were we told to pray for the disbelievers in Abyssi land?\" Then come down this verse. Not all of the People of the Book deviate from the teachings of Allah, betray, deny the truth brought by the Prophet Muhammad, but some of them, such as an-Najasyi, Abdullah bin Salam and others, have a glorious history in their lives. They truly believe in Allah, believe in the Al-Qur'an which was revealed to Rasulullah SAW, as well as the heavenly books which were revealed to the prophets, they are obedient and humble to Allah, they do not exchange Allah's verses for a price. a little, meaning not to hide what they know about the coming of the Prophet Muhammad as a Messenger. They are good and upright People of the Book, whether they are Jews or Christians. They will be rewarded with God as promised in His words: They will be rewarded twice (for their faith in the Torah and the Qur'an) because of their patience, ¦. (al-Qasas\/28:54) Indeed, Allah is very quick in His calculations because He knows everything clearly, both the reward He will give and the person who is entitled to receive it."
		   },
		   {
			"id": 493,
			"surah": 3,
			"ayat": 200,
			"tafsir": "After discussing various kinds of wisdom and laws since the beginning of this surahh, in order to maintain and strengthen the implementation of these things, this surahh (Ali 'Imran) closes with a recommendation that believers, be patient and steadfast in carrying out all kinds of commands of Allah, overcome all distractions and trials, avoiding all His prohibitions, especially being patient and steadfast in the face of religious opponents and enemies. Don't let the enemies of religion be more patient and steadfast than us so that victory is on their side. Let the believer always be prepared with all kinds of ways and means, to strive for jihad, to face eventualities that will reduce the authority and purity and majesty of the religion of Islam. And as the essence of it, believers are advised to truly fear Allah by being truly pious wherever they are, because with the provision of piety everything can be carried out properly, blessed, and approved by Allah SWT. Thus, whoever among the believers carries out the 4 types of advice, he will definitely get victory and happiness, in this world and in the hereafter."
		   }
	]
}
