{
	"tafseer": [
		{
			"id": 1236,
			"surah": 9,
			"ayat": 1,
			"tafsir": "Many of the main issues explained in surahh al-Anfal are also explained in this surah with broader and deeper disclosures, sometimes in more detail, so that this surah in several ways adds to the perfection of surahh al-Anfal. Allah sent the Prophet Muhammad to this world as the last messenger to develop Islam with da'wah based on arguments that can ensure its truth, there is no coercion based on the power of weapons and property. However, the polytheists continued to oppose him in all kinds of ways, from words to actions that were beyond the boundaries of humanity, so that many Muslims were forced to emigrate to the land of Habsyah (Ethiopia) and other places. Because the Prophet Muhammad and some of his companions still remained in Mecca, to continue preaching, the polytheists of Quraysh held a deliberation at a place called \"Darun Nadwah\" to make a decision whether Muhammad should be killed or banished. Finally they decided that Muhammad should be killed. In this critical situation, Allah ordered the Prophet Muhammad to migrate to Medina, which was then followed by his companions who were able to come to Medina. In Medina, the Prophet and his companions who joined in the emigration were greeted by the Muslim population with an extraordinary welcome, as explained by Allah in His word: And they prioritize (Muhajirin), over themselves, even though they also need them. (al-hasyr\/59: 9) Furthermore, the Prophet entered into a treaty of peace and mutual assistance with the Jews, but they betrayed and broke their promise by helping the polytheists who were always hostile to the Prophet in Mecca. So that the hostility of the polytheists increases, they even intend to destroy the Islamic religion, so war is prescribed in Islam. Then the Prophet entered into a peace treaty with the polytheists in Hudaibiyah for a period of ten years with very lenient terms, which seemed to benefit the polytheists, but the polytheists violated the agreement, so there was no other choice for the Prophet Muhammad and the Muslims, besides Face the challenge with full faith and courage. Finally in the 8th year of Hijri, the city of Mecca was conquered by the Muslims. Thus the strength of the polytheists became weak, but they still held resistance in every way they could, so that this surah came down which stated the cancellation of the peace agreement and the termination of relations with the polytheists. This verse states the cancellation of various peace agreements with the polytheists in a way that is more firm and positive than what Allah has explained in His word: And if you (Muhammad) are worried about (occurring) betrayal from a group, then return the agreement to them with honest way. Indeed, Allah does not like people who betray. (al-Anfal\/8: 58) Many opinions of exegetes about the agreement were canceled in this verse. According to Ibnu Jarir and Ibn Kathir, the best and strongest opinion is an agreement that is set at a certain time, while an agreement that is still in effect must be waited for until it expires, in accordance with the fourth verse of the surahh which will be explained later."
		   },
		   {
			"id": 1237,
			"surah": 9,
			"ayat": 2,
			"tafsir": "In this verse Allah explains that the Muslims will give the polytheists who always betray their promises to walk on earth for four months freely and safely without being disturbed by anyone, so that they can think more calmly about determining their attitude, whether to enter Islam or remain against the Muslims. As for the validity of the four months, according to popular opinion, it is from the 10th of Zulhijjah in the 9th year of Hijri to the 10th of Rabiul Akhir in the 10th year of Hijri. In accordance with what was narrated by Abu Masyar al-Madani from Muhammad bin Ka'ab al-Qurazi and others which means: Rasulullah saw sent Abu Bakr as Amir Hajj in the 9th year of Hijri and also sent Ali bin Abi Talib with 30 or 40 verses of Baraah to be recited to people at Mina. Another opinion says, in order not to get confused, it is necessary to distinguish between the four months referred to here and the four months which are prohibited from fighting in general as mentioned in an authentic hadith which reads: Verily, the era rotates according to its condition (shape) on the day the sky was created. and earth. There are twelve months in a year, four months from which it is forbidden to fight, three consecutive months are Zulkaidah, Zulhijjah, Muharam and Rajab the sandwiched months, which are located between Jumadil (End) and Shaban. (Al-Bukhari and Muslim history from Abu Bakhirah) The fourth month in this hadith is what is referred to in the surahhs al-Baqarah\/2: 217, al-Maidah\/5: 2, and others which prohibit war in general . Furthermore, in this verse Allah explains that if the polytheists are still opposed and hostile to Allah and His Messenger, then they must understand that they will not be able to weaken Allah, but they themselves will bear all the consequences. Such a thing has become a sunnatullah that applies to disbelievers as explained in the word of Allah: Those who before them had denied (the apostles), then punishment came to them from a direction they did not expect. So Allah inflicted on them humiliation in the life of the world. And indeed, the doom of the hereafter will be greater, if (only) they know. (Az-Zumar\/39: 25-26)"
		   },
		   {
			"id": 1238,
			"surah": 9,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains a statement on the day of the Great Hajj, which states that Allah and His Messenger cut ties and agreements with polytheists and cleansed their religion from all superstitions and errors. Many authentic hadiths have been narrated relating to this issue, including that Abu Hurairah said: I (Abu Hurairah) was sent by Abu Bakr on the pilgrimage day together with those assigned to announce in Mina that polytheists are not allowed to go on pilgrimage. after this year and it is not permissible to circumambulate in the Baitullah naked. Then the Messenger of Allah followed by sending Ali bin Abi Talib and ordering him to announce (read the verse) Baraah and polytheists are not allowed to perform Hajj again after that year and it is not permissible to circumambulate in the Baitullah naked (as is the custom of the polytheists). (Al-Bukhari and Muslim history from Abu Hurairah) Abu Hurairah said again: I was together with Ali bin Abi Talib when the Messenger of Allah sent him to the people of Mecca with (reading) the verse of Baraah then he asked, \"What do you call (announce ).\" Ali replied, \"We call, that no one will enter heaven except believers, it is not permissible to circumambulate in the Baitullah naked, whoever has an appointment with the Messenger of Allah, the period or period is up to four months and when it is completed four months, then Allah and His Messenger freed himself from the polytheists, and it is not permissible for the polytheists to go on pilgrimage to this House of Allah after this year of ours (the 9th year of the Hijri).\" (Ahmad's history from Abu Hurairah) The scholars have expressed many opinions about what is meant by the grand pilgrimage, including the following: a. According to Abdullah bin Harith, Ibn Sirin and Asy-Shafii, what is meant by the grand pilgrimage is the day of Arafah, based on the hadith narrated by Ahmad, Abu Daud, at-Tirmidhi, an-Nasa'i and Ibn Majah. b. According to Ibn Qayyim and others, what is meant by the grand pilgrimage is the day of Nahar or the day of slaughtering the sacrifice (10 Zulhijjah) based on the hadith narrated by al-Bukhari and Muslim. c. Al-Qadzi (Iyadz) said, \"If we examine these opinions, the opinion that is chosen is that the grand pilgrimage is the days of carrying out the Hajj rituals as said by Mujahid. But if we discuss the feast of the Great Hajj, then there is no doubt again is staying at Arafah because hajj is Arafah. Whoever can stay at Arafah, then he really performs the pilgrimage, and whoever does not stay at Arafah, then he does not get hajj. So what is meant by the grand pilgrimage in the surah this and the Prophet said in his sermon, is the day of Nahar.\" As for the reason it is called Hajj Akbar which means big Hajj, some scholars say it is to distinguish it from Umrah which is called a small Hajj. There are also those who say, because the deeds done during the pilgrimage are greater in reward when compared to the deeds done at other times. There are also those who say, because it was at that time that there was greater glory for the Muslims and humiliation for the polytheists and there were many other different opinions. According to this verse, the continuation of the notification is that if the polytheists repent, regret their misguidance from acts of polytheism, breaking promises, and so on, and return to the right path, namely believing in Allah and His Messenger and eliminating enmity with Muslims, then that is the best for them for the happiness of the world and the hereafter. However, if they turn their backs, do not want to accept the truth and guidance and remain disobedient, then they will not be able to weaken Allah's power and will not be able to eliminate the help that Allah promised to the Messenger of Allah and to the believers, namely their victory in defeating people. - polytheists and hypocrites. Not only did they suffer defeat and humiliation in this world, even the Messenger of Allah was ordered by Allah to convey the news that they would receive a very painful punishment in the hereafter."
		   },
		   {
			"id": 1239,
			"surah": 9,
			"ayat": 4,
			"tafsir": "In this verse Allah explains that the time given by the Muslims to the polytheists to determine their attitude, may not be more than four months, except for those who enter into an agreement with the Muslims, and for those who do not reduce the contents of the agreement and do not help people who are hostile to Muslims, then the agreement must be maintained and perfected in accordance with its contents until the time limit. Ibn Abi Hatim narrates that the Prophet fulfilled his promise with the Bani Amrah and Bani Kinanah tribes. These verses and other verses show that every agreement that is still valid must be fulfilled and perfected in accordance with the terms of the agreement, even if the agreement is with the polytheists, as long as they still fulfill all the conditions of the agreement. The end of this verse explains that Allah loves those who are pious. This shows that maintaining and perfecting promises includes piety. Because maintaining the agreement means maintaining accountability for justice between humans which brings happiness to life in this world and the hereafter."
		   },
		   {
			"id": 1240,
			"surah": 9,
			"ayat": 5,
			"tafsir": "When the months which are forbidden to fight against the polytheists of Mecca have been completed, namely for four months starting from the 10th of Zulhijjah to the 10th of Rabiul Akhir in the year 9 Hijriah, then the Muslims are ordered to do one of the four things that are more beneficial for them, namely : 1. Fighting polytheists wherever they are, both in the holy land and outside it. 2. Captivate them. 3. Surrounding and imprisoning them. 4. Spy on their movements wherever they are. As for killing or fighting them anywhere, according to Ibn Kathir, the popular opinion is that this verse is general and is defined by the word of Allah: And do not fight them in the Grand Mosque unless they fight you there. If they fight you, then fight them. (al-Baqarah\/2: 191) As for capturing them, it has been permitted in this verse, whereas in the previous surahh it was not permitted as Allah says: It is not proper for a prophet to have captives before he can paralyze his enemies on earth. (al-Anfal\/8: 67) This verse is in accordance with authentic hadith, including the words of the Prophet saw: I was ordered to fight people so that they acknowledge that there is no God but Allah and that Muhammad is the messenger of Allah, and they establish prayers and pay zakat. (History of al-Bukhari and Muslim from 'Abdullah bin Umar). This verse is one of the four verses called \"ayatul qital\" meaning \"war verses\", because these four verses were revealed to kill or fight using force of arms. First: this verse is to kill or fight the polytheists. Second: to fight the People of the Book mentioned in the word of Allah: Fight those who do not believe in Allah and the Last Day, those who have not forbidden what Allah and His Messenger have forbidden and those who do not have the true religion (religion of Allah) ), (ie people) who have been given the Book, until they pay the jizya (tax) obediently while they are in a state of submission. (at-Taubah\/9: 29) Third: is fighting the hypocrites mentioned in the word of Allah: O Prophet, fight against the disbelievers and the hypocrites. (At-Tahrim\/66: 9) Fourth: is to fight the ignorant (who create riots) mentioned in the word of Allah: And when there are two groups of believers fighting, make peace between the two. If one of the two acts unjustly against the other (group), then fight the (group) that is unjust so that that group returns to Allah's commands. (al-hujurat\/49: 9) Among the commentators there are those who argue that this verse is sanctioned by the word of Allah: After that you may release them or accept ransom until the war is over. (Muhammad\/47: 4) Among the scholars there are those who think otherwise, that is this verse which confirms verse 4 of surahh Muhammad, because this verse was revealed later. And there are also those who argue that this verse does not conflict with verse 4 of surahh Muhammad and other verses, because all scholars are of the opinion that the obligation to eradicate disbelief and misguidance, all of which do not have to be war, but should be adjusted to other factors, such as ability and circumstances. . If the polytheists repent and return to the right path by believing in Allah and His Messenger, saying the creeds of faith, praying and paying zakat, then they must be given wide freedom, not fought, not taken prisoner, not locked up, and no longer stalked his movements. As an outward testimony of faith, one must pronounce the shahada two sentences after declaring one's conversion to Islam. And what is meant by prayer here is the five daily fardzu prayers which are the pillars of Islam and show the obedience of faith that is demanded of every believer without any difference in any way, this prayer cleanses the soul and improves morals: Indeed, prayer prevents from (deeds) abominable and evil. (al-'Ankabut\/29: 45) And because prayer has the power to establish a human relationship with God. And perform the prayer to remember Me. (thaha\/20: 14) Regarding zakat here, it is obligatory (obligatory) zakat in Islam for people who have fulfilled the conditions, because this zakat besides cleansing the soul of the person who gives zakat from dishonorable qualities such as love of wealth and miserly or stingy, also very necessary for the poor and for the public interest. Strictly speaking, polytheists may not be fought if they convert to Islam by fulfilling three conditions, namely: 1. Believing in Allah and His Messenger by reciting two shahada sentences. 2. Carry out the five daily fardu prayers. 3. Fulfill the obligatory zakat when it meets the conditions. Word of Rasulullah saw: I was ordered to fight people until they confess that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayers and pay zakat, then if they have done so, surely their blood and property will be preserved from me, except by right Islam and their reckoning is up to Allah. (Al-Bukhari and Muslim from 'Abdullah bin 'Umar) Based on the description above, some scholars are of the opinion that people who do not perform the five daily prayers that are fardzu If you want to pay zakat when the conditions are sufficient, then the law must be killed. Whereas the opinion of other scholars says that it is not obligatory to be killed, only that the priest (ruler) is judged by giving prison sentences and so on according to his considerations, and those who do not want to pay zakat, the priest has the right to take zakat by force."
		   },
		   {
			"id": 1241,
			"surah": 9,
			"ayat": 6,
			"tafsir": "If someone from the polytheists asks for protection from the Prophet Muhammad, to listen to Allah's words so that he can know the essence of Islamic preaching conveyed by the Prophet, then the Prophet must protect him for a certain period of time. If he wants to believe, it means that he will be safe forever, and if not, then the Prophet was only ordered to save him to the place he wanted for his own safety, then the situation returned to how it was before, that is, like a state of war. In this case the scholars of different tafsirs of opinion, among others, that the protection (security) provided is only for polytheists who have expired their peace treaty with the Muslims so far, and they have never violated it. And if the agreement is still valid, the Muslims are ordered to complete it as explained in verse four. Even those polytheists who have expired the four month period given to them to determine their attitude, because the time is sufficient and there is no need to add more, this protection law applies if they ask for it. However, some scholars are of the opinion that those who wish to believe are still given the opportunity for a duration of four months. However, according to the strongest opinion, this matter was left to the priest. In this matter, Ibn Kathir argues that infidels who come from harb (infidel) lands to Islamic areas to carry out a task such as trading, ask for peace, ask to stop fighting, bring jizya (tribute) and ask them for security, are given protection while he is in the Islamic area until he returned to his country."
		   },
		   {
			"id": 1242,
			"surah": 9,
			"ayat": 7,
			"tafsir": "Allah and His Messenger cannot continue and maintain agreements with polytheists except with those who heed the agreement near the Grand Mosque. Therefore, as a general standard that must be implemented by the Muslims towards the polytheists it is explained, that if they comply with the terms of the agreement, then the Muslims also do the same towards them, Allah loves those who are pious, while those who not heeding the terms of the agreement are people who are traitors and do not fear Allah swt. What is meant by the Masjidilharam agreement here is the Hudaibiyah agreement which took place when the Prophet Muhammad and a large number of his companions in the 6th year of Hijri departed from Medina to Mecca to perform the Umrah pilgrimage after they arrived at a place called Hudaibiyah, 13 miles to the east. west of the city of Mecca, they were intercepted and hindered by the Quraysh infidels so that a peace agreement was made called that place. According to the history of Ibn Abi Hatim, among the polytheistic Arab tribes that heeded the Hudaibiyah agreement were the Bani Amrah tribe and the Kinanah tribe, so according to some commentators, the Prophet and the Muslims perfected the Hudaibiyah agreement with these two tribes, even though the four month period granted had expired. to the polytheists."
		   },
		   {
			"id": 1243,
			"surah": 9,
			"ayat": 8,
			"tafsir": "One of the reasons for the cancellation of the agreement is that if the polytheists win against the Muslims, then they no longer care about kinship and peace treaty ties. They are good at attracting the sympathy of the Muslims with sweet words, even though their hearts don't match what they say. They do this because most of them are wicked people who do not know the true faith and good morals, so they act according to and follow their desires. So the polytheists who already hate the Prophet Muhammad and the Muslims, of course there is no point in making an agreement with them, no matter what style and form it is. They generally have justified any means to achieve the goal. The end of this verse explains that most of them are wicked people."
		   },
		   {
			"id": 1244,
			"surah": 9,
			"ayat": 9,
			"tafsir": "The polytheists exchange the verses of Allah which contain the teachings of monotheism, faith and others with something of very low quality and value, so that they can continue to enjoy the worldly benefits they desire and to maintain the tradition, position, power and influence that bring worldly good fortune which they enjoy. In essence, luck is very little compared to luck if they believe in Allah's verses that bring eternal happiness in the hereafter. But the polytheists did not care about all that. So at the end of this verse Allah explains that the deed is very bad. Especially if all these actions are intended to hinder the spread of Islam."
		   },
		   {
			"id": 1245,
			"surah": 9,
			"ayat": 10,
			"tafsir": "Because of their disbelief, kinship ties and treaty bonds disappeared from their souls, so they did not hesitate to beat the believers in every way they could. They try to take every opportunity to destroy the Muslims as a group or individually, openly or secretly at every opportunity. So the end of this verse states that these various actions have really crossed the line."
		   },
		   {
			"id": 1246,
			"surah": 9,
			"ayat": 11,
			"tafsir": "The polytheists who should be killed or fought, if they repent, namely believe in Allah and His Messenger, perform the five daily prayers and fulfill the obligation of zakat, then Allah declares that they are brothers and sisters in the same religion as the believers who have the same rights and obligations. the same without any difference. Such a brotherly bond is a very strong and broad bond that can eliminate all kinds of disputes and hostility caused by differences in ethnicity, nation and so on. In this case the Prophet Muhammad said: I was ordered to fight people until I confess that there is no God but Allah and that Muhammad is the Messenger of Allah, so if they confess that there is no god but Allah and indeed Muhammad is the Messenger of Allah, they face our Qibla, eat our slaughter and pray like us, then it is forbidden for us their blood and their wealth, except according to their rights. They have rights and obligations like Muslims. (Muslim history from Anas bin Malik) These verses are addressed to people who want to understand, especially regarding the polytheists who repent or who do not and how they should be treated."
		   },
		   {
			"id": 1247,
			"surah": 9,
			"ayat": 12,
			"tafsir": "The polytheists, if they violate the agreement they have made with the believers and they insult the religion of Islam, then Allah orders the Muslims to fight their leaders, because they do not keep their promise to stop enmity with the Muslims and do not want to repent. The commentators explained that what was meant by insulting the religion of Islam was to insult the Prophet, the Qur'an, and so on, while what was meant here was killing or fighting infidel leaders, including their followers. Fighting the polytheists is permissible if they violate the peace agreement and attack Islam and the Muslims."
		   },
		   {
			"id": 1248,
			"surah": 9,
			"ayat": 13,
			"tafsir": "This verse encourages the spirit of the believers to carry out in earnest the order to fight the polytheists. Allah mentions three main reasons that prove that polytheists cannot be silenced and left alone, namely: 1. They violated the Hudaibiyah agreement that they had agreed with the Prophet Muhammad and his companions not to fight for 10 years and not to interfere with each other. both sides and their allies. But not long ago, the polytheists of Quraysh had helped their allies from the Bani Bakr to attack the Khuzaah tribe who were allies of the Prophet who lived in Mecca. Therefore the Prophet felt obliged to defend the Muslims. Finally, on the 20th of Ramadan, the 8th year of Hijri, Mecca was liberated by the Muslims. 2. Before the Prophet Muhammad migrated to Medina, the polytheists had tried hard to expel the Prophet Muhammad from Mecca, imprison or kill him by using the force of the Quraysh tribe so that the Prophet Muhammad's family would find it difficult to defend themselves. This is what is implied by the word of Allah: And (remember), when the disbelievers (Quraish) thought of deception against you (Muhammad) to arrest and imprison you or kill you, or expel you. They devised and Allah thwarted the deception. Allah is the best avenger of deceit. (al-Anfal\/8: 30) 3. Those who started first fighting the believers in Badr, Uhud, Khandaq, and others. After explaining these three main reasons, the enthusiasm and attention of the believers is aroused so that they are not afraid to face the polytheists, because Allah has more right to be feared if they truly believe. People who truly believe in Allah and His Messenger must have the courage to sacrifice for the sake of religion and truth without being overshadowed by a doubt that creates fear and discourages them that is very detrimental to themselves."
		   },
		   {
			"id": 1249,
			"surah": 9,
			"ayat": 14,
			"tafsir": "This verse instructs the Muslims to fight the polytheists because they have broken their promise and are fighting the Prophet and the Muslims. If they carry out the order, surely Allah will torture the polytheists with the power of the believers. Allah made them despicable and Allah helps the believers to relieve the sadness of those who suffer from the betrayal of the polytheists. What is meant by Allah tormenting polytheists with the power of the Muslims is killing and destroying them in war. What makes them despicable is because of their defeat and they are made prisoners and slaves. According to the history of Ikrimah and other scholars, the believers who lost their sorrow were the Khuzaah tribe, whereas according to Ibn 'Abbas the Yaman and Saba tribes' who had converted to Islam had received severe torment from the polytheists of Mecca. They sent envoys to complain about their plight to the Prophet in Medina, so the Prophet sent greetings and good news, to cheer them up, because Allah's help would come in the near future."
		   },
		   {
			"id": 1250,
			"surah": 9,
			"ayat": 15,
			"tafsir": "The defeat of the polytheists will relieve the hearts and relieve the sorrow of the believers who have suffered a lot of torment and persecution from the polytheists so far, because they were unable to defend themselves in Mecca and were unable to move to Medina or to another safe place. Furthermore, at the end of this verse it is explained that Allah accepts the repentance of those whom He wills and Allah is All-Knowing and All-Wise. This verse indicates that many polytheists have repented and Allah has accepted their repentance. They became believers in Allah and His Messenger and tough defenders of Islam. Allah is the One who governs His servants and regulates the interests of the development of His religion in the future."
		   },
		   {
			"id": 1251,
			"surah": 9,
			"ayat": 16,
			"tafsir": "This verse gives a very important warning to the Muslims to fight against the polytheists. God also invites them to self-reflect and think consciously about the following: a. Have they really been carrying out jihad as they should? b. Are the polytheists not going to fight them anymore and not breaking the agreement as they used to do? c. Are polytheists not going to insult Islam anymore and prevent people from following it, as they have done since the birth of Islam? d. Have the Muslims forgotten the behavior of the hypocrites who stabbed the Prophet and the Muslims in the back? e. Are Muslims left alone without trials and tests so that it is known who truly believes and strives in the way of Allah and does not take polytheists as trusted friends and who does otherwise? Muslims must be steadfast in facing all kinds of trials and tests, must not be easily satisfied with the results that have been achieved and must not be lazy and bored to continue jihad. They must also know the duty of guarding themselves and being on guard against all the wiles of their enemies, and must not make them intimate friends. This has been warned a lot in the Qur'an, including the words of Allah: O you who believe! Do not make friends of people who are outside your circle (of the same religion) as your trusted friends, (because) they don't stop giving you trouble. They expect your destruction. Indeed, hatred has appeared from their mouths, and what is hidden in their hearts is more evil. (Ali 'Imran \/3: 118) Allah is All-Knowing of what the Muslims did in carrying out the orders for jihad and what was stored in their hearts, therefore it was ordered that they obey Allah's instructions and orders as well as possible."
		   },
		   {
			"id": 1252,
			"surah": 9,
			"ayat": 17,
			"tafsir": "This verse explains that it is inappropriate for polytheists to prosper the Grand Mosque and other mosques. Prospering Allah's mosque is only by making the place to acknowledge and glorify Allah and obey Him. This is done only by believers. Prospering the mosque, is to build it, take care of it, revive it with good deeds that are pleasing to Allah. Prospering what is forbidden for non-Muslims, is mastery of the mosque, such as being its caretaker. As for using the labor of non-Muslims to build mosques, such as hiring masons and so on, it is not prohibited. Likewise, Muslims may accept a mosque built by a non-Muslim or a bequeathed by a non-Muslim, or repair it as long as it does not have a purpose that harms the Muslims. Even if the commentators differ about the mosque referred to in this verse, is it only the Grand Mosque, in accordance with the revelation of this verse, as stated at the beginning of the tafsir of this verse, and also in accordance with the readings of some qira'at scholars who read it with the mosque meaning mufrad pronunciation (singular ) namely the Grand Mosque, or what is meant by all the mosques of Allah, according to the plural pronunciation of the masajid. But all opinions, both the Grand Mosque and other mosques, are inappropriate and it is not permissible for polytheists to prosper them. Furthermore, in this verse, Allah explains that the deeds and works of the disbelievers that they are proud of, namely prospering the Grand Mosque, giving the pilgrims water to drink, and so on, will be in vain as long as they are in polytheism. Allah's Word: If they had associated partners with Allah, their deeds would have vanished. (al-Anam\/6: 88) The end of this verse explains that the polytheists are eternal in hell, because none of their deeds in this world are useful and can help them in the hereafter."
		   },
		   {
			"id": 1253,
			"surah": 9,
			"ayat": 18,
			"tafsir": "This verse explains that only people who truly believe in Allah and surrender to Him and believe in the coming of the Hereafter, a place of recompense for all their deeds, perform prayers, pay zakat and fear no one. even other than Allah. It is these people who are expected to be included in the group who receive instructions for the prosperity of His mosques. There are many hadiths that explain the virtues of making mosques prosperous, including the words of the Prophet Muhammad: Whoever builds a mosque for Allah to hope for His pleasure, Allah will surely build him a house in heaven. (Narrated by al-Bukhari, Muslim and at-Tirmidhi from 'Uthman bin Affan) Word of the Prophet PBUH: If you see someone getting used to (worshiping) in the mosque, then testify that he is a believer. (History of Ahmad, at-Tirmidhi, Ibn Majah and al-hakim from Abi Said al-Khudri) And his other words: In fact there was a woman who used to sweep the mosque and then died, the Messenger of Allah asked her, and when she was told that she had died, the Messenger of Allah said, \"Why don't you tell me, so I pray for him. Show me where his grave is.\" So Rasulullah SAW came to the grave, then he prayed over it. (Al-Bukhari, Muslim, Abu Dawud and Ibn Majah) In another hadith: Whoever turns on the lights in the mosque, the angels and the bearers of the throne will always ask forgiveness from Allah so that their sins will be forgiven as long as the lights are shining in the mosque. (History of Salim ar-Razi from Anas ra)"
		   },
		   {
			"id": 1254,
			"surah": 9,
			"ayat": 19,
			"tafsir": "The question contained in this verse is addressed to believers who are disputing about the more important good deeds as mentioned above. In response, it was explained that taking care of the Grand Mosque and providing refreshments for those who perform Hajj cannot be equated with believing in Allah and the Last Day and jihad in the way of Allah. The deeds mentioned in the first part, although they are good deeds, are not comparable to the degrees of the later deeds, namely faith and jihad in the way of Allah as mentioned in this verse. Assuming the two kinds of charity are the same is an assumption that is out of place, and contrary to Allah's guidance, especially if it is considered that the first charity is more important than the second charity."
		   },
		   {
			"id": 1255,
			"surah": 9,
			"ayat": 20,
			"tafsir": "This verse explains that those who believe with strong faith that encourages them to move willingly to leave their hometown, wealth and business activities, part with their children, wives, parents and relatives, they are people who carry out heavy deeds and requires a lot of sacrifice. Especially if these deeds are followed by jihad in the way of Allah, namely by sacrificing one's wealth and body and soul. For those who do so Allah will give high honors and good luck and happiness. As for the believers who did not migrate and did not strive in the way of Allah, even though they provided drinking water for the pilgrims and prospered the Grand Mosque, Allah's reward for them and the rewards given to them were not as great as those received by those who migrated and fought for jihad. . Regarding someone's charity that is not based on faith in Allah, that charity will be in vain. Because disbelievers will not be rewarded in the hereafter."
		   },
		   {
			"id": 1256,
			"surah": 9,
			"ayat": 21,
			"tafsir": "This verse explains that Allah gives good news to the believers who emigrate and strive in the way of Allah, they will receive a reward of broad mercy, perfect pleasure and paradise where they live forever. The greatest reward is to obtain the pleasure of Allah as He says: Allah promises the believing men and women, (will get) paradise beneath which rivers flow, they will abide therein, and (get) a good place in paradise 'Adn. And Allah's pleasure is greater. That's a great victory. (at-Taubah\/9: 72) This is also mentioned in the hadith of the Prophet Muhammad: Allah said to the people of heaven, \"O people of heaven.\" They replied, \"We obey You, O our Lord.\" Allah said, \"Are you all content.\" They replied, \"How can we not be pleased when You have given us something that You have never bestowed on anyone.\" God said again, \"I will give you something that is more important than what I have given.\" They asked, \"Our Lord, what is the more important gift?\" Allah said, \"I have pleased you all and will not be angry with you after that forever.\" (History of al-Bukhari, Muslim, at-Tirmidhi and an-Nasa'i from Abi Said al-Khudri)"
		   },
		   {
			"id": 1257,
			"surah": 9,
			"ayat": 22,
			"tafsir": "In this verse Allah explains that the person who gets this gift will remain in heaven forever. Indeed, with Allah, there is a very great reward available for those who believe and do good deeds, especially for those who believe, emigrate, and strive with their wealth and soul."
		   },
		   {
			"id": 1258,
			"surah": 9,
			"ayat": 23,
			"tafsir": "This verse was revealed regarding the attitude of some Muslims when ordered to migrate to Medina, they replied, \"If we migrate, our relationship with our parents, our children and our families will be cut off, our trade will be destroyed and in the end we will become useless people.\" -drain.\" This verse prohibits believers from making their parents and brothers who are still disbelievers to become leaders because they are afraid they will learn about the condition of the Muslims and their strengths. Such an act would be very beneficial for the disbelievers to attack the Muslims. Believers who disobey this prohibition and are in a state of war, they still help unbelievers, because those who are being helped are related, then he is a person who is unjust towards himself, his followers, and his religion."
		   },
		   {
			"id": 1259,
			"surah": 9,
			"ayat": 24,
			"tafsir": "This verse warns that if a believer loves his father, his children, his brothers, his wives, his family, his wealth, commerce and homes more than loving Allah and His Messenger and striving to uphold His Shari'a, then Allah will bring punishment to them sooner or later. Those who act like that are wicked people who will not receive guidance from Allah swt. Here are some reasons why people love their children, husband, wife, mother, father, family, and so on: 1. That the love of children for their parents is an instinct that exists in every human being. Children as descendants of their parents inherit some of the characteristics and characteristics of their parents. 2. That the love of parents for their children is also an instinct, even deeper, because children are the heart of the heart that is expected to continue their descendants and continue their life history. In this case, parents are willing to bear all kinds of sacrifices for the future happiness of their children. 3. That love for relatives and friends is a normal love in the framework of carrying out life and life helping, helping and defending in household life and social life. Such love will foster feelings of respect and compassion. 4. That the love of a husband and wife is an integrated love between two types of creatures that raises offspring and builds a household for the happiness of life and life in this world and the hereafter. Therefore, the integrity of a harmonious husband and wife relationship is the basis for the harmony and happiness of life and the coveted life. 5. That love for property in all its forms, whether it be business property, inheritance, trade or a house where one lives, etc., is love that has become human nature. Everything that is loved is an inseparable need for life and human life which he strives for by taking all the ways that are lawful for Allah. 6. Love trade, is a human instinct, because it is a source of property development. 7. Love the place to live, because the house is a place to live and a place to rest everyday. As for love for Allah, it must take precedence over all kinds of love mentioned above because it is He who gives life and life, with all kinds of His gifts to humans and He is the perfect and Most Holy of all deficiencies. Likewise, love for Rasulullah SAW must be prioritized because Rasulullah SAW was sent by Allah SWT to bring guidance and be a mercy to the universe. Allah's Word: Say, \"If you (really) love Allah, follow me, Allah will love you and forgive your sins.\" (Ali-'Imran\/3: 31) And the words of Rasulullah saw: A person's faith is not perfect before he loves Me more than he loves his parents, his children and all mankind. (History of al-Bukhari, Muslim from Anas)"
		   },
		   {
			"id": 1260,
			"surah": 9,
			"ayat": 25,
			"tafsir": "This verse explains that the believers received a lot of help from Allah in the war against the polytheists who hindered the spread of Islam. The help was in the form of a perfect victory, sooner or later, like the Battle of Badr which won a great victory, and the War of Hunain which was initially lost then won. During the Hunain War, the number of Muslim soldiers was very large, while the army of infidels was smaller than the Muslim army. With such a large number of soldiers the Muslims felt proud and felt that they would not be defeated, but this was not the case. The Muslims were beaten back by the infidels, as if the large army, wealth, and preparations for war that were so complete were of no use, so that this vast earth felt cramped and caused them to retreat and flee in a state of disarray. It was narrated by Ibn Majah, al-Baihaqi and others from Aktsam bin Aljan that the Hunain War took place in the eighth year of Hijri, after the liberation of Mecca, in a place called Hunain, a valley located between Mecca and Taif. The army of the Muslims numbered 12,000, while the army of the infidels was only 4,000. In this battle the Muslims suffered defeat and were forced to retreat, but in the end Allah's help descended and the Muslims won. Narrated by al-Bukhari and Muslim from al-Barra' bin 'Azib ra which describes the atmosphere of the Hunain War, namely: A man from Qais asked, \"O Abu 'Imarah, did you also leave the Messenger of Allah in the Hunain War?\" Abu 'Imarah replied, \"The Messenger of Allah did not run even though the people of Hunain with sharp archers, could launch an attack, but we were still able to paralyze. When the Muslims were fighting over the loot, the enemy showered them with arrows, so that the Muslims suffered defeat and the enemy won victory.At that time I saw the Messenger of Allah riding horse came forward saying bravely, \"I am the Prophet, son of Abdul Muttalib, don't hesitate, O Allah, send down Your help.\""
		   },
		   {
			"id": 1261,
			"surah": 9,
			"ayat": 26,
			"tafsir": "This verse explains that after the Muslims felt sad and grieved due to the defeat in the Hunain War, Allah sent down help to them in the form of determination and brought reinforcements that they could not see. The reinforcements consist of angels. Feelings of sadness and grief for the Muslims turned into calm, courage and enthusiasm to move forward. In the end, the disbelievers suffered defeat, were killed, captured and their property was plundered. The defeat is a doom for them and that is the reward for their disbelief and the reward for their hostility towards the Muslims. The word of Allah swt: Fight them, surely Allah will torture them with (the intercession of) your hands and He will humiliate them and help you (with victory) over them. (at-Taubah\/9: 14)"
		   },
		   {
			"id": 1262,
			"surah": 9,
			"ayat": 27,
			"tafsir": "This verse explains that for people who have received punishment from Allah in this world, because of disbelief, they can be forgiven and their repentance accepted when they have received instructions from Allah to embrace Islam. When they have become Muslims and no longer associate partners with Allah, then their mistakes are forgiven by Allah and all their sins are erased, because Allah is Forgiving, Most Merciful."
		   },
		   {
			"id": 1263,
			"surah": 9,
			"ayat": 28,
			"tafsir": "After the Messenger of Allah appointed Abu Bakr to be the amirul hajj, the Messenger of Allah gave the task to Ali bin Abi Talib to accompany Abu Bakr in reading the opening verses of surahh at-Taubah in front of the crowd. Anxiety arose among the Muslims because they were worried that they would face food difficulties as a result of polytheists not being allowed to enter Mecca to perform the pilgrimage. At the end of this verse, Allah guarantees the believers from poverty. They do not need to worry about the lack of food and merchandise due to Allah's prohibition on the polytheists who usually come to the holy land carrying merchandise. God's guarantee to believers to get a good life depends on one's business activities and endeavors. However, it is inseparable from the will of Allah, to whom Allah gives His gifts. Therefore, believers should strengthen their faith and trust in Allah in addition to making efforts and endeavors. Allah knows the future affairs, whether regarding the prosperity or poverty that will befall the inhabitants of a land. Allah is Wise in all matters, especially regarding provisions, both in the form of commands and prohibitions. Allah has fulfilled His promise because in reality the people of Mecca did not experience any difficulties in life. After the ban was spread, more and more polytheists converted to Islam, not only those around the Arabian Peninsula, even in almost all directions. They are certainly obliged to perform the pilgrimage besides they are free to visit the holy land. This is one way for the people of Mecca to gain prosperity in life. With Allah's prohibition against polytheists entering the Grand Mosque, a disagreement arose between fiqh scholars as follows: 1. Mushriks and Ahl al-Kitab are not allowed to enter the Grand Mosque, while other mosques are permissible for Ahl al-Kitab. This is according to the Imam Syafii school of thought. 2. Non-believers, including the People of the Book, are not allowed to enter all mosques. According to the Maliki school of thought. 3. Those who are prohibited from entering the Masjidilharam are polytheists only, (not including Ahl al-Kitab). According to the Hanafi school of thought. 4. Some scholars are of the opinion that a polytheist is prohibited from entering the forbidden land and if he comes secretly (disguised) and then he dies and is buried, after being found out, his grave must be dug and buried outside the forbidden land."
		   },
		   {
			"id": 1264,
			"surah": 9,
			"ayat": 29,
			"tafsir": "In essence, this verse is the first step for the Prophet Muhammad to turn his attention to the Battle of Tabuk which he will face. The Tabuk War was the last war carried out by the Prophet Muhammad, after the Muslims were able to control the city of Mecca. Tabuk is located to the north of Medina, bordering Jordan\/Sham (Damascus) which at that time was ruled by the Roman Empire who was Christian. When news reached the Prophet Muhammad, that the Romans were preparing troops in large numbers to control the border area, the Prophet Muhammad, announced to all Muslims through the tribes to get ready to gather all their strength to join the Prophet in fighting the troops. Roman. The call of the Prophet Muhammad immediately received a response from the Muslims who had strong faith, except for the hypocrites who were looking for help as had become their custom especially in facing Tabuk, besides the distance was very far and the sun was very hot. After the Prophet Muhammad saw and the Muslim troops arrived at Tabuk, he found that the Roman troops had previously vacated the Tabuk area to retreat back to the interior. So the People of the Book who were there asked for peace and handed over the jizyah to the Prophet Muhammad as a sign of their acknowledgment to submit to Islamic rule, because they were not yet willing to embrace Islam. Every war during the time of the Prophet was only for self-defense or to retaliate against attacks. In this verse Allah commands the Muslims to fight the People of the Book, because they have four elements that make them enemies of Islam. The four elements are: 1. They do not believe in Allah, because they have destroyed the principle of monotheism. They make priests as saints who have the right to determine something, both regarding regulations relating to worship and those related to halal and haram. Likewise the Christians consider Jesus the son of God, while the Jews also regard Uzair as the son of God. This clearly shows that they all partnered with Allah in making religious regulations. 2. They do not believe in the afterlife, because they think that life in the afterlife is just a spiritual life. The error of their opinion is like this because there is no certainty, both in the Torah and in the Bible about the existence of a day of resurrection and retribution after death, when humans rise again as they were before, namely consisting of a body and a spirit, each of which will feel the pleasures of God's grace as confirmed in the Qur'an. 3. They do not forbid what Allah and His Messenger have forbidden. The Jews did not forbid what was forbidden by Allah in the Shari'a brought by Moses and part of which was sanctioned by Jesus, that is, the law was declared null and void. They see it as lawful to consume wealth in ways that are not lawful (batil), such as usury and so on and they follow the ways of the polytheists in the ferocity of war and treating prisoners. Meanwhile, Christians view what is lawful that is forbidden by Allah in the Mosaic Shari'a that has not been sanctioned by the Bible. In the Torah Allah forbids fat or the price of selling it. Christians don't see it as unclean. 4. They do not adhere to the true religion, namely the religion that was revealed to Musa and Jesus as. What they consider religion is actually a way created by their priests based on thoughts and interests. What caused this act was because the Torah which was revealed to Moses, and the Gospel which was revealed to Prophet Isa, were written long after both of them died. So that the Torah and the Bible were written based on the understanding of their followers. Even several centuries after the ascension of Jesus they chose four Gospels, each of which contradicts itself. Such was their condition, as hinted at by the word of Allah: (But) because they broke their promise, We cursed them, and We made their hearts hard of stone. They like to change the word (Allah) from its place, and they (deliberately) forget some of the messages they have been warned about. You (Muhammad) will always see betrayal from them except for a small group of them (who are not treacherous), so forgive them and leave them be. Indeed, Allah loves those who do good. (al-Ma'idah\/5: 13) Allah commands the believers to fight the People of the Book because they show hostility and threaten the security of Muslims, both in religious life and social life. If they accept Islam as a substitute for their religion, then they have returned to the true religion, and if they submit, no longer disturb and threaten the lives of Muslims, then they should pay jizya (except those who are poor and priests) as a sign that they are in low position. The entire obligation of Muslims is to guarantee their security, defend them, give them freedom, especially in carrying out their religious worship and treat them fairly in social life as Muslims themselves are treated. By paying the jizya they are called zimmah experts or zimmi infidels."
		   },
		   {
			"id": 1265,
			"surah": 9,
			"ayat": 30,
			"tafsir": "This verse explains the wrong belief of the People of the Book, both Jews and Christians. They believe that God has a son, the Jews adhere to the belief that \"Uzair was the son of God\". This belief is in stark contrast to the true understanding of faith in God, because the true faith is that God is one, single, fatherless and has no alliance with anything or anyone. He is perfect, omnipotent, and no one is similar and equal to Him. Uzair was a priest of the Jewish nation, a resident of the land of Babylon, living around 457 BC. He was an accomplished writer, founder of a large society, and diligently collected Bible texts from various regions. It was he who introduced the Chaldean or Aramaic letters in place of the ancient Hebrew ones. He was also the one who wrote things related to the circulation of the sun, and rearranged quality books that had fallen apart. During his lifetime, he was considered the fertility period of the Jewish religion, because he was the leading poet of the Torah law, reviving the law after being forgotten for so long. Therefore the Jews regard him as a holy man who is closer to God, even some of those who are fanatics consider him and call him \"son of God\". Even though only a part of the Jews believed in this way, it could be assumed that this belief was their belief entirely because the wrong statement was not disputed or denied by other groups. Allah's Word: And protect yourself from the torment that does not only affect the unjust people among you. (al-Anfal\/8: 25) The same goes for the Christians towards Jesus Christ. They believed that Jesus was the son of God. Even this belief is very contrary to faith in Allah SWT. Even though at first the words \"Isa is the son of God\" were only the words of their ancestors who thought that Jesus was a noble, loved and honorable person, and those words did not mean the real son of God. However, gradually, especially when Hindu religious beliefs infiltrated the Christians and the two religions side by side, hand in hand, instilled in their hearts the belief that Jesus Christ is truly the son of God. Then after some time had passed, a change arose in their belief that the child of God and God is also the Rohulkudus (Holy Spirit), who later became known as \"Father, son and holy spirit\", were essentially one with God. According to their belief, the three elements namely: the Son of God, God and the Holy Spirit are essentially only one. This teaching has become a statute in Christianity, three centuries after the death of Jesus Christ. Although this belief is opposed by a number of them, the Catholic, Orthodox, and Protestant churches stand by their convictions. Even those who do not justify this belief are considered no longer Christians and have apostatized from their religion. Saying that Isa Al-Masih is the son of God and believing that the three holy persons are the essence of God Almighty, is not justified by Allah and cannot be accepted by common sense and that not a single religion of the prophets before then adhered to such belief, Allah emphasized that their words are like that, do not have the essence of truth in the slightest and there is no one argument and real evidence that can support it. In line with this, Allah swt says: How ugly are the words that come out of their mouths; they are just telling (something) sheer lies. (al-Kahf\/18: 5) In the New Testament books themselves there is no information stating that Jesus Christ was the son of God. In fact, they have strayed far from the true teachings. They imitated the words of previous disbelievers, such as the polytheists of the Arab nation who said that the angels were the daughters of Allah. History records that the belief \"God is begotten, God incarnates in three elements of one nature\" is the belief of the Brahmans and Buddhists in India, the belief of the ancient Japanese, Persians, Egyptians, Greeks and Romans. The condition of the Jews and Christians believing that Allah swt has a child, no one from the Arab nation has ever known about it, nor have the people around him. And it was only with the revelation of the Qur'an that the confusion in their understanding of the essence of Prophet Isa, God and the Holy Spirit was discovered. Had it not been for a verse that corrected this misunderstanding, surely the error would not have been realized until now. This is one of the miracles of the Qur'an. Allah swt cursed them because they did not want to realize and realize their mistakes and misguidance. Even though Allah's Apostles had explained that Allah is One and Only, without children and without being begotten, they did not want to return to the monotheistic creed, and even persisted in their wrong intentions, namely assuming that Uzair and Jesus Christ were the children of Allah. Even though both of them are ordinary humans and His servants, just like other humans, even though it is recognized that both of them are pious humans, obedient to Allah and His Messenger, noble and respected, as Allah says: And they say, \"God is Most Mercy has made (an angel) a child.\" Blessed be He. Actually they (the angels) are glorified servants. (al-Anbiya'\/21: 26)"
		   },
		   {
			"id": 1266,
			"surah": 9,
			"ayat": 31,
			"tafsir": "In this verse, it is explained the form of misguidance of the People of the Book, the Jews, and the Christians, each of whom takes and elevates God besides Allah. The Jews made the priest of their religion a God who had the right to make lawful and forbidden things. While the Christians make their monks as God who must be obeyed and worshiped. In Islam, the position of a religious leader is nothing more than an expert who has in-depth knowledge of the ins and outs of Shari'a. All opinions and fatwas put forward are only as an explanation of Allah's laws which must be accompanied and based on real arguments from the word of Allah, or the Sunnah of the Prophet. They do not have the slightest right to make shari'a, because shari'a is the right of Allah alone. According to Christians, in addition to Jesus Christ being worshiped as God, there are also those who worship their mother, namely Maryam, even though Jesus was an apostle like the previous apostles and Maryam his mother, only a woman who was pious and diligent in worship so that she received the title Maryam. Al-Butul, and both of them eat and drink like other humans. Word of Allah swt: Almasih son of Maryam is only a Messenger. Previously, several apostles had passed. And his mother is a stickler for the truth. Both of them used to eat food. (al-Ma'idah\/5: 75) Christians, Catholics and Orthodox people worship Jesus' disciples and his messengers, as well as the heads and religious leaders, who are considered holy, and are used as intermediaries who will convey their worship to Allah. They also think their priests have the right to forgive or not forgive as they wish, even though no one has the right to forgive sins except Allah swt, as His word: And who (again) can forgive sins other than Allah? (Ali-Imran\/3: 135) As for the Jews, they added another law to their religious law. They were not sufficient and limited themselves to the laws contained in the Torah as a guideline for their lives, but added and included other laws that they heard from the heads of their religion before these laws were recorded as regulations that had to be obeyed and obeyed by adherents of Judaism. Such are the errors that the People of the Book have committed, even though they were not commanded, except to worship the One God, the Lord of all the worlds, namely Allah, because there is no God who has the right to be worshiped except Him. He is God Almighty, there is no partner for Him in terms of His essence, His attributes and His actions. Glory be to Allah swt from what they associate. If they believe that their leaders have the right to determine a law, it means they have the belief that there is a God who is worshiped besides Allah SWT who can cause disease and heal, give life and die without Allah's permission. All of that arises from the will of his passions and his mind, not sourced from divine revelation."
		   },
		   {
			"id": 1267,
			"surah": 9,
			"ayat": 32,
			"tafsir": "This verse describes the evil desires of the People of the Book. They want to eliminate the religion of monotheism, namely the religion brought by the Prophet Muhammad, a religion that is full of evidences that show the oneness of Allah, a religion that purifies Him from things that are not natural to Him. Muslims believe that Islamic teachings are high, as the Prophet said: Islam is high and there is no (religion) that is higher than it. (History of al-Bukhari and Muslim) All kinds of efforts and endeavors were made by them, both in smooth and rough ways, in the form of violence, persecution, war and so on, to destroy the religion of Allah, which is likened to nur or the light that illuminates the universe This. But God did not approve of that evil intention. All their efforts were unsuccessful, while the Islamic religion is spreading day by day to remote areas, so that the world recognizes its purity, even though not all human beings have embraced it. Even though the evidence is sufficient and the facts clearly show the truth of Islam, they still deny it. They work hard in all kinds of ways and means, so that Muslims are willing to leave their religion or embrace their religion. And the Jews and Christians will not be willing to you (Muhammad) until you follow their religion. (al-Baqarah\/2: 120) And His word: Hate has appeared from their mouths, and what is hidden in their hearts is more evil. (Ali 'Imran\/3: 118)"
		   },
		   {
			"id": 1268,
			"surah": 9,
			"ayat": 33,
			"tafsir": "This verse explains that as a guarantee for the perfection of religion, an apostle was sent, namely the Prophet Muhammad and provided with a holy book, namely the Qur'an which contains instructions that explain everything and includes the contents of the previous books. Islam has been approved by Allah to become a religion that is embraced by all mankind. Word of Allah swt: And I have accepted Islam as your religion. (al-Ma'idah\/5: 3) Islam is in accordance with all conditions and places and is valid for all time from the time it is prescribed until the end of time. Therefore, it is not surprising that the religion of Islam is welcomed by all mankind and its number is increasing rapidly, so that in a short time it has spread to all corners of the world, occupying a noble and high place. Even though the polytheists are not happy with this fact, they even hinder it and if they can destroy it, God's divine nature will also apply, there is no force whatsoever that can hinder or hinder it. God's Word: (Thus) God's law, which has been valid from long ago, you will never find a change in God's law. (al-Fath\/48: 23)"
		   },
		   {
			"id": 1269,
			"surah": 9,
			"ayat": 34,
			"tafsir": "In this verse it is explained that most of the leaders and pastors of the Jews and Christians have been influenced by the love of wealth and rank. Therefore they do not hesitate to take possession of other people's property in a way that is not right and openly hinder people from believing in the religion brought by the Prophet Muhammad. Because if they allow their followers to justify and accept Islamic da'wah, of course they cannot be arbitrary towards them and the influence and position they enjoy will be lost. The Jewish and Christian leaders and priests have done various ways to take other people's property, including: 1. Building tombs of prophets and priests and establishing churches named after his name. Thus, they get votive gifts and waqf which are given to the tomb and the church. Sometimes they put pictures of their saints or statues of them, then those images, statues were worshipped. In order for their wishes to be granted, they also give out gifts of money and so on. Thus, a lot of money was collected and the money was fully controlled by the pastor. This is an act that is contrary to the religion brought by the apostles because it leads to polytheism and takes people's property using the names of prophets and saints. 2. The Christian priest receives money from his congregation as a reward for the forgiveness of sins he has committed. A person who sins can have his sins forgiven if he comes to church to meet the pastor and confess before him all the sins and immorality he has committed. They believe with full confidence that if the priest has forgiven his sins, it means that God has forgiven him because the priest is God's representative on earth. To those who have given the ransom money, a forgiveness card is given, as if the card will later be shown to God in the hereafter on the day of judgment which shows that they are clean from all sins. 3. The reward for giving a fatwa either justifies what is unlawful or forbids what is lawful in accordance with the wishes of the king, rulers and wealthy people. If the dignitaries and rich people want to take an action that is contrary to the truth, such as taking revenge and acting cruelly against groups they see as obstacles to the fulfillment of their desires or they consider them enemies, they ask the priest to issue a fatwa allowing them to act arbitrarily. authority over those people, even though the fatwa is against their religious teachings as if those religious teachings were considered deserted and as if the Torah was just a sheet of paper that they could change at will. This is highly reproached by Allah in His word: Say (Muhammad), \"Who sent down the Book (Torah) that Moses brought as a light and guidance for mankind, you make the Book into pieces of paper that are scattered, you show ( some of it) and much that you hid, even though you were taught what neither you nor your forefathers knew.\" (al-An'am\/6: 91) 4. Taking the property of other people who are not of the same nationality or religion by committing fraud, betrayal, theft, and so on on the grounds that Allah forbids fraud and betrayal only against Jews. As for people who are not of the same nationality and religion with them, it is permissible. This is explained by Allah in His words: And among the People of the Book there is someone who, if you entrust him with a lot of wealth, he will surely return it to you. But there are (also) among them that if you entrust him with a dinar, he will not return it to you, unless you always collect it. That is because they say, \"There is no sin on us against illiterate people.\" They say lying things against Allah, even though they know. (Ali 'Imran\/3: 75) 5. Taking rent (usury). The Jews are very well known in this regard, because some of their priests have made it lawful even though in their book usury is forbidden. There were also some of the priests who gave a fatwa that taking usury from the Jews was lawful. Likewise, there are Christian priests who allow some riba to be lawful, although some others forbid it. Those are the ways they practice in taking and controlling other people's property for their own interests and to satisfy their lusts and desires. As for the ways they hinder people from the way of Allah, is by destroying the creed and destroying the teachings of pure religion. The Jews once worshiped a calf statue, once said Uzair was the son of Allah, and very often they distorted Allah's verses and changed them, according to their desires and passions as explained in the past verses as in surah al- Baqarah, Ali 'Imran, an-Nisa' and al-Ma'idah. They openly denied the Prophet Musa as a prophet, even though he was the carrier of the pure creed which was later corrupted by the Jewish priests. Likewise, Christians have distorted the creed brought by the Prophet Isa, so that they regard it as God. Therefore they, both Jews and Christians, have always opposed the teachings brought by the Prophet Muhammad, even insulted him in various ways and opposed and denied the Al-Qur'anul Karim. They are trying with all their might to extinguish Allah's light but Allah has decreed that He will perfect that light. All their efforts and endeavors failed but it is certain that only Allah's will prevails and is carried out. Allah says: They wanted to extinguish Allah's light (religion) with their mouths (sayings), but Allah rejected it, instead wanting to perfect His light, even though the disbelievers did not like it. (At-Taubah\/9: 32) Such is the behavior of most of the Jewish and Christian clergy. They, because of their greed and covetousness of property, collect as much as possible and use some of the wealth to prevent people from following God's way. Therefore, Allah will throw them later in the hereafter into hell and will torture them with a very painful doom. Regarding collecting this wealth and not spending it in the way of Allah, even though it is addressed to Jews and Christians, the commentators argue that this verse also includes Muslims. So anyone who because of greed and greed tries to collect wealth and then save it and does not spend it in the way of Allah, then he will be threatened by Allah will be put into hell whether he is a Jew, Christian or Muslim. It was narrated by Ibn Abi Syaibah, Abu Dawud, and al-hakim from Ibn 'Abbas that after this verse was revealed, the Muslims objected and said, \"We will not have the heart if we do not leave for our children some of our wealth. \" Umar said, \"I will expand your wealth,\" then he went with Sauban to the Prophet and told him, \"O Prophet of Allah, this verse is very heavy for your friend.\" The Messenger of Allah replied, \"Indeed Allah does not oblige zakat, but so that the assets that remain in your hands are clean. Allah only establishes inheritance laws for assets that are still there after your death.\" Umar uttered the takbir on the Prophet's explanation, then the Prophet said to Umar, \"I will tell you something that is best to be cared for, namely a pious woman who when a husband looks at her he feels happy, and when ordered he obeys her and when he is in another place she keeps her honor.\""
		   },
		   {
			"id": 1270,
			"surah": 9,
			"ayat": 35,
			"tafsir": "This verse explains that those who collect wealth and keep it without part of it being spent in the way of Allah (zakat paid), they will be put into hell. All these treasures will be heated with fire and then ironed on the owner's forehead as well as his stomach and back, then said to him, \"These are your treasures that you kept before.\" In connection with this there is a hadith narrated from Abu Hurairah: There is no one who does not pay zakat except that his wealth will be turned into pieces of fire on the Day of Judgment and then ironed on his stomach, forehead and back. (Muslim history from Abu Hurairah) Such is the fate of the Jews and Christians who collect wealth and accumulate it and use some of that wealth to block Allah's way. Likewise the fate of a Muslim who does not pay zakat on his wealth. The treasure itself will be used as a torture tool. How can they make the treasures they get in this world used as pieces of fire or just as an image. Allah is the All-Knowing, because it includes unseen matters which are not known except by Allah alone."
		   },
		   {
			"id": 1271,
			"surah": 9,
			"ayat": 36,
			"tafsir": "This verse explains that Allah has determined the number of months to be twelve, ever since He created the heavens and the earth. What is meant by the month here is the month of Qamariah because it is with the calculation of Qamariah that Allah determines the time for carrying out the obligatory worship and circumcision worship and several other provisions. Then performing the pilgrimage, fasting, provisions regarding the 'iddah of divorced women and the period of breastfeeding are determined by the month of Qamariah. Among the twelve months, there are four months that are designated as sacred months, namely the months of Zulkaidah, Zulhijah, Muharam and Rajab. The four months must be respected and at that time no war is allowed. This stipulation also applies to the Shari'a of the Prophet Ibrahim and the Prophet Ishmael to the Shari'a brought by the Prophet Muhammad. One of the lessons learned from implementing these sacred months, especially the months of Zulkaidah, Zulhijah, and Muharam, is that the pilgrimage to Mecca can take place in peace. The time span between Zulkaidah and Muharam is enough to secure the pilgrimage. If someone violates this stipulation, then the violation is not because the stipulation has changed, but solely because it follows the desires of the lusts as the polytheists have done. Usually the Arabs are very obedient to this stipulation so that if someone is killed, either his brother or father meets the murderer in one of these forbidden months, then he does not dare to seek revenge, out of respect for that forbidden month. Even though the Arabs are very famous for their enthusiasm to demand defense and revenge. That is the provision that must be met, because violation of this provision is tantamount to wronging oneself, because God has glorified and made it the months that must be respected. Unless we are betrayed or attacked during the sacred month, then in this case it is obligatory to defend ourselves and repay evil with evil as well. Allah's Word: They ask you (Muhammad) about fighting in the forbidden month. Say, \"Fighting in that month is a major (sin). But blocking (people) from the way of Allah, disbelieving Him, (barring people from entering) the Grand Mosque, and expelling residents from its surroundings, is greater (the sin) in the sight of Allah. Meanwhile slander is worse than murder. They will not stop fighting you until you apostatize (leave) your religion, if they are able to. Whoever among you apostates from his religion, then he dies in disbelief, then their deeds are in vain in this world and in the hereafter, and they are the inhabitants of hell, they will abide therein.\" (al-Baqarah\/2: 217) This verse instructs the Muslims to fight the polytheists because they break the agreement that has been agreed upon and fight the Muslims. They are fighting the Muslims not out of revenge, tribal fanaticism, or seizing property as they used to do in the past against other tribes, but their main aim is to destroy the religion brought by the Prophet Muhammad and extinguish its light. So it is obligatory for every Muslim to stand up and simultaneously fight them until the religion of Islam is established and they are destroyed. Let every Muslim be instilled into the chest of every Muslim the spirit of jihad and the determination and belief that they will surely win because Allah always helps those who fear Him."
		   },
		   {
			"id": 1272,
			"surah": 9,
			"ayat": 37,
			"tafsir": "This verse explains that the withdrawal of the prohibition (purity) of a month to the following month, such as the postponement of the month of Muharram to the month of Safar with the intention that in that month of Muharram it is permissible to fight, is an act of disbelief because one considers oneself equal to God in enacting laws. It has been clear and acknowledged since the Prophets Abraham and Prophet Ismail that in the sacred months it is not permissible to fight. But because those polytheists could not control themselves not to fight for three consecutive months, namely in the months of Zulkaidah, Zulhijah and Muharam, the sanctity of that month was shifted to another month so that they had the opportunity to fight in the month of Muharam. This they usually do when they are in Mina. When the congregation gathered there, a leader from Bani Kinanah stood up and said, \"I am a person whose decision cannot be overruled.\" The congregation replied, \"It is true what you say and postpone for us the month of Muharram to the month of Safar.\" Then the leader made it lawful for them the month of Muharram and forbade the month of Safar, and named the month of Muharram by another name, namely Nasiah. Such is the character of polytheists, driven by desires and passions, they dare to make lawful what is forbidden by Allah and have dared to make lawful things lawful, because they have been influenced by Satan's desires, and of course people with that character will not receive guidance from Allah. ."
		   },
		   {
			"id": 1273,
			"surah": 9,
			"ayat": 38,
			"tafsir": "In the 9th year of Hijri, the Prophet Muhammad ordered the Muslims to be prepared to face the attacks of the Christians in Tabuk, a place located between Medina and Damascus, approximately 610 km from Medina and 692 km from Damascus. At the moment it is in the territory of the Kingdom of Saudi Arabia, the border area with Jordan. This preparatory order was based on news that reached the Muslims from the Nibthi who brought oil trade to the country of Syria, that the Romans and the Arab Christians consisting of the Lakhm, Judzam and others, numbering approximately 40 thousand people, complete with weapons and supplies and led by a commander in chief named Qubaz was ready to invade the city of Medina, fighting the Muslims. Their line of pioneers had arrived at the border called Baqlas. It was the custom of the Prophet Muhammad when he was going to face a war, for the sake of his benefit he kept secrets related to war. But this time the Prophet Muhammad openly told the Muslims about the difficult and difficult situation, as well as the shortcomings, the distance to be covered, and the number of troops and forces of the enemy that would be faced, so that they really made solid preparations. The Muslims whose faith is firm, strong in steel, without thinking about the difficult and sad situation, are getting ready to wait for the command to depart. The benefactors do not hesitate to donate their wealth for the sake of jihad fisabilillah. Uthman bin Affan donated 10,000 dinars, 300 camels, complete with weapons and 50 horses. Abu Bakr as-Siddiq donated all of his wealth, namely 4,000 dirhams. The Prophet Muhammad asked, \"Is there anything you left for your family?\" He replied, \"What I left for my family is Allah and His Messenger.\" Umar bin Khathab donated half of his wealth. Ashim bin 'Adi donated 70 wasaq of dates (one wasaq = 60 bushels, 150 liters). Mothers also did not want to be left behind: their gold jewelery in the form of bracelets, earrings, necklaces, and so on, was donated with full sincerity for the success of the struggle of the Muslims. After everything was considered ready, the Prophet Muhammad went to lead an expedition with 30,000 people to Tabuk. Muhammad bin Maslamah was appointed by Rasulullah SAW to take care of the city of Medina and he entrusted Ali bin Abi Talib to take care of his household. In addition, there were a number of Muslim soldiers who were lazy and reluctant to go to Tabuk on the pretext, among other things, that they had recently returned from the hunain and taif wars. Also at that time the summer was very hot, the season was famine, it was difficult to get daily necessities such as food and so on. Because it was difficult to get food, a date seed was distributed to two people to eat, while at that time fruits in Medina such as dates had already started to ripen, and it would not be long before they could be picked. This verse denounces and condemns the actions of those who are reluctant to go to war even though the situation is indeed very difficult. From this incident it can be seen clearly which of the Muslims truly believes, and which of them is a hypocrite, who only pretends to believe. One of the signs that a person's faith is true is that he is willing to sacrifice his wealth and if necessary his soul for jihad in the way of Allah, as Allah says: Verily the true believers are those who believe in Allah and His Messenger then they do not hesitate doubt and they strive with their wealth and their souls in the way of Allah. They are the right people. (al-hujurat\/49: 15) Whereas the hypocrites who only pretend to believe, prioritize the pleasures of life in this world rather than happiness in the hereafter which is eternal in nature. Even though the pleasures in this world, no matter how great, do not mean anything when compared to the happiness in the hereafter. Word of the Prophet Muhammad: By Allah, this world is not (when compared) with the hereafter except (only) like one of you who dips his finger into the sea, then lifts it. Then see what only his finger carried away. (History of Muslim, Ahmad and at-Tirmidhi from al-Miswar)"
		   },
		   {
			"id": 1274,
			"surah": 9,
			"ayat": 39,
			"tafsir": "This verse threatens those who do not comply with the advice and orders of the Prophet Muhammad to go to war against the threat of the enemy. Their disobedience to the orders of the Prophet Muhammad to go to war to uphold their religion will not harm Allah in the slightest, nor will they benefit, as Allah's word was said by the Messenger of Allah: \"O My servants, in fact you will not You can harm Me so that you can trouble Me, so you will not be able to benefit Me until you can help Me.\" (Muslim history from Abi dzar al-Gifari)"
		   },
		   {
			"id": 1275,
			"surah": 9,
			"ayat": 40,
			"tafsir": "This verse does not justify the suspicion of the polytheists that the struggle of the Prophet Muhammad would not have been successful if they had not helped him. The Prophet will still win because Allah will help him. This has been proven when the Prophet Muhammad's house was tightly surrounded by Quraysh people who were about to kill him. The killing was intended to prevent and stop the Islamic da'wah which they feared would spread its influence. With the help and assistance of Allah swt, Prophet Muhammad saw was able to escape their tight siege, so he felt safe leaving his house to the cave on Mount Sur, where he was temporarily hiding, accompanied by his loyal friend Abu Bakr. Seeing the dire situation, Abu Bakr felt worried and said, \"O Messenger of Allah, by Allah, if one of them lifted his leg, surely he could see us under his feet.\" The Prophet Muhammad replied, \"O Abu Bakr, do not grieve, indeed Allah is with us.\" The Prophet Muhammad saw with Abu Bakr while in the cave sur, always under the help and protection of Allah. Allah gave peace to the Prophet and Abu Bakr, as well as provided military assistance that he did not see, so that both of them were safe in the cave sur, and the evil intentions of those people failed. Word of Allah swt: And (remember), when the disbelievers (Quraish) thought of deception against you (Muhammad) to arrest and imprison you or kill you, or expel you. They devised and Allah thwarted the deception. Allah is the best avenger of deceit. (al-Anfal\/8: 30) And His words: Indeed, We will help Our messengers and those who believe in the life of the world. (Gafir\/40: 51) Allah SWT always places the disbelievers at a low level, always loses. And the kalimah of Allah, namely religion based on monotheism, far from shirk, is always placed in a high place, overcoming others. Allah swt is almighty and almighty, nothing can beat him, almighty, puts something in its place. He is the one who always helps to win Rasulullah saw with His power, win His religion over other religions, with His wisdom, as Allah says: He is the one who has sent His Messenger with guidance (Al-Qur'an) and the true religion to be superior to all religions, even though the polytheists do not like it. (at-Taubah\/9: 33)"
		   },
		   {
			"id": 1276,
			"surah": 9,
			"ayat": 41,
			"tafsir": "In this verse it is explained that if the safety of the Muslims is threatened, fighting is no longer a recommendation, but an obligation, so that no Muslim is justified not participating in the expedition. Everyone who is healthy, mature, rich and poor is obliged to appear on the battlefield to defend Islam and uphold the truth. Older people whose conditions are justified are not obligatory, such as too old, physically weak, disabled, helpless, seriously ill and others, because they will become a burden if they are included. Word of Allah swt: There is no sin (for not going to war) on weak people, sick people and people who do not get what they will spend, if they act sincerely to Allah and His Messenger. (at-Taubah\/9: 91) They were ordered to wage jihad guarding against enemy attacks, to defend their homeland, to donate their wealth and themselves to uphold justice, and to exalt Allah's word, to appear on the battlefield and to wage jihad with wealth, with the intention of upholding the rank of people and religion, if done sincerely will give happiness in the world and the hereafter."
		   },
		   {
			"id": 1277,
			"surah": 9,
			"ayat": 42,
			"tafsir": "This verse explains the background of the non-participation of the hypocrites to the battlefield even though the mandatory war order has been announced. One of the reasons for their reluctance was because going to war would be long distances, in the summer, in a state of deprivation, and it was not certain that they would win and receive the spoils of war (ganimah). They were pessimistic, because what they faced was a well-trained, strong, and numerous Roman army. If they were ordered to a nearby place where they would not have to work hard on the journey, would be sure to win, and gain easy profits, of course they would and would not hesitate to go to war. To hide their hypocrisy, they did not hesitate to swear by Allah that if they were able and had the ability, of course they would go with them. They said this oath as an excuse when the Muslims had returned from the Tabuk war safely and were already in their midst, as Allah says: They (the hypocrites who did not participate in the war) will tell you their reasons when you have returned to them . (at-Taubah\/9: 94) They suspect that the false oath they utter is profitable for them and can cover up their hypocrisy, when in fact this action only harms them. In addition, perjury is one of the major sins, as the Prophet said: The major sins are, associating partners with Allah, disobedience to both parents, killing oneself, and swearing falsely. (Al-Bukhari's history from 'Abdullah bin 'Amr bin al-'As) Allah swt knows their lies and false oaths and Allah will repay them all."
		   },
		   {
			"id": 1278,
			"surah": 9,
			"ayat": 43,
			"tafsir": "According to Mujahid's history, this verse was revealed regarding hypocrites who asked permission from the Prophet for various reasons not to go to war. Even though they were permitted or not, they would still stay in Medina, and would not join the battlefield. Allah has forgiven the Prophet Muhammad for giving permission to some hypocrites not to join the battlefield, after they put forward a fabricated reason, before there was a revelation from Allah giving approval to their request. If the Prophet Muhammad had not complied with their request and had not allowed them, their secret would have been revealed, because whether they had been permitted or not, they would not have gone to war together."
		   },
		   {
			"id": 1279,
			"surah": 9,
			"ayat": 44,
			"tafsir": "Those who believe in Allah and the Last Day will certainly not look for excuses not to fight to defend their religion and uphold the truth. They also would not ask permission from the Messenger of Allah not to strive in the way of Allah with their wealth and themselves, on the contrary they were always ready to sacrifice their wealth, according to their abilities, even their souls were ready to be sacrificed. Allah swt knows those who fear Him, namely people who always avoid things that cause Allah's wrath, and do what pleases Him."
		   },
		   {
			"id": 1280,
			"surah": 9,
			"ayat": 45,
			"tafsir": "This verse explains that those who ask permission from Rasulullah SAW not to participate in jihad without an acceptable reason, are hypocrites who do not believe in Allah SWT, do not acknowledge His oneness, and do not believe in the Last Day. They think that spending wealth in the way of Allah is foolishness and loss and fighting jihad at the expense of one's soul is only loss and suffering. In their hearts there is a feeling of doubt about the truth of their religion. They are always confused and indecisive. They want to cooperate with believers in easy affairs, but in rather difficult and difficult matters such as fighting, they dodge and look for various contrived reasons to avoid or free themselves from this obligation."
		   },
		   {
			"id": 1281,
			"surah": 9,
			"ayat": 46,
			"tafsir": "This verse explains the proof of the falsity of their oath and the lies of their words, namely that there are no signs that they will join the war. If it is true that they want to go to war, of course they will prepare the necessary equipment such as provisions, vehicles, weapons, and so on. The non-hypocrites not leaving for the battlefield is an advantage for the Muslims, because if they join together to the battlefield, they will certainly pit the Muslims against each other and disrupt the ranks. That is why Allah made their intentions weak, worried, and doubtful in their hearts, causing them to feel reluctant and unwilling to leave, as if someone had told them in an angry tone, \"Just stay with the children, women, people weak, sick, and need not go to war.\" These words please the hypocrites because he considers these words according to his will and desire, even though they are spoken in an unpleasant tone."
		   },
		   {
			"id": 1282,
			"surah": 9,
			"ayat": 47,
			"tafsir": "In this verse Allah explains that even if the hypocrites who ask for permission also go with the Muslims, they will not increase the peace and enthusiasm of the Muslims, but instead they will disrupt the concentration of the Muslims and undermine their unity, as well as weaken their steadfastness. Allah swt knows those who are unjust and will reward them accordingly in the next day."
		   },
		   {
			"id": 1283,
			"surah": 9,
			"ayat": 48,
			"tafsir": "In this verse, Allah SWT explains that the attempt to disrupt the ranks of the hypocrites has been going on since the Uhud War. In the Battle of Uhud the leader of the hypocrites, namely 'Abdullah bin Ubay, had persuaded a third of the Muslim army on the way to Uhud, in a place called Syauth between Medina and Uhud to withdraw from the war. According to Ibn Ubay, only people who are stupid and unreasonable want to go to war and die in vain. Then he returned to Medina along with the hypocrites he influenced. As for the two groups, namely Banu Salamah and Banu Haritsah who were almost influenced and provoked by the propaganda spread by 'Abdullah bin Ubay, they are still protected by Allah SWT, so they are not affected and are safe from this slander. That is what is meant by the word of Allah: When two groups from your side want to (back away) because of fear. (Ali-'Imran\/3: 122) However persistent the efforts of the hypocrites paralyzed the struggle of the Prophet Muhammad and his followers, in the end the truth also became a reality. Allah swt's promise came just in time and Allah's religion won victory, towered high and there is nothing higher than it. The land of Mecca could be liberated, the people who converted to Islam flocked, even though all of this was not liked by the enemies of Allah. Word of Allah swt: They wanted to extinguish the light (religion) of Allah with their mouths (sayings), but Allah rejected it, instead wishing to perfect His light, even though the disbelievers did not like it. (at-Taubah\/9: 32)"
		   },
		   {
			"id": 1284,
			"surah": 9,
			"ayat": 49,
			"tafsir": "Sabab Nuzul: Narrated by al-Wahidi in his book Asbab an-Nuzul that the Prophet said to Jad bin Qais one of the hypocrites' magnates, \"O Jad, do you have the ability to face the Bani Ashfar (Romans)?\" Jad replied, \"It would be better if the Messenger of Allah allowed me to stay (in Medina) and not participate in the war, because as my people know, I am easily seduced by women. I was worried that if I saw their women, I would be attracted and could not control my lust, so that in the end I plunged me into slander.\" With a heavy feeling Rasulullah turned his head and said, \"I allow you to stay,\" then this verse was revealed. This verse explains that among the hypocrites who are not ashamed to make up excuses asking the Prophet, so that they do not join the war and are allowed to live in Medina. They seem to have forgotten that the various excuses that they make up and show are known by Allah, and Allah will reveal the secrets that are hidden in their hearts. They are not aware that the false reasons put forward and the deception plunges them into the abyss of great disaster and sin. Their behavior shows the weakness of their faith and reveals its hypocrisy. They will be plunged into hell, because of the sins they have committed, namely denying Allah, denying His verses and belied His messengers. God's Word: Not so! Whoever does bad, and his sin has drowned him, then they are residents of hell. They live in it. (al-Baqarah\/2: 81)"
		   },
		   {
			"id": 1285,
			"surah": 9,
			"ayat": 50,
			"tafsir": "Sabab Nuzul: It is narrated that the hypocrites who remained in Medina and did not go to war always broadcast false news concerning the Prophet Muhammad and his companions. They said, \"Muhammad and his companions encountered difficulties on their way and they were in danger.\" But soon it turned out that what the hypocrites were broadcasting was a lie. The Prophet Muhammad and his companions remained in good condition, not lacking in anything. Based on this undeniable fact, the hatred of the hypocrites arose and this verse was revealed. (Fath al-Qadir 2\/370). This verse explains that one of the lies of the hypocrites was that when the Messenger of Allah and his companions obtained pleasant things such as ganimah, victory, and others, as they had obtained in the Battle of Badr, they grumbled feeling disappointed and anxious, because of hatred and envy. . On the other hand, if the Prophet Muhammad and his companions encountered difficulties and defeats, as happened in the Battle of Uhud, they were happy and praised themselves for taking the decision to avoid the war. They said, \"Indeed, every time we encounter something, we are very careful and consider it carefully in advance.\" Each boasted of the thoughts and considerations which he had advanced. Praising his deeds, feeling lucky not to go to war and not to experience trouble and destruction. Finally they dispersed in a happy state and felt happy over the disaster that had befallen the Prophet Muhammad and his companions."
		   },
		   {
			"id": 1286,
			"surah": 9,
			"ayat": 51,
			"tafsir": "This verse instructs the Messenger of Allah to answer the challenges of hypocrites who feel happy when the Messenger of Allah and his companions are struck by difficulties and feel short of breath when the Messenger of Allah and his companions obtain pleasure by saying, \"What befell us and what we gain and experience is -things that have been arranged and determined by Allah, namely things that have been recorded in Lawh Mahfudh in accordance with the sunatullah that apply to His servants, both the enjoyment of victory and the disaster of defeat, everything happens according to qadza and qadar from Allah and not according to the wishes and desires of any human being. Allah is our only protector, and it is in Him that we put our trust and surrender, so that we never feel hopeless when something unpleasant afflicts us and we do not feel arrogant and arrogant when we receive favors and things. -things to aspire to and dream of.\" Allah's Word: And whoever puts his trust in Allah, Allah will fulfill his (needs). Verily, Allah carries out His affairs. Indeed, Allah has made provisions for everything (Ath-thalaq\/65: 3) And Allah's word: So have they never traveled on earth so that they can see how the end of those who were before them. Allah has destroyed them, and for those who disbelieve will receive (fate) like that. That is because Allah is the protector of those who believe; while the disbelievers have no protection for them. (Muhammad\/47: 10 and 11)"
		   },
		   {
			"id": 1287,
			"surah": 9,
			"ayat": 52,
			"tafsir": "This verse explains how the hypocrites are waiting for the destruction and destruction of the Prophet Muhammad and his companions, but they will not witness it, except for one of the two things that benefit the Prophet and the Muslims, namely victory or martyrdom. Meanwhile, the Prophet and his companions waited for one of two things to harm and destroy them, because they were still influenced by the venomous whispers and invitations of Satan, so they always denied and disobeyed. The two things that are meant are that one day Allah will allow His Messenger to fight them until they fall to their knees or suffer destruction. The ignorant hypocrites were waiting for what the Prophet Muhammad and his companions would experience. On the other hand, the Prophet Muhammad was looking forward to what punishment would befall them as long as they remained in denial and did not want to be aware."
		   },
		   {
			"id": 1288,
			"surah": 9,
			"ayat": 53,
			"tafsir": "This verse explains that after all the hypocrites donate their property to help the struggle of the believers, either because the property is surrendered with all their heart, in accordance with Allah's command for their own safety, or compulsorily, out of fear of the punishment that will come. befall them, but Allah will not accept them, because they still doubt the religion brought by the Great Prophet Muhammad and do not believe in the existence of retribution in the hereafter for all the deeds they have done in this world. Allah will accept any good practice if the practice is done not out of joy but out of sincerity and piety to Allah. The words of the Prophet Muhammad: Indeed, Allah swt will not accept deeds unless they are done sincerely and are intended solely for Allah's sake. (History of an-Nasa'i from Abu Umamah) Allah's Word: Indeed, Allah only accepts (charity) from those who are pious. (al-Ma'idah\/5: 27)"
		   },
		   {
			"id": 1289,
			"surah": 9,
			"ayat": 54,
			"tafsir": "This verse explains that what causes the hypocrites to not be accepted by Allah is because they continue to deny Allah and His attributes, deny the Messenger of Allah and the instructions and explanations he brought. Even if the hypocrites do pray, they do it lazily. If they pray in front of people, but if they are alone, the prayer is abandoned and not performed. They do not expect any reward from their prayer, they are not afraid of the punishment for leaving it. The prayers are performed not because they believe in their obligations, but because they are happy and want to be seen and known that they are also praying. If they donate their wealth to help the struggle of the Prophet and his companions, or other things, they spend it with a sense of compulsion, not willingly and sincerely, because they think that their assistance will harm themselves, on the contrary it will benefit other people. believer, while he is not among the believers."
		   },
		   {
			"id": 1290,
			"surah": 9,
			"ayat": 55,
			"tafsir": "This verse indicates that the believers should not be affected and fascinated by the abundant wealth and descendants that are their pride, because all that they are proud of will only add to the torment they will suffer in this world and in the hereafter. They painstakingly collect wealth, regardless of the methods taken. What is important for him is that as much wealth as possible can be collected in any way, even in a way that is not justified by religious teachings, because he thinks that abundant wealth will give them happiness in this world and in the hereafter. Apart from the torments experienced in this world, they also feel a very painful punishment at the end of their lives, because their lives will be revoked with difficulty and in a state of disbelief. Those who die in a state of disbelief, all their deeds and efforts will be in vain and perish, as Allah says: Thus their recompense is Hellfire, because of their disbelief. (al-Kahf\/18: 106)"
		   },
		   {
			"id": 1291,
			"surah": 9,
			"ayat": 56,
			"tafsir": "This verse explained to the Prophet Muhammad about the anxiety and anxiety of the hypocrites because they were afraid that their secrets would be known by the believers. Therefore they swear by the name of Allah to cover up the lie of their words that they are on the side of the believers. While they are essentially disbelievers, in fact they are always filled with doubts and anxiety. They always say something different from what is in their hearts because they are always in fear. Such is the behavior of the hypocrites when they meet believers, as Allah has explained in His word: And when they meet believers, they say, \"We have believed.\" But when they return to their demons (leaders), they say, \"Surely we are with you, we are only making fun.\" (al-Baqarah\/2: 14)"
		   },
		   {
			"id": 1292,
			"surah": 9,
			"ayat": 57,
			"tafsir": "This verse explains that the hypocrites do not want to associate with the believers because they are afraid and worried that their hypocrisy will be discovered, especially if they are invited to fight alongside the believers. Therefore, if they had found a place of refuge in the form of forts, caves in the hills or ditches to protect themselves from the vengeance of the believers, they would have run to hide in those places because they realized that one day their hypocrisy would also be discovered. ."
		   },
		   {
			"id": 1293,
			"surah": 9,
			"ayat": 58,
			"tafsir": "Sabab Nuzul: Abu Said al-Khudri narrates that when Rasulullah saw was distributing alms, came Ibn Zi al-Khwaisirah at-Tamimi, he said, \"Do justice O Messenger of Allah.\" The Prophet replied, \"Woe to you! Who else will do justice if I am not fair?\" Umar said, \"Let me cut his neck!\" The Prophet replied, \"Let him have many friends. Some of you insult his prayers with your prayers, his fast with theirs. Leaving religion is like an arrow leaving its bow.\" Then come down this verse. (History of al-Bukhari). This verse explains that there were some hypocrites who criticized the Prophet Muhammad regarding his wisdom in distributing zakat to those who deserved it. In an effort to hinder the development of Islam, they fabricated false accusations that they leveled at the Prophet Muhammad with the aim of influencing Muslims who were still weak in faith. They accuse the Prophet Muhammad of not being fair, one-sided, and favoritism in distributing zakat. Those hypocrites if they are given zakat by the Prophet, they accept it and are silent even though they are not among those who deserve it because they only pretend to be poor and when they are not given zakat because they are not among those who are entitled to receive zakat, they immediately became angry and made accusations against the Prophet. Such an attitude shows that they are only thinking about their own interests. Such is the behavior of the hypocrites."
		   },
		   {
			"id": 1294,
			"surah": 9,
			"ayat": 59,
			"tafsir": "If they truly believed in Allah, surely they would not criticize or make accusations against the Messenger. They should be pleased and grateful to Allah for the distribution of the assets, both regarding the distribution of spoils and zakat. They believe that Allah is a place to ask and who will give mercy and sustenance to His creatures."
		   },
		   {
			"id": 1295,
			"surah": 9,
			"ayat": 60,
			"tafsir": "The sadaqah referred to in this verse is the obligatory sadaqah known as zakat as an obligation from Allah to Muslims who have fulfilled the requirements to issue zakat obligations, in order to maintain the benefit of the people. Regarding the stipulation of zakat, it is stated in the word of Allah: Take zakat from their property, in order to clean and purify them. (at-Taubah\/9: 103) Thus it is clear that zakat is prescribed to cleanse oneself from assets that may be obtained in an unreasonable way, encouraging their owners to be grateful to Allah for the sustenance He has given. According to Imam Syafii, those who are entitled to receive zakat in this verse are as follows: First: Poor people, namely people who have insufficient wealth and livelihood and do not beg, according to Imam Syafii. Second: Poor people, namely people who have wealth or a livelihood but are not sufficient for their needs so begging lowers self-esteem, according to Imam Syafii. According to Imam Abu Hanifah, poor is what is said to be poor according to Imam Syafii's understanding, and according to Imam Syafii, what is said to be poor is poor according to Imam Abu Hanifah. Third: People who become amil zakat, namely people who are assigned to collect, manage and store zakat assets, both those who are in charge of collecting or storing zakat assets as treasurers and as administrators of bookkeeping administration, both regarding receipt and distribution (distribution). . This amil group receives the distribution of zakat as a reward for their work. Mentioned in a history: Ibn as-Sadi al-Maliki said, \"Umar appointed me as a zakat collector. After finishing and I handed over to him the collected zakat, he ordered that I be given a share, then I said, that I did it because of Allah , then he replied, 'Take what has been given to you, that I was amil zakat at the time of the Prophet, then the Messenger of Allah gave me a wage, then I answered as you answered, then the Messenger of Allah said to me: \"If you are given something without asking, then eat (accept) and give alms.\" (History of Ahmad, al-Bukhari and Muslim). Fourth: Converts, namely people whose hearts need to be comforted so that they enter Islam firmly or people who are feared to be hostile and disturbing Muslims or people who are expected to provide assistance to the Muslims. There are three groups of converts: a. The group of influential and expected disbelievers (in Islam) as the Prophet Muhammad's treatment of shafwan bin Umayah during the conquest of Mecca. The Prophet gave security to Shafwan with the intention that he could feel the goodness of Islam. The Prophet also gave him a camel along with what was on the camel's back so finally Shafwan was attracted to Islam with awareness. He said, \"Indeed Muhammad gave me a lot when I saw him as the human being I hated the most, so that by treating me kindly Muhammad became in my view the human being I love the most.\" Thus Shafwan finally became a good Muslim. b. Groups of poor infidels then convert to Islam until their faith is solid. To stabilize and strengthen their faith, the Prophet once gave some of the spoils of war to those who were still weak in faith from among the Meccan experts even though some of them were hypocrites. c. The Muslim group who live in border areas with infidels. They are given zakat because it is hoped that they will be vigilant in defending Muslim areas and paying attention to enemy movements. Fifth: For efforts to liberate slavery. In a wise way Islam eradicate slavery. In the context of freeing slaves, funds are provided taken from zakat which are used to buy slaves and set them free or given to a slave who has received a guarantee from his master to release himself by paying the specified amount of property. Slaves like this are called \"mukatab\". Like people held hostage, workers accused of murder can be freed with money. Al-Bara' bin 'Azib said, \"A man came to the Messenger of Allah and said: \"Show me the deeds that bring me closer to heaven and keep me away from the fires of hell.\" So the Messenger of Allah replied, \"Free the slave or try to free him.\" The man said, \"O Messenger of Allah, aren't the two things one (similar)?\" The Prophet replied, \"No, freeing a slave is that you alone free him, while releasing a slave is that you help pay the price (the ransom).\" (History Ahmad and al-Bukhari from al-Barra' bin 'Azib). Sixth: People who owe. This group consists of two levels: a. People who owe to meet their daily needs in a way that is not immoral. They are entitled to receive zakat if they do not have the ability to pay the debt that is dependent on them. b. Those who owe it for the public interest. They are entitled to receive zakat even though they are rich people. Seventh: Sat illah. The word \"sabilillah\" has two meanings. First, the special meaning, that is, people who voluntarily join the army to carry out jihad, defending Allah's religion against unbelievers who disturb the security of Muslims. Second, the general meaning, namely all actions of a social nature aimed at obtaining the pleasure of Allah, such as: the provision of public facilities, scholarships for education, and for da'wah. The scholars of the four schools of thought adhere to the first meaning, but some scholars hold a position that includes a special understanding and a general understanding on the basis of the ushul fiqh rules. On this basis, the construction or maintenance of mosques and madrasas as well as for the activities of scholars and preachers can be taken from zakat assets. Eighth: Ibnu Sabil. A person who is a traveler who needs help even though he has wealth in his country. To such a traveler this can be given assistance from zakat assets even though his trip is as a tourist as long as he does not aim to cause immorality from his trip. The eight groups are Allah's provisions that must be guided by Muslims. Allah is All-Wise, All-Knowing who among them is able and who needs help. provisions and instructions addressed to people who are able so that their souls become clean and grateful to Allah for the blessings given to them. The eight groups described in this verse can be divided into two groups: a. First, those who receive zakat directly become private property, they are the poor, amil, debtors, converts and travelers. This zakat given to them is their property. b. Second, the group that receives zakat for the public interest. This group is in the form of agencies and bodies, consisting of: 1. Fi ar-Riqab, namely efforts to free slaves. The amil zakat agency directly or through the intermediary of certain organizations can buy all the slaves who will be sold by their owners or who are in slave markets to be freed. 2. Fi Sabilillah, namely all general religious interests as explained above. Some commentators who are supported by Fiqh scholars view that only out of these eight groups, four groups are included in the first group, namely: the poor, the amil, and the converts. While the last four groups, namely: freeing slaves, freeing debts for the public interest, fi sabilillah and ibn sabil are included in the second group, namely for the public benefit."
		   },
		   {
			"id": 1296,
			"surah": 9,
			"ayat": 61,
			"tafsir": "Sabab Nuzul: According to the history of Ibn Abi Hatim from as-Suddi, once upon a time there was a meeting between hypocrites, among them Jullas bin Suwaid bin Samit, Mikhasi bin Umar and Wadiah bin crescent. Among them there were those who wanted to gossip about the Prophet, so some of them forbade it on the grounds that they were worried that it would reach the Prophet, and this would trouble them, then some of them said, \"Muhammad is too sure of whatever he hears as long as we swore to convince him,\" then this verse was revealed. This verse explains that among the hypocrites there are people who hurt the Prophet Muhammad. They gossiped about him and said that the Prophet was too quick to get carried away without thinking about and researching the truth of what he heard. Their accusations were based on the fact that the Prophet Muhammad's treatment of them was similar to his treatment of believers in general. Which shows that the Prophet could be influenced as he was affected by their words. On this basis they saw that there were weaknesses in the Prophet Muhammad and weaknesses like this if found in a ruler like a king, of course it would be very dangerous for the king and people who were good at fawning would gather around the king to influence his decisions. After Allah explained the assumptions that developed among the hypocrites, the Prophet Muhammad was ordered to listen to everything that was conveyed to him, but then proceed with research about the truth. This order was intended so that the Prophet Muhammad would not be deceived by people who wanted to curry favor or who were looking for faces. At the end of this verse, Allah explains the grievous doom that will be the punishment for the hypocrites who accuse the Prophet of unjust accusations. From a legal perspective, this verse prohibits harming the Prophet, both during his lifetime and after his death. Hurting the Apostle during his lifetime can be in the form of: a. Doubt his apostleship or consider him a sorcerer. People who hurt the Apostles like this are unbelievers because they deny their apostleship. b. Disturbing the peace of his household such as visiting too long or speaking in front of him in a loud voice. Work like this is unlawful as stated in the Qur'an. Allah's Word: Verily, that was to disturb the Prophet so that he (the Prophet) was ashamed of you (to send you out). (al-Ahzab\/33: 53) And His word: O you who believe! Do not raise your voice above the voice of the Prophet, and do not say to him in a loud voice as loud (voices) as some of you are against others, then all your deeds (rewards) can be erased while you are not aware. (al-hujurat\/49: 2) Hurting the Apostle after his death is the same as hurting him during his lifetime, such as gossiping about his parents and family or insulting and vilifying him. A person's faith in the Prophet creates a feeling of love for him. People who love something, of course, something they love is always looked upon with respect because it is considered noble."
		   },
		   {
			"id": 1297,
			"surah": 9,
			"ayat": 62,
			"tafsir": "Sabab Nuzul: Narrated by Ibn Mundzir from Qatadah about the reason for this nuzul verse, Qatadah said, \"We were told that a man from among the hypocrites said about a group that did not take part in the Tabuk War where special verses were revealed about them. The man said, \"By Allah that indeed those who do not participate in the war are the elect and noble people. If it were true what Muhammad said they would surely be worse than donkeys.\" The man's words were heard by a man from among the Muslims, then he said (in response to the hypocrites), \"By Allah, that what Muhammad said was is true and you are worse than a himar (donkey).\" The Muslim went to the Messenger of Allah to tell the incident then the hypocrites were brought to the Prophet and the Prophet said, \"What prompted you to say that?\" The hypocrite denied his words and cursed himself by swearing that he had never said that. The Muslim said, \"O my Lord, justify the truthful and lie the liar,\" then this verse came down. This verse describes the habits of the hypocrites as well as the -people who do something wrong, such as: stealing and killing They always feel in trouble because m They are always overshadowed by the consequences of their bad deeds that they have done, and they are afraid that their lies will be known by Muslims. They often swear as a way to cover up their crimes and lies. Such is the act of the hypocrites, they swear to convince the believers that what they say about their bad behavior, both against and against the Messenger of Allah, is not true. This is meant for the believers to admit that they are clean people from all accusations. They often swear with the intention of pleasing the Prophet and gaining the trust of the believers so that they receive protection from the believers; they should try to please God and His Messenger with true faith that is far from hypocrisy and doubt if they really want to be believers. Even though the believers can be convinced by swearing, and their lies are not exposed, Allah, the Almighty, still knows everything they do and what is still stored in their hearts. When benefit wills, Allah sends down revelations to the Apostles explaining everything they do."
		   },
		   {
			"id": 1298,
			"surah": 9,
			"ayat": 63,
			"tafsir": "The hypocrites should immediately realize because it is impossible for them not to know that making accusations against the Messenger such as accusations of cheating in distributing zakat or accusing the Apostle of being happy to hear reports without checking the truth is one of the acts against Allah and His Messenger. Such a person will be rewarded with hell fire, eternal in it. Punishment like this is a great humiliation that must be feared and shunned."
		   },
		   {
			"id": 1299,
			"surah": 9,
			"ayat": 64,
			"tafsir": "This verse describes the behavior of the hypocrites that was revealed in the Battle of Tabuk. They feel worried if a verse or surahh is revealed that explains everything they do. Because of that, Allah ordered the Prophet Muhammad to tell them to continue the ridicule they were doing. Hypocrites are human beings who have no stand, they are between faith and disbelief, they do not believe in the truth of the revelations revealed to the Messenger, they are between anxiety and hope. If they had denied the Prophet emphatically they would not have been worried. Likewise if they firmly believe in the Prophet. Because of their position between faith and disbelief and always criticizing and ridiculing the Prophet and the believers, their fear and anxiety arose lest Allah send down again verses that reveal their disgrace and explain everything that is in them even though they keep it hidden. their hearts."
		   },
		   {
			"id": 1300,
			"surah": 9,
			"ayat": 65,
			"tafsir": "Sabab Nuzul: The revelation of this verse is closely related to the Battle of Tabuk as narrated by Ibn Mundzir from Qatadah, when the Messenger of Allah saw a group of people in front of him saying, \"Does this man (Muhammad) expect to get palaces and forts in the land of Sham, impossible, impossible.\" Allah told His Prophet what the group of people were talking about, so Muhammad said, \"You have said such and such.\" They replied, \"O Prophet of Allah, we were just joking and playing,\" so this verse was revealed. This verse describes to the Prophet Muhammad about the behavior of the hypocrites. they are just joking around. They thought that the Prophet Muhammad could forgive and accept the excuses they put forward. But Allah ordered the Prophet Muhammad to tell the hypocrites that it is not right for them to mock Allah and His verses and His Messenger. Such actions transgress the limits and no one does it except those who disbelieve in Allah."
		   },
		   {
			"id": 1301,
			"surah": 9,
			"ayat": 66,
			"tafsir": "This verse explains that there is no point in them apologizing by making excuses like that in verse 65 because in fact the hypocrites had become disbelievers after believing, they mocked the Prophet and looked down on him. Such an attitude towards the Apostles shows the emptiness of their souls from the faith. They have committed a grave sin by intentionally insulting the Prophet and denying Allah. However, if the hypocrites wanted to repent on the encouragement of real faith, like Makhsyi bin Humair, Allah would have accepted their repentance and Allah would still punish the hypocrites who continue to wallow in hypocrisy."
		   },
		   {
			"id": 1302,
			"surah": 9,
			"ayat": 67,
			"tafsir": "This verse explains that there are similarities between hypocrites, both men and women, both regarding their characteristics and regarding their morals and actions. Each of them encourages the other to do evil as explained by the Prophet: There are three signs of a hypocrite: If he speaks a lie, when he promises he is reneged on, and when he is believed to be a traitor. (History of al-Bukhari and Muslim from Abu Hurairah). The hypocrites each forbade each other to do good things such as waging jihad and spending wealth for social charities, especially holy wars as Allah says: Those who say (to the Ansar), \"Do not give alms to the people ( Muhajirin) who were with the Messenger of Allah until they dispersed (left the Messenger of Allah).\" (al-Munafiqun\/63: 7) All of this is because they forget the greatness of Allah, forget the instructions of His religion and His torments. More specifically, they forget to draw closer to Allah by obeying His commands and avoiding His prohibitions, as it does not occur to their hearts to be grateful for the blessings that God has given them so that they follow the desires of their desires and the temptations of Satan. It is only natural that Allah forgets them by keeping them away from His taufik gifts in this world and rewards in the hereafter. Indeed, the hypocrites who remain in their hypocrisy are the most wicked human beings in this world and they are even lower than ordinary disbelievers, because disbelievers cover their hearts against oneness or the existence of God openly. This is different from the hypocrites who deliberately cover up mistakes regarding creed or morals and actions that deviate far from pure human nature by pretending to be believers."
		   },
		   {
			"id": 1303,
			"surah": 9,
			"ayat": 68,
			"tafsir": "This verse explains God's threat to hypocrites both men and women and His threat to unbelievers. Allah threatens them with the punishment of hell fire and they will live forever in it. They are cursed by God in this world and in the hereafter and they do not deserve God's grace. God's punishment continues to befall them, both physical punishment and mental torment that never ends. They cannot see Allah's face because seeing Allah's face is not permitted for those who deny it."
		   },
		   {
			"id": 1304,
			"surah": 9,
			"ayat": 69,
			"tafsir": "This verse explains that the hypocrites who hurt the Prophet Muhammad and the believers are no different from the hypocrites who lived in ancient times. If at the time of the Prophet Muhammad they were deceived by the wealth of the world and influenced by their children, then the hypocrites were similar in the past when they faced Allah's messengers. They have enough power, wealth and many children that cause them to be deceived by the delights of worldly life. They are always influenced by the desire to live luxuriously and want to be free to do whatever they want to satisfy their desires. The hypocrites in the past naturally did so because the factors that led them to crime were more because they had power and wealth. Unlike the case with the hypocrites at the time of the Prophet Muhammad, in addition to reduced strength and wealth, the factors that led them to do more good. All the actions of hypocrites, even if they are good deeds, will be in vain in this world and the hereafter because they do them without sincerity. They should be lucky people because they also do social charity, but they forget that for a good practice to be accepted it must be accompanied by honesty and sincerity. Their mistake is described in the word of Allah: Say (Muhammad), \"Do we need to tell you about the person whose deeds are the most to lose?\" (That is) people whose deeds in the life of the world are in vain, while they think they have done their best. (al-Kahf\/18: 103-104)"
		   },
		   {
			"id": 1305,
			"surah": 9,
			"ayat": 70,
			"tafsir": "In this verse, Allah denounces the hypocrites why they do not know the stories of ancient peoples such as the people of Noah, the people of 'Ad and Samud, the people of Abraham and the inhabitants of Madyan and the people of Lut. To them, Allah has sent His messengers who brought instructions from Allah, but they welcomed Allah's messengers with a defiant attitude, so that Allah sent down upon them the punishment like the typhoon that drowned the people of Noah, the wind that destroyed the people of 'Ad , and the lightning that destroyed the seas. This does not mean that God wronged them, because it is contrary to the nature of God's justice which never wrongs His servants, but they are the ones who wrong themselves because they do not heed God's instructions brought by His messengers. Sunnatullah will not change as Allah inflicts punishment on those who oppose His messengers in the past, surely in the present Allah will punish those who are guilty if they do not repent."
		   },
		   {
			"id": 1306,
			"surah": 9,
			"ayat": 71,
			"tafsir": "This verse explains that believers, men and women become defenders of one another. As a believer he defends other believers because of religious relations. Women, as believers, also defend their brothers and sisters among believing men because religious relations are in accordance with their female nature. The wives of the Prophet Muhammad and the wives of his companions went to war together with the Islamic army to provide drinking water and prepare food because the believers are bound to each other by a rope of faith that evokes a sense of brotherhood, unity, mutual love and mutual assistance. -help. All of this is driven by the spirit of loyal friends that makes them one body or one building that strengthens one another in upholding justice and exalting the Word of God. Many of the hadiths of the Prophet Muhammad express this characteristic of believers, among others, as he said: The parable of the believers in terms of loving each other, supporting and helping each other is like one body, when one member suffers, all members of the body feel a fever and no sleep. (History of al-Bukhari and Muslim from Numan bin Bashir). The nature of mutual defense is not found in hypocrites because they are filled with doubts and cowardice. This brotherhood among them is just a play of tongues as expressed in the word of Allah: Have you not seen the hypocrites who say to their disbelieving brothers among the People of the Book, \"Indeed, if you are driven out, we will surely go out with you; and we will never obey anyone for your sake, and when you are fought we will certainly help you.\" And Allah witnessed, that they really are liars. Truly, if they are driven out, the hypocrites will not come out with them, and if they are fought; they (also) will not help him; and even if they had helped him they would have turned and run backwards, then they would not have been helped. (al-hasyr\/59: 11 - 12) The characteristics of a believer differ from those of a hypocrite in the following matters: a. The believer always invites to do good and forbids doing evil, while the hypocrite always tells to do evil and forbids doing good. b. The believer prays solemnly with a sincere heart, while the hypocrite prays in a state of compulsion and ridicule. c. Believers besides giving zakat, their hands are always open to create the welfare of the people and make social contributions, while hypocrites are stingy, if they give zakat or alms out of joy not because of sincerity to Allah, as stated in the word of Allah: And what hinders their spending to be accepted is because they disbelieved (denied) Allah and His Messenger and they did not pray, but lazily and did not (also) spend their (wealth), but reluctantly (forced). (at-Taubah\/9: 54) d. Believers always obey Allah by leaving immoral acts and carrying out all commands according to their ability while hypocrites continue to commit immoral acts. The end of this verse emphasizes that Allah will surely bestow His blessings both in this world and in the hereafter on the believers while in the previous verses Allah cursed the hypocrites and threatened them with hell fire. Truly Allah is Mighty, no one can resist His torment. He is All-Wise bestowing His grace and gifts upon those whom he wishes according to the deeds he has done."
		   },
		   {
			"id": 1307,
			"surah": 9,
			"ayat": 72,
			"tafsir": "In this verse Allah promises the believers both men and women to get heaven as a reward for their good deeds. Heaven is a beautiful garden full of pleasures that eyes have never seen and ears have never heard of and have never even crossed the heart. Everything that is seen and heard is so foreign and new that it is difficult to describe it because there is no comparison in the world. Gardens shaded by trees through which flow a river which does not resemble the rivers of this world neither in color nor in taste; those who live in it will remain forever; the words of the Prophet explain about heaven: In heaven there are a hundred levels. Allah provides it for those who strive to uphold the religion of Allah. The distance from one level to another is like the distance between heaven and earth. If you ask Allah, ask for paradise, because this is the best and highest heaven from which the rivers of heaven flow and above the Throne of God. (History of al-Bukhari and Muslim from Abu Hurairah). Humans consist of body and spirit. Heaven with all its contents gives the highest pleasure to the body, and Allah's pleasure gives the highest pleasure to the human spirit. These two types of favors are God's gifts that He promised to believers, both men and women. This is the grace of Allah which is a great and incomparable victory that cannot be achieved except by those who believe and do good deeds."
		   },
		   {
			"id": 1308,
			"surah": 9,
			"ayat": 73,
			"tafsir": "This verse contains an injunction to the Prophet Muhammad to wage jihad against unbelievers and hypocrites and treat them harshly. Carrying out jihad against unbelievers is with the sword, while waging jihad against hypocrites is to awaken them as well as possible by presenting the necessary proofs. Unbelievers like the Jews hurt the Prophet in a way that hurt their feelings; they said greetings to the Prophet by changing the word \"Assalamualaikum\" to \"Assamulaikum\", a sentence which means \"Also death to you\" and the Prophet would have replied with the words: \"Waalaikum\" which means \"Also death to you\". In addition, they often violate agreements. Against the hypocrites the Prophet always treated them gently as well as treating the believers. But on the other hand, the hypocrites always hurt the Prophet, for example by launching accusations which stated that the Prophet was favoritism in dividing the spoils of war and zakat. The Prophet easily believed in reports without being examined and so on which meant to ridicule the Prophet. Therefore, Allah ordered the Prophet Muhammad to act tough on them with the intention of teaching them a lesson in the hope that they would become aware. The tough attitude that the Prophet carried out was a strategy arranged by Allah and in fact it worked. With such treatment many disbelievers and hypocrites repented and returned to faith. But for people who are still not aware because they are drifting and drowning in hypocrisy or disbelief, their place is hell forever, the worst place in the hereafter."
		   },
		   {
			"id": 1309,
			"surah": 9,
			"ayat": 74,
			"tafsir": "Sabab Nuzul: Narrated by Ibn Jarir ath-thabari and ath-thabrani and Abu Shaykh Ibn Mardawaihi that when the Messenger of Allah was sitting in the shade of a tree he said, \"A human will come to you who will look at you with two eyes like the eyes of a devil. If he come, don't say a word.\" Then suddenly a man appeared whose eyes were sky blue and the Prophet called him and said, \"On what basis did you and your friends curse me?\" Then the man left and then came back with his friends, swearing by Allah that they never said what the Prophet asked; then the Prophet forgave them then this verse was revealed. Those hypocrites swear by the name of Allah to convince the believers and the Prophet Muhammad, that what was reported to the Prophet about deceit \"which lowers the dignity of the Prophet Muhammad, or reduces the glory of Allah swt\" that they say is not true and is a sheer slander. They do not admit to having uttered kufr words against the Prophet Muhammad. Allah belied their statement even though they swore by the name of Allah. Those who have uttered the words of kufr mean that they have apostatized and become disbelievers again after Islam because they have exceeded the limit to destroy the Prophet. The intention of those who failed to trap the Prophet when he returned from the Battle of Tabuk was when the Prophet headed for Medina. On the way, some hypocrites conspired to harm the Prophet. They made a secret decision to throw the Prophet from one of the hills. When they reached the hill they waited for the Prophet's arrival. When the Prophet came to them (who were waiting for) the Prophet to be informed about their plan, the Prophet said, \"Whoever among you wants to take the valley road, that is more pleasing to you.\" Rasulullah himself took the road up the hill and the rest of the group took the valley road except for those who had intended to commit treason against the Prophet. When they heard that the Apostle was going to take the hill road, they got ready and disguised themselves by covering their faces. Indeed, they have made up their mind to commit an abomination. The Prophet called on Hudhaifah al-Yamani and Ammar bin Yasir to walk with the Messenger of Allah, Ammar was assigned to hold the camel's rope and Hudhaifah al-Yamani was assigned to chase the camels away. Under these circumstances, the Prophet, Ammar and Hudzaifah suddenly heard the sound of people's feet coming from behind, so the Messenger of Allah became angry and assigned Hudzaifah to detain them. After Hudzaifah saw Rasulullah angry, she turned around, while in her hand was a stick. Hudzaifah confronted the men and hit their vehicle with a stick. Hudzaifah saw the people disguised which Hudzaifah thought was just a normal act done by people who were on their way (travelers). When the people saw Hudzaifah, Allah made them fearful because they thought that their disguise and evil intentions had been discovered. Because of that the gang soon rejoined the group. Hudzaifah returned to meet the Messenger of Allah, then the Apostle ordered Hudzaifah to whip her camel, and told Ammar to walk behind so that the Messenger of Allah could cross the hill safely. Then the Prophet said to Hudzaifah, \"Do you know any of the riders?\" He replied, \"I know So and So's camel. The night was too dark and I came to them where they were dressed in disguise.\" Rasulullah said, \"They have planned a plot to walk with me and when they come to the hill, they will throw me.\" Hudzaifah said, \"Didn't you (O Messenger of Allah) give an order in which we would quickly behead them?\" Rasulullah replied: No, I do not want to be the fruit of people's talk that Muhammad had killed his friends. (Tafsir Ibnu Kasir, 2\/461) So the Prophet told Hudzaifah and Ammar the names of the conspirators so that they would both keep it secret. Such are the evil events committed by the hypocrites revealed by the verse. The hypocrites are Muslims whose faith is only outwardly and not inwardly. They are hostile to the Apostles and the believers in a very cunning way as enemies in blankets. They are very dangerous for Islam. However, the Prophet treated them as he would treat believers because faith is in the heart. Matters of the heart only Allah knows. Therefore a sentence can only be decided on the basis of existing birth evidence. The hypocrites are treated like the believers. Zakat is given to them as well as spoils (ganimah). Most of them are from among the less able (poor) people like the Ansar people. By converting to Islam they can enjoy the treasures of this world. Supposedly, if they were conscious people, of course they would put off their hypocrisy and thank God by repenting to Him. Because with Islam they get worldly benefits, which is the goal of their life. But they didn't notice. They even feel dissatisfied with receiving profits and wealth which are gifts from Allah from the distribution of spoils (ganimah) or zakat. Such is the condition of a person whose mind has gone astray. If they repent from their hypocrisy and bad deeds, whether in words or deeds, then their repentance will bring good to them in this world and in the hereafter. In the world they will be true Muslims with pure faith. They will be people who put their trust in Allah and are patient with His trials and do a lot of good deeds to achieve happiness in the hereafter and they will work hand in hand, help each other, politely sympathize with those who first converted to Islam. In the afterlife they will receive Allah's gift of heaven as promised by Allah to the believers. However, if they do not repent, turn away from Allah's guidance, and they remain in hypocrisy, surely Allah will punish them in this world as their hearts are always in anxiety, restlessness and worry as expressed in the word of Allah: If only they find shelter, caves or holes (in the ground), surely they will go (run) there as quickly as possible. (at-Taubah\/9: 57) In the afterlife they will get what Allah has threatened, namely the fire of hell at the lowest level where they live eternally in it as stated in the word of Allah: Indeed, the hypocrites are (placed) on the level the bottom of hell. And you will find no helper for them. Except for those who repent and improve themselves and hold fast to Allah's (religion) and sincerely (practice) their religion for Allah's sake. So they are with those who believe and later Allah will give a great reward to those who believe. (an-Nisa'\/4: 145-146) At the end of this verse, Allah confirms that the hypocrites will not find defenders in this world and in the hereafter, because for everyone who has received humiliation from Allah, no human being can help him. ."
		   },
		   {
			"id": 1310,
			"surah": 9,
			"ayat": 75,
			"tafsir": "This verse describes the nature of hypocrites who like to make promises with grandiose promises, dare to swear by the name of Allah to strengthen their promises. They promised to be generous, generous and good people. But they easily broke their promise. Actions like this will be found in a handful of humans at any time and anywhere."
		   },
		   {
			"id": 1311,
			"surah": 9,
			"ayat": 76,
			"tafsir": "In this verse, Allah explains that if their intentions have succeeded and what they asked for has been granted, they are not shy about turning away, denying their promises, and disobeying Allah. When they are rich, they don't become generous people, but they grow stingy, don't want to give alms, give zakat, help people who are lacking, support the development of the people and other things that are good deeds. They forgot their promises made before God gave them gifts, even though they had been warned many times. Even though keeping the promise is mandatory, especially if the promise is strengthened by swearing in the name of Allah."
		   },
		   {
			"id": 1312,
			"surah": 9,
			"ayat": 77,
			"tafsir": "In this verse Allah explains that the actions of such hypocrites will not be profitable, but will harm themselves. The act of breaking promises, being miserly, turning away from Allah and disobeying Him will have the result of adding to the disease of hypocrisy nesting in their hearts. Such an illness would drag on until the end of his life. Because if the disease of hypocrisy gets worse, there is no hope for them to repent. It has become the Sunnah of Allah on this earth, that a person who has become accustomed to breaking promises and lying a lot, then the disease of hypocrisy is increasingly imprinted in him. Likewise, if he accustoms himself to doing good deeds, has good morals, and obeys worship, a strong faith will be instilled in him. Therefore, Allah swt orders Muslims to be careful of hypocrisy. If you promise and are strengthened by mentioning the name of Allah, then try to keep the promise. The Messenger of Allah (peace be upon him) has said. A person is considered a hypocrite, if there are three kinds of characteristics in him, even though he prays, fasts and claims to be a believer, that is, when he speaks he lies, when he makes a promise he breaks it, and when he is trusted he betrays. (Al-Bukhari's history from Abu Hurairah)"
		   },
		   {
			"id": 1313,
			"surah": 9,
			"ayat": 78,
			"tafsir": "In this verse, Allah SWT warns the hypocrites that no matter how smart they are, they keep secrets in their hearts and no matter how cunning, they whisper bad things about the believers and badmouth the Messenger of Allah or whisper against each other to plot bad tactics against people. -those who believe, but Allah swt will know it. Nothing is hidden from Allah whatsoever, whether on earth or in the sky, as well as that which is hidden in the heart, Allah is All-Knower of all that is hidden."
		   },
		   {
			"id": 1314,
			"surah": 9,
			"ayat": 79,
			"tafsir": "Sabab Nuzul: There are several narrations that explain the reason for the revelation of this verse, among them is as narrated by al-Wahidi in the book Asbab an-Nuzul: narrated by al-Bazzar from Abu Hurairah, he said: Rasulullah saw said, \"Give charity , actually I will send an army to go to war (Tabuk War),\" then Abdurrahman bin Auf came to the Messenger of Allah and said, \"O Messenger of Allah, I have 4 thousand dinars, of which two thousand I give as my loan to God and two thousand more dinars for my household purchases.\" The Messenger of Allah replied, \"May Allah bless you for your gift, and bless what you left behind.\" Then another person from the Ansar who had two bushels of dates came, saying, \"O Messenger of Allah, I have two bushels of dates, I give one bushel in charity and another bushel for my family.\" Witnessing this incident, the hypocrites mocked him and said, \"Abdurrahman bin Auf only wanted to give alms for fun.\" While those who gave a bushel of dates, they scoffed with the words, \"Allah and the Messenger do not need this bushel.\" Then come down this verse. In this verse, Allah SWT explains how the hypocrites ridicule and humiliate the believers who obediently give their alms to the Messenger of Allah to fund the Islamic army to fight. To those who give a lot, they mock with joy and to those who give little, they are also contemptuous, even though the believers give alms, is with a sincere heart solely because Allah expects Allah's pleasure. The ridicule and humiliation of hypocrites like that does not reduce the spirit of the believers to fight, even they themselves will be harmed. Allah swt will insult and ridicule them and they will be provided with a painful punishment in the hereafter."
		   },
		   {
			"id": 1315,
			"surah": 9,
			"ayat": 80,
			"tafsir": "Sabab Nuzul: From Urwah ra that 'Abdullah bin Ubay said, \"If you don't give charity to Muhammad and his companions, surely they will leave him.\" 'Abdullah said, \"The noble ones certainly drive out the weak.\" So Allah sent down, \"Do you ask forgiveness or not for them?\" The Prophet said, \"I will increase it seventy times.\" So Allah sent down, \"It's the same to them whether you ask for forgiveness or not, Allah will not forgive.\" This verse contains a warning, specifically addressed to the Prophet Muhammad and generally addressed to believers. The attitude of the hypocrites towards the Prophet and the believers cannot be expected. They will remain in hypocrisy until death. There is no benefit, asking forgiveness for them or not asking for forgiveness, because Allah will not forgive their sins. Even if they are repeatedly asked for forgiveness, even up to seventy times, it will not work, because what causes them to be hypocritical is their disobedience to Allah and the Messenger. They do not believe that Allah knows all that is unseen, they do not believe in Allah's revelations conveyed to the Prophet Muhammad, about the Day of Resurrection, the Day of Resurrection and the Day of Judgment. They are not only classified as hypocrites, but also classified as wicked people, that is, they do not want to accept the truth and are constantly disobedient, doing things that are out of bounds. So Allah will not guide the wicked."
		   },
		   {
			"id": 1316,
			"surah": 9,
			"ayat": 81,
			"tafsir": "This verse describes the condition of the hypocrites who were not accompanied by the Prophet to fight. This event occurred during the Tabuk War, the war that occurred after the conquest of Mecca. This war was the last war the Prophet did. There were people who conveyed the news to the Prophet that the Roman Empire had prepared its army to attack the Muslims on the northern border of Arabia. At that time it was a very hot summer, the distance from Medina to the border was very far. The difficulties and hardships on the way are many. While at that time the Muslims were in a situation of complete deprivation. Rasulullah began to prepare soldiers to go to face the army of the Roman empire. To the rich people Rasulullah SAW asked for help for provisions in war. Then came help in the form of money and goods from wealthy and philanthropists sincerely, because they wanted to exalt Allah's word above the surface of the earth. All the tribes that have embraced Islam have declared their obedience to participate in the war with the Prophet Muhammad. They have prepared themselves and their wealth for war. They are not afraid of the scorching heat of the sun, not afraid of hunger and thirst in the journey across the desert that is very far away, to attack the enemy's anger. Finally the Prophet was able to gather his army perfectly as many as 30,000 people, of whom there were about 10,000 horsemen. Rasulullah SAW knew that 'Abdullah bin Ubay, the leader of the hypocrites, together with his followers, also participated in that generation. Because of this, the Prophet (PBUH) doubted the good faith of the hypocrites, fearing that they would cause trouble on the way, so the Prophet (PBUH) ordered them to stay in Medina and not join the war. They are what is meant in this verse, that they feel happy and fortunate not to have been included by the Messenger of Allah to fight in Tabuk. Actually their hearts do not want to fight, either with their wealth or with themselves to uphold the religion of Allah. Not even scratched in their hearts, that participating in war is a great advantage. But they do otherwise; they disrupt and weaken the fighting spirit of the Muslims. They told their friends not to join the war. All difficulties, such as heat and heat, long journeys, lack of supplies and so on, they have always used as propaganda tools to hinder the Muslims from going to war and to quell the fighting spirit. But all of this did not weaken the spirit of the Muslims, instead it added enthusiasm and strength, so that finally the Muslims returned from the Tabuk war safely, after the enemy withdrew in fear, the Prophet was told to convey to the hypocrites, that the fires of Jahannam were what they would suffer. later hotter if they want to understand."
		   },
		   {
			"id": 1317,
			"surah": 9,
			"ayat": 82,
			"tafsir": "This verse explains that the hypocrites should cry more than laugh thinking about their fate and sins in this world and in the hereafter because they will receive a painful punishment, according to their actions in this world. In the world they get humiliated and lose because of their own actions, namely insulting and ridiculing the believers, making rotten propaganda to hinder Muslims and break the spirit of struggle. While in the afterlife it will bring a lot of sins and will not be forgiven by Allah swt. This is also in accordance with the words of the Prophet addressed to the believers. The Messenger of Allah (peace and blessings of Allah be upon him) said: If you knew what I know, you would laugh little and weep much, expand hypocrisy and disappearance of trust, revoke mercy, people who are honest accused and people who cheat trusted. Riots gripped you, slander gripped you, the situation became dark like a pitch black night. (History of al-hakim from Abu Hurairah)"
		   },
		   {
			"id": 1318,
			"surah": 9,
			"ayat": 83,
			"tafsir": "In this verse, Allah SWT gives a warning to the Prophet to be careful of hypocrites when they have returned from the Battle of Tabuk. The hypocrites would plan to apologize to Rasulullah SAW and express their regret for not being able to join the fight with the Prophet to Tabuk. Though they feel lucky not to join the war to Tabuk and avoid danger. But after the Prophet Muhammad and the Muslims returned from the battlefield safely, they felt ashamed and humiliated, and promised in their hearts they would fight with the Prophet. So Allah swt reminded the Prophet that the hypocrites should not be given permission to participate in the war because they would not be honest in battle. They will definitely take various actions to undermine the Prophet and the Muslims. Therefore the Prophet was ordered to state emphatically that they were not justified in fighting with the Prophet forever. They will not be able to fight the enemy with the Messenger of Allah like the Muslims who are willing to sacrifice their wealth and lives to fight fisabilillah. Their attitude towards the Battle of Tabuk showed that they preferred not to participate in the war and to remain in Medina with the elderly, such as children, women and the elderly who were weak."
		   },
		   {
			"id": 1319,
			"surah": 9,
			"ayat": 84,
			"tafsir": "In this verse, Allah SWT forbids praying on the bodies of hypocrites. Also forbids praying over his grave after being buried, as the Prophet used to do for believers who had been buried as mentioned in the following hadith: It was the Prophet when, after burying a body, he stood at the grave saying, \"Ask forgiveness for your brother pray that he will remain (in the faith) because now he is being asked.\" (Narrated by Abu Dawud and al-Bazzar from 'Uthman) The incident that happened to 'Abdullah bin Ubay was enough to shake the other hypocrites, an insult that was heavy enough to be inflicted on them. But they still remain in their hypocrisy. This is a punishment for those in this world, because they always disobey Allah and His Messenger. They belong to the wicked, too daring to play with God's commands and prohibitions. (85) This verse reads almost the same as verse 55 in this surah. So in this verse Allah swt repeats again, so that Muslims do not get influenced by the wealth and property of these hypocrites. Similarly, do not be influenced by their children. If any of them are rich, have lots of wealth, have many children and offspring, all of that will not make them happy and will not save them from Allah's torment. All of that will trouble them, make them suffer and suffer because of it. How did they bother to find the treasure and wealth, so they were made difficult by it. There are events that occur because of their wealth and wealth, and their children are enough to make them feel as if they are getting the punishment of the world. So their wealth and wealth and their children will no longer be a blessing, but a punishment for them. They will not get the slightest help from their wealth and children. There is no benefit at all, and eventually they die in disbelief."
		   },
		   {
			"id": 1320,
			"surah": 9,
			"ayat": 85,
			"tafsir": "This verse almost coincides with verse 55 in this surahh. So in this verse Allah swt repeats again, so that Muslims do not get influenced by the wealth and property of these hypocrites. Similarly, do not be influenced by their children. If any of them are rich, have lots of wealth, have many children and offspring, all of that will not make them happy and will not save them from Allah's torment. All of that will trouble them, make them suffer and suffer because of it. How did they bother to find the treasure and wealth, so they were made difficult by it. There are events that occur because of their wealth and wealth, and their children are enough to make them feel as if they are getting the punishment of the world. So their wealth and wealth and their children will no longer be a blessing, but a punishment for them. They will not get the slightest help from their wealth and children. There is no benefit at all, and eventually they die in disbelief."
		   },
		   {
			"id": 1321,
			"surah": 9,
			"ayat": 86,
			"tafsir": "This verse explains how weak the faith of the hypocrites is and how cowardly they are. Not only in ordinary people, but also in rich people. If there was a surahh whose verses commanded people to believe and wage jihad with the Prophet, rich people from among them rushed to the Prophet to ask permission not to join the jihad and fight. They are not ashamed to make up contrived reasons to strengthen their request to Rasulullah saw, even though they are capable and strong for jihad in terms of health and ability. Lightly, they said let us stay at home with weak people who did not participate in the war. Such ways show that they love their pleasures and possessions more than they love Allah and His Messenger. This similar thing is also explained by Allah SWT in His word: And those who believe say, \"Why wasn't there a surah (regarding the order of jihad) that was sent down?\" So if there is a surah sent down which has a clear meaning and in it (orders) war, you see those who have a disease in their hearts will look at you like the gaze of a person who has fainted for fear of death. But it is more appropriate for them.\" (Muhammad\/47: 20)"
		   },
		   {
			"id": 1322,
			"surah": 9,
			"ayat": 87,
			"tafsir": "This verse explains that the hypocrites are happy not to participate in the fisabilillah jihad. They prefer to live with weak people who are not strong enough to go to war, namely women who look after the household. They were not in the least ashamed to live with those women who had not participated in the war. Though they are people who are strong, healthy, and able to participate in war. Even though many mocked and laughed at them, the ridicule meant nothing to them, because the feeling of shame for them no longer existed. That is a sign that their faith is very weak and their hearts have been influenced by material things. Therefore, God closed their hearts dead, they do not want to accept the truth, lessons and advice from anyone. The disease of hypocrisy has covered their whole heart, so that they cannot use a sound mind to distinguish between what is right and what is wrong, what is profitable and what is harmful, that participating in jihad and fighting is an advantage and staying at home is a disadvantage. and embarrassing."
		   },
		   {
			"id": 1323,
			"surah": 9,
			"ayat": 88,
			"tafsir": "In this verse Allah explains the vast difference between the characteristics of the Messenger and those who believe on the one hand and the characteristics and behavior of the hypocrites on the other. Apostles and believers, happy and excited to wage jihad and fight with their wealth and themselves to defend and elevate the words of Allah to spread His religion on the surface of this earth. They love Allah more than they love their wealth and themselves. Their belief is that one should live a noble and honorable life and if one dies, one should die a martyr on the battlefield. In the hearts of believers there will not be laziness, reluctance to fight and miserly in giving wealth in jihad fisabilillah. They believe that jihad fisabilillah will bring a lot of good to them and the Muslims. The many good things are in the form of victory, the high sentence of Allah, the upholding of justice and truth, in addition to getting spoils, and the extent of Islamic rule on the surface of the earth. Also they believe, that they will get happiness in this world and in the hereafter. In the world he becomes a noble and honorable person, while in the hereafter he will be rewarded with heaven Jannatunnaim, which is full of eternal pleasures and pleasures. In it flowing rivers are soothing. Pleasure and abundant happiness is given by Allah to the believers."
		   },
		   {
			"id": 1324,
			"surah": 9,
			"ayat": 89,
			"tafsir": "In this verse Allah explains the vast difference between the characteristics of the Messenger and those who believe on the one hand and the characteristics and behavior of the hypocrites on the other. Apostles and believers, happy and excited to wage jihad and fight with their wealth and themselves to defend and elevate the words of Allah to spread His religion on the surface of this earth. They love Allah more than they love their wealth and themselves. Their belief is that one should live a noble and honorable life and if one dies, one should die a martyr on the battlefield. In the hearts of believers there will not be laziness, reluctance to fight and miserly in giving wealth in jihad fisabilillah. They believe that jihad fisabilillah will bring a lot of good to them and the Muslims. The many good things are in the form of victory, the high sentence of Allah, the upholding of justice and truth, in addition to getting spoils, and the extent of Islamic rule on the surface of the earth. Also they believe, that they will get happiness in this world and in the hereafter. In the world he becomes a noble and honorable person, while in the hereafter he will be rewarded with heaven Jannatunnaim, which is full of eternal pleasures and pleasures. In it flowing rivers are soothing. Pleasure and abundant happiness is given by Allah to the believers."
		   },
		   {
			"id": 1325,
			"surah": 9,
			"ayat": 90,
			"tafsir": "These verses also explain how the condition of the hypocrites who live outside the city of Medina who live in villages inhabited by the desert people who are usually called Bedouin Arabs. They deliberately came to the Prophet to put forward reasons so that the Prophet was willing to give permission not to join the war. This incident is explained in a history told by someone named adz-ahhak, namely: \"There was a group of Bedouins from the Amir bin thufail class who came to the Prophet and said, \"O Prophet of Allah, we are not fighting with you, we are worried, in case our women, our children, and our livestock have been destroyed and robbed by the criminals.\" So the Messenger of Allah replied, \"Allah has already informed me about your situation; may Allah forgive and save you.\" The various reasons they put forward to the Messenger of Allah, there were reasons that were made up and there were real reasons so that they were given permission not to participate in the war. Those who came to the Messenger of Allah by stating the real reasons were among the believers, and those who came with trumped-up excuses were from the class of hypocrites. There was another group, namely those who did not come to the Prophet to ask permission. They deliberately sat and stayed in his house, do not want to participate in jihad and war. These people are clearly among those who deny Allah and His Messenger. They are hypocrites who are already serious and very dangerous. In Umar bin Ala''s opinion, it is good for those who ask permission by stating good reasons. made up, or those who stay at home, do not want to join the jihad and fight, the two groups are equally ugly and a-sama dangerous. Both of these groups are included in the disbelievers who will receive a painful punishment from Allah, both in this world and in the hereafter."
		   },
		   {
			"id": 1326,
			"surah": 9,
			"ayat": 91,
			"tafsir": "Sabab Nuzul: There are several narrations that explain the reason for the revelation of this verse. Among the narrations explained by Ibn Abi Hatim from Zaid bin Sickle he said, \"I am the author of the revelation that was revealed to the Messenger of Allah. When I wrote surah Baraah, then I put the pen over my ear, then came the revelation that ordered us to fight. When The Messenger of Allah paid attention to the revelation that was revealed to him, suddenly a blind man came, saying, \"O Messenger of Allah, how can I join the war, while I am blind,\" then this verse was revealed.\" In this verse it is explained, those who are allowed not to join the war are free from the obligation to join the war. These are not included as people who are guilty or innocent for abandoning the obligation to fight if they really have justifiable reasons, and those reasons are stated honestly and sincerely, namely: 1. Weak people, namely people who are physically weak which makes it impossible for them to participating in war, such as elderly people, women and children, as well as people with disabilities, such as blind, deaf, crippled, broken, and so on. 2. Sick people who cannot possibly join the war. But when they recover they are obliged to join the war. 3. Poor people who do not have the means and provisions for war. These three groups are free from the obligation to fight. However, because of his honesty and sincerity towards Allah and the Messenger, he still feels obligated to do other tasks such as guarding the house and village, watching for spies and traitors, keeping secrets, telling people to stay calm, doing good and praying. , so that believers who go to war are protected by Allah and get a glorious victory. The three types of people who have reasons that are justified by this Shari'a, are truly sincere, believe in Allah and obey the Messenger, they are classified as people who do good deeds. These are not among the guilty, sinful and tortured. At the end of this verse it is explained, that Allah is Forgiving, Most Merciful. This means that Allah has a lot of forgiveness and wide mercy, towards His servants who are weak in fulfilling their obligations, as long as they are honest and sincere to Allah and to His Messenger."
		   },
		   {
			"id": 1327,
			"surah": 9,
			"ayat": 92,
			"tafsir": "Sabab Nuzul: In a history explained by Ibn Jarir ath -tabari from Ibn 'Abbas, he said, \"The Messenger of Allah ordered the believers to prepare to go to war. So a group of his companions named 'Abdullah bin Saffal al-Muzani said, \"O Messenger of Allah, provide us with a vehicle (we are poor and don't have a vehicle).\" The Messenger of Allah replied, \"By Allah, I cannot provide a vehicle that will take the brothers to the battlefield.\" So this verse was revealed, then they all crying, because they can't join the war, because vehicles and equipment for war are very important when the battlefield is very far away.\" The vehicle is a very important armor for every era. If in the past the only vehicles needed were camels, donkeys and horses, then in later times humans created high-speed vehicles that could be used for land, sea and air traffic. With the revelation of this verse, the hearts of those who came to the Messenger of Allah were comforted, but their tears streamed down because they could not join the war with the Prophet because they were poor and did not have vehicles. If the place of war was not that far away, they would feel free to walk, because they wanted to wage jihad and seek Allah's pleasure. That is the spirit and spirit of Islam that burns in the chest of every Muslim that will never be extinguished forever. It is with such enthusiasm that Islam can be upright and advanced and the word of Allah will soar high on this earth. In this verse, another reason is explained that is justified by Islamic law for someone who does not take part in the war. This reason is because they do not have a vehicle that can transport them to the battlefield, especially if the destination is far away, which cannot be reached on foot, such as the Tabuk War which is very far away which can be reached only by wading through the desert, for days. -days and weeks, just arrived at the destination. So for those who don't have a vehicle, they are allowed not to participate, they are considered innocent and innocent if they live in their house."
		   },
		   {
			"id": 1328,
			"surah": 9,
			"ayat": 93,
			"tafsir": "This verse explains that rich people who can afford, who come to the Messenger of Allah to ask permission not to go to war, are not justified in abandoning the obligation to fight. They are considered guilty and deserve punishment for their mistakes. In contrast to the people mentioned in the verses above, namely people who have reasons that are justified by syara' and stated sincerely and honestly not to join the war, then they cannot be blamed at all. Wealthy people who could afford to fight because they could afford supplies and vehicles had no reason to ask permission not to fight. That is why they are said to be guilty people and it is only fitting that God seals their hearts to death, because they do not want to accept even the slightest truth. Finally they wallow in trouble and sin, while they do not know the consequences of what they have done."
		   },
		   {
			"id": 1329,
			"surah": 9,
			"ayat": 94,
			"tafsir": "This verse mentions the things that the Prophet and the Muslims would face after returning from the Tabuk War, namely that the hypocrites who did not participate in the war without any reason would definitely come to the Prophet and the Muslims to apologize for their absence on the battlefield. . So Allah ordered the Prophet Muhammad to tell the hypocrites that they did not need to apologize, because the Messenger of Allah and the Muslims would not believe the false reasons they put forward, because Allah had informed His Messenger and all the Muslims about the bad things and qualities of the hypocrites. Allah and His Messenger only pay attention to their attitude and further behavior, whether they have truly realized and left their disbelief and returned to faith and obedience to Allah, or will they remain in that disbelief. Then they will be returned to the Substance Who Knows all things unseen and real, then He will tell them everything they have done while living in the world. In other words, it is no longer useful for them to come up with various reasons for their absence on the battlefield, because all the secrets stored in their hearts are sufficiently known by the Prophet and the Muslims through Allah's revelation. Then it's up to them. If they really realized their mistake, then repented and asked Allah for forgiveness, then Allah would accept their repentance, so the Messenger of Allah would forgive them."
		   },
		   {
			"id": 1330,
			"surah": 9,
			"ayat": 95,
			"tafsir": "In this verse Allah explained to His Messenger, that when he and the Muslims had returned later from the war, the hypocrites would come to him while swearing by the name of Allah (reinforcing what they said), so that the Messenger of Allah would turn away from them by not ignore the actions of those who do not join the war. Then Allah ordered His Messenger, so that he really turned away from the hypocrites as an insult to them. Next, Allah explains the reason why the Prophet had to turn his back on the hypocrites because they were unclean. This means that their attitude and actions are dirty, so they must be kept away, like keeping a clean cloth away from something unclean. This is in line with what is contained in the word of Allah: O you who believe! Indeed, those who are polytheists are unclean (dirty souls). (at-Taubah\/9: 28) Finally Allah stated that the place where the hypocrites return in the afterlife is hell, as a reward for what they have done while in the world, namely disbelief which has polluted them; and the filth is increasing due to their turning away from the verses of Allah. This kind of explanation will be obtained later in the word of Allah: And as for those in whose hearts there is a disease, then (with this surah) it will add to their existing disbelief and they will die in a state of disbelief. (at-Taubah\/9: 125)"
		   },
		   {
			"id": 1331,
			"surah": 9,
			"ayat": 96,
			"tafsir": "This verse emphasizes once again that the hypocrites will swear by the name of Allah to apologize to the Messenger of Allah and the Muslims so that he and the Muslims are pleased with them and forgive all their mistakes. After that Allah emphasized that it is not fitting for the Messenger of Allah and the Muslims to be happy and pleased with the hypocrites, because Allah Himself does not like the wicked. Allah's anger towards the hypocrites is due to their denial and bad qualities. If there were among the believers a person who sympathized with the hypocrites, then that person would also be afflicted with the wrath of Allah. However, if the hypocrites repent and ask Allah for forgiveness and leave their hypocrisy and bad qualities before their death, Allah will accept their repentance and give forgiveness for the sins they have committed."
		   },
		   {
			"id": 1332,
			"surah": 9,
			"ayat": 97,
			"tafsir": "In this verse it is explained that the disbelief and hypocrisy of the Bedouin Arabs is greater than the disbelief and hypocrisy of cultured Arabs who live in cities and villages. The Bedouin Arabs live in the desert, are always on the move, in a barren natural environment, far from the causes of progress, and far from the guidance of the scholars, so they rarely get lessons about the Al-Qur'an and Hadith. Therefore it is not surprising that they do not know the laws that Allah has revealed to His Messenger. In the explanation of this verse there is an allusion to people who live in cities, that they should be more knowledgeable and more advanced than the Bedouins. Because they can socialize and learn lessons from intellectuals, if this is not the case then they are the same as Bedouins whose lives are nomadic and far from the guidance of the clergy. Ibn Kathir said that the Bedouin Arabs were rough and tough, so Allah did not send any Messenger from among them. In this regard Allah has said: And We did not send before you (Muhammad), but men whom We gave revelations to him among the inhabitants of the country. (Yusuf\/12: 109) At the end of this verse it is emphasized that Allah knows best about the affairs of His servants, believers or disbelievers, honest or hypocrites, and He is very wise in establishing Shari'a and His laws, and in giving rewards to His servants. His servant, either in the form of heaven Jannatun-na'im or the very painful punishment of hell."
		   },
		   {
			"id": 1333,
			"surah": 9,
			"ayat": 98,
			"tafsir": "In this verse, another example of the hypocritical Bedouin character is explained, namely those who donate part of their property to strive in the way of Allah, but with a show of joy. They consider the property they give, either because of their obedience or because they are forced to keep themselves and their people safe from things they don't want. They see that this infaq will not bring any benefit to them in the hereafter, because they do not believe in the existence of the Resurrection Day, where everyone will receive a reward for all the deeds they have done in this world. According to Ibn Zaid's description, the people referred to in this verse are Bani 'sad and Bani Gathafan. In addition to the bad qualities above, these hypocrites always hope and look forward to the calamity that will befall the Muslims so that their strength becomes weak. If that happens, then the hypocrites no longer need to donate their property for the sake of jihad. In fact, they are always waiting for the polytheists and Jews to defeat the Muslims. However, after their deception did not bring results, they waited for the death of the Prophet, because they thought that with the death of the Prophet, Islam would vanish and disappear from the face of the earth. Because of their attitudes and views like that, in this verse Allah confirms that it is they who will be afflicted by this calamity, while the Muslims will not experience calamity and they will even receive help from Allah. In addition, the enemies of Islam will fail and be punished in this world before receiving a more severe punishment in the hereafter. At the end of this verse it is again emphasized that Allah is All-Hearing to all the words of His servants, who express their feelings and know the secrets contained in their hearts, whether it is in the form of faith or disbelief, sincerity or hypocrisy. Allah will reward them for their words and deeds."
		   },
		   {
			"id": 1334,
			"surah": 9,
			"ayat": 99,
			"tafsir": "In this verse it is explained that not all Bedouin Arabs have the qualities of disbelief and hypocrisy as mentioned above. Even some of them are people who believe in Allah and the last day, with firm faith. They believe in Allah's omnipotence over all His creatures, and also believe in the existence of the last day, where everyone will receive a reward for all the deeds he has done while living in the world. Besides believing in Allah and the Last Day, they also spend their wealth in the way of Allah. What they donate they view as a way or a way to get closer to Allah and to get the Prophet's prayer, because the Prophet always prays for good for people who like to give charity and spend their wealth in the way of Allah. The Messenger of Allah also always asked Allah for forgiveness for them. Prayer to Allah is a good deed that can be done by someone to ask Allah for benefits for others. For example, the prayer of a pious child for his parents. According to Mujahid's statement, the people referred to in this verse are Bani Muqrin from the Muzayyanah clan. Furthermore, this verse explains that their faith and sincerity as well as the infaq they give with a pure intention are accepted by Allah as a good deed that can draw them closer to Him, Allah will reward them, namely by granting them special grace that is given to people -those whom He pleases, in the form of instructions to the straight path they must follow so they can enter Jannatun-na'im heaven. Here they will live happily in the shade of His grace and love. The existence of Bedouin Arabs who believe in Allah and His Messenger because they use their minds and conscience, shows how low the position of infidels and hypocrites who live in cities who always live in association with intelligent people and hear good lessons, but their hearts remain closed, they don't want to believe. At the end of this verse it is emphasized that Allah's mercy and His forgiveness are very wide for those who are sincere in doing good deeds. Allah will forgive them of the sins and omissions they have committed. Allah will guide them to good deeds and happiness in this world and in the hereafter."
		   },
		   {
			"id": 1335,
			"surah": 9,
			"ayat": 100,
			"tafsir": "In this verse it is explained that the people who first converted to Islam, both from among the Muhajirin who migrated from Mecca to Medina, as well as from among the Ansar, namely the residents of the city of Medina who welcomed the arrival of the Prophet and the Emigrants, and so did the companions who other people who follow the Prophet's orders as well as possible, these three groups are believers who have the highest dignity in the sight of Allah, because of their firm faith, and their good and sincere deeds, according to the demands of the Prophet. Allah is pleased and pleased with them, on the contrary they are pleased with Allah. Allah has provided a very noble reward for them, namely Jannatun-na'im paradise with rivers flowing beneath it, there they will get unlimited pleasure. They will remain there forever. That is the biggest victory they will get. What is meant by as-Sabiqunal Awwalun from among the Muhajirin are those who have emigrated from Mecca to Medina before the \"Hudaibiyah Agreement\" took place, because before the agreement, the polytheists always expelled the Muslims from their hometowns, and killed some of them, and prevented hinder anyone who wants to emigrate.There is no other way for a believer to save himself from the crimes of the polytheists, except to distance himself from them, or surrender to their will and desires.People who choose the first way, namely leaving the city of Mecca and those who migrated to Medina were true believers, there was not even a hypocrite among them. They left their homeland because of their pure faith, sincerity, and struggle to uphold Islam. Also known as as-Sabiqunal Awwalun, namely people the first to convert to Islam and declare his faith in the Prophet Muhammad, dar i family circle is Siti Khadijah, 'Ali bin Abi Talib, and Zaid bin Haritsah. While from outside circles is Abu Bakr Ash-Shiddiq, the person who accompanied the Prophet when he migrated to Medina. Besides that, there are also friends who are grouped in as-Sabiqunal Awwalun who the Prophet Muhammad declared as people who will surely enter heaven. Among them were Uthman bin Affan, Hamzah and others. What is meant by the first group, as-Sabiqunal Awwalun from among the Ansar are residents of the city of Medina who have pledged their allegiance to Muhammad's apostleship at Aqabah, a place in Mina, in the 11th year of Muhammad's apostleship. At that time there were seven of them. Then in the next period, namely in the 12th year, there was also a pledge of allegiance at the same place, namely Aqabah, this time followed by seventy men and two women. Their footsteps were followed by others after they were visited by a Messenger of Allah named Abu Zurarah Mush'ab bin 'Umar bin Hasyim who recited verses from the Qur'an and taught religious knowledge to them. Likewise, including the as-Sabiqunal Awwalun group are those who have believed at the time of the Prophet's arrival in Medina. The strength and unity of Islam grew and developed after the Prophet migrated to Medina. It was at this time that the hypocrites appeared who pretended to support Islam. This is explained in the word of Allah that came down regarding the circumstances of the Battle of Badr which took place in the second year of Hijri. Allah's Word: (Remember), when the hypocrites and those who have disease in their hearts say, \"They (the believers) are deceived by their religion.\" (al-Anfal\/8: 49) In the group of hypocrites mentioned in this verse, there is no one from among the Muhajirin and Ansar who received the title as-Sabiqun al-Awwalun as mentioned above, even though the Ansar were all came from Bani 'Aus and Khazraj. What is meant by the second group, \"allazinat tabuuhum bi ihsan\" (those who have followed the as-Sabiqunal Awwalun from among the Muhajirin and Ansar) are those who migrated to Medina and fought to uphold the Islamic religion; or those who prove their only deeds and words after receiving guidance and lessons from the as-Sabiqunal Awwalun from among the Muhajirin and Ansar, who are leaders who deserve to be followed, and are made role models in behavior, actions, speech, and the struggle to uphold religion God. In short they are people who follow as-Sabiqunal Awwalun in obedience and piety until the Day of Judgment. As for the third group, namely those who are hypocrites only follow in the footsteps of as-Sabiqunal Awwalun purely outwardly, not with sincere intentions or only following him in a few matters, while in other matters they deny him."
		   },
		   {
			"id": 1336,
			"surah": 9,
			"ayat": 101,
			"tafsir": "After mentioning the matters of the three types of people who truly believe, namely the companions of the Prophet Muhammad, in this verse Allah mentions the matters of the hypocrites, both from the Bedouins and those who live in cities. Medina, so it appears two very opposite things. It was as if Allah said, \"O you who believe, in fact some of the Bedouins who live around Medina are very hypocritical people. Their hypocrisy and crimes are very outrageous. In fact, some of the residents of the city of Medina there are also hypocrites. Therefore beware of them.\" According to al-Bagawi's statement, what is meant by \"the Bedouin hypocrites who live around the city of Medina\" are those who come from the Bani Muzainah, Bani Juhainah, Bani Asyja, Bani Aslam and Bani Gifar. Whereas what is meant by \"hypocrites from among the residents of the city of Medina itself\" are hypocrites who come from Bani Aus and Khazraj. They are very outrageous, and very good at hiding their hypocrisy, so that it is difficult for the Prophet and Muslims to know in general. They cannot be expected to return to true faith. However, Allah always knows their hypocrisy, and He will inflict punishment on them twice, namely: in the world of misery and inner suffering and the pain of death. In the afterlife they will be thrown into a terrible doom, in the lowest hell of Jahannam. From the explanation above, it can be concluded that the hypocrites are divided into two groups. First, people whose hypocrisy can be known from their attitude, actions, and words. Second, they are very good at hiding hypocrisy, so it is difficult to know."
		   },
		   {
			"id": 1337,
			"surah": 9,
			"ayat": 102,
			"tafsir": "In this verse, the fourth group is explained, namely people who do not belong to the hypocrites, nor as-Sabiqunal Awwalun, nor do they belong to the group of \"those who follow well in the footsteps of as-Sabiqunal Awwalun\". These are believers who have sinned, and they honestly admit their sins. They have mixed up good deeds with bad deeds, so that their actions are not all good and not all bad. Thus they are not really pious people, nor are they part of a wicked or hypocritical group, because in reality they like to do good but often do bad. Among their vices is not participating in the Tabuk War with other Muslims, even though they have no age or justifiable reason, because they are not weak or sick people; nor do they come up with lying excuses as the hypocrites do; nor do they ask permission as those who doubt do. However, they realized their mistake when they did not join the war and their hearts feared Allah. Thus, on the one hand they do not want to carry out their obligations, and on the other hand they realize their mistake because they fear Allah. Furthermore, in this verse it is explained that this group still has hope that their repentance will be accepted by Allah. Their repentance is the key to obtaining His forgiveness and mercy. True repentance can only be achieved when a person knows the ugliness of sin and its consequences, so that fear arises when remembering God's wrath and His torment. Then arises the desire to cleanse oneself from all things that cause sin, in addition to a strong intention and determination not to do that action again, and try hard to do various virtues to erase sins from actions that are prohibited by religion that have been committed, and have bad consequences. for society and yourself. At the end of this verse, it is explained why there is still hope for sinners that their repentance will be accepted by Allah, because indeed Allah is Forgiving to His servants who truly repent; and Allah is Most Merciful to His servants who want to do good. According to one history, this verse was revealed in connection with an incident that occurred to six Muslims who deliberately absent themselves from the Battle of Tabuk. They were Abu Lubabah, Aus bin Sa'labah, Wadi'ah bin Hadzdzam, Ka'ab bin Malik, Murarah bin Rabi, and Hilal bin Umayyah. After realizing their mistake for not participating in the war, three of them, namely Abu Lubabah, Aus and Sa'labah, came to the mosque carrying their possessions, then they tied themselves to the pillars of the mosque, and determined that only the Prophet would release them from that bond. While the property they intended to be handed over to the Prophet for him to distribute to those who are entitled to receive it as alms to atone for their mistakes. After this was conveyed to Rasulullah saw, he said, \"I will not release them from that bond, until the provision comes from Allah.\" Then come down this verse. The Prophet then opened the straps that tied them to the pole. Ibn Kathir argues, \"Even though this verse was revealed about certain people, its contents still apply to the public, covering all sinful people who mix up good and bad deeds and then realize their mistakes, then they repent to Allah in the best way possible. good.\""
		   },
		   {
			"id": 1338,
			"surah": 9,
			"ayat": 103,
			"tafsir": "Allah's command at the beginning of this verse is addressed to His Messenger, so that the Messenger of Allah as a leader takes some of their property as alms or zakat. This is to be proof of the truth of their repentance, because the alms or charity will cleanse them from the sins that arise because of their absence from war and to purify themselves from the \"love of wealth\" that drives them to be absent from the war. In addition, alms or zakat will also cleanse themselves from all the bad qualities that arise because of property, such as miserliness, greed, and so on. Therefore, the Prophet sent his companions to collect zakat from the Muslims. In addition, it can be said that paying zakat means cleaning up the remaining property, because one person's property has the rights of other people, namely people who according to Islam have been determined as people who are entitled to receive zakat. As long as the zakat has not been paid by the owner of the property, so long as his property remains mixed with the rights of other people, it is forbidden for him to eat. However, if he takes out zakat from his wealth, then the property becomes clean from the rights of other people. People who issue zakat are free from miserliness and greed. Paying zakat will cause blessings on the remaining assets, so that they grow and multiply. On the other hand, if zakat is not issued, one's property will not be blessed. It should be noted, although Allah's command in this verse was originally addressed to His Messenger, and the revelation of this verse relates to the incident of Abu Lubabah and his friends, the law also applies to all leaders or authorities in every Muslim society, to carry out Allah's orders in matters this zakat, namely to collect zakat from Muslims who are obliged to give zakat, and then distribute the zakat to those who are entitled to receive it. Thus, zakat will be able to fulfill its function as an effective means of fostering community welfare. Furthermore, in this verse, Allah commands His Messenger, and also every leader and ruler in society, so that after collecting and distributing zakat, they pray to Allah for the safety and happiness of the zakat payers. The prayer will calm their souls, and will calm their hearts, and create confidence in their hearts that Allah has truly accepted their repentance. May Allah reward you for what you give, and bless what you leave behind. At the end of this verse it is explained that Allah is All-Hearing every utterance of His repentant servant, Allah is All-Knowing of everything that is stored in the hearts of His servants, such as the feeling of regret and anxiety that arises because of the awareness of mistakes that have been made."
		   },
		   {
			"id": 1339,
			"surah": 9,
			"ayat": 104,
			"tafsir": "With this verse Allah gives encouragement to His servants who have realized their mistakes to repent and give alms, in order to erase their sins. Apart from that, this verse also confirms that whoever repents to Allah will receive his repentance; and whoever gives alms sincerely, Allah will accept that alms as his good deed, and will give him a reward. Even though this verse is in the form of a question sentence, the Arabs have used to put forward the sentence in the form of a question to define and emphasize an understanding, namely the certainty that Allah will truly accept the repentance of those who are converts, will also accept the alms they give. give because they expect the pleasure of Allah solely, to erase the sins they have already committed. This verse is also a strong reproach to those who are guilty, but do not admit their mistakes, do not want to repent, and do not want to do good and good deeds to erase the sins they have committed. At the end of this verse it is emphasized that Allah is the Acceptor of repentance and is Most Compassionate towards His servants. Therefore, Allah will always accept the repentance of His servant, because this trait is a permanent trait for Him, and becomes a Sunnah that applies forever. He always loves His servants so that He will forgive their sins, and accept the good deeds they do, and reward them accordingly."
		   },
		   {
			"id": 1340,
			"surah": 9,
			"ayat": 105,
			"tafsir": "In this verse, Allah ordered His Messenger to tell Muslims who want to repent and cleanse themselves from sins by giving alms and paying zakat and doing good deeds as much as possible. In addition, Allah also ordered His Messenger to convey to his people, that if they have done these pious deeds then Allah and His Messenger and other believers will see and judge these deeds. Finally, he will return them to the afterlife, he will give them rewards for the good deeds they have done while living in this world. They are advised not only to feel sufficient by simply doing repentance, zakat, alms and prayers, but that they must do everything that is ordered to them. Allah will see the deeds they do, so they are closer to Him. The Messenger of Allah and the Muslims will see these good deeds, so they too will follow and emulate them too. Whereas Allah gives multiple rewards to those who become role models, without reducing the rewards of those who imitate. As is well known, Muslims will be witnesses before Allah on the Day of Judgment regarding the faith and practices of fellow Muslims. Testimony based on first-hand eyesight is stronger and more reliable. Therefore, Muslims who see the good deeds done by those who are converted and repent to Allah, will surely be strong witnesses on the Day of Judgment, about the truth of their faith, repentance and good deeds. This verse also contains a strong warning against those who violate religious orders, that their deeds will be shown to the Prophet and other Muslims later on the Day of Judgment. In this way their disgrace will be revealed, because it will be proven that their good deeds are very few, and conversely the sins and crimes they commit are more numerous. Even in this world it will be shown their lack of good deeds and the many crimes they have committed. In a history it is stated that the deeds of the living are shown to those who have died, namely from among the families and relatives who are in the afterlife. With the death of a person then he is returned to the afterlife. There Allah will inform everyone about the results of the deeds he has done while he is in the world by giving a reward for their deeds. Good is rewarded with good, and evil is rewarded with doom and torment."
		   },
		   {
			"id": 1341,
			"surah": 9,
			"ayat": 106,
			"tafsir": "Three people who did not join the battlefield with Rasulullah SAW, namely Murarah bin Rabi, Ka'ab bin Malik and Hilal bin Umayyah, even though in their hearts there was a desire to join themselves, but they could not do this, and their non-participation not out of hypocrisy. After Rasulullah SAW returned from the battlefield, they said to him, \"We have not had any obstacles, our absence is only a mistake.\" And they didn't express an apology for the mistake. They didn't do what Abu Lubabah and his friends did. Because of Allah's confirmation in this verse that their repentance is suspended, the Prophet Muhammad forbade other Muslims to associate and sit with them. Rasulullah SAW also ordered the three of them to stay away from their wives, and ordered the wives to return to their families, until the word of Allah came down confirming the acceptance of their repentance, as mentioned above. The suspension contains two possibilities, whether Allah will punish them or He will accept their repentance, if they repent. Thus, neither they nor others knew what would happen to them. Is their repentance of any use, so that Allah is willing to accept their repentance as happened to their friends who have repented and admitted their mistakes. Or will Allah inflict punishment on them in this world and in the hereafter as He has decreed for those who do not participate in the war because of their hypocrisy. This suspension contains wisdom, so that in their hearts a feeling of anxiety and sadness arises, then they sincerely repent. In addition, the Prophet Muhammad and other Muslims were ordered to stay away from and alienate them, as a lesson to them that everyone who is only concerned with self-interest and does not care about the public interest, and obedience to Allah and His Messenger deserves a lesson. At the end of this verse it is emphasized that Allah knows best what can improve the condition of His servants, He educates His servants how to cleanse themselves from all bad things, both individually and in groups. Allah is Wise in establishing His laws which are clear and beneficial for them in self-improvement and improvement, if they really obey the rules and laws that He has established. One of God's wisdom is the suspension of the firmness of whether or not their repentance is accepted. If this is read or heard repeatedly by other believers, it will undoubtedly create fear in their hearts to do something like that. Of course, this is a kind of good education and lesson for the entire Ummah, especially for those who make the same mistakes."
		   },
		   {
			"id": 1342,
			"surah": 9,
			"ayat": 107,
			"tafsir": "In this verse Allah explains their intention to build the mosque, namely: 1. To harm the believers who used to worship at the Quba mosque, namely the mosque built by the Prophet Muhammad when he had just emigrated from Mecca, before arriving at Medina. 2. As a facility in carrying out various actions as a manifestation of disbelief. The hypocrites left the prayer secretly in the building they built, so that the Muslims could not find out because they were no longer worshiping together at the Quba mosque. In addition, the existence of this building can also be a place to hold negotiations freely in committing treason against the Prophet Muhammad. 3. To divide the Muslims who live in that area. Because they not only pray at the Quba mosque, but they also meet and get to know each other, work together, make agreements on various issues. This is the most important goal of a mosque in the field of society. Therefore, it is a must for Muslims who live in certain areas to all perform Friday prayers in one mosque as long as this is possible. From this it can be seen that building a new mosque can be seen as a good deed accepted by Allah, if it is really necessary, for example because the old mosque has been damaged, or is no longer able to accommodate the increasing number of Muslims, and not established for the purpose of dividing the Muslims. Therefore, the construction of mosques that are close to each other, and only driven by a sense of riya and personal or group pride, is not justified by religion. 4. Become a place of refuge for people who used to fight against Allah's religion, so that when they come to that place, they have got a safe haven, have allies and supporters to jointly fight the Prophet and the Muslims. They are polytheists and hypocrites who deliberately built the building as their stronghold to divide and fight Muslims. In this verse it is further explained that the hypocrites swore to strengthen their words, that the building they built was solely for the sake of obtaining good, for example to make it easier for people who are weak, to perform Friday prayers close to where they live and so on. However, this oath is only to cover up the evil intentions that are stored in their hearts. At the end of the verse, Allah confirms that He witnesses that they are people who are truly liars."
		   },
		   {
			"id": 1343,
			"surah": 9,
			"ayat": 108,
			"tafsir": "Due to the evil intentions of the hypocrites by building this building, Allah forbade His Prophet forever to pray in that place, because if Rasulullah prayed there with them it meant that he had approved of them building that building. Furthermore, Allah emphasized to His Messenger, that the mosque which was built from the beginning on the basis of piety to Allah, is better to be used as a place of worship with his people to unite all Muslims in everything that pleases Him, namely knowing each other and doing things together. benevolence and piety. What is meant by the mosque that was first built on the basis of piety, which is mentioned in this verse, is the \"Quba mosque\" or \"the Prophet's mosque\" in the city of Medina, because the two mosques were built by the Prophet and the Muslims on the basis of piety. Furthermore, in this verse Allah explains the reasons why this mosque is more important than other mosques which were deliberately built not on the basis of piety, because in these mosques there are people who like to cleanse themselves of all sins. This means that they enliven the mosque by establishing prayers and remembrance and glorification of Allah. With these services, they want to purify themselves from all the sins that are attached to them, as people who are absent from war then they realize their mistakes, then try to purify themselves from these sins by repenting, giving alms, and multiplying good deeds. other. Performing prayers means purifying oneself physically and spiritually because to perform prayers, the purity of the body, clothing and place is required, as well as the presence of the heart and mind that are presented to Allah alone. At the end of this verse it is emphasized that Allah likes people who take great care of the cleanliness of their souls and bodies, because they consider that human perfection lies in the purity of his body and soul. Therefore, they really hate external dirtiness, such as dirt on the body, clothes and places, as well as mental dirt that arises due to continuous immoral acts, as well as bad manners, for example being extravagant in doing charity, or stingy in donating wealth to gain Allah's pleasure. . Allah's love for those who like to purify themselves, is one of the attributes of His perfection, He likes goodness, perfection, holiness, and truth. On the contrary, He hates those qualities that are opposite to those qualities."
		   },
		   {
			"id": 1344,
			"surah": 9,
			"ayat": 109,
			"tafsir": "This verse begins with the form of a question, Allah shows a clear difference between people who build mosques out of piety and a desire to please Him, and people who build mosques with evil intentions so that the construction of the mosque does not give rewards but instead adds to the pile. their sins. The latter are likened to those who build buildings on the edge of a cliff that has collapsed, so that in the end they fall along with the mosque they built into the Hellfire of Jahannam. From this it can be understood that those who build mosques on the basis of piety and the desire to please Allah, are like those who build strong buildings on strong ground, tough against wind and storms, not weathered by rain, and not faded because of the heat. He provides protection, security, peace and happiness to those who are in it. In other words, the Messenger of Allah and the Muslims who truly believe in Allah always base all their actions on piety and His pleasure. They are better than the hypocrites who carry out their actions only based on bad intentions, which add to disbelief and hypocrisy, as well as the intention to divide Muslims. In this world they are despicable, while in the hereafter they will be overwritten by the punishment and wrath of Allah. After explaining the luck of the believers and the bad luck of the unjust hypocrites, at the end of the verse Allah confirms that He will not guide the wrongdoers. That is, those who are unjust will never get a clue to goodness and luck. Therefore, every step and their behavior and actions always experience failure and disaster, both in this world and in the hereafter."
		   },
		   {
			"id": 1345,
			"surah": 9,
			"ayat": 110,
			"tafsir": "In this verse Allah explains that the mosque built by the hypocrites always causes doubts in their hearts about religion, because after the building was erected they used it to carry out evil deeds, including making plans and plots against the Messenger of Allah. and Muslims. This shows their hypocrisy and disbelief. After the Messenger of Allah sent some of his companions to tear down the building, the hypocrites became even more doubtful about their fate, and felt fear and anxiety. This kind of situation only ends after their hearts seem to be torn to pieces, so that they can no longer know the truth. This means that as long as they live, their hearts will always be in doubt and doubt. The collapse of their mosque buildings also causes the collapse of their life support, so that anxiety, fear, and doubt always surrounds their hearts until they die and their bodies are shattered. Or after they repent and regret all the sins and mistakes they have made. At the end of this verse it is emphasized that Allah is All-Knowing of the deeds of His servants and All-Wise in all His deeds. One of His wisdom is His notification to the Prophet and the Muslims about the crimes of the hypocrites, so that from their evil traits and deeds it can be known who they are and the consequences of their crimes can be avoided."
		   },
		   {
			"id": 1346,
			"surah": 9,
			"ayat": 111,
			"tafsir": "This verse explains that Allah buys the soul and property of the believers, which He pays with heaven. That is, Allah repays all the struggles and sacrifices that have been given by the believers, both in the form of their body and soul and their assets with the best reward, namely enjoyment and happiness in heaven someday. This is a very beautiful expression to create enthusiasm for mankind to strive for jihad, because it describes a buying and selling transaction that greatly benefits humans. The sacrifices they have given in the form of wealth and body and soul will be exchanged for something very valuable, which has never been seen by human eyes, has never been heard by ears, and its value is far higher than property and anything that has been sacrificed. In addition, the sale and purchase that took place between Allah and the Muslims will never be cancelled. Unlike buying and selling transactions that occur between human beings, which can sometimes be undone. After all, buying and selling between human beings is only an exchange of goods and money of the same value. While the reward given by Allah to His faithful servants is far higher in value than the sacrifices that have been given or the struggles that have been carried out. The multiplied reward that Allah bestows upon His servants is solely because of His compassion and is an honor for His believing servants, because in essence the human self belongs to Him, because He is the Creator; and their possessions also belong to Him, for it was He who bestowed them on them. However, if humans wage jihad by sacrificing their property and soul, then Allah will still reward them with multiplied values even though Allah Himself does not need their property and soul. Furthermore, in this verse, Allah explains how to hand over souls and property that will be purchased by Allah with heaven, namely by fighting in the way of Allah to defend truth and justice. This is what will convey them to His pleasure; sometimes they can annihilate the enemies of Allah who always hinder the course of Islamic da'wah, sometimes they fall in battle, as martyrs in defending Allah's religion. But there is no difference between the two in receiving rewards and rewards from Allah. Allah confirms that His promise to reward Him will be fulfilled, He has even stipulated it in such a way in the Torah, Bible and Al-Qur'an. This last holy book will not be erased by anyone, because Allah has guaranteed the safety of the Qur'an from ignorant hands. Furthermore, Allah confirms that nothing surpasses Allah in terms of keeping promises, because He has the power to keep His promises, and never forgets or doubts His servants. Therefore, God will give good news that they will definitely get from buying and selling their property and souls with God. At the end of this verse, Allah again emphasizes that the luck they will get is really a very big luck, there is nothing beyond it. While the luck that they had previously obtained in the form of victory against the enemies of Islam, as well as leadership, power and empire, was only luck which was the way to uphold justice and truth."
		   },
		   {
			"id": 1347,
			"surah": 9,
			"ayat": 112,
			"tafsir": "This verse mentions some of the characteristics of believers who have reached the pinnacle of perfection of faith, who have sacrificed their material possessions and their bodies and souls in jihad to uphold and uphold the religion of Allah. These characteristics are: 1. They are people who repent, return to Allah by leaving every action that will distance themselves from His pleasure. So the repentance of people who were once disbelievers is their return to Allah's way, and carrying out His Shari'a orders. In this case Allah has said: If they repent, establish prayers, and pay zakat, then (they are) your brothers and sisters in religion. (at-Taubah \/ 9: 11) While the repentance of people who have been hypocrites is by leaving their hypocrisy. The repentance of disobedient people is by leaving their iniquity by regretting what they have done, and being determined not to repeat that act again, as the repentance has been done by some believers (Abu Lubabah and his friends) who have been absent from the Tabuk War. . As for the repentance of those who have neglected to do good, that is by doing more other good, while the repentance of those who have neglected to remember Allah is by way of remembrance and giving thanks even more after realizing their negligence. 2. Believers who reach the peak of the perfection of faith have the characteristics of those who worship Allah solely sincerely, without riya or shirk. All worship prayers and hopes are only directed to Allah alone. They stay away from all actions that are intended to draw closer to other than Allah or hope for help from other than Allah, both for worldly and spiritual interests. 3. Believers are characterized as people who always give praise to Allah, both in times of joy and times of sorrow. In this case 'Aisyah ra explained that the Prophet Muhammad saw, when he found something encouraging, he uttered words of praise which read: All praise is only for Allah, with His grace all goodness can be perfected. (History of Ibn Majah and al-hakim) And when he encounters something he does not want, he utters a word of praise which reads: All praise is for Allah alone, in all things. (History of Abu Dawud, at-Tirmidhi, and others) 4. Believers who reach the pinnacle of perfection also have the character of people who like to travel for good and right purposes, for example wanderings undertaken to study knowledge, both religious knowledge, and knowledge for worldly progress, or for something that is beneficial for the progress and welfare of the nation and the homeland. Or travel to see and pay attention to the condition of other nations and countries, so that useful lessons can be learned from all of this, and increase our faith and worship to Allah, the Creator of the universe. In the Qur'an, there are many words of Allah that encourage people to travel on this earth, to gain experience and lessons, which will strengthen their faith. Among other things, the word of Allah: Say (Muhammad), \"Travel the earth, then see how the end of those who deny it.\" (al-An'am\/6: 11) And His word is in another verse: Have they not considered how many generations before them We have destroyed, even though (the generation), We have established their position in the earth, namely the firmness that has not been We have given you. (al-An'am\/6: 6) There are many other verses that are in line with the verses above which instruct humans to pay more attention to God's creatures in this world. The farther you walk, the more you see, and provide a lot of knowledge, experience, and lessons, which ultimately increase your faith and piety to Allah. 5. Another characteristic possessed by true believers is that they always bow and prostrate to Allah, that is, establish prayers. Allah deliberately mentions the problem of bowing and prostration in this verse, because these two things show the submissive nature of humility and self-serving to Allah, and also to illustrate that the work of prayer is never separated from bowing and prostration. 6. Two other characteristics of true believers are that they like to invite others to do good, and prevent them from doing wrong things, by inviting them to faith and doing deeds that are the fruit of that faith, namely good things and useful for personal life and life together in society. 7. Another characteristic that is mentioned last in this verse, is as people who always guard themselves not to exceed the limits and provisions that have been set by Allah, such as His Shari'a and laws, which must be followed by believers for their happiness in life. this world and the hereafter, and what they should stay away from, because of the dangers it can cause. Likewise, in the law and shari'a it has also been explained what must be done by Muslims and their leaders, both for the personal interests of Muslims, as well as for the glory of Islamic society in general."
		   },
		   {
			"id": 1348,
			"surah": 9,
			"ayat": 113,
			"tafsir": "In this verse it is explained that it is not proper for the Prophet and believers to ask Allah to grant forgiveness to polytheists, even though they are relatives of the Prophet or relatives of believers. Moreover, if the Prophet and the believers have obtained clear evidence that those who are asked for forgiveness are candidates for the inhabitants of hell, because their deeds and actions have shown their disbelief towards Allah. In the 80th verse of surahh at-Taubah, Allah has also explained that He will not forgive the hypocrites, because they have disbelieved in Allah and His Messenger, so that it is the same whether the Messenger of Allah asks forgiveness for them, or not. . In verses 48 and 116 of surahh an-Nisa Allah has also emphasized that He will not forgive anyone who becomes a polytheist, namely associating partners with Allah with others. Those who associate partners with Allah, even though they claim to believe in and worship Allah, they also worship other than Allah. This shows that they do not believe in Allah's perfection and power. Therefore, in another verse Allah confirms that polytheism is a great injustice, and is a sin that cannot be forgiven. That is why Lukman al-Hakim taught his son not to associate partners with Allah. He said: Do not associate partners with Allah, in fact associating (Allah) is really a great injustice. (Luqman\/31: 13) In verse (113) above there is a hint that praying for people who have died in their disbelief, so that they receive Allah's forgiveness and mercy, is forbidden. This prohibition includes all kinds and ways of praying, both prayers that are usually performed after prayers and prayers that are read in certain ceremonies. It was narrated by Imam Ahmad, Imam Muslim, and Abu Daud from Abu Hurairah that the Messenger of Allah once visited his mother's grave, then he cried, causing those around him to cry too. Then he said, \"I asked permission from Allah to ask forgiveness for my mother, but Allah did not allow, and I asked permission to visit my mother's grave, then Allah allowed. Therefore, you may visit the grave because it will remind you of death.\" With Allah's prohibition in this verse on the Prophet and believers to ask forgiveness for polytheists, it can be concluded that prophethood and true faith will not allow a person to pray to Allah's presence to forgive polytheists in a state of disbelief. however, even if they belong to a beloved kindred. This is because for the Prophet and the believers it is quite clear from various evidences and facts, that the polytheists had died in disbelief so that they are candidates for the occupants of hell, so it is not appropriate to ask forgiveness from Allah. because their deeds did not please Him."
		   },
		   {
			"id": 1349,
			"surah": 9,
			"ayat": 114,
			"tafsir": "From the information contained in the verse above, a question may arise in our minds, why did Allah forbid the Prophet Muhammad and the Muslims to ask forgiveness for those who died in polytheism and disbelief, even though their own relatives and parents , even though the Prophet Abraham never asked forgiveness for his father, who was also a polytheist who died in polytheism and disbelief. So in this verse Allah gives His answer that it is true that Prophet Abraham once asked Allah for forgiveness for his father named Azar, by saying the following prayer: And forgive my father, in fact he is one of those who have gone astray. (asy-Syuara' \/26: 86) However, Prophet Abraham did this because he had promised his father to pray for him, with the hope that Allah would give him taufik to believe, and guide him to the true path he had spread. This promise shows that the Prophet Abraham believed that his duty was simply to pray to Allah, while he himself was not authorized to provide guidance or salvation, let alone forgive his sins. Thus, Ibrahim has fulfilled his promise, but only the fulfillment of the promise. This is also mentioned by Allah in His word: And, (the sheets) of Abraham who always fulfills the promise? (an-Najm\/53: 37) In the next verse, Allah explains that even though Abraham had asked forgiveness for his father to fulfill his promise, but later after it became clear to him that his father was truly against Allah in polytheism, Abraham no longer prayed for his father after his death . Prophet Ibrahim prayed for his father when his father was still alive, with the hope that his father would receive guidance and taufik from Allah, leave his polytheism and repent to Allah. This kind of prayer is not forbidden. A person's faith in Allah and the Last Day will not allow him to love those who are enemies to Allah and His Messenger. This has been confirmed by Allah in His word in other verses: You (Muhammad) will not get anything from a people who believe in Allah and the Hereafter, affectionate with those who oppose Allah and His Messenger, even if those who the person is his father, son, brother or family. (al-Mujjadi\/58: 22) During the time when his father was still alive, the Prophet Abraham already knew about his behavior that did not please Allah, so that he himself was threatened with harsh words, which are stated in the following verse: He (his father) said , \"Do you hate my gods, O Ibrahim? If you don't stop, I will surely stone you, so leave me for a long time.\" (Maryam\/19: 46) However, Ibrahim also promised his father to pray for him to Allah so that he would be given forgiveness and mercy and guidance. However, after his father died, it became clear to Ibrahim that his father was actually hostile to Allah during his lifetime. So Ibrahim no longer prayed for him. What is the reason for this? So at the end of this verse Allah explains the answer to this question, namely: because Abraham was a man who was very fearful of Allah, and obedient and obedient to Him, he was also known as a forbearer, and firm in all things. That is why the Prophet Ibrahim immediately stopped praying for his father, after knowing that he was truly a polytheist, in whose heart a strong belief in shirk and enmity towards Allah was instilled in his heart. Prophet Ibrahim was soft-hearted, he deeply regretted the attitude of polytheists among his people, including his own father."
		   },
		   {
			"id": 1350,
			"surah": 9,
			"ayat": 115,
			"tafsir": "In this verse, Allah confirms that if a people has truly been guided, and their chests have been widened to accept Islam, then He will never consider these people as people who are astray, then He treats them the same as other people. -people who are totally misguided, who deserve to be blamed and tortured. Allah will not do this if they only make one mistake, either by word or by deed, which is caused by a mistake in their ijtihad. Allah will not criticize and torture them for such mistakes, until they really understand religious teachings, whether in the form of prohibitions that they must avoid, or orders that must be carried out. At the end of this verse it is emphasized that Allah knows everything, including human needs for information and explanation. Therefore, Allah has clarified important matters in religion with definite explanations in His word, so that the Muslims will be able to attain the truth in their ijtihad and will not be tempted by their lusts. That is why Allah did not blame Prophet Abraham when he begged forgiveness for his father because it was done before he got clear evidence and information about his father's condition. After he received clear information and evidence, he immediately stopped his prayer. Likewise, Allah will not inflict punishment on the Prophet Muhammad and the believers who have asked Allah for forgiveness for their parents and relatives who have died in disbelief, if this is done before obtaining clear information regarding Allah's provisions in matters the."
		   },
		   {
			"id": 1351,
			"surah": 9,
			"ayat": 116,
			"tafsir": "Allah makes it clear that it is He who has dominion, both in the heavens and on earth. He is the master of all that exists in this world. He is also the one who kills His servant when he dies. And it is His Sunnah that applies in this universe. There is no one who takes care of and controls the interests of the believers, and no one will help them against their enemies, except Allah swt. Therefore, believers must not deviate from Allah's provisions, especially regarding His prohibition to ask forgiveness for polytheists, even though they are among the relatives who deserve to be cared for and helped. Likewise in other provisions, both in the form of prohibitions, as well as His commands."
		   },
		   {
			"id": 1352,
			"surah": 9,
			"ayat": 117,
			"tafsir": "This verse is a continuation of the previous verses, regarding the issue of repentance of those who have been absent from the Tabuk War. It is a custom in the Qur'an to stop one conversation, then start another, only to return to the original issue. This kind of method will give a more stable understanding and a stronger impression on the hearts and minds of those who hear or read it, and it will not be boring. In addition, there is also a connection with the prohibition on asking forgiveness for polytheists, which was mentioned in the last verse, because in these two problems there are mistakes that need to be redeemed by repenting, and correcting mistakes that need to be forgiven from Allah. In this verse, Allah confirms that He has accepted the repentance of the Prophet Muhammad and the Muhajirin and Ansar and other believers, who have followed the Prophet in difficult times, namely during the Tabuk War, because the Tabuk War took place in times of difficulty. Food difficulties, because it was a famine season, so a date eaten by one or two people. There was a shortage of water, so that some slaughtered their camels so that they could take water from their stomachs to drink, even though they really needed the camels for transportation from one place to another, so that one camel was used for the needs of ten people. In addition, the air at that time (when the Tabuk War occurred) was very hot. The acceptance of repentance occurred after the hearts of a group of Ansar and Muhajirin people almost turned away, so that they went to war reluctantly and with heavy feelings, and some even deliberately left the war. But later Allah accepted their repentance after they realized their mistake. At the end of this verse it is emphasized that Allah is Most Gracious and Merciful to the Prophet and his followers. Therefore He always accepts the repentance of those who truly repent to Him. According to the tafsir of Ibn 'Abbas, what God meant by accepting the Prophet's repentance was the repentance the Prophet made for his mistake in allowing some people not to join the war, even though they had no justifiable excuses. What is meant by accepting the repentance of the Muhajirin and Ansar is the repentance that they make from their mistakes when they object to going out to the battlefield, even though they are people who are seen as having the strongest faith. Some of them have a fault because they like to listen to the talk of hypocrites even though the talk is intended to cause slander among the Muslims."
		   },
		   {
			"id": 1353,
			"surah": 9,
			"ayat": 118,
			"tafsir": "This verse again reveals the circumstances of three of the believers who were absent from the Battle of Tabuk, namely: Ka'ab bin Malik, Hilal bin Umayyah, and Murarah bin Rabi. At first, they deliberately did not participate in the war with the Prophet, but then they experienced mental pressure, and the world seemed narrow to them, because other believers saw them as dishonorable people. They feel sure that only Allah is a place of refuge from all His torment. After coming awareness and a sense of regret, then they repent to Allah. Allah also accepts that repentance, so that they remain in conversion to returning to Allah's religion with the guidance of His Messenger. After having committed a violation of His commandments. At the end of this verse it is reiterated that Allah is the Acceptor of Repentance and Most Merciful to His servants. He always accepts the repentance of His servants who truly repent to Him and forgive their sins and bestow His grace and favors upon them, even though they have already made mistakes that have earned them the right to be punished and tortured."
		   },
		   {
			"id": 1354,
			"surah": 9,
			"ayat": 119,
			"tafsir": "Allah shows His call and gives guidance to those who believe in Him and His Messenger, so that they remain in piety and hope for His pleasure, by fulfilling all the obligations that He has set, and avoiding all the prohibitions that have been determined by Him, and should always be with people who are true and honest, following their piety, truth and honesty. And do not join the hypocrites, who always cover up their hypocrisy with words and deeds of lies coupled with false oaths and reasons that are not true. Al-Baihaqi narrated a hadith from the Messenger of Allah, that he said: Verily, honesty leads to virtue, and virtue leads to heaven. Indeed, a person will act honestly until he is recorded in the sight of Allah as an honest person. And verily lying leads to evil, and evil leads to hell. Indeed, a person acts a lie so that he is written by Allah as a liar. (Hadith Muttafaq 'Alaih) Lying is forever forbidden except when forced to, as a ruse in war, or to reconcile between disputing parties, or a man's lie to his wife intended to please her, for example in praising her beauty, but not lies in financial matters and the interests of household life or others. In this case, Rasulullah saw said: Every lie committed by someone is always written as a sin except for someone who lies as a ruse in war, or lies to reconcile two people who are in dispute or lies committed by someone against his wife with the intention of pleasing her. (History of Ibn Abi Syaibah and Ahmad, from Asma bint Yazid)"
		   },
		   {
			"id": 1355,
			"surah": 9,
			"ayat": 120,
			"tafsir": "Allah explained that the Muslims living in the city of Medina, and the Bedouin Muslims living in the vicinity of the city of Medina should have accompanied Rasulullah SAW to the battlefield and it was not right for them not to love Rasulullah SAW because they love themselves more. If they don't go to war and just stay at home, this means they are not willing to endure all kinds of suffering to defend Allah's religion, they don't feel thirsty, weary and hungry, nor do they step on areas defended by unbelievers, and they don't also participate in inflicting a disaster on the enemy as felt and carried out by those who take part in the war. Even if they experience and carry out these things, they will undoubtedly be written down for them by Allah as good deeds every time they experience and carry out them, and will be given enormous rewards as was done for those who fought with the Messenger of Allah. Every good that is done by believers, both in the form of physical and spiritual sacrifice, will not be wasted by Allah, let alone the virtues to defend His religion. People who stay at home without reasons justified by Allah, are actually people who are selfish, not willing to sacrifice and suffer for the common good and to defend Allah's religion. Even though the pleasure they get in their household is purely a gift and a mercy from Allah. Loyalty and obedience to the Messenger of Allah must be in all situations and circumstances, both in times of joy and sorrow, which require sacrifice of self-pleasure, enjoyment of life, property and body and soul. Therefore, if a danger comes that threatens the common interest, the honor of the nation and religion, then every believer must stand up to fight together, regardless of profit or loss for oneself. This is more noble, than those who live in luxury, but lose self-respect, religion, nation and homeland. Allah does not waste every good deed and sacrifice given by every believer. He has prepared enormous rewards for the believers who have fought with the Messenger of Allah, and furthermore, for the believers who have fought in the way of Allah, until the Day of Judgment. The reward for every virtue is virtue anyway, this is a provision from Allah."
		   },
		   {
			"id": 1356,
			"surah": 9,
			"ayat": 121,
			"tafsir": "Allah explained that those who stayed at home and did not go to war with the Messenger of Allah, certainly did not contribute to the struggle and they did not share the exhaustion of crossing valleys and deserts. It's different with the people who go to war. Those who do and experience such things are undoubtedly recorded by Allah as good deeds, because Allah will give them a reward that is far higher in value than what they have donated and what they have done. People who participate in war and donate their wealth to the struggle in the way of Allah, mean that they have made two kinds of noble sacrifices, namely the sacrifice of property, and the sacrifice of body and soul. The noblest sacrifice, of course, has the right to be given the most noble reward, even the reward is higher than the sacrifice he has given. Regarding this matter, there has been a provision in Islam, as Allah says: Whoever does good will be rewarded tenfold for his deeds. (al-An'am\/6: 160) It should be remembered that the great reward is not only given by Allah to the believers who sacrifice their property and body and soul in war, but also to the believers who do good deeds in the field other. However, the sacrifices made in jihad on the battlefield to defend religion are more noble than sacrifices for other interests. So that the sacrifice of a small amount of wealth for the purposes of jihad is the same as the sacrifice of a large amount of wealth for other virtues. The little suffering suffered in jihad is equal to the great suffering experienced in other acts of charity."
		   },
		   {
			"id": 1357,
			"surah": 9,
			"ayat": 122,
			"tafsir": "In this verse, Allah explains that not all believers have to go to the battlefield, if only some of the Muslims can wage war. But there must be a division of tasks in society, some of them go to the battlefield, and some of them have to study and study the Islamic religion, so that the teachings of that religion can be taught evenly, and da'wah can be carried out in a more effective and useful way so that the intelligence of the people Islam can be improved. The war aims to defeat the enemies of Islam and secure the path of Islamic da'wah. While studying and studying religious sciences aims to educate the people and develop the Islamic religion, so that it can be disseminated and understood by all kinds of layers of society. Thus, this verse has a close relationship with the previous verses, because they both explain the law of jihad, but in different fields and ways. The task of the clergy in Islam is to study their religion, and practice it well, then convey this religious knowledge to those who do not know it. These tasks are the duty of the people and every individual Muslim, according to their respective abilities and knowledge, because the Messenger of Allah has said: Convey from me (what you have obtained), even if it is only one verse of the Qur'an just. (Al-Bukhari) However, not every Muslim has the opportunity to demand and study science and study religion, because he is busy with duties on the battlefield, in the fields, in factories, in shops and so on. Therefore there must be some Muslims who use their time and energy to study and study religious sciences, so that after they finish and return to society, they can spread this knowledge, and carry out Islamic da'wah in good ways and methods. thus achieving better results. If Muslims have understood the teachings of their religion, and have understood the laws of halal and haram, as well as religious orders and prohibitions, they will certainly be better able to protect themselves from misguidance and disobedience, be able to carry out religious orders well and be able to stay away from His prohibitions. Thus, Muslims become good people, prosper in the world and the hereafter. In addition, it should be remembered that if Muslims face a war that requires a lot of manpower, then in this case all Muslims must be mobilized to face the enemy. But when the war is over, each of them must return to their original duties, except for a number of people who are given a special assignment to maintain security and order, in the military and police services. Because this verse has stipulated that the function of science is to educate the people, it cannot be justified if there are Muslims who seek knowledge only to pursue rank and position or personal gain, let alone to use knowledge as pride and self-conceit towards those who have not received knowledge. People who already have knowledge must be a lamp and guide for their people. He must disseminate his knowledge, and guide others to have knowledge as well. Apart from that, he himself also has to practice his knowledge so that he can become an example and role model for those around him in obedience to carrying out religious rules and teachings. Thus it can be taken an understanding, that in the field of science, every believer has three kinds of obligations, namely: seeking knowledge, practicing it, and teaching it to others. According to the literal meaning of this verse, the obligation to seek knowledge which is emphasized by Allah is in the field of religious knowledge. However, religion is a living system that covers all aspects and facets of human life. Every science that is useful and can educate their lives, and does not conflict with religious norms, must be studied. Muslims are commanded by Allah to prosper this earth and create a good life. Science is a means to achieve that goal. Every means necessary to carry out obligations, is also obligatory by law. In this case, Islamic scholars have established a rule which reads: If something is required to carry out what is obligatory, then it is also obligatory. Because of the importance of the function of science and scholars, several Islamic countries exempt scholars (scholars) and students at religious colleges from compulsory military service, so that the teaching and development of science can always run smoothly, except when the state is facing a grave danger, which must be faced. by all levels of society."
		   },
		   {
			"id": 1358,
			"surah": 9,
			"ayat": 123,
			"tafsir": "The guidelines and instructions for fighting that Allah shows in this verse to the Prophet Muhammad and the Muslims are to first fight against the enemies of Islam who are on the circle line closest to the center of position of the Muslims, then proceed to circles that are farther away. This is based on the principle that the wars waged by Muslims are only to secure the path of Islamic da'wah and to protect the safety of Muslims, while the da'wah also starts from those who are closest, and continues to those who are farther away. Thus, it can be seen that there is harmony between Islamic da'wah and the war. These instructions have been well implemented by the Prophet Muhammad, both in the field of da'wah, as well as warfare which serves to secure the da'wah. Regarding da'wah, he had carried it out beforehand to his closest family and close friends, according to Allah's instructions. And warn your closest relatives. (asy-Syu'ara\/26: 214) And His words in another verse: and so that you warn (residents) of Ummul Qura (Mecca) and those outside their environment. (al-An'am\/6: 92) Then, he continued this preaching to the wider community, not only within the Arab countries, even to kings and nations around the Arabian Peninsula. Likewise in terms of war, in accordance with the previous verses, starting from the closest enemies of Islam, who always use deception to hinder the continuation of Islamic da'wah. Then proceed to the Arab tribes that are farther from the center of position or the base of the Muslims. After Rasulullah SAW died, the caliphs afterward continued the war to areas that were farther away, namely to the land of Sham (Syria) and Iraq. Then infiltrated the continents of Africa (west) and Persia, Khurasan, even to the Hindukust mountains (east) in accordance with the expansion of Islamic da'wah. The closest enemies of Islam to the Prophet and the Muslims at that time were infidels consisting of Jews who lived in the city of Medina, then in Khaibar, and then those who fought the Muslims in the Tabuk War, and after that the enemies Islam in the areas of Sham, which at that time was under the rule of the Eastern Romans, centered on Byzantium. The strategy of war by starting from the closest to the farthest is very appropriate, in terms of various aspects, namely: in terms of possible transportation facilities, supplies, and costs. The closer the location, the easier the ways of transportation, and thus the lower the costs and supplies required. The further away the places to be traveled, the more difficult the transportation will be, and the more time and supplies will be required. By itself the more costs and labor required. War under the guidance of Islamic teachings is a struggle that must be prepared to create peace as the saying goes in Arabic, which is expressed in the sentence: Peace armed In the general rule it is usually said, we must always be ready to fight to create peace. If we are not ready for war, the enemy can attack us at any time, but if we are ready for war, the enemy will not dare to attack us. That's why in the Qur'an, especially surahh at-Taubah, many issues of war are revealed and instructions to Muslims to always be ready for war with various strategies to bring about peace. Allah gives His instructions, so that Muslims are able to use violence and force against disbelievers who obstruct the propagation of Islamiyah, if the path of diplomacy and gentle and warm-hearted treatment is no longer beneficial for them. Muslims are commanded to be fair, compassionate and hospitable to non-Muslims. However, if they continue to interfere with the interests of the Muslim community, especially the da'wah of Islamiyah, then the Muslims must use force and power, so that they stop their hostility towards Islam and the Muslims. This is also stated in the word of Allah in another verse: O Prophet, strive (against) those disbelievers and hypocrites, and be tough on them. (at-Taubah\/9: 73) Thus it is clear that Muslims must be prepared to use two kinds of attitudes in dealing with infidels and hypocrites, namely, first, a diplomatic attitude that is flexible, gentle, and warm-hearted if they want to be invited to make peace. Infidels in this connection are referred to as infidel mu'ahidi or infidel zimmi, if they are citizens of our country. Second, be firm and if necessary use force, if they do not want to be invited to coexist peacefully. Infidels in such conditions are referred to as infidels harbi, so there is no way to deal with them except by force and war. At the end of this verse, Allah assures those who are pious that He is always with them. This means that Allah gives guarantees to those who are pious, that is, those who always maintain Allah's laws and provisions, that He will always provide His help and assistance. Allah's provisions that need to be considered in matters of war are so that Muslims do not neglect to prepare everything necessary to achieve victory, namely physical and mental strength. Physical strength includes: able-bodied and strong soldiers, effective weapons, formidable defenses, and sufficient supplies and equipment. While mental strength is: sincere intentions, high spirits, patience and tough tenacity, as well as precise war tactics and strong discipline, and solid unity. This includes the ethics of war and high morals, namely not being unjust to women, children, the weak old people, and not being cruel to people who have surrendered or been taken prisoner, as long as they do not harm the interests of Islam and the Ummah. Islam. To achieve this victory requires a firm faith, and remember and put your trust in Allah."
		   },
		   {
			"id": 1359,
			"surah": 9,
			"ayat": 124,
			"tafsir": "The attitude of the hypocrites during the time of the Prophet Muhammad saw included when the verses of the Qur'an were revealed to him and conveyed to them, then some of them asked their friends, both from the hypocrites themselves and their friends. from Muslims who are weak in faith that which of them has increased in faith with the revelation of this surahh. This ensures that this Qur'an is truly from Allah that Muhammad is truly a messenger of Allah, that every verse of the Qur'an is a miracle to Muhammad, and that the Qur'an was not Muhammad's creation. If one pays attention to the questions of the hypocrites mentioned in these verses, it is felt that the question was not intended to ask something that is not known, but to show what is in their hearts; that is they do not believe in the Prophet, even though their mouths have acknowledged it. In fact, they want Muslims who are weak in faith to be like them too. If there were no disease in the hearts of the hypocrites, they would surely know that true faith which is accompanied by submission and self-serving to Allah, because they have felt and believed in His power, will surely increase by hearing and reading the verses of Al-Qur'an. -Qur'an, especially if you hear it directly from Rasulullah SAW himself. These hypocritical traits are explained in His word: They deceive Allah and those who believe, but they are only deceiving themselves without knowing it. In their hearts there is a disease, then God increases the disease; and they will have a painful punishment, because they lied. (al-Baqarah\/2: 9-10) Regarding the impression the verses of the Qur'an have on the hearts of believers, this is explained in the word of Allah: Actually, (the Qur'an) are clear verses in the bosom of knowledgeable people. Only those who are wrongdoers deny Our verses. (al-'Ankabut\/29: 49) Allah answered the questions of the hypocrites with the expression at the end of this verse which means those who believe, then this surah increases their faith and they feel happy."
		   },
		   {
			"id": 1360,
			"surah": 9,
			"ayat": 125,
			"tafsir": "The answers to their questions about the Qur'an are explained in this verse. As for those whose hearts are doubtful and those who are hypocrites, namely those whose hearts are full of disbelief while their mouths proclaim faith, every verse that is delivered to them always creates doubt and hypocrisy in their hearts. Things like this are always getting stronger influence on them, so that in the end they die as a disbelieving hypocrite. What they experience will be experienced by people after them, whose hearts are the same as theirs, they will die as infidels."
		   },
		   {
			"id": 1361,
			"surah": 9,
			"ayat": 126,
			"tafsir": "In this verse, Allah does not justify or even condemn the attitude of the hypocrites who remain disobedient, do not want to repent, and do not take lessons from the events they have experienced. Even though they have been brought to them every year trials and bitter experiences as well as defeats that should strengthen one's faith so that one is able to distinguish between right and wrong. Their various trials, tests, and experiences, if they are willing to think about it properly, will certainly bring them to the conclusion that Muhammad is really the Prophet sent by Allah to them. However, they still deny and do not want to repent and take lessons from it. Even their hearts grow astray and grow in denial."
		   },
		   {
			"id": 1362,
			"surah": 9,
			"ayat": 127,
			"tafsir": "This verse explains the attitudes and actions of the hypocrites at the Prophet's assembly when the verses of the Qur'an were revealed. When a verse or a surahh was revealed to the Prophet, they looked at each other and blinked their eyes as a sign of looking down on what had been revealed. This attitude of theirs shows that the influence of disbelief has taken root in their souls. They actually don't want to listen to the verses of the Qur'an from the Prophet, and they don't want other people to get guidance from the Qur'an. The attitude of other hypocrites is this: they secretly left the Prophet's assembly while asking one another to their fellow friends, \"Is there anyone who saw us leaving the ceremony?\" While the believers listen and pay attention to the verses with submission and attention. It is the attitude of these hypocrites that makes Allah turn their hearts away from faith and from the guidance contained in the verses of the Qur'an. Allah did this because they first denied the Prophet's call and ignored the instructions of the Qur'an."
		   },
		   {
			"id": 1363,
			"surah": 9,
			"ayat": 128,
			"tafsir": "Even though this verse was specifically addressed to the Arab nation at the time of the Prophet, it was also addressed to all mankind. Originally addressed to the Arabs at the time of the Prophet, because it was to them that the Qur'an was first delivered, because the Qur'an was in Arabic, of course the Arabs were the most able to understand and feel the literary elevation of the Qur'an. Thus they are also easy to convey to people other than the Arab nation. If the Arabs themselves do not believe in Muhammad and the Qur'an, it is more difficult for non-Arabs to believe in them. This verse seems to remind the Arabs, as its content reads, \"O Arabs, a Messenger has been sent from your own people whose origins and personality you fully know, and you know better than the people other.\" Some commentators interpreted the words \"Rasulun min anfusikum\" with the hadith: The Prophet said, \"Indeed, Allah has chosen Bani Kinanah from the descendants of Ismail, and chose the Quraysh tribe from Bani Kinanah, and chose Bani Hasyim from the Quraysh tribe, and Allah has chosen me from Bani Hasyim .\" (Muslim history and at-Tirmidhi from Wasilah bin Asqa) From the above verses and hadiths it can be understood about the sanctity of the descendants of the Prophet Muhammad, who came from selected tribes from the Arab nation. And the Arabs know this very well. The Prophet Muhammad, who came from a good and honorable lineage, had noble and noble characteristics, namely: 1. The Prophet felt unhappy if something undesirable happened to his people, such as being humiliated because they were colonized and enslaved by the enemies of the Muslims, as he is also not happy to see his people suffer a painful punishment in the afterlife. 2. The Prophet really wanted his people to get taufik from Allah, strengthen their faith, and improve their condition. His desire is described by Allah in His word: If you (Muhammad) really hope that they will get guidance, then surely Allah will not guide those who are led astray, and they have no helpers. (an-Nahl\/16: 37) And Allah said: And most people will not believe even if you really wanted to. (Yusuf\/12: 103) 3. The Prophet was always compassionate and very compassionate towards Muslims. This desire can be seen in the purpose of the treatise he conveyed, namely for humans to live happily in this world and the hereafter. In this verse Allah gives two kinds of characteristics to the Prophet Muhammad, these two characteristics are also the characteristics of Allah himself, which are included among the \"asmaul husna\", namely the nature of \"rauf\" (very compassionate) and the nature of \"rahim\" (merciful) as such. in His words: ...Indeed, Allah is Most Gracious, Most Merciful to humans. (al-Baqarah\/2: 143) The gift of these two characteristics to Muhammad shows that Allah made Muhammad the Prophet he glorifies."
		   },
		   {
			"id": 1364,
			"surah": 9,
			"ayat": 129,
			"tafsir": "This verse instructs the Prophet Muhammad and his people that if those disbelievers and hypocrites still do not want to believe after guidance has been brought to them, say to them, \"Allah is sufficient for me, and He will help me, there is no other God to be worshiped, except Him, only in Him do I put my trust and surrender myself, and only He rules and takes care of the universe, He has the 'Glorious Throne. It was narrated from Zaid bin Sickle who was commissioned by 'Umar ra to collect the Al-Qur'an which was still uncollected at the time of Abu Bakr, that Zaid said, \"...Until I got the last two verses of surahh at-Tauba in the records of Khuzaimah bin sickle of al-Ansari, I did not get it before from anyone, while the two verses are memorized and known by many people.\" (History of al-Bukhari, at-Tirmidhi, an-Nasa'i and other narrators)."
		   }
	]
}
