{
	"nama_indo": "Sholat Sunnah",
	"nama_eng": "Sunnah Prayer",
	"sunnah": [
		{
			"number": 1,
			"indo": "Sholat sunnah rawatib",
			"eng": "Rawatib sunnah Prayer"
			"desk": "Pengertian Shalat Sunnah Rowatib\nShalat Sunnah Rowatib adalah shalat sunah yang waktu pelaksanaannya  mengiringi shalat fardu lima waktu. Shalat tersebut dilakukan sebelum atau sesudah shlat fardu.\n\nSholat Sunat Rawatib yang dikerjakan sebelum sholat fardu disebut rawatib qobliyah, sedangkan Sholat Sunat Rawatib yang dikerjakan sebelum sholat wajib disebut rawatib bakdiyah.\n\nHukum Sholat Sunat Rawatib.\nSholat Sunat Rawatib itu bila ditinjau dari segi hukumnya terbagi dua :\n\nSholat Sunat Rawatib Muakkad yaitu sholat sunah yang sangat dianjurkan untuk dilaksanakan, karena selalu dikerjakan oleh Nabi Muhammad Saw.\n\nSholat Sunat Rawatib Muakkad terdiri dari :\n\nDua rakaat sebelum sholat Subuh.\nDua rakaat sebelum sholat Zuhur.\nDua rakaat sesudah Shola Zuhur.\nDua rakaat sesudah sholat Magrib.\nDua rakaat sesudah sholat Isya\n\nDalil naqlinya  yang menjelaskan tentang Sholat Sunat Rawatib Muakkad !\n\nartinya:\"Dari Abdullah bin Umar, ia berkata: \"Saya ingat dari Rasulullah Saw, dua rakaat sebelum Zuhur, dua rakaat sesudah Zuhur, dua rakaat sesudah Magrib, dua rakaat sesudah Isya, dan dua rakaat sebelum Subuh\".  (HR. Bukhari dan Muslim).\n\nSholat Sunat Rawatib ghoiru Muakkad yaitu sholat sunah yang kurang dianjurkan untuk dilaksanakan, karena Nabi Muhammad Saw tidak selalu melaksanakannya.\n\nSholat sunat Rawatib ghairu Muakkad terdiri dari :\n\nDua rakaat sebelum Sholat Zuhur.\nDua rakaat sesudah Sholat Zuhur.\nEmpat rakaat sebelum Sholat Ashar.\nDua rakaat sebelum Sholat Magrib. 5) Dua rakaat sebelum Sholat Isya.\nCara melaksanakan shalat rawatib\nCara melaksanakan Sholat Rawatib baik sebelum mapun sesudahnya (qobliyah dan ba'diyah dikerjakan dua rakaat sama dengan sholat fardu baik gerakannya maupun bacaannya, tetapi yang berbeda hanyalah niatnya.\n\nNamun ada beberapa hal yang perlu diperhatikan dalam melaksanakan sholat sunah rawatib sbb:\n\nTidak didahului azan dan iqomah.\nDilaksanakan secara munfarid (sendirian).\nBacaannya tidak dinyaringkan.\nJika lebih dari dua rakaat, maka setiap dua rakaan satu dalam.\nSebaiknya tempat mengerjakan sholat rawatib pindah sedikit dari tempat mengerjakan sholat fardu.\nDiutamakan pada rakaat pertama membaca Surat Al Kafirun, dan pada rakaat kedua membaca Surat Al Ikhlas.\nDiawali dengan niat menurut macam sholatnya.\nNiat melaksanakan sholat rawatib cukup dalam hati sesuai dengan macam sholat rawatib tersebut, tetapi boleh diucapkan atau dilafalkan.",
			"desk_eng": "The definition of the Sunnah Rowatib\nPrayer The Sunnah Rowatib prayer is a sunnah prayer whose implementation time accompanies the five daily fardu prayers. The prayer is performed before or after the fardu prayer. \n\nThe Rawatib Circumcision Prayer which is performed before the fardu prayer is called Rawatib qobliyah, while the Rawatib Circumcision Prayer which is performed before the obligatory prayer is called caretib bakdiyah.\n\nThe law of Rawatib Circumcision Prayer. when viewed from a legal perspective, it is divided into two:\n\nRawatib Muakkad Circumcision Prayer, which is a sunnah prayer which is highly recommended to be carried out, because it was always performed by the Prophet Muhammad. \n\nRawatib Muakkad Circumcision Prayer consists of:\n\nTwo cycles before the Fajr prayer .\nTwo rak'ahs before the Zuhr prayer. Umar, he said: \"I remember from the Messenger of Allah, two cycles before Zuhr, two cycles after Zuhr, two cycles after Maghrib, two cycles after Isha, and two cycles before Subuh\". (Narrated by Bukhari and Muslim).\n\nRawatib ghoiru Muakkad circumcision prayer is a sunnah prayer that is not recommended to be performed, because the Prophet Muhammad did not always perform it.\n\nRawatib ghoiru Muakkad circumcision prayer consists of:\n\nTwo cycles before Zuhur Prayer.\nTwo cycles after Zuhur Prayer.\nFour cycles before Asr Prayer. 5) Two cycles before the Isya Prayer.\nHow to perform the Rawatib prayer\nThe way to perform the Rawatib Prayer both before and after (qobliyah and ba'diyah are done in two cycles is the same as the fardu prayer both in the movements and in the readings, but the only difference is the intention.\n\nHowever There are several things that need to be considered in carrying out sunnah prayers, as follows:\n\nNot preceded by the call to prayer and iqomah.\nIt is carried out individually.\nThe reading is not filtered. It's best if the place for performing the prayers is moved a little from the place for performing the fardu prayers. Preferably in the first cycle read Surah Al Kafirun, and in the second cycle read Surah Al Ikhlas. Begin with the intention according to the type of prayer. the kinds of nursing prayers, but may be said or recited."
		},
		{
			"number": 2,
			"name": "Sholat sunnah wudhu",
			"eng": "Sunnah ablution prayer"
		},
		{
			"number": 3,
			"name": "Sholat sunnah tahiyyatul masjid",
			"eng": "Sunnah tahiyyatul prayer at the mosque"
		},
		{
			"number": 4,
			"name": "Sholat sunnah tahajjud",
			"eng": "Tahajjud sunnah prayers"
		},
		{
			"number": 5,
			"name": "Sholat sunnah tarawih",
			"eng": "Taraweeh  sunnah prayer"
		},
		{
			"number": 6,
			"name": "Sholat sunnah witir",
			"eng": "Witir sunnah prayer"
		},
		{
			"number": 7,
			"name": "Sholat sunnah dhuha",
			"eng": "Dhuha sunnah prayer"
		},
		{
			"number": 8,
			"name": "Sholat sunnah isyroq",
			"eng": "Isyroq sunnah prayer"
		},
		{
			"number": 9,
			"name": "Sholat sunnah awwabin",
			"eng": "Awwabin sunnah prayer"
		},
		{
			"number": 10,
			"name": "Sholat sunnah tasbih",
			"eng": "Tasbih sunnah prayer"
		},
		{
			"number": 11,
			"name": "Sholat sunnah hajat",
			"eng": "Hajat sunnah prayer"
		},
		{
			"number": 12,
			"name": "Sholat sunnah taubat",
			"eng": "Prayer sunnah repentance"
		},
		{
			"number": 13,
			"name": "Sholat sunnah istikharah",
			"eng": "Istikharah sunnah prayer"
		},
		{
			"number": 14,
			"name": "Sholat sunnah ied",
			"eng": "Eid sunnah prayer"
		},
		{
			"number": 15,
			"name": "Sholat sunnah istisqa'",
			"eng": "Istisqa' sunnah prayer"
		},
		{
			"number": 16,
			"name": "Sholat sunnah gerhana",
			"eng": "Eclipse sunnah prayer"
		},
		{
			"number": 17,
			"name": "Sholat sunnah mutlaq",
			"eng": "Mutlaq sunnah prayer"
		},
		{
			"number": 18,
			"name": "Sholat sunnah raghaib",
			"eng": "Raghaib sunnah Prayer"
		},
		{
			"number": 19,
			"name": "Sholat sunnah nisfu sya'ban",
			"eng": "Sunnah prayer nisfu sya'ban"
		},
		{
			"number": 20,
			"name": "Sholat sunnah sebelum akad nikah",
			"eng": "Sunnah prayers before the marriage"
		},
		{
			"number": 21,
			"name": "Sholat sunnah zafaat",
			"eng": "Zafaat  sunnah Prayer"
		},
		{
			"number": 22,
			"name": "Sholat sunnah safar",
			"eng": "Safar sunnah Prayer"
		},
		{
			"number": 23,
			"name": "Sholat sunnah ihram",
			"eng": "Ihram sunnah Prayer"
		},
		{
			"number": 24,
			"name": "Sholat sunnah thawaf",
			"eng": "Thawaf sunnah Prayer"
		}
	]
}
