{
	"tafseer": [
		{
			"id": 1597,
			"surah": 12,
			"ayat": 1,
			"tafsir": "The first verse of sura Yunus sounds the same as the first verse of surah Yunus except that at the end of the first verse of sura Yunus there is the word \"al-hakim\" while in the first verse of this surah there is the word \"al-Mubin\". Al-hakim means full of wisdom and al-Mubin means real, clear and bright. Usually, by paying attention to the first verse of each surah, one can already predict what the main contents of that surah are. surahh Yunus, whose first verse ends with al-Hakim, contains issues of wisdom and philosophy, such as the problem of the oneness of Allah, His attributes, the truth of the message brought by the prophets which is strengthened by various kinds of miracles, the problem of the day of resurrection, the day revenge, and so on. All of these are matters that must be contemplated and thought about deeply and include matters of wisdom and philosophy. As for surahh Yusuf, the first verse ends with al-Mubin. This suggests that in it there is a very interesting story, composed with an enchanting arrangement of words full of origins and philosophies in a beautiful storyline that encourages the reader to follow it to the end, a story that should be an example and a role model that illustrates it is clear how the life of a noble prophet since his childhood experienced various kinds of suffering until he became a respected and respected ruler in the land of Egypt."
		   },
		   {
			"id": 1598,
			"surah": 12,
			"ayat": 2,
			"tafsir": "In this verse, Allah confirms that He sent down the Al-Quran in fluent Arabic so that one can contemplate and think about its content and meaning. Indeed, the Koran was revealed for all humans, even for jinns, but since the first to receive it were the residents of Mecca, it is only natural that the word was addressed first to them and then applies to all mankind. First of all, Allah demands the attention of the Quraysh and the Arabs as a whole so that they pay attention to its contents as well as possible because it contains various kinds of knowledge that will benefit them in this world and the hereafter such as religious laws, stories of the prophets. and apostles, matters related to community development, the principles of prosperity, morals, philosophy, political procedures, both national and international, and so on. All of this was explained in beautiful Arabic, the composition of which was easy for them to understand."
		   },
		   {
			"id": 1599,
			"surah": 12,
			"ayat": 3,
			"tafsir": "In this verse, Allah specializes His words to the Prophet Muhammad and of course to be noticed by Arabs and mankind as a whole. The commentators say that this sura Yusuf is one of the surahhs in the Koran which was sent down to comfort and rejoice the Prophet Muhammad when he was suffering from heavy pressure from the Quraysh in the form of ridicule, insults, defiance, and acts of violence so that he was forced to emigrated with Abu Bakr to Medina. This is indeed the case because the story of the Prophet Yusuf is a very interesting story, told in detail, each chapter contains deep wisdom and lessons that are of great benefit to those who pay attention to it, especially when viewed in terms of the beauty of the language structure and the contents of the story which are not yet known entirely by the Prophet Muhammad himself as well as by the Quraysh and Arabs in general. In addition to telling the story of the Prophet Jacob as and his children who are still living with the way of life of the Bedouin people, it also tells how life in a society that has developed and has a high culture, how the life of the rulers is full of luxury and pleasure and how they control the government and control the country's economy. It is true that the word of God says that the story of the Prophet Yusuf as which will be narrated below is the story of the best, most interesting, and the most beautiful depiction."
		   },
		   {
			"id": 1600,
			"surah": 12,
			"ayat": 4,
			"tafsir": "Once upon a time the Prophet Yusuf as told his father the Prophet Jacob bin Ishak bin Ibrahim that he dreamed of seeing eleven stars, the sun and the moon, all of them bowed down and prostrated to him. Of course, prostration here does not mean worship as we know it, but only prostrate in a figurative sense, namely submission and obedience. Prostration with the meaning of submission and obedience is also found in the Qur'an, as Allah says: And plants and trees, both are subject (to Him). (ar-Rahman\/55: 6) After hearing the story, the Prophet Jacob realized that his son's dream was not an ordinary dream, but an inspiration from Allah as often experienced by the prophets. He believes that this child will face very important matters and when he grows up he will become a leader to whom society will obey, including his siblings and parents. He was worried that his brothers and sisters would find out about this, and of course they would feel jealous and jealous of him and try to get rid of or destroy him, especially since they felt that their father was more affectionate towards him. It is illustrated in the visions of the Prophet Jacob how the fate of his son would have been if his brothers knew that dream, of course they would have harmed him with all their efforts and deceit."
		   },
		   {
			"id": 1601,
			"surah": 12,
			"ayat": 5,
			"tafsir": "Therefore, the Prophet Jacob said to his son, \"O my son, don't ever tell me what you saw in the dream, because if they find out, they will understand the veil of the dream and they will be jealous and jealous of you. I see that the dream was not just any dream. Your dream was an inspiration from Allah that you will later become a big and influential person, and humans will obey you including your brothers and I and your mother. I cannot guarantee that your brothers and sisters I won't do bad things to you.\" Joseph's father's advice was fully realized and he always remembered and remembered so that later at the end of the story when he was able to meet his entire family, he continued to say that it was Satan who deceived his brothers so that the connection between him and his family was cut off, as stated in the word of God: And he (Yusuf) said, “O my father! ) between me and my brothers. Truly, my Lord is All-gentle towards what He wills. Indeed, He is All-Knowing, All-Wise.\" (Joseph\/12: 100)"
		   },
		   {
			"id": 1602,
			"surah": 12,
			"ayat": 6,
			"tafsir": "Then his father said, \"Thus God will choose you to be a prophet and raise your rank to be a ruler and bestow on you various kinds of favors and glory. He will give you knowledge by inspiring it to you. With that knowledge you can veil dreams and know things that you cannot common man knows.\" This was proven when Joseph was in prison, able to foreshadow the dream of the king of Egypt so that he became a respected person and was appointed supreme ruler. Apart from that, you can find out what food will be brought by the prison staff before the food reaches his friend's room, as stated in the word of Allah in this surah as well. He (Yusuf) said, \"Whatever food will be given to you both, I have been able to explain the takwil, before (the food) reaches you. That is part of what God taught me.\" (Yusuf\/12: 37) Then Jacob said again to Joseph in this verse, \"God will perfect His favor and gift to you and to Jacob's family including your father, your brother, and their descendants later in the day. As for His favor and gift to you is as explained earlier, while His favor and gift to your father and mother and your brothers and their descendants is that they are released from various kinds of difficulties and dangers and get honor and position in Egypt, then among the descendants of Jacob's family will also be raised several prophets. All these blessings and gifts have been given by Allah to your grandfather Ibrahim and Isaac. To Abraham, Allah has promised to choose between his family and descendants to receive prophethood and the holy book.\" Jacob continued again, \"Thus the veil of the dream and be happy with the mercy and grace of God that will be bestowed on you, but you must be steadfast and patient in facing all its tests and full of trust and willing for everything that He inflicts on you, because He is All-Wise and All-Knowing. what He decreed.\""
		   },
		   {
			"id": 1603,
			"surah": 12,
			"ayat": 7,
			"tafsir": "Allah warns in advance that in the story of the Prophet Yusuf as there is a good example and a lesson for those who pay attention to it, namely how great is the power of Allah, and how extensive is His wisdom and wisdom in arranging things in a series of events that finally reach the intended goal. namely the giving of grace and gifts to those he loves. After that, God told how the attitude of Joseph's brothers towards him."
		   },
		   {
			"id": 1604,
			"surah": 12,
			"ayat": 8,
			"tafsir": "Yusuf's brothers said to each other, \"In fact, our father loves Yusuf and his brother Bunyamin more and pays more attention to them, even though we are the ones who deserve more to be loved and cared for, because we have become adults who are strong and can defend them and protect them. meet all his needs. Our father's attitude is contrary to justice and equal rights between children. Why did you give priority to these two weak and helpless children over us who are strong and more able to serve and be devoted to them?\" At a glance, it is clear that the truth of the words of Yusuf's brothers was clear, as if the Prophet Jacob had made a mistake with his actions even though he was a prophet who was always guided by Allah in all his attitudes and actions. According to history, Jacob really paid great attention to Joseph, because there were hunches and signs that indicated that Joseph had special traits and characteristics. This privilege is not owned by his other brothers. So Jacob really put his hope in him, especially after he heard Joseph tell his dream. If Jacob loves Yusuf more and pays more attention to him, then this is natural, because Yusuf and Bunyamin are still small and need more attention and guidance from their parents than their older siblings. It was only jealousy and jealousy that prompted his brothers to commit acts of hostility against him, not because their father had deviated from the path of justice."
		   },
		   {
			"id": 1605,
			"surah": 12,
			"ayat": 9,
			"tafsir": "In a deliberation to determine the right and decisive action against Joseph, they suggested that he should be killed or thrown away to a faraway place, so that he might not return or perish and die in that exile. Thus, their father Jacob would give up and have no hope of meeting his son who he loved the most, and over time, of course, he would forget about it. So far, the only thing that had prevented him from paying attention to them was Yusuf by his side. If Joseph was gone or exiled to a far country, surely their father would come back to care for and love them. They realized that this action was an act that was cruel and inhuman, a criminal act that was very sinful. However, they have strayed far from the right path and fallen into Satan's snares, so that they no longer see the consequences of their actions for their fathers and themselves if they are committed. They persuade themselves that, even though they have sinned, the door to repentance is still wide open. They will repent with nasuha repentance and will not do that again, and become pious servants of God. Of course Allah will accept repentance, forgive all the sins and mistakes of His servants, thus their father will be pleased with them, and Allah will not torture them."
		   },
		   {
			"id": 1606,
			"surah": 12,
			"ayat": 10,
			"tafsir": "It seems that there are still some of them who do not want to carry out this suggestion and still have feelings of affection for their brothers and sisters imagining in their imaginations how horrific this act is. He suggested that Yusuf should not be killed if he only wanted to separate him from his father and draw their father's attention back. Why do we have to commit murder to achieve that goal, commit a grave sin that God will not necessarily forgive? He has a not so serious suggestion of sin, namely to drop Joseph into a well and later he will be found by travelers and will be taken to a distant land. Thus, Joseph will not die and they are free from the sin of murder while the aims and objectives are achieved as well. In the end, they accepted this suggestion well, and they were determined in their hearts to carry it out."
		   },
		   {
			"id": 1607,
			"surah": 12,
			"ayat": 11,
			"tafsir": "In this verse, one can clearly imagine how great the Prophet Jacob's suspicion was towards Yusuf's brothers and his concern if he let Yusuf hang out with them, especially after hearing Yusuf's story about his dream. Their father's attitude was very upsetting and offending them. They frankly said, \"O our father, why do you always suspect us of Yusuf, even though we still love and care for him, always try to make him happy and happy, and it never crossed our minds that we would hurt his heart let alone abuse him. Why don't you let him hang out, mingle naturally as if you were suspicious of us.\""
		   },
		   {
			"id": 1608,
			"surah": 12,
			"ayat": 12,
			"tafsir": "Yusuf's brothers again persuaded his father by stating, \"Let him go recreation with us tomorrow to the grazing area, sports, and competitions. We will bring delicious food and delicious fruit, which we will eat after playing. -play. We will always look after and protect him from all harm. Trust him to us. God willing, he will be happy with us and we will like him too, and we will bring him home safely and nothing is missing.\""
		   },
		   {
			"id": 1609,
			"surah": 12,
			"ayat": 13,
			"tafsir": "Jacob said to them, \"O my children! I will be anxious and sad if you take him to play sports and races and live alone because he is small, and can't serve you to play? Who knows the wolf will come and attack him while you everyone is having fun.\""
		   },
		   {
			"id": 1610,
			"surah": 12,
			"ayat": 14,
			"tafsir": "They replied, \"O our father, it is really out of place for you to be suspicious and anxious like that and don't worry about Yusuf's safety. We are big and mature, we are all strong people, and we have promised I will take care of it. What father is worried about will not happen, and if it does then what is the meaning of life for us, if we who are big and strong cannot guarantee the safety of our little brother. Thus we will be among the losers. worthless person.\" Finally, because of the very strong pressure from Joseph's brothers and they had also given guarantees, Jacob, with heavy feelings, was forced to give permission for them to take Joseph to play with the shepherds in the desert."
		   },
		   {
			"id": 1611,
			"surah": 12,
			"ayat": 15,
			"tafsir": "In verse 10 of this surahh it has been explained that Yusuf's brothers had agreed to put Yusuf into the well in the hope that a caravan would find him who wanted to fetch water and take him to a distant land so that he would not be able to meet his father again. In this verse it is explained that when they arrived at a place where there was a well they executed their evil plot, and put Yusuf into the well. Thus, they feel very happy because the scourge that has been haunting their souls is no longer there. They thought it was Joseph who had stolen his father's affections and now that he was gone Jacob's affections would surely spill over to them. What about Joseph himself who had been languishing in that dark well? Of course he was very sad and imagined in his mind that he would die of cold and hunger and would never meet his parents and siblings again. At that very critical moment, Allah inspired him so that he should not worry and not be sad. Allah will take care of him and deliver him from the harm that befell him. Later he will receive help from the caravan and finally he will get a high position, so that he can remind his brothers of their betrayal, while they themselves are not aware that the person who told it was Joseph himself."
		   },
		   {
			"id": 1612,
			"surah": 12,
			"ayat": 16,
			"tafsir": "In these two verses it is told that Joseph's brothers returned to meet Jacob at night with pale faces and with tears streaming down and said, \"O our father, what you have been worried about all this time has really happened without our will. We went to play, and we left Yusuf to look after our clothes and belongings. Apparently without us realizing it because we were playing so much, we were far apart from him. When we returned, we found Yusuf had been pounced on and eaten by wolves. We didn't heard his screams and screams because we had left his place far away. We realized that father would not believe in our story, even though we told him what had actually happened because father had always been suspicious of us. But this undeniable unfortunate thing happened and we too powerless to help him.\""
		   },
		   {
			"id": 1613,
			"surah": 12,
			"ayat": 17,
			"tafsir": "In these two verses it is told that Joseph's brothers returned to meet Jacob at night with pale faces and with tears streaming down and said, \"O our father, what you have been worried about all this time has really happened without our will. We went to play, and we left Yusuf to look after our clothes and belongings. Apparently without us realizing it because we were playing so much, we were far apart from him. When we returned, we found Yusuf had been pounced on and eaten by wolves. We didn't heard his screams and screams because we had left his place far away. We realized that father would not believe in our story, even though we told him what had actually happened because father had always been suspicious of us. But this undeniable unfortunate thing happened and we too powerless to help him.\""
		   },
		   {
			"id": 1614,
			"surah": 12,
			"ayat": 18,
			"tafsir": "To strengthen the truth of the story they brought Joseph's clothes which were covered in blood and they said to his father, \"This is proof of our truth.\" In fact, the blood attached to the shirt was not Joseph's blood. Jacob looked and noticed the clothes. He found that the clothes were only stained with blood, but still intact, nothing was torn and none had holes from the claws and bites of the wolf. Surely it was his brothers who had wronged him, so he said to them, \"I don't believe I am absolutely sure that your evil and filthy soul influenced and prompted you to persecute your own brother.\" But what power can an old father have over his children who are already big and strong. He couldn't do anything else except hold back his anger and suppress his very disappointed and sad feelings. Now the child he loves the most and on whom he has always pinned his hopes is no longer by his side because of the actions of his own children. Will he seek revenge or will he investigate for himself where his son really is, while he is powerless anymore. In such circumstances there is nothing better for him than to be patient and completely trust Allah. Jacob chose this path even though he was still sad and still crying over the loss of his heart. He did not believe the story of his children at all. Therefore, he surrendered to God and always asked for His help so that his son Joseph would be saved from all harm."
		   },
		   {
			"id": 1615,
			"surah": 12,
			"ayat": 19,
			"tafsir": "Not long after Joseph was in the well, a caravan came from Midian to go to Egypt. It so happened that their water supply had run out and they went to the well and dropped a bucket into it to get water. Seeing the bucket being stretched into the well, Joseph's heart was happy and hope arose in his heart that he would be able to get out of the danger he was facing. Quickly he held the bucket tightly, so that the person who was weighing it wondered why the water from the well was so heavy. But they still pulled the rope together, and it turned out that it was not water that was lifted, but a little boy who was sweet and beautiful. How happy the caravan leader was to see this healthy and fit child. Imagine in his mind he will get a big profit by selling it to the rich man in Egypt later. He quickly ordered Yusuf to be hidden so that no one else would see him because maybe the people in the area would admit that the child was the child of the villagers themselves. But Allah is All-Knowing of the intentions of the caravan leader, just as He knows what the intentions and purposes of Joseph's brothers put him in the well."
		   },
		   {
			"id": 1616,
			"surah": 12,
			"ayat": 20,
			"tafsir": "Finally the caravan arrived in Egypt and there they sold Joseph at a very cheap price compared to the high price of slaves in that country, moreover Joseph was a handsome and fit child. The commentators said about \"several dirhams that were counted\" that what was certain was that the price was less than 40 dirhams because according to custom there if the amount of money was 40 dirhams or more, then the money was not counted anymore but was weighed. They sold Joseph at such a cheap price because they were worried that if someone knew that Joseph was not a slave, why would he be traded when he was a free child, a good man's son. It was because of that worry that they wanted to get rid of him quickly, as long as they were given any amount of money that would be enough for them. Apparently it was destined by Allah that they sold Yusuf to a very influential ruler in Egypt, namely a rich minister called al-Aziz so that he would get the opportunity to ascend to power and glory."
		   },
		   {
			"id": 1617,
			"surah": 12,
			"ayat": 21,
			"tafsir": "The minister who took Joseph was very happy and elated because he was able to buy a child who was beautiful in appearance, fresh and healthy in body, plus there were good signs in him indicating that he would have a glorious future just like his father Jacob's premonition of him. It was narrated that Abdullah bin Masud once said about this, he said, \"The people whose hunch was most correct were three people, first, al-Aziz when he ordered his wife to give Yusuf a good place and position in his palace; second, the sheikh's daughter from Madyan who asked his father so that the Prophet Musa was entrusted with the task of looking after his sheep as a payday person; and thirdly, Abu Bakr when he appointed Umar bin Khaththab as his successor. Because of his joy, the minister ordered his wife, \"Give him a good place in the palace This. Treat him as a member of the family, not as a servant or servant, because he will become someone who has contributed to us and the country, or we will adopt him as a child we love and care about who will be our heir in the future.\" Thus Allah arranged and predestined him. paved the way for Joseph and gave him the opportunity to develop his talent and intelligence so that he got a high position in Egypt. Besides that, Allah also taught him the science of interpreting dreams and with that knowledge he could later get in touch with the king by interpreting dreams. the king so that he was released from prison and gained enormous trust and finally handed over to him the affairs of the treasury and the wealth of the country.Thus Allah carries out His will, but most people do not know."
		   },
		   {
			"id": 1618,
			"surah": 12,
			"ayat": 22,
			"tafsir": "When Joseph was growing up, God also gave him intelligence and wisdom so that he was able to give his opinion and thoughts on various kinds of problems he faced. Allah also gave him knowledge, even though he did not study. This knowledge that is acquired without studying is called ladunni science because it is solely an inspiration and a gift from Allah. Thus Allah rewarded Yusuf who never polluted himself with heinous and evil deeds, always kept his conscience clean, was always patient and trustful of the calamities and dangers that befell him. Thus Allah repays every human being who does good."
		   },
		   {
			"id": 1619,
			"surah": 12,
			"ayat": 23,
			"tafsir": "Al-Aziz's wife was a beautiful woman, highly respected by all the inhabitants of the palace, because beside her al-Aziz's wife, she was also virtuous, had noble character, was clean from arrogant and arrogant traits, away from anything that would bring down her rank. But after Yusuf lived in the palace as one of his family, al-Aziz's wife began to be attracted to him because of his morals and good looks. Once, after locking all the doors of the house, al-Aziz's wife seduced Yusuf to have an affair. Yusuf, as an honest and noble man, was very surprised to hear the flattery and invitation, especially since the one who invited him was the wife of his own employer, who had given him shelter and treated him like his own child. Apart from that, if he complies with such an invitation, it means that he has committed a sin that is very angry with Allah. Because of that she spontaneously replied, \"I take refuge in Allah so that I do not fall into heinous and unjust acts. Your husband is my master, my employer who has been good to me, will I repay his kindness with cruelty? This is an injustice and I will not do it because there is no wrong person who is successful and happy in his life.\""
		   },
		   {
			"id": 1620,
			"surah": 12,
			"ayat": 24,
			"tafsir": "Al-Aziz's wife did not want to stop, because she considered Yusuf as a slave who had to carry out his wishes and orders. If Yusuf refuses, al-Aziz's wife will harm him. But from Joseph's side, he was also determined to reject it because this act violated religion, betrayed his master who had served and done good to him and damaged his honor and the honor of his master. Yusuf and al-Aziz's wife each had conflicting determinations between one another."
		   },
		   {
			"id": 1621,
			"surah": 12,
			"ayat": 25,
			"tafsir": "In this situation that was getting worse, one person kept pushing and the other still refused, Yusuf decided to run away from the front of his master's wife and quickly jumped to the door but al-Aziz's wife caught his shirt from behind until it was torn. In a state of attraction, al-Aziz appeared at the door. Immediately al-Aziz's wife screamed saying that Yusuf was trying to rape her by force. She asked her husband to give Joseph the reward he deserved. The proper retribution for those who commit crimes against their families is prison or grievous torture."
		   },
		   {
			"id": 1622,
			"surah": 12,
			"ayat": 26,
			"tafsir": "This verse explains that Joseph was clean from committing adultery, Joseph was a young man who feared his God, who did not shake his faith by the persuasion of a woman. Firmly he said to the minister, the woman's husband, \"In the incident that happened, it was actually the woman who seduced me and invited me to fulfill her lustful desires, until I jumped and ran like what you are seeing now.\" In the case of Joseph, there are many actions that could be taken by the minister to find evidence confirming that Joseph was a clean man, because Joseph was a slave who usually did not dare to cheat on his master's wife. Yusuf was found by al-Aziz was jumping out of the house. This shows that al-Aziz saw his wife in a state of guilt by wearing very beautiful clothes, with powder and perfume that smelled good, while there were no traces of it on Yusuf's face. As another very strong proof, that her husband had never seen Joseph's bad morals, since Joseph lived in his house."
		   },
		   {
			"id": 1623,
			"surah": 12,
			"ayat": 27,
			"tafsir": "With his knowledge and experience of Yusuf, in fact al-Aziz believed that Yusuf was innocent. Then his belief was reinforced by other witnesses, who stated that Yusuf was innocent. The witness was the son of al-Aziz's wife's uncle, according to some commentators his name was Zulaikha, a scholar and a wise man. The witness said, \"We heard a commotion, tugging in the house, until we heard the sound of torn cloth. If it was Yusuf's shirt that was torn in the front, then that woman was right and Yusuf was a liar. If his shirt was torn at the back, Yusuf was right and the woman is a liar.\" According to some narrations, the witness to this event was a baby destined by God to speak as a witness. But this history is weak. There is a strong opinion which states that the witness in this incident was the son of al-Aziz's wife's uncle himself."
		   },
		   {
			"id": 1624,
			"surah": 12,
			"ayat": 28,
			"tafsir": "After an investigation was held and an exchange of ideas was held between the minister and his wife's family about this incident, Yusuf's torn clothes were examined. It turned out that the back of Yusuf's shirt was torn. It is clear in this event, the true Joseph cannot be disputed and doubted. So the woman's accusation against Joseph was false. However, no matter how clever the guilty person is in presenting his reasons, the guilty person will also be known, in accordance with the saying: \"As clever as he is to wrap something rotten, it will eventually smell too.\" After it was clear what happened to this incident, the minister said to his wife, \"Now it is clear, you have persuaded and seduced Yusuf. You know, such persuasion is very dangerous. Fortunately, Joseph is a young man who is strong in faith, not affected by temptation like you did That.\""
		   },
		   {
			"id": 1625,
			"surah": 12,
			"ayat": 29,
			"tafsir": "Furthermore, in this verse, the minister said, \"O Yusuf, take care of yourself, keep your mouth shut, don't let this incident tell anyone else. This incident is our secret, if people find out, we will be embarrassed. You don't feel afraid in matters this, believe that we keep your name, because you are truly a person of noble character and strong faith. You, my wife, fear your Lord, ask forgiveness for your sins, because you are one of those who are guilty and sinful. Your mistake was very big, namely betraying your husband , and the fault of accusing others who are clean and pure.\""
		   },
		   {
			"id": 1626,
			"surah": 12,
			"ayat": 30,
			"tafsir": "In this verse it is explained that the incident which was kept secret, finally spread too. How the efforts of the minister and all the royal family to cover up the secrets of his household, his efforts were in vain. The news has become the talk of women in the city. Especially among the wives of the princes and royal leaders. They talk about it, that the minister's wife seduces her maid. It's not just saying that the minister's wife has fallen in love with her bachelor, and doesn't care about the bad consequences that will occur, such as her husband's name being tarnished. Then they said, \"Indeed we see that the minister's wife has taken a misguided path that will lead to humiliation.\""
		   },
		   {
			"id": 1627,
			"surah": 12,
			"ayat": 31,
			"tafsir": "The gossip of the women also reached the ears of the minister's wife which caused her to feel angry and ashamed. He didn't expect that news about him would spread like that, because he had done enough to cover up the secret. He was looking for a reason, how to cover up the embarrassment that was already widespread. So he invited the prominent women to come to his house to attend a banquet. For the feast, the best place has been arranged, delicious food and drinks of various kinds have been prepared. Do not miss the fresh and sweet fruits of various types and varieties that have been provided on the dining table. Nice chairs have been arranged to be able to sit back and relax, enjoy the delicious food and fruit. This invitation received a warm welcome, especially from the women who wanted to know about the events that had been talked about so far, especially wanting to see the young man named Yusuf. It was a very lively party. Laughter shouted back and forth, talk and jokes became rampant. Various kinds of food are served unbroken. So are drinks. Finally, fruits were served. To each present was given a knife to peel the fruit. At that time, the minister's wife who was the hostess, ordered Yusuf to come out to the midst of the guests who were sitting relaxing cutting fruit to introduce herself. So Joseph came out and stood before the guests. The women had just seen Joseph's face, which was as beautiful as the full moon. Unknowingly, the knife in their hand, they cut into their own hands and fingers, not to cut the fruit and they don't feel the pain. From their mouths came the words, \"Glory to God, he is not a human, but a glorious angel.\" So amazed and amazed they saw Joseph who was very charming and thrilled them, this was the figure of the person they talked about everyday by blaming and ridiculing the minister's wife."
		   },
		   {
			"id": 1628,
			"surah": 12,
			"ayat": 32,
			"tafsir": "This verse explains that the women who were invited were amazed and amazed to see Joseph. Seeing their reactions, the minister's wife was happy, then said, \"This is Yusuf, whom you always ridicule and you always criticize my attitude towards Yusuf and what happened between me and him recently. Now you are all fascinated looking at him. Just a cursory glance at him. , you have forgotten yourself. Look, you have cut your finger because you are fascinated looking at Yusuf.\" Al-Aziz's wife said, \"I admit it frankly, it was I who had fallen in love with him and it was I who seduced him and invited him to be dishonest. But he was still reluctant and took refuge in his Lord. He turned away and distanced himself from me. I continued to tease him and seduce him until he wants to follow the desires of my lust. If he also doesn't want to, I will tell my husband, so he is put in prison and of course he will be a despicable person. My husband does not dare to refuse my suggestion and my husband will punish him according to my wishes. \" He deliberately said those words in front of the guests at the festive banquet, so that Joseph himself would hear them and so that the guests could soften Joseph's heart. It is better to obey whatever al-Aziz's wife wants than to get angry and end up in prison, living together with bad and despicable people. If Joseph wants to follow his will, of course Joseph will be lucky that all the wealth and luxuries of the contents of the palace can also be controlled by Yusuf. In short, everyone present at that time had sided with al-Aziz's wife, no longer blaming and mocking her. Everyone agreed that the minister's wife should have been tempted and infatuated by Yusuf, who lived in her house. So all the women helped persuade Yusuf to comply with the minister's wife's wish, without being shy and timid."
		   },
		   {
			"id": 1629,
			"surah": 12,
			"ayat": 33,
			"tafsir": "This verse explains how the firmness and strength of Joseph's faith were resistant to all persuasion and seduction, as well as all the words to soften Joseph's heart that came out of the mouths of the women. Not worrying about Joseph's heart, the bluster and threats that said that Yusuf would be imprisoned and punished, if he did not want to submit to the invitation to commit adultery. Hearing all that, Joseph only took refuge in Allah, bowed his head while praying that God would keep the women away from the temptations of the women and said, \"O my Lord, a dark and narrow prison is better for me than in a palace, facing beautiful women. who always tempts and invites me to fulfill his lustful desires. I'm afraid, O Allah, if I still live in this palace, I will always face women who tempt me, that my spirit will weaken, my faith will fade, so that I will fall into the valley of humiliation with them. O Allah, save me from their temptations. There is no power and strength for me to escape this danger except with Your help and guidance. O Allah, were it not for Your help and guidance, I would be a fool , misguided paths and easily deceived eventually fall into the valley of humiliation and immorality.\""
		   },
		   {
			"id": 1630,
			"surah": 12,
			"ayat": 34,
			"tafsir": "This verse explains that finally Joseph was put in prison. Joseph's prayer was allowed by his God, so that Joseph would be preserved from the temptations and deceit of those women. So the minister put Yusuf in prison just to fulfill his wife's request, because his wife asked her husband not to reveal the incident and tried to calm the situation in the household. Allah's intention to grant Yusuf's prayer to go to prison was different from that of the magnate (al-Aziz). God's purpose was for Joseph to remain clean, protected from all temptations that polluted his soul. Also so that Joseph would be patient and endure suffering in prison, associating with people who had been in prison for a long time with various characters, behaviors, and temperaments. Because Joseph will be appointed by God to be a prophet to his people. Prison is the place where he grew up and the place where Allah first revealed his revelation to him. Therefore, Allah always takes care of him and Allah is All-Hearing, All-Knowing of all the prayers that are said and all the deeds that are done by His servants."
		   },
		   {
			"id": 1631,
			"surah": 12,
			"ayat": 35,
			"tafsir": "This verse explains that the minister and his wife have seen evidence that Joseph was a good person, honest, and had noble morals and had firm faith and trust in his Lord. As long as they hung out with Joseph, they never saw Joseph's wrong actions. It was clear to them that Joseph was always cared for by his Lord and protected by Him from abominable deeds. Even though he was accused, persuaded, and threatened, Yusuf remained calm and always asked for protection from his God. Such a thing was not only clearly known by the minister and his wife, but also by the entire royal family. Even so, Joseph was still put in prison for an indefinite period of time as the implementation of his wife's request, so that the people thought that Joseph was guilty, even though his wife was guilty. Joseph did not feel miserable and humiliated in prison. With this association in prison, Joseph's faith grew stronger, his heart and soul grew steadfast, he learned more and more of human secrets, and the greater the majesty of God he felt."
		   },
		   {
			"id": 1632,
			"surah": 12,
			"ayat": 36,
			"tafsir": "This verse explains that together with Joseph, two young men entered the prison. According to history, the two young men were former flushers for the king's garden and former treasurer for the king. The two of them were scolded for their guilt and put in prison. One day, Yusuf saw the two young men sitting sadly like daydreams. So Yusuf greeted the two young men, \"Why are you in this condition?\" They replied, \"We had a strange and magical dream last night, so we were anxious and sad like what you see. We don't know what our dream means.\" Yusuf said to the two of them, \"Only Allah knows the tafsir of your dreams, try to tell me what your dreams are.\" So one of the two told me about his dream and he said, \"I dreamed that I was in a vineyard which was very dense with fruit and green in color. It was as if in my hand there was a glass belonging to a king. With that glass, I collected the water after I will press the grapes to make a drink.\" After that the other one also told his dream, saying, \"I dreamed that I was carrying a basket on my head, full of various kinds of bread and food. Suddenly several birds flew over my head, then grabbed all of them. the bread and the food that was in the basket and carried flew away.\" Both of them begged Yusuf, so that Yusuf would give the tafsir of their dreams. Their hopes rested on Joseph, because only Joseph they trusted the most. While in prison they knew Joseph as a good person, broad in knowledge, good in association, and close to his God."
		   },
		   {
			"id": 1633,
			"surah": 12,
			"ayat": 37,
			"tafsir": "In this verse it is explained, before Yusuf gave the tafsir of the dreams of the two young men, he first preached about Allah's greatness and power, about Allah's blessings that he had received, and his attitude of not wanting to submit to an incorrect religion. Yusuf said to the two young men, \"Before you two received the food that was sent for you, I already knew what the food was and I will explain it to you now.\" According to history, there are royal people who send people who are guilty in prison, namely food mixed with poison with the intention of killing them. Joseph already knew what the royal people meant and had explained it to the two young men. Yusuf explained that such knowledge was a revelation from his Lord to him. \"With that knowledge I can interpret dreams, not like a soothsayer and a fortuneteller who uses the help of Satan, guessing and incantations that are not necessarily true,\" said Yusuf. Yusuf further explained that he did not want to be influenced by wrong religious teachings. He abandoned the beliefs of those who were not true, those who did not want to believe in Allah and denied the afterlife."
		   },
		   {
			"id": 1634,
			"surah": 12,
			"ayat": 38,
			"tafsir": "In this verse it is explained that Yusuf continued his conversation with the two young men before explaining the tafsir of their dreams. Yusuf said that he only obediently follows the religion of his ancestors, namely the religion of the Prophets Abraham, Isaac, and Jacob, the religion of monotheism is not a religion that associates partners with Allah. \"It is not proper for us prophets and apostles to associate Allah with others, as was the case with the Pharaohs and their followers. They associated Allah with others, such as the sun, moon, idols and so on. Belief in monotheism includes Allah's gift to us prophets and apostles, as well as to all people who have the same belief. Allah has given guidance to us and people who believe. By sending us prophets and apostles, we show them which way is the straight and which is crooked path, we explain to them the true belief. However, there are still people who are ungrateful to Allah,\" Yusuf said."
		   },
		   {
			"id": 1635,
			"surah": 12,
			"ayat": 39,
			"tafsir": "Yusuf continued his preaching by calling on the two young men who became his friends in prison, \"O the two inmates of the prison, which is better, the various gods or the mighty God Almighty?\" This call is sincere from a friend who is loyal and honest to his friends. The question in this appeal is an affirmation, that stop worshiping these various gods and worship Allah, the One and the Almighty. The various gods will not be able to save them from the torment in the afterlife. Only Allah, the Almighty, the Almighty, can provide help in difficult times and help in difficult times."
		   },
		   {
			"id": 1636,
			"surah": 12,
			"ayat": 40,
			"tafsir": "The continuation of Joseph's call is that all those they worship besides Allah are false gods deliberately given various names by themselves, their fathers and forefathers. Yusuf said, \"You made it, you gave it a name and you also worship it as God. Even though he is a weak object that does not have any strength and there is no information from Allah to His messengers to justify the god who you make up that. That the correct provisions regarding divinity and devotion are those arranged by Allah which has been revealed to His messengers. Allah has commanded, that you should not worship other than Allah. It is to Him that you pray and ask for help, to -It is you who kneel down on your knees. That is the true religion. But most people don't know it yet.\""
		   },
		   {
			"id": 1637,
			"surah": 12,
			"ayat": 41,
			"tafsir": "In this verse, Yusuf explained the tafsir of the dreams of the two young men. Yusuf said, \"O you two fellow inmates of the prison, as for the first dream, the takwil is that you will soon get out of this prison and return to work as you used to before going to prison, namely as a waterer in the king's garden and will give the king drink with khamar. Takwil the second dream, that you will be crucified, then your carcass and part of your head will be eaten by birds. That is the tafsir of the dream you asked me as a revelation that has been revealed to me.\""
		   },
		   {
			"id": 1638,
			"surah": 12,
			"ayat": 42,
			"tafsir": "In this verse it is explained that Yusuf advised the young man who came out with a good tafsir, to convey to the king that in prison there were still many innocent people being punished. They were punished for untrue accusations to bring this to the attention of the king. Also convey to the king what he saw and heard about Yusuf and the call to embrace the monotheistic religion and other things that happened while he was in prison. Apparently the young man, after arriving outside, forgot to convey Joseph's messages to the king, so that Joseph was forced to spend several years in prison."
		   },
		   {
			"id": 1639,
			"surah": 12,
			"ayat": 43,
			"tafsir": "In this verse it is explained that the king once had a dream which was very miraculous and very disturbing to his heart. The king had never had such a dream in his life. So he gathered all the clever people, sorcerers and princes of his kingdom. Then he said, \"I dreamed of seeing seven fat cows being eaten by seven skinny cows, I saw seven fertile grains of wheat and seven dry grains. Tell me about my dream, if any of you have knowledge. veil of dreams.\""
		   },
		   {
			"id": 1640,
			"surah": 12,
			"ayat": 44,
			"tafsir": "No one could solve the king's request. They have various opinions, some say that it is just a dream of sleeping games and some say that it is the influence of wishful thinking at bedtime which has no meaning whatsoever. Against dreams like that, they do not have the knowledge to find the veil."
		   },
		   {
			"id": 1641,
			"surah": 12,
			"ayat": 45,
			"tafsir": "The king was dissatisfied with their answers and the king seemed even more agitated. The king wanted to know the veil of his dream, but did not know who to ask. After hearing this news, the flusher in the king's garden, who had been in prison with Yusuf, remembered that Yusuf, who was in prison, had once interpreted his own dream correctly. He quickly came to the king and said, \"Yes, my lord, in prison there is a young man named Yusuf. He is a noble man, has a deep mind, broad views, and can also veil dreams properly. If my lord sends me to him, surely I will return with the veil of my master's dream which will certainly convince my master of its truth.\""
		   },
		   {
			"id": 1642,
			"surah": 12,
			"ayat": 46,
			"tafsir": "The king was happy to hear the opinion of his gardener, then sent him to meet Yusuf in prison. Arriving at the prison and meeting with Joseph, he said, \"O Joseph, my glorious brother who can be trusted. I have come to you to ask for a veil of dreams: that seven fat cows are eaten by seven thin cows and seven empty heads of wheat. dry and there are also seven heads of wheat that are lush. Hopefully I will come back with the veil of that dream from you and so that it can be known by many people, of course they will thank you for all the advantages and goodness you have given.\""
		   },
		   {
			"id": 1643,
			"surah": 12,
			"ayat": 47,
			"tafsir": "With all generosity, Joseph explained the veil of the king's dream, as if Joseph were conveying to the king and his superiors, he said, \"O kings and all state officials, you will face a period of seven years filled with all prosperity and security. Cattle reproduce, plants thrive, and everyone will feel happy and happy. So encourage the people to plant crops during those seven years. You must save the produce from the crops, store the wheat with its stalks so that it lasts longer. You spend a small portion. to eat as needed."
		   },
		   {
			"id": 1644,
			"surah": 12,
			"ayat": 48,
			"tafsir": "After this prosperous period will come another seven years of sorrow and suffering. At that time livestock had been wiped out, the plants didn't bear fruit, the weather was hot, the dry season was long. Water sources are drying up and people are suffering from food shortages. All food stores will be used up, except for a little left for you to make seeds."
		   },
		   {
			"id": 1645,
			"surah": 12,
			"ayat": 49,
			"tafsir": "Then after the period of hardship and tribulation has passed, then comes a period of prosperous, safe and secure life. At that time the earth became fertile, the rain fell very heavily, people were seen busy pressing grapes safely and happily. They have been sitting and relaxing enjoying the fruits of their garden with their children and families. That is the veil of the king's dream that I convey to you for you to convey to the king and his superiors.\""
		   },
		   {
			"id": 1646,
			"surah": 12,
			"ayat": 50,
			"tafsir": "In this verse it is explained how interested the king was with the veil of dreams conveyed by his envoy, so that the king was eager to meet Joseph in person, so the king ordered him to return to meet Joseph in prison and said, \"Go meet Joseph in prison and bring him here, so that he I listen to his words and I can measure the extent of his knowledge and breadth of views. Hopefully his knowledge and views will be of use to me for the safety of my nation and my country.\" So the messenger went to Joseph and conveyed the king's summons to him, so that he would come before the king, because the king needed his advice and would raise him to a high rank. Joseph fulfilled the king's summons. But before Joseph came before Joseph, he asked the king's envoy to return and ask the king about the incident of the women who had cut their own fingers with a knife so that the true situation would be known clearly. So when he came before the king, he was free from accusation because the king knew more about the tricks of the women."
		   },
		   {
			"id": 1647,
			"surah": 12,
			"ayat": 51,
			"tafsir": "After the messenger returned to the king and conveyed Joseph's request to him, the king immediately summoned the minister's wife and all the women who cut her finger and said to them, \"How did you see Joseph when you seduced him first? Because I will take Joseph out of prison. \" They replied, \"That Joseph was a young man who was pure and pure, Most Perfect Allah, we did not see anything bad in him.\" The minister's wife who was crazy and continued to tease Yusuf while living together at his house said, \"Joseph has been in prison for too long without doing anything wrong. I am the one who is guilty because I cannot restrain my lust, I always tease him.\" Now the truth is clear, that Joseph was innocent and he was one of the righteous."
		   },
		   {
			"id": 1648,
			"surah": 12,
			"ayat": 52,
			"tafsir": "This verse explains the confession of al-Aziz's wife who frankly said that it was she who was guilty, it was she who seduced him, but Yusuf remained reluctant and turned away, for fear of his Lord. All of that is proof of his honesty. He did not want to lie to Joseph even though Joseph was in prison. Also so that her husband would know, that she was frank like that showed that she was clean, protected from abominable deeds, because of the strength of Joseph's faith. His wife does not want to be accused of being a traitor, because Allah swt will not guide any betrayal."
		   },
		   {
			"id": 1649,
			"surah": 12,
			"ayat": 53,
			"tafsir": "In this verse it is explained that Joseph as a human being admits that every passion tends and is easily commanded to do evil unless it is given mercy and has protection from Allah. Yusuf survived the temptation of al-Aziz's wife because of the abundance of Allah's mercy and His protection, although as a human being Joseph was also attracted to al-Aziz's wife as the woman was attracted to him as explained in verse 24: And indeed, the woman had willed for him (Yusuf) . And Yusuf also willed for him, if he did not see a sign (from) his Lord. (Yusuf\/12: 24) But there is another opinion which states that verse 53 explains the confession of al-Aziz's wife with emotion and a deep sense of regret that she could not rid herself of mistakes and negligence. She also admitted that it was she who almost betrayed her husband by seducing Yusuf when he was not at home. To protect the good name of himself, his husband and his family, he suggested that Joseph be imprisoned, or subjected to painful punishments. Al-Aziz's wife has made a double mistake, namely lying and accusing an honest and clean person and throwing her into prison. At the end of this verse it is explained that Allah is Forgiving and Most Merciful."
		   },
		   {
			"id": 1650,
			"surah": 12,
			"ayat": 54,
			"tafsir": "In this very touching atmosphere, the king ordered Joseph to be picked up from prison and brought to the palace. At the palace, Yusuf explained to the king all his experiences since he lived in the al-Aziz palace until he went to jail and finally was able to meet the king face to face. Hearing his explanation, a belief arose in the king's heart that Joseph was truly an honest and loyal person, full of responsibility, virtuous, knowledgeable, and steadfast and strong in faith. Because of that belief, the king announced in front of dignitaries and state leaders that he had appointed Yusuf as his confidant. All state financial affairs were left completely under his leadership and responsibility, he was the one who had the right to fully control the government, and was the only person who could have direct contact with the king. According to the history of Ibn Abbas, \"When the king's envoy arrived at the prison he said to Yusuf, \"Take off the prison clothes you are wearing, put on these new clothes, and come with me to the king.\" All the prison inmates prayed for him, and vice versa, Yusuf also prayed for them. When he arrived at the palace, the king was very surprised because he saw Yusuf was still young (at that time he was about 30 years old). in my country no one can pronounce him.\" Then the king ordered him to sit in front of him and said, \"Don't be afraid.\" Then a gold necklace was put on him and he was given a regal robe of silk. A saddled horse was also provided for him decorated with various decorations. and drums were beaten all over Egypt as a sign and statement that Joseph had been appointed caliph (ta right) king.\" Thus the history of Ibn Abbas. Then the king said, \"Since today you have a high position by our side and we entrust all the affairs of state to you.\""
		   },
		   {
			"id": 1651,
			"surah": 12,
			"ayat": 55,
			"tafsir": "Then the king told Joseph his dream and asked for an explanation about the best course of action to overcome the seven years of drought. Yusuf asked the king to hand over all matters related to the country's economy so that he could manage them as well as possible to avoid the danger of starvation, even though the dry season was very long. Next, Yusuf explained his long-term plan. He said that during the long fertile season agriculture had to be increased and all the people were ordered not to leave empty land uncultivated, so that when the long dry season came, the stored food prepared during the fertile period could be taken little by little, while the stems Wheat can be used for animal feed. The king was very happy to hear Joseph's opinion and added confidence in his intelligence and wisdom. All of Yusuf's suggestions were acceptable to him. Not only agricultural affairs, even all state affairs have been completely handed over to Yusuf. Thus, Joseph has become a highly respected, respected, and loved ruler in Egypt."
		   },
		   {
			"id": 1652,
			"surah": 12,
			"ayat": 56,
			"tafsir": "Thus God arranged step by step and step by step to place Joseph in a high and honorable position in Egypt and had full authority in every corner of the country. All of this is in accordance with the sunna of Allah, which began with the dream of the Prophet Yusuf to see 11 stars, the sun and the moon prostrating to him which caused his father Jacob to love him more so that his brothers grew jealous of him. Then Yusuf was put into a well by them, then taken by a caravan that was going to Egypt, and sold to the ruler there (al-Aziz) at a very cheap price. Finally Yusuf settled in the palace as a trusted member of the family. Then he was seduced by al-Aziz's wife and slandered so that he was thrown into prison. In prison, Joseph was gifted by Allah with the knowledge of interpreting the dreams of one of the prison inmates and finally he interpreted the dream of the king. After it was proven that Joseph was innocent, the king's confidence arose in him that he was honest, loyal, steadfast and patient in facing trials, noble, knowledgeable and wise, so he was appointed ruler. All these events are a series of interrelated and closely related to one another. Impressed at first as if Yusuf was destined to always be afflicted with misfortune, but in the end he got luck and happiness. He arrived in Egypt as a slave, but later became the most respected and respected person there. If he is not a human being who is honest, sincere, and likes to do good in all his actions, surely Allah will not grant him such great favors. Thus Allah gives mercy to whom He wills and indeed Allah gives a multiplied reward for everyone who does good."
		   },
		   {
			"id": 1653,
			"surah": 12,
			"ayat": 57,
			"tafsir": "In addition to the rewards in this world, Allah also provides in the hereafter a better, more valuable and happier reward for those who continue to believe and always fear Him, namely Jannatun naim heaven, which contains all kinds of favors and pleasures that have never been seen before. eye has seen, ear has never heard of, and has never entered the human heart."
		   },
		   {
			"id": 1654,
			"surah": 12,
			"ayat": 58,
			"tafsir": "In the Old Testament book of Genesis 42: 2-25 it is stated that Joseph made massive preparations and supplies to face the danger of famine in the dry season. For that, he built large warehouses to store food produced during the fertile season. When the dry season came, it turned out that the drought was not only happening in Egypt, but also covering neighboring countries, especially in Palestine. There was news that the government of Egypt had ample food reserves that could help relieve the suffering of the people of neighboring countries. The authorities there are willing to let go of some of the savings by selling it to those who really need it. Therefore, Jacob ordered his children (Joseph's brothers) to collect merchandise and bring it to Egypt in exchange for food. To fulfill Jacob's request, Yusuf's brothers left, except for Bunyamin because Jacob did not allow them, to buy the food they really needed. When they got there, they went straight to Yusuf with the hope that they would soon be able to buy groceries, because this matter was entirely in Yusuf's hands. When they entered, Yusuf knew that those who had come were his own brothers, because their appearance and type of clothing still stuck in his memory, especially since there were ten of them. Yusuf said to himself, \"There is no doubt that these are my brothers.\" On the other hand, they don't know at all that what they are dealing with is their own brothers. They all no longer remember Yusuf's form because they have been separated for a long time, moreover what they are facing is a prime minister in oversized clothes and shiny awards marks on his clothes. It is impossible for Joseph to be a person who has a very high position because they have thrown him into the well. Even if he is still alive, he will certainly become a slave who is exploited by his master."
		   },
		   {
			"id": 1655,
			"surah": 12,
			"ayat": 59,
			"tafsir": "This verse explains that Yusuf granted the request of his brothers to buy the goods they brought and exchanged them for food. He then ordered that 10 pikul of food and other necessities needed for the journey be prepared for them, because there were ten of them, each of them was entitled to one pikul. But they told me that in their village there were 2 more people who really needed food, namely a brother and a father of their own. They begged them to be given 12 poles because the ten poles were enough for them alone, \"Our father could not come here because he was old and weak, while our brother we deliberately left to look after him and please him.\" Hearing the statements of his brothers, Yusuf said, \"Then bring your brothers here as proof for us of the truth of you all and we will grant your request. We have seen for ourselves the food ingredients provided for all of you totaling 10 pikul , because we are only able to give up one pole for one person. Apart from that, while here we have treated all of you well as our guests because that's how we usually treat guests in the best way. Now go home all of you and bring the groceries, then come back with merchandise to exchange for groceries, but on condition that you bring your brothers as proof of your truth and honesty.\""
		   },
		   {
			"id": 1656,
			"surah": 12,
			"ayat": 60,
			"tafsir": "Furthermore Yusuf said, \"If you don't bring it, you won't get food at all because that means you are not honest people. We will not serve liars and liars and we really hate them. Once again we emphasize, if you don't bring your brother, don't expect that you will be given food. Don't even try to come close to our country, let alone face us because there is no place here for dishonest people.\""
		   },
		   {
			"id": 1657,
			"surah": 12,
			"ayat": 61,
			"tafsir": "Joseph's brothers answered, \"Then we will go home and try very hard to get our father to let our brother go with us to Egypt. We will tell him all that has happened and say that we are very welcome.\" and treated as guests while we were in Egypt.\""
		   },
		   {
			"id": 1658,
			"surah": 12,
			"ayat": 62,
			"tafsir": "Then Yusuf ordered his officers who took care of the food ingredients to put all the goods that they brought back into the food sacks without their knowledge. The goods consisted of various materials produced by the desert, such as sheepskin and so on. By returning them, they would fully realize how kind-hearted the ruler of Egypt was, and how highly he served them. They had been treated as guests while in Egypt and then given groceries, while their own merchandise was returned, as if the ten piuls of food had been given to them free of charge as a gift which was very necessary and priceless for themselves. . With this awareness, it is hoped that a strong determination will arise in their hearts to return to Egypt with goods and bring along Bunyamin as mandated by Yusuf."
		   },
		   {
			"id": 1659,
			"surah": 12,
			"ayat": 63,
			"tafsir": "In this verse it is explained that when they got home and met their father, Joseph's brothers told them all about their experiences in Egypt and how well the authorities there received them by treating them as guests. When they are going home, they are also provided with the items needed during the trip. They were given 10 pikes of food in exchange for the goods they brought because they were only ten people. They also told Jacob that they had told the ruler of Egypt about their old father and a brother who could not come because he was assigned to look after their father. They asked to be given 12 poles. The ruler replied that if it was true that they had relatives, they should be brought to Egypt. The ruler will again give them as much food as requested. They were warned that if Bunyamin could not be taken, they could not come back to Egypt, and would not be given food, because they were considered liars who were not worthy of being trusted. Therefore, they begged Jacob earnestly to allow Benjamin to go with them. In this way, they would be given food and received a better welcome because they had fulfilled their promise to bring Bunyamin to Egypt. They promised to take good care of Bunyamin."
		   },
		   {
			"id": 1660,
			"surah": 12,
			"ayat": 64,
			"tafsir": "Jacob was surprised to hear their request, so he immediately answered, \"Shall I entrust Bunyamin to you as I entrusted Yusuf before? Are you not satisfied with harming Yusuf so that now you want to harm Bunyamin again? Am I just going to believe in the promises made by him?\" your promises and guarantees to Bunyamin, even though you previously made similar promises and guarantees when you were about to take Yusuf to play to a shepherding place in the desert? I no longer believe in your words and promises. I will pin my hopes on Allah so that He will continue to care Bunyamin because He is the best Guardian and Merciful. It is on Him that I put my trust in facing all problems. Only He is the Most Gracious, Most Merciful, I pray that He will always bestow His grace on me by protecting Bunyamin and maintaining his safety and will not befall trials to me like i lost Yusuf, my beloved son. Verily, Allah's Mercy is Extensive and His Grace is Greatest.\""
		   },
		   {
			"id": 1661,
			"surah": 12,
			"ayat": 65,
			"tafsir": "After Joseph's brothers opened the sacks of food they had brought from Egypt, it turned out that they also found their belongings still inside. They said to Jacob, \"O our father, the goods that we brought to Egypt were returned. This is a clear proof of how kind-hearted the ruler of Egypt was to us and how generous he was so that he did not want to take our goods in exchange for the food he gave us.\" given to us. He has helped us sincerely without expecting anything in return. Indeed, our debt of gratitude is very great. Therefore, we must repay his kindness and kindness by fulfilling our promise, namely to bring Benjamin to Egypt. If we return to Egypt, he will bring him of course we will get more food, at least it will increase by one load because we are already eleven people. For the ruler of Egypt one load of food is certainly not burdensome because the warehouses are full of food.\""
		   },
		   {
			"id": 1662,
			"surah": 12,
			"ayat": 66,
			"tafsir": "Hearing the words of his children, Jacob realized that the good favor of the Egyptian ruler must be reciprocated with good kindness too. There was no way to repay him except by keeping the promise of his children to take Bunyamin because he and his children had nothing more to offer, especially since the ruler of Egypt had refused to accept exchange and returned everything. With heavy feelings, Jacob told his children that if they had to take Benjamin to Egypt, then he would not allow it except with a promise confirmed by an oath that they would really protect Benjamin's safety and bring him back home. They are also asked to be willing to sacrifice body and soul if things happen that endanger or threaten their lives. Jacob's sons are willing to swear to fulfill the conditions put forward by their father. Then they swore by the name of Allah that they would protect Bunyamin's safety, defend him to the death when he was threatened with danger, and would bring him back. After hearing the oath of his children, then Jacob's heart felt relieved and he said, \"God is a witness to all your words and promises. He is the One Who Oversees all your deeds and actions and to Him I leave the safety of my child.\""
		   },
		   {
			"id": 1663,
			"surah": 12,
			"ayat": 67,
			"tafsir": "In this verse it is explained that the Prophet Jacob said to his children so that when they arrived at the palace of the king of Egypt, they did not enter together from one gate, but entered from other gates, so as to avoid the sight of the eyes of the hasad or experiencing unwanted things. In addition, it was hoped that Bunyamin would have the chance to meet Yusuf separately from his other brothers. The Prophet Jacob also advised that even though they had tried to avoid various dangerous possibilities, he could not prevent Allah's provision, because the decision to determine something was only in His hands. All work must be carried out according to ability and with the belief that God's provisions will definitely happen, and no one can stop them. Therefore, only to Him everyone puts their trust and surrender."
		   },
		   {
			"id": 1664,
			"surah": 12,
			"ayat": 68,
			"tafsir": "When the sons of the Prophet Jacob entered Joseph's palace in Egypt according to his orders, namely entering from a different gate, the way they did it could not release them in the slightest from Allah's provisions. This was only the wish of the Prophet Jacob which had to be carried out so that Yusuf could meet with Benjamin in person, because the two of them would make wise plans and actions. This shows that the Prophet Jacob had been given knowledge by Allah's revelation, but most people did not know, including their own children."
		   },
		   {
			"id": 1665,
			"surah": 12,
			"ayat": 69,
			"tafsir": "When Jacob's children entered the special room, Yusuf immediately recognized his younger brother, Bunyamin. Yusuf tried to meet him face to face while saying, \"Don't be sad and upset. I am your sibling, but don't tell this to your other brothers and sisters.\" In a history it is said that when Yusuf's brothers entered his place, they introduced Bunyamin saying, \"This is our brother Bunyamin, who was asked to come with us, now we introduce him to Your Majesty.\" Yusuf replied, \"Thank you very much, and for this kindness we will surely provide a reward.\" Then Joseph prepared a meal for them, all eleven of them. Each table was for two people, so that everyone was seated face to face at five tables in five closed rooms. Only Bunyamin is left alone without a partner. Yusuf said to his guests, \"You ten people, both of you go into the room. Since this one, namely Bunyamin, doesn't have friends, it's good for me to accompany him.\" After Yusuf and Bunyamin were both in a room, Yusuf embraced him with great affection, and said, \"Would you like to accept me as your brother, instead of your lost brother?\" Bunyamin replied, \"Who would refuse to have a brother like you, noble one? But you were not born from my father Jacob and my mother Rahil.\" Unable to bear hearing this, Yusuf cried and embraced Bunyamin and said, \"I am Yusuf, your brother who is said to be missing.\" Then Joseph advised his brother not to grieve over what his brothers had done to him. Yusuf also told Bunyamin his plans for his brothers, to test them, whether their morals were still the same as before or had there been any changes. The intention was so that Bunyamin would not be surprised, if later things were to be done by Yusuf that would feel odd to him."
		   },
		   {
			"id": 1666,
			"surah": 12,
			"ayat": 70,
			"tafsir": "So while the food was being prepared, Yusuf secretly put the king's cup (a drinking vessel that could also be used to measure) into Bunyamin's sack. After the caravan was getting ready to leave Egypt, a messenger came after the caravan and shouted in a loud voice, \"O caravan, wait a minute, you are actually thieves.\""
		   },
		   {
			"id": 1667,
			"surah": 12,
			"ayat": 71,
			"tafsir": "Joseph's brothers immediately stopped their journey and asked what items were missing from the kingdom, so he came after and accused them of being thieves."
		   },
		   {
			"id": 1668,
			"surah": 12,
			"ayat": 72,
			"tafsir": "The caller said that the king lost the chalice that had the royal seal on it. Whoever can return the cup will get a prize, which is a camel's weight of food. The caller also explained that he guaranteed that he would still give the gift to anyone who could return it."
		   },
		   {
			"id": 1669,
			"surah": 12,
			"ayat": 73,
			"tafsir": "Yusuf's brothers said with the intention of clearing themselves of the accusation, \"By Allah you know that we came to Egypt, both the first and the second time, not to cause damage to the land of Egypt by stealing or doing other crimes, and we are sure that we are not thieves.\""
		   },
		   {
			"id": 1670,
			"surah": 12,
			"ayat": 74,
			"tafsir": "The caller asked, \"But what will be the result if you lie? And it turns out that the king's cup was hidden in your sacks.\""
		   },
		   {
			"id": 1671,
			"surah": 12,
			"ayat": 75,
			"tafsir": "They replied, \"The answer is whoever finds the cup in his sack, then he is the thief and must be willing to accept the consequences.\" The Shari'a that applies according to the religion brought by the Prophet Jacob is that the thief is made a slave by the person who was stolen for one year. Thus Allah repays the evil of the wrongdoers."
		   },
		   {
			"id": 1672,
			"surah": 12,
			"ayat": 76,
			"tafsir": "After the caravan returned to Egypt and met Yusuf, he began to check all of their sacks and the last thing he checked was Bunyamin's sack. He deliberately did so to cover up his tactics. Then Yusuf found the missing cup from Bunyamin's sack. In this way God arranged Joseph's tactics to achieve his purpose. Joseph had absolutely no intention of punishing his brother according to the laws of the kingdom unless God so desired. He deliberately made this tactic to simply test the morals of his brothers and not to hurt Benyamin, because he had previously been informed about the plan. Allah exalts the degree of those whom He wills, both in the form of knowledge and faith and also shows the path of truth to achieve his goals, just as Allah has raised the rank of Yusuf above his brothers. Above every person who knows there is another who knows better. Only Allah is All-Knowing."
		   },
		   {
			"id": 1673,
			"surah": 12,
			"ayat": 77,
			"tafsir": "In this verse, Yusuf's brothers say that if Bunyamin stole, it was because Yusuf's brother also stole. Their accusation that Joseph once stole shows that jealousy is still ingrained in their hearts. This made Yusuf feel irritated. However, Joseph was able to patiently hide his annoyance and not show it to them. That Joseph was said to have stolen when he was a child, is actually not true. The actual incident was not a case of theft, but a case that was engineered so that little Yusuf would stay with his aunt, not be brought home by his father, namely the Prophet Jacob as. . Her aunt kept the Prophet Ishak's belt which had been passed down from generation to generation to her oldest child. Prophet Jacob often came to his sister, to take Yusuf. Because his aunt was very fond of him, he kept Yusuf under his care. Finally, his aunt made a tactic by tying the heirloom belt to Yusuf's waist and covering it with his clothes so that it was not visible. Then, his aunt announced that the heirloom belt had been stolen. Then, all family members were examined. It turned out that the belt was found to be worn by Yusuf. According to the law of the Prophet Jacob at that time, Yusuf had to be handed over to his aunt as a slave for one year. It was this incident, among other things, that his relatives accused him of stealing."
		   },
		   {
			"id": 1674,
			"surah": 12,
			"ayat": 78,
			"tafsir": "In this verse it is explained about what Yusuf's brothers said to al-Aziz, that Bunyamin, who was designated as a thief, had an elderly father, and could not be separated from him. Bunyamin is a replacement for his missing brother. Therefore, they hoped that al-Aziz would be willing to take one of them as collateral because Bunyamin was more loved by his father. They had also promised to take care of Bunyamin's safety while on the trip. In addition, they also praised al-Aziz that he is a person who likes to do good. Of course, this kind of praise was intended so that Bunyamin would be released from detention on charges of theft. They as guests felt that they had received the best possible service, and it would be more perfect if that kindness was coupled with fulfilling their request to let Bunyamin return to his father who had been stricken with grief at the loss of Yusuf."
		   },
		   {
			"id": 1675,
			"surah": 12,
			"ayat": 79,
			"tafsir": "Then Yusuf told his brothers that he had done something wrong if he released Bunyamin, who had been proven to have found the missing item in his sack. He takes refuge in Allah that it is impossible for him to catch someone unless he has been proven guilty of stealing. If he accepts the suggestions of his brothers, it means that he is acting unfairly because he has violated the laws or regulations that apply in his kingdom."
		   },
		   {
			"id": 1676,
			"surah": 12,
			"ayat": 80,
			"tafsir": "Allah reported that when Yusuf's brothers despaired because Yusuf refused to let one of them replace Bunyamin, they then gathered to discuss in secret what they would do next. His eldest brother named Yahuda said, \"Don't you know that your father, Jacob, has taken a heavy promise from us in the name of Allah that we will really take care of Benjamin's safety and be able to return him to father, unless we face a great danger that This can't be avoided. Bunyamin's detention will make our father even sadder, especially when he remembers that we neglected Yusuf in the past.\" \"Therefore,\" said Yahuda further, \"I will not leave Egypt until my father allows me to return, or until Allah gives me another decision because Allah is the All-Knower of the unseen and He is the Best of Judges.\""
		   },
		   {
			"id": 1677,
			"surah": 12,
			"ayat": 81,
			"tafsir": "Then Judah ordered his other brothers to return to their father and report everything that had happened to him in Egypt to avoid bad accusations. Yahuda said, \"Go back to your father and tell him that his son, Bunyamin, stole the king's cup and as a result was made a slave for a year in accordance with the applicable law.\" He also ordered his brothers to tell their father, the Prophet Jacob, that they could only witness what was known. They saw for themselves that the king's cup was taken out of Bunyamin's food sack. They are completely incapable of knowing the unseen. If they had known that Bunyamin would steal, they would not have promised their father."
		   },
		   {
			"id": 1678,
			"surah": 12,
			"ayat": 82,
			"tafsir": "It was further explained that Judah also suggested that his brothers tell their father to ask the residents of the country where they were in Egypt to buy food, because news about the theft had spread among them. It can also be asked of the caravan that came with them, and indeed they are the ones who are truthful and always report what really happened."
		   },
		   {
			"id": 1679,
			"surah": 12,
			"ayat": 83,
			"tafsir": "After dealing with his sons who gave the report as mandated by Judah, the Prophet Jacob said, \"You are the only one who sees the good of this bad deed, and why do you say that the one who steals must be made a slave for one year, even though the provision is only is in our Shari'a and not in their legislation. So good patience is my patience which is not overwhelmed by irritation and anger. Hopefully Allah will bring them all to me (Yusuf, Benjamin, and Judah), because indeed He is God Almighty Knowing and All-Wise.\""
		   },
		   {
			"id": 1680,
			"surah": 12,
			"ayat": 84,
			"tafsir": "Because he was not happy to receive the report conveyed by his sons, the Prophet Jacob turned away from them and said with sadness, \"Oh, my sorrow for Joseph, because I was waiting for joyful news from Egypt, but in fact it was sad news that I received. .\" Because of the grief he was constantly experiencing and he often wept, Jacob's eyes became white, so that his condition was like that of a blind man. However, he still manages to hold his anger against his children. According to the world of science, when a person suffers from stress, his body reacts and raises alarm signals, thereby triggering various biochemical reactions in the body: Adrenaline levels in the bloodstream increase; energy use and body reactions reach their highest point; sugar, cholesterol and fatty acids are channeled into the bloodstream; blood pressure rises and the pulse accelerates. When glucose is delivered to the brain, cholesterol levels rise, and all this creates problems for the body. Perhaps this was also experienced by the Prophet Yaqub as when he lost his beloved child Prophet Yusuf as Severe stress was able to affect and even change the normal functions of the organs of the body. This can have dire consequences. As a result of stress, adrenaline and cortisol levels in the body increase above normal levels. Increased cortisol levels over a long period of time lead to organ disorders, including disorders of the pancreas. As a result, diabetes or diabetes arises, namely the destruction of pancreatic beta cells that produce insulin, resulting in uncontrolled blood sugar levels in the body. In many cases, diabetes can cause symptoms of cataracts, namely clouding of the eye lens which causes blurred vision. If the lens becomes cloudy, the light that enters the eye can be scattered and cause blurred vision. Medical (eye) experts agree that inadequate or poorly controlled treatment can cause blindness in people with this disease. The main symptoms of cataracts are blurred vision, progressively reduced vision, the presence of a thin membrane that blocks the view, very glare when exposed to bright light. In subsequent developments, vision gets worse, the pupils appear white (there are whites in the black of the eye). Today, this \"white eye\" (cataract) disease can be cured, especially with the advancement of current medical technology or because blood sugar levels can be controlled. well. Different of course with the Prophet Yaqub as whose recovery took place quickly, maybe because of a miracle for a Prophet or it could also be the fruit of his \"patience\". Glory be to Allah, the All-Knowing and Most Healing."
		   },
		   {
			"id": 1681,
			"surah": 12,
			"ayat": 85,
			"tafsir": "In this verse, it is explained that when hearing his father's deep complaints and sorrow, Jacob's sons who had just returned from Egypt said to him, which began with an oath to Allah as a sign of their love and affection, so that he would not always remember Joseph because of Joseph's incident. that's long gone. If he always remembers Yusuf, he will continue to experience deep sorrow, so that he is worried that he will get a disease that will destroy or die because of it."
		   },
		   {
			"id": 1682,
			"surah": 12,
			"ayat": 86,
			"tafsir": "In this verse, Allah tells the answer of the Prophet Jacob to his children. He said, \"O my children, do not criticize and revile me. I have never complained to you all, as well as to other humans about my sadness and troubles. I complained and conveyed complaints about the calamity that befell me only to Allah SWT. To Him I asking for protection and begging to get rid of that trouble and sadness. Let me have munajat with my Lord. I know from the revelation that Allah gave me that Joseph is still alive and still receiving sustenance. He is a human chosen by Allah. He will perfect His favor to Yusuf and Jacob's family. You didn't know all this, you even thought that Joseph was dead.\""
		   },
		   {
			"id": 1683,
			"surah": 12,
			"ayat": 87,
			"tafsir": "Furthermore, Jacob said to his children that he knew even sure that Joseph's dream was true and he would bow down to respect it. If they think differently, Jacob reminds his children that one day Allah will show the truth of his opinion. For this reason, he asked his children to return to Egypt to investigate until they got definite news about Yusuf and his younger brother Bunyamin and not to despair because Allah has said: No one despairs of the mercy of his Lord, except those who go astray. (al-hijr\/15:56) The believer will not despair because of the calamity that befalls him, and his faith will not waver because of the dangers that hit him. They are patient and steadfast in the face of all the difficulties they experience. He willingly fully accepts destiny from Allah swt with the belief that one day Allah will eliminate all these difficulties, as He says: Verily Allah defends those who have believed. (al-hajj\/22: 38) Conclusion"
		   },
		   {
			"id": 1684,
			"surah": 12,
			"ayat": 88,
			"tafsir": "In this verse it is explained that after Joseph's brothers received advice from their father to return to Egypt, they then departed. Arriving in Egypt, they entered Joseph's palace with all humility. They wanted to know the truth of his father's belief that had said that al-Aziz was Yusuf. They told al-Aziz that they were struck by hunger so they became thin and weak due to lack of food, while their family was not small. They complained about this to al-Aziz, with the intention of finding out about Yusuf and Bunyamin's condition. They also said that they had come with bad and low quality merchandise, so that perhaps no merchant would want to bid on it. They hope that al-Aziz will help them by perfecting the measure of his merchandise without considering the ugliness. The shortfall they had to pay him in order to give it to them. Allah repays the kindness of someone who likes to give charity and He is also the one who will replace everything that has been donated and spent, as He says: And whatever you spend, Allah will replace it, and He is the best provider of sustenance. (Saba\/34: 39)"
		   },
		   {
			"id": 1685,
			"surah": 12,
			"ayat": 89,
			"tafsir": "After Jacob's sons presented their reasons for returning to Egypt, Yusuf responded by reminding them of the crimes they had committed against Yusuf and Bunyamin, his younger brother. Yusuf also said that what they did to themselves and their younger brother was a very bad or bad deed. Maybe because of their ignorance at that time, they did not know and felt the badness of the act even though it was contrary to religious law and violated the obligation to do good to both parents and the order to get along well with close relatives. This is the realization of what Allah revealed to Yusuf when he was thrown into the well by his brothers as the word of Allah swt: We revealed to him, \"You will surely tell them about this deed, while they are not aware. (Yusuf\/12) :15)"
		   },
		   {
			"id": 1686,
			"surah": 12,
			"ayat": 90,
			"tafsir": "After hearing Joseph's words, the realization arose in their hearts that what was before them was Joseph. To corroborate their suspicions, they asked a question full of wonder, \"Are you really Joseph?\" For more than two years they met Yusuf again and again but did not recognize him. Instead, Joseph recognized them, but he hid them in his heart. Their question was answered by Yusuf by saying, \"I am Yusuf whom you have persecuted with quite severe persecution. Allah swt has helped me and glorified me to give me a high rank. I was completely powerless when you planned to kill me and throw me into the bottom of the well. deep. And this is my brother, Bunyamin, whom you have separated from me, who then Allah swt gave him a gift as you can see. Allah swt bestowed His grace on us both, reunited us after being apart for so long, glorified us after being humiliated, and save us from all tests and trials. Religion has determined and experience has proven that people who fear Allah SWT by doing all His commands and staying away from all His prohibitions and are always patient in facing the tests and trials that befall them as well as the deceptions of Satan and Eve lust that always tempts him, Allah will not waste bal the reason for his charity is in this world, especially in the hereafter. In this world he is given a way out of the difficulties he is facing and is given sustenance from an unexpected direction, and in the hereafter he is rewarded without any calculation. Word of Allah swt: Whoever fears Allah, He will surely open a way out for him. And He gave him sustenance from where he did not expect. (ath-thalaq\/65: 2-3) And His words: Only those who are patient are perfected without limit. (az-Zumar\/39: 10)"
		   },
		   {
			"id": 1687,
			"surah": 12,
			"ayat": 91,
			"tafsir": "After Yusuf gave a confession of who he really was and his brothers had believed that al-Aziz was Yusuf, they honestly acknowledged the glory that Allah swt had given Yusuf regarding the advantages of his knowledge, and the height of his morals. They also frankly admit the mistakes they have made to Yusuf and Bunyamin on purpose and premeditated. A mistake that is not forgiven by Allah SWT except with repentance nashuha (true repentance), and cannot be forgiven except with an open heart and the nobility of the person concerned."
		   },
		   {
			"id": 1688,
			"surah": 12,
			"ayat": 92,
			"tafsir": "After hearing the confessions of guilt from his brothers frankly, Yusuf as a prophet, a chosen human being who has noble character, high decency, firmly and clearly forgives all the mistakes that have been made to him and Bunyamin. He prayed that Allah swt would forgive the sins of his brothers and sisters on condition that they would repent with all sincerity and humility, regret that bad deed, be determined not to repeat it again, and always do good, because Allah is Most Merciful. Noble manners and high morals as possessed by the Prophet Yusuf as was also exemplified by the Prophet Muhammad, namely when he and his army conquered the city of Mecca. After the Prophet Muhammad made his tawaf and then prayed two cycles of circumcision, he stood beside the Kaaba facing the prisoners of war and said: What do you think of what I will do to you? The prisoners replied, \"We only thought well. You are a noble brother and noble brother's son.\" The Prophet said, \"I will say as my brother Yusuf has said, \"There is no reproach, scorn, and violence now.\" So the captives came out (left the place) as if they were raised from the grave. Bukhari from Abu Hurairah)"
		   },
		   {
			"id": 1689,
			"surah": 12,
			"ayat": 93,
			"tafsir": "After Yusuf explained who he was to his brothers, he then asked them about his father's condition. They replied that he could no longer see. Immediately Joseph gave his robes to his brothers to be brought back to his country. When he got home, he should immediately wipe the robe on his face, surely he would look back. Yusuf said this based on revelation. He also knew that the cause of his father's blindness was crying too much. If his father knew that the robe was his, indicating that he was still alive and safe from the persecution and trials he experienced, his father would be happy and a feeling of joy would arise in his heart, and he would look back as before. This is a miracle for the Prophet Yusuf. He also asked his brother to bring his entire family to Egypt, both men, women and children, which according to a history, all numbered seventy people."
		   },
		   {
			"id": 1690,
			"surah": 12,
			"ayat": 94,
			"tafsir": "When the camels of Jacob's sons came out from the border of the land of Egypt towards the land of Sham, Jacob said to his grandchildren and relatives who were beside him at that time, \"I have smelled the sweet smell of Joseph, like the smell I once knew at the time. If you don't have prejudice against me, thinking that I am weak-minded, damaged in mind because I am too old, of course you will justify my statement that I have really smelled Yusuf, and he is still alive. Soon I will meet him and happy to see it.\" This was a miracle for Jacob who could smell Joseph from a very far place, about eight days of camel travel at that time."
		   },
		   {
			"id": 1691,
			"surah": 12,
			"ayat": 95,
			"tafsir": "In this verse it is explained that no one in Jacob's family justified his words, they even criticized him for saying inappropriate words to his parents. According to them, Jacob was wrong because he felt that he would soon meet Joseph, even though in their opinion Joseph had been killed by a wolf. Jacob's assumption, according to them, as a sign of his error."
		   },
		   {
			"id": 1692,
			"surah": 12,
			"ayat": 96,
			"tafsir": "In this verse, Allah swt explains that after the bearer of the good news arrived at his father's place according to Yusuf's suggestion, Judah came forward carrying Yusuf's robe and rubbed it on Jacob's face. Jacob's eyes immediately returned to seeing as before. Jacob said to his sons, \"Didn't I tell you when I told you to go to Egypt to find news about Yusuf and his brother, that I actually know through revelation from Allah SWT, not fantasy and wishful thinking that Yusuf is still alive while you don't know it? .\" The surrender of Joseph's clothes to his father by Judah as proof that Joseph is still alive reminds Jacob of the surrender of Joseph's bloodstained clothes by Judah as proof that Joseph has been eaten by a wolf."
		   },
		   {
			"id": 1693,
			"surah": 12,
			"ayat": 97,
			"tafsir": "After Joseph's brothers saw the undeniable evidence and facts, they became aware and honestly admitted their mistake. They also asked their father to ask Allah's forgiveness for the transgression they had committed against their father and the injustice committed against Yusuf. The confession of Joseph's brothers about the mistakes and sins that have been committed is the second confession. Before that, they had confessed their sins and mistakes before Yusuf, only at that time Yusuf immediately asked for forgiveness from Allah SWT without any request from them."
		   },
		   {
			"id": 1694,
			"surah": 12,
			"ayat": 98,
			"tafsir": "After Jacob saw the awareness and recognition of his children for the mistakes they made frankly and their request that their father ask Allah for forgiveness, he replied, \"I will ask Allah for forgiveness for you. May Allah forgive you all because He is Most Forgiving. and Most Merciful. Allah will not disappoint a believer who asks Him earnestly.\""
		   },
		   {
			"id": 1695,
			"surah": 12,
			"ayat": 99,
			"tafsir": "In this verse, it is explained that Joseph's brothers returned to their country to bring all their families to Egypt according to Joseph's advice. Upon arrival, they told his parents about Joseph's position in Egypt, where he was the full authority there. It was also conveyed that Yusuf invited all his family to settle in Egypt together with him, enjoying the progress and beauty of the city of Egypt. Hearing the news, they went together to Egypt. After arriving in Egypt they met Yusuf and his entourage who went to pick them up in the middle of the road. Yusuf embraced his parents and said, \"Please enter the land of Egypt safely and securely, God willing, you will not experience difficulties and hunger, even though the dry season is still gripping.\" The words \"Insya Allah\" that Yusuf said are a lesson for us Muslims that if you want to do something, you must rely on Allah's will. This has become a custom for the prophets and shiddiqin. This is also in accordance with the intent of the word of Allah SWT: And do not ever say to something, \"I will definitely do that tomorrow morning,\" except (by saying), \"God willing.\" (al-Kahf\/18: 23 and 24)"
		   },
		   {
			"id": 1696,
			"surah": 12,
			"ayat": 100,
			"tafsir": "This verse explains that Joseph then appointed his parents and seated them on the throne as more honor than what he had done for his brothers. They lay down and bowed down to pay their respects to Joseph, as people usually pay respect to kings and princes at that time. Yusuf then said, \"O my father! This is the takbir of my first dream when I was a child which I conveyed to my father with the words: Indeed, I (dreamed) saw eleven stars, the sun and the moon; I saw them all prostrate to me. (Yusuf\/12: 4 ) Yusuf further said, \"Allah swt made my dream come true, not a fantasy. The eleven stars are my brothers, who number eleven people, while the sun and moon are my father and mother.\" It was with this family that Allah took care of the descendants of the Prophet Isaac, the son of Prophet Abraham, to develop the religion of monotheism on this earth. Furthermore, Yusuf said to his father, \"Allah swt has been good to me. He released me from prison and made me ruler. He moved his father from a desert village with a simple and rough life, to a bustling land, enjoying a happy life, spreading true religion, and helping in advancing science. This all happened after Satan cut off the friendly relations between my brothers and I so that brotherly relations were damaged, and jealousy and suspicion arose between us. Verily, Allah swt is All-Knowing of everything, however subtle, is gentle to His servants, and determines what He wills with His wisdom. Verily, He is All-Knowing of what is of benefit to His servants. Nothing is hidden from Him. Wise in all things, repays those who do good with good, and a good end is given to those who are pious.\""
		   },
		   {
			"id": 1697,
			"surah": 12,
			"ayat": 101,
			"tafsir": "This verse is a statement and a prayer that Yusuf said after Allah saved him from the well, freed him from the slander of al-Aziz's wife and other women, freed him from suffering in prison, and bestowed him with rank and position after being freed from all the accusations leveled at him. . Yusuf immediately prayed to Allah SWT so that his reward would be multiplied in the hereafter as the gifts he received in this world multiplied. Yusuf said, \"O my Lord, You have bestowed upon me position and power, taught me the takbir of dreams, and told me things that will happen in the future and the secrets contained in Your revelations. O Allah! You are the Creator of the heavens and this earth, created both in good and orderly, firm and tidy, You are my Protector in this world and in the hereafter, protect me from the evil intentions of those who are against me and those who want to do evil to me. O Allah Almighty! Death to me in the state of Islam, in accordance with the will of my ancestors which reads: And Abraham left (sayings) it to his children, so did Jacob, \"O my children! Verily, Allah has chosen this religion for you, so do not die except in a Muslim state. (al-Baqarah\/2: 132) Yusuf continued his prayer by saying, \"O Allah, O my Lord! Enter me into the group of pious people from our ancestors such as the Prophets Abraham, Ishmael, and Isaac, as well as the prophets and apostles. before. You are the Most Gracious, the Most Gracious, and the Almighty over all things.\""
		   },
		   {
			"id": 1698,
			"surah": 12,
			"ayat": 102,
			"tafsir": "In this verse, Allah swt explains that the story of Yusuf that has been described above includes occult news. The unseen news was revealed to Muhammad. Previously, he and the Muslims did not know about it. He also did not know when Joseph's brothers united and agreed to throw Joseph into a deep well, and when they orchestrated his deception and plot. Muhammad knew about the events that had been experienced by Yusuf through revelation from Allah. This event is clear evidence of the truth of the prophethood and apostleship of Muhammad saw. For people who are aware, this evidence is a reason to believe and justify Muhammad's apostleship."
		   },
		   {
			"id": 1699,
			"surah": 12,
			"ayat": 103,
			"tafsir": "In this verse, it is explained that people who have truly disbelieved and are constantly disobedient, will not believe however we hope and want it, even though real and convincing reasons have been given. Likewise, most of the Meccan Quraysh, even though they had been given concrete evidence, they would not believe and would not justify Muhammad's prophethood and apostleship. Therefore, whether a person has faith or not after receiving the da'wah of the apostle is not his responsibility. Word of Allah swt: Indeed, you (Muhammad) cannot guide those you love, but Allah guides those whom He wills, and He knows better those who are willing to receive guidance. (al-Qashash\/28: 56)"
		   },
		   {
			"id": 1700,
			"surah": 12,
			"ayat": 104,
			"tafsir": "In this verse, Allah SWT reminds Muhammad SAW not to ask anyone for a reward, as a reward for preaching and advising them to obey and worship only Allah SWT and leave idol religions. Allah will provide wages and rewards for his efforts, because indeed the Al-Quran was sent down to him as a guide to carrying out his duties as an apostle. Al-Quran is a warning and advice to guide and give instructions to humans that will lead to happiness in the world and the hereafter."
		   },
		   {
			"id": 1701,
			"surah": 12,
			"ayat": 105,
			"tafsir": "In this verse, Allah SWT explains that there are not a few signs that show His oneness, perfection, and power, such as the sun, moon, stars, mountains, seas, plants, etc., which can seen and witnessed by humans themselves. However, they do not pay attention to it and do not think about the wisdom contained in it. All of this shows that Allah is One, there is no God but Him. He is the One who created all creatures perfectly and orderly. Even if some of them try to know what is in the heavens and on earth, they forget their Creator. With their minds, they are engrossed in applying their knowledge, developing and making use of it, but their souls are empty of remembering Allah and do not believe in Him. Knowledge alone, even though it is useful, is of no use in the Hereafter unless it is based on faith in Allah. What a happy person who can unite the two. That person will get goodness in this world and the hereafter and be safe from the punishment of hell fire later."
		   },
		   {
			"id": 1702,
			"surah": 12,
			"ayat": 106,
			"tafsir": "This verse describes the condition of the Meccan Quraysh. Besides believing in Allah who created all things, they also associate partners with Him. If they are asked who created everything on earth and in the sky, they will answer emphatically that it is Allah who created it all as stated in the Koran: And indeed, if you (Muhammad) ask them, \"Who created created the heavens and the earth?\" Of course they will answer, \"God.\" Say, \"Praise be to Allah,\" but most of them do not know. (Luqman\/31: 25) The Meccan Quraysh's acknowledgment of Allah's existence was also followed by associating partners with Him. They worship idols and make priests as gods. In fact, some of them even say that God has a son. Glory be to Allah swt from what was alleged. Associating partners with Allah is the greatest sin. Ibn Masud once asked the Prophet Muhammad about the greatest sin. The Prophet replied: That you have partnered with Allah, even though He created you. (History of al-Bukhari and Muslim from Ibn Masud)"
		   },
		   {
			"id": 1703,
			"surah": 12,
			"ayat": 107,
			"tafsir": "In this verse, Allah questions whether those who acknowledge Allah as their Creator but also associate partners with Him by worshiping other than Him feel safe from the punishment that will suddenly befall them. Do they feel safe that they will not meet sudden and unexpected death? Never! At any time Allah swt could inflict punishment on them, so Allah swt could order the Angel Azrael to take his life suddenly and unexpectedly if Allah wills. Allah SWT is the Executor of what He wills, as His word: Indeed, your Lord is the Executor of what He wills. (Hud\/11: 107) In line with this verse 107, the word of Allah swt: So do those who make that evil deception feel safe (from disaster) that Allah immerses the earth with them, or (against) punishment comes to them from directions they are not aware of, or Allah punishes them while they are on their way; so that they are powerless to resist (the doom), or Allah will punish them gradually (until they perish). So verily, your Lord is Most Gracious, Most Merciful. (an-Nahl\/16: 45-47) Among the wisdom of hiding when doom appears to be suddenly or the sudden taking of life by Azrael, is so that they are always ready for death. Thus, they are always obedient and obedient in carrying out worship and do not commit immorality. They are aware only of Allah swt humans worship and do not associate partners with Him in the least."
		   },
		   {
			"id": 1704,
			"surah": 12,
			"ayat": 108,
			"tafsir": "In this verse, Allah SWT orders Muhammad SAW to inform his people that the da'wah he carries out, which aims to invite people to unite Allah SWT and sincerely worship only Him, is his duty and obligation. The Apostle has confidence that his efforts will succeed because what he proposes and implements is based on real evidence and proof. That is the duty and obligation of those who believe in and follow it so that all kinds of servitude to other than Allah can be eradicated from the surface of this earth. Pay attention to the word of Allah SWT which teaches how to preach to the Messenger and his people: Call (people) to the way of your Lord with wisdom and good teaching. (an-Nahl\/16: 125) In the next verse, Allah teaches Muhammad to purify Him from accusations of partners by saying Glory be to Allah, from the suspicion that He has partners in His power, and there are those who must be worshiped besides Him. The heavens and the earth and all that is in them, even all that exists, glorify Allah to purify Allah from such things, says Allah SWT: The seven heavens, the earth and all that is in them glorify Allah. And there is nothing but glorify Him by praising Him, but you do not understand their tasbih. Indeed, He is Most Forbearing, Most Forgiving. (al-Isra\/17: 44) Verse 108 concludes with the assertion that the Prophet Muhammad was not among those who were polytheists."
		   },
		   {
			"id": 1705,
			"surah": 12,
			"ayat": 109,
			"tafsir": "In this verse, Allah swt explains that He did not send any messengers before Muhammad except men, not angels, and not women, and sent down revelations to them. The apostles came from the inhabitants of the land itself, so that they would follow him. This is a response to the accusations leveled by people who deny the prophethood of Muhammad saw, who wanted the messengers sent to be from the type of angels as narrated by Allah in His words: And had Allah willed, He would have sent angels. (al-Muminun\/23: 24) Wouldn't the polytheists of Quraysh deny the prophethood of Muhammad and deny what he brought as oneness of Allah, sincere worship solely to Him, traveling the earth and seeing and witnessing the consequences of people -those who denied the first apostles. They were annihilated and their country destroyed, as experienced by the Prophet Hud, the Prophet Saleh, and others. On the other hand, those who believe in Allah and His Messenger and are afraid of associating partners with Allah, do not commit sins and immorality, will find pleasure later in the hereafter which is far better than what the polytheists in this world get. Do they not think about the difference in reward and reward between those who deny and those who believe. The pleasures that the deniers get in the world are very limited. When they die, the fun will end, and in the afterlife they will receive a very painful punishment without stopping. And the pleasure that believers get, not only in this world but in the hereafter, because the pleasure they get is eternal forever."
		   },
		   {
			"id": 1706,
			"surah": 12,
			"ayat": 110,
			"tafsir": "This verse explains the sunatullah that has applied to the previous people. Allah swt sent His messengers with clear evidence and strengthened by miracles. After the apostles were opposed, belied, and despised by their people so that they felt very heavy pressure, a feeling arose as if they were hopeless because there was no hope for their people to believe and the victory they had been waiting for had not yet come, that was when help Allah swt is coming. Meanwhile, those who denied the prophets were subject to sudden punishment, such as the great flood that drowned the people of Prophet Noah, the hurricane that destroyed the people of Â'd (the people of Prophet Hud), the torment that befell the Samud people, and the disaster that hit the land of the The Prophet Lut, as stated in the word of Allah swt: Did not news reach them (about) those who were before them, (namely) the people of Nuh, Ad, Samud, the people of Abraham, the people of Madyan, and (the people of) the countries that been destroyed? The apostles had come to them with clear proofs; Allah did not wrong them, but they wronged themselves. (at-Taubah\/9: 70) Those of Quraysh who do not want to convert and return to the right path, even though clear evidence has been shown, Allah will inflict a painful punishment on them. Meanwhile, the Prophet Muhammad was given assistance in the form of various victories he had obtained such as the Battle of Badr and in the following wars. Allah swt saved the apostles and their people who believe in Him, while those who disbelieve in Allah and deny His messengers and the religion they carry will be punished, none of them can refuse and avoid Allah's punishment ."
		   },
		   {
			"id": 1707,
			"surah": 12,
			"ayat": 111,
			"tafsir": "In this verse, Allah swt explains that all the stories of the prophets, especially the Prophet Yusuf as with his father and brothers, are lessons for people who have common sense. While people who are negligent who do not use their minds and minds to understand the existing reality, then the story of the Prophet will not be of any use to him. They will not be able to take lessons and warnings from him. They should pay attention that the one who is capable and has the power to save the Prophet Yusuf as after being thrown into the bottom of a well, raises his rank after he is imprisoned, controls the land of Egypt after being sold at a cheap price, raises his rank from his brothers who want to destroy him, and gathers them When he returned with his parents after being separated for so long, of course he could and had the power to glorify Muhammad, exalt his words, win over the religion he brought, and help and strengthen him with soldiers, followers, and loyal supporters, even though in going through all of that, he had experienced difficulties. and trouble. The holy book Al-Quran which carries these stories, is not a story that is made up and made up, but is a revelation sent down by Allah swt and a miracle that weakens accomplished literary figures when challenged to compile something like that. The stories were reported from the prophet who never studied books and never associated with clever scholars. Even the Holy Koran confirms the contents of heavenly books that were revealed to previous prophets, such as the original Torah, Bible and Psalms, of course, not those that have been added to superstitions and other things whose purity is no longer maintained. In the holy book Al-Quran, Allah's commands are clearly described, His prohibitions, His promises and threats, the nature of perfection that is obligatory for Him and is holy from the characteristics of deficiencies and other things, as the word of Allah swt: We have omitted nothing in the Book. (al-Anam\/6: 38) Al-Quran is a guide for people who want to read it with full awareness and who want to research and explore its contents. Al-Quran will also guide them to the right path and lead to happiness in the world and the hereafter. The Al-Quran is a mercy for those who believe, namely those who justify and believe and practice its contents, because faith is a saying that is justified by the heart and proven by deeds."
		   }
	]
}
