{
	"tafseer": [
		{
			"id": 2030,
			"surah": 17,
			"ayat": 1,
			"tafsir": "Allah swt declares His majesty with the word \"subhana\", so that humans acknowledge His holiness from unworthy traits and believe in the attributes of His incomparable majesty. This expression is also a statement about the nature of His greatness that has traveled His servant one night, with a very fast journey. Allah swt begins His word with subhana in this verse, and in several other verses, as a sign that the verse contains extraordinary events that can only be carried out because of His will and power. From the word asra' it can be understood that the Prophet Muhammad's Isra' took place at night, because the word asra in Arabic means traveling at night. The mention of lailan, in the form isim nakirah, which means \"night\", is to illustrate that the Isra' incident took a short night and also to strengthen the notion that the Isra' event really took place at night. Allah swt sends His servant's Isra' at night, because that is the most important time for servants to get closer to Allah, and the best time to worship Him. The word 'abdihi (His servant) in this verse refers to the Prophet Muhammad who was chosen as the last prophet. He had received orders to make a night journey, as a tribute to him. This verse does not specify the exact time, both when the Prophet Muhammad departed and returned to his home in Mecca. It's just that it was explained that the Prophet Muhammad's Isra' started from the Grand Mosque, namely the mosque which is famous because the Kaaba (Baitullah) is located in it, to the Aqsa Mosque which is in Baitul Makdis. The mosque is called Masjid Al Aqsa which means \"farthest\", because it is far from the city of Mecca. Furthermore, Allah SWT explained that the Aqsa Mosque and the surrounding areas received Allah's blessings because they became the place for revelations to the prophets. The land is fertile, so that it becomes a prosperous area. In addition, the mosque is included among the mosques where the worship of the prophets and their residence. After that, Allah mentioned the reason why the Prophet Muhammad was traveling at night, namely to show the Prophet the signs of His greatness. These signs were witnessed by Muhammad saw on his journey from the Grand Mosque to the Aqsa Mosque, in the form of valuable experiences, fortitude in facing various kinds of trials, and how vast the universe is and how great Allah is the Creator. The new experiences witnessed by the Prophet Muhammad were very useful for strengthening his heart in facing various kinds of obstacles from his people, and believing in the truth of Allah's revelations, both those he had received and those he would receive. At the end of this verse, Allah swt explains that He is All-Hearing the inner whispers of His servants and All-Seeing of all their deeds. There is no heartbeat, or body movement of all creatures that exist between the heavens and the earth that escapes His observation. This verse mentions the event of Isra', namely the journey of the Prophet Muhammad from the Grand Mosque to the Aqsa Mosque at night. Meanwhile, the Mi'raj event, namely the ascension of the Prophet Muhammad from the Aqsa Mosque to Sidratul Muntaka (Mustawa) is not implied by this verse, but hinted at in surahh an-Najm. Almost all commentators are of the opinion that the Isra' event took place after the Prophet Muhammad was sent as an apostle. The incident occurred one year before the migration. This is according to Imam az-Zuhri, Ibn Sa'ad, and others. Imam Nawawi also confirmed this. In fact, according to Ibn Hazm, the Isra' incident took place in the month of Rajab, the twelfth year after the appointment of Muhammad as a prophet. Meanwhile, al-hafidh 'Abdul Gani al-Maqdisi chose the opinion that the Isra' and Mi'raj occurred on the 27th of Rajab, arguing that at that time the people carried it out. The hadiths which explain the occurrence of Isra' are as follows: First: Anas bin Malik said that on the night of the Prophet's journey from the Masjidilharam, three people came to him at the time before the revelation, while the Apostle at that time was sleeping in the Masjidilharam. Then said the first, \"Who is he?\" Then the second person replied, \"He is the best among them (his people).\" After that the third person said, \"Take the best person.\" On that night the Prophet did not know who they were, so they came to the Prophet the other night with their eyes sleeping but their hearts were not sleeping. Thus the prophets, even though their eyes were closed, their hearts were not asleep. After that the group did not speak at all to the Prophet until they brought the Prophet and put him around the Zamzam well. Among them was Jibril who controlled the Prophet himself, then Jibril cut open a part of the body, from the neck to the heart, so that his chest was empty. After that Jibril washed the Prophet's heart with Zamzam water using his hands, so that his heart was clean. Then Jibril brought a golden vessel containing faith and wisdom. Then he poured the contents of the vessel into his chest and the veins of his throat and closed them again. (Al-Bukhari) Second: That the Prophet said, \"Suddenly a person (Gabriel) came to me. Then he opened my heart and took it out. After that, he brought me a vessel made of gold filled with faith, then he washed my heart. After that, he poured the contents of the vessel over to me. Then he returned my heart to the way it was before.\" (Al-Bukhari's history from Sa'sha'ah) Third: That the Messenger of Allah said, \"Buraq was brought to me, a white animal bigger than himar, and smaller than bigal. He stepped his feet as far as his eyes could see. Then I rode him, then he took me so that I reached Baitul Makdis. Then I tied him to the place where the prophets tied up their vehicles. Then I prayed two rak'ahs in it, then I came out. Then Jibril brought me a vessel filled with liquor (khamar) and another filled with milk; then I chose the one containing milk, then Jibril said, \"You have chosen fitrah as the right choice.\" (Ahmad's history from Anas bin Malik) From these hadiths, it can be concluded that the Prophet Muhammad traveled at night from the Grand Mosque to the Upper Aqsa Mosque permission of Allah under the guidance of the angel Jibril. Before the Prophet Muhammad was sent that night, his heart was filled with faith and wisdom, so that he could withstand pi all kinds of trials and steadfast in carrying out His commands. The journey was carried out by riding the Buraq which has extraordinary speed so that Isra' and Mi'raj only takes less than one night. In this verse it is not explained in detail, whether the Prophet Isra' with his spirit and body, or just his spirit. That is why the mufasir differed on this matter. The majority of them are of the opinion that Isra' is done with the spirit and body in a conscious state, not in a sleeping state. They put forward several reasons to strengthen their opinion, including: a. The word subhana denotes a great event. If the Prophet's isra' is in a sleeping state, there is no need to reveal it by using a verse preceded by tasbih. b. If Isra' had been done while sleeping, the Quraysh would not necessarily have denied it. The large number of Muslims who apostatized again because of the Isra' incident shows that this is not an ordinary event. Umm Hani's words that forbade the Prophet to tell anyone about his experiences during Isra' so that they would not think the Prophet was lying, also confirmed that Isra' was done by the Prophet with his spirit and body. This incident caused Abu Bakr to be given the title as-shiddiq because he confirmed the Prophet, quickly and without hesitation, to Isra' with his soul and body, while other people were hard to accept. c. The word of God which uses bi'abdihi shows that the Prophet Isra' with a spirit and body because the word servant refers to the unity of body and spirit. Ibn 'Abbas said that the Arabs used the word ru'ya in the sense of seeing with the eye, so the word ru'ya mentioned in the following word of Allah must be understood as seeing with the eyes. And We did not make the dream that We showed you, but as a test for mankind. (al-Isra'\/17: 60) e. What was shown to the Prophet at the time of Isra' and Mi'raj was eye vision which might occur because a similar speed has been proven by humans with modern technology. Some other commentators are of the opinion that Isra' was done by the Prophet with his spirit alone. They confirmed their opinion with the words of Mu'awiyah bin Abi Sufyan when asked about the Prophet Muhammad's Isra', he replied: The Prophet's Isra is a true dream that comes from Allah. The opinion that says that Isra' can only be done with the spirit is weak, because the sanad of hadith that is used as proof or guidance is not clear."
		   },
		   {
			"id": 2031,
			"surah": 17,
			"ayat": 2,
			"tafsir": "In this verse it is explained that Allah has sent down the Torah to Musa as as a guide for the life of the Children of Israel. Allah swt ordered Musa as to say to his people, \"Do not take other than Allah as a helper who provides protection and settles your affairs.\" The prohibition aimed at his people was a prohibition that had also been conveyed by the previous apostles through Allah's revelation. Also contained in the prohibition above is the command that humans worship only Allah and the prohibition of associating anything else with Him. There is also a prohibition on asking for help in all matters except from Him. Giving the book of the Torah to Prophet Musa as a guide for his people is to give understanding to Muslims, that among the duties of the apostles is conveying the religion of monotheism, as the Prophet's duty to them. Also to remind them not to imitate the attitude of the previous people, where after the death of the apostles, they made up tafsirs of Allah's words according to their will, and wallowed in the valley of sin and real error. That is why Allah swt mentions repeatedly in the Qur'an the privilege of Musa as and the advantages of the Children of Israel from other nations that existed at that time. Allah also mentions the favors given to them, with the intention that their consciences will be moved, then return to the right path, and live according to His instructions."
		   },
		   {
			"id": 2032,
			"surah": 17,
			"ayat": 3,
			"tafsir": "Allah swt also mentioned their ancestors, namely people whom Allah had saved together with Nuh as from a typhoon. They were saved by Allah through His revelation to Noah as Nuh was ordered to build a boat, so that he and his loyal people would avoid the punishment of Allah that would befall his people who denied his prophethood. This contains a warning for the Children of Israel to take examples and lessons from that event, and follow the path taken by Prophet Noah. This is also a lesson for Muslims to maintain monotheism like Noah and his followers, as well as people who are grateful for God's blessings. As an explanation of this tafsir, it is necessary to put forward several hadiths which explain that Prophet Noah as was a prophet who was very grateful for God's blessings, as mentioned in the hadith: First: Muadz bin Anas Al-Juhaniy narrated that Prophet Muhammad saw said, \"Verily Allah named Noah as servant who is very grateful for Allah's favors because when the time comes in the evening and in the morning, he says, Glory be to Allah when you are in the evening and at dawn and to Him be all praise in the heavens and the earth when it is in the evening and when you are at noon.\" (History of Ibn Mardawaih) Second: When Noah was wearing clothes and eating food he praised Allah. So he was called \"a servant who is very grateful for Allah's favors.\" the Muslims."
		   },
		   {
			"id": 2033,
			"surah": 17,
			"ayat": 4,
			"tafsir": "In this verse it is explained that Allah revealed to Musa as, as contained in the Book of the Torah, that the Children of Israel would cause chaos twice in the land of Palestine, so that Allah would move their enemies to kill, seize and destroy their country. . After repenting, they were released by Allah from this tribulation, their kingdom was returned, and they were given wealth and strength, both in terms of property, as well as strength in the field of lineage and national defense. However, they returned to causing trouble, so Allah swt re-deployed their enemies to destroy them. This is the punishment in this world, and in the hereafter they will get the punishment of hell. Among their defiance are: First, they do not heed God's commands and change the contents of the Torah. Second, their abomination in killing Zakaria and Yahya and their attempt to kill the Prophet Isa. They carried out this defiance by being arrogant and showing arrogance. This shows that the crimes they have committed have exceeded the limits of humanity. Allah then explained the consequences that would befall them, because of the first disobedience, that is, they would experience destruction when the punishment that Allah had promised arrived as a proper recompense for their crimes. It is also good to explain here, that the Children of Israel starting in 975 BC were divided into two kingdoms. First, the kingdom of Yahudza in the south, which consists of two tribes of the Children of Israel, namely the tribes of Yahudza and Benjamin. Its first king was Rehoboam, son of Prophet Sulaiman. Second, the kingdom of Israel in the north which consists of 10 other tribes. The first king named Jeroboam bin Nebat. In 70 BC the kingdom of Israel was attacked by the king of 'Assyria named Sanharib. This king could enter the city of Samurra, the capital of the Israelite kingdom, take the Israelites captive, and lead them to 'Assyria. Thus, the kingdom of the Children of Israel collapsed after living for 250 years. Due to the unrest of the Children of Israel, Allah sent the Babylonian army under the leadership of its king, Bukhtanashshar, also known as Nebuchadnezzar. This army expanded its land by killing, plundering, and robbing the inhabitants of the conquered lands. They attacked the Children of Israel, killed the scholars and officials from among them, damaged and burned the Torah books, and even destroyed their holy city, Baitul Makdis (Jerusalem). That was the fate that the Children of Israel suffered because they had deviated from the guidance of Allah's revelation, and tended to follow the will of their lusts. They even suffered an even worse fate, namely among the Children of Israel who were taken to Babylon. Three times they were taken prisoner by Nebuchadnezzar. The third and final captivity took place in 558 BC. As a result of Nebuchadnezzar's attack, the kingdom of Yahudza fell."
		   },
		   {
			"id": 2034,
			"surah": 17,
			"ayat": 5,
			"tafsir": "In this verse it is explained that Allah revealed to Musa as, as contained in the Book of the Torah, that the Children of Israel would cause chaos twice in the land of Palestine, so that Allah would move their enemies to kill, seize and destroy their country. . After repenting, they were released by Allah from this tribulation, their kingdom was returned, and they were given wealth and strength, both in terms of property, as well as strength in the field of lineage and national defense. However, they returned to causing trouble, so Allah swt re-deployed their enemies to destroy them. This is the punishment in this world, and in the hereafter they will get the punishment of hell. Among their defiance are: First, they do not heed God's commands and change the contents of the Torah. Second, their abomination in killing Zakaria and Yahya and their attempt to kill the Prophet Isa. They carried out this defiance by being arrogant and showing arrogance. This shows that the crimes they have committed have exceeded the limits of humanity. Allah then explained the consequences that would befall them, because of the first disobedience, that is, they would experience destruction when the punishment that Allah had promised arrived as a proper recompense for their crimes. It is also good to explain here, that the Children of Israel starting in 975 BC were divided into two kingdoms. First, the kingdom of Yahudza in the south, which consists of two tribes of the Children of Israel, namely the tribes of Yahudza and Benjamin. Its first king was Rehoboam, son of Prophet Sulaiman. Second, the kingdom of Israel in the north which consists of 10 other tribes. The first king named Jeroboam bin Nebat. In 70 BC the kingdom of Israel was attacked by the king of 'Assyria named Sanharib. This king could enter the city of Samurra, the capital of the Israelite kingdom, take the Israelites captive, and lead them to 'Assyria. Thus, the kingdom of the Children of Israel collapsed after living for 250 years. Due to the unrest of the Children of Israel, Allah sent the Babylonian army under the leadership of its king, Bukhtanashshar, also known as Nebuchadnezzar. This army expanded its land by killing, plundering, and robbing the inhabitants of the conquered lands. They attacked the Children of Israel, killed the scholars and officials from among them, damaged and burned the Torah books, and even destroyed their holy city, Baitul Makdis (Jerusalem). That was the fate that the Children of Israel suffered because they had deviated from the guidance of Allah's revelation, and tended to follow the will of their lusts. They even suffered an even worse fate, namely among the Children of Israel who were taken to Babylon. Three times they were taken prisoner by Nebuchadnezzar. The third and final captivity took place in 558 BC. As a result of Nebuchadnezzar's attack, the kingdom of Yahudza fell."
		   },
		   {
			"id": 2035,
			"surah": 17,
			"ayat": 6,
			"tafsir": "Then it was explained that Allah gave the people of Israel a turn to rule again. After Cyrus Kisra the first Persian of the Sasanian family was able to defeat Babylon, he freed the captives from the Children of Israel who were there, and sent them back to Palestine in 536 BC. Thus, the Israelites took control of their land again. God's gift was given to the Children of Israel when they had repented, obeyed the teachings of the Torah again, and realized the carelessness they had committed. They can rebuild their country and save their families and property. Thus, they returned to being an independent nation and could regain control of their country and become a strong and united nation as before, which they named the Jewish kingdom. It is because of Allah's forgiveness and mercy alone. This verse explains that as long as humans are under the guidance of revelation and walk according to His instructions, they will be able to experience the blessings Allah has provided in this world. They can also feel calm and happiness, peace of life, or the prosperity of the country. On the other hand, if humans deviate from the guidance of revelation and follow the desires of their own desires, they will certainly experience a bad fate. They no longer feel the favors that God has provided in this world, even those favors will turn into a disaster. They will not experience happiness and prosperity in social life, but will become people who are oppressed and expelled from their own country."
		   },
		   {
			"id": 2036,
			"surah": 17,
			"ayat": 7,
			"tafsir": "Allah emphasized that when the Children of Israel did good, then the results of that goodness were for themselves. However, the provisions contained in this verse are not specific to themselves, but generally apply to all humans at all times. Thus, if humans do good or do good, then the reward for that virtue will be felt, both in this world and in the hereafter. The good that they will receive in the world is that they will be a strong people defending themselves from the evil plans planned by their enemies. They will have the opportunity to multiply wealth as a means of life, and continue their descent as caliphs on earth. They will become a strong nation, which can embody a high culture to further excite their lives, and ensure the smooth running of their business and worship to Allah swt. Meanwhile, eternal happiness is heaven full of pleasures that are provided and promised to them, as proof of Allah's pleasure for the good they have done. If they do evil by committing acts that are contrary to the revelation and nature of their own events, such as opposing the truth and norms in their own way of life, then the result of their actions will be God's wrath against them. Thus, they will become a divided nation because they are enslaved by lust, so that one group tries to subdue the other group. That is why they cannot defend themselves and themselves against destruction and the evil intentions of the enemy. They will become an oppressed and colonized nation. While the bad that they will feel in the hereafter is the punishment of hell fire as the most painful torment. Then Allah revealed again the punishment as a result of the crime committed by the Children of Israel for the second time. At that time, Allah left them in a state of chaos when the enemies came to conquer them. This second defeat was truly incomparable to them and humiliated them. The enemy entered the Aqsa Mosque by force and arbitrarily to seize the wealth they had kept and destroy their religious symbols, as was done during the first conquest. Thus, they feel the suffering multiplied. They experienced material suffering in the form of loss of power, property, and women who were taken prisoner by the enemy. They also suffered moral suffering because the holy places and sacred symbols of their religion were violated and destroyed. According to history, it was the Romans who destroyed them for the second time, who then controlled Palestine. They killed and captured Jews and destroyed Baitul Makdis and other cities. The first Roman emperor to enter Baitul Makdis was Emperor Titus in 70 AD. He burned the Aqsa Mosque, and seized the valuables in it, so that in this event approximately 1 million Jews were killed. Furthermore, Emperor Hadrianus, who reigned from 117 to 158 AD, also controlled Baitul Makdis and carried out various acts of vandalism in the mosque. Hadrian turned this city into the Aelina Capitolian (city of Aelina). The Aqsa Mosque was torn down and a building was erected on it which was named Jupiter Capitolina. Then the Jewish kingdom was also destroyed so that the Jewish people had no kingdom anymore. They scattered all over the world. This event occurred in 132 AD."
		   },
		   {
			"id": 2037,
			"surah": 17,
			"ayat": 8,
			"tafsir": "Then Allah swt ordered them to be fully aware, repent, and adhere to the teachings of the Torah and stay away from immoral acts. Thus, Allah will bestow His mercy upon them. God's promise like this will certainly be fulfilled and they will definitely feel it. It is stated in history that in 614 AD, after 483 years after the destruction of Jerusalem by Hadrianus, the Persians under the leadership of Kisra Barwiz seized the cities in Palestine from the hands of the Romans. They fought the Romans against the Jews, and overturned the Christian custom of throwing garbage into Solomon's Temple. They also sold the Christians living in Jerusalem to the cities of the Jews, and burned their churches. Then in 624 AD, the Romans under the leadership of Emperor Heraclius I were able to retake Palestine from the hands of the Persians. In fact, Heraclius was able to enter the interior of the Persian empire, and put out the fire that the Persians worshiped. The victory of the Romans coincided with the victory of the Muslims in the battle of Badr against the polytheists of Mecca (Ramadan in 2 H) or January 624 AD, approximately 9 years after the Romans were defeated by the Persians. However, peace between the Romans and Persians only occurred in 928 AD, after Kisra Evermiz was killed by his own officers. In that year, all of Palestine was again under Roman rule and the cross was returned to Jerusalem. The Prophet Muhammad, who was sent since 610 AD as a prophet who brings mercy to the whole world, in 622 AD migrated to Medina. Upon arrival in Medina, he entered into an agreement with the Jews in that city. This agreement is known as the Medina Charter. Its contents stated that the Jews were residents of the city of Medina besides the Ansar and Emigrants. They were allowed to continue to adhere to their religion. However, they betrayed and staged a plot to kill the Prophet. They were then fought by the Prophet, and some of them were expelled from Medina, namely Bani Nadhir. After Umar bin Khaththab became caliph, he conquered the land of Sham (Suria) in 636 AD. The inhabitants of Jerusalem (Baitul Makdis) under the leadership of Patrip Suverianus surrendered the city to him, and a peace charter was agreed and signed by both parties. Umar bin Khaththab then built a mosque in the Qibla of the Aqsa Mosque (Sulaeman's Temple), and cleaned the city of Jerusalem. So the city of Jerusalem that had been lost all this time reappeared in glory. After the entire Syam country including Palestine fell into the hands of the Muslims, the Roman Emperor Heraclius I climbed a hill and faced Syria. Then he waved his hand saying, \"Farewell Suria forever.\" Thus, the Jewish nation was released from the clutches, persecution, and oppression of the Romans. They were again free to worship around the Sulaiman Temple (Aqsa Mosque). This is a mercy from Allah the Almighty. Such is the description mentioned in the history books. As for the Qur'an, it is not explained in detail, because the Qur'an is not a history book. Meanwhile, Allah SWT continues to remind them that if they repeat their disobedience, as was done by their forefathers, Allah SWT will surely bring down His punishment again with a more painful one. In addition, Allah provides the punishment of the fires of Hell as an eternal prison for them in the hereafter, because that is the punishment that is appropriate for those who do not want to believe."
		   },
		   {
			"id": 2038,
			"surah": 17,
			"ayat": 9,
			"tafsir": "Allah swt states the privileges of His book which was revealed to the Prophet Muhammad, namely the book of the Qur'an, by showing the function of the book itself and its benefits for all mankind. Among the benefits of the Qur'an mentioned in this verse are: First, the Qur'an gives instructions to people who want to use it as a guide to the straight path. What is meant by the straight path in this verse is the religion of Islam, which is based on the teachings of monotheism, namely the belief that there is no power that can create and control this universe except Allah swt. His power cannot be matched by anyone. He is the real Ruler of nature, and the One who has the greatest power. Second, the Al-Qur'an gives good news to those who believe in Allah and His Messenger, do good deeds, do whatever Allah commands, and avoid doing something that He has forbidden. The good news is in the form of abundant rewards that will be received in the hereafter, as a reward for the good deeds they do in this world. Third, the Qur'an is a warning for those who do not believe in the Day of Judgment and do not acknowledge the reward and punishment that Allah will give on the Day of Resurrection as a reward for their actions while living in this world. The threat addressed to them is a painful doom in return for the immoral acts that tarnish their souls. This includes people from the People of the Book who do not recognize the apostleship of the Prophet Muhammad."
		   },
		   {
			"id": 2039,
			"surah": 17,
			"ayat": 10,
			"tafsir": "Allah swt states the privileges of His book which was revealed to the Prophet Muhammad, namely the book of the Qur'an, by showing the function of the book itself and its benefits for all mankind. Among the benefits of the Qur'an mentioned in this verse are: First, the Qur'an gives instructions to people who want to use it as a guide to the straight path. What is meant by the straight path in this verse is the religion of Islam, which is based on the teachings of monotheism, namely the belief that there is no power that can create and control this universe except Allah swt. His power cannot be matched by anyone. He is the real Ruler of nature, and the One who has the greatest power. Second, the Al-Qur'an gives good news to those who believe in Allah and His Messenger, do good deeds, do whatever Allah commands, and avoid doing something that He has forbidden. The good news is in the form of abundant rewards that will be received in the hereafter, as a reward for the good deeds they do in this world. Third, the Qur'an is a warning for those who do not believe in the Day of Judgment and do not acknowledge the reward and punishment that Allah will give on the Day of Resurrection as a reward for their actions while living in this world. The threat addressed to them is a painful doom in return for the immoral acts that tarnish their souls. This includes people from the People of the Book who do not recognize the apostleship of the Prophet Muhammad."
		   },
		   {
			"id": 2040,
			"surah": 17,
			"ayat": 11,
			"tafsir": "Then Allah swt explained that among humans there are those who curse themselves, their offspring, even their wealth with swearing and prayers containing ugly wishes when angry, such as the prayer, \"O God! Send down anathema to me, destroy me!\" They pronounce it as when praying to Allah with a good prayer, so that he will be given health and safety will be bestowed on him, his descendants and his property. If Allah swt had granted their ugly prayer, they would not have been able to avoid the consequences. However, Allah swt did not do that. This is nothing but because of the great love of Allah. Allah swt said: And if Allah hastens evil for humans as they request to hasten good, their age will surely end. (Yunus\/10: 11) At the end of the verse, Allah SWT explains that humans have a hasty nature. If he wants something according to his heart's desire, his mind is closed to judge what he wants, whether it is beneficial for him or harmful. It is solely driven by the nature of haste to achieve its goals, without thinking it through beforehand. This shows that in general humans are interested in the outward state of something without examining more deeply the nature and secrets of that thing. In this verse there is satire against the Arab polytheists who deny the truth of the Qur'an, because they do not want to believe in the existence of the Day of Judgment. They prefer the world they can enjoy directly, rather than thinking about the promises and threats they will receive on the Day of Judgment."
		   },
		   {
			"id": 2041,
			"surah": 17,
			"ayat": 12,
			"tafsir": "Then Allah SWT explains the signs of His power in the universe, with the intention that humans think about and reflect on all of His creations in this world. Allah swt explained that He created the night and the day, each as a sign of His power. Day and night are two events that always alternate which are very useful for the benefit of human life in carrying out religious obligations and worldly affairs. Such regular changes are a very clear sign of Allah's power to man. Anyone who pays attention and thinks about the alternation of day and night is sure that this universe is regulated by very good and precise rules, and also shows that the organizers are very thorough. Thus, humans will be guided to acknowledge the existence of a Creator of this universe and all in it. In addition, the alternation of day and night is a gift that humans can experience directly in their daily lives. At night they can rest to relieve fatigue. Allah also makes the signs of the coming night, namely the disappearance of the sun's light from the western horizon, so that over time it becomes completely dark. This is a sign of His power. God makes a bright day as a sign of His power to give people the opportunity to seek the necessities of life for themselves and their families. On the other hand, the change of day and night is very useful for humans to know the number of years, months and days and their calculations, except in the north and south polar regions. In the Qur'an, Allah not only informs people about His creation, but also gives indications for using it for human welfare. In relation to the sun and moon, Allah gave very clear instructions that day and night, or in other words the circulation of the sun and moon, would be very useful to be used as a benchmark in making a calendar or calendar. The verse that clearly states the calendar is verse 36 of surahh at-Taubah\/9, which reads as follows: \"Surely the number of months with Allah is twelve months, according to Allah's decree when He created the heavens and the earth, among which there are four forbidden months. . That is the true religion.......\" Another similar verse is verse 5 of surahh Yunus\/10: \"It is He who makes the sun shine and the moon shine, and it is He who determines the places of their orbits, so that you know the number of years , and the calculation of time ............\" Day and night occur due to the rotation of the earth on its axis which moves from west to east, which gives the impression to humans as if the sun is moving from east to west. When the sun appears on the eastern horizon it is called afternoon and when the sun sets on the western horizon it is called evening. From sunset one time, until sunset the next day, it is called one day and one night according to the customs and assumptions in the calculation of the qamariah year. But in the lunar year, what is called one day and one night is the time from mid-night to the middle of the following night. By emphasizing the alternation of day and night as the basis for knowing the number of years and calculating them in the hope of Allah's priority, it is clear that this verse implies the flexibility of the Islamic calendar. A calendar system based on the alternation of days and nights is based solely on the (apparent) movement of the sun around the earth. This system does not involve the movement of the moon with respect to the earth. This is a solar calendar system (solar year) which states that one year equals 365 plus a quarter of the night and day and vice versa. Therefore, according to this system, one year has 365 days for basithah years and 366 days for leap years. In general, one Islamic year is the length of time from January 1 to December 31. The calculation is based on the time it takes the earth to go around the sun. This calendar system is identical to the AD year which is now widely used in international relations. One year in the qamariah year calculation is the length of time from the 1st of Muharram to the 30th of Zulhijjah, which is 354 days for basithah years or 355 days for leap years. This kind of calculation is called urfi reckoning. Calculation of the qamariah year is based on the circulation of the moon around the earth. From the crescent to the next crescent it is called 1 month, and if there have been 12 crescents it is considered to have even one qamariah year. This verse emphasizes that the Gregorian calendar system or the Syamsiah year may be used by Muslims in international relations, especially in carrying out transactions and business (muamalah) as usual with any community nationally. The Hijri calendar system, which is a limited lunar year, can be used to determine the times of worship, namely the timing of 1 Ramadan, 1 Shawwal and 10 Zulhijah. There is no need to force the use of this Hijri year for muamalah life in daily interactions and transactions nationally and internationally. In fact, the Christian calendar or year is also used to determine other times of worship, namely prayer times, because this prayer time is completely determined by the (apparent) movement of the sun and has absolutely nothing to do with the movement of the moon around the earth. So even though there are verses in the Qur'an which imply the use of the Hijri year (which incidentally is the qamariah year) this verse confirms Allah's commandment to use any solar year for muamalah and in general for association with other people."
		   },
		   {
			"id": 2042,
			"surah": 17,
			"ayat": 13,
			"tafsir": "Allah swt explained that each human being recorded his deeds in a notebook and remained recorded in it like a necklace that remained around their necks. These deeds include good deeds and bad deeds, big or small, which humans do on the basis of their own choices. The parable of the persistence of their notes in the book with the constant necklaces on people's necks, as an allegory that the records will be preserved, will not be lost or erased, and will always be attributed to someone. Furthermore, Allah swt emphasized that the book containing the records of human deeds will be removed from his savings on the Day of Resurrection, and will be shown to them, so that they can know its contents openly. In another verse it is explained that the task of recording human deeds is taken care of by angels. Allah swt says: And verily for you there are (angels) who watch over (your work), who are noble (with Allah) and who record (your deeds), they know what you do. (al-Infithar\/82: 10-12) The following hadith of the Prophet Muhammad explains more clearly the same thing: It was narrated from Al-Hasan that the Messenger of Allah said, \"Allah said to the Children of Adam, \"O Children of Adam! We have opened the pages of the Book, and have appointed two glorious angels as representatives: one on the right, and one on the left. As for the one on the right, his job is to record your good deeds, while the one on the left is to record your bad deeds. So do as you like, a lot or a little, until death comes to take you. And when you are dead, I fold the pages of the book and tie them around your neck and remain with you in your grave until the Day of Judgment. On that day, the book will be taken out and you will find it open. Read the book of records, surely on that day you will know that the book is sufficient as a reckoning for your deeds. (History of Ibn Jarir ath-tabari)"
		   },
		   {
			"id": 2043,
			"surah": 17,
			"ayat": 14,
			"tafsir": "This verse explains that on the Day of Judgment, humans cannot deny these records, because the recorders are angels who have been appointed by Allah, whose special job is to record human deeds. That is why Allah swt confirms at the end of the verse that it is sufficient on that day that they themselves are the reckoning for their deeds. This means that all the records contained in the book are accurate enough as evidence because what is recorded in the book is a record of their deeds. It was as if they had made the notes themselves. Allah's Word: And put the book (charity record), then you will see the sinners are afraid of what is (written) in it, and they say, \"How unfortunate we are, what book is this, there is nothing left, the small and great but everything is recorded,\" and they find (all) what they have done (written). And your Lord does not wrong anyone. (al-Kahf\/18: 49) Thus, there is no need for other evidence as reinforcement because all the scratched notes in the book are very convincing evidence, so that it cannot be added or subtracted."
		   },
		   {
			"id": 2044,
			"surah": 17,
			"ayat": 15,
			"tafsir": "In a history originating from Ibn 'Abbas it is stated that this verse was revealed regarding Walid bin Mugirah when he said to the people of Mecca, \"Reject Muhammad and I will bear your sins.\" In this verse, Allah swt emphasizes that whoever acts according to Allah's guidance and the guidance of the Prophet, namely carrying out His commands and avoiding His prohibitions, means that he has acted to save himself. He will get a record of his good deeds in his book. He will feel happy because he will get Allah's pleasure, and receive abundant rewards, namely heaven with various pleasurahble pleasures. However, whoever goes astray, namely people who deviate from the guidance of the Qur'an, will suffer losses. He will get a record of his bad deeds in the book. He will feel remorse that is useless and will be sent to hell, as a reward he deserves. Furthermore, Allah swt confirms that on that day a person who sins cannot bear the sins of others. Each person is responsible for his own bad deeds, so it is impossible for someone to be burdened with sins other than his own. They will receive a charitable reward according to the severity of the crime they have committed. If a person is tortured for misleading others, so that he is sentenced according to the sins of the person being misled, it does not mean that the person who is misleading is bearing the sins of the person being misled. However, the person who misleads is considered a sin because he misleads others. Therefore, he was punished according to his own sins, plus the sin of misleading people. Allah swt says: (Their words) cause them on the Day of Judgment to bear their own sins perfectly, and some of the sins of those they misled who do not know in the least (that they are being led astray). (an-Nahl\/16: 25) And the word of Allah: And they will surely bear their own sins, and other sins with their sins. (al-'Ankabut\/29: 13) At the end of this verse, it is stated that Allah will not punish a person or a people before sending an apostle. This means that Allah will not impose punishment on those who commit an act except after sending an apostle to read and explain the provisions of the punishment. Thus, this verse is seen as the principle of legality in Islamic crime. That is, all actions that are punishable by punishment must first be promulgated through statutory means that can guarantee that these regulations can be known by all the people. It also means that socialization of legislation is important. This verse also implies that Allah will not destroy the people because of their sins, before sending a messenger who warns them and conveys Allah's law to them, and gives threats if they disobey and persist in their disobedience. Allah swt says: Every time a group (unbelievers) are thrown into it, the guards (of hell) ask them, \"Has there never been anyone who came to warn you (in the world)?\" They replied, \"Yes, indeed, a warner has come to us, but we deny (it) and we say, \"Allah did not send down anything, you are actually in great error.\" (al-Mulk \/ 67: 8 -9) And He said: Did We not extend your life to be able to think for those who want to think, even though a warner has come to you? So feel (Our punishment), and for the wrongdoers there is no helper. Fathir\/35: 37)"
		   },
		   {
			"id": 2045,
			"surah": 17,
			"ayat": 16,
			"tafsir": "Then Allah swt explained that if He wishes to destroy a country, then Allah commands those who live in luxury in that country to obey Allah. That is, if a people has committed disobedience and crimes evenly, and deserves to be punished, then Allah SWT, because of His justice, does not immediately impose punishments before giving a warning to their leaders to stop the disobedience and crimes of their people and immediately return to obedience to Allah's teachings. However, from history we know that people who were far from Allah's guidance did not want to listen to this warning, they even became dissidents and opponents of it. Allah then destroys them from the face of the earth with various punishments, both in the form of natural disasters and other disasters. That is the inevitable provision of Allah. Allah destroyed the land completely, so that nothing was left, neither their houses nor their wealth."
		   },
		   {
			"id": 2046,
			"surah": 17,
			"ayat": 17,
			"tafsir": "Allah then tells of peoples who suffered the same fate after Noah. They were destroyed because of their disobedience to God's messengers who were assigned to stop them and invite them to return to obedience to God. This verse is an affirmation of the previous verse, that every people who remain disobedient after the arrival of the messenger who warns them, will surely suffer the same fate as the previous peoples. At the end of this verse, Allah swt mentions that such a reply is a wise and just reward, because Allah has warned and knows their actions. Allah is Seeing of the sins of His servants."
		   },
		   {
			"id": 2047,
			"surah": 17,
			"ayat": 18,
			"tafsir": "Allah swt classifies humans into two groups: those who love the life of this world, and those who love the afterlife. In this verse, Allah SWT mentions the first group, while the second group is mentioned in the next verse. When mentioning the first group, Allah SWT states that whoever wants worldly life with the pleasures that they can feel, then Allah SWT hastens their wishes in the world according to his will. But in the hereafter, they will get nothing but the punishment of hell. This statement is addressed to people who do not believe in the existence of the resurrection day and the day of judgment, so they believe that there is no life after life in this world. That is why they are too greedy for the wealth of the world and its luxuries, even though the life of this world and its pleasures are temporary. Therefore, life in the world and its luxuries are described by Allah as something that can be obtained and felt immediately, but soon it will also be destroyed and ended. Allah's Word: And let those who disbelieve think that the grace period which We have given them is better for them. Indeed, the grace period that We have given them is only so that their sins will increase; and they will have a humiliating punishment. (ali 'Imran\/3: 178) Then Allah swt threatened them with the threat of hell as a proper reward for them. In this world, they will experience deep sadness because they are separated from the luxuries of the world they love so much when death comes. Whereas in the afterlife, they will experience the most severe suffering and regret the disgraceful deeds they have done in this world."
		   },
		   {
			"id": 2048,
			"surah": 17,
			"ayat": 19,
			"tafsir": "In this verse, Allah SWT mentions the second group. Allah swt states that whoever wants the afterlife and strives towards it earnestly and remains faithful, then he is the one whose efforts will receive a good reward. What is meant by people who desire the afterlife are people who aspire to happiness in the afterlife, and try to get it by obeying Allah's guidance and avoiding the demands of their desires. Such a person during his life in the world considers that the pleasures of life in the world and its luxuries are God's blessings that must be grateful for and used as a means to worship Him. That is why at the end of this verse, Allah swt confirms that such a person will receive a reward from Allah with abundant rewards, as a reward for his good deeds and fortitude against the will of lust. He will be entered into Paradise and will remain there forever. In this verse, three conditions are mentioned that must be met in order for a person to achieve eternal happiness, namely: 1. There is a will to do an act by prioritizing the afterlife happiness above worldly interests. 2. Doing good deeds as a manifestation of his intention to get happiness in the afterlife by obeying God's commands and always drawing closer to Him. 3. Be a believer, because faith is the basis for whether deeds are accepted or not. Someone whose heart is empty of faith, will not be able to receive that eternal happiness."
		   },
		   {
			"id": 2049,
			"surah": 17,
			"ayat": 20,
			"tafsir": "Then Allah swt confirmed that the two groups will be overflowing with His mercy. That is, both groups who love worldly life, or groups who prefer the happiness of the hereafter, will be given sustenance and allowed to develop offspring. The Mercy of Allah, the Most Extensive, is not hindered by someone's disobedience to Him. Therefore, both groups can taste the delights of living in this world, according to their respective efforts. However, the two groups will not feel the same love of God. Those who prioritize the life of this world and forget about the afterlife, will enter Hell as a proper place for them. Whereas those who prioritize the afterlife and do not forget the worldly life, will enter heaven as a place full of happiness and endless enjoyment. Allah's Word: And seek (reward) the land of the hereafter with what Allah has bestowed upon you, but do not forget your share in this world. (al-Qashash\/28: 77)"
		   },
		   {
			"id": 2050,
			"surah": 17,
			"ayat": 21,
			"tafsir": "Furthermore, Allah SWT commands all humans to pay attention to the generosity He has given to these two groups. Allah swt prefers some groups over others. From each group, humans will receive a lesson, because even though each tries to seek sustenance and worldly pleasures, the results are different. God's favor given to those who prioritize the life of the world causes them to grow in denial of the One who gives that favor. On the other hand, the favors given to those who prioritize the afterlife make them even more grateful for the One who gives them these favors. Allah swt says: He raises (degrees) some of you above the others, to test you for the (gifts) He has given you. (al-An'am\/6: 165) And His words: We are the ones who determine their livelihood in the life of the world, and We have exalted some of them over some others by several degrees, so that some of them can take advantage of some of the others. (az-Zukhruf\/43: 32) From the description above, it can be seen that everyone must prioritize the afterlife because it is higher in rank and more important than worldly life. Regarding life in the afterlife, this is described in the hadith: The Prophet said, \"Indeed, people who have high degrees will see a glorious place in the hereafter, like you see stars in the sky.\" (History of al-Bukhari and Muslim from Abu Sa'id al-Khudri)"
		   },
		   {
			"id": 2051,
			"surah": 17,
			"ayat": 22,
			"tafsir": "Allah swt forbids humans to deify anything other than Allah, such as worshiping statues and the spirits of their ancestors even though with the intention of getting closer to Him. Included in what is prohibited is admitting that there are powers other than Allah that can influence him, or carrying out real actions, such as worshiping objects, or other supernatural powers that are considered gods. This prohibition is aimed at all humans so they don't go astray and regret for doing something that shouldn't have been done to their Creator. They should be grateful for the blessings Allah has bestowed upon them, not associate partners with Him because there is no helper for humans other than Allah. Allah swt said: If Allah helps you, then nothing can beat you, but if Allah allows you (not giving help), then who can help you after that? (ali 'Imran\/3: 160)"
		   },
		   {
			"id": 2052,
			"surah": 17,
			"ayat": 23,
			"tafsir": "In this verse, Allah commands all human beings, so that they pay attention to several factors related to faith. These factors are: First, so that humans do not worship gods other than Allah. Included in the notion of worshiping gods other than Allah is believing in the existence of other powers that can affect the soul and body apart from those that come from Allah. All existing objects, visible or invisible, are God's creatures. Therefore, the one who deserves the highest respect is only the One who created nature and all that is in it. It is He who gives life and enjoyment to all His creatures. So if there is a human being who worships objects or supernatural powers other than Allah, it means that he has gone astray, because all these objects are His creatures, who have no power to provide benefits and are powerless to resist harm, so they have no right to be worshiped. Second, so that people do good to their parents and their parents. The mention of this commandment after the command to worship only Allah has the intention that humans understand how important it is to do good to their parents. It also means that they are grateful for the kindness of the two mothers and fathers, how much suffering they have felt, both during childbirth and when they had difficulty in earning a living, caring for and educating children with love. So it is appropriate if doing good to both mothers and fathers is made the most important obligation among other obligations, and Allah places it in second place after the obligation of humans to worship only Him. Allah said: And worship Allah and do not associate anything with Him. And do good to both parents. (an-Nisa'\/4: 36) On the other hand, a child who is disobedient to his parents is declared a person who commits immorality, whose sin is placed second, after the sins of those who associate partners with Allah with other gods. Allah swt said: Say (Muhammad), \"Let me read what God has forbidden you. Do not associate anything with Him, and do good to your parents. (al-An'am\/6: 151) Allah commands mankind to do good to both parents for the following reasons: 1. The love and effort of the two mothers and fathers have been poured out on their children so that they become pious children and avoid going astray. that is peerless, and the efforts that do not know painstakingly are rewarded by their children by treating them well and being grateful for their good services. 2. Children are the soul mates of both mothers and fathers. 3. From infancy to adulthood, the growth and education of children is the responsibility of both parents. So children should respect and do good to their parents. In short it can be said that the most favors received by humans is the grace of God, after that the favors received from both parents. They are also the second cause of children, while Allah is the first (essential) cause. That is why Allah SWT places the obligation to do good to parents in second place after the obligation for humans to worship only Allah. After that Allah swt determined that if one of the two parents or both were old, so that they experienced physical weakness, and it was no longer possible to try to make a living, they had to live together with their children, in order to get a living and protection. It is the duty of their children to treat them with love and patience, and to respect them as gratitude for the blessings they have received from both of them. In this verse there are several provisions and manners that must be observed by children towards their parents, including: 1. A child may not say dirty and rude words even if it is only an \"ah\" word to his parents, because of their bad attitude or actions. not liked. Such a situation should be treated patiently, as was treated by his parents when caring for and educating him when he was young. 2. A child may not scold or snap at his parents, because that yelling will hurt the feelings of both of them. To rebuke both parents is to issue harsh words when the child rejects or blames their opinion, because it is not in accordance with his opinion. The prohibition on rebuking in this verse is a reinforcement of the prohibition on saying \"ah\" which is usually uttered by a child to his parents when he disagrees with their opinion. 3. Let the child speak noble words to both parents. Noble words are words that are kind and spoken with great respect, which describe polite manners and full respect for others. Therefore, if a child has a difference of opinion with his parents, he should still show a polite and respectful attitude. (24) Then Allah swt ordered the Muslims to be humble and full of love for both parents. What is meant by being humble in this verse is obeying what they order as long as the order does not conflict with religious provisions. Obedience of children to both parents is a sign of affection and respect for them, especially when both of them really need their child's help. It is emphasized that humility must be done with love, not contrived to cover up reproaches or to avoid embarrassment to others. This humble attitude should really be carried out because of the awareness that arises from the conscience. At the end of the verse, Allah swt orders Muslims to pray for their parents, so that they will be given an abundance of Allah's love as a reward for their love in educating them when they were children. There are several hadiths of the Prophet that command Muslims to serve their parents and their mothers: It was narrated from 'Abdullah bin 'Umar that a man had actually come to the Prophet asking permission to be allowed to fight with him, then the Prophet said, \"Is are your parents still alive?\" The man replied, \"Yes.\" The Prophet said, \"Then do your jihad by being devoted to your parents.\" (History of Muslim and al-Bukhari in chapter al-adab) A child is not considered to repay the services of his parents, unless he finds them in a state of slavery, then he redeems them and frees them. (Muslim and other narrations from Abu Hurairah) I asked the Messenger of Allah, \"Which deed is the most beloved to Allah and His Messenger?\" The Messenger of Allah replied, \"Perform the prayer on time.\" I asked, \"Then which charity again?\" The Prophet replied, \"Do good to both mothers and fathers.\" (Al-Bukhari and Muslim narrations from Ibn Mas'ud) In the verse interpreted above, it is not explained who should get filial piety between the two parents. However, in a hadith it is explained that serving the mother takes precedence over the father, as narrated in Sahih al-Bukhari and Muslim: It was narrated from Abu Hurairah that the Messenger of Allah was asked, \"Who is most deserving of the best treatment from me?\" The Prophet replied, \"Your mother.\" The person asked, \"Who else?\" The Prophet replied, \"Your mother.\" The person asked, \"Who else?\" The Prophet replied, \"Your mother.\" The person asked, \"Who else?\" The Prophet replied, \"Your father.\" (Al-Bukhari and Muslim) Devoted to both parents, is not enough to do while they are still alive, but continues even though both have died. The procedure is mentioned in a hadith narrated by Ibn Majah: That the Messenger of Allah was asked, \"Is there still a service for my parents, after they died?\" Rasulullah SAW replied, \"Yes, there are still four things, praying for parents to Allah, asking forgiveness for them, fulfilling their promises, and respecting their friends and connecting kinship ties with people who have no family relationship with them. you except from their side. Then this is the remaining service that you must perform, as a service to them after they die.\" (History of Ibn Majah from Abu Usaid)"
		   },
		   {
			"id": 2053,
			"surah": 17,
			"ayat": 24,
			"tafsir": "Then Allah swt ordered the Muslims to be humble and full of love for both parents. What is meant by being humble in this verse is obeying what they order as long as the order does not conflict with religious provisions. Obedience of children to both parents is a sign of affection and respect for them, especially when both of them really need their child's help. It is emphasized that humility must be done with love, not contrived to cover up reproaches or to avoid embarrassment to others. This humble attitude should really be carried out because of the awareness that arises from the conscience. At the end of the verse, Allah swt orders Muslims to pray for their parents, so that they will be given an abundance of Allah's love as a reward for their love in educating them when they were children. There are several hadiths of the Prophet that command Muslims to serve their parents and their mothers: It was narrated from 'Abdullah bin 'Umar that a man had actually come to the Prophet asking permission to be allowed to fight with him, then the Prophet said, \"Is are your parents still alive?\" The man replied, \"Yes.\" The Prophet said, \"Then do your jihad by being devoted to your parents.\" (History of Muslim and al-Bukhari in chapter al-adab) A child is not considered to repay the services of his parents, unless he finds them in a state of slavery, then he redeems them and frees them. (Muslim and other narrations from Abu Hurairah) I asked the Messenger of Allah, \"Which deed is the most beloved to Allah and His Messenger?\" The Messenger of Allah replied, \"Perform the prayer on time.\" I asked, \"Then which charity again?\" The Prophet replied, \"Do good to both mothers and fathers.\" (Al-Bukhari and Muslim narrations from Ibn Mas'ud) In the verse interpreted above, it is not explained who should get filial piety between the two parents. However, in a hadith it is explained that serving the mother takes precedence over the father, as narrated in Sahih al-Bukhari and Muslim: It was narrated from Abu Hurairah that the Messenger of Allah was asked, \"Who is most deserving of the best treatment from me?\" The Prophet replied, \"Your mother.\" The person asked, \"Who else?\" The Prophet replied, \"Your mother.\" The person asked, \"Who else?\" The Prophet replied, \"Your mother.\" The person asked, \"Who else?\" The Prophet replied, \"Your father.\" (Al-Bukhari and Muslim) Devoted to both parents, is not enough to do while they are still alive, but continues even though both have died. The procedure is mentioned in a hadith narrated by Ibn Majah: That the Messenger of Allah was asked, \"Is there still a service for my parents, after they died?\" Rasulullah SAW replied, \"Yes, there are still four things, praying for parents to Allah, asking forgiveness for them, fulfilling their promises, and respecting their friends and connecting kinship ties with people who have no family relationship with them. you except from their side. Then this is the remaining service that you must perform, as a service to them after they die.\" (History of Ibn Majah from Abu Usaid)"
		   },
		   {
			"id": 2054,
			"surah": 17,
			"ayat": 25,
			"tafsir": "Allah swt then warned the Muslims to really pay attention to the matter of filial piety to both parents and not take it as a trivial matter. It was explained that Allah knows best what moves in their hearts, whether they are truly devoted to their parents with compassion and full awareness, or is it just an outward statement, while in their hearts they are actually disobedient and disobedient. That is why, Allah promises that if they really do good, that is, truly obey Allah's requirements and are devoted to both parents and parents, then He will forgive them for actions that exceed the limits of His provisions. Allah is Forgiving to anyone who wants to repent and return to obeying His commands. In this verse there is a good promise addressed to people whose hearts are open to serve their parents. On the other hand, there are strong threats aimed at people who underestimate them, especially those who deliberately disobey their parents."
		   },
		   {
			"id": 2055,
			"surah": 17,
			"ayat": 26,
			"tafsir": "In this verse, Allah swt commands Muslims to fulfill the rights of close relatives, the poor, and those who are on their way. The rights that must be fulfilled are: strengthening bonds of brotherhood and affection, visiting their homes and being polite, and helping to alleviate the suffering they are experiencing. If there are close relatives, or poor people and people on the way who need expenses for their living needs, then they should be given sufficient assistance to meet their needs. People who are on a journey whose suffering should be alleviated are people who travel for purposes justified by religion. People in such circumstances need to be assisted and assisted in order to achieve their goals. At the end of the verse, Allah SWT forbids Muslims to be extravagant, namely spending wealth without careful calculation so that it becomes redundant. This prohibition is intended for Muslims to regulate their expenses with the most careful calculations, so that what is spent is in accordance with their needs and income. Muslims are also not allowed to give away wealth to people who are not entitled to receive it, or give more wealth than it should. Further information about how Muslims should spend their wealth is mentioned in the word of Allah SWT: And (including the servants of God the Most Merciful) those who, when spending (wealth), are not extravagant, and are not (also) stingy, among both reasonable. (al-Furqan\/25: 67) As for the information explaining the meaning contained in the verse about the prohibition of extravagance which means wasteful, it can be seen in the hadiths of the Prophet as follows: It was narrated from Abdullah bin Umar, he said, \"The Messenger of Allah met Saad at the time of ablution, then the Messenger of Allah said, \"How wasteful is your ablution, O Saad!\" Saad said, \"Is there any waste in ablution?\" The Messenger of Allah said, \"Yes, even though you are in a flowing river.\" (Ibn Majah's History) Anas bin Malik that he said, \"There came a man from Bani Tamim to the Messenger of Allah and said, \"O Messenger of Allah! I am a wealthy person, many families, children and guests who are always present, so explain to me how I should spend treasure, and how should I do.\" So the Messenger of Allah said, \"If you have wealth, pay zakat out of your wealth, because zakat is actually a purification that purifies you, maintain friendship with your relatives, and you should know about the rights of people who ask for help, neighbors and the poor. Then the man said, \"O Messenger of Allah! Can you reduce this obligation to me?\" The Messenger of Allah recited the verse: And give dues to close relatives, also to the poor and people on the way; and do not squander (your wealth) extravagantly. Then the man said, \"That is enough for me O Messenger of Allah, when I have paid zakat to your amil zakat, then I have been free from the obligation of zakat that must be paid to Allah and His Messenger,\" then the Messenger of Allah said, \"Yes, if you have paid zakat to my amil, you are free from that obligation and you will receive the reward, and the person who replaces it with another will sin.\" (Ahmad's history)"
		   },
		   {
			"id": 2056,
			"surah": 17,
			"ayat": 27,
			"tafsir": "Then Allah swt declared that the spenders were the brothers of satan. This expression is commonly used by Arabs. People who habitually follow the rules of a people or follow in their footsteps are called brothers of that people. So those who squander their wealth mean those who follow the footsteps of satan. Whereas what is meant by wasters in this verse are people who squander their property in immoral acts which are certainly outside the commandments of Allah. Such people are called Satan's friends. In this world they are tempted by Satan, and in the hereafter they will be put into Hell. Allah swt says: And whoever turns away from the teachings of Allah, the Most Merciful (Al-Qur'an), We let Satan (mislead him) and become his close friend. (az-Zukhruf\/43: 36) And the word of Allah swt: (Commanded to the angels), \"Gather the wrongdoers and their colleagues and what they used to worship. (ash-shaffat\/37: 22) At the end of the verse , explained that the devil is very disobedient to his Lord, that is to say, he is very disobedient to God's favors given to him, and does not want to be grateful. In fact, demons are disobedient, do not want to obey God's commands, and tempt people to commit immorality. Al-Karkhi explains the condition of people who are given glory and abundant wealth. If that person takes advantage of that wealth and glory beyond the limits that are pleasing to Allah, then he has denied Allah's favor. A person who acts like that, both in nature and in his actions, can be equated with the actions of Satan. This verse was revealed by Allah in in order to explain the deeds of the Ignorant people. It was the custom of the Arabs to accumulate the wealth they obtained from the spoils of war, robbery and robbery. Har then they use it to splurge in order to get fame. The Quraysh polytheists also used their wealth to hinder the spread of Islam, weaken its adherents, and help the enemies of Islam. The verse goes down to reveal how bad their business is."
		   },
		   {
			"id": 2057,
			"surah": 17,
			"ayat": 28,
			"tafsir": "In this verse, it is explained how to be kind towards people who really need help, while the person who is asked for help does not have the ability to help. If this happens to someone, then let him tell that person with polite and gentle words. If he has the ability at another time, then let him make promises that can be implemented and satisfy their hearts."
		   },
		   {
			"id": 2058,
			"surah": 17,
			"ayat": 29,
			"tafsir": "Furthermore, in this verse, Allah SWT explains good ways to spend wealth. Allah explains the condition of people who are miserly and spendthrift by using the expression do not make your hands shackled around your neck, but also do not stretch them too much. These two expressions are commonly used by Arabs. The first means the prohibition of being miserly or miserly, so that you are reluctant to give wealth to other people, even if it's a little. The second expression means to prohibit people from being extravagant in spending wealth, so that it exceeds what they have. The habit of wasting wealth will result in a person not having savings or savings that can be used when needed. From this verse it can be understood that a good way to spend wealth is in a way that is frugal, proper and reasonable, not too stingy and not too extravagant. Too miserly will make someone disgraceful, while being too extravagant will result in bankruptcy or bankruptcy. The information obtained from the traditions of the Prophet can be put forward as follows: Imam Ahmad and other experts on hadith narrated from Ibn 'Abbas that the Messenger of Allah said: The person who is thrifty will not become poor. This hadith explains the importance of being frugal, so the Prophet said that people who are always thrifty will not become a burden to others or become poor. Imam al-Baihaqi narrated a hadith from Ibn 'Abbas that the Messenger of Allah said: Be frugal in spending wealth, half of life."
		   },
		   {
			"id": 2059,
			"surah": 17,
			"ayat": 30,
			"tafsir": "Then Allah swt explained that it is He who expands sustenance to whom He wills, and He also limits it. Everything goes according to the provisions that Allah has set for His servants in the search for wealth and how to develop it. This is closely related to tools and knowledge about processing the treasure. This is Allah's provision which is general in nature and applies to all of His servants. However, only Allah determines according to His will. At the end of this verse, Allah swt confirms that He is All-Knowing of His servants, which of them use wealth for benefit and who uses it for harm. He also knows which of His servants are in poverty who remain patient and trust Allah, and who because of poverty, become hopeless people, and are far from Allah's mercy. Allah is All-Seeing of how they manage and manage their property, whether they spend the wealth that God has given them lavishly or miserly. Therefore, Muslims should stick to the provisions of Allah, by obeying all His commands and avoiding His prohibitions. In spending assets should be reasonable. It is included in the sunnah of Allah."
		   },
		   {
			"id": 2060,
			"surah": 17,
			"ayat": 31,
			"tafsir": "Then Allah swt forbade the Muslims to kill their children, as was done by some tribes from the Arab Jahiliah nation. They bury their daughters because they are considered unable to earn sustenance, and only become a burden in life. In contrast to boys who are considered to have the ability to find wealth, fight, and maintain family honor. Girls are seen as only bringing shame because they can cause poverty and degrade the family's dignity by marrying someone who is not their equal. Especially in war, girls would certainly become prisoners, so it was not impossible that they would suffer the humiliating fate of being slaves. Therefore, Allah swt forbids Muslims to imitate these Jahiliah habits, by giving the reason that sustenance is in His power. He is the one who provides sustenance for them. If He has the power to give sustenance to boys, then He also has the power to give it to girls. Allah stated that fear of poverty was not a reason to kill their daughters. At the end of this verse, Allah swt confirms that killing children is a big sin, because it hinders the purpose of human life. Not allowing the child to live means severing offspring, which also means wiping out human life itself from the face of the earth. The following hadith of the Prophet saw illustrates how great the sin of killing a child is: It was narrated from 'Abdullah bin Mas'ud that he asked, \"O Messenger of Allah, which is the greatest sin? The Messenger of Allah replied, \"If you make partners for Allah, even though Allah created you .\" I asked again, \"Then which other sin?\" Rasulullah SAW answered him, \"If you kill your child because you are afraid that the child will eat with you.\" I asked again, \"Then which other sin?\" Rasulullah SAW replied, \"You committed adultery with your neighbour's wife.\" (Al-Bukhari and Muslim) In addition, it can be said that the act of killing a child out of fear of starvation is a form of prejudice against Allah. , because it leads to efforts to destroy the continuity of human existence in the world. Apart from exposing the evil habits of the Arabs in i during the Jahiliyyah, this verse also reveals their very curmudgeonly character."
		   },
		   {
			"id": 2061,
			"surah": 17,
			"ayat": 32,
			"tafsir": "In this verse, Allah SWT prohibits His servants from approaching adultery. The intention is to commit acts that lead to adultery, such as promiscuity without control between men and women, reading stimulating literature, watching soap operas and films that indulge in female sensuality, and the spread of pornography and pornography. All of that really is a conducive situation for the occurrence of adultery. The prohibition of committing adultery is expressed by a prohibition against approaching adultery to give a firm impression, that if even approaching adultery is prohibited, what else is there to do. With disclosure like this, someone will be able to understand that the prohibition of committing adultery is a strict prohibition, so it really must be avoided. What is meant by an act of adultery is sexual intercourse committed by a man and a woman outside of marriage, whether the man or woman has had legal sexual relations or not, and not because of any mistake. Furthermore, Allah gives reasons why adultery is prohibited. The reason mentioned at the end of this verse is because adultery is truly an abominable act that results in a lot of damage, including: 1. Damage to the lineage, which causes a person to doubt the lineage of his child, whether the child born is his descendant or the result of adultery. The husband's allegation that his wife had committed adultery with another man resulted in various difficulties, such as divorce and difficulties in the child's education and legal status. Such a situation causes disruption to the growth of the child's soul and destroys the social order. 2. Causing shock and anxiety in society, because honor is not maintained. How many killings have occurred in society because members of that community have committed adultery. 3. Damaging the peace of married life. The good name of a woman or man who has committed adultery will be tarnished in society. The serenity of married life will never materialize, and the loving relationship between husband and wife will be damaged. 4. Destroying the household. The wife is not solely as a gratification of lust, but as a life partner in the household and fostering household welfare. Therefore, if the husband is responsible for meeting household needs, then the wife is responsible for maintaining it, both property and children and the orderliness of the household. So if the wife or husband is tarnished by adultery, the destruction of the household is difficult to avoid. 5. The spread of adultery in society has led to the development of various venereal diseases such as syphilis (lion king). In addition, it also increases the spread of AIDS or diseases that destroy the sufferer's immune system, so that he will die slowly. In short, it can be stated that the act of adultery is a very heinous act, which causes the destruction of lineage, creates shock and anxiety in society, destroys the peace of married life, destroys the household itself, and demeans human dignity. If the act is allowed to run rampant in the midst of society, it means that humans are on the same level as animals. This verse contains a prohibition on committing adultery and hints at the extravagant behavior of the Arab Jahiliyyah. Adultery is a cause of waste."
		   },
		   {
			"id": 2062,
			"surah": 17,
			"ayat": 33,
			"tafsir": "In this verse, Allah forbids His servant from killing a soul that Allah has forbidden. The meaning of \"killing souls\" is to take human lives. Meanwhile, what is meant by \"those whom Allah has forbidden to kill\" is killing for reasons that are not legal or that are not justified by religion. As for the reasons why Allah SWT forbids His servants to take human lives for reasons that are not justified, they are: 1. Murder causes damage. Islam prohibits any action that causes damage. The prohibition applies generally to all kinds of actions that cause damage, so even killing includes prohibited actions. Allah swt said:  do not do damage on earth after (created) well. (al-A'raf\/7: 85) 2. Murder endangers other people. The main provision in religion is that all actions that cause harm to oneself and others are prohibited. Allah swt said: that whoever kills someone, not because that person killed another person, or not because he did damage to the earth, it is as if he has killed all humans. (al-Ma'idah\/5: 32) The Messenger of Allah said: The loss of the world for Allah is of lesser value than killing a Muslim. (History of at-Tirmidhi from 'Abdullah bin 'Umar) 3. Disturbing the security of the community which leads to the destruction of the community itself. Because if killing is allowed, it is not impossible that there will be acts of mutual killing between humans, which in the end the humans will perish. And whoever kills a believer on purpose, then the reward will be hell, he will abide therein forever. Allah was angry with him, and cursed him and prepared a great punishment for him. (an-Nisa'\/4: 93) In this verse Allah swt provides an exception who may be killed through His word, \"except for a reason that is justified by religion.\" Among them are men or women who commit adultery after being bound by a legal marriage contract and people who intentionally kill a believer who is protected by law. Exceptions as mentioned above, mentioned in the hadith of the Prophet: It is not lawful for the blood of a person who has uttered two sentences of creed, except for one of three cases: a person killed because he killed, a widow or widower who commits adultery, and a person who abandons his religion separates himself from the Muslims. (Narrated by al-Bukhari and Muslim from 'Abdullah) Then Allah swt explained what action must be taken by the heir of the murdered person, and who should carry out this action if by chance the murdered person has no heirs. Allah swt stipulates that whoever is killed unjustly, i.e. without good reason, Allah has given authority or rights to his heirs to determine the choice of punishment for the killer, namely between qishash law or receiving diyat (ransom), as has been stipulated in His words: O you who believe! It is obligatory upon you (to carry out) qisas regarding the person who was killed. (al-Baqarah\/2: 178). (see further tafsir of this verse in volume I). And the words of the Prophet Muhammad during the conquest of Mecca: Whoever kills, the family of the murdered is given the right to choose between two things, if they want, they can demand the death penalty, and if they want, they can demand a diyat (ransom). (History of Abu Dawud and an-Nasa'i from Abu Syuraih al-Khuza'i) Then if by chance the person killed has no heirs, then the one who acts in his place in determining the choice of punishment is the ruler. In this case the ruler may delegate his powers to the local qadhi (judges), if deemed necessary. In carrying out qishash, the rulers who were authorized to carry it out were ordered not to exceed the specified limits, as had happened in the Jahiliyya era. People in the Age of Jahiliyyah were not satisfied with simply avenging the death of the person who killed them, but also demanded the death of other people, if the person killed was from among the nobility. If the person killed was an aristocrat, while the person who killed was from among the common people, then the death demanded from the nobility would also serve as a substitute for the killer himself. In verse 178 of surahh al-Baqarah there is a strong indication that the most important punishment for the family of the murdered person is simply to demand diyat or pardon, not to seek revenge for death. At the end of the verse, Allah SWT explains that heirs or rulers in carrying out kisas punishment may not exceed their limits because they receive Allah's help, in the form of retribution to choose kisas punishment or diyat punishment. Therefore, judges should be guided by these provisions in deciding cases. Do not decide matters that are contrary to God's rules or exceed the applicable provisions. This verse is classified as a Makkiyah verse and is included in the first verse of the law that was revealed. Thus, it is natural that this verse only regulates the law for murder in general. The detailed information is regulated in other verses, the tafsir of which has been presented in volume I."
		   },
		   {
			"id": 2063,
			"surah": 17,
			"ayat": 34,
			"tafsir": "Then Allah SWT forbade His servants to approach the orphan's property, except in a good way. Approaching the orphan's property means using the orphan's property in the wrong place or not providing protection for the property, so that it is wasted. Allah swt provides protection for orphans' assets because they really need it, while he has not been able to take care of his wealth, and has not been able to make a living for himself. However, Allah swt provides an exception, namely if it costs money to maintain the property, or with the intention of developing it, then it is permissible for the person who takes care of the orphan to take some of it in a reasonable way. Therefore, it is necessary to have someone who is responsible for taking care of the orphan's property. The person in charge of carrying it out is called a washiy (custodian) and an agency or institution that takes care of the orphan's assets is also needed. These agencies or institutions should be supervised by the government for their activities, so that there is no misuse or diversion of the orphan's assets. Then in this verse it is explained that if the orphan is an adult and has the ability to manage and develop his property, it means that it is time for the property to be handed back by the guardian to him. After the verse was revealed, the companions of the Prophet who cared for the orphans were afraid, so they did not want to eat or associate with them. Therefore, Allah revealed this verse: And if you associate with them, then they are your brothers. Allah knows those who do evil and those who do good. (al-Baqarah\/2: 220) From this verse it is clear that it is forbidden to spend the assets of orphans when used for personal gain. However, if it is spent for the maintenance of the property itself, or for the needs of orphans, and the guardian is truly a person who cannot afford it, then this is not prohibited. Allah swt said: And do not eat it (the orphan's wealth) beyond the limits of decency and (do not be) in a hurry (hand it over) before they grow up. Whoever (among the caregivers) is able, then let him refrain (from eating the orphan's wealth) and whoever is poor, then he may eat the treasure according to the proper way. (an-Nisa'\/4: 6) Allah swt commands His servants to fulfill promises, both promises to Allah and promises made to fellow human beings, namely buying and selling contracts and leasing contracts which are included in the field of muamalah. Az-Zajjaj explained that all of Allah's commands and His prohibitions are promises of Allah that must be fulfilled, including promises that must be made to their Lord, and promises made between servants and servants. What is meant by fulfilling a promise is carrying out what has been stipulated in the agreement, by not deviating from the provisions of the applicable religion and law. At the end of the verse, Allah swt confirms that in fact the promise must be accounted for. People who betray their promises, or cancel their promises unilaterally will receive appropriate retribution."
		   },
		   {
			"id": 2064,
			"surah": 17,
			"ayat": 35,
			"tafsir": "Furthermore, Allah ordered the Muslims to perfect the measure when measuring merchandise. The point is that when measuring goods it should be done as accurately and as carefully as possible. Therefore, someone who measures merchandise that will be handed over to someone else after being sold may not reduce the measure because it harms other people. Likewise, if someone measures other people's merchandise that he will receive after purchase, it should not be exaggerated, because it will also harm other people. Allah swt also ordered them to weigh goods with the correct balance (scales) and in accordance with established standards. A correct balance is a balance that is prepared as accurately as possible, so that it can give confidence to the person making the sale and purchase, and does not allow fraudulent additions and subtractions. Allah swt threatens those who reduce these measures and weights with harsh threats. Allah swt said: Woe to those who cheat (in measuring and weighing)! (That is) people who when they receive a measure from other people they ask for it to be fulfilled, and when they measure or weigh it (for other people), they reduce it. (al-Muthaffifin\/83: 1-3) At the end of the verse, Allah SWT explains that measuring or weighing goods carefully will have better consequences for them because in this world they gain the trust of members of the community, and in the hereafter they will receive a reward from Allah and His good pleasure, and avoid the fire of hell."
		   },
		   {
			"id": 2065,
			"surah": 17,
			"ayat": 36,
			"tafsir": "Allah swt forbids Muslims to follow words or deeds whose truth is not known. This prohibition covers all human activities themselves, both words and deeds. To get further information about the contents of this verse, the following are put forward by various opinions from friends and tabiin: 1. Ibn 'Abbas said, \"Do not testify, except what you have seen with your eyes, what you hear with your ears. , and what the heart knows with full awareness.\" 2. Qatadah said, \"Do not say, \"I have heard,\" when you have not heard, and do not say, \"I have seen,\" when you have not seen, and do not say, \"I have known,\" when you have not know.\" 3. Another opinion says that what is meant by the prohibition of saying something that one does not know is saying that is only based on prejudice and conjecture, not true knowledge, as stated in the word of Allah: O you who believe! Stay away from prejudice, in fact some prejudice is a sin. (al-Hujurat\/49: 12) And as mentioned in the hadith: Stay away from prejudice, in fact prejudice is the most lying statement. (History of Muslim, Ahmad, and at-Tirmizi from Abu Hurairah) 4. There are also those who think that what is meant is a prohibition against polytheists following the beliefs of their ancestors, with blind obedience and following the desires of lust. Among them is following the beliefs of their ancestors in worshiping idols, and giving these idols various names, as stated in the word of Allah: These are nothing but names that you and your ancestors invented. (an-Najm\/53: 23) Allah swt then said that actually hearing, sight, and the heart will be asked, whether what someone says is in accordance with what the voice of his heart hears. If what is said is in accordance with what is heard, seen, and the voice of his heart, he is safe from the threat of the fire of hell, and will receive a reward and the pleasure of Allah. But if it doesn't fit, he will certainly be herded into the fires of hell. Allah swt said: On the day, (when) their tongues, hands and feet bear witness against them for what they used to do. (an-Nur\/24: 24) And the hadith narrated by Syakal bin Humaid, he said: I visited the Prophet, then I said, \"O Prophet, teach me a prayer for protection that I will read to seek protection from Allah. So The Prophet held my hand and said, \"Say, \"I seek refuge in You (O Allah) from the evil of my ears, the evil of my eyes, the evil of my heart, and the evil of my manic (adultery).\" (Muslim history)"
		   },
		   {
			"id": 2066,
			"surah": 17,
			"ayat": 37,
			"tafsir": "Allah forbids the Muslims to walk on the face of the earth arrogantly. Walking arrogantly on the face of the earth is not a natural attitude, because no matter how hard the footsteps are stamped on the earth, it will not penetrate its surface and no matter how high it raises its head, it cannot exceed the height of the mountain. Even from the point of view of psychology, a person who usually walks with pride means that there is a weakness in his soul. He feels inferior, so to cover up his weakness, he walks arrogantly and shows off with the intention of attracting the attention of others. Allah swt confirms that they will never be able to penetrate the earth and match the height of a mountain. This is intended so that Muslims are aware of the weaknesses that are in themselves, to be humble, and not to be arrogant. Because, as humans who have limited abilities, they will not be able to achieve anything beyond their abilities. In this verse there is also reproach for the polytheists who like to boast, boast about their wealth and squander it, like to get drunk, and commit adultery."
		   },
		   {
			"id": 2067,
			"surah": 17,
			"ayat": 38,
			"tafsir": "Then Allah swt explained that all of His prohibitions mentioned before this verse, such as holding gods other than Allah, being disobedient to both parents and parents, being extravagant, killing girls, committing adultery, killing humans who are forbidden to kill them, consuming the property of orphans, reducing or exaggerating measures and weights, indulging in words and deeds whose truth is unknown, and being arrogant are actions that He really hates. The perpetrators deserve to be punished with harsh punishment and must be felt in the world. In the afterlife they will get a painful punishment."
		   },
		   {
			"id": 2068,
			"surah": 17,
			"ayat": 39,
			"tafsir": "In this verse it is explained that Allah's guidance is in the form of His commands that must be followed, and all the prohibitions that must be avoided, which are mentioned in the previous verses, when obeyed will undoubtedly lead people to prosperity in this world and happiness in the hereafter. Because, all of that is part of the wisdom revealed by Allah to His Messenger, in the form of religious regulations. Furthermore, Allah swt repeated the prohibition of holding gods other than Allah. The repetition of the prohibition against associating other gods with Allah, which means the commandment to believe in monotheism, shows the understanding that monotheism is the essence of all divine religions, and is the starting point and ultimate goal of all kinds of affairs for all creatures. All creatures belong to Allah and to Him everything will return. At the end of the verse, Allah swt emphasizes that the consequence that will be felt by the polytheists is that they are thrown into hell in a disgraceful condition, whether the reproach comes from another party, or comes from themselves, and is kept away from Allah's mercy. They will get no help from anyone."
		   },
		   {
			"id": 2069,
			"surah": 17,
			"ayat": 40,
			"tafsir": "Allah swt refuted the opinion of the polytheists of Mecca that angels are daughters of Allah, by asking whether your Lord should choose sons for you, while He Himself takes daughters among the angels. This question implies a denial of their assumption that Allah swt has daughters who are angels. Allah's rebuttal, in this verse, by showing the error of their way of thinking, aims so that they can understand their mistake. How is it possible that Allah SWT, who created the heavens and the earth and the things that are between them, is said to have daughters who are angels, while they themselves prefer to have sons and hate daughters. They even buried the daughter alive. In this case, they attribute to Allah a quality that they themselves do not like. Their way of thinking is completely messed up. They attribute the Supreme One and Noble Substance to a lowly nature in their own eyes. Such an assumption results in three kinds of errors. 1. They think that the angels are daughters. 2. They assume that angels are daughters of God. 3. They worshiped the angels. Allah swt said: So ask (Muhammad) to them (the disbelievers of Mecca), \"Are the daughters for your Lord while they are for the sons?\" Or did We create angels in the form of women while they witnessed (it)? Remember, among their lies they actually said, \"God had a son.\" And really, they are total liars. (ash-shaffat\/37: 149-152) Allah swt confirms that by saying that, the polytheists have said a big sin. They have fabricated lies against God, and are therefore threatened with painful punishments. They have also wasted their own minds, because they distort the truth that they should uphold. And they said, \"(Allah) the Most Gracious begot a son.\" Verily, you have brought something very unlawful, almost to the point that the heavens were split open, and the earth was split open, and the mountains fell, (because of that saying), because they thought (Allah) the Most Compassionate had a child. And it is impossible for (Allah) the Most Merciful to have children. (Maryam\/19: 88-92) (See also al-Baqarah\/2: 116)"
		   },
		   {
			"id": 2070,
			"surah": 17,
			"ayat": 41,
			"tafsir": "In this verse it is explained that in the Qur'an, Allah has given warnings many times, whether in the form of proofs of the truth of Allah's existence through His creations, or reasons that show the truth of monotheism, the Qur'an also contains several stories about the fate of people who associate partners with Allah with others, so that the polytheists of Mecca can take lessons from these events and stop their polytheism and bad habits. Supposedly the repeated explanations and warnings can soften their hearts and awaken their minds, so they want to follow the call of the Qur'an. However, these explanations only made them run away from the Qur'an. They don't want to listen and accept the truth because their souls have been polluted by bad habits. they can no longer judge a truth as truth, they even stay away from it and prefer to wallow in evil."
		   },
		   {
			"id": 2071,
			"surah": 17,
			"ayat": 42,
			"tafsir": "Then Allah swt denied the beliefs of the polytheists of Mecca by ordering His Messenger to tell them that if there were gods other than Him, surely the gods they partnered with would find a way to convey what they wanted to Allah who has the Throne, whose dominion covers the heavens, the earth, and other things. Of course, the gods they associate with beg first and submit themselves to Him. So the way they ask Allah through the gods has taken a tortuous path. Why don't they immediately worship and pray to Allah Almighty. This verse contains allusions to the polytheists of Mecca so that they worship only Allah, the One and Only God, and prohibits them from inventing another god as an intermediary who can convey their wishes to the One, Supreme Being. Allah does not like the existence of intermediaries as they believe, even Allah has forbidden humans to make intermediaries like that through the revelations that have been conveyed by His apostles."
		   },
		   {
			"id": 2072,
			"surah": 17,
			"ayat": 43,
			"tafsir": "Furthermore, Allah swt declared His majesty from the nature that was invented by the polytheists of Mecca. Allah swt confirms that He is the Most Holy and Most High of all the attributes that they invent. What they say is only based on guesswork and assumptions. He is the One and Only God who depends on Him for everything. He neither begotten nor begotten. Nothing is equal to Him. In this verse there is a sign that shows that Allah SWT is perfect, both His substance and His attributes, and is Most Holy from the nature of deficiencies, in the true sense."
		   },
		   {
			"id": 2073,
			"surah": 17,
			"ayat": 44,
			"tafsir": "Then Allah swt explained how vast His kingdom was and how high His power was. The seven heavens, the earth, and all the creatures in it glorify and glorify His name, and witness the proofs of His oneness. There is not a single creature but glorifies by praising Him. Anyone who wants to pay attention to the creatures or objects around him will certainly know that both living things and inanimate objects are entirely subject to and subject to Allah's decrees or provisions which cannot be avoided. An example is the law of attraction (gravity). This law applies in general and affects all existing objects, whether they are gases, liquids, solids, or living things. Everything is affected by the law of attraction. This shows that the law of attraction which has such great power and influence cannot just happen by chance, but rather someone creates and controls it all the time. The Creator is certainly the Almighty and Almighty, namely Allah swt. This law of attraction is enough proof that all objects and creatures that exist on this earth are subject to and subject to the laws and provisions of Allah. If someone wants to escape from the influence of the gravitational force (gravity) of the earth, he must use science that can free him from this attraction. In order to master that knowledge, he must master the law of action and reaction, that is, action that can overcome the gravitational force of the earth, so that he can escape the influence of its force. The success of a person in escaping from the force of gravity does not mean that he is not subject to God's law, but that he can free himself because he is subject to other laws of nature. This shows how extensive the power of Allah who creates the laws of nature. Even then, only the natural laws that humans already know, not to mention other natural laws that humans still don't know. Especially for humans, intelligent beings, because they consist of body and spirit, their bodies are subject to these natural laws, whether they want it or not. While spiritually required to follow God's guidance conveyed through revelation to His apostles. The scholars of theology say that Allah, the Creator of nature, is a person who is obligated to exist, while creatures are called mumkinat al-wuja (which may exist). Al-Mumkinat is divided into intelligent and non-reasoning. Intellectual beings recognize the oneness of Allah because they can observe the signs of Allah's power in the heavens, on the earth, and in all the things that exist in both. Therefore, the lips of a believer human always glorify Allah. While creatures that have no mind submit to akam kauniyyah (ie the natural laws created by Allah that apply to natural objects). They glorify Allah by behaving according to the circumstances destined for each of them. Allah then explained that the Meccan polytheists did not know that natural objects and all existing creatures glorified Him, because they did not want to acknowledge the oneness of Allah. In fact, they created other gods associated with Allah. The polytheists do not want to see and think about the submission of the universe and all objects and creatures on earth to these natural laws, as a reflection of their tasbih praising Allah SWT. Looking at several surahhs of the Qur'an (al-Baqarah\/2: 29; al-An'am\/6: 125), the sky is divided into seven layers. If we scientifically assume that the word \"sky\" here is the atmosphere, the sky that is closest to the earth, and not the outer sky, then the science that humans have today confirms it. The division into seven layers is based on differences in chemical content and different air temperatures in each layer. The seven layers are called Troposphere, Stratosphere, Mesosphere, Thermosphere, Exosphere, Ionosphere and Magnetosphere. The mention of the seven layers of heaven is also revealed in surahh Nuh\/71: 15 and al-Naba'\/78: 12. Furthermore, in surahh Fushshilat\/41: 11-12 it is stated that each layer of heaven has its own affairs. Science has confirmed this, for example, there is a layer whose job is to make rain, prevent radiation damage, reflect radio waves, up to a layer that prevents meteors from damaging the earth. This verse symbolically shows that the tasbih of objects in nature physically is their (voluntary) obedience to Allah's law that governs them or also known as sunatullah. God's law is known to humans as natural law or scientific rules that are known to humans (experts) and apply to all creatures including humans (physically). What is meant by \"all of you do not understand their tasbih\" is that the majority of people do not understand sunatullah or natural laws which are understood only by experts. So only people who are intelligent and knowledgeable can understand the laws of nature and thus can also understand the tasbih of the objects between the seven heavens and all the earth. At the end of the verse, Allah swt confirms that He is indeed Most Forbearing. Therefore, He did not immediately pass down the punishment on the polytheists of the polytheists of Mecca and for their negligence they did not want to pay attention to the signs of the power of Allah, the Most Forgiving. Among the characteristics of Allah's forgiving nature is that he still opens the door of repentance as wide as possible to anyone who asks for His forgiveness. Allah will not punish them for the sins they have committed, if they repent and regret their actions with true regret, truly stop polytheism, return to the religion of monotheism, and follow the guidance of the revelations revealed to His messengers."
		   },
		   {
			"id": 2074,
			"surah": 17,
			"ayat": 45,
			"tafsir": "Allah swt explained that when the Messenger of Allah recited the Qur'an to the polytheists with the intention of opening their hearts to accept the truth contained therein, then Allah swt created an invisible wall that covered between the Prophet and the polytheists who did not believe in the day hereafter. The wall that covers and is not visible is something that prevents the hearts of the polytheists from understanding the contents of the Qur'an, so that they cannot take advantage of the instructions contained in it. This is as a result of their denial of the Day of Resurrection and the Day of Judgment, as well as the result of the taints of polytheism that have covered their souls."
		   },
		   {
			"id": 2075,
			"surah": 17,
			"ayat": 46,
			"tafsir": "Furthermore, Allah swt explained that when the Prophet recited the Qur'an, Allah put a lid over the hearts of the polytheists, so that their hearts could not understand the Qur'an, and put plugs in their ears, so they could not hear it. If in verse 45 above, Allah mentions the reasons that prevent them from understanding the Qur'an that come from outside, in this verse Allah mentions the reasons that come from within or are found in themselves. They have suffered severe mental damage, so they can no longer control their souls. Therefore, they are hindered from understanding the verses of the Qur'an that really call for attention and concentration. This mental damage is due to their habit of following in the footsteps of their ancestors, even though what they are following is not true. They themselves admit their mental damage, as mentioned in the word of Allah in another verse: And they said, \"Our hearts are closed from what you call us to him and our ears are blocked, and between us and you there is a wall, therefore do (according to your will), verily we will do (according to our will).\" (Fushshilat\/41: 5). them, they turned their backs, and shunned it in a haughty and arrogant manner. They felt offended because the Prophet only mentioned the name of Allah the Almighty and did not mention the names of their idols in the Qur'an they read. They really hate the Prophet which is not only visible in their words and attitudes, but is followed by acts of torture against the Muslims. They also hindered the activities of spreading Islamic da'wah among the people of Mecca and its surroundings."
		   },
		   {
			"id": 2076,
			"surah": 17,
			"ayat": 47,
			"tafsir": "Allah swt explained to His Messenger that He was the one who knew their attitude when listening to Rasulullah recite the Al-Qur'an. They mocked and belittled him. Allah knows when they whispered to each other saying, \"Muhammad is a madman.\" Some say, \"He is a soothsayer,\" and some say, \"Muhammad is none other than a person who is bewitched because his mind changes and is no longer consistent, do we deserve to follow a madman like Muhammad?\" The word of Allah swt: And indeed, those disbelievers almost derail you with their eyes, when they hear the Qur'an and they say, \"He (Muhammad) is really a madman.\" (al-Qalam\/68: 51)"
		   },
		   {
			"id": 2077,
			"surah": 17,
			"ayat": 48,
			"tafsir": "Allah swt then ordered the Messenger of Allah to pay attention to how the polytheists made parables for him, such as saying that he was crazy, a poet, was enchanted, and so on. Thus, they have become astray, and will not be guided because they have deviated from the right path. The various parables that they gave to the Prophet Muhammad when listening to him recite the Al-Qur'an, were statements that were born from their mental attitude towards the revelations that Allah sent down to His Messenger. They actually did not want to admit the truth of the revelations read by the Prophet, because they brought statements that contradicted the beliefs that were blindly inherited from their ancestors. Therefore, they can no longer be expected to receive guidance and guidance from revelation, because their hearts have been covered with the stains of extreme polytheism."
		   },
		   {
			"id": 2078,
			"surah": 17,
			"ayat": 49,
			"tafsir": "Allah swt explained to His Messenger what was said by the polytheists of Mecca about the day of resurrection. They said that when they died and became rotten and incomplete bones, was it true that they would be resurrected like their original creatures. From their words it appears that they do not want to believe in the resurrection day. According to their belief, when humans have died and become scattered bones, moreover they have been shattered, it is impossible for them to reassemble and become living creatures as before. This is the main reason why they reject the truth of Muhammad's revelation and apostleship. Their denial of the Day of Resurrection is caused by their attitude which equates something that is beyond the capacity of their minds with events that are commonly experienced on a daily basis. Whereas the power to resurrect all creatures is in the hands of Allah who originally created them. All that is beyond the capacity of their minds or reason. If they would pay attention to the signs of Allah's power in the heavens, on the earth, and in all the things around them, they would certainly justify the events of the day of resurrection. Allah swt said: (Unbelievers) said, \"Are we really going to be returned to our original life? Will (will also be resurrected) when we have become broken bones?\" They said, \"Then it is a loss return.\" (an-Nazi'at\/79: 10-12) And he made a parable for Us and forgot the origin of what happened; he said, \"Who can give life to the bones, which are shattered?\" Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 78-79)"
		   },
		   {
			"id": 2079,
			"surah": 17,
			"ayat": 50,
			"tafsir": "Allah swt ordered His Messenger to give an answer and explain to the polytheists of Mecca that Allah has the power to resurrect them after they died as they were when they were first created, regardless of their condition, whether it is in the form of bones, carcasses, stones, iron, or anything according to their understanding. Allah swt ordered His Messenger to say to them, \"Be you stones or iron.\" The point is that even though they have become stone or iron, or become whatever object they think is far from possible to come back to life, actually Allah SWT has the power to bring them back to life. That is why Allah swt ordered His Messenger to answer their doubts emphatically that what would give them life was the One who created them first. If Allah Almighty had the power to create them the first time from the ground, He also had the power to bring them back to life after they became soil. Then it was explained that they would shake their heads to hear the Prophet's explanation as a sign that they denied it and really could not accept the resurrection day. This attitude is also a sign that they will ask when the resurrection day will occur, and when they will be resurrected as new creatures. A similar question is stated in other verses. Allah said: And they (the disbelievers) said, \"When will the (resurrection) promise (take place) if you are truthful?\" (Yasin\/36: 48) People who don't believe in the Day of Judgment, ask that that day happen soon. (asy-Shura\/42: 18) On the Day of Judgment, humans will be resurrected by rearranging their tailbone. The Prophet Muhammad said: \"Indeed in man there are bones that will not be eaten by the ground forever. From these bones humans will be reassembled on the Day of Judgment.\" The Companions asked, \"What bone is that, O Messenger of Allah?\" he replied, \"Coccyx.\" (Muslim history from Abu Hurairah) At the end of the verse, Allah swt ordered His Messenger to tell the polytheists that they must get ready to face the day of resurrection, because the time is near, and it will definitely come. Arabs usually speak of something that will come and it will happen, saying the time is near even though it has been a long time coming. In this case, Allah swt does not make sure when the resurrection day will come to all of His creatures, both angels and His Messengers. He simply announced that the resurrection day would surely come in the near future."
		   },
		   {
			"id": 2080,
			"surah": 17,
			"ayat": 51,
			"tafsir": "Allah swt ordered His Messenger to give an answer and explain to the polytheists of Mecca that Allah has the power to resurrect them after they died as they were when they were first created, regardless of their condition, whether it is in the form of bones, carcasses, stones, iron, or anything according to their understanding. Allah swt ordered His Messenger to say to them, \"Be you stones or iron.\" The point is that even though they have become stone or iron, or become whatever object they think is far from possible to come back to life, actually Allah SWT has the power to bring them back to life. That is why Allah swt ordered His Messenger to answer their doubts emphatically that what would give them life was the One who created them first. If Allah Almighty had the power to create them the first time from the ground, He also had the power to bring them back to life after they became soil. Then it was explained that they would shake their heads to hear the Prophet's explanation as a sign that they denied it and really could not accept the resurrection day. This attitude is also a sign that they will ask when the resurrection day will occur, and when they will be resurrected as new creatures. A similar question is stated in other verses. Allah said: And they (the disbelievers) said, \"When will the (resurrection) promise (take place) if you are truthful?\" (Yasin\/36: 48) People who don't believe in the Day of Judgment, ask that that day happen soon. (asy-Shura\/42: 18) On the Day of Judgment, humans will be resurrected by rearranging their tailbone. The Prophet Muhammad said: \"Indeed in man there are bones that will not be eaten by the ground forever. From these bones humans will be reassembled on the Day of Judgment.\" The Companions asked, \"What bone is that, O Messenger of Allah?\" he replied, \"Coccyx.\" (Muslim history from Abu Hurairah) At the end of the verse, Allah swt ordered His Messenger to tell the polytheists that they must get ready to face the day of resurrection, because the time is near, and it will definitely come. Arabs usually speak of something that will come and it will happen, saying the time is near even though it has been a long time coming. In this case, Allah swt does not make sure when the resurrection day will come to all of His creatures, both angels and His Messengers. He simply announced that the resurrection day would surely come in the near future."
		   },
		   {
			"id": 2081,
			"surah": 17,
			"ayat": 52,
			"tafsir": "Then it was explained that the day of resurrection is the day when Allah swt calls all humans, then they will obey the call while praising Him. The point is that on that day God with His omnipotence calls all mankind. Then they rose from their graves praising the power of Allah who had raised them according to the promise that had been set. Allah swt says: And listen to (the call) on the day (when) the caller (angel) calls from a nearby place. (That is) on the day (when) they hear a terrible sound in truth. That is the day out (from the grave). (Qaf\/50: 41-42) It was narrated in a marfu hadith from Anas that he said, \"Those who say, \"There is no god but Allah,\" do not feel lonely in the grave. As if I was with them coming out of their graves by wiping dust from their heads, saying, \"There is no god but Allah.\" In the narration of ath-thabrani from Ibn Umar that they said, \"All praise be to Allah who has removed our sadness.\" (History of ath-thabrani) At the time of rising from graves, they think that they live in the world not long, but only for a short time. Allah swt says: On the day when they see the Day of Judgment (because the atmosphere is great), they feel as if they only (for a moment) live (in the world) in the afternoon or in the morning (an-Nazi'at\/79: 46) (Also note Yunus\/10: 45) Al-Hasan al-Bashri explains that what is meant by the nearness of the day of resurrection is that on that day you feel as if -as if ever in the world, (on thing you have been there for so long), and suddenly you are now in the hereafter and in the process of calculating good and bad deeds."
		   },
		   {
			"id": 2082,
			"surah": 17,
			"ayat": 53,
			"tafsir": "Allah ordered the Messenger of Allah to tell all His servants to say better words when talking or arguing with polytheists or others. So that they don't use harsh words and insults that will cause hatred, but should use words that are true and contain good lessons. Allah swt said: Call (people) to the way of your Lord with wisdom and good teaching. (an-Nahl\/16: 125). Also pay attention to al-'Ankabut\/29: 46. Allah SWT explains the reason for His prohibition, namely that Satan can spoil the atmosphere and spread disaster between the believers and polytheists when they speak harshly and disagree. Disputes between them can lead to conflict, even fights. In this case, the Prophet Muhammad once forbade a Muslim man to point at him with a piece of iron, for fear that Satan would release the weapon from his hand and then hit the Prophet. This will cause that person to sin and be sent to hell. Narrated by Imam Ahmad from Abu Hurairah, he said that the Messenger of Allah said: Do not one of you point a weapon at his brother, because in fact he does not know, maybe Satan will release the weapon from his hand, so he will enter the valley of hell. (History of Imam Ahmad from Abu Hurairah) Then Allah confirmed that satan is a real enemy to humans. The enmity between the two has been going on for a long time. In another verse, Allah SWT says: Then surely I will come to them from in front, from behind, from their right and from their left. (al-A'raf\/7: 17)"
		   },
		   {
			"id": 2083,
			"surah": 17,
			"ayat": 54,
			"tafsir": "Allah swt explained that He is the one who knows better about the condition of those polytheists. If Allah wills, surely He will give His mercy by giving taufik and His guidance to them, so that they are safe from misguidance and become obedient human beings. But if He wanted to torture them, of course they would not get guidance to believe. In this verse there is a hint that Muslims are not allowed to insult the polytheists, and say they are experts in hell. The certainty that a person will go to hell or not, including supernatural problems that only Allah swt knows. Muslims are also not allowed to do something that makes them ashamed, because that only makes them jealous and creates hostility. At the end of the verse it is emphasized that Allah did not send His Messenger to force them to do what He pleases. However, Allah sent him as a giver of glad tidings and a warning. That is why Allah forbade the Messenger of Allah to force them, and ordered all his companions to be generous."
		   },
		   {
			"id": 2084,
			"surah": 17,
			"ayat": 55,
			"tafsir": "This verse explains that Allah swt knows better the condition of His servants in the heavens or on earth, visible or not. He chooses among His servants who deserves to receive prophetic duties and religious knowledge. He is also the one who prefers one servant over another, according to His knowledge and power alone. This verse is also a refutation of the polytheists who say that it is far from possible for Muhammad, who was only an orphan and was raised by his uncle, Abu Talib, to become a prophet. If his followers were only people who were hungry and dressed in rags, it would be impossible for nobles and Quraysh leaders to want to become his followers. The mention that Allah knows more about His creatures in the heavens and on earth in this verse is a refutation of their assumptions and wishes that Allah should have sent an angel or a great person from Mecca or Taif, to be His messenger. God's Word: Why are not the angels sent down to us. (al-Furqan\/25: 21) God's Word also: And they (also) said, \"Why was this Al-Qur'an not revealed to a big man (rich and influential) from one of these two countries (Mecca and Taif)? \" (az-Zukhruf\/43: 31) Among God's servants chosen to be His messengers are those who have spiritual virtues and a clean soul. Allah swt prefers some prophets over others according to His choice too, such as the Prophet Abraham was given a privilege so that he was given the title Khalilullah and the Prophet Musa was also given a privilege so he was given the title Kalimullah. The Prophet Muhammad was given the highest miracle among all miracles, namely the Qur'an and was given the glory of facing directly into His presence during Isra' and Mi'raj. Allah swt said: We have preferred some of them over others. Among them there are those whom Allah (directly) spoke with and some of them who He exalted by several degrees. And We gave Jesus the son of Maryam some miracles and We strengthened him with the Holy Spirit. (al-Baqarah\/2: 253) At the end of the verse, Allah mentions that He has given the Psalms to David as. Thus, it can be understood that the priority of the Prophet David, was not only because he became a king, but because he also obtained a book from Allah. The special mention of the Zabur in this verse is because in the book it is stated that the Prophet Muhammad is the Seal of Prophets and his people are good people too. Allah swt said: And indeed, We have written in the Zabur after (written) in Az-Zikr (Lau Mafudh), that this earth will be inherited by My pious servants. (al-Anbiya'\/21: 105) What is meant by My righteous servants in the verse above is the Prophet Muhammad and his people."
		   },
		   {
			"id": 2085,
			"surah": 17,
			"ayat": 56,
			"tafsir": "Sabab nuzul this verse is as narrated by al-Bukhari from Ibn Mas'ud that there are humans who worship humans and jinn. The genie partly converted to Islam, and partly remained in his belief. Then come down this verse. In this verse, Allah ordered His Messenger to say to the polytheists of Mecca the following saying, \"When you are struck by danger, such as poverty and disease, try to call on those whom you consider gods other than Allah, can those gods be able to remove the danger that befell you? So in this verse Allah confirms that those whom they consider to be gods will not be able to resist danger or transfer it to others. Because they don't have the power to do that. The one who has the power and ability to eliminate that danger is the Creator of these universes and at the same time their Creator, namely Allah Almighty. Therefore, it is God who must be worshiped."
		   },
		   {
			"id": 2086,
			"surah": 17,
			"ayat": 57,
			"tafsir": "It has been mentioned above that the polytheists worship the angels, jinn, Prophet Isa, and 'Uzair. They regard it as a god who can eliminate their harm and harm. Then Allah mentions that what they worship themselves is actually looking for a wasilah (way) to get closer to Him. That way is none other than obeying Allah's commands and avoiding His prohibitions. Imam at-Tirmidhi and Ibn Mardawaih narrated a hadith from Abu Hurairah, he said: The Messenger of Allah said, \"Please be wasilah for me to Allah.\" They asked, \"What is wasilah? The Prophet also said, \"Get closer to Allah.\" Then the Prophet read this verse (verse 57). Allah further explained that even the closest people, among the angels, jinn, Prophet Isa, and 'Uzair, to Allah keep looking for wasilah to draw closer to Him, by obeying and serving Him. Therefore, are they worthy of worship? Why don't you just worship Allah? At the end of this verse, Allah swt said that in fact God's punishment is something that (should) be feared by anyone, both angels, His apostles and prophets, as well as all humans."
		   },
		   {
			"id": 2087,
			"surah": 17,
			"ayat": 58,
			"tafsir": "Allah swt gave a warning to the polytheists of Mecca who denied the resurrection day, the day of vengeance, and Muhammad's apostleship, that there is not a country whose inhabitants are disobedient, but wholly destroyed, before the Day of Judgment comes or a great disaster befalls because of their sins and their disobedience to prophets who were sent to them. Allah swt says: And how many (people) of the land disobeyed the commands of their Lord and His messengers, so We made a reckoning for the inhabitants of the land with a strict calculation, and We punished them with a terrible punishment (in the hereafter). So that they feel the bad consequences of their actions, and the consequences of their actions, it is a big loss. (ath-thalaq\/65: 8-9) Allah swt explained that such things have been listed in the book of Allah, as narrated by Imam at-Tirmidhi from 'Ubadah bin shamit he said, \"I have heard the Messenger of Allah say: Actually that which was created the first time by Allah was the qalam (pen), then Allah swt said to the qalam, \"Write it down,\" then the qalam said, \"What will I write down?\" Allah swt said, \"Record the things that have been determined, and what what will happen until the Day of Resurrection.\" (Narrated by Imam at-Tirmidhi from 'Ubadah bin Shamit)"
		   },
		   {
			"id": 2088,
			"surah": 17,
			"ayat": 59,
			"tafsir": "Imam Ahmad narrated from Ibn 'Abbas that he said, \"The people of Mecca asked the Prophet to turn Mount Safa into a mountain of gold, and remove the hill so that the land could be used for agriculture. The angel told the Prophet, \"If you will fulfill their request , fill it. If they deny, they can be destroyed like the previous peoples.\" The Prophet said, \"But I want to delay their request.\" Then Allah sent down this verse.\" Allah explained that nothing could prevent the miracles given to His messengers from being carried out. The ancients who denied His signs (miracles) as given to His earlier apostles, will be destroyed. Likewise the people of Quraysh who asked the Prophet Muhammad, so that Allah would also send down His signs to them. However, Allah did not grant them, because if the signs of Allah's power were revealed, they would have denied them too and surely they would have been destroyed like the ancient peoples. While Allah will not destroy the people of Quraysh, because among their descendants there are those who are expected to become believers. Allah swt explained that He had given signs of His power (His miracles) to Prophet Saleh, as requested by the Samud people, namely a female camel that they could see for themselves. Rasulullah said: Narrated from ar-Rabi 'bin Anas, he said, \"The people of Quraysh said to Rasulullah SAW, \"(We want to believe), if brought to us the signs of Allah's power, as brought by the Prophet Saleh and the prophet (to their people).\" Then the Messenger of Allah said, \"If you all want me to pray to Allah, surely Allah will send down (the signs of power) to you. But if you also disobey, you will certainly be destroyed.\" Then they said, \"We do not want.\" (Al-Baihaqi History) Allah explained that in the end the Samud people still did not become believers, they even abused the female camels that became a miracle of the Prophet Saleh and slaughtered them. Allah swt then destroyed them for their sins, and leveled them to the ground. At the end of this verse, Allah swt explains that He gives these signs of power to remind people to take lessons from it, so that they repent and return to following the guidance of Allah swt as called for by His prophets and messengers."
		   },
		   {
			"id": 2089,
			"surah": 17,
			"ayat": 60,
			"tafsir": "Abu Ya'la from Ummi Hani narrated that the morning after Isra', some of the Quraysh made fun of the Prophet and asked for proof. Then he described the situation of Baitul Maqdis and told them about the story of isra'. Then Walid bin Mugirah said, \"This person is a magician.\" Then this verse was revealed. Allah swt supported the Prophet in carrying out his apostolic duties and would protect him from the deception of those who denied his treatise by reminding the Apostle and revealing to him that God's knowledge encompasses all matters of human affairs. The meaning is that Allah is Almighty over all His servants. They are under His grip so that they cannot move except according to His provisions. Allah has the power to protect His Messenger from those who are against him, so that they cannot arbitrarily hurt his heart. Allah swt said: And Allah protects you from (trouble) humans. (al-Ma'idah \/ 5: 67) According to al-Hasan's statement, Allah swt will hinder their every attempt to kill the Prophet. Allah swt said: And (remember), when the disbelievers (Quraish) thought of deceit against you (Muhammad) to arrest and imprison you or kill you, or expel you. They devised and Allah thwarted the deception. Allah is the best avenger of deceit. (al-Anfal\/8: 30) Allah also explains the rejection of the people of Quraysh against what was shown to the Prophet Muhammad on the night of Isra' and Mi'raj, like the zaqqum tree that grows in hell. This is a test, which of his followers is truly a believer and who is a denier. Those who truly have faith grow stronger in their faith, but those whose faith is only in words only grow in denial. The zaqqum tree mentioned in the Qur'an is also a test for them, when they hear Muslims reciting the verse: Truly the zaqqum tree is food for people who sin a lot. (ad-Dukhan\/44: 43-44) They dispute it; people whose faith is strong, their faith is getting stronger, but people who deny the apostle of Muhammad saw increase in disbelief. Abu Jahl, for example, is among those who deny it. At that time he said, \"Actually the son of Abu Kabsyah (Muhammad saw) threatens you with the threat of hell, the fuel of which is stone, then he thinks trees grow in hell, even though you know that fire burns trees.\" 'Abdullah bin az-Zibara said, \"Actually Muhammad scared us with the zaqqum tree that was nothing but dates and cheese, so swallow it.\" They then ate the dates and cheese. The Quraysh polytheists did not believe that in hell there is a plant called the zaqqum tree, because they think that fire destroys everything. They do not know that in this world there are also astonishing miracles, even more so in the hereafter. For example, in the world there is a kind of fiber that is not burnt by fire (asbestos). This material is often used for fire-resistant clothing materials. This earth contains fire (ie magma) in the bowels of the earth which will be seen when a volcano erupts, but green trees grow on it. Even wood or stone can emit fire when rubbed. Even in water there is an element of oxygen that causes the fire to burn. In short, the hearts of the Quraysh disbelievers did not want to accept the truth of the Qur'an. Their denial of ar-ru'ya (a dream or what the Prophet saw during his Isra') and the zaqqum tree is clear evidence of their denial. Allah swt said: Indeed, We have made it (the zaqqum tree) as punishment for the wrongdoers. Truly, it is a tree that comes out of the bottom of the hell of Jahim, its trunk like the heads of demons. (ash-shaffat\/37: 63-65) At the end of the verse it is emphasized that Allah wants to remind them of His torment, but that will only add to their wallowing in iniquity and error."
		   },
		   {
			"id": 2090,
			"surah": 17,
			"ayat": 61,
			"tafsir": "Allah swt ordered the Prophet to remind his people of the hostility of Satan to Adam and his descendants. That enmity has been going on since Adam's creation. When Allah swt ordered the angels to prostrate to pay homage to Adam, they then prostrated themselves to him, except for Iblees. He felt more noble and rejected God's command. Such an attitude was caused by his arrogance, as reflected in his words, \"Shall I prostrate to Adam who was created from dust, while I was created from fire.\" In the opinion of Satan, fire is more noble than earth. Such words of the Devil are expressed in another verse, as mentioned in the word of Allah: (Satan) said, \"I am better than him, because You created me from fire, while You created him from clay.\" (shad\/38: 76) Iblis became a disbeliever because he disobeyed Allah's commands and was arrogant. He thought that Allah swt had ordered something that was out of place. Such an assumption by Satan is only his own imagination. The assumption that fire is more noble than earth is an assumption that is not true, because fire and land are both God's creatures. Allah who created it from nothing, then exaggerates its usefulness from one over the other, according to His wisdom. Fire can burn, while land can grow. Both are supporting human life. So naturally, the two cannot be exaggerated over one another. Both have their respective advantages."
		   },
		   {
			"id": 2091,
			"surah": 17,
			"ayat": 62,
			"tafsir": "Then it was explained that Satan's impudence and defiance of God's commands when he asked God to explain to him, what was the reason that caused him to prostrate to Adam. Satan's request was expressed in the form of a question sentence intended to show his attitude that was surprised to hear God's command to prostrate to Adam. Because of this denial, Satan got wrath, and became far from God's grace. That is why Satan begged Allah to postpone his punishment and death until the Day of Resurrection and to be given the opportunity to tempt and mislead Adam's descendants, except for a small number of his descendants who are truly strong in faith. Allah swt said: Verily you (Iblis) have no power over My servants, except those who follow you, namely people who go astray. (al-hijr\/15: 42)"
		   },
		   {
			"id": 2092,
			"surah": 17,
			"ayat": 63,
			"tafsir": "Allah granted the devil's request and let him go according to his wishes and carry out his tricks until the Day of Judgment came. However, Allah made a condition that whoever among the descendants of Adam who is deceived follows Satan, the reward will be hell as a punishment that must be inflicted on him. This is also the case for those who follow his invitation because they dare to deviate from Allah's commands and violate His prohibitions. Allah swt said: Allah said, \"(All right) then indeed you are among those who are given suspension, until the appointed day (Doomsday).\" (al-hijr\/15: 37-38)"
		   },
		   {
			"id": 2093,
			"surah": 17,
			"ayat": 64,
			"tafsir": "This verse explains further, to what extent is Satan's ability to tempt Adam's descendants on this earth. Allah swt allows Satan to incite anyone among the descendants of Adam, according to his ability and ability with his persuasion and deceit. Satan's trick to tempt Adam's descendants is described as if a commander in chief was deploying an army on horseback and reinforced by soldiers on foot. They attack their enemies with the accompaniment of loud noises in order to surprise their enemies to immediately submit and submit under their rule. In relation to the tafsir of this verse, Imam Mujahid explained that every mounted army that is used to attack the enemy by violating Allah's laws, is an army that is tempted by Satan. And the army on foot that fights in violation of God's provisions, including the army of Satan. Another commentator explains that Satan no longer has an army on horseback and an army on foot. The purpose of this parable is to describe the followers of Satan and his supporters, regardless of their circumstances, whether those who act as supporters or followers are soldiers on horseback or soldiers on foot. As a clear illustration, Allah likens the Devil and his followers in tempting the descendants of Adam as people who gather together to collect wealth and children, which encourages them to fall into disobedience and follow lust. In short, it can be said that Satan is trying his best to tempt Adam's descendants, so that they fall into God's prohibition. The devil tempts their hearts to be interested in a religion that God does not approve of, tempts them to commit adultery, or likes to kill and bury their children alive. God also allowed Satan to make promises to Adam's descendants with promises that could deceive them so that they were complacent from His commands and violated His prohibitions. However, Satan's promises are only a deception, no temptation can prevent God's punishment that will be inflicted on them. Satan's promises are just a dazzling deception so that they are no longer able to distinguish between what is true and what is false. Allah swt said: And Satan said when the matter (recount) had been settled, \"Verily Allah has promised you a true promise, and I also promised you but I violated it. There is no power for me over you, except (only) I call you then you obey my call, therefore do not revile me, but blame yourselves (Ibrahim\/14: 22)"
		   },
		   {
			"id": 2094,
			"surah": 17,
			"ayat": 65,
			"tafsir": "Furthermore, Allah swt explained the limitations of Satan's temptations to the descendants of Adam by emphasizing that in fact God's servants who always obey His commands and stay away from His prohibitions, will not be affected by his temptations. Satan has no power to compel them to submit to his deceptions. The Devil's ability is just a tease. People who can be influenced are those who do not have strong faith. Therefore, Allah swt confirms at the end of this verse that for those who have strong faith it is enough to surrender to Allah, and ask Him for protection so that they are free from the temptations and tricks of Satan. In this verse, there is a sign indicating that humans basically do not have immunity against Satan's temptations and do not have personal control that saves them from going astray. Immunity and personal control is only protection and the abundance of Allah's grace."
		   },
		   {
			"id": 2095,
			"surah": 17,
			"ayat": 66,
			"tafsir": "In this verse it is explained that it is Allah who moves ships in the sea for His servants, so that they can use these ships as a means of transporting the necessities of life from one country to another. It is with transportation that the prosperity found in one country can shift to another country. At the end of the verse, it is emphasized that Allah is truly Most Merciful towards all His servants, because wherever humans direct their eyes, they will certainly witness the sharing of Allah's infinite blessings, which are a sign of the greatness of His power."
		   },
		   {
			"id": 2096,
			"surah": 17,
			"ayat": 67,
			"tafsir": "Then Allah reveals the condition of the disbelievers when there is a danger that threatens their lives. They can expect no help except from Allah, who is able to bring benefits and avert harm. Allah swt states that if the disbelievers are struck by danger in the ocean, they will surely lose their hope of asking for help and help from the idols, jinns, angels, trees and stones they worship. At that critical moment, all they remember is Allah Almighty who has power and is able to eliminate the danger, so they ask Him for help. However, when Allah has granted their request, that is, they have been released from the typhoons and storms that almost drowned them, and arrived safely on land, they turn back to being people who deny Allah's favors and return to associate partners with Him. another god. Allah confirms that human nature tends to forget the favors they receive and always do not believe or do not want to thank the Substance that gives these blessings. This is an oddity that exists in humans except for His servants who are always under His guidance and protection."
		   },
		   {
			"id": 2097,
			"surah": 17,
			"ayat": 68,
			"tafsir": "Allah threatens those who deny His favors, who think that by being safe from the threat of typhoons and storms, they are safe from the punishment of Allah Who has the power to overturn some of the land, so that they are buried deep into the bowels of the earth. If Allah wills, Allah has the power to blow strong winds and shower them with small stones so that they disappear in a very short time from the surface of this earth. In such circumstances, they will not find a protector who is able to save them from this calamity unless Allah Almighty gives life and death to all His creatures. In short, it can be said that disasters can occur anywhere, even if they survive the disasters that threaten them at sea, in the form of typhoons and storms, on land, even more devastating disasters may occur, such as earthquakes, hailstones, floods, and so on. etc. Everything is in the power of Allah who created the heavens and the earth and all creatures that are in between."
		   },
		   {
			"id": 2098,
			"surah": 17,
			"ayat": 69,
			"tafsir": "Furthermore, it is explained that Allah has the power to return those who deny His favor to the sea again, after they feel safe on land. Do they feel safe from the disasters that will befall them in the ocean after they reach land. Allah has the power to return them to the sea again, by sending a very powerful hurricane and tsunami. The wind swept them off the land, so that they would be rolled over by waves that could drown them. At the time of experiencing a very terrible disaster, they will not find anyone who can help to release them from the torment of Allah."
		   },
		   {
			"id": 2099,
			"surah": 17,
			"ayat": 70,
			"tafsir": "Allah glorifies the Children of Adam, namely humans from other creatures, both angels, jinn, all kinds of animals, and plants. The superiority of humans from other creatures in the form of physical and non-physical, as Allah says: Indeed, We have created man in the best form, then We return him to the lowest possible place, except for those who believe and do virtue; then they will have an unfailing reward. (at-Tin\/95: 4-6) Besides being given the five perfect senses, humans are also given a heart that functions to weigh and make decisions. God's Word: And God brought you out of your mother's belly knowing nothing, and He gave you hearing, sight and conscience, that you might be grateful. (an-Nahl\/16: 78) This human glory is in accordance with his duties as caliph on earth. Allah's Word: And (remember) when your Lord said to the angels, \"I will make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Even so, many people are not aware of the elevation of their degrees so they do not carry out their functions as mentioned in the word of Allah: And indeed, We will fill Hell with many from among the jinn and humans. They have hearts, but they do not use them to understand (the verses of Allah) and they have eyes (but) they do not use them to see (signs of Allah's power), and they have ears (but) they do not use them to hear (the verses of Allah) ). They are like livestock, even more astray. (al-A'raf\/7: 179)"
		   },
		   {
			"id": 2100,
			"surah": 17,
			"ayat": 71,
			"tafsir": "Allah swt reminds His servants of the day of reckoning. On that day, Allah swt calls people with their respective books which contain a complete record of their deeds. At that time, they will get a fair decision, according to the deeds they have done in the world, all of which have been recorded in the book. So happy are those who, when given the book of their deeds, are accepted by their right hand. These people will read the book with great joy, because they are happy to see the record of their good deeds. Allah swt said: As for the person whose book was given in his right hand, he said, \"Take it, read my book (this).\" (al-haqqah\/69: 19) Also His words: So as for the person whose notes are given from his right hand, then he will be examined with an easy examination. (al-Insyiqaq\/84: 7-8) Allah then confirmed that they were not wronged in the slightest. The point is that the reward they have to receive will not be reduced in the least, because the Creator of the hereafter is also the Creator of this world, so that it is impossible for Him to reduce the reward that must be received. Allah swt is just and His justice is seen in His creation in this world."
		   },
		   {
			"id": 2101,
			"surah": 17,
			"ayat": 72,
			"tafsir": "Then it was explained that whoever is blind in heart in this world, that is, who does not want to see the truth of Allah's guidance, and does not want to pay attention to the signs of His power, surely in the hereafter he will be even more blind and unable to find a way to save himself from the torments of hell. In fact, they are even more misguided than their situation in the world, because their spirit at that time was a spirit when they were in the world too. The spirit that Allah SWT resurrects in the hereafter is the spirit that comes out of his body when he dies like fruit that emerges from its stem. Fruit and stem have the same properties. Likewise the human spirit at that time, he rose up with all his characteristics, morals, and deeds. He knows his condition. He feels happy or unlucky according to his condition. If the condition of the human spirit is heedless in this world, he will also be negligent in the hereafter because he has neglected various means and tools to master knowledge, and is used to being lazy to practice God's commands. He will curse and insult himself."
		   },
		   {
			"id": 2102,
			"surah": 17,
			"ayat": 73,
			"tafsir": "This verse describes the efforts made by the polytheists of Quraysh to deceive the Prophet Muhammad, so that he was almost deceived, turned away from the revelations he had received from Allah, and complied with their request to acknowledge their gods. Because of Allah's protection, the Prophet remained firm in his stance in spreading his da'wah, even though the pressure from the Quraysh people was increasing. Allah reminds His Messenger, if he follows what they want, they will certainly take him as a friend or appoint him as a leader. They will also declare before people that the Holy Prophet has approved and acknowledged their religion. Thus, the Prophet would be far from the guidance and guidance of Allah."
		   },
		   {
			"id": 2103,
			"surah": 17,
			"ayat": 74,
			"tafsir": "In this verse, it is explained that the Prophet Muhammad was almost affected if Allah did not strengthen his heart to face the pressure and deceit of the Quraysh people, so that he did not turn away in the slightest. From the description of this verse it can be understood that the Prophet tended to approach the Quraysh. This was not because the Prophet's heart was weak, but it showed that the pressure and deception was very great. Only because of Allah's help, the Apostle did not approach them."
		   },
		   {
			"id": 2104,
			"surah": 17,
			"ayat": 75,
			"tafsir": "Allah swt reminded His Messenger that if he had ever been influenced by the pressure of those disbelievers, Allah would inflict multiple torments on him, both in this world and in the hereafter. Thus, the level of punishment for the Prophet was doubled from the punishment for other people, as well as for the wives of the Prophet. In this case, Allah swt said: O wives of the Prophet! Whoever among you commits a real abomination, his punishment will be doubled upon him. And that is easy for Allah. (al-Ahzab\/33: 30) If the wives of the Prophet slipped to follow the invitation of lust, the punishment was twice that of the wives of most people. From this verse it is understood that the punishment for clerics, intellectuals and other community leaders if they are guilty will be greater than the punishment for ordinary people. And they said, \"Our Lord, indeed we have obeyed our leaders and princes, then they led us astray from the (right) path. O our Lord, inflict on them double punishment and curse them with great curse. \" (al-Ahzab\/33: 67-68) Allah swt reminded the Prophet that if he fulfills the wishes of the polytheists, Allah will punish him double, both in this world and in the hereafter. He will not find a helper who can deliver him from that punishment. It is imperative for every Muslim to make this verse a guide in every step of their religion."
		   },
		   {
			"id": 2105,
			"surah": 17,
			"ayat": 76,
			"tafsir": "This verse reveals how the various pressures that the Prophet and the Muslims faced almost succeeded in making him unable to bear living in Mecca any longer, especially after the infidel Quraysh plotted to kill him. This event was the background of the Hijrah to Medina. Allah conveyed His threat through the Messenger of Allah to the Quraysh infidels that if the Prophet and the Muslims were expelled from Mecca, Allah would not allow it. In a short time they will be destroyed by Allah and then the land of Mecca will be re-occupied by the believers. Allah's promise was proven by the killing of the Quraysh leaders in the Battle of Badr which took place in the second year after the Prophet's migration to Medina, and the conquest of Mecca in the 8th year of the Hijrah."
		   },
		   {
			"id": 2106,
			"surah": 17,
			"ayat": 77,
			"tafsir": "In this verse, it is explained about God's laws that are generally accepted, as experienced by the apostles and prophets before him. They experienced heavy pressures and were expelled by their people. But in the end, Allah won the Muslims and punished those who disobeyed. Likewise the Prophet Muhammad and his followers, they did not escape the pressure and persecution of the polytheists of Mecca. However, this did not affect the steadfastness of the Prophet and his followers, even though they were forced to emigrate. God's promise of victory will come in due time, and God's enemies will suffer great defeat. It should be explained that the punishment by destroying those who disobey as happened to the people of 'Ad, Samud, people of Lut, and others known as azab al-isti'shal (punishment by extermination) was no longer enforced after the Prophet Muhammad was sent because he is the bearer of mercy to all mankind, and there is hope that the Quraysh infidels or their descendants will convert to Islam. Allah swt said: But Allah will not punish them, as long as you (Muhammad) are among them. And not (also) Allah will punish them, while they (still) ask for forgiveness. (al-Anfal\/8: 33)"
		   },
		   {
			"id": 2107,
			"surah": 17,
			"ayat": 78,
			"tafsir": "This verse instructs the Messenger of Allah to offer prayers after the sun has slipped until dark at night, and to offer the Fajr prayer. The aim is to pray five times a day, namely the Zuhur, Asar, Maghrib, Isha, and Fajr prayers. Carrying out the five daily prayers is doing and fulfilling them complete with the pillars and conditions, continuously being done, in accordance with Allah's commands, both physically and mentally. What is meant outwardly is praying in accordance with the provisions set by religion. Meanwhile, inwardly, it is praying with full devotion, because you feel the majesty and power of Allah who controls and creates all of this world. Rasulullah SAW ordered the Muslims to worship Allah in a state as if they saw Allah SWT. That is ihsan as the Prophet said: Ihsan is that you worship Allah, as if you see Him. If you cannot see Him, then surely He sees you. (Muslim history from Abu Hurairah) If a servant of Allah prays five times a day, it means he has done one of the pillars of Islam, according to the hadith of the Prophet: Islam is founded on five: the creed that there is no god but Allah and that Muhammad is the messenger of Allah, establish prayers, pay zakat, fast Ramadan, and make pilgrimage to Baitullah for those who can afford to travel. (Muslim history from 'Abdullah bin 'Umar ra) In this verse it is explained that the morning prayer was witnessed by angels. The point is that at dawn the night guard angel meets the day guard angel to change duties, and both of them report to Allah that the person concerned is praying when they leave, as explained in the hadith of the Prophet saw: From Abu Hurairah, that the Prophet saw said, \"The night and day angels alternate in their duties. They gather at the time of Fajr and Asr prayers. Then the angels who guard you at night go up, and God asks them (though Allah knows better about you), \"How is my servant when you left?\" The angels replied, \"We came to them, they were in a state of prayer and we left them, they were also in a state of prayer too.\" (History of al-Bukhari and Muslim) ar-Razi said, \"Verily, at dawn, humans witness the signs of Allah's power and the greatness of His wisdom in heaven and on earth. At that time, the bright sunlight washes away the darkness of the night. At that time, the sleeping person wakes up and his five senses return to work after being lulled during their sleep.\""
		   },
		   {
			"id": 2108,
			"surah": 17,
			"ayat": 79,
			"tafsir": "This verse instructs the Prophet and the Muslims to get up at night to perform the midnight prayer. This verse is the verse that first ordered the Prophet to perform night prayers in addition to the obligatory prayers. Tonight's prayer is explained by the hadith of the Prophet saw: That the Prophet saw was asked, \"Which prayer is the most important after the obligatory prayers (praying five times a day).\" Rasulullah saw replied, \"Tahajud prayer.\" (Muslim history from Abu Hurairah) From the authentic hadiths of the Prophet, which were narrated from 'A'isyah and Ibn 'Abbas it is understood that the Prophet Muhammad woke up to perform the midnight prayer, after he had slept. This custom of the Prophet can be used as a legal basis that the midnight prayer is a circumcision performed by a person, after sleeping for a while at night, then in the middle of the night he gets up to pray the midnight prayer. Then Allah swt explained that the law of the midnight prayer was as an additional worship for the Prophet besides praying five times a day. Therefore, the law for the Messenger of Allah is obligatory, while for his people it is circumcision. In this verse, it is explained that the purpose of the midnight prayer for Prophet Muhammad is so that Allah SWT can place him in a maqaman mahmudan (in a commendable place). What is meant by maqaman mahmudan is the intercession of Rasulullah SAW on the Day of Resurrection. On that day humans will experience a very difficult situation that is beyond compare. The only thing that can relieve and relieve people from this very difficult situation is only the Prophet Muhammad's request to his God, so that people can be relieved and relieved of their suffering. It was narrated by at-Tirmidhi from Abu Hurairah that the Messenger of Allah said, \"The meaning of maqaman mahmudan in this verse is my intercession.\" (Hadith hasan sahih) Ibn Jarir ath-tabari said that most experts said, \"What is meant by maqaman mahmudan is a position that is used by the Messenger of Allah on the Day of Resurrection to intercede for people, so that Allah will ease the troubles and difficulties they experience. experienced that day.\" Narrated by an-Nasa'i, al-hakim, and a group of hadith experts from Hudzaifah, \"Allah gathered people in a large area on the Day of Judgment, they all stood up and no one spoke on that day except with His permission. The person whose name was first called was Muhammad, so Muhammad prayed to Him. This is what is meant by maqaman mahmudan in this verse. Al-Bukhari narrated from Jabir bin 'Abdullah that the Messenger of Allah said: Whoever reads the prayer after finished hearing the call to prayer, \"O my Lord, God Who has this perfect call and prayer that is done, give Muhammad wasilah and primacy and raise him to al-maqam al-mahmud (commendable position) that You have promised him,\" then he obtain my intercession. It is narrated from Abu Sa'id al-Khudri that the Messenger of Allah said, \"I am the leader of Adam's children and grandchildren on the Day of Judgment. I am not proud of myself, and in my hand I hold the liwa'ul hamdi (flag of praise) I am not proud of myself. There was not a single prophet on that day, from Adam to the other prophets, except under my flag, I was the first to come out of the earth, and I did not boast. Humans at that time were frightened by three frightening things. Then they came to Adam. They said, \"You are our father, help us to your Lord.\" Adam replied, \"I have a sin that caused me to be brought down to earth. Come to Noah!\" so they came to Noah. (After they complained about their problems to Noah), Noah said, \"I have prayed for the inhabitants of the earth so that they are destroyed. But come to Abraham. Come to Isa.\" Jesus then said, \"I was once worshiped besides Allah. Just come to Muhammad.\" So they came to me. I then went with them, then I held the circle door of heaven, then I pulled. Then I was asked, \"Who is that?\" I replied, \"Muhammad.\" Then they opened the door for me, and said, \"Welcome.\" then I fell prostrate. Then Allah inspired me to praise, worship, and glorify Him. Then I was ordered, \"Raise your head, ask! you will be given. Ask for intercession, and you will be permitted to intercede. And speak, your words will be heard. That is the commendable station, which Allah said, \"May your Lord give you a commendable station.\" (History of at-Tirmidhi) From the verses and hadiths above it is understood that the Prophet Muhammad saw by performing the midnight prayer would be appointed by Allah swt to a place and position that was praised by mankind, the angels, and Allah Tabaraka wa Taala, namely the position for ask for intercession for mankind while in Padang Mahsyar with Allah's permission. Humans are indeed entitled to intercession because of their good deeds and good manners while in the world, that is, their sins are forgiven by God or they are elevated in rank. In another word of God, it is explained that getting up in the middle of the night to pray the midnight prayer and reciting the Qur'an fervently can make your faith strong and develop yourself. Allah swt said: O you who are covered (Muhammad)! Get up (to pray) at night, except for a small part. (That is) half or a little less than that, or more than (half) that, and recite the Qur'an slowly. Indeed, We will send down heavy words on you. Truly, the night's wake is stronger (fills the soul); and (reading at that time) more memorable. (al-Muzzammil\/73: 1-6)"
		   },
		   {
			"id": 2109,
			"surah": 17,
			"ayat": 80,
			"tafsir": "At-Tirmidhi narrated from Ibn 'Abbas that the Prophet was in Mecca, then Allah ordered him to emigrate. Then come down this verse. Allah swt ordered the Prophet Muhammad to say the prayer referred to in this verse, which means \"O my Lord, enter me where You want, both in this world and in the hereafter, and place me where You want, both in world and in the hereafter.\" Among the examples of the Prophet's entry into a place correctly are he and his companions entering the city of Medina as people who migrated from Mecca, entering the city of Mecca at the time of the conquest of that city, entering the grave after death, and entering a place that pleases Allah, such as entering mosque, own house, friend's house, and acquaintances after asking permission from him, and so on. Get out of all the places that Allah wills, such as leaving the city of Mecca during the migration, leaving the graves on the resurrection day, or leaving all the places that Allah wills, such as cities where sins are committed and so on. Allah swt also ordered the Prophet to pray to Him so that he would be made a person who mastered blasphemy and acceptable reasons and when preaching, could satisfy those who listened to him so that his faith would grow stronger. If those who hear unbelievers, their hearts become soft and want to convert to Islam. In answer to the Prophet Muhammad's prayer, Allah explained that He protected the Prophet from all kinds of human deceit and would win over the disbelievers, as stated in His words: And Allah protects you from (disturbing) humans. Indeed, Allah does not guide the disbelievers. (al-Ma'idah\/5: 67)"
		   },
		   {
			"id": 2110,
			"surah": 17,
			"ayat": 81,
			"tafsir": "Allah ordered the Prophet Muhammad to convey to the polytheists that in fact the truth has come, namely the Qur'an, faith, and Islam. Meanwhile, the vanity, i.e. shirk and disbelief, will be destroyed. Evil will not last long, because it has no true foundation. In another verse, Allah swt says: Actually, We cast the right (truth) on the wrong (unrighteous) then the right destroys it, then immediately (the wrong) disappears. And woe to you because you characterize (God with traits that are not befitting of Him). (al-Anbiya'\/21: 18) Narrated by al-Bukhari and Muslim from 'Abdullah bin Mas'ud, when the Prophet entered the city of Mecca during the conquest of the city, there were 360 statues around the Kaaba. So the Messenger of Allah stabbed the statue with a piece of wood that was in his hand, and said: What is right has come and what is false has disappeared, in fact what is false must have disappeared. The right has come, and the wrong will not come again and will not return. (History of al-Bukhari and Muslim)"
		   },
		   {
			"id": 2111,
			"surah": 17,
			"ayat": 82,
			"tafsir": "This verse explains that Allah swt sent down the Qur'an to Muhammad as a cure for heart ailments, namely shirk, disbelief, and hypocrisy. Al-Qur'an is also a mercy for Muslims because it gives instructions to them, so that they enter heaven and avoid the punishment of Allah. The Qur'an has liberated the Muslims from ignorance so that they became a nation that ruled the world during the Umayyad and Abbasid caliphs. Then they returned to being a backward people because they ignored the teachings of the Qur'an. In the past they were respected people, but later they became pawns who were used as bait by enemies in world affairs. Because they used to carry out the teachings of the Qur'an, their country became the center of world knowledge, world trade, and so on, and once lived in prosperity and happiness. This verse warns Muslims that they will be able to hold their role again in the world if they follow the Qur'an and stick to its teachings in all areas of life. Conversely, if they do not want to carry out the teachings of the Qur'an seriously, prioritize personal interests above the interests of religion and society, and only care about worldly life, then Allah will make their enemies as rulers over them, so that they become people foreigners or slaves in their own country. The experience of Muslims is quite bitter due to ignoring the teachings of the Qur'an. The Qur'an orders them to unite and consult, but they are divided over small and trivial issues of the caliphate, while important and major issues are ignored. This verse also reminds Muslims that for those who are unjust, namely those who deny, shirk, and hypocrite, the Al-Qur'an will only add to their losses, because they will reject every teaching that the Al-Qur'an brings. In fact, if accepted, it will definitely benefit them."
		   },
		   {
			"id": 2112,
			"surah": 17,
			"ayat": 83,
			"tafsir": "In this verse, Allah SWT explains the general nature of humans, that is, when given pleasures, such as wealth, power, victory and so on, they no longer want to submit and obey Him, they even distance themselves. On the other hand, when difficulties, misery, poverty and defeat hit them, they give up and feel that they will gain nothing more. They should not despair, but keep doing good deeds and trying to get Allah's help, because according to the teachings of the Qur'an, one who despairs of Allah's mercy means that he has denied His mercy. Other verses that explain the condition of humans when they receive God's grace, are His words: And when a man is struck by danger he prays to Us lying down, sitting or standing, but after We remove the danger from him, he returns (to the wrong path). ), as if he had never prayed to Us to (remove) the harm that had befallen him. (Yunus\/10: 12)"
		   },
		   {
			"id": 2113,
			"surah": 17,
			"ayat": 84,
			"tafsir": "Allah ordered the Prophet Muhammad to convey to his people so that they work according to their respective potentials and inclinations. Everyone is welcome to work according to their own character, character, will, and inclination. Allah swt as the Ruler of the universe knows who among humans follows the truth and who among them follows falsehood. Everyone will be given a fair decision later. Allah said about the command to work: Say (Muhammad), \"O my people! Act according to your position, I will also do (thus). Later you will know, who will get the (best) place in the hereafter (later). Indeed, those who the unjust will not prosper (al-An'am\/6: 135)"
		   },
		   {
			"id": 2114,
			"surah": 17,
			"ayat": 85,
			"tafsir": "The Jews asked the Prophet Muhammad about the spirit that can revive the body, what is its essence and whether it can be resurrected. Then Allah ordered the Prophet to answer the question by saying that the matter of the spirit is Allah's business, only He knows everything, and He Himself created it. The word spirit in the Qur'an has three meanings, namely: First: What is meant by spirit is the Qur'an. As Allah says: And thus We revealed to you (Muhammad) the spirit (Qur'an) by Our command. (asy-Syura\/42: 52) This understanding is in accordance with the contents of verse 82 of surahh al-Isra', where it is explained that the Qur'an is the antidote and mercy for those who believe. Also in accordance with verse 87 of the same surahh which explains that if Allah willed, surely He would have destroyed the Al-Qur'an which was revealed to the Prophet Muhammad. Thus, the Prophet will not get a defense. Second: Archangel Gabriel. In the Qur'an there are many words of the spirit which are interpreted by Jibril as, as in the word of Allah swt. Which was brought down by ar-Ruh al-Amin (Gabriel), into your heart (Muhammad) so that you will be among those who give warnings. (asy-Syu'ara'\/26: 193-194) And the word of Allah swt: then We sent Our spirit (Gabriel) to him, so he appeared before him in perfect human form. (Maryam\/19: 17) Third: Means the spirit that is in the body, which is the source of life for living things. According to Jumhur Ulama, the word spirit in this verse is the spirit that is in the body (soul). Allah's Word: And (remember the story of Maryam) who kept her honor, then We blew (spirit) from Us into her (body); We made him and his son a sign (of Allah's greatness) for the whole world. (al-Anbiya'\/21: 91) This opinion which equates the spirit with the nafs (spirit\/soul) is the opinion held by many scholars (jumhur) and is in accordance with why this verse was revealed. Allah said: So when I have perfected (the incident) it, and I have breathed My spirit (creation) into it, then submit to it by prostrating. (al-hijr\/15: 29) The above verses invite mankind to understand the true contents of the Qur'an, so as not to stray onto the wrong path. On the other hand, those who do not try to understand the contents of the Qur'an will not be able to use it as a guide for life, and they will even take actions and actions that can keep them from understanding its verses properly. They asked the Prophet about things that could not possibly be known by humans, which actually had no point in knowing, except to test the Prophet. Allah swt in this verse states that He only gives humans very little knowledge about spirits. However, among the scholars there are those who have tried to explore the nature of the spirit. Among them are: 1. The spirit is a kind of light matter (body, conscience) that descends into the world from the high realms, its nature is different from matter that can be seen and touched. 2. The spirit flows in the human body, as water flows in flowers, or as fire flows in coals. The spirit gives life to a person's body as long as the body is able and able to receive it, and nothing blocks its flow. If the body is unable and able to accept the spirit any longer, so that its flow is blocked in the body, then the body dies. This opinion was expressed by ar-Razi and Ibnul Qayyim. Meanwhile, Imam al-Gazali and Abu Qasim ar-Ragib al-Asfahani argue that the spirit is not material and something in form, but it is only something that depends on the body to take care of and complete the body's interests. The best attitude of Muslims regarding the spirit is to follow this word of Allah, that the nature of the spirit cannot be reached by the human mind, because only Allah knows for sure. What needs to be believed is that the spirit exists. God only gives the symptoms to humans themselves, even knowing that the spirit exists, and experiencing its symptoms. So what needs to be researched and studied seriously are the symptoms of the spirit, which are carried out in psychology. Studying the symptoms of this soul even includes things that are asked by God in His word: And (also) yourself. So don't you pay attention? adz-dzariyat\/51: 21) Since only Allah knows about the nature of the spirit, then in this verse Allah confirms to humans that Allah's knowledge is vast, unpredictable, covering all kinds of knowledge, both knowledge about the real nature, as well as that which is not real, whether it is attainable by the five senses or not. Because of God's love for humans, He bestowed a small portion of that knowledge on humans, it means nothing when compared to the level of God's knowledge. It is narrated that when this verse was revealed, the Jews replied, \"We have been given a lot of knowledge. We have been given the Torah. Whoever has been given the Torah means he has been given a lot of goodness.\" Then came verse 109 of surahh al-Kahf. Allah swt said: Say (Muhammad), \"If the ocean were ink for (writing) the sentences of my Lord, then the ocean would surely have been used up before the completion (writing) of the sentences of my Lord, even though We brought an additional amount of it (too).\" (al-Kahf\/18: 109)"
		   },
		   {
			"id": 2115,
			"surah": 17,
			"ayat": 86,
			"tafsir": "This verse explains that if Allah swt wanted to take back the Qur'an that had been revealed and erased it from the heart of the Prophet Muhammad and from the pages that had been written, it would have been easily carried out by Him, there would not have been the slightest trace of it. . The ease with which Allah swt erased the Qur'an was explained in the hadith of the Prophet saw: It was narrated from Ibn Mas'ud that the Messenger of Allah said, \"Surely this Al-Qur'an will be removed (deleted).\" Someone said, \"How is it possible, indeed Allah has strengthened it in our hearts, and we have enshrined (written) it in written sheets.\" He said, \"Lift up the Qur'an in one night, not a single verse from it is left in the heart nor in the Mushaf, unless all are lifted up. So in the morning not a single verse will remain on you.\" Then the Prophet read this verse. (History of Sa'id bin Mansur and al-hakim and declared valid by ath-thabrani and al-Baihaqi). After the Al-Qur'an is erased from the heart and what is written in the mushaf, then at that time there is nothing else to hold on to and guide to the right path. No one is able to return it, either in the form of mushaf or rote."
		   },
		   {
			"id": 2116,
			"surah": 17,
			"ayat": 87,
			"tafsir": "However, Allah did not intend to erase the Qur'an from the heart of the Prophet and the Mushafs, because of His great mercy bestowed on His servants. The Qur'an is the greatest blessing that Allah has given to mankind. He keeps the Qur'an in people's hearts and protects it from their interference. According to ar-Razi, there are two kinds of great blessings that Allah has given to scholars: first, it makes it easier for them to acquire knowledge, and secondly, the knowledge remains in their minds and memories. With these two kinds of favors, it is easy for humans to digest the contents of the verses of the Qur'an and then carry out what He commands and stop what He prohibits. Thus, they are protected from destruction in this world and the punishment of hell in the hereafter. In this verse Allah explains that the priority He gave to the Prophet Muhammad was so great that Allah did not want the revelations that had been revealed to him to be erased. This revelation is God's greatest blessing to the Prophet and believers because it contains guidance and healing from various diseases."
		   },
		   {
			"id": 2117,
			"surah": 17,
			"ayat": 88,
			"tafsir": "It was narrated by Ibn Ishaq and Ibn Jarir from Sa'id from Ibn 'Abbas, that Salam bin Mishkam and his fellow Jews came to the Messenger of Allah and said, \"How are we going to follow you Muhammad, when you have left our Qibla and Al -The Qur'an that you brought is not structured like the Torah. Therefore, send down to us a book that we can examine. If you are unable to bring it, then we will bring you something similar to what you brought. So Allah swt sent down this verse which confirmed to them that all of them would not be able to make a book like the Qur'an. Sabab nuzul this verse was not agreed upon by the scholars because this surah was a Makkiyah surahh and the target was the Quraysh, while the Jews lived in Medina.In this verse, Allah swt confirms the miracle of the Qur'an and its virtue, namely that the Qur'an is truly from Allah and was sent down to to the Prophet Muhammad saw. As proof that the Qur'an is from Allah, not Muhammad's creation as alleged by the Meccan infidels and people of the book, Allah swt ordered the Prophet Muhammad to deliver a challenge to those who ignore and look at the Qur'an it is not a revelation of Allah to make a counterpoint to the Qur'an. But Allah made it clear that they would not be able to produce the same book. Allah said: And if you doubt (the Qur'an) that We sent down to Our servant (Muhammad), then compose a surah like it and invite your helpers besides Allah, if you are truthful. If you are not able to make it, and (certainly) will not be able to, then fear the fire of hell whose fuel is human and stone, which is prepared for the disbelievers. (al-Baqarah\/2: 23-24) History shows that many leaders and experts in Arabic literature tried to emulate and imitate the Qur'an, some even claimed to be a prophet, such as Musailamah al-Kadzdzab, thulaiah , Habalah bin Kaab, and others. However, they all failed in their efforts and even received ridicule and contempt from society. An example is what Musailamah al-Kadzdzab has made which he thinks can match the verses of the Qur'an: O frog, child of two frogs, scream what you want to scream. Your upper part is in the water and your lower part is in the ground. The experts stated that Musailamah's words did not contain any meaning. Among those who commented was al-Jahiz, a well-known Arab writer who said, \"I don't understand what moved Musailamah's soul to mention frogs and so on, how bad is the composition he says is a verse of the Qur'an that has been revealed to Prophet Muhammad peace be upon him. The possibility of the cooperation of jinns and humans mentioned here is to compensate for the Angel Gabriel and the Prophet Muhammad who received the Qur'an from Allah."
		   },
		   {
			"id": 2118,
			"surah": 17,
			"ayat": 89,
			"tafsir": "In this verse it is explained that Allah conveys all kinds of evidence and arguments to people so that they believe. Various evidences and arguments are expressed in the form of explanations with various styles of language, in the form of orders, news, and stories. Likewise, the various contents, such as beliefs, laws, morals, worship, stories, and so on whose truth cannot be denied. Even though Allah SWT has conveyed it in different forms and ways, as well as its content which contains high values to achieve happiness in life in this world and in the hereafter, unbelievers do not believe in it. They still deny and oppose it."
		   },
		   {
			"id": 2119,
			"surah": 17,
			"ayat": 90,
			"tafsir": "These verses explain the attitude of the Quraysh leaders in facing the call of the Prophet Muhammad, they include Uthbah, Syaibah, Abu Sufyan, Nadhar, and others. Their attitude showed visible signs of their denial and reluctance to accept the call. As a result, no matter what evidence is presented to them, they will still not believe. They asked the Prophet for impossible things because they knew that the Prophet would not be able to do them. Thus there is a reason for them not to follow the Apostle's call. Among the requests of the disbelievers are: 1. So that the Messenger of Allah will emit a spring from the earth, even though their country is a desert. 2. In order for the Messenger of Allah to create a date or grape orchard flowed by rivers. With the water constantly flowing, the palm trees and grapevines will multiply and produce more than double. 3. In order for the Messenger of Allah to drop the sky into pieces so that it falls on them. Their request like this is explained in another verse. Allah swt said: And (remember), when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then shower us with stones from the sky, or bring it to our painful doom.\" (al-Anfal\/8: 32) Their request is like the request of the people of Aikah (Madyan) to the Prophet Shuaib before, as Allah said: So drop us a lump from the sky, if you are of the righteous.\" (asy- Syu'ara'\/26: 187) 4. In order for the Messenger of Allah to bring Allah and angels in plain view (can be seen in real time) to them to declare directly that Muhammad is an apostle sent by Him 5. In order for the Messenger of Allah to build a house made of gold. The polytheists believed that an apostle sent by Allah should be a ruler, wealthy, and honorable. Therefore, in their opinion, it was impossible for Muhammad as an orphan and poor to be appointed as an apostle. 6. So that the Messenger of Allah peace be upon him ascended to the sky via a ladder that they could see, then descended back to the world via the same ladder carrying a book that they could read and use their own language which explains that Muhammad is the messenger of Allah. In fact, everything that the polytheists ask for is very easy for Allah to grant, there is nothing that is difficult or impossible for Allah to hold and do. But Allah knows that all these requests are just making it up, as an excuse not to believe in the Prophet Muhammad. The attitude of polytheists is explained in the word of Allah SWT: Indeed, those who have been confirmed to have received the decree of your Lord, will not believe, even though they receive signs (the greatness of Allah), until they witness a painful doom. (Yunus\/10: 96-97) And Allah said: And even though We sent down angels to them, and people who had died spoke to them and We collected (also) before them everything (they wanted), they neither will believe, unless Allah wills. But most of them do not know (the meaning of truth). (al-An'am\/6: 111) Allah swt ordered Muhammad to convey to the polytheists that he was only a human who was appointed as an apostle and was given revelation. Allah is able to fulfill all their requests, but His requests are not granted because they are not needed. Even if granted, they still would not believe."
		   },
		   {
			"id": 2120,
			"surah": 17,
			"ayat": 91,
			"tafsir": "These verses explain the attitude of the Quraysh leaders in facing the call of the Prophet Muhammad, they include Uthbah, Syaibah, Abu Sufyan, Nadhar, and others. Their attitude showed visible signs of their denial and reluctance to accept the call. As a result, no matter what evidence is presented to them, they will still not believe. They asked the Prophet for impossible things because they knew that the Prophet would not be able to do them. Thus there is a reason for them not to follow the Apostle's call. Among the requests of the disbelievers are: 1. So that the Messenger of Allah will emit a spring from the earth, even though their country is a desert. 2. In order for the Messenger of Allah to create a date or grape orchard flowed by rivers. With the water constantly flowing, the palm trees and grapevines will multiply and produce more than double. 3. In order for the Messenger of Allah to drop the sky into pieces so that it falls on them. Their request like this is explained in another verse. Allah swt said: And (remember), when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then shower us with stones from the sky, or bring it to our painful doom.\" (al-Anfal\/8: 32) Their request is like the request of the people of Aikah (Madyan) to the Prophet Shuaib before, as Allah said: So drop us a lump from the sky, if you are of the righteous.\" (asy- Syu'ara'\/26: 187) 4. In order for the Messenger of Allah to bring Allah and angels in plain view (can be seen in real time) to them to declare directly that Muhammad is an apostle sent by Him 5. In order for the Messenger of Allah to build a house made of gold. The polytheists believed that an apostle sent by Allah should be a ruler, wealthy, and honorable. Therefore, in their opinion, it was impossible for Muhammad as an orphan and poor to be appointed as an apostle. 6. So that the Messenger of Allah peace be upon him ascended to the sky via a ladder that they could see, then descended back to the world via the same ladder carrying a book that they could read and use their own language which explains that Muhammad is the messenger of Allah. In fact, everything that the polytheists ask for is very easy for Allah to grant, there is nothing that is difficult or impossible for Allah to hold and do. But Allah knows that all these requests are just making it up, as an excuse not to believe in the Prophet Muhammad. The attitude of polytheists is explained in the word of Allah SWT: Indeed, those who have been confirmed to have received the decree of your Lord, will not believe, even though they receive signs (the greatness of Allah), until they witness a painful doom. (Yunus\/10: 96-97) And Allah said: And even though We sent down angels to them, and people who had died spoke to them and We collected (also) before them everything (they wanted), they neither will believe, unless Allah wills. But most of them do not know (the meaning of truth). (al-An'am\/6: 111) Allah swt ordered Muhammad to convey to the polytheists that he was only a human who was appointed as an apostle and was given revelation. Allah is able to fulfill all their requests, but His requests are not granted because they are not needed. Even if granted, they still would not believe."
		   },
		   {
			"id": 2121,
			"surah": 17,
			"ayat": 92,
			"tafsir": "These verses explain the attitude of the Quraysh leaders in facing the call of the Prophet Muhammad, they include Uthbah, Syaibah, Abu Sufyan, Nadhar, and others. Their attitude showed visible signs of their denial and reluctance to accept the call. As a result, no matter what evidence is presented to them, they will still not believe. They asked the Prophet for impossible things because they knew that the Prophet would not be able to do them. Thus there is a reason for them not to follow the Apostle's call. Among the requests of the disbelievers are: 1. So that the Messenger of Allah will emit a spring from the earth, even though their country is a desert. 2. In order for the Messenger of Allah to create a date or grape orchard flowed by rivers. With the water constantly flowing, the palm trees and grapevines will multiply and produce more than double. 3. In order for the Messenger of Allah to drop the sky into pieces so that it falls on them. Their request like this is explained in another verse. Allah swt said: And (remember), when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then shower us with stones from the sky, or bring it to our painful doom.\" (al-Anfal\/8: 32) Their request is like the request of the people of Aikah (Madyan) to the Prophet Shuaib before, as Allah said: So drop us a lump from the sky, if you are of the righteous.\" (asy- Syu'ara'\/26: 187) 4. In order for the Messenger of Allah to bring Allah and angels in plain view (can be seen in real time) to them to declare directly that Muhammad is an apostle sent by Him 5. In order for the Messenger of Allah to build a house made of gold. The polytheists believed that an apostle sent by Allah should be a ruler, wealthy, and honorable. Therefore, in their opinion, it was impossible for Muhammad as an orphan and poor to be appointed as an apostle. 6. So that the Messenger of Allah peace be upon him ascended to the sky via a ladder that they could see, then descended back to the world via the same ladder carrying a book that they could read and use their own language which explains that Muhammad is the messenger of Allah. In fact, everything that the polytheists ask for is very easy for Allah to grant, there is nothing that is difficult or impossible for Allah to hold and do. But Allah knows that all these requests are just making it up, as an excuse not to believe in the Prophet Muhammad. The attitude of polytheists is explained in the word of Allah SWT: Indeed, those who have been confirmed to have received the decree of your Lord, will not believe, even though they receive signs (the greatness of Allah), until they witness a painful doom. (Yunus\/10: 96-97) And Allah said: And even though We sent down angels to them, and people who had died spoke to them and We collected (also) before them everything (they wanted), they neither will believe, unless Allah wills. But most of them do not know (the meaning of truth). (al-An'am\/6: 111) Allah swt ordered Muhammad to convey to the polytheists that he was only a human who was appointed as an apostle and was given revelation. Allah is able to fulfill all their requests, but His requests are not granted because they are not needed. Even if granted, they still would not believe."
		   },
		   {
			"id": 2122,
			"surah": 17,
			"ayat": 93,
			"tafsir": "These verses explain the attitude of the Quraysh leaders in facing the call of the Prophet Muhammad, they include Uthbah, Syaibah, Abu Sufyan, Nadhar, and others. Their attitude showed visible signs of their denial and reluctance to accept the call. As a result, no matter what evidence is presented to them, they will still not believe. They asked the Prophet for impossible things because they knew that the Prophet would not be able to do them. Thus there is a reason for them not to follow the Apostle's call. Among the requests of the disbelievers are: 1. So that the Messenger of Allah will emit a spring from the earth, even though their country is a desert. 2. In order for the Messenger of Allah to create a date or grape orchard flowed by rivers. With the water constantly flowing, the palm trees and grapevines will multiply and produce more than double. 3. In order for the Messenger of Allah to drop the sky into pieces so that it falls on them. Their request like this is explained in another verse. Allah swt said: And (remember), when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then shower us with stones from the sky, or bring it to our painful doom.\" (al-Anfal\/8: 32) Their request is like the request of the people of Aikah (Madyan) to the Prophet Shuaib before, as Allah said: So drop us a lump from the sky, if you are of the righteous.\" (asy- Syu'ara'\/26: 187) 4. In order for the Messenger of Allah to bring Allah and angels in plain view (can be seen in real time) to them to declare directly that Muhammad is an apostle sent by Him 5. In order for the Messenger of Allah to build a house made of gold. The polytheists believed that an apostle sent by Allah should be a ruler, wealthy, and honorable. Therefore, in their opinion, it was impossible for Muhammad as an orphan and poor to be appointed as an apostle. 6. So that the Messenger of Allah peace be upon him ascended to the sky via a ladder that they could see, then descended back to the world via the same ladder carrying a book that they could read and use their own language which explains that Muhammad is the messenger of Allah. In fact, everything that the polytheists ask for is very easy for Allah to grant, there is nothing that is difficult or impossible for Allah to hold and do. But Allah knows that all these requests are just making it up, as an excuse not to believe in the Prophet Muhammad. The attitude of polytheists is explained in the word of Allah SWT: Indeed, those who have been confirmed to have received the decree of your Lord, will not believe, even though they receive signs (the greatness of Allah), until they witness a painful doom. (Yunus\/10: 96-97) And Allah said: And even though We sent down angels to them, and people who had died spoke to them and We collected (also) before them everything (they wanted), they neither will believe, unless Allah wills. But most of them do not know (the meaning of truth). (al-An'am\/6: 111) Allah swt ordered Muhammad to convey to the polytheists that he was only a human who was appointed as an apostle and was given revelation. Allah is able to fulfill all their requests, but His requests are not granted because they are not needed. Even if granted, they still would not believe."
		   },
		   {
			"id": 2123,
			"surah": 17,
			"ayat": 94,
			"tafsir": "This verse explains that nothing prevented the Meccan polytheists from believing in the Prophet Muhammad when the revelations were sent down by Allah to him accompanied by various miracles, except for their wish that if Allah sent a messenger to humans, then the messenger must be an angel. , not an ordinary man. Meccan infidels in particular and infidels in general wondered why this revelation was revealed to an ordinary man like Muhammad, even an orphan. Why not pass it down to the smartest or richest among them or humans who have supernatural powers, angels, and so on. The attitude of the polytheists of Mecca was the same as that of the earlier people towards the apostles who were sent to them. Word of Allah swt: And are you surprised that there is a warning that comes from your Lord through a man from your own circle, to warn you and so that you are pious, so that you receive mercy? (al-A'raf\/7: 63)"
		   },
		   {
			"id": 2124,
			"surah": 17,
			"ayat": 95,
			"tafsir": "Allah rebutted the attitude of the Meccan polytheists by stating that if there were angels on this earth who walked, thought, lived, lived in society, had desires, had a culture, organized themselves, and so on, surely Allah would have sent angels as messengers. His, not human. This verse seems to warn unbelievers that the apostle sent by Allah is an ordinary human being but is able to convey His religious teachings to them, understand what they want, what they feel, what is good for them, and so on. . Not like angels who have no ambition in life like humans and only carry out what God commands them. Allah swt said: Indeed, Allah has given gifts to the believers when (Allah) sent a messenger (Muhammad) among them from among themselves, who read to them His verses, purified their (souls) , and taught them the Book (Al-Qur'an) and Wisdom (Sunnah), even though before, they were in clear error. (ali 'Imran \/ 3: 164)"
		   },
		   {
			"id": 2125,
			"surah": 17,
			"ayat": 96,
			"tafsir": "Allah ordered the Messenger of Allah to convey His threat to the disbelievers that Allah would be a witness of what was disputed between the Prophet and the polytheists of Mecca. Allah will be the judge who will judge their cases fairly in the hereafter because He knows everything they do, even what is in their hearts."
		   },
		   {
			"id": 2126,
			"surah": 17,
			"ayat": 97,
			"tafsir": "Allah swt explains in this verse that He is the one who controls and determines everything. He who gives guidance and taufik to whom He wills. People who do not accept His guidance and taufik, are people who go astray and will not find a helper other than Allah. Those who go astray will be gathered by Allah on the Day of Resurrection in a place to be brought to account. They were resurrected from the graves blind, mute and deaf, as they were before on earth did not see and hear the truth that was conveyed. The Prophet said: A man asked the Messenger of Allah, \"O Messenger of Allah how do people walk with their faces?\" The Messenger of Allah replied, \"He who runs them with their feet, of course has the power to run them with their faces.\" (Al-Bukhari and Muslim from Anas bin Malik) Abu Dawud and at-Tirmidhi narrated a hadith from Abu Hurairah: That there are three kinds of people on the day they gather in the Mahsyar field, some walk, some ride and some walk their faces. After they are finished being accounted for, they are put into the Hellfire and burned with a blazing fire because every time it is extinguished, the flame is added again. Every time their skin and body are charred and their flesh is destroyed, Allah replaces it with new skin, flesh and body, so that they will again feel the punishment that will not stop."
		   },
		   {
			"id": 2127,
			"surah": 17,
			"ayat": 98,
			"tafsir": "This verse explains that those who disbelieve are punished for denying the verses of Allah and the Day of Resurrection by saying, \"Is it possible for us to be resurrected again, after we die, our bodies are destroyed and crushed together with the ground, then our bones are scattered to become parts separate parts. Can the body parts be put back together and revived, so that we become new living things?\""
		   },
		   {
			"id": 2128,
			"surah": 17,
			"ayat": 99,
			"tafsir": "Allah swt rebuts the opinion of those who do not believe in the day of resurrection by saying that do they not see and pay attention to how Allah has created them from nothing to exist, as well as the heavens and all that is in them, and the earth with all the things and creatures that in it, including man himself. Do they not pay attention to all that is happening in the heavens and on earth? Everything was created from nothing to exist. If Allah swt is able to create everything for the first time, of course he can also create it for the second time because re-designing is usually easier than creating the first time. Allah has created for mankind a period of time that there is no doubt about it, determining the time for them to live in the world and in the grave, and the time for them to be resurrected. Only Allah is the All-Knowing of determining those times. Even though the proofs about the Day of Resurrection, the greatness, and the power of Allah have been presented and explained to the unjust disbelievers, they still deny and do not believe in these proofs."
		   },
		   {
			"id": 2129,
			"surah": 17,
			"ayat": 100,
			"tafsir": "In this verse, Allah swt explains the reasons why He did not allow the request of the unjust people, that is, even if it was allowed, they would still not believe, be miserly, and would not give a small portion of their wealth to others who needed it. They are afraid that the pleasures that have been obtained will disappear from them. Even though God's grace will never run out no matter how much humans take it. Allah has also promised those who spend their wealth in exchange for multiples of what they spend. Stinginess is a character and human nature with different levels. It is the character and character that is not good that causes humans to disobey Allah's commands and be reluctant to pay attention to His prohibitions. Allah's Word: And you love wealth with excessive love. (al-Fajr\/89: 20) And indeed his love for wealth is really excessive. (al-'adiyat\/100: 8)"
		   },
		   {
			"id": 2130,
			"surah": 17,
			"ayat": 101,
			"tafsir": "This verse explains that Allah swt gave nine kinds of miracles to Musa as proof of his apostleship, when he was sent to Pharaoh and his people. However, Pharaoh and his people still refused the call of the Prophet Musa to believe in Allah the Creator. In another verse, it is explained how Pharaoh and his people denied Musa's call. Allah swt says: And they deny it because of their tyranny and arrogance, even though their hearts believe in it (truth). So see how the end of those who do damage. (an-Naml\/27: 14) The exegetes differed on the meaning of the nine verses mentioned above. According to Ibn Abbas, as narrated by 'Abd Razzaq, Sa'id bin Mansur, Ibn Jarir ath-tabari, and Ibn Mundzir, that the nine verses are sticks, hands, typhoons, locusts, fleas, frogs, blood, dry season, and lack of fruit. This opinion was approved by the jumhur ulama. Other commentators, such as ar-Razi, are of the opinion that what is meant by the nine verses mentioned above are various prohibitions. He bases his opinion on the hadith of the Prophet narrated by Ahmad, at-Tirmidhi, al-Baihaqi, Ath-thabrani, an-Nasa'i, and Ibn Majah from shafwan bin Origin al-Muradi, when he was asked by the Jews, that what is meant by the nine verses here are nine kinds of prohibitions, namely: do not associate partners with Allah, do not kill a soul except by right, do not commit adultery, do not steal, do not bewitch, do not eat usury, do not slander innocent people against the authorities, do not accuse a good woman commits adultery, and breaks the law on the Sabbath. Ibn Syihab Al-Khafaji said, \"This is the tafsir followed in interpreting this verse.\" Allah ordered the Prophet Muhammad to ask about the story of Moses to the Jews who lived in his time, such as Abdullah bin Salam and others, they would undoubtedly confirm it. Their acknowledgment of the truth of the message of Prophet Musa will increase their faith and confidence. It was also intended that the Prophet saw be sure that the story is also contained in their book. Ask the Jews, of course they will explain that Musa (as) had come to Pharaoh with the monotheistic religion and presented his various miracles. However, Pharaoh denied this, even saying that Musa was a person whose mind was corrupted, so he claimed to be an apostle of Allah."
		   },
		   {
			"id": 2131,
			"surah": 17,
			"ayat": 102,
			"tafsir": "Musa told Pharaoh that actually Pharaoh already knew that the one who sent down these verses was God who owns the heavens and the earth. This was explained by Prophet Musa as evidence and information that what he was calling for was the truth. Only people who are clean in heart can accept the call. Furthermore, the Prophet Musa told Pharaoh that his heart was dirty and did not have the willingness to accept the call. Whatever truth is presented to him still will not make him accept the call."
		   },
		   {
			"id": 2132,
			"surah": 17,
			"ayat": 103,
			"tafsir": "After Pharaoh saw Musa's persistence in conveying his message, and this would endanger himself and his power, Pharaoh planned to expel Musa and his followers from the land of Egypt, either by expelling or eliminating them. However, Allah swt first drowned Pharaoh and his followers into the sea of Qulzum."
		   },
		   {
			"id": 2133,
			"surah": 17,
			"ayat": 104,
			"tafsir": "Then Allah swt saved Musa and the Children of Israel and ordered them to live in the land that had been promised to them until the appointed time. When the time comes, they will die and then be resurrected on the Day of Resurrection, to determine the fairest decision among them. At that time, they and their enemies mixed together and united to receive a reward from Allah. Good deeds will be rewarded with multiple rewards, while bad deeds will be rewarded with the torments of hell."
		   },
		   {
			"id": 2134,
			"surah": 17,
			"ayat": 105,
			"tafsir": "In this verse Allah swt confirms to the Prophet saw that Allah really has sent down the Qur'an from His side. So man should not doubt and turn away from it. In another verse, Allah swt says: But Allah bears witness to (the Qur'an) which He has sent down to you (Muhammad). He sent it down with His knowledge, and the angels watched. And Allah is sufficient as a witness. (an-Nisa'\/4: 166) The Qur'an contains various true teachings that bring order and prosperity to mankind. In it there are teachings about morals, divine creed, regulations, laws, history, and science. Everything in it is always maintained, both the pronunciation and the meaning will not be tarnished by additions or subtractions that cause chaos and confusion, as explained by Allah in His word: Verily, it is We who sent down the Qur'an, and surely We (also) who maintain it. (al-hijr\/15: 9) His words again: (Which) will not be visited by evil either from before or from behind (in the past and in the future), which was sent down from God, the Most Wise, Most Praised. (Fushshilat\/41: 42) Thus Allah explains the characteristics of the Qur'an with all guarantees of its purity from human hands who try to pollute it. He was sent down to the Prophet Muhammad who was sent to mankind to give good news about rewards and heaven for those who believe and obey religious teachings, and give warnings about doom and hell for those who disbelieve and commit sins."
		   },
		   {
			"id": 2135,
			"surah": 17,
			"ayat": 106,
			"tafsir": "In this verse, Allah SWT explains that the Qur'an was revealed to the Prophet Muhammad SAW gradually, part by part, so that he could read it to his people, and give understanding slowly. The verses of the Qur'an were first revealed in the month of Ramadan, on the night of qadar, then they were revealed to the Prophet gradually according to the needs and events that occurred in less than twenty-three years. With this gradual decline, Muslims gain great advantages and benefits, including: First: The Muslims can easily memorize it when it is revealed. Second: Muslims have the opportunity to understand each group of verses that were revealed, because the wide range of meanings requires sufficient time to understand them in order to get a proper and correct understanding. Third: Muslims do not experience significant emotional turmoil in facing the various changes brought about by Islam. Before the advent of Islam, they adhered to various animist beliefs, and had no rules and regulations to live by. The gradual reduction of the Qur'an made it easier for them to adapt to the new teachings, both teachings related to faith, as well as those related to worship and society. Fourth: Some of the verses of the Al-Qur'an are explanations related to an event that occurred. Word of Allah swt: And they (the disbelievers) do not come to you (bring) anything strange, but We bring to you the truth and the best explanation. (al-Furqan\/25: 33) Thus, Muslims feel that they are always guided and guided by Allah SWT when facing any events that occur between them. For the Prophet Muhammad, the gradual reduction of the Qur'an was very beneficial in strengthening his heart, as Allah explained in His word: And the disbelievers said, \"Why was the Qur'an not revealed to him all at once ?\" Thus, so that We strengthen your heart (Mu-hammad) with it and We recite it tartil (gradually, slowly and correctly). (al-Furqan\/25: 32) In general, the verses revealed ranged from five to ten verses as needed, as Umar bin Khaththab said: Narrated from Umar ra, he said, \"Learn the five verses of the Qur'an five verses, because actually Gabriel sent it down five verses five verses (Al-Baihaqi History)."
		   },
		   {
			"id": 2136,
			"surah": 17,
			"ayat": 107,
			"tafsir": "In this verse, Allah swt ordered His Messenger to declare emphatically to the polytheists who deny the truth of the Qur'an, that if they had faith, then their faith would not enrich the treasury of His grace. Vice versa, if they still deny, do not want to believe in the Qur'an, their denial and rejection will not reduce the majesty of Allah SWT. Allah's Word: And they said, \"We will not believe in you (Muhammad) until you bring forth springs of water from the earth for us. (al-Isra'\/17: 90) This statement of the Messenger of Allah is a reproach and condemnation of the polytheists, and contains insults to them. However their attitude towards the Qur'an, should not be cared for. The truth of the Qur'an does not depend on the attitude of those who deny it. It is not surprising that they reject the truth of the Qur'an, because they are ignorant people. But the good and educated people among them certainly believe and submit completely when they hear the verses of the Qur'an being recited. Like Zaid bin Amru bin Nufail and Waraqah bin Naufal who had read the previous holy books before The Qur'an was revealed, and they know that one day an apostle of the end times will be born. They bow down and give thanks to Allah SWT who has fulfilled His promise, namely to send Muhammad SAW as the Messenger of Allah. end. With the revelation of this verse, the Prophet Muhammad saw comforted his heart, because the faith of educated people is more meaningful than the faith of ignorant people, even though the faith of ignorant people is still expected."
		   },
		   {
			"id": 2137,
			"surah": 17,
			"ayat": 108,
			"tafsir": "In this verse, Allah SWT explains that those who have been given knowledge pronounce tasbih, namely the recitation of Subhanallah (Glory to Allah), when prostrating as a sign of gratitude to Allah SWT. They purify God of traits that are not worthy of Him, such as violating His promise to mankind to send an apostle. They also said that God's promise had actually come and come true. This verse shows the goodness of reciting tasbih in prostration. 'Aisyah ra said, \"The Messenger of Allah recited a lot in his prostration and bowing: Glory be to You, O Allah, our Lord, we exalt you with praise. O Allah, forgive me. (Muslim history in its Sahih)"
		   },
		   {
			"id": 2138,
			"surah": 17,
			"ayat": 109,
			"tafsir": "Then Allah swt added in this verse the praiseworthy qualities of those who were given that knowledge. They covered their faces, prostrating to Allah while weeping because of various feelings that stomped their chests, such as the feeling of fear of Allah, and feelings of gratitude for the birth of the promised apostle. The influence of the teachings of the Qur'an seeped into their souls when they heard the verses being recited, and increased their solemnity and humility. Thus, they feel how small humans are in the sight of Allah swt. Such is the nature of a knowledgeable person who has attained a noble dignity. His heart was subdued and his eyes filled with tears when the Qur'an was recited to him. Shedding tears when hearing or reading the Qur'an is highly commendable in the eyes of Islam. Rasulullah SAW said: Read the Qur'an and cry, if you can't cry, then try your best to cry. hell, that is, those who cry out of fear of Allah swt, and eyes that keep watch at night in the way of Allah (jihad). (Narrated at-Tirmidhi from Ibn 'Abbas) A person who cries out of fear of Allah will not enter hell, except when the cow's milk can return to the milk bag, and does not collect on a servant, dust in battle in the way of Allah with the smoke of hell fire . (History of Muslim and an-Nasa'i from Abu Hurairah)"
		   },
		   {
			"id": 2139,
			"surah": 17,
			"ayat": 110,
			"tafsir": "Sabab nuzul this verse, according to the history of Ibn Jarir ath-tabari from Ibn 'Abbas, that the Messenger of Allah was praying one day in Mecca, then he prayed. In his prayer, he uttered the words, \"O Allah, O Rahman.\" The polytheists who heard the Prophet's words said, \"Pay attention to this person who has left his religion, it is forbidden for us to pray to two Gods while he himself prays to two Gods. So this verse was revealed. According to the history of Adh-ahhak, because this verse was revealed is that the Jews asked the Prophet why he mentioned the word ar-Rahman so little, whereas in the Torah, Allah mentions it so much.\" Then come down this verse. If the background of this verse is revealed according to the first history, Allah will explain to the polytheists that the two pronunciations (Allah and ar-Rahman) although different, express the One and Only God, the only God to be worshiped. Such an understanding is in accordance with the explanation of verse 111. If the background of the revelation of this verse is the second history, then Allah explained to the Jews that the pronunciation is equally good for expressing what is meant. The Jews view the word ar-Rahman as better, because it is the attribute that Allah likes the most, so it is mentioned in the Torah a lot. Ar-Rahman is mentioned a lot in the Torah because Prophet Musa (as) was tough and angry. Therefore, Allah mentions ar-Rahman's words so that he gets along with his people with compassion, and he as a prophet certainly imitates Allah's qualities. In this verse, Allah swt explains about the oneness of His substance with good names. These good names only describe the attributes of His perfection, not the form of Allah who stands alone as the polytheists think. After stating the similarity of the two words, Allah confirms in this verse that the two pronunciations are good for prayer, because God has al-asma'ul husna (the best names). God provides explanations with al-husna (the best) for His names, because they contain meanings that include all the attributes of perfection, glory, and beauty that no creature resembles. The Jews actually did not deny the good names of God. It's just that they see ar-Rahman the best name among the other names of God. This is what is not justified in this verse because the two names include al-asma'ul husna. Opinions like the above are also shared by Muslims, where according to them, there is a higher name among al-asma'ul husna. It was narrated that the Messenger of Allah heard a man reciting a prayer: O Allah, I beg You, so that I truly testify that You are Allah, who has no god but You, the One and the place where all creatures depend. Who is childless and unborn and no one is equal to Him. (History of at-Tirmidhi from Abdullah bin Buraidah al-Aslami from his father) After hearing this prayer the Prophet said: By Allah, in whose hands is my soul, truly that man prays in the name of the Great God (al-asma' al-A'dham), which if Allah is called on by (mentioning) that name, surely He will complete it, and if Allah is asked by (mentioning) that name, He will surely give it. (History of Ibn Jarir ath-tabari from Sa'ad) It was also narrated by Muslim, Ahmad, at-Tirmidhi, and Ibn Abi Hatim from Asma' bint Yazid that the Prophet said: The Name of Allah Ta'ala, the Most Great is located in these two verses , namely: And your God is God Almighty, there is no god but Him, the Most Gracious, the Most Merciful. (al-Baqarah\/2: 163) And the second verse is at the opening of surahh ali 'Imran: Alif Lam Mim. Allah, there is no god but Him. The Ever-living One, Who is constantly taking care of (His creatures). (ali 'Imran\/3: 1-2) Then at the end of this verse, Allah ordered the Messenger not to read the verses loudly and not in a low voice during prayers, but between the two. What is meant by reading this verse includes reading the basmalah and other verses. If the Apostle read it aloud, the polytheists would have heard it and they would mock, criticize, and insult the Qur'an, the Prophet and his companions. But don't also read in a voice that is too low so that friends cannot hear it clearly. This prohibition came down when the Prophet was still in Mecca based on the history of Ibn 'Abbas. According to the history of Ibn 'Abbas, when the Apostle was in Mecca he was told to read verses in a voice that was not too loud but not too low, it was forbidden to read in a low and low voice so that it would not be heard. But after migrating to Medina, this issue was not discussed any more except that reciting verses in prayer out loud is still not justified."
		   },
		   {
			"id": 2140,
			"surah": 17,
			"ayat": 111,
			"tafsir": "In this verse, the Prophet was taught how to praise Allah, who has the qualities of oneness, perfection, and majesty. Therefore, only Allah has the right to receive all kinds of praise and gratitude from His servants and creatures for all the blessings given to them. This verse describes three characteristics for Allah swt: First: That Allah does not have children, because whoever has children certainly does not enjoy all the blessings he has, but some of these blessings are prepared for the children he leaves behind when he dies. Glory be to Allah swt from such traits. People who have children are prevented from enjoying all their rights in all circumstances. Therefore, humans do not deserve praise from all creatures. With this verse, Allah swt explains and refute the view of the Jews who say 'Uzair is the son of God, also the opinion of the Christians who say that Al-Masih is the son of God, or the opinion of the polytheists that angels are the daughters of God. Second: That Allah swt has no partner in His kingdom. If His partners were present, it would be difficult to determine which of the two deserved the praise, gratitude and devotion of beings. One of the two gods certainly needs help from the other and in the end there is no single god that stands alone and is absolutely sovereign over this world. Third: That in fact none of the despicable people is given power by Allah that will protect him from enemies who threaten him. Thus Allah swt is holy from all qualities that reduce His perfection, so that His servants do not hesitate to offer prayers, thanks and praise to Him. Then the Holy Prophet was ordered to glorify Him, both in word and deed. To glorify and sanctify Allah is as follows: First: To glorify Allah in His Essence by believing that Allah must exist in Him because His own substance does not need anything else. He doesn't need anything from this form. Second: Glorify Allah swt in His nature, believing that only He has all the characteristics of perfection and is far from the characteristics of deficiencies. Third: Glorifying Allah swt in His deeds (His actions) by believing that nothing happens in this world, but according to His wisdom and will. Fourth: Glorify Allah SWT in His laws, believing that only He is the Ruler who is obeyed in this universe, where orders and prohibitions originate from him. No one can limit and cancel all of His provisions for something. It is He who glorifies and He also humiliates those He wills. Fifth: Glorify His names, namely calling on and calling Allah with good names (al-asma'ul husna). Not characterizing God but with the attributes of holiness and perfection."
		   }
	]
}
