{
	"tafseer": [
		{
			"id": 4134,
			"surah": 40,
			"ayat": 1,
			"tafsir": "An explanation of the hijaiyah letters at the beginning of several surahhs in the Qur'an, such as at the beginning of this surahh, has been described at length at the beginning of surahh al-Baqarah. (See \"The Qur'an and Its tafsir\" Volume I)"
		   },
		   {
			"id": 4135,
			"surah": 40,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that the Holy Qur'an, which is the holy book for the Prophet Muhammad and his people, must practice its contents and instructions. It is the last holy book that justifies the previous holy books, and is truly revealed from Allah, Lord of the Worlds, God Almighty, no creature can beat Him, God knows everything, nothing is hidden. to God however small and subtle. Allah's Word: This book was sent down from Allah, the Almighty, the All-Wise. (al-A.hqaf\/46: 2) The Holy Qur'an could not have been made by other than Allah and it could not have been made by Muhammad as alleged by the enemies of Islam. This has been confirmed by Allah in the Qur'an with His words: And it is not possible that this Qur'an was fabricated by other than Allah. (Yunus\/10: 37) And His words: Is it appropriate for them to say he (Muhammad) made it up? (Yunus\/10: 38) In fact, the Holy Qur'an was revealed with various backgrounds, containing instructions for humans to bring humans out of darkness into bright light. Allah's Word: (This is) the Book that We sent down to you (Muhammad) so that you bring people out of darkness into bright light with God's permission, (that is) to the way of God Almighty, Most Praised. (Ibrahim\/14: 1)"
		   },
		   {
			"id": 4136,
			"surah": 40,
			"ayat": 3,
			"tafsir": "In this verse, five kinds of attributes of Allah are explained that sent down the Qur'an: 1. The Forgiving of Sins This attribute of Allah is also emphasized in another verse, as Allah says: Tell My servants that I am the Most Forgiving, Most Merciful . (al-hijr\/15: 49) And His word: Indeed, He is the Most Forgiving, the Most Merciful. (az-Zumar\/39: 53) No matter how many sins a person has, if he sincerely asks Allah for forgiveness, then Allah will forgive all his sins as explained in the hadith Qudsi as follows: O My servants, indeed you have made a mistake during the day and night, and I forgive them all sins, then ask forgiveness of Me, I will surely forgive them. (Muslim history from Abu dzarr) In another Qudsi hadith, Allah also emphasized: Allah said, \"O son of Adam! As long as you ask and hope in Me, then I will forgive the sins that are in you and I don't care anymore .O son of Adam! If your sins (piled up) and have reached the clouds of the sky, then you ask forgiveness from Me, I will surely forgive them and I do not care anymore.(Narrated at-Tirmidhi from Anas bin Malik) 2. Recipient of Repentance This attribute of Allah also emphasized in another verse in the Qur'an: Do they not know that Allah accepts the repentance of His servants (at-Taubah\/9: 104) Someone who has committed crimes such as persecution and others, then he repents, regrets his actions, strengthens his faith, does good, and remains in the way of Allah, then Allah will accept his repentance, as He says: the rhyme of repentance. (al-Ma'idah.\/5: 39) And His words: And indeed, I am Forgiving to those who repent, believe and do good, then remain in guidance. (thaha\/20: 82) And His word again: Except for those who have repented, made corrections and explained (it), they are the ones whom I accept their repentance and I am the Most Accepting of repentance, the Most Merciful. (al-Baqarah\/2: 160) 3. His Punishment Is Very Severe. Regarding this Allah said: ¦That all power belongs to Allah and that Allah is very severe in His punishment (they will surely regret it). (al-Baqarah\/2: 165) Those who do evil, wallow in sins such as denying and denying Allah's verses, taking the wrong path, that is, other than the path which He has shown and outlined, they are the ones who receive Allah's severe punishment and hard, as He says: They denied Our verses, so Allah punished them because of their sins. Allah is very severe His punishment. (ali 'Imran\/3: 11) In another verse Allah confirms: Truly, those who deny the verses of Allah will get a severe punishment. Allah Almighty again has a punishment. (ali 'Imran\/3: 4) And His word also: Indeed, those who stray from the path of Allah will receive a severe punishment, because they forget the day of reckoning. (shad\/38: 26) 4. Gift Giver. Every gift and favor we get is from God as His word: As a gift and favor from God. And Allah is All-Knowing, All-Wise. (al-hujurat\/49: 8) And His word: And all the favors that are in you (come) from Allah. (an-Nahl\/16: 53) No human being, in any way, can give a definite number of the many gifts and favors that Allah has given him, as His words: And if you count the favors of Allah, surely you can't count it. (an-Nahl\/16: 18) 5. Allah is One One of the characteristics of Allah that must be believed in is that He is One, there is no God but Him, there is no partner for Him, there is nothing similar to Him, as Allah says: There is nothing like Him. And He is All-Hearing, All-Seeing. (asy-Shura\/42: 11) If He had partners, there were other gods who had power equal to His power, then this world would be destroyed as Allah says: If in both (in the heavens and on earth) there were gods other than Allah , surely both have perished. Glory be to Allah who has the 'Throne, from what they attribute. (al-Anbiya'\/21: 22) Those who say that Allah is one of the three are among those who deny and disbelieve, because in fact Allah is One, there is no god but Him, Allah says: Indeed, people have disbelieved -people who say that Allah is one of the three, even though there is no god (who has the right to be worshiped) other than the One God. If they do not stop what they are saying, surely those who disbelieve among them will be afflicted with a painful punishment. (al-Ma'idah.\/5: 73) This verse ends with an assertion that all creatures will return to Allah and there will be perfected the reward for them according to their respective deeds as the word of Allah: And fear the day (when) you are all returned to Allah. Then everyone is given a perfect reward according to what he has done, and they are not wronged (harmed). (al-Baqarah\/2: 281)"
		   },
		   {
			"id": 4137,
			"surah": 40,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that only disbelievers are not happy with the truth, like to debate, oppose, and deny the contents of the Qur'an and accuse it of being nonsense. Among their sayings is that the Koran is just poetry, magic, myths of the ancients, or other belittling accusations. In fact, it is clear and known by the public that everything in the Qur'an is true. A debate that is questioning the contents of the Qur'an is a very disgraceful act and constitutes disbelief, as the words of the Prophet Muhammad: Debating the contents of the Qur'an is disbelief. (Ahmad's history from Abu Hurairah) As for debates that question something with the intention of finding and strengthening something that is right, explaining what is still vague, taking a legal understanding, rejecting ideas and beliefs that are distorted and not in accordance with Islamic teachings , as well as opposing the understanding that belittles the contents of the Qur'an, is a good and commendable deed. In fact, that is the act that is the duty of the prophets. At the end of this verse, Allah warns the Prophet Muhammad not to be deceived by the luxuries that his opponents got, their freedom of movement from one city to another, buying and selling and trading as they pleased so as to obtain wealth piled up. After all, all of that has a limit, and its temporary nature is equal to its lifespan at most. After that they will get a very painful torment in the hereafter. Allah's Word: Never be deceived by the activities of disbelievers (moving) throughout the country. It's just a temporary pleasure, then their place of return is hell. (Jahanam) is the worst place to live. (ali 'Imran\/3: 196-197)"
		   },
		   {
			"id": 4138,
			"surah": 40,
			"ayat": 5,
			"tafsir": "In this verse, Allah comforted the Prophet Muhammad so that he would not be anxious and upset about his people who always opposed and belied him. This is the sunatullah that applies to every prophet and messenger sent by God. Noah's people denied the Prophet Noah, as well as other people, have denied the prophets and apostles who were sent to them, such as the 'Ad, Samud, and others. In fact, apart from denying the apostles, they also planned a plot against the apostles. They fought against their apostles and persecuted at will. They never stop opposing, denying, and debating the apostles with false and unfounded reasons. Among their words were that the apostles were ordinary people like them too, with the intention of releasing the truth, obscuring the rights that come from Allah, and always turning off and extinguishing the light (religion) of Allah, as Allah said: They want to extinguish the light Allah's (religion) with their mouths (sayings), but Allah rejects it, instead wants to perfect His light, even though the disbelievers do not like it. (at-Taubah\/9: 32) Allah does not remain silent seeing the evil deeds that show their moral depravity. They were punished with very painful torments and destroyed by Allah, some were even destroyed so that it was as if they had never existed on this earth. The people of Muhammad saw, especially the residents of Mecca, can see the traces of their destruction as narrated in the Qur'an: And indeed you (people of Mecca) will really pass through their (traces) in the morning, and at night . Then why don't you understand? (ash-shaffat\/37: 137-138)"
		   },
		   {
			"id": 4139,
			"surah": 40,
			"ayat": 6,
			"tafsir": "This verse shows how people in the past were punished and destroyed because of their unfair treatment of their prophets and messengers. Thus, this also applies to the people of the Prophet Muhammad who continued to disobey, deny, and deny the verses of Allah. In the afterlife, they will be put into hell. Allah's Word: As for those who disbelieve and deny Our verses, they are the inhabitants of hell. They live in it. (al-Baqarah\/2: 39)"
		   },
		   {
			"id": 4140,
			"surah": 40,
			"ayat": 7,
			"tafsir": "This verse explains that the angels who carry the Throne and the angels around him always purify Allah, give thanks for His blessings of faith, and acknowledge that there is no God who is worshiped except Him. The angels also ask for forgiveness for those who acknowledge the oneness and holiness of Allah from worship other than Him. Regarding how the angels carried the Throne and how many of them carried it, it is sufficient for us to believe as it is and return it to God's knowledge, because this includes matters for which no details can be found, both in the Al-Qur'an and in the hadiths which mutawatir. Besides purifying and praising Allah, the angels also always pray for the believers. These prayers, among other things, describe the following: First, that God's knowledge encompasses everything. Allah's mercy includes the forgiveness of their sins and mistakes and God's knowledge includes their actions, speech and movements. It is easy for Allah to forgive sins and mistakes because His mercy is wider and greater than sins and mistakes. There is no deed even in a dark place, not a word or utterance, not even the conscience or the whisper of the soul, there is no deed or movement unless it is known by Allah. Second, asking Allah for forgiveness for those who repent, stop the sins that have been committed, follow what they are told to do, practice good deeds, and leave bad things. Third, the angels also begged the believers to be protected from the torments of the Hellfire according to God's promise."
		   },
		   {
			"id": 4141,
			"surah": 40,
			"ayat": 8,
			"tafsir": "In this verse, the next angel's prayer for believers is explained: Fourth, the angels ask the believers to be admitted to heaven 'Adn, which was promised by Allah through the words of His messenger. The angels also asked that righteous people be included with them among their fathers, wives, and their descendants, so that they may feel happy because they gather with their families in a place where they can give joy and pleasure, cause joy and happiness. very effective like. Sa'id bin Jubair explained that when a man enters heaven he says, \"O God! Where are my father, grandmother and mother? Where are my children and grandchildren? Where is my wife?\" The answer was that they did not do good deeds like what they had done. He then said, \"O my God! I do good for myself and for them.\" So they were equalized in heaven and he then read this verse. In line with this verse the word of Allah: And those who believe, along with their children and grandchildren who follow them in faith, We bring them together with their children and grandchildren (in heaven), and We do not reduce the reward of their deeds (virtue) in the least. Everyone is bound by what he does. (ath-thur\/52: 21) This verse closes with the assertion that Allah is Almighty, there is nothing that can hinder His will, All-Wise, He does nothing except according to the wisdom of His wisdom."
		   },
		   {
			"id": 4142,
			"surah": 40,
			"ayat": 9,
			"tafsir": "This verse still explains the next angel's prayer for the believers. Fifth, the angels not only ask forgiveness for the believers from their sins after repentance, but also the sins and retribution for the evil deeds they did before they repented so that they will be erased and not be punished for it. Those who are forgiven, pardoned, and repaid for their crimes in this world are erased, it means that they have received grace from Allah and are freed from His punishment and torment on the Day of Judgment. Such a thing is a very big victory because with that meager good deed, he gets endless favors and bounties."
		   },
		   {
			"id": 4143,
			"surah": 40,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that in the hereafter the disbelievers who are in hell will experience a very painful punishment, hate each other and curse one another. They even hate themselves because of the deeds they have done in the world that cause them to go to hell. However, the angel said to them, \"Indeed Allah's hatred when you reject the call of the prophets is greater than your hatred for yourself when facing the torments of hell.\" Allah's Word: On that day intimate friends will be enemies with one another, except for those who are pious. (az-Zukhruf\/43: 67) And His words: ¦Then on the Day of Judgment some of you will deny and curse each other ¦ (al-'Ankabut\/29: 25)"
		   },
		   {
			"id": 4144,
			"surah": 40,
			"ayat": 11,
			"tafsir": "After hearing the angel's cry and unable to bear the painful punishment any longer, the disbelievers said, \"O God, you have killed us twice and brought us back to life twice. You made us dead and then revived us by blowing a spirit into us. our mother's womb, then put us to death in this world after our death ends, and in the hereafter we will be revived by returning our spirits to be resurrected. The Word of Allah: How do you disbelieve in Allah, when you (were) dead, then He revived you, then He puts you to death and then He brings you back to life. (al-Baqarah\/2: 28) Humans die when they are still fetuses and are in the bodies of their parents. Then they are revived when they are born into the world, then the next death is a must. After that, they are revived on the day Resurrection (Day of Judgment). They experienced two lives and two deaths. After witnessing Allah's power, they killed and revived me concocted again and again, the disbelievers came to their senses. They acknowledged the faults of the world in denying the day of Resurrection and worked countless sins to atone for them. They ask to be expelled from hell and returned to the world to do good deeds and will not do mistakes and sins again. Requests like this are also mentioned in other verses as Allah says: And (what a horror), if you saw those who sinned bowed their heads before their Lord, (they said), \"O our Lord, we have seen and heard , then return us (to the world), surely we will do good deeds. Indeed, we are people who believe.\" (as-Sajdah\/32: 12) O our Lord, remove us from it (return us to the world), if we still return (to disbelief), indeed, we are the wrongdoers.\" (al-Mu'minun \/23:107)"
		   },
		   {
			"id": 4145,
			"surah": 40,
			"ayat": 12,
			"tafsir": "In this verse it is explained that their request could not possibly be permitted by Allah. They will not be returned to the world, because their hearts no longer accept the truth. In the world, they disbelieve and deny when called upon to worship only Allah alone, but when Allah is associated with others, they believe and justify it. Their request to get out of hell and be returned to the world to do good deeds, was answered by Allah with His words: He (Allah) said, \"Stay in it with contempt, and do not talk to Me.\" (al-Mu'minun\/23: 108) If their requests were allowed and returned to the world, they would still do things that were forbidden by Allah as before. They are liars, as Allah says: \"If they were returned to the world, they would certainly repeat what they were forbidden to do. They are truly liars.\" (al-An'am\/6: 28) This verse closes with the firmness that the decision on the Day of Judgment is in the hands of Allah who will give a right and just decision, God, the Most High and Greatest, has nothing equal to Him. God really hates those who associate partners with Him and has implemented a policy that is to eternalize them in hell."
		   },
		   {
			"id": 4146,
			"surah": 40,
			"ayat": 13,
			"tafsir": "This verse explains that Allah shows signs of His power, such as winds, clouds, thunder, lightning, lightning, sun, moon, stars, and so on. He is also the one who sends down rain from the sky, so trees grow that produce fruits of various colors, tastes, shapes, and occurrences. All of that shows the power of God. Only people who return to Allah and obey Him can take inspiration from the signs mentioned above, and understand that all of them are signs and proofs of Allah's power and oneness."
		   },
		   {
			"id": 4147,
			"surah": 40,
			"ayat": 14,
			"tafsir": "At the end of the verse above it is stated that people who are aware of Allah's power and oneness are only those who return to Him. We should sincerely worship and ask Him, purify our worship of Him, and not associate it with others, as explained in the hadith narrated by al-Bukhari and Muslim from 'Abdullah bin Zubair: That the Messenger of Allah after completing the fardu prayer recited La ilaha illallah ¦and so on (meaning) There is no god but Allah, there is no partner for Him. To Allah alone is all dominion, to Him is all praise, and He is Almighty over all things. There is no power and strength except with Allah's help. There is no God but Allah. We do not worship except Him. To Him all enjoyment, grace, and good praise. There is no god but Allah, by sincerely serving Him, even though the disbelievers don't like it. (History of al-Bukhari and Muslim from 'Abdullah bin Zubair)"
		   },
		   {
			"id": 4148,
			"surah": 40,
			"ayat": 15,
			"tafsir": "In this verse, Allah mentions His three glory and majesty, after mentioning in the previous verse the signs of His greatness and oneness. a. His highest rank. Allah is much higher and more majestic than all that exists. Because, everything other than Allah wishes to Him and not vice versa. He is eternal and eternal, has no beginning and no end. He knows everything, as explained in the Qur'an: And the keys of all that is unseen are with Him; no one knows but Him. (al-An'am\/6: 59) b. Have 'Throne. Allah owns the Throne and He rules over Him. He is the master of matter and non-things. c. Lowering the revelation. Allah sends down His revelation containing commands, either in the form of orders or prohibitions to those He wills and conveys His laws to those He wills. Such a thing is also stated in other verses as Allah says: He sends down angels bringing revelation with His commands to whom He wills among His servants, (by saying) namely, \"Warn (My servants) , that there is no god but Me, so be fearful of Me.\" (an-Nahl\/16: 2) And His words: And indeed, (the Qur'an) is really sent down by the Lord of all the worlds, Which was brought down by Ar-Ruh Al-Amin (Gabriel), into your heart (Muhammad) so that you may be among those who warn. (asy-Syu'ara'\/26: 192-194) Allah sends down revelation to warn people about the existence of the Day of Judgment, when those who worship and those who are worshiped meet, settle everything, all matters that have not been completed in this world."
		   },
		   {
			"id": 4149,
			"surah": 40,
			"ayat": 16,
			"tafsir": "On the Day of Resurrection, people will come out of their graves. Not the least of their deeds are hidden from Allah, all of them are known to Him. Then they receive a reward according to their deeds, if they are good, they will be rewarded with good and if they are bad, they will be rewarded with punishment and torment. Allah's Word: On that day you will be presented (to your Lord), nothing will be hidden from you (to Allah). (al-haqqah\/69: 18) At that time, Allah said, \"To whom shall the kingdom be on that day?\" No one in Padang Mahsyar answered it. Then Allah answered Himself with His words, \"Belongs to Allah, the One and Only, He has no partners. The Almighty conquers all things with His power and might.\""
		   },
		   {
			"id": 4150,
			"surah": 40,
			"ayat": 17,
			"tafsir": "Even though Allah is Almighty and Mighty, and no one can and is able to hinder His will, yet He still treats His servants fairly. In the hereafter, Allah rewards everyone according to their efforts and deeds in this world. No one was abused or harmed on that day. Those who do good are rewarded well without being reduced in the least, and those who do evil are rewarded according to their evil deeds. There will not be added the slightest reward for the crimes he has committed. No one has been postponed and postponed reckoning and calculation of charity. God is very fast calculation. There is no reckoning and reckoning as fast as Allah's reckoning. He accounts for all of His creatures as if only one person, because His knowledge is very broad, covering everything that exists. It is no different when He creates and raises man from the grave simultaneously, as Allah says: Creating and resurrecting you (for Allah) is just like (creating and resurrecting) one soul (easy). (Luqman\/31: 28) And His words: And Our command is only (with) one word like the twinkling of an eye. (al-Qamar\/54: 50)"
		   },
		   {
			"id": 4151,
			"surah": 40,
			"ayat": 18,
			"tafsir": "In this verse, Allah explains that He ordered the Messenger of Allah to warn his polytheistic people of the coming of the Doomsday which is not far off. Therefore, they are reminded to stop doing evil deeds that are prohibited by religion, and to correct their misguided beliefs, which will cause them to be punished later in the hereafter with a painful punishment. On that day, the situation was very terrible and frightening, the grief was beyond immeasurahble so that the heart felt congested up to the throat, breathing went up and down, lives went in and out until they met their death. No one can help those who have wronged themselves by associating partners with Allah, and no defender seeks intercession."
		   },
		   {
			"id": 4152,
			"surah": 40,
			"ayat": 19,
			"tafsir": "In this verse, Allah explains that He knows the visions of treacherous eyes and deceitful views. A treacherous eye is an eye sight on things that are forbidden secretly so that no one else knows. Ibn 'Abbas gave an example of the vision in the eyes of a traitor, as narrated by Ibn Abi Hatim, Ibn Abi Syaibah, and Ibn al-Mundzir that a person is in the midst of his people, so a woman passes near them. He showed his people that he closed his eyes and did not see the woman passing by. If his people did not pay attention to him, he opened his eyes to see the woman. But when his people saw him, he lowered his head again to hide his gaze. Allah knows that in the man's heart is hidden the intention of wanting to see the nakedness of the woman who is passing by. Allah's Word: And Allah is All-Knowing of all that is in the heart. (at-Tagabun\/64: 4) And His words: Say, \"If you hide what is in your heart or reveal it, Allah will know it.\" (ali 'Imran \/ 3: 29) If what is hidden like a whisper of the heart is known by Allah, of course, even more so that which is real and is around us, that is in the heavens and on earth, which is sent down from the sky and what rises from it as word of Allah: ¦ He knows what is before them and what is behind them¦ (al-Baqarah\/2: 255) And His word: He knows what is in the heavens and on earth, and knows what you keep secret and what what you stated. (at-Tagabun\/64: 4) And His word again: He knows what goes into the earth, what comes out of it, what comes down from the sky and what goes up to it. (Saba'\/34: 2)"
		   },
		   {
			"id": 4153,
			"surah": 40,
			"ayat": 20,
			"tafsir": "In this verse, Allah says that He will judge fairly those who are treacherous and deceitful in their eyesight, and who hide in their hearts evil intentions and desires. Allah rewards those who close their eyes in heaven to avoid seeing what is forbidden, and rewards painful punishments for those who repeat their visions and determine in their hearts to do something that is prohibited by religion. No one was harmed. As a result of one's actions will return to each of them, will not be wronged in the slightest as Allah says: Whoever does good then (the reward) is for himself and whoever does evil then (his sin) becomes his own responsibility. And your Lord does not wrong his servants at all. (Fushshilat\/41: 46) As for the idols and other idols worshiped by the polytheists, they are powerless and cannot be punished with anything, because they do not know anything and do not have the slightest power. At the end of this verse, it is emphasized that Allah is All-Hearing all utterances, both real and whispered even the whispers of the heart, He hears them. Allah is All-Seer of all that a person does both in a bright place and in a dark place."
		   },
		   {
			"id": 4154,
			"surah": 40,
			"ayat": 21,
			"tafsir": "In this verse, Meccan infidels who deny the truth of the message of the Prophet Muhammad are asked to visit the ruins of the historical relics of the previous peoples who had been destroyed by Allah. They could see it every time they passed the place on their trade trips north or south. They are nations that are physically stronger than the infidels of Mecca, for example, the 'Ad, the Samud, and others. Besides being physically stronger, they are also blessed by Allah for prosperity, a large population, excellence in building, expertise in agriculture, and so on so that they are advanced and have a high culture. However, the progress and high culture that they had made them arrogant and forgetful and then lied to the apostles who were sent to them, even among the apostles they injured and even killed them. Because of that sin and out-of-bounds treatment, God passed judgment on them. Their farms were destroyed, magnificent buildings were laid waste, and property was destroyed, so that they suffered and were miserable. Nothing can stop the destruction they are in, and nothing can help them from suffering. This should be a lesson for the Meccan infidels, and anyone who came after them, that humans who disobey Allah will definitely punish them, both in this world and in the hereafter."
		   },
		   {
			"id": 4155,
			"surah": 40,
			"ayat": 22,
			"tafsir": "The main cause of Allah dropping the doom is their disbelief. They do not want to accept the truth brought by the apostles, that there is no god but Allah, humans need to do good in life in this world, and there is a day after where humans will receive the reward for their actions. What the prophets conveyed was the absolute truth and could not be disputed, but they opposed it. When Allah punishes, then His punishment is very severe. Because of that disobedience, Allah destroyed them. That is the result of defiance of religious truth. These events should be a lesson for the Meccan infidels who disobeyed the invitation of the Prophet Muhammad. They should immediately realize and stop their rebellion because they too can suffer the same fate as the previous people."
		   },
		   {
			"id": 4156,
			"surah": 40,
			"ayat": 23,
			"tafsir": "In these two verses it is emphasized that the Prophet Musa was sent by Allah as His Messenger to Pharaoh, Haman and Karun to call them to faith. Pharaoh was the King of Egypt who saw himself as God. Haman was the prime minister. Meanwhile, Karun was the richest merchant and billionaire at that time. The three of them are specifically mentioned in this verse, because they were personally responsible for the influence they had on the people of Egypt to belie the Prophet Musa and worship Pharaoh. If these three people have faith, then the people of Egypt will soon believe too. Prophet Musa was sent by God to them with the teachings in the Torah holy book and the miracles given to him. The essence of the teachings that the Prophet Musa conveyed to them was to believe in God Almighty, do good, and believe in the afterlife where humans will receive the reward for their deeds. His miracles include a stick turning into a snake and his hands glowing. However, they rejected this teaching and disobeyed, even claiming to be God. The series of events preaching the Prophet Musa to Pharaoh, among others, is expressed in the following verses: Has the story of Musa reached you (Muhammad)? When God called him (Moses) in the holy valley, namely the Tuwa Valley; go to Pharaoh! Verily he has exceeded the limit, then say (to Pharaoh), \"Is there your desire to cleanse yourself (from misguidance), and I will lead you to the way of your Lord so that you fear Him?\" Then (Moses) showed him a great miracle. But he (Pharaoh) denied and disobeyed. Then he turned away while trying to challenge (Moses). Then he gathered (his chiefs) and called (calling his people). (While) said, \"I am your most high god.\" So Allah punished him with punishment in the hereafter and torment in this world. Indeed, in that there is a lesson for those who fear (of Allah). (an-Nazi'at\/79: 15-26) Witnessing the miracles of Prophet Musa and his invitation to believe, Fir'awn accused Prophet Musa of being a magician and a big liar. In another verse it is stated that Pharaoh accused Prophet Musa of being a witch and madman: But he (Pharaoh) and his army turned and said, \"He is a magician or a madman.\" (adz-dzariyat\/51:39) The accusation was made by Pharaoh after his sorcerers were unable to defeat the miracle of the Prophet Musa, namely his staff which turned into a snake and swallowed snakes coming from the mines which were bewitched by the experts. the magic. Even the sorcerers turned away from Pharaoh and believed in Allah."
		   },
		   {
			"id": 4157,
			"surah": 40,
			"ayat": 24,
			"tafsir": "In these two verses it is emphasized that the Prophet Musa was sent by Allah as His Messenger to Pharaoh, Haman and Karun to call them to faith. Pharaoh was the King of Egypt who saw himself as God. Haman was the prime minister. Meanwhile, Karun was the richest merchant and billionaire at that time. The three of them are specifically mentioned in this verse, because they were personally responsible for the influence they had on the people of Egypt to belie the Prophet Musa and worship Pharaoh. If these three people have faith, then the people of Egypt will soon believe too. Prophet Musa was sent by God to them with the teachings in the Torah holy book and the miracles given to him. The essence of the teachings that the Prophet Musa conveyed to them was to believe in God Almighty, do good, and believe in the afterlife where humans will receive the reward for their deeds. His miracles include a stick turning into a snake and his hands glowing. However, they rejected this teaching and disobeyed, even claiming to be God. The series of events preaching the Prophet Musa to Pharaoh, among others, is expressed in the following verses: Has the story of Musa reached you (Muhammad)? When God called him (Moses) in the holy valley, namely the Tuwa Valley; go to Pharaoh! Verily he has exceeded the limit, then say (to Pharaoh), \"Is there your desire to cleanse yourself (from misguidance), and I will lead you to the way of your Lord so that you fear Him?\" Then (Moses) showed him a great miracle. But he (Pharaoh) denied and disobeyed. Then he turned away while trying to challenge (Moses). Then he gathered (his chiefs) and called (calling his people). (While) said, \"I am your most high god.\" So Allah punished him with punishment in the hereafter and torment in this world. Indeed, in that there is a lesson for those who fear (of Allah). (an-Nazi'at\/79: 15-26) Witnessing the miracles of Prophet Musa and his invitation to believe, Fir'awn accused Prophet Musa of being a magician and a big liar. In another verse it is stated that Pharaoh accused Prophet Musa of being a witch and madman: But he (Pharaoh) and his army turned and said, \"He is a magician or a madman.\" (adz-dzariyat\/51:39) The accusation was made by Pharaoh after his sorcerers were unable to defeat the miracle of the Prophet Musa, namely his staff which turned into a snake and swallowed snakes coming from the mines which were bewitched by the experts. the magic. Even the sorcerers turned away from Pharaoh and believed in Allah."
		   },
		   {
			"id": 4158,
			"surah": 40,
			"ayat": 25,
			"tafsir": "Prophet Musa explained to Pharaoh, Haman, and Karun about Allah as God Almighty and the obligation of humans to believe and do good, as well as about His apostleship. However, they were furious. They did not want to accept what the Prophet Musa said because it was contrary to the belief that had been instilled in the people of Egypt that God was Pharaoh. Also because the teachings brought by the Prophet Musa could endanger their power and position. Then they ordered that the sons of the Children of Israel be killed and spared their daughters. The order to kill the sons of the Children of Israel is the second commandment. The first order was issued by Pharaoh on the advice of his astrologers who interpreted his dream that from among the Children of Israel a son would be born who would overthrow him and tear down his kingdom. The purpose of the killing was to weaken the Children of Israel, because their men would be finished, while their women would be overpowered. It also aims to exterminate the Bani Israil ethnic from the land of Egypt because they can defeat the native Egyptians themselves. However, God had other plans. With His plan, Allah actually made Musa, who was still a baby, raised and raised in Pharaoh's own palace as his son. As an adult, Moses had to get out of Egypt because his life was threatened by killing an Egyptian. The second order for the killing of every male baby from the Children of Israel was issued by Pharaoh after the Prophet Musa returned to Egypt as a prophet ordered by Allah to awaken Pharaoh and invite him to believe. According to Ibn Kathir, Pharaoh's aim in killing the son of the Children of Israel was to instill dissatisfaction with him among the followers of Prophet Musa himself. Because with the second death threat, it meant that Prophet Musa had caused them two difficulties, firstly when Prophet Musa was not born and secondly after he became a prophet who called on Pharaoh. In Pharaoh's mind, if the Children of Israel were not satisfied with him, then the Prophet Musa would be defeated by his own people. That possibility is narrated in the Qur'an: They (the people of Moses) said, \"We were oppressed (by Pharaoh) before you came to us and after you came.\" (Moses) replied, \"Hopefully your Lord will destroy your enemies and make you caliphs on earth; then He will see how you do.\" (al-A.'raf\/7: 129). However, that aim was not achieved. The second plan to kill the sons of the Children of Israel failed miserably, because Allah sent down various calamities as His punishment, such as the coming of a terrible typhoon, the emergence of attacks by locusts, fleas, frogs, and water that turned into blood (see al-A .'raf\/7:133). The intention to prevent people from believing in the Prophet Musa and the teachings he conveyed also failed, because the truth is impossible to deny and Allah's will must come true as He said: Allah has decreed, \"I and My apostles will surely prevail.\" Truly, Allah is Powerful, Mighty. (al-Mujadilah\/58: 21)"
		   },
		   {
			"id": 4159,
			"surah": 40,
			"ayat": 26,
			"tafsir": "Pharaoh not only intended to weaken the Children of Israel and eliminate his ethnicity, but also wanted to destroy the monotheistic religion by killing Prophet Musa himself. He declared to his followers that he himself would carry out the killing and for that he asked not to be hindered. He was sure that he could immediately kill the Prophet Musa. Therefore, he challenged the Prophet Musa to ask his Lord for help. The background to Pharaoh's plan to kill Prophet Musa was his concern that Prophet Musa would exchange the religion of the Egyptian people with the religion of monotheism he taught. Or, he was worried that Prophet Musa would change the beliefs, habits, and customs of his people and would eventually incite his people to rebel against him so that he would lose his power."
		   },
		   {
			"id": 4160,
			"surah": 40,
			"ayat": 27,
			"tafsir": "When the Prophet Musa received news about Pharaoh's plot to kill him, he told his people that he took refuge in Allah, his Lord and their God too. Prophet Musa was sure that Allah would protect him because he was on the right side, while Pharaoh was arrogant, evil, cruel, did anything arbitrary in Egypt, killed innocent people, and recognized himself as a god who must obeyed all his orders. Pharaoh's action was motivated by disbelief in the existence of the next day, where every small act will be held accountable. Pharaoh did not believe in the existence of the next day, so he did not believe that if he acts cruelly in this world, he will be rewarded in the hereafter. Such is the result of disbelief. Humans will act arbitrarily in this nature, which can result in this nature being destroyed."
		   },
		   {
			"id": 4161,
			"surah": 40,
			"ayat": 28,
			"tafsir": "Scholars of tafsir narrate that the believing man mentioned in this verse is an Egyptian from the Pharaoh's family. His name is not clear, but Ibn Kathir narrated from Ibn Abi Hatim that he was the son of Pharaoh's uncle who believed secretly in the Prophet Musa. None of Pharaoh's family believed other than the person mentioned in this verse and Pharaoh's own wife named Asiah. It was this man who told Prophet Musa about Pharaoh's plot to kill him. Thus the history of the source of Ibn 'Abbas. However, al-Khazin, as well as an-Nasafi narrated from Ibn 'Abbas sources that the man's name was Sam'an or Habib. There are also those who call it Kharbil or Hazbil. What the scholars agreed on was that the man was the son of Pharaoh's uncle. The man of faith advised Pharaoh with wisdom, \"Should it be right to kill someone who claims to have faith in Allah, while he has conveyed reasons and concrete evidence about what he believes in?\" He continued that if the Prophet Musa lied, then the consequences of his lies would be borne by himself. However, if the Prophet Musa was right, while he had been tortured or killed, then some of those who were threatened with those who tortured or killed them would be accepted in this world as well, and in the hereafter they would go to hell. He then emphasized that Allah will not guide people who act arbitrarily and lie. That is, Prophet Musa believed and brought proofs of his faith, while those who were arbitrary and deceitful were Pharaohs. Therefore, the one who will not get guidance is Pharaoh. Not getting guidance means that you will be miserable in this world and in the hereafter you will go to hell. Thus those who will be miserable in this world and go to hell in the hereafter are Pharaohs"
		   },
		   {
			"id": 4162,
			"surah": 40,
			"ayat": 29,
			"tafsir": "Furthermore, the man of faith advised his people, the people of Egypt that they had been given great favors by Allah. Egypt has been a great empire that is respected and influential. Therefore, these blessings must be maintained by believing in Allah, and if they also disbelieve, then it is feared that this greatness will collapse and they will suffer. \"Who will help us when the disaster comes?\" he said. Such was the advice of the believing man to Pharaoh and his people. But the advice was not accepted by Pharaoh. He stated that what he said had to be accepted and implemented, and what he said and ordered was what was good and right. Thus, Pharaoh imposed his will and again acted arbitrarily. Pharaoh's answer was actually not true, because in his heart, he actually confirmed what the Prophet Musa had said. His words were actually only driven by tyranny and arrogance as stated in the following verse: And they denied him because of his tyranny and arrogance, even though their hearts believed in his (truth). (an-Naml\/27: 14) What Pharaoh said that what he ordered his people was good, so that the Prophet Musa had to be killed, was also far from the truth. That's because it's not true that by killing someone the problem will be solved, especially since the one who was killed was an apostle of Allah. The action was actually misguided and misleading, as stated in the following verse: And Pharaoh has led his people astray and did not give guidance. (thaha\/20: 79). However, Pharaoh's followers accepted and obeyed his orders even though they were wrong, as revealed in the following verse: To Pharaoh and the leaders of his people, they followed Pharaoh's orders, even though Pharaoh's orders were not (orders) correct. (Hud\/11: 97) Pharaoh's actions in deceiving his people and forcing them to follow his orders, as well as instigating them to lie to Allah's Apostle, became a lesson for the leaders. Leaders who want to hinder and distance people from the teachings of their religion may suffer the same fate as the Pharaoh. In this case the Prophet gave advice: There is no death of an imam (a leader), where on the day of his death he has deceived his people, but he will not smell heaven. Indeed, the fragrance of heaven can be smelled from a distance of five hundred years of travel. (History of al-Bukhari and Muslim)"
		   },
		   {
			"id": 4163,
			"surah": 40,
			"ayat": 30,
			"tafsir": "The believing man from the Pharaoh's family told his people that he was very worried if they did not want to believe and instead followed Pharaoh's orders. They will suffer the same fate as that which befell the previous nations. These people opposed and belied the apostles sent by God, such as the people of Noah, the people of 'Ad, Samud, and the people after him. All of them have been destroyed by Allah with various disasters as doom, and no one can fend off or save themselves. That is what yaumul ahzab means in this verse. Such is Allah's punishment for those who disbelieve in the world. God did not act wrongly with the annihilation, but it was they who wronged themselves by carrying out acts that earned His wrath. Allah only passed judgment when the apostles had conveyed their message perfectly, and they could not be repaired after being advised many times. This incident should be used as a lesson by the people. The man hoped that his advice would be accepted by his people and that they would believe in the Prophet Musa, not to disobey him, let alone kill him"
		   },
		   {
			"id": 4164,
			"surah": 40,
			"ayat": 31,
			"tafsir": "The believing man from the Pharaoh's family told his people that he was very worried if they did not want to believe and instead followed Pharaoh's orders. They will suffer the same fate as that which befell the previous nations. These people opposed and belied the apostles sent by God, such as the people of Noah, the people of 'Ad, Samud, and the people after him. All of them have been destroyed by Allah with various disasters as doom, and no one can fend off or save themselves. That is what yaumul ahzab means in this verse. Such is Allah's punishment for those who disbelieve in the world. God did not act wrongly with the annihilation, but it was they who wronged themselves by carrying out acts that earned His wrath. Allah only passed judgment when the apostles had conveyed their message perfectly, and they could not be repaired after being advised many times. This incident should be used as a lesson by the people. The man hoped that his advice would be accepted by his people and that they would believe in the Prophet Musa, not to disobey him, let alone kill him"
		   },
		   {
			"id": 4165,
			"surah": 40,
			"ayat": 32,
			"tafsir": "The believing man from the Pharaoh's family told his people that he was very worried if they did not want to believe and instead followed Pharaoh's orders. They will suffer the same fate as that which befell the previous nations. These people opposed and belied the apostles sent by God, such as the people of Noah, the people of 'Ad, Samud, and the people after him. All of them have been destroyed by Allah with various disasters as doom, and no one can fend off or save themselves. That is what yaumul ahzab means in this verse. Such is Allah's punishment for those who disbelieve in the world. God did not act wrongly with the annihilation, but it was they who wronged themselves by carrying out acts that earned His wrath. Allah only passed judgment when the apostles had conveyed their message perfectly, and they could not be repaired after being advised many times. This incident should be used as a lesson by the people. The man hoped that his advice would be accepted by his people and that they would believe in the Prophet Musa, not to disobey him, let alone kill him"
		   },
		   {
			"id": 4166,
			"surah": 40,
			"ayat": 33,
			"tafsir": "After the believing man warned his people about the torment in this world, he continued his warning about the enormity of the events of the Doomsday and the torment in the hereafter. When the apocalypse occurs, the earth shakes violently so that people run here and there screaming for help. However, who will help at that time because every human being experiences the same event and is worried about their own destiny. Regarding yaum at-tanad (the day of calling), there are several opinions of scholars: a. The Day of Judgment, so named because humans at that time screamed for help from others while running here and there watching the earth shake and split apart violently . b. The day when the disbelievers in the hereafter are faced with the hell of Hell, then they are in an uproar running here and there to escape, but the angels intercept and drive them back to Padang Mahsyar to be thrown into hell. c. The day when angels weigh human deeds. If someone turns out to have a heavy scale of good deeds, that person and the people who witness it cheer loudly declare that so and so has good luck, and so on. Likewise, when a person accepts that the scale of his good deeds is lighter than his sins, he also wails bitterly, followed by other people. d. Calls and calls between the inhabitants of heaven and the inhabitants of hell about what each gets. The inhabitants of heaven when asked by the inhabitants of hell whether they have received what God promised them, they answered firmly that they have enjoyed what was promised. On the other hand, when the residents of hell are asked the same thing by the residents of heaven, they also answer with the same words, but with a bitter voice, which shows that what they get is misery. On the day of Mahsyar, which is the day of Allah's judgment, the disbelievers have seen the hell of Hell. Therefore, they ran to avoid it, but the angels intercepted them and returned them to Padang Mahsyar. At that time, no one could help anyone else. Let alone helping others, helping himself is not necessarily capable. The man of faith warned his people that he was very worried that this incident would happen to them. If Pharaoh is what they hope for, then he will be punished in hell, will not be able to help himself, let alone help the other people of his followers. The man of faith asked his people to believe. He was very worried that their hearts would be closed if they did not also accept the truth. If the heart is closed, no one will be able to open it except Allah."
		   },
		   {
			"id": 4167,
			"surah": 40,
			"ayat": 34,
			"tafsir": "The man further stated that before the Prophet Musa, Allah had sent the Prophet Joseph to the people of Egypt. The Prophet Yusuf had invited them to believe and provided evidence of his apostleship, namely teachings about faith in God and doing good, as well as the miracles that God had given him. However, they still did not want to believe him. They only obey him as a minister or a state official. This shows that they were more affected by the greatness of the worldly position than the position of an apostle, and that's why they preferred the cruel Pharaoh to the prophet Musa who brought the truth. After the Prophet Yusuf died, they declared that after him there would not be any more apostles. They say that because they don't want another apostle to invite them to the truth. It turned out that there was an apostle, namely the Prophet Musa and because of that they disobeyed him and became misguided people. Thus, their error was due to their greed for worldly splendor, as did Pharaoh. Their error was also caused by their nature of always doubting the truth, even though what was conveyed to them was Allah's revelation which was definitely true."
		   },
		   {
			"id": 4168,
			"surah": 40,
			"ayat": 35,
			"tafsir": "Then Allah explained how the actions of people who were greedy and always doubted the truth of the revelation. They always reject the truth of God's verses conveyed to them. They also always questioned the evidence presented regarding the truth of the revelation. However, their refusal had no power whatsoever. Their belief is only based on the traditions of their ancestors, and that is just mindless blind obedience. Obedience like this is not justified because God gave humans hearing, sight, and reason. Therefore, people who reject the truth of revelation and believe more in the traditions of their ancestors no longer know what is right and what is wrong. Thus, they are hated by Allah and those who believe. Furthermore, Allah explains His laws for people who close their hearts to receive the truth of revelation, namely that He will close their hearts. Closed hearts happen because they always reject the truth of revelation and make it a problem. Constant rejection will lead to pride. Always questioning the truth will lead to arbitrariness. Because they are arrogant and arbitrary, they will always reject and oppose the truth. Eventually their hearts closed on themselves. Such is the law determined by God for the closure of the human heart."
		   },
		   {
			"id": 4169,
			"surah": 40,
			"ayat": 36,
			"tafsir": "Pharaoh still did not accept the advice of one of his family. He remained disobedient and did not want to accept the preaching of Prophet Musa. Therefore, he wanted to ridicule the Prophet Musa. He ordered Haman, his prime minister, to build a large and magnificent palace that towered into the sky. In another verse it is informed that the palace was built of bricks made of burnt clay: And Pharaoh said, \"O rulers of my people! I do not know there is a god for you other than me. So burn the clay for me, O Haman (to make bricks), then build me a tall building so that I can ascend to see the God of Moses, and I am sure that he is a liar.\" (al-Qashash\/28: 38) The purpose of making this large, majestic and towering building into the sky was as a place or ladder to spy on or witness the existence of the God of the Prophet Musa. He stated that the Prophet Musa was actually a liar because he believed there was no God in the sky. The purpose of his words was to deceive his people, that there really is no God in the sky as the Prophet Musa said. Thus, he wanted his people not to believe in the Prophet Musa and still follow him. Pharaoh acted so because he was controlled by his ambition to defeat the Prophet Musa. He was also controlled by lust so that his people would not find the truth conveyed by the Prophet Musa. He wanted his people to obey him, and for that he did everything he could, from distorting the truth to mocking. It is ambition and lust that lead many people to fall, as the following Arabic verse describes: Lust is like a baby, if you let it grow, it will grow up constantly wanting to suckle, but if you wean it, it will wean itself. Then this verse closes with an affirmation that Pharaoh's trick to defeat Prophet Musa and kill the monotheistic religion that he brought failed and brought great losses. Failed because the preaching of the Prophet Musa still could not be dammed. Loss because the costs incurred are not small, while the results are not there. This is because Allah always destroys the evil that humans do and destroys the consequences left by those evil deeds, as He says: Verily they will be destroyed (by their beliefs) and what they have done will be in vain. (al-A.'raf\/7: 139)"
		   },
		   {
			"id": 4170,
			"surah": 40,
			"ayat": 37,
			"tafsir": "Pharaoh still did not accept the advice of one of his family. He remained disobedient and did not want to accept the preaching of Prophet Musa. Therefore, he wanted to ridicule the Prophet Musa. He ordered Haman, his prime minister, to build a large and magnificent palace that towered into the sky. In another verse it is informed that the palace was built of bricks made of burnt clay: And Pharaoh said, \"O rulers of my people! I do not know there is a god for you other than me. So burn the clay for me, O Haman (to make bricks), then build me a tall building so that I can ascend to see the God of Moses, and I am sure that he is a liar.\" (al-Qashash\/28: 38) The purpose of making this large, majestic and towering building into the sky was as a place or ladder to spy on or witness the existence of the God of the Prophet Musa. He stated that the Prophet Musa was actually a liar because he believed there was no God in the sky. The purpose of his words was to deceive his people, that there really is no God in the sky as the Prophet Musa said. Thus, he wanted his people not to believe in the Prophet Musa and still follow him. Pharaoh acted so because he was controlled by his ambition to defeat the Prophet Musa. He was also controlled by lust so that his people would not find the truth conveyed by the Prophet Musa. He wanted his people to obey him, and for that he did everything he could, from distorting the truth to mocking. It is ambition and lust that lead many people to fall, as the following Arabic verse describes: Lust is like a baby, if you let it grow, it will grow up constantly wanting to suckle, but if you wean it, it will wean itself. Then this verse closes with an affirmation that Pharaoh's trick to defeat Prophet Musa and kill the monotheistic religion that he brought failed and brought great losses. Failed because the preaching of the Prophet Musa still could not be dammed. Loss because the costs incurred are not small, while the results are not there. This is because Allah always destroys the evil that humans do and destroys the consequences left by those evil deeds, as He says: Verily they will be destroyed (by their beliefs) and what they have done will be in vain. (al-A.'raf\/7: 139)"
		   },
		   {
			"id": 4171,
			"surah": 40,
			"ayat": 38,
			"tafsir": "Even though Pharaoh's people opposed him, the man who believed in Moses still called on his people to follow Prophet Musa. He said, \"O my people, if you follow my call and you believe what I have conveyed, it means that you are following the straight path that leads to the happiness of eternal life in the hereafter and it also means that you have embraced the religion of Allah conveyed by Moses. This verse give instructions to believers so that they always convey Allah's religion to humans and invite them to the straight path in a good way, even if unbelievers deny it. This is one of the duties that Allah bears on every believer. let be steadfast and patient in carrying out the da'wah as was done by a believer who followed the call of Moses."
		   },
		   {
			"id": 4172,
			"surah": 40,
			"ayat": 39,
			"tafsir": "In this verse it is explained that those who believed in Musa said to their people, \"O my people, the life of this world is a mortal life, where the pleasure and happiness that is obtained in it are imperfect and impermanent pleasures and happiness. As for the life hereafter, it is eternal life, the pleasure and happiness that is obtained is perfect pleasure and happiness. Therefore, never deny Allah in this world's life so that you will avoid His torment in the hereafter.\""
		   },
		   {
			"id": 4173,
			"surah": 40,
			"ayat": 40,
			"tafsir": "The believer explains to his people how great the influence of a person's worldly life is on his afterlife. He said to his people, \"O my people, whoever does a crime, whether male or female, then he will only be punished according to the crime he has committed. However, whoever believes and does good deeds, follows the commands of Allah and stop His prohibitions, then he will be entered into heaven which is full of pleasure. Allah rewards their faith and good deeds with multiple rewards and unlimited sustenance.\" This verse describes the true justice of Allah and His Most Merciful and Most Merciful nature to His servants. He does not wrong His servant in the least. If He punishes His servant in the hereafter, then the punishment given is in proportion to the evil deeds and denial he has committed while living in this world, not exaggerated in the slightest. However, if He repays the faith and good deeds of His servants, then He repays them with multiple rewards."
		   },
		   {
			"id": 4174,
			"surah": 40,
			"ayat": 41,
			"tafsir": "The man who believed in Moses repeated his call to his people by saying, \"O my people, I am surprised by your attitudes and actions. I call on you to follow the path of salvation, prevent you from the torment of hell, and take you to heaven by believing in Allah. and do good deeds, while you call me to the path of misery that leads to hell.\""
		   },
		   {
			"id": 4175,
			"surah": 40,
			"ayat": 42,
			"tafsir": "Furthermore, the believer stated, \"You all call and invite me to deny Allah and associate Him with something that has no good reason and no evidence that can be trusted, which states that associating partners with God is a true belief. Meanwhile, I calls on and invites you all to unite Allah, there is no other God besides Him. The Almighty, the Mighty, with clear evidence. He is the Almighty, the Most Forgiving of the sins of His servants.\""
		   },
		   {
			"id": 4176,
			"surah": 40,
			"ayat": 43,
			"tafsir": "This verse still continues the words of the believer above. He said, \"Actually you have called me to worship idols, which do not hear the cry of those who call on them, and cannot provide help either in this world or in the hereafter, because it cannot provide any harm or benefit to anyone. .\" God's Word: If you call on them, they will not hear your cry, and if they do, they will not accept your request either. And on the Day of Judgment they will deny your polytheism and no one will be able to give you information as given by (Allah) the All-Seeking. (Fathir\/35: 14) And the word of Allah: And who is more astray than those who worship other than Allah (worship) who cannot allow their (prayers) until the Day of Judgment and they neglect (pay attention to) their prayers? (al-A.hqaf\/46: 5) The believer continued his words, “Know my people, that we all belong to Allah and to Him we return after death and are resurrected. with the deeds and deeds of each of us. Those who disbelieve and transgress limits will become residents of hell.\""
		   },
		   {
			"id": 4177,
			"surah": 40,
			"ayat": 44,
			"tafsir": "Then those who believed ended their advice to their people by saying, \"O my people, in the hereafter you will all know the truth that I conveyed to you both in the form of Allah's commands and in the form of His prohibitions. At that time you will regret it. but at that time regret was no longer useful. I put my trust in my Lord and I handed over to Him all my affairs and I asked Him for help, so that I would be protected from all kinds of evil that I might do and from all disasters that might befall me.\" Indeed, Allah is All-Knowing of the condition of His servants. He guides His servants who deserve to be guided and misleads His servants who want to go astray by doing forbidden things and not doing the commands they have to carry out."
		   },
		   {
			"id": 4178,
			"surah": 40,
			"ayat": 45,
			"tafsir": "This verse explains that Allah helps His believing servants and destroys their enemies by declaring that He protects those who believe from all the attempts of deception and persecution by Pharaoh and his followers by saving them and Musa. Meanwhile, Pharaoh and his followers were drowned in the Red Sea. In the afterlife they will be overwritten by a painful punishment. Narrated by Ibn 'Abbas, \"When he learned about the man's faith, then Pharaoh intended to kill him. Therefore, he ran to save himself.\""
		   },
		   {
			"id": 4179,
			"surah": 40,
			"ayat": 46,
			"tafsir": "This verse describes the doom that will befall Pharaoh and his rebellious people in the afterlife. From the time they die until they are resurrected later, they will be faced with hell in the morning, evening, and continuously until the Day of Judgment. On the Day of Judgment it will be said to the guardians of hell, \"Put Pharaoh and his people into hell and inflict a severe punishment on them.\" The majority of scholars are of the opinion that the punishment for the grave exists and the basis is this verse. Their opinion is supported by the hadith narrated by al-Bukhari and Muslim from Ibn 'Umar: That the Messenger of Allah said, \"Indeed one of you when he dies is shown to him his seat morning and evening. If he is among the people of heaven, then (his seat is is) the seat of the people of heaven, if he is one of the people of hell then (his seat is) the seat of the people of hell. It is said to him, 'This is your seat until Allah raises you up on the Day of Judgment.\" (History of al-Bukhari and Muslim from Ibn 'Umar) From the word of Allah and the hadith above, it can be concluded that the punishment of the grave is a truth that cannot be denied and will be experienced by unbelievers morning and evening until they are resurrected. But ar-Razi stated that the punishment of the grave does not exist. This verse cannot be used as a basis for determining the punishment of the grave, but only points to the continuation of the punishment of hell, similar to the word of Allah addressed to the people of heaven: And therein shall be sustenance for them morning and evening. (Maryam\/19: 62)"
		   },
		   {
			"id": 4180,
			"surah": 40,
			"ayat": 47,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to tell the polytheists of Mecca about the calamity that had befallen Pharaoh and his people, as well as the torments of the grave and the hereafter that they would suffer later. This is intended so that the news becomes a lesson for them so that they are aware and have faith in Allah and His Messenger. In that order, the Prophet Muhammad was asked to tell the polytheists of Mecca about the disputes of the unbelievers who denied the messenger's call when they were in hell later. Followers ask for help from their idols in order to be saved from the punishment of hell that is befalling them, or reduce it. However, the offerings disengaged from the request because they themselves were powerless to reduce or avoid the doom that was befalling them. The idol worshipers sued the idols by saying, \"We were your worshipers in the past, and we were your guardians who were always obedient to you and provided for all your needs, so we disobeyed the apostle's call that was conveyed to us. If only we were did not worship you while living in the world before, of course we will follow the call of the apostle, so that we are not put into hell as we are now. Do you want to prevent us from this punishment or lighten it by your willingness to bear some of the punishment that has befallen us? If it were not for you all, we would have been believers.\""
		   },
		   {
			"id": 4181,
			"surah": 40,
			"ayat": 48,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to tell the polytheists of Mecca about the calamity that had befallen Pharaoh and his people, as well as the torments of the grave and the hereafter that they would suffer later. This is intended so that the news becomes a lesson for them so that they are aware and have faith in Allah and His Messenger. In that order, the Prophet Muhammad was asked to tell the polytheists of Mecca about the disputes of the unbelievers who denied the messenger's call when they were in hell later. Followers ask for help from their idols in order to be saved from the punishment of hell that is befalling them, or reduce it. However, the offerings disengaged from the request because they themselves were powerless to reduce or avoid the doom that was befalling them. The idol worshipers sued the idols by saying, \"We were your worshipers in the past, and we were your guardians who were always obedient to you and provided for all your needs, so we disobeyed the apostle's call that was conveyed to us. If only we were did not worship you while living in the world before, of course we will follow the call of the apostle, so that we are not put into hell as we are now. Do you want to prevent us from this punishment or lighten it by your willingness to bear some of the punishment that has befallen us? If it were not for you all, we would have been believers.\""
		   },
		   {
			"id": 4182,
			"surah": 40,
			"ayat": 49,
			"tafsir": "After the polytheists who are in hell do not succeed in getting help from their leaders, they ask for help from the guardians of hell by saying, \"O guardian of hell (Angel Malik), ask Allah to relieve the torment that He has inflicted on we are. If relief can be given to us by returning us to the world to live and worship, then return us for a moment, hopefully this can reduce our suffering.\""
		   },
		   {
			"id": 4183,
			"surah": 40,
			"ayat": 50,
			"tafsir": "The guardians of hell replied, \"Didn't messengers were sent to you in the past who gave information, evidence, and arguments indicating the oneness of Allah, gave you instructions to the path of happiness and conveyed warning news to you about the consequences of forbidden actions that you do, such as denying God.\" Allah's Word: \"Have no apostles come to you from among you who recite the verses of your Lord and warn you of your meeting (with) this day?\" (az-Zumar\/39: 71) The polytheists replied, \"Yes, the apostles have come to us, inviting us to believe in Allah and His messenger, but we deny the call and do not want to believe. We even oppose and tortured the apostles and those who believed in him.\" The keeper of hell replied, \"If your actions and attitude towards the apostle while living in the world are really as you describe it, then ask Allah yourself. We will not pray for all the disbelievers who deny the apostle. Remember, the prayers of people like you will not permitted by Allah and there will be no benefit. For you it is the same, whether you pray or not, the punishment will not decrease in the least, feel the punishment as a result of your own actions.\" About the condition of the inhabitants of hell, at-Tirmidhi narrated from Abu ad-Darda'., He said: The inhabitants of hell are struck by hunger which matches their doom. They asked for food aid. They were given food from a thorn tree which could not fatten them and could not quench their hunger, so they ate the tree, but their hunger grew more and more. They ask for help again, then they are given food that can block the throat after they eat. They say that when in the world if they eat and suffocate, they ask for water, then they ask for help to be given syrup to drink. However, they were given very hot water which was lifted with hooks. When the drink got close to their faces, their faces burned. If the drink reaches their stomach, it destroys their intestines and what is in their stomach. Finally they asked the angels for help, they said, \"Ask your Lord to lighten our punishment for one day.\" The angels replied, \"Haven't the apostles come to you with clear evidence?\" They replied, \"Yes, it's coming.\" (The guardians of Hell) said, \"Pray yourselves (yourself!)\" But the prayers of the disbelievers were in vain. (Narrated at-Tirmidhi from Abu ad-Darda')"
		   },
		   {
			"id": 4184,
			"surah": 40,
			"ayat": 51,
			"tafsir": "In this verse, Allah promises the believers help and victory against their enemies. Allah says that He will surely make His messengers victorious over their enemies and will help and make those who believe happy in the life of this world and the hereafter. There are various ways and forms of Allah's help, sometimes by elevating their position and power over their enemies, as was given to David and Sulaiman, sometimes by giving them victory over their enemies, as was given to the Prophet Muhammad. . Sometimes also by inflicting misery and calamity on them, as experienced by Pharaoh and his people, and sometimes by destroying the disbelievers and saving the apostles and those who believe along with them, as experienced by Prophet Saleh, Hud, Shuaib, and Noah and his people. Similarly, Allah will provide assistance to the apostles and people who believe on the Day of Resurrection, namely on the day when witnesses consisting of angels, prophets and people who believe. On that day they bore witness to all the deeds of the disbelievers and to the knowledge of the apostles to them, but they denied it."
		   },
		   {
			"id": 4185,
			"surah": 40,
			"ayat": 52,
			"tafsir": "This verse explains that on the day when the witnesses testify, the reasons they put forward are no longer useful and there is no apology they can offer, because everything they say and do is just slander and lies. Allah said: Then there is no answer to their lies, except to say, \"By Allah, O our Lord, we do not associate partners with Allah.\" (al-An'am\/6: 23) On that day, the disbelievers are kept away from the mercy of Allah, and they will receive a very painful punishment in hell."
		   },
		   {
			"id": 4186,
			"surah": 40,
			"ayat": 53,
			"tafsir": "In these verses, Allah explains the various kinds of help He has given to the apostles in the world, including giving Moses various miracles, various laws that regulate human life so that they live happily in this world and in the hereafter, and sends down to him the Torah to be a guide for mankind. Then the Torah was passed on to their descendants and those after them and became a warning for people of understanding and kept them away from doubts and prejudices that were not good. Allah's Word: Indeed, We who sent down the Torah; in it (there is) guidance and light. With this Book the prophets who submitted themselves to Allah gave judgment on the cases of the Jews, as well as their scholars and priests, because they were ordered to guard Allah's books and they were witnesses to them. (al-Ma'idah.\/5: 44)"
		   },
		   {
			"id": 4187,
			"surah": 40,
			"ayat": 54,
			"tafsir": "In these verses, Allah explains the various kinds of help He has given to the apostles in the world, including giving Moses various miracles, various laws that regulate human life so that they live happily in this world and in the hereafter, and sends down to him the Torah to be a guide for mankind. Then the Torah was passed on to their descendants and those after them and became a warning for people of understanding and kept them away from doubts and prejudices that were not good. Allah's Word: Indeed, We who sent down the Torah; in it (there is) guidance and light. With this Book the prophets who submitted themselves to Allah gave judgment on the cases of the Jews, as well as their scholars and priests, because they were ordered to guard Allah's books and they were witnesses to them. (al-Ma'idah.\/5: 44)"
		   },
		   {
			"id": 4188,
			"surah": 40,
			"ayat": 55,
			"tafsir": "God's help to the apostles and people who believe that is one of the sunatullah as ever bestowed on Moses. Therefore, the Prophet Muhammad was asked to be patient with the attitudes and actions of polytheists who made fun of Allah's verses. Allah will certainly help him by strengthening the ranks of the Muslims and elevating the position of the Islamic religion beyond their beliefs. Evening. Those good deeds wipe out the faults. That is a warning for those who always remember (Allah). (Hud\/11: 114) By always praying in remembrance of Allah and glorifying that morning and evening, the Prophet worshiped like the angels do. Allah said: And to Him belongs those in the heavens and the earth. And (the angels) who are by His side, do not have the arrogance to worship Him and do not (also) feel tired. They (the angels) glorify non-stop night and day. (al-Anbiya'\/21: 19-20) The Messenger of Allah was ordered to repent, it does not mean that he has committed a sinful act, but the meaning is that by frequently doing repentance and asking for forgiveness, the soul will become purer and cleaner, not even a single dirt will contaminate it. If the Prophet who is free from all sins is still told to repent, it will be even more for his people and followers. They must repent quickly and often. From this verse it can be understood that the Qur'an teaches believers to always repent, ask God for forgiveness, and do good deeds. If a person has repented and asked for forgiveness, his soul becomes pure and clean. Deeds done by people who are clean in soul will be immediately accepted by Allah. From this verse, it can be understood that a person who is not pure and clean in heart because he does not repent and ask Allah for forgiveness, then his deeds are not accepted by Allah or are not considered as pious deeds."
		   },
		   {
			"id": 4189,
			"surah": 40,
			"ayat": 56,
			"tafsir": "God's help to the apostles and people who believe that is one of the sunatullah as ever bestowed on Moses. Therefore, the Prophet Muhammad was asked to be patient with the attitudes and actions of polytheists who made fun of Allah's verses. Allah will certainly help him by strengthening the ranks of the Muslims and elevating the position of the Islamic religion beyond their beliefs. Evening. Those good deeds wipe out the faults. That is a warning for those who always remember (Allah). (Hud\/11: 114) By always praying in remembrance of Allah and glorifying that morning and evening, the Prophet worshiped like the angels do. Allah said: And to Him belongs those in the heavens and the earth. And (the angels) who are by His side, do not have the arrogance to worship Him and do not (also) feel tired. They (the angels) glorify non-stop night and day. (al-Anbiya'\/21: 19-20) The Messenger of Allah was ordered to repent, it does not mean that he has committed a sinful act, but the meaning is that by frequently doing repentance and asking for forgiveness, the soul will become purer and cleaner, not even a single dirt will contaminate it. If the Prophet who is free from all sins is still told to repent, it will be even more for his people and followers. They must repent quickly and often. From this verse it can be understood that the Qur'an teaches believers to always repent, ask God for forgiveness, and do good deeds. If a person has repented and asked for forgiveness, his soul becomes pure and clean. Deeds done by people who are clean in soul will be immediately accepted by Allah. From this verse, it can be understood that a person who is not pure and clean in heart because he does not repent and ask Allah for forgiveness, then his deeds are not accepted by Allah or are not considered as pious deeds."
		   },
		   {
			"id": 4190,
			"surah": 40,
			"ayat": 57,
			"tafsir": "In this verse it is stated that those who deny the messenger's call and argue against Allah's verses are people whose hearts are full of arrogance and arrogance. They are reluctant to accept the truth because of the influence of lust. They want to be in power and be made leaders in society, and feel they are the most powerful people. Their desire is what causes them to deny the verses of Allah. According to them, this desire will not be fulfilled if they follow the apostle's call, because following the apostle's call means they leave the religion of their ancestors that they have respected so far. Then Allah explained that even though the disbelievers always tried to destroy the Prophet Muhammad and his followers, they would not achieve that goal. Because, Allah always helps the Prophet Muhammad by humiliating, humiliating, and destroying his enemies and their efforts. Allah then ordered the Prophet to always ask for protection from Him to break the deceptions and efforts of the polytheists. Allah is All-Hearing all the requests and supplications of His servants, knows every vibration of the soul and sees all the deeds of His servants. (57) In this verse, Allah presents one of the proofs of the resurrection day on the Day of Resurrection. He explained that creating the heavens and the earth was more \"heavy\" and \"difficult\" than creating humans, both when he first created it and when he repeated it. The heavens and the earth and everything in them are infinite in breadth and magnitude. Countless number of planets there. Countless number of animals and plants that exist in it. The mountains and rivers that flow cannot be traced by humans. The laws and science related to them cannot be known by all humans. Therefore, polytheists should never think that Allah, who created the heavens and the earth and the people in them, is unable to resurrect people on the Day of Resurrection or revive those who have died. Nothing is difficult for Allah, everything is easy for Him. Allah said: And did they not see that it is Allah who created the heavens and the earth and He did not feel bad for creating them, and He has the power to give life to the dead? That's how it is; indeed, He is Almighty over all things. (al-A.hqaf\/46: 33) Verse 57 of this surahh az-Zumar seems to emphasize that the creation of this universe is much more complicated (big) than the creation of humans (this is of course in the view of humans because for Allah nothing is complicated in the slightest ). In fact, from the number of writings resulting from thoughts and findings, the disclosure of the theory of the creation of the universe is more numerous and is developing more rapidly than the development of the theory of human events which until now is still filled with unanswered questions and controversial facts. Judging from the time of its existence scientifically, humans (homo sapiens) are estimated to have appeared 40,000 years ago, this period is nothing compared to the age of the universe which is estimated to have existed since 7 billion years ago, especially when compared to the history of human civilization traces of which were found only about 7000 years ago. It seems that our knowledge about the events of the universe is actually no more than what we know about human events. At the end of this verse, Allah explains the evidence put forward and very few people are willing to think about seeking the ultimate truth. They are too influenced by the desires and pleasures of the world which are only temporary. They also don't want to hear and realize that God is Almighty, nothing can beat Him."
		   },
		   {
			"id": 4191,
			"surah": 40,
			"ayat": 58,
			"tafsir": "This verse explains that in the sight of Allah, those who disbelieve are blind from the truth, do not want to see and think about the signs of Allah's power and greatness in the heavens and on earth with believers who want to seek the truth, try to convince themselves by studying and reflect on the signs of Allah's power and greatness, so that they know that the creation of the earth and the heavens and what is in them is greater and more difficult than creating human beings. Therefore, resurrecting humans is something that is easy for God. Likewise, those who believe and do good deeds are not the same as disbelievers who always do things that are forbidden by Allah. Indeed, only a few people want to contemplate and think about the arguments put forward to them and few are willing to take lessons. If they were willing to ponder so that they would know the truth, they would surely know the mistakes they had made and would not repeat them."
		   },
		   {
			"id": 4192,
			"surah": 40,
			"ayat": 59,
			"tafsir": "After Allah explained the evidence for the existence of the Day of Judgment and the Day of Resurrection, He confirmed that the Day of Judgment would definitely come. At that time, all humans were revived, each of them was accounted for his deeds with full justice before the court of Allah. No one can escape God's judgment. Even though the Day of Judgment will definitely come, and it has been confirmed that disbelievers will go to hell and those who believe will go to heaven, very few people want to believe and have faith, they even deny it."
		   },
		   {
			"id": 4193,
			"surah": 40,
			"ayat": 60,
			"tafsir": "In this verse, Allah commands people to pray to Him. If they pray, surely He will accept the prayer. Ibn 'Abbas, adh-ahhak, and Mujahid interpret this verse, \"Your Lord says, 'Worship Me, I will reward you with reward.\" According to them, in the Qur'an, the word prayer can also be interpreted as worship as in the word of Allah: Those whom they worship besides Allah are none other than inatsan (idols), and they worship nothing but the rebellious devil. (an-Nisa'\/4: 117) In the hadith, the Prophet said: Prayer is worship. (History of at-Tirmidhi from an-Nu'man bin Basyir) Some commentators argue that the prayer in this verse means \"request\". Actually prayer and worship are the same in terms of language. Only the first means special while the second means general. Prayer is a form or way of worship. This is based on the hadith: Prayer is the essence of worship. (Narrated at-Tirmidhi from Anas bin Malik) And the hadith of the Prophet saw: Narrated from 'aisyah, he said, \"The Prophet saw was asked by people, 'Which worship is the most important? He replied,' Someone's prayer for him.\" (Al-Bukhari) Based on the hadith above, the prayer in this verse can be interpreted as worship. This is confirmed by the continuation of the verse which means: \"Indeed, those who are arrogant from worshiping Me will enter a despicable hell.\" This verse is a warning and a strong threat to those who are reluctant to worship Allah. This verse is also Allah's statement to His believing servants so that they will obtain goodness and happiness in this world and the hereafter. It is as if Allah is saying, \"O My servants, serve Me, always worship and pray to Me. I will accept the worship and prayers that you sincerely do, accept your requests, and forgive your sins.\""
		   },
		   {
			"id": 4194,
			"surah": 40,
			"ayat": 61,
			"tafsir": "In this verse, Allah orders people to worship Him for the following reasons: 1. It is God who orders people to worship Him, who makes the night a time of rest, and prepares new energy so they can try again the next day. At night, humans generally sleep because it is a body need that must be met. 2. Which makes the day luminous, which illuminates the universe so that humans can try to make ends meet. 3. Because God has unlimited gifts that are provided for all His creatures, and these gifts will never run out forever. At the end of this verse it is explained that most people do not want to be grateful for the blessings God has bestowed upon them. They deny the favors, as if they got the favors solely because of their own efforts."
		   },
		   {
			"id": 4195,
			"surah": 40,
			"ayat": 62,
			"tafsir": "This verse explains that the one who bestows countless blessings on all creatures is God who has the right to be worshiped, because He is the One who created all creatures. The disbelievers will be asked why they turned their backs, did not want to worship, and did not unite Allah. In fact, everything they worship is God's creation, which does not deserve worship."
		   },
		   {
			"id": 4196,
			"surah": 40,
			"ayat": 63,
			"tafsir": "In this verse it is explained that just as the polytheists have gone astray by worshiping gods other than Allah, so have those before them gone astray. They deny the verses of Allah and worship other gods solely because of their stupidity and mere lust."
		   },
		   {
			"id": 4197,
			"surah": 40,
			"ayat": 64,
			"tafsir": "In this verse it is explained that Allah made the earth for humans as a place to live. They live on it by enjoying the sustenance He bestows. He also made the sky as a roof and decorated with sparkling stars visible at night. Because of the regular circulation of the stars, there is night, day, darkness, and light. In this verse, the arguments for the oneness and power of God are also explained in humans themselves. Allah has made human beings in the best form among His creatures and equipped with limbs according to the needs and interests of human life itself. He is also the one who gives humans good food and drink as sustenance from Him. Allah is the Most High God, who owns the universe. At the end of this verse it is emphasized that God, who has bestowed His mercy upon mankind, is the God who must be worshiped. God is perfect and owns the universe. Allah's Word: O people! Worship your Lord, who created you and those before you, so that you may be pious. (He is) the one who made the earth a stretch for you and the sky as a roof, and it is He who sends down water (rain) from the sky, then He produces with it (rain) fruits as sustenance for you. Therefore do not set up equals for Allah, while you know. (al-Baqarah\/2: 21-22)"
		   },
		   {
			"id": 4198,
			"surah": 40,
			"ayat": 65,
			"tafsir": "This verse explains that the God who is worshiped is the God who lives eternally, who never dies. He is the one who animates and dies His creatures, apart from Him is not worthy of worship. Therefore, purify submission and obedience only to Him, never associate Him with anything. At the end of this verse it is explained that all praise be to Allah, the Most Holy God. He is the One who owns all of His creatures, whether in the form of angels, jinns, humans, and all other creatures that exist in this nature. Everything depends on Him, so that all the attributes of greatness and glory are in Him. Therefore, they always say: \"al-hamdulillahi Rabbil 'alamin\"."
		   },
		   {
			"id": 4199,
			"surah": 40,
			"ayat": 66,
			"tafsir": "In these verses, Allah ordered Prophet Muhammad to tell polytheists and disbelievers that Allah forbade him from worshiping any god they worship, other than Allah. The definition of worshiping gods other than Allah is to surrender oneself to something, to think of it as having supernatural powers like Allah's power, to ask for help, and to ask something of it. In this verse it is stated that the gods are in the form of statues. However, this understanding includes all kinds of objects or creatures that are worshiped and asked for help from him, such as rivers, sacred stones, graves that are considered sacred, and so on. Furthermore, the Prophet was ordered to state that Allah forbade him from worshiping other than Allah, and put forward evidence and arguments in the form of verses from the Qur'an, as well as in the form of orders to pay attention to this natural occurrence. By contemplating natural events and the verses of the Qur'an, people will come to the conclusion that the only one who has the right to be worshiped is Allah. At the end of this verse, Allah commands obedience and obedience to Him, purifying obedience only to Him, because He is the Lord of the universe."
		   },
		   {
			"id": 4200,
			"surah": 40,
			"ayat": 67,
			"tafsir": "It was He who made man from the ground, into a drop of sperm, from a drop of sperm into something attached, and a lump of blood became a lump of flesh, then was born into the world in the form of a human. Jumhur scholars are of the opinion that what is meant by God creating man from the ground is the human father, Adam, who was created by God from the ground. Some commentators explain that what is meant by God making man from the ground is that God made man from the essence that comes from the ground. A father and a mother eat food that comes from the ground, from livestock, and plants. Livestock eat plants and develop using substances that come from the soil. The food eaten by the mother or father is the main source for forming egg or sperm cells. The mother's egg meets the father's sperm in the mother's womb, so that it becomes a blood clot and so on. God then explained that the humans He created from the ground experienced life in three periods; namely: 1. Childhood. 2. Adulthood. 3. Old age. Among humans there are those whom Allah passed away in childhood, some in adulthood, and some who died after old age. The determination of when a human being dies is in the hands of Allah alone. The process of human occurrence is explained in this verse so that it can become material for reflection and thought for people who have sense, so that they believe in Allah, the Creator of all creatures."
		   },
		   {
			"id": 4201,
			"surah": 40,
			"ayat": 68,
			"tafsir": "Allah ordered the Messenger of Allah to convey to polytheists that Allah who must be worshiped is God Who revives humans from nothing to nothing, revives them after death, and turns off all creatures at the times He has determined. He is the Almighty God and the Creator. If God wants to create something, it is enough for God to say, \"Be,\" then that something becomes."
		   },
		   {
			"id": 4202,
			"surah": 40,
			"ayat": 69,
			"tafsir": "Allah revealed to the Prophet Muhammad, did he not pay attention to those who dispute the verses of Allah which explain and prove His oneness and the existence of the Day of Resurrection. The disbelievers argue without presenting strong arguments or that can be accepted by reason and true thoughts. This shows that their disbelief and denial has no reason at all. If there is a reason they put forward, it is only because they want to avoid Muhammad's call. Their attitude like that is a strange attitude and not right. If they want to find the truth and want to follow the right beliefs, there are so many arguments that they can learn and pay attention to to achieve their desires."
		   },
		   {
			"id": 4203,
			"surah": 40,
			"ayat": 70,
			"tafsir": "The people who dispute the verses of Allah are the people who deny the verses of the Qur'an that Allah revealed to Muhammad and everything that the messengers conveyed at His command. In the verses of the Qur'an and what the messengers conveyed, there are orders to serve oneself only to Allah, not to worship anything other than Him, to believe in the day of resurrection, and in laws and instructions for the happiness of living in this world and hereafter. Those who deny it will later know the consequences of their denial. This is a very strong warning, as Allah says: Woe in that day, to the liars! (al-Muthaffifin\/83: 10)"
		   },
		   {
			"id": 4204,
			"surah": 40,
			"ayat": 71,
			"tafsir": "As a result of their disbelief, the disbelievers will suffer torment in the hereafter, when shackles and chains are placed around their necks, then they are pulled by force and burned in hell. This verse is the same in content and meaning as the word of Allah: Then surely their place of return will be to the Hell of Jahim. (ash-shaffat\/37: 68) And the word of Allah hold him and then drag him to the middle of hell, then pour over his head doom (from) very hot water. Feel it, in fact you are truly a mighty and noble person. Verily, this is the doom of which you doubted before. (ad-Dukhan\/44: 47-50)"
		   },
		   {
			"id": 4205,
			"surah": 40,
			"ayat": 72,
			"tafsir": "As a result of their disbelief, the disbelievers will suffer torment in the hereafter, when shackles and chains are placed around their necks, then they are pulled by force and burned in hell. This verse is the same in content and meaning as the word of Allah: Then surely their place of return will be to the Hell of Jahim. (ash-shaffat\/37: 68) And the word of Allah hold him and then drag him to the middle of hell, then pour over his head doom (from) very hot water. Feel it, in fact you are truly a mighty and noble person. Verily, this is the doom of which you doubted before. (ad-Dukhan\/44: 47-50)"
		   },
		   {
			"id": 4206,
			"surah": 40,
			"ayat": 73,
			"tafsir": "The disbelievers who are being subjected to a very painful punishment are asked mocking questions to add to the severity of the suffering they are experiencing. The questions are which idols did they worship besides Allah first. The idols that they think are capable of releasing and saving them from the doom and disaster that day. They replied that the idols had disappeared from them, had followed a different path, and were subject to disaster and tribulation on that day. They admit that actually while living in the world they have followed the wrong religion and belief and worshiped something that is not worthy of worship. At the end of this verse it is emphasized that just as Allah has allowed polytheists to go astray, so that not a single deed has been accepted from them as a good deed, so is Allah's attitude towards all the work done by disbelievers. They cannot benefit in the slightest from their deeds."
		   },
		   {
			"id": 4207,
			"surah": 40,
			"ayat": 74,
			"tafsir": "The disbelievers who are being subjected to a very painful punishment are asked mocking questions to add to the severity of the suffering they are experiencing. The questions are which idols did they worship besides Allah first. The idols that they think are capable of releasing and saving them from the doom and disaster that day. They replied that the idols had disappeared from them, had followed a different path, and were subject to disaster and tribulation on that day. They admit that actually while living in the world they have followed the wrong religion and belief and worshiped something that is not worthy of worship. At the end of this verse it is emphasized that just as Allah has allowed polytheists to go astray, so that not a single deed has been accepted from them as a good deed, so is Allah's attitude towards all the work done by disbelievers. They cannot benefit in the slightest from their deeds."
		   },
		   {
			"id": 4208,
			"surah": 40,
			"ayat": 75,
			"tafsir": "This verse explains the reasons why Allah inflicted a painful punishment on the disbelievers. Among them is because they feel happy and happy without feeling guilty while living in the world doing acts of shirk, such as worshiping more than one god, worshiping other gods besides worshiping Allah, or admitting that there are creatures other than Allah who have supernatural powers. that matched his strength. Besides that, they also commit immoral acts, and act arrogantly, arrogantly, and unjustly towards humans."
		   },
		   {
			"id": 4209,
			"surah": 40,
			"ayat": 76,
			"tafsir": "Then those disbelievers are ordered to enter hell through its gates, according to the circumstances of the evil deeds they have done. They are also ordered to remain in hell because that is the proper place for people who deny Allah's verses and are arrogant to Him."
		   },
		   {
			"id": 4210,
			"surah": 40,
			"ayat": 77,
			"tafsir": "Allah commands His messengers to be patient in facing the actions of polytheists who deny and dispute His verses. The apostles were also asked to be patient and put their trust in facing their disturbances and threats. Allah stated that His promise to punish the disbelievers must be true and fulfilled. Allah said to the Prophet that if He showed him, while the Prophet was still alive, the punishment that befell the polytheists, or if he did not show the Prophet that punishment by dying before the punishment came, then that would mean nothing to them. . On the Day of Judgment everything will return to Allah, then they will be rewarded accordingly. Another verse that is synonymous with this verse is: So indeed, if We were to pass you off (before you achieve victory), then surely We will still give them the punishment (in the hereafter), or We will show you (the punishment) that We have threatened them with. So indeed, We have power over them. (az-Zukhruf\/43: 41-42)"
		   },
		   {
			"id": 4211,
			"surah": 40,
			"ayat": 78,
			"tafsir": "This verse explains that Allah has sent messengers and prophets to people before Prophet Muhammad. Among the prophets and apostles whose stories are described in the Qur'an are 25 apostles, such as Noah, Idris, Abraham, Moses, Sulaiman, Jesus, and other apostles. In addition, many of the prophets and apostles are not mentioned in the Qur'an. It was narrated from Abu Dharr that he said, \"I asked, 'O Messenger of Allah, how many prophets are there? The Messenger of Allah replied, '124 thousand and those who became apostles among them were 315 people. A large number.\" (Ahmad's history) Every apostle sent by God was unable to create miracles on his own, but they could be given by God. The miracle as proof of the apostleship presented to the people who denied it. The form and nature of the miracle were adapted to the circumstances, the time, and the place where the apostle who received it lived, so that the miracle was truly believed by the people at that time. Miracles are given if God himself wills to give them. If Allah has not wished to give it, then the miracle will not be given even if the disbelievers ask for it. The miracle was given in accordance with the wisdom and wisdom of Allah and also in accordance with the benefit of the people. At the end of this verse it is explained that if Allah's punishment has come upon those who deny Him, then Allah will settle their cases in the fairest way possible. Allah saves the apostles and those who believe in him from the punishment, and destroys those who disbelieve and associate partners with Him. This can be seen when Allah's punishment befell the people of 'Ad, Allah saved the Prophet Hud and the believers who were with him. Likewise the doom that befell the Samud and so on."
		   },
		   {
			"id": 4212,
			"surah": 40,
			"ayat": 79,
			"tafsir": "Most commentators are of the opinion that what is meant by livestock in this verse is a camel, because that animal corresponds to the characteristics mentioned in this verse. Ibn Kathir argues that what is meant is camels, cows and goats. Camels are useful for eating, milking, used to transport heavy goods and ridden in traveling. Cows can be used to eat their meat, milk them, and use their energy to plow the land. While goats can be eaten for meat and milked. All of these animals can be used for fur, skin, and hair. Allah's Word: ¦And He made for you houses (tents) of cattle skins that you feel light (carry) when you travel and when you live and (He also made) of sheep's wool, camel hair , and goat hair, household goods and pleasures until (a certain) time. (an-Nahl\/16: 80) And His words: And He has created livestock, for you there is (fur) that warms and various benefits, and some of it you eat. And you find beauty in it when you bring it back to the stable and when you release it (to the grazing area). And he carries your burdens to a land that you are not able to reach, except with great difficulty. Verily, your Lord is Most Gracious, Most Merciful. (an-Nahl\/16: 5-7) Camels are animals that are mostly used by people who live in the desert, as if camels cannot be separated from their lives and lives. It was the camels that brought them to various countries in trade. Camels are their loyal companions when they are in the middle of a vast desert. Therefore, if the camel is presented by these verses to the Arabs, as one of the most beneficial animals, then the meaning of the parable can be understood by their minds. In the Middle Ages, the Arabs were a nation that connected the West and the East. At that time, there was trade from East to West, bringing spices to the West, and bringing handicrafts to the East. In the East, the spices were brought to South Arabia or to the Persian Gulf, then they were brought to Turkey through the vast desert. The main means of transportation used by the Arabs at that time were camels. In addition to giving examples of the benefits of livestock, namely milk, energy, and so on, this ayat underscores its broad application to transportation, especially in the term ark, which generically means the ark of a ship, meaning a vehicle for sea travel. However, if you see that the Qur'an is the last holy book revealed to mankind until the end of time, then the word ark needs to be expanded to mean all means of transportation, be it at sea, lakes, rivers, swamps or land. This also includes transportation vehicles in the air (atmosphere) or in outer space where there is no air. Therefore, the means of transportation include trains, express trains (shinkansen in Japan), sky lifts (lines) (vehicles that depend and move in the air on a cable, to hovercraft, namely vehicles in marshes or swamps. into it a speedboat vehicle that hovers above the surface of the water and can slide by occasionally touching the surface of the water and moving a few centimeters above it.Into this category there is also a levitation train that is lifted a few centimeters above the rail and does not touch it.Therefore, the vehicle is moves without friction which hinders the movement of the rail. The train can float without touching the rail because it has the same magnetic charge as the rail so that there is repulsion between the train and the rail so that the train levitates as a result moving without touching the surface of the rail so it is free from friction. The series of rides can be revised again with spacecraft such as the samp airplane ai outer space vehicles in the form of rockets and satellites. Of course, this list of vehicles on land, sea and air needs to be revised with the invention of new vehicles in accordance with technological advances, but basically all forms and vehicles used by humans move, move and dynamically to further accelerate the achievement of our goals in life which Allah pleases. ."
		   },
		   {
			"id": 4213,
			"surah": 40,
			"ayat": 80,
			"tafsir": "Most commentators are of the opinion that what is meant by livestock in this verse is a camel, because that animal corresponds to the characteristics mentioned in this verse. Ibn Kathir argues that what is meant is camels, cows and goats. Camels are useful for eating, milking, used to transport heavy goods and ridden in traveling. Cows can be used to eat their meat, milk them, and use their energy to plow the land. While goats can be eaten for meat and milked. All of these animals can be used for fur, skin, and hair. Allah's Word: ¦And He made for you houses (tents) of cattle skins that you feel light (carry) when you travel and when you live and (He also made) of sheep's wool, camel hair , and goat hair, household goods and pleasures until (a certain) time. (an-Nahl\/16: 80) And His words: And He has created livestock, for you there is (fur) that warms and various benefits, and some of it you eat. And you find beauty in it when you bring it back to the stable and when you release it (to the grazing area). And he carries your burdens to a land that you are not able to reach, except with great difficulty. Verily, your Lord is Most Gracious, Most Merciful. (an-Nahl\/16: 5-7) Camels are animals that are mostly used by people who live in the desert, as if camels cannot be separated from their lives and lives. It was the camels that brought them to various countries in trade. Camels are their loyal companions when they are in the middle of a vast desert. Therefore, if the camel is presented by these verses to the Arabs, as one of the most beneficial animals, then the meaning of the parable can be understood by their minds. In the Middle Ages, the Arabs were a nation that connected the West and the East. At that time, there was trade from East to West, bringing spices to the West, and bringing handicrafts to the East. In the East, the spices were brought to South Arabia or to the Persian Gulf, then they were brought to Turkey through the vast desert. The main means of transportation used by the Arabs at that time were camels. In addition to giving examples of the benefits of livestock, namely milk, energy, and so on, this ayat underscores its broad application to transportation, especially in the term ark, which generically means the ark of a ship, meaning a vehicle for sea travel. However, if you see that the Qur'an is the last holy book revealed to mankind until the end of time, then the word ark needs to be expanded to mean all means of transportation, be it at sea, lakes, rivers, swamps or land. This also includes transportation vehicles in the air (atmosphere) or in outer space where there is no air. Therefore, the means of transportation include trains, express trains (shinkansen in Japan), sky lifts (lines) (vehicles that depend and move in the air on a cable, to hovercraft, namely vehicles in marshes or swamps. into it a speedboat vehicle that hovers above the surface of the water and can slide by occasionally touching the surface of the water and moving a few centimeters above it.Into this category there is also a levitation train that is lifted a few centimeters above the rail and does not touch it.Therefore, the vehicle is moves without friction which hinders the movement of the rail. The train can float without touching the rail because it has the same magnetic charge as the rail so that there is repulsion between the train and the rail so that the train levitates as a result moving without touching the surface of the rail so it is free from friction. The series of rides can be revised again with spacecraft such as the samp airplane ai outer space vehicles in the form of rockets and satellites. Of course, this list of vehicles on land, sea and air needs to be revised with the invention of new vehicles in accordance with technological advances, but basically all forms and vehicles used by humans move, move and dynamically to further accelerate the achievement of our goals in life which Allah pleases. ."
		   },
		   {
			"id": 4214,
			"surah": 40,
			"ayat": 81,
			"tafsir": "Thus Allah shows to humans the signs of His power and greatness. In fact, none of these signs cannot be seen or are inconsistent with reason, so there is no way for humans to deny them. If they deny it, then the reason for the denial is just an excuse they are looking for."
		   },
		   {
			"id": 4215,
			"surah": 40,
			"ayat": 82,
			"tafsir": "Through this verse, Allah questioned whether the Meccan polytheists, who denied the verses Allah conveyed to them, never walked and traveled to other countries? Actually they are nomads and travelers who have gone to various countries in doing trade. They went to Yemen, South Arabia and Syria at every season and time, according to the form of trade at that time. On their way through countries that had been inhabited by ancient peoples, such as the land of the people of 'Ad, Samud, the inhabitants of Aikah, Egypt, Babylon, and so on. From the ruins they saw in that country, and the stories they received from their ancestors, they knew that in those countries there had been peoples who were mighty, had high culture, and had conquered the surrounding countries. They chiseled out mountains for their houses, built mighty pyramids, and so on. However, because of the disobedience of Allah's messengers who were sent, Allah's punishment overtook them. At that time, nothing could save them from Allah's punishment. The polytheists of Mecca, who have not been able to match the results achieved by the ancient peoples, will suffer a fate similar to theirs if they continue to deny Muhammad's apostleship. No one can save them from Allah's punishment."
		   },
		   {
			"id": 4216,
			"surah": 40,
			"ayat": 83,
			"tafsir": "In this verse it is stated that the messengers sent by Allah had come to the earlier peoples with strong and real arguments and explanations. However, they still denied it even against the call of the apostles. They showed the apostles how strong their belief was in the religion they professed. They thought that the knowledge they had acquired was incomparable knowledge so they made fun of the apostles. Those who disbelieve will be subject to a severe punishment in the hereafter. Their words are mentioned in the word of God: ¦ And nothing can destroy us but the masses. (al-Jatsiyah\/45: 24) And the word of Allah: ¦If Allah had willed, of course we would not have associated partners with Him, nor would our ancestors ¦ (al-An'am\/6: 148)"
		   },
		   {
			"id": 4217,
			"surah": 40,
			"ayat": 84,
			"tafsir": "This verse explains the true character and belief of man in God. Humans basically believe that God is One, He is the Almighty and who gives favors to His servants. That belief can be covered by circumstances that affect human life. If they are in power, rich, and controlled by their desires, they forget Allah, and even look for other gods to be worshiped, according to the demands of their desires. If they are struck by danger, calamity, sorrow, and so on, they will remember and serve themselves to God who created them. At that time they also denied the gods they invented. There are many examples and parables that Allah has put forward in His verses in this regard. There are also many people who have these characteristics, such as Pharaoh, Karun, and so on."
		   },
		   {
			"id": 4218,
			"surah": 40,
			"ayat": 85,
			"tafsir": "This verse emphasizes that people's confession of faith, as explained in the verse above, will no longer be of any use if Allah's punishment has come. The door of repentance has been closed for them, as Allah said to Pharaoh when he was about to drown: ¦So that when Pharaoh was about to drown he said, \"I believe that there is no god but God in whom the Children of Israel believe, and I am one of those who Muslims (surrender).\" Why only now (you believe), when in fact you have been disobedient long ago, and you are among those who do mischief. (Yunus\/10: 90-91) This verse warns that faith will benefit a person if he believes in Allah in his life in this mortal world, his mind and heart feel the greatness and power of Allah and he feels that life and death depend on -His. If he made a mistake, he immediately repented and promised not to make a mistake again. What is explained is God's laws that apply to everyone. Faith is useless when they see doom. At that time there is no longer any use of faith and all those who disbelieve will be lost."
		   }
	]
}
