{
	"tafseer": [
		{
			"id": 5476,
			"surah": 73,
			"ayat": 1,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad, who was covered in a blanket, to pray part of the night. Allah's call to the Prophet Muhammad is preceded by the words \"O you who are covered with a blanket"
		   },
		   {
			"id": 5477,
			"surah": 73,
			"ayat": 2,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad, who was covered in a blanket, to pray part of the night. Allah's call to the Prophet Muhammad is preceded by the words \"O you who are covered with a blanket"
		   },
		   {
			"id": 5478,
			"surah": 73,
			"ayat": 3,
			"tafsir": "Allah explains the meaning of the words partially contained in the previous verse, namely half or more. Allah left it to the Prophet Muhammad to choose the time to perform the night prayer. He can choose between one third, one half, or two thirds of the night. Allah gave freedom to the Prophet Muhammad to choose these times. One third of the night according to Indonesian time is approximately between 10 and 11 pm, one half of the night is between 12 and 1 pm and two thirds of the night is the time between 2 and 3 until just before dawn."
		   },
		   {
			"id": 5479,
			"surah": 73,
			"ayat": 4,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to read the Qur'an carefully (tartil). The point is to read the Qur'an slowly, reading fluently, and feeling the meaning and intent of the verses read, so that it impresses on the heart. This order was carried out by the Prophet. 'Aisyah narrated that the Messenger of Allah read the Qur'an with tartil, so that the surah he read became longer than he normally read. In connection with this verse, al-Bukhari and Muslim narrated from 'Abdullah bin Mugaffal, that he said: I saw the Messenger of Allah on the day of the conquest of Mecca, riding his camel reading surahh al-Fath where in the reading he performed tarji' ( slow reading with repetition). (Al-Bukhari and Muslim from 'Abdullah bin Mugaffal) The author of the book Fathul Bayan said, \"What is meant by tartil is the presence of the heart when reading, not just making a sound from the throat by muzzling the face and mouth with the strains of a song, as is customary readers of the Koran today do. Reading like that is a reading done by people who do not understand religion.\" Reading the Qur'an in a tart way contains wisdom, namely the opportunity to pay attention to the contents of the verses being read and when mentioning the name of Allah, the reader will feel His majesty. When it comes to verses that contain promises, the reader will have hopes, as well as when reading threatening verses, the reader will feel anxious. On the other hand reading the Qur'an in haste or with a good song, but not understanding its meaning is an indication that the reader does not pay attention to the content contained in the verse he is reading."
		   },
		   {
			"id": 5480,
			"surah": 73,
			"ayat": 5,
			"tafsir": "This verse explains that Allah will reveal the Qur'an to Muhammad saw in which are His commands and prohibitions. This was a heavy burden, both on Muhammad and his followers. No one wants to carry that heavy burden except those who get guidance from Allah."
		   },
		   {
			"id": 5481,
			"surah": 73,
			"ayat": 6,
			"tafsir": "This verse emphasizes that worship performed at night feels more impressive and solid, both in the heart and on the tongue, because the reading of these verses is clearer than reading during the day when people are busy with the affairs of worldly life."
		   },
		   {
			"id": 5482,
			"surah": 73,
			"ayat": 7,
			"tafsir": "This verse instructs the Prophet Muhammad to distinguish between the atmosphere of worship during the day and at night, when peace of mind worships God, desiring freedom of thought. The busyness during the day made his attention not focused on carrying out God's message."
		   },
		   {
			"id": 5483,
			"surah": 73,
			"ayat": 8,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to always remember Him, both day and night, with tasbih, tahmid, takbir, prayer, and reading the Qur'an. In this way, he can remove from his heart everything that neglects God's commandments."
		   },
		   {
			"id": 5484,
			"surah": 73,
			"ayat": 9,
			"tafsir": "Furthermore, it is explained that Allah is the owner of east and west. There is no God but Him. Therefore, let Muhammad saw submit all matters to Him. Allah's Word: So worship Him and put your trust in Him. (Hud\/11:123)"
		   },
		   {
			"id": 5485,
			"surah": 73,
			"ayat": 10,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to be patient and refrain from dealing with polytheists who utter obscene words against him and his God, because patience leads to the achievement of goals. Allah also commanded that Muhammad peace be upon him to cut ties with people like that wisely without throwing insults at them. In another verse, Allah says: When you (Muhammad) see people making fun of Our verses, then leave them until they move on to other talks. (al-An'am\/6: 68) And His words: So leave (Muhammad) the one who turns away from Our warning, and he only wants the life of the world. (an-Najm\/53: 29) Allah also said: Therefore turn you away from them, and give them advice, and say to them words that leave an impression on their souls. (an-Nisa'\/4: 63)"
		   },
		   {
			"id": 5486,
			"surah": 73,
			"ayat": 11,
			"tafsir": "This verse instructs Muhammad to return his affairs to Allah in dealing with the religious liars who are rich and boast about their wealth. It is Allah who will torment them with the punishment He has prepared for them. Therefore, let Muhammad saw let them boast about their wealth for a while, because Allah will definitely fulfill His promise to punish them as He has shown the believers on the day of the battle of Badr which happened not long after the revelation of the verse This. Allah said: We let them have fun for a while, then We forced them (to enter) into a severe punishment. (Luqman\/31: 24)"
		   },
		   {
			"id": 5487,
			"surah": 73,
			"ayat": 12,
			"tafsir": "This verse describes various kinds of God's punishment in the hereafter against these liars. Allah is able to punish them because He has shackles to bind their feet as an insult to them and there is no fear lest they run away. Allah has a fire of hell that is burning and can scorch and damage the skin of the face and body and weaken the joints of their bones. Allah has foods in the fire of hell which are suffocating in the throat which cannot be expelled nor swallowed. This is God's punishment that makes all parts of their bodies painful."
		   },
		   {
			"id": 5488,
			"surah": 73,
			"ayat": 13,
			"tafsir": "This verse describes various kinds of God's punishment in the hereafter against these liars. Allah is able to punish them because He has shackles to bind their feet as an insult to them and there is no fear lest they run away. Allah has a fire of hell that is burning and can scorch and damage the skin of the face and body and weaken the joints of their bones. Allah has foods in the fire of hell which are suffocating in the throat which cannot be expelled nor swallowed. This is God's punishment that makes all parts of their bodies painful."
		   },
		   {
			"id": 5489,
			"surah": 73,
			"ayat": 14,
			"tafsir": "This verse explains that the punishment will occur on the day when the earth and mountains shake so violently that the mountains and hills become scattered, scattered like piles of flying sand. God's word in another verse: And the mountains are like fluff. (al-Qari'ah\/101: 5)"
		   },
		   {
			"id": 5490,
			"surah": 73,
			"ayat": 15,
			"tafsir": "This verse explains that Allah has sent to the people of Mecca an apostle namely Muhammad saw to lead them to the right path and to be a witness for them on the Day of Judgment regarding their attitude towards the Prophet's invitation, whether they accept or reject it, as Allah sent a messenger to Fir 'Aun and his people. However, Pharaoh opposed Musa's apostleship so that Allah destroyed him and his followers by drowning them in the ocean. Therefore, let the people of Mecca take lessons from this event."
		   },
		   {
			"id": 5491,
			"surah": 73,
			"ayat": 16,
			"tafsir": "This verse explains that Allah has sent to the people of Mecca an apostle namely Muhammad saw to lead them to the right path and to be a witness for them on the Day of Judgment regarding their attitude towards the Prophet's invitation, whether they accept or reject it, as Allah sent a messenger to Fir 'Aun and his people. However, Pharaoh opposed Musa's apostleship so that Allah destroyed him and his followers by drowning them in the ocean. Therefore, let the people of Mecca take lessons from this event."
		   },
		   {
			"id": 5492,
			"surah": 73,
			"ayat": 17,
			"tafsir": "This verse confirms that disbelievers are not afraid of the Day of Judgment. Whereas on that day, they will not feel safe because of their disbelief. They were unable to resist God's punishment on a very terrible day that turned young people gray. The sky that day was divided. It shows how terrible that day was. The arrival of that day, that is, the descent of God's punishment on the disbelievers and God's reward in the form of favors on the believers, is God's promise that He will surely fulfill. Allah will not deny His promise."
		   },
		   {
			"id": 5493,
			"surah": 73,
			"ayat": 18,
			"tafsir": "This verse confirms that disbelievers are not afraid of the Day of Judgment. Whereas on that day, they will not feel safe because of their disbelief. They were unable to resist God's punishment on a very terrible day that turned young people gray. The sky that day was divided. It shows how terrible that day was. The arrival of that day, that is, the descent of God's punishment on the disbelievers and God's reward in the form of favors on the believers, is God's promise that He will surely fulfill. Allah will not deny His promise."
		   },
		   {
			"id": 5494,
			"surah": 73,
			"ayat": 19,
			"tafsir": "Allah confirms that actually the past things which reveal various things about the punishment that Allah has prepared for those who deny Him, and that humans cannot save themselves from His punishment, are teachings or warnings, especially for people who want to return to the path of his god. Walking the path to God means having faith in Him, doing deeds that are obedient to Him, and submitting oneself to Him. That is one's effort to achieve mardhatillah (please Allah). That is the straight and solid way of life."
		   },
		   {
			"id": 5495,
			"surah": 73,
			"ayat": 20,
			"tafsir": "In the previous verses, Allah ordered the Prophet Muhammad to pray at night, so in this verse, Allah shows His mercy to His servants. He gives relief to His servants by not obliging the Tahajud prayers every night. God confirmed that He knew that some of the Muslims and the Prophet prayed that night for 2\/3 of the night, or 1\/2 or 1\/3 of it. At that time it was still a mandatory order which of course sometimes felt heavy. When the first verse of surahh al-Muzzammil was revealed, the companions prayed according to the instructions in verses 2 to 4. This was sometimes burdensome, even though the Tahajud prayer was specifically made fard or obligated to the Prophet Muhammad, and was circumcised for his people. Many of the Companions did not know exactly how much 1\/2 or 1\/3 of the night was, so they were afraid of missing the ordered time for the night prayer, so some of them kept watch all night. This wearied their bodies greatly, for they were up until dawn. Of course getting up and being awake is physically debilitating. To alleviate this, Allah sent down this verse: ¦Allah knows that you cannot set time limits, so He gives relief to you ¦ (al-Muzzammil\/73: 20) From this verse 20 it can also be learned that carrying out the fard commands it should not exceed the specified size limit so as not to incriminate yourself. Therefore, Allah commands those who usually pray at night, if it feels a bit burdensome, they can reduce the time, so that they are not carried out under forced circumstances. That's how Allah makes it easy for something that is heavy to become light, so that someone always does what is easy. Likewise, in reading the evening prayers (including Magrib and Isha), you should read short verses, as narrated by al-Baihaqi and ad-Daruquthni from Qais bin Hazim that he prayed in congregation, led by Ibn 'Abbas. Qais said that Ibn 'Abbas recited some verses from the beginning of surahh al-Baqarah after al-Fatihah. After the prayer, Ibn 'Abbas taught those who followed him: After the prayer, Ibn 'Abbas approached us and said, Allah said, \"Read by you whichever is easy from (the verses of the Qur'an)\" (History of al-Baihaqi and ad -Daruquthni) The size of the easy verses is not further explained, nor is it for fardu prayers or Tahajud prayers and other sunnahs. It may be that reading which is easy from the verses of the Qur'an applies to some obligatory prayers and some sunnah prayers (such as the Midnight prayer). Then the second excuse (obstacle) was mentioned, namely due to illness, so that the demands for performing night prayers were reduced. The third old age is due to being busy looking for sustenance during the day. Fourth, because they are fighting with (physical) weapons to defend and defend Allah's religion from enemy attacks. The factor of being sick, busy looking for sustenance, and currently waging jihad in the way of Allah makes it difficult for a person to get up at night to pray the Tahajud prayer. Likewise, it turns out that this verse does not discriminate between the efforts of jihad to take up arms against the enemy by trying to earn sustenance, because both are beneficial for the Muslims, as long as they are carried out according to Allah's commands. Fighting means defending religion, trading or trying to be able to support family and religious activities (with zakat, alms, etc.). After mentioning three reasons that bring rukhsah (relief) in worship at night which also means that the obligation to pray at night (mansukh) is abolished, this verse also mentions what they should do after receiving the relief, namely, should read the Al-Qur'an in which prayer which is easy. Furthermore, Allah ordered to uphold prayer and issue zakat. In addition, it is also recommended to provide loans to Allah, in the form of providing a living (assistance) for the sake of sabilillah, both individually and collectively. With qiradh (loans) that this religion can be upheld, and social affairs can be upheld. In another verse it is stated: Whoever lends Allah with a good loan, Allah multiplies him in abundance. Allah withholds and expands (sustenance) and to Him you will be returned. (al-Baqarah\/2: 245) Then God recommends increasing alms (giving wealth to those who need it outside of the obligatory zakat) and increasing good deeds. What is spent and sacrificed by giving alms in the way of Allah, is better than what is spent on worldly interests, and thus a person increases his preparation to go to an eternal and eternal village. This verse ends with a recommendation that we increase istighfar (ask Allah for forgiveness), because there are too many sins and mistakes that we commit. Istighfar that Allah accepts is what will cover a person's disgrace when the calculation and accountability of human deeds are held before Him later. Allah is the Most Forgiving; He is the one who covers a person's sins or reduces them. He is the Most Compassionate, one who will not be tortured when his repentance has been accepted."
		   }
	]
}
