{
	"tafseer": [
		{
			"id": 6099,
			"surah": 95,
			"ayat": 1,
			"tafsir": "In this verse, Allah swears by figs and olives. Some argue that figs and olives are the names of fruits that are known today, which shows the advantages of the two fruits that are owned. There are also those who argue that what is meant is the place where many figs and olives grow, namely Jerusalem, where the Prophet Isa was born and received revelations. Two plant names, figs (at-tin) and olives (az-olives), and two places (Mount Sinai \"where the Prophet Musa received revelations; and a safe city (Mecca)\" where the Prophet Muhammad received revelations), were used by Allah to be a kind of proof of the truth of His oath. Some scholars state that at-tin and az-olive actually also refer to two places. At-Tin is a hill around Damascus, Syria. While az-zaitun is the place where Prophet Isa received revelations. There are also those who understand at-tin and az-olive as types of plants. Figs (at-tin) are the fruit of a type of tree that grows a lot in the Middle East region. The fruit when it is ripe is brown, and has seeds like tomatoes. It tastes sweet and is considered to have high nutrition. Scientific research shows that figs have a very high fiber content compared to other fruits. One dried fig contains 20% of the recommended daily fiber intake for people. As is known, research conducted in the last few decades shows that fiber from plants is very important for the digestive system to function properly. Fiber will help the digestive system and can also prevent a person from colon cancer. The content possessed by figs is also very promising. This fruit contains antioxidants that can prevent the onset of several diseases. Antioxidants play a role in neutralizing some of the damaging elements (free radicals), which are either produced in the body (due to chemical reactions in digestion) or enter the body from the outside. Phenol content in figs is also high. This Phenol ingredient functions as an antiseptic to kill microbes. Research at Rutgers University in the United States revealed that because of the high content of omega-3, omega-6 and phytosterols, figs have the potential to reduce blood cholesterol levels. As is known, omega-3 and omega-6 cannot be produced by the body. Both can only be obtained from food intake. Both types of fatty acids are also very influential on the performance of the heart, brain and nervous system. Phytosterol itself functions to remove cholesterol obtained from meat, before the cholesterol enters the blood tissue system. Fig trees contain minerals that are quite complete compared to other fruits. From 40 grams of figs contain 244 mg of potassium (as much as 7% of the requirement per day), 53 mg of calcium (6% of the requirement per day), and 1.2 mg of iron (6% of the requirement per day). The high levels of calcium are only beaten by oranges. Figs are also believed to accelerate healing in someone who is sick. This fruit contains the ingredients needed so that the patient's body is refreshed and energized quickly. The main nutritional component that figs contain is sugar. The percentage is quite high, which is as much as 51% to 74% of the entire fruit. Likewise with olives. A series of studies have revealed the various benefits of olives for human health. Olives, which are praised as \"trees full of blessings\" in verse 35 of surahh an-Nur\/24, are herbaceous plants. The types are scattered in the area around the Mediterranean Sea. The tree can reach hundreds of years old. Olives can be harvested for a very long time. As a food ingredient, olives contain several elements needed by humans, such as high enough protein, salt, iron and phosphorus, vitamins A and B. Olives are also known as skin softeners and are used in the soap industry. The oil also has advantages that are not owned by animal oil or other vegetable oils. It is known that olive oil is healthy for the heart and blood vessels. Some of the uses of olive oil are for heart and blood vessel health, cancer prevention, arthritis, slowing the aging process, helping children grow, lowering high blood pressure, and other uses for various internal organs."
		   },
		   {
			"id": 6100,
			"surah": 95,
			"ayat": 2,
			"tafsir": "After that, Allah swore an oath by Mount Sinai, where the Prophet Musa received the revelation (Torah). Regarding that the Prophet Musa received revelations at that place, it is also narrated, among others, in surahh al-A'raf \/ 7: 144. Allah said: (Allah) said, \"O Musa! Verily I chose (preferably) you over other human beings (in your time) to carry My messages and My words, therefore hold fast to what I give you and be among those who are grateful.\" (al-A'raf\/7: 144) In the previous verse it is told how Prophet Musa ascended Mount Sinai to receive revelation. In this verse, it is stated that Moses was appointed as a prophet and received revelation, namely the book of the Torah."
		   },
		   {
			"id": 6101,
			"surah": 95,
			"ayat": 3,
			"tafsir": "Furthermore, Allah swears by \"a land of peace\". The point is Mecca, where the Prophet Muhammad was born and received revelations. That Mecca is the place of origin of the Prophet Muhammad is also stated, among others, in surahh Muhammad\/47: 13: And how many countries whose (inhabitants) are stronger than (the inhabitants of) your country (Muhammad) have driven you out. We have destroyed them; so no one helps them. (Muhammad\/47: 13) In this verse there is information that he was forced to leave his native country, namely his birthplace (Mecca) and migrate to Medina. Based on other verses it is more appropriate to understand that the three verses above state the place where the three prophets were born or received their prophetic assignments. In other verses, the three prophets are often mentioned together, for example in surahh as-saff\/61: 5-6: And (remember) when Musa said to his people, \"O my people! Why do you hurt me, when you really know that I am Allah's messenger to you?\" So when they turn away (from the truth), Allah turns away their hearts. And Allah does not guide the wicked. And (remember) when Isa son of Maryam said, \"O Children of Israel! Truly I am the messenger of Allah to you, who confirmed the book (which was revealed) before me, namely the Torah and gave good tidings to an apostle who will come after me, whose name is Ahmad (Muhammad) .\" But when the apostle came to them with real proofs, they said, \"This is real magic.\" (as-saff\/61: 5-6) In the Old Testament, the Book of Deuteronomy 33 verse 2 also states the place of the three prophets, \"The Lord has come from Sina, and appeared to them in Seir, He saw Him with a glittering light from Mount Paran. \" Sina is the Sinai where the Prophet Musa received the revelation, Seir is the mountains in Baitul Maqdis where the Prophet Isa was born and received his prophethood, and the Paran mountains are the mountains of Mecca, where the Prophet Muhammad was born and received his prophethood."
		   },
		   {
			"id": 6102,
			"surah": 95,
			"ayat": 4,
			"tafsir": "After swearing by the beneficial fruits or noble places, Allah confirms that He has created humans with the best physical and psychological conditions. From a physical point of view, for example, only humans stand upright so that their brains are free to think, which produces knowledge, and their hands are also free to move to realize their knowledge, thus giving birth to technology. The human form is the most beautiful of all His creatures. From a psychic perspective, only humans have perfect thoughts and feelings. And what's more, only humans are religious. There are many other human privileges in terms of physical and psychological that it is impossible to describe here. Allah's affirmation that He has created human beings with the best physical and psychological conditions implies that human physical and psychological needs to be maintained and developed. The human physique is maintained and developed by giving him adequate nutrition and maintaining his health. And the human psyche is maintained and developed by giving him religion and good education. If the physical and psychological aspects of humans are maintained and developed, then humans will be able to provide great benefits to nature. Thus he will become the noblest being."
		   },
		   {
			"id": 6103,
			"surah": 95,
			"ayat": 5,
			"tafsir": "The best and most perfect human being will become useless if his growth is not maintained and his health is not maintained. The most perfect spiritual man will become evil and corrupt on this earth if he is not given a good religion and education. Weak humans will become a burden, and bad humans will ruin society. Finally in the afterlife he will go to hell. Thus, the human will become a humiliated creature."
		   },
		   {
			"id": 6104,
			"surah": 95,
			"ayat": 6,
			"tafsir": "Those who are protected from humiliation are those who believe and do good. Thus, the measure of glory is faith and good deeds. That's because faith means acknowledging the existence of God and the values He teaches. This acknowledgment will become his way of life or his creed, and because it has become his creed, he will implement those values with all his heart. Because the values taught by God are all good, humans who practice them will also be good humans. The higher a person's faith, the better his actions, so that he will be the best and noblest human being. Humans who have an attitude of life that is based on faith and good deeds will receive rewards from God without interruption. That faith and good deeds will bear fruit in the world, in the form of a peaceful life for him and for his people, and the happiness of living in the hereafter in heaven."
		   },
		   {
			"id": 6105,
			"surah": 95,
			"ayat": 7,
			"tafsir": "God questions if there are still people who think it's a lie what He told the Prophet Muhammad that human glory is measured by his faith and good deeds. That is because it is faith that will produce good deeds, while disobedience will only produce evil."
		   },
		   {
			"id": 6106,
			"surah": 95,
			"ayat": 8,
			"tafsir": "Allah confirms that implementing provisions regarding human glory is based on faith and good deeds, it is proof that Allah is Wise. This is because it is faith that will produce good deeds, while disbelief will only produce evil, as stated above. If glory is placed on disbelief and evil, it will destroy this world."
		   }
	]
}
