{
	"tafseer": [
		{
			"id": 6208,
			"surah": 109,
			"ayat": 1,
			"tafsir": "In these verses, Allah commands the Prophet Muhammad to declare to the disbelievers that the \"God\" they worship is not the \"God\" he worships, because they worship a \"God\" who needs helpers and has children or incarnates in some form or in some form or other forms that they charge. While the Prophet worshiped God who has no match and no partner for Him; have no children and wife. Reason is unable to guess how He, not determined by place and not bound by time, does not need mediation and does not need a link. The meaning of that statement is that there is a very big difference between the \"God\" worshiped by infidels and the \"God\" worshiped by the Prophet Muhammad. They characterize their god with characteristics that are not worthy at all for the God worshiped by the Prophet."
		   },
		   {
			"id": 6209,
			"surah": 109,
			"ayat": 2,
			"tafsir": "In these verses, Allah commands the Prophet Muhammad to declare to the disbelievers that the \"God\" they worship is not the \"God\" he worships, because they worship a \"God\" who needs helpers and has children or incarnates in some form or in some form or other forms that they charge. While the Prophet worshiped God who has no match and no partner for Him; have no children and wife. Reason is unable to guess how He, not determined by place and not bound by time, does not need mediation and does not need a link. The meaning of that statement is that there is a very big difference between the \"God\" worshiped by infidels and the \"God\" worshiped by the Prophet Muhammad. They characterize their god with characteristics that are not worthy at all for the God worshiped by the Prophet."
		   },
		   {
			"id": 6210,
			"surah": 109,
			"ayat": 3,
			"tafsir": "Furthermore, Allah added another statement that was ordered to be conveyed to unbelievers by stating that they did not worship the God preached by the Prophet Muhammad, because His attributes were different from those of the \"God\" they worshiped and it was impossible to reconcile the two types. that trait."
		   },
		   {
			"id": 6211,
			"surah": 109,
			"ayat": 4,
			"tafsir": "After Allah stated that it is impossible for there to be similarities in nature between the God worshiped by the Prophet and those worshiped by unbelievers, then naturally there is also no similarity in terms of worship. The God worshiped by the Prophet Muhammad is the Holy God of partners and rivals, does not incarnate on a person or side with a particular nation or person. Meanwhile, the \"God\" they worship is different from the God mentioned above. Moreover, the worship of the prophets is only for Allah alone, while their worship is mixed with shirk and interfered with negligence from Allah, so that is not called worship. The repetition of the same statement as found in verses 3 and 5 is to strengthen and make the people who proposed to the Prophet despair of the Prophet's refusal to worship their god for a year. This kind of repetition is also found in surahh ar-Rahman\/55 and al-Mursalat\/77. This is common in Arabic."
		   },
		   {
			"id": 6212,
			"surah": 109,
			"ayat": 5,
			"tafsir": "After Allah stated that it is impossible for there to be similarities in nature between the God worshiped by the Prophet and those worshiped by unbelievers, then naturally there is also no similarity in terms of worship. The God worshiped by the Prophet Muhammad is the Holy God of partners and rivals, does not incarnate on a person or side with a particular nation or person. Meanwhile, the \"God\" they worship is different from the God mentioned above. Moreover, the worship of the prophets is only for Allah alone, while their worship is mixed with shirk and interfered with negligence from Allah, so that is not called worship. The repetition of the same statement as found in verses 3 and 5 is to strengthen and make the people who proposed to the Prophet despair of the Prophet's refusal to worship their god for a year. This kind of repetition is also found in surahh ar-Rahman\/55 and al-Mursalat\/77. This is common in Arabic."
		   },
		   {
			"id": 6213,
			"surah": 109,
			"ayat": 6,
			"tafsir": "Then in this verse, Allah threatens the disbelievers with His words, namely, \"For you the reward for your deeds and for me the reward for my deeds.\" In another verse Allah says: For us our deeds, for you your deeds. (al-Baqarah\/2: 139)"
		   }
	]
}
