{
	"tafseer": [
		{
			"id": 4511,
			"surah": 46,
			"ayat": 1,
			"tafsir": "ha mim includes hijaiah letters which are located at the beginning of several surahs of the Qur'an. The interpreters differed on the meaning of the letters. For details, please review the description at the beginning of surahh al-Baqarah volume I \"Al-Qur'an and its tafsir\" with the title \"Fawatihus-suwar\"."
		   },
		   {
			"id": 4512,
			"surah": 46,
			"ayat": 2,
			"tafsir": "Allah confirms that this Al-Qur'an really comes from Him, there is no doubt about it, revealed to the Prophet Muhammad, contains provisions, guidance, and guidelines for human life to achieve happiness in life in this world and in the world. hereafter. Allah, who sent down the Qur'an to Muhammad saw, is the Almighty God, nothing can match Him. He is All-Wise. All commands, prohibitions, and actions of Allah are in accordance with the nature, uses, and benefits of what He created and this cannot be separated from the wisdom of the creation of nature as a whole. Because the Qur'an comes from Allah which was revealed to the Prophet Muhammad, then every human being should have faith in it, acknowledge the truth and practice all of its contents. Believing in the Qur'an means having to believe in the Prophet Muhammad as Allah's messenger, by following all of his traditions."
		   },
		   {
			"id": 4513,
			"surah": 46,
			"ayat": 3,
			"tafsir": "After confirming that the Qur'an is His revelation, not the composition of Muhammad, Allah explained that it was He who created the heavens and the earth and everything in between. This creation contains wisdom, even though humans are not yet able to know all of these wisdoms. Humans must always try to explore this wisdom in order to take advantage of the messages of the Qur'an. In another verse it is explained that one of God's purposes for creating the earth and everything on it is for the benefit of mankind. Allah said: O our Lord, you did not create all this in vain; Glory to You, protect us from the punishment of hell. (Ali 'Imran\/3: 191) In another verse it is explained that Allah made the heavens and the earth not to cause tyranny and destruction, but to give birth and prove truth and justice. In declaring justice, God distinguishes between those who do good and those who do bad or evil, both in His attitude toward them, and in giving recompense for their deeds. Allah says: And Allah created the heavens and the earth with the right purpose and so that every soul is rewarded according to what it does, and they will not be harmed. (al-Jatsiyah\/45: 22) Allah created the heavens and the earth for His appointed time so that in that period there is an opportunity for humans to do everything that is good for them, in accordance with Allah's provisions so that they can enjoy the true happiness of life. This is of course also in accordance with the potential and endeavor rights that God has given him. Because Allah has created the heavens and the earth with all the wisdom and benefits, then to show His justice and prove the wisdom of the creation of both, Allah created the Day of Judgment. With the Day of Judgment, all human actions can be rewarded fairly. The Day of Judgment will come after the end of the allotted time for the heavens and the earth. On the Day of Judgment, rewards are determined for those who carry out Allah's commands and stay away from His prohibitions in the form of eternal happiness in heaven. As for those who disobey Allah's commands and violate His prohibitions, they will suffer the misery they will experience in hell. Statements regarding the creation of the heavens and the earth were made with a true purpose found in the Qur'an (among others, surahh Ibrahim\/14: 19). In verse 3 of surahh al-Ahqaf\/46, the word \"within the specified time\" is added. These words can be taken to mean that God told us about the time it took for the earth to form and be habitable. A clearer description of the time or period of creation is found in surahh al-A'raf\/7: 54 (see explanation in juz 8). At the end of this verse, the polytheists' denial of the warnings that have been conveyed to them is explained. It was explained that even though they had been presented with strong evidence about the truth of the Qur'an as the word of Allah, the appointment of Muhammad as His messenger, and the religion that Muhammad brought, they remained in polytheism. They still turn away from the warning by denying Allah's commandments and violating His prohibitions, and they even reject the arguments and evidence for no good reason. They are as if people who are deaf, dumb, blind and senseless so they cannot hear and understand the call and warning. They do not want to believe that their negligence and negligence will lead to continual regret in the hereafter, in addition to experiencing severe torment."
		   },
		   {
			"id": 4514,
			"surah": 46,
			"ayat": 4,
			"tafsir": "After confirming that He is the one who has the right to be worshiped, He is the Most Compassionate, Most Merciful, Most Just God, and after confirming that there is a Day of Judgment, Allah points out the error in the beliefs of polytheists who worship other than Allah. He ordered the Prophet Muhammad to say to those who worship other than Allah as follows, \"O polytheists, explain to me about the idols that you worship, after you pay attention to the events of the heavens and the earth and what is in them, after pay attention to the laws that apply to celestial bodies, the universe from the smallest to the largest, from the visible to the invisible, from the subtle to the gross, also after you pay attention to what happened animals, plants, up to the occurrence of yourself, all of which were created neatly, beautifully, usefully and full of wisdom. Is there anything on this earth that has been created by idols so that it is worthy and has the right to be worshiped? Or has it created something in the heavens with Allah?\" From this verse it can be understood that polytheists are unable to prove with reasonable grounds that idols have the right to be worshiped beside Allah because they cannot show even one small object among the objects that exist on this earth as creations. that idol. Even what is proven is that the idols themselves are the result of their own making. The end of this verse emphasizes that in the holy books that Allah has sent down to His messengers there is not a single statement that explains that idols must be worshiped beside Allah. Likewise, in the knowledge that was passed down by the ancients, there was no information that was used as the basis for the worship of idols. Allah ordered this to be conveyed to the polytheists, \"O polytheists, if the belief in worshiping idols is true, try to state just one verse from the verses contained in the holy books which were revealed before the Al-Qur'an which justifies your belief, or the knowledge of previous people that you have that justifies the belief in shirk.\""
		   },
		   {
			"id": 4515,
			"surah": 46,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that polytheists who worship idols without a valid reason are people who are misguided because they worship something that cannot be done, seen, heard, let alone accept the prayers of those who pray to them. It cannot be done in this world, and in the hereafter it is certainly even more impossible to do. The idols are actually dead stones or wood carved by humans themselves. Therefore, they cannot hear, understand, and pay attention to those who pray to them. A righteous person is a person who adheres to the correct creed, namely the monotheistic creed which leads people to worship only Allah, the One Almighty God, the Supreme Creator, who determines all things, who guides humans to the path of happiness in this world and in the hereafter."
		   },
		   {
			"id": 4516,
			"surah": 46,
			"ayat": 6,
			"tafsir": "This verse describes the condition of the polytheists in the hereafter and the idols they worship. When all humans have been raised from their graves and gathered to be given account, the idols, gods and other idols that they worship besides Allah deny the actions of the polytheists who worship them by saying, \"We never ordered them to worship We don't know what they did to us, we don't even know that they have worshiped us because we are inanimate objects, cannot see, hear, speak, let alone answer the prayers of those who pray. Allah said: And he (Ibrahim) said, \"Indeed, the idols that you worship besides Allah, are only to create feelings of affection between you in the life of the world, then on the Day of Resurrection some of you will deny and curse each other ; and your return is hell, and there is absolutely no helper for you \". (al-'Ankabut \/ 29: 25) In another verse, Allah says: And they have chosen gods besides Allah, so that these gods will be protectors for them. Not at all! Later they (gods) will deny their worship of him, and will become enemies to them. (Maryam\/19: 81-82)"
		   },
		   {
			"id": 4517,
			"surah": 46,
			"ayat": 7,
			"tafsir": "This verse explains the attitude of the polytheists when the Prophet Muhammad recited the verses of the Qur'an to them. They say that the verses of the Qur'an are magic recited by a sorcerer, namely Muhammad peace be upon him. According to them, witches are used to inventing lies and bewitching others to achieve their goals. In another verse, the accusations of polytheists against the Qur'an are explained that the Qur'an is a confounded dream made up, and that Muhammad is a poet. Allah says: In fact they say, \"(The Qur'an is the fruit of) dreams that are confused, or the result of engineering (Muhammad), or even he is just a poet, try to bring us a sign (proof), like earlier messengers.\" (al-Anbiya'\/21: 5) The polytheists accused Muhammad of being a sorcerer because according to them, Abu al-Walid bin al-Mugirah had bewitched him. Due to the influence of the magic, he expressed his admiration for the verses of the Qur'an that the Prophet had recited to him. This story began when, at one time, before the Prophet Muhammad migrated to Medina, the Quraysh leaders gathered to discuss how to subdue the Prophet. After deliberation, they finally agreed to send Abu al-Walid, an Arabic writer who had no equal at that time, to come to the Prophet, asking him to stop conveying his message. In answer, Rasulullah read surahh 41 (Fussilat) from beginning to end. Abu al-Walid was fascinated by the recitation of the verse; he was pensive thinking about the height of the content and the beauty of the style of language. Then he immediately returned to his people, without saying a word to the Prophet. After Abu al-Walid returned, he was asked by his people about the results of his efforts. They wondered why Abu al-Walid was so gloomy. Abu al-Walid replied, \"I have come to Muhammad and he replied by reading verses of the Qur'an to me. I have never heard such beautiful words. But those words are not poetry, not magic, nor are they the words of a soothsayer. Indeed, the Qur'an is like a tree whose leaves are shady, its roots sink into the ground, the wording is coherent and pleasant to hear. The Qur'an is not the words of a human being. It is very high and nothing can match the beauty of its composition.\" Hearing Abu al-Walid's answer, the Quraysh accused him of being a traitor and tending to be attracted to Islam because he had been influenced by the magic of the Prophet Muhammad. From the attitude of Abu al-Walid after hearing the verses of the Qur'an and the attitude of the Meccan polytheists towards Abu al-Walid, it can be concluded that in fact their hearts have acknowledged the truth of the Qur'an, have admired its content and style of language, but there is something that prevents them from speaking and stating the truth. Abu al-Walid, a man they prided themselves on for his expertise in Arabic literature and language, did not move in the slightest and was fascinated by listening to the verses of the Qur'an. What about those who are far less knowledgeable than Abu al-Walid? Because there is no single reason that they can come up with, and to cover up their weaknesses, they immediately accuse that the Qur'an is magic in the form of poetry, and Muhammad is a sorcerer who bewitches people with utterances in the form of poetry. In another verse, it is explained that the reasons that push the polytheists not to acknowledge the truth of the Qur'an even though their own hearts have acknowledged it, are their bigotry towards the beliefs of their ancestors. Allah said: In fact they said, \"Indeed we found our forefathers professing a religion, and we were guided to follow in their footsteps.\" (az-Zukhruf\/43: 22). In addition to fanaticism towards the teachings of their ancestors, they are also worried that they will lose their position as tribal or clan leaders, if they express their true feelings about the truth of the Prophet Muhammad's message."
		   },
		   {
			"id": 4518,
			"surah": 46,
			"ayat": 8,
			"tafsir": "Besides accusing Muhammad of being a sorcerer, the polytheists also accused him of being a person who likes to make things up and say nonsense about Allah. Therefore, Allah ordered Muhammad to refute the accusation by saying, \"Suppose I lied by making things up or saying nonsense about Allah, as if I were not an apostle, but I said that I was an apostle of Allah who was sent Allah will surely inflict a very severe punishment upon you, and no one on this earth can prevent me from that punishment. Can I make up something and say nonsense about Allah and Al- Qur'an, and made myself the target of Allah's punishment, even though no one can help me from it?\" Allah said: And if he (Muhammad) concocted some words on Our (name), We would surely hold him in his right hand. Then We cut his heart vessels. So none of you can prevent (We are to punish him). (al-haqqah\/69: 44-47). At the end of this verse, Rasulullah saw emphasized to the polytheists that Allah is All-Knowing of all their actions, words, and their reproaches against the Qur'an, for example saying that the Qur'an is magic, poetry, a lie, and so on; therefore He will reward you accordingly. The Prophet Muhammad said that Allah is enough to be a witness about the truth of himself conveying Allah's religion to them. Allah will also be a witness of their denial and attitude that rejects the truth. Furthermore, Allah ordered the Prophet Muhammad to tell polytheists that even though they disbelieved in Allah and His Messenger, and against the Qur'an, the door of repentance remains open for them. Allah will accept their repentance as long as they truly repent to Him with the determination that they will no longer be disobedient to Him, and will not commit other sinful acts. Allah wants to accept their repentance because He is Forgiving and continues to give mercy to those who repent and return to Him."
		   },
		   {
			"id": 4519,
			"surah": 46,
			"ayat": 9,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to say that he is not the first among the apostles. As already mentioned in the vocabulary description, bid' means something new, or something that is for the first time. If the polytheists deny the apostleship of Muhammad, even though previously there were many apostles of Allah from the Prophet Adam to the Prophet Jesus, then such denial is very strange and needs to be questioned because Muhammad was sent as an apostle, in fact, he was not the first among the apostles. Before the Prophet Muhammad, Allah has sent many prophets and messengers in every era and different places. The sending of the prophets by Allah to guide people is a universal human experience, not just to improve the situation of the polytheists of Mecca. So the sending of Muhammad to carry out the mission of the treatise is not something new at all. Furthermore, Allah ordered the Messenger of Allah to convey to the polytheists that he did not know in the slightest what Allah would do to him and them in this world, whether he should leave this country and migrate to another country as the previous prophets had done, or will he be killed like the other prophets who were killed. Nor did he know what would befall his people. All of this is known only by Allah, the All-Knowing. Rasulullah SAW reiterated that even though Allah has promised to give victory to the Muslims and will defeat the unbelievers, enter the Muslims into heaven and put the disbelievers into hell, he does not even know when that will happen. . From this verse it can be concluded that only Allah knows all that is unseen. The apostles and prophets did not know this unless Allah told them. Therefore, this verse strongly refutes the belief that the saints know what is unseen, know what will happen. Rasulullah saw himself as a messenger of Allah admitted that he did not know about unseen things, let alone the guardians whose level was far below the level of the apostles. In the hadith narrated by Imam al-Bukhari and other priests: From Ummul 'Ala', when 'Uthman bin Madz'un died I prayed that Allah would have mercy on you, O Abu al Saib, indeed Allah has glorified you. So the Prophet rebuked; How do you know that Allah has glorified him? As for him himself, he has received confidence from his Lord and I really hope for good for him. By Allah, I do not know, even though I am Allah's Messenger, what Allah will do to me, as well as to you all.\" Ummul 'Ala' said: \"By Allah, since then I have never purified (praised) anyone for -however. (Al-Bukhari) From the above it is clear that the Prophet himself did not know anything about the unseen. He did not know whether his friend 'Uthman bin Madz'un who had passed away was going to heaven or going to hell. However, he prayed that his friend would be given mercy by Allah. This also means that no one can predict anything about someone who has just died. Rasulullah saw himself did not know, let alone a wali or a scholar. If a wali claims that he knows the unseen, then that statement is a lie. The Messenger of Allah became angry when he heard people guessing the fate of someone who died as mentioned in the hadith above. This verse gives us instructions about good behavior in dealing with or mourning a friend who has passed away. The instructions are for us to pray and never predict their fate, because only God knows that. At the end of this verse, Allah orders the Messenger of Allah to confirm his true condition to corroborate what he has said. He was ordered to tell the polytheists of Mecca that he had followed nothing but the Qur'an which Allah had revealed to him, and that he had not invented anything. Everything comes from Almighty God. He is only a warner sent by God to convey a warning to them to protect themselves from the torment and wrath of God. The Holy Prophet also confirmed that he had conveyed to them strong proofs of the truth of his message. He's not an angel, so he can't do something humans can't."
		   },
		   {
			"id": 4520,
			"surah": 46,
			"ayat": 10,
			"tafsir": "Allah ordered His messenger to ask polytheists what their opinion would be if it were proven that the Qur'an was truly from Allah. By the fact that no one can match it, it is proved that the Qur'an is neither magic nor fabrication, as they accuse. However, they continue to deny and deny it, while there are among the Children of Israel who are more knowledgeable and experienced and smarter than them, but still admit the truth. What will God do with them? Wouldn't God punish them because of their denial and arrogance? He will not guide them so that they all become the most misguided people in this world. What is meant by a witness from the Children of Israel is 'Abdullah bin Salam, in accordance with the hadith narrated by at-Tirmidhi, Ibn Jarir, and Ibn Mardawaih from 'Abdullah bin Salam himself. He stated: \"Allah has sent down verses of the Qur'an about me. Sent down about me verses: wa syahida shahidun min Bani Israil 'ala mitslihi, and verses: Qul kafa billahi syahidan baini wa bainakum wa man ' indahu 'ilmul Kitab .\" (History of at-Tirmidhi) The statement of 'Abdullah bin Salam is corroborated by the hadith of Rasulullah saw: From Sa'ad bin Abi Waqqas, he said, \"I have never heard Rasulullah SAW say to someone who is on earth that he is one of the experts in heaven, except to 'Abdullah bin Salam; and regarding him the verse was revealed: \"Wa shahid martyr min bani Isra'ila 'ala mitslihi.\" (Al-Bukhari) 'Abdullah bin Salam was a Jew resident of the city of Medina. He studied and understood both the contents of the Torah which mention that later the last prophet and apostle will come from the Prophet Abraham, and from the path of the Prophet Ismail, in the Arabian Peninsula, who brought the Al-Qur'an as a book sent down by Allah to him. After Rasulullah saw migrated to Medina, ' Abdullah paid attention to the characteristics of the Prophet and the teachings he conveyed in the form of verses from the Qur'an that Allah revealed to him. He observed the attitude of the Prophet towards fellow human beings and the attitude of his followers who had ah explore the new religion. In the end, he concluded that the Prophet and the religious teachings he brought had the same characteristics as those implied by the Torah which he had studied and practiced. Likewise the characteristics of the followers of the new religion. Therefore, he declared himself converted to Islam and became a follower of the Prophet Muhammad. Thus, it can be understood that Jews and Christians who really follow and believe in the Torah and the Bible, will definitely come to the conclusion that the Qur'an is truly from Allah and that Muhammad is truly His messenger. as has been done by 'Abdullah bin Salam. At the end of this verse, Allah confirms that polytheists are actually people who are arrogant and deny Allah's verses. Therefore, they have wronged themselves. As a result of attitudes and actions like that, Allah no longer gives instructions to them. This is in accordance with sunatullah that Allah will not give instructions to any unjust person. They get the wrath of Allah in this world and in the hereafter."
		   },
		   {
			"id": 4521,
			"surah": 46,
			"ayat": 11,
			"tafsir": "This verse explains that the words of the Meccan polytheists about the Qur'an and those who believe are not true. They said those words because several people whom they considered to be poor, stupid, and of low rank, such as 'Ammar, Suhaib, Ibnu Mas'ud, Bilal, Khabbab, and others, had converted to Islam. According to them, something that is true and comes from God must be acknowledged for its truth by nobles, rich people, respected people and the authorities. That is the measure of truth according to them. If the truth is only recognized by people who are lowly in rank, poor, and common people, then the truth is false. The words of the polytheists of Mecca were, \"If the Al-Qur'an which was revealed to Muhammad saw contained virtue, surely we nobles, nobles, and prominent people would have believed in him first because we know better and do it earlier. kindness than those people who are of low rank. Now, it is they who believe before us. We can use this as proof that the Qur'an has no value and does not contain the slightest virtue.\" Qatadah said, \"The polytheists said, we are more powerful. If there is something good, of course we know more about it. Because we know more, of course we determine it. No one can precede us in this matter. Regarding the words them, this verse was revealed.\" According to one tradition, when the Juhainah, Muzainah, Aslam, and Gifar tribes embraced Islam, the Banu 'Amir, Bani Gatafan, and Banu Asad said, \"If the Islamic religion were the truth, surely we would not have been preceded by these animal herders. .\" Because the polytheists have been locked in their hearts, ears, and sights by envy and lust, they can no longer take the guidance of the Qur'an, and accuse that the Qur'an is false news, the tales of the ancients, magic, invented by Muhammad, and meaningless. The accusations of the polytheists are also explained in the word of Allah: And the disbelievers say, \"This (Qur'an) is nothing but a lie concocted by him (Muhammad), assisted by other people,\" Indeed, they have committed injustice and a great lie. And they said, \"(It's just) the tales of the ancients, who were asked to write down, then read those tales to him every morning and evening.\" (al-Furqan\/25: 4-5) According to Islamic teachings, a person's faith and piety are not related to the status of that person whether he is rich or poor, noble or slave, ruler or commoner, and knowledgeable or uneducated. Everyone, regardless of nationality, skin color, and level in society can become a Muslim who believes and is pious because the main points of faith and piety are purity of heart, the desire to seek the essential truth, and the ability to control passions. In a hadith it is stated: Know that in the human body there is a clot of blood. If it is good, the whole body is good, and if it is bad, the whole body is bad. Know that the clot of blood is the heart. (History of al-Bukhari and Muslim from an-Nu'man bin Bashir)"
		   },
		   {
			"id": 4522,
			"surah": 46,
			"ayat": 12,
			"tafsir": "This verse rejects the accusations of polytheists against the Qur'an and proves its truth by saying, \"O disbelievers, you all have witnessed that Allah has sent down the Torah which contains religious principles brought by the Prophet Musa and as a mercy for the Children of Israel. The Torah which was revealed to the Prophet Musa indicated the arrival of Muhammad as the last prophet and messenger who brought the Arabic Qur'an, confirmed the previous books revealed by Allah so that with that book he would warn all people, give good news to those who practice what it says, and warns that the punishment and threats of Allah will befall those who disbelieve in them.\" Even though the existing Torah has been corrupted by human hands, there are still many verses which hint at the coming of the Prophet Muhammad as the last and most perfect prophet and messenger. This can be read in the book of Genesis 13: 2, 3; 15; 16: 10, 12 and many more. In the book of Genesis 21: 13, it is explained that the arrival of the greatest prophet from the descendants of the Prophet Ismail, \"Then I will make your son of yours a nation, because he too is from your seed.\" Likewise in Genesis 21: 13, \"Get up, raise the slave, support him because I want to make him a great nation.\" Also in the book of Genesis 17: 20, \"Then regarding Ishmael also I have granted your request: that I have blessed him and spared him and multiplied him greatly and twelve kings will be separated from him and I will make him one great nation .\" Of course what is meant by the verses of the Torah above is the Prophet Muhammad. The Prophet Musa in the book of Deuteronomy 18: 17-22 has also stated the arrival of the Prophet Muhammad: So at that time the Lord said to me (Moses). It is true what they (the Children of Israel) said. That I (Allah) will make for them a Prophet from among his brothers (i.e. from the Children of Ishmael) who is like you (O Musa), and I will put all My words in his mouth and he will tell him everything I tell him to . That in fact whoever does not want to hear all of My words that will be spoken by him in My name, surely I will obey that person later. But who conducts himself with pride and speaks words in My name, which I did not order to say, or who speaks in the name of the gods. The Prophet will be killed by law. So if you think you are saying in your heart like this: How can we know that these words are not the word of God. That if the Prophet spoke in the name of God and then said someone had disappeared or had not come, that is a word that was not the word of God, then the Prophet also said arrogantly, do not be afraid of him. In the six verses of the Torah above, there are several signs that can be used as evidence to state the prophecies about the Prophet Muhammad. From the words \"a prophet from among all his brothers\" shows that the person prophesied by God will come from the brothers of the Children of Israel, not from the Children of Israel themselves. As for the brothers of the Children of Israel, they were the Children of Ismail (Arabs) because Ismail was the older brother of Isaac, the father of Israel (Jacob). And the Prophet Muhammad clearly came from the descendants of Ismail. Then the sentence \"Who is like you\" gives the sense that the prophet who will come must be like the Prophet Moses, that is, a prophet who brings a new religion like Moses. As is known, it was the Prophet Muhammad who brought the new Shari'a (Islamic religion) which also applies to the Children of Israel. Then it was explained again that the Prophet was not arrogant and would not be killed. Muhammad saw, as it is understood, was not an arrogant person, both before becoming a prophet and after becoming a prophet. Before becoming a prophet, he was loved by the people, as evidenced by the title al-Amin, which means \"trusted person\". If he was arrogant, surely he would not be given that highly commendable title. After becoming a prophet, he was even more friendly. The Christians acknowledge the prophecy to Prophet Isa while they also admit that Jesus was killed. This is clearly contrary to the verse of the prophecy itself, because the prophet in question must not have been killed (crucified or other reasons). Those are the affirmations given by the prophets before the advent of the Prophet Muhammad. Everything was known by the Meccan infidels who denied the prophethood of Muhammad."
		   },
		   {
			"id": 4523,
			"surah": 46,
			"ayat": 13,
			"tafsir": "This verse describes the condition of those who truly believe in Allah, namely those who confess and say, \"Our Lord is Allah\", then he istikamah, that is, he remains in that confession, not being mixed up in the slightest with acts of shirk. . That person consistently follows the line that has been determined by religion, follows God's commands truthfully, and stays away from His prohibitions. So people like that will not have a worry in themselves on the Day of Resurrection, because Allah guarantees their safety. They do not need to grieve for what they leave behind in the world after death, as well as for something that they missed and lost while living in that world and have no regrets in themselves at all."
		   },
		   {
			"id": 4524,
			"surah": 46,
			"ayat": 14,
			"tafsir": "In this verse, Allah confirms that those who believe in Allah and then istikamah in their faith by carrying out worship and Allah's commandments, remaining trusting, and avoiding His prohibitions, will obtain eternal happiness in the hereafter, namely becoming residents of heaven and stay in it. They are provided with various pleasures in heaven, in return for their good deeds in this world. The attitude of istikamah after having faith and performing worship to Allah is important and very commendable, as the hadith of the Prophet saw commanded us all: Say, \"I believe in Allah,\" then be istikamah. (Muslim history from Sufyan bin 'Abdullah ats-saqafi)"
		   },
		   {
			"id": 4525,
			"surah": 46,
			"ayat": 15,
			"tafsir": "It is narrated that this verse was revealed in connection with Abu Bakr. He was one of the lucky ones because he was one of the closest friends to the Prophet. One of his daughters, namely 'Aisyah, was the wife of Rasulullah saw, and her parents, namely Abu Quhafah and Ummul Khair bint Shakhar bin Amir had converted to Islam, as had her other children and siblings. He repented, gave thanks, and prayed to Allah for obtaining incomparable favors. Allah commands that all humans do good to their parents, both when they are still alive and when they have passed away. Doing good is doing all good deeds in accordance with religious orders. Doing good to parents is respecting them, caring for them, and providing a living when they have no more income. While doing good to both parents after death is always praying for them to Allah so that they will be rewarded and forgiven for all their sins. Doing good to both parents is a deed that is of high value in the sight of Allah, while disobedience to them is a major sin. Children are the continuation of life for both parents, ideals or actions that could not be done during his lifetime are expected to be continued by his children. Therefore, children are also the hope of their parents, not only when they are still alive, but also after they die. In the hadith of the Prophet Muhammad, it is explained that among the charities that will not end the reward received by humans even though he has died is the prayer of pious children which is always intended for their parents. Rasulullah saw said: When a human being dies, his charity is cut off except for three things: sadaqah jariyah, useful knowledge, or a pious child who prays for him. (Muslim history from Abu Hurairah) From this hadith it can be understood that parents should educate their children to be obedient to Allah, to do good deeds, carry out Allah's commands, and stay away from His prohibitions. Education can be done in various ways, for example by education at school, education at home, setting a good example, and so on. Only virtuous children who obey God and are charitable can worship and pray for their parents. In this verse, Allah specifically explains why people should do good to their mothers. This specialization shows that when children want to do good to their parents, the mother must take precedence over the father. Because the attention, sacrifice and suffering of mothers is greater and more numerous in caring for and educating children compared to the attention, sacrifice and suffering experienced by fathers. Among the sacrifices, care and suffering of mothers are: 1. Mothers bear children in a state of trials and suffering. At first it was felt that the womb was light, even though changes had started to appear in her, such as eating badly, feeling restless, sometimes nausea, vomiting, and so on. The longer the content is getting heavier. Increasing the weight of the womb increases the weight of the trials that are borne by the mother, until the moment of giving birth. The ordeal was almost unbearable, it felt like one's life would end. 2. After the child is born, the mother cares for and breastfeeds him. Pregnancy and breastfeeding period is 30 months. The verses of the Qur'an explain that the most perfect breastfeeding period is two years. Allah says: And mothers should breastfeed their children for two whole years, for those who want to breastfeed perfectly. (al-Baqarah\/2: 233) In this verse it is explained that the period of breastfeeding and pregnancy is 30 months. This means that the mother must shed her attention during pregnancy and breastfeeding, which is 30 months. In connection with this verse, there is a history that says that a woman gave birth in six months of pregnancy. So the case was submitted to 'Uthman bin 'Affan, the caliph at that time. 'Uthman intended to carry out the law of had (stoning) because the woman was suspected of having committed adultery before entering into the marriage ceremony. So 'Ali bin Abi Talib expressed his opinion to 'Uthman by saying, \"Allah swt stated that the period of breastfeeding is two years (24 months), and in this verse it is stated that the period of pregnancy and breastfeeding is 30 months. This means that the period of pregnancy is at least 6 months. It means that a woman cannot be stoned because she gave birth during the pregnancy specified in the verse.\" Hearing that, 'Uthman bin 'Affan changed his opinion and followed the opinion of 'Ali bin Abi Talib. Ibn 'Abbas said, \"If a woman is pregnant for nine months, she only breastfeeds her child for 21 months, if she is pregnant for 7 months, she only breastfeeds her child for 23 months, and if she is pregnant for 6 months she breastfeeds her child for 24 months. Because Therefore, it is very wise if a child is breastfed with mother's milk (ASI), in accordance with the teachings of the Qur'an and also in accordance with the guidance of medical science, unless due to circumstances he can be replaced with other milk products. has a lot to do with the child in nurturing and educating him, until the child is able to be independent. The mother's obligation to care for and educate her child is not only as long as the mother is bound by marriage to the child's father, but also when she is divorced from the child's father. Mother's love and affection for their children is a provision from Allah, as His word: And We commanded humans (to do good) to their parents. conceived him in a state of increasing weakness, and weaned him at the age of two. (Luqman\/31: 14) Regarding the above issue, Rasulullah saw answered a friend's question in one of the hadiths: From Bahz bin Hakim from his father from his grandfather, hopefully Allah will be pleased with him, he said, \"I said, 'O Messenger of Allah, to whom am I devoted? The Messenger of Allah replied, 'To your mother. I said, 'Then to whom? The Messenger of Allah replied, 'To your mother. I said, 'Then to whom? The Prophet said, 'To your father, then to your closest relative, then to the closest. (History of Abu Dawud and at-Tirmidhi) The father's responsibility as a parent is as the head of the family who is responsible for caring for, providing for, and maintaining peace and harmony in the family. The father as the leader of the family can divide the tasks between his wife, older children and other family members who live in the family. The spiritual responsibility as a father is to bring the family close to Allah, carry out worship correctly and give birth to new generations, as Allah says: And those who say, \"O our Lord, grant us our spouses and our offspring as gladdens of the heart ( us), and make us leaders for a pious people.\" (al-Furqan\/25: 74) This verse describes the good attitude of a child towards his parents who have cared for him from childhood to adulthood, when his parents are old, weak, and senile. At that time the child was about 40 years old, he prayed, \"O my Lord, give me guidance and instructions to be grateful for Your incomparable favors that You have given me, both related to instructions so that I can carry out Your commands and avoid Your prohibitions, as well as the instructions that You have given to my parents so that they pour out their affection on me, from when I was still in the womb, when I was small until I grew up. O my Lord, accept all my deeds and instill in me the spirit of wanting to do good deeds according to Your good pleasure, and also guide my descendants to follow the straight path; make them pious and do good deeds.\" In connection with this verse Ibn 'Abbas said, \"Whoever has reached the age of 40 years, while his good deeds have not been able to overcome his evil deeds, then let him get ready to go to hell.\" In another history, Ibn 'Abbas said, \"Allah has allowed Abu Bakr's prayer. He has freed nine believing slaves including Bilal and Amir bin Fuhairah. He never intended to do a good deed, but Allah helped him. He prayed, \" O my Lord, give goodness to me, by giving goodness to my children and grandchildren. Make goodness and piety become flesh and blood for my descendants.\" Allah has accepted his prayer. None of his children do not believe in Allah; his parents and children all believe. Therefore, none of them the companions of the Prophet who received such virtues. It was narrated by Abu Dawud from Ibn Mas'ud in his Sunan that the Messenger of Allah taught the following prayer: O my Lord, cause compassion in our hearts; bring peace between us, guide us to the way of salvation. Deliver us from darkness and guide us to bright light. Keep us away from all abominations both outward and inward. Bless us to our hearing, to our sight, to our hearts, to our wives, to our descendants . Accept our repentance, verily You are the Accepting of repentance, the Most Merciful. Make us people who are always grateful for favors You and praise You, because of the provision of Your favors and complete Your favors upon us. (History of Abu Dawud)"
		   },
		   {
			"id": 4526,
			"surah": 46,
			"ayat": 16,
			"tafsir": "In this verse, the reward that will be received by a pious person who has the characteristics of a pious child as mentioned in the previous verse is explained. People like that are people who have the best deeds while living in the world according to Allah's sight because of their sincerity, obedience, and devotion to carrying out His religion. People like that will be forgiven for all their mistakes because they always repent to Him with true repentance. He gets a paradise full of pleasure in the hereafter. At the end of this verse, Allah confirms that the reply mentioned comes from Allah, and all that He has ever promised, both promises to reward believers and warnings to punish unbelievers, must be fulfilled; none of which He will deny."
		   },
		   {
			"id": 4527,
			"surah": 46,
			"ayat": 17,
			"tafsir": "This verse explains God's threat to a person who, when asked by his parents to believe in Allah and the Hereafter, said, \"Ah, what are you saying; I am not happy with you who say that I will be resurrected from grave alive, after I die and crumble along with the ground. Is it possible that the flesh that has been crushed along with the ground and the bones that have been scattered will be able to be collected again and become a living body as before? What a strange and funny belief that, O my parents. Haven't there been many people before us, who have done everything according to their wishes? Some of them followed the teachings of the apostles who had been sent to them, and many of them denied it. , but not one of them has been resurrected like what mother and father said. If what father said is true and that mother, surely we will see the evidence now, and surely we will meet our ancestors who died long ago.\" Hearing his son's answer, a feeling of sadness and pity arose in the old man's heart. They feel sad because their son's attitude doesn't seem to respect him anymore. They feel sorry for them because they believe that their child will be punished by Allah in the hereafter. Even so, they did not give up on calling for their child and asking Allah, the Most Gracious. They said, \"Believe, O my child, that Allah will surely keep His promise, and you should be sure that you will really be resurrected later, because Allah's promise is a right promise, which must be fulfilled, may Allah give you guidance.\" Allah forbids children from saying ah to their mother and father, or other words that hurt their parents, because both of them have contributed to nurturing and educating them from childhood, even from their womb to maturity, as Allah says: And We command humans (to do well) to his parents. His mother had carried him in a state of increasing weakness, and weaned him at the age of two. Be thankful to Me and to your parents. Only to Me will you return. (Luqman\/31: 14) If parents educate their children to believe in Allah and the Last Day, then the child refuses and says ah, which is a great disobedience and a real error. In another verse it is stated: And your Lord has commanded you not to worship other than Him and to do good to your parents. If one of them or both of them reaches an old age under your care, then never say \"ah\" to both of them and don't yell at both of them, and say good words to both of them. (al-Isra'\/17: 23) Responding to the invitation of his parents, the child replied in an insulting manner to both of them by saying that his parents' invitation to believe in Allah and the Last Day was just the fairy tales of the ancients. He thinks his parents have been influenced by a hoax so he admits the truth. According to him, there is a day of resurrection is a belief that it is impossible to happen."
		   },
		   {
			"id": 4528,
			"surah": 46,
			"ayat": 18,
			"tafsir": "Allah threatens every child who behaves as described in the verse above to his parents. They will surely be punished in the afterlife, earn the wrath and anger of Allah, and be put into hell with a blazing fire, along with the ancient peoples who disobeyed Allah, belied the apostles, and abused their parents, both of them from the jinn group as well as humans. Thus, that hell will be filled with all of them as promised by Allah. From this verse it can be understood that the jinn are God's creatures who have the same obligations as humans. Among them, there are those who adhere to Islam like the Muslims, and some are infidels. They live and die like humans. Abu Hayyan said, \"Al-Hasan al-Basri said in a halaqah (majlis) lesson, \"The jinn does not die.\" So Qatadah refuted this by bringing up this verse. Then al-Hasan al-Basri was silent. Allah punishes them, jinns and humans, because they are a group of losers. They lose because they have wasted the nature that Allah has given them. From the time they are in the womb, humans have been given by God an instinct, namely the potential to become believers. However, the potential that is in him is wasted, by following the desires and temptations of Satan, and being influenced by worldly life and the environment so that they become losers in this world especially in the hereafter. Allah has instilled in him so that he believes in Allah and His Messenger, and always gets guidance, guidance and taufik in his life. : So keep your face straight to religion (Islam); (according to) Allah's fitrah because He has created humans according to that (fitrah). There is no change in Allah's creation. (That is) the straight religion, but most people do not know. (ar-Rum\/30: 30)"
		   },
		   {
			"id": 4529,
			"surah": 46,
			"ayat": 19,
			"tafsir": "Allah explains that humans and jinns have a certain dignity with Him on the Day of Judgment, according to the deeds and deeds they have done while living in the world. Those who believe and do good deeds are divided into several degrees of varying height, while those who disbelieve in Allah are also divided into several ranks of varying degrees of lowness. Differences in high or low dignity are caused by differences in one's faith and deeds, in addition there are also differences in disbelief and disobedience. In other words, Allah determines the different dignity due to differences in the deeds of humans and the jinn themselves. Some of them are firm in their faith and do a lot of deeds, while others are weak and few. Likewise regarding disbelief, there are people who are very disbelieving in Allah and there are those who lack disbelief and their denial. The most honorable person in the sight of Allah is the one who is most pious to Him. Allah provides different dignity to prove His justice to His creatures, and to be able to give perfect recompense to every jinn and human. Deeds of piety are rewarded according to the degree of piety, and acts of disbelief are rewarded according to the level of their disbelief."
		   },
		   {
			"id": 4530,
			"surah": 46,
			"ayat": 20,
			"tafsir": "After explaining that every jinn and human being will get a just reward from Him, Allah explains the condition of the disbelievers when they are brought to hell. Allah ordered the Messenger of Allah to convey to the disbelievers their condition when they were taken to hell. They are told that all kinds of happiness and enjoyment that are meant for them have been completely and perfectly received by them while living in the world. There is no part that they will enjoy again in the afterlife. What remains is humiliation, humiliation, and painful punishment that they will experience as retribution for the arrogance, wickedness, tyranny, disobedience, and disbelief that they committed while living in this world. This verse warns people to abandon excessive luxury, abandon redundant acts, immorality, and encourages Muslims to live simply, not to overuse things according to their needs and circumstances, and to suit the goals of a Muslim's life. If there is excess wealth, it should be given to the poor, abandoned people, and orphans for whom no one is responsible, and use that wealth for the purposes of exalting God's word. Al-Baihaqi and others narrated from Ibn 'Umar that 'Umar saw the dirham in Jabir bin 'Abdullah's hand, so he said, \"What dirham is that?\" Jabir replied, \"I intend to buy a piece of meat that has been coveted by my family for a long time.\" 'Umar said, \"Does every time you want something, then you buy it? What do you think about this verse? You have spent your good fortune in your worldly life, and you have had fun with it?\" From the history above, we can draw a lesson that 'Umar bin al-Khaththab advised Jabir bin 'Abdullah with this verse not to indulge too much and remind him that pleasure and happiness in this world are only temporary, while eternal happiness is in the hereafter. Therefore, we must make the best use of all the sustenance that God has bestowed, in accordance with the provisions outlined by religion. This simple life is illustrated in the life of the Rasulullah SAW family as mentioned in the hadith: Narrated from Sauban, he said, \"When the Rasulullah SAW was going to travel, the last family he visited was Fatimah. And the family he visited first when he returned from a trip was Fatimah. He was returning from Gazah (war), then he came to Fatimah's house, and he rubbed the door of the house and saw the silver bracelets on the hands of Hasan and Husein, he came back and did not come in. When Fatimah saw this, she thought that the Messenger of Allah did not enter because she saw the items. So Fatimah tore the cloth at the door and took the bracelets from her two children's hands and cut them into pieces, then her two children cried, so she distributed them among the two children. So the two of them left met Rasulullah saw in a state of crying, then Rasulullah saw took the items from Both of them said, 'O Sauban, go bring these things to Bani So Fulan and buy Fatimah a necklace made of lokan leather and two bracelets made of ivory, then in fact they are my family, and I do not want them to waste their good fortune while living in This world.\" (Ahmad and al-Baihaqi's narrations) The purpose of this hadith is not to prohibit Muslims from wearing jewelry, to like beauty, to enjoy the sustenance that Allah has bestowed, but to recommend that people live according to their own abilities, not to exaggerate, to always be tolerant in living as neighbors and in friendship. Don't let wealth that is legally owned become a source of jealousy and envy of neighbors and friends. Don't live extravagantly, and spend beyond your means. Always remember that there are many other people who need help, there are still many costs needed to exalt God's sentence. Rasulullah SAW always felt enough when he got something and was patient when he didn't have it; eat cake if you can afford it, drink honey if you happen to have it, eat meat if you can get it. This has become his guide and habit of life. He always thanked Allah every time he received His grace. What is prohibited is wearing jewelery excessively, having fun without remembering that there is eternal life in the hereafter. It is permissible to wear jewelery without exaggerating and not causing the envy of others. Allah said: Say (Muhammad), \"Who has forbidden the ornaments that Allah has prepared for His servants and the good sustenance? Say, \"All this is for those who believe in the life of this world, and especially them alone) on the Day of Resurrection. Thus We explain the verses for people who know. (al-A'raf\/7: 32)"
		   },
		   {
			"id": 4531,
			"surah": 46,
			"ayat": 21,
			"tafsir": "Allah ordered the Messenger of Allah to convey to the polytheists of Mecca the story of Prophet Hud who came from the people of 'Ad, when he warned his people who were domiciled in Ahqaf that God would punish them. Allah explained that sending messengers and prophets to their respective people is a normal thing, and has become sunatullah. Before the Prophet Hud, Allah had sent messengers and prophets who gave warnings to their respective peoples, as well as afterwards. Prophet Hud called on people not to worship except Allah, God Almighty, who had created them, who provided them with sustenance so that they could live with that sustenance and maintain survival. Let them fear the calamity that will befall the result of this iniquity. In the afterlife they will get a painful punishment. The situation on the Day of Judgment is explained in the word of Allah: Verily, on the Day of Judgment (the Day of Judgment) is the promised time for all of them, (namely) on the day (when) a friend cannot benefit any other friend and they will not will get help. (ad-Dukhan\/44: 40-41) Al-Ahqaf means \"the dunes\". Then the name was used as the name of an area located between the lands of Oman and Mahrah. The area was named so by the people of 'Ad. Now the area is known as \"Sahara al-Ahqaf\", and is one of the areas that make up the southern part of the Kingdom of Saudi Arabia. The area is located to the north of Hadramaut, to the east by the Yemen Sea, and to the south by Nejed. Originally the 'Ad adhered to a religion based on monotheism. After several generations, the belief in monotheism was infused with elements of shirk, starting with respect for the dignitaries and their heroes who had died, by making statues of them. Over time, this homage turned into paying homage to statues, which eventually turned into worship of gods, with the meaning that they considered dignitaries and heroes who had died as gods. To return them to the true religion, namely monotheism, Allah sent an apostle who was appointed from their own family, namely Prophet Hud. Hud called on them to return to the true belief, namely the belief in monotheism, by only worshiping Allah alone, no longer associating Him with other gods."
		   },
		   {
			"id": 4532,
			"surah": 46,
			"ayat": 22,
			"tafsir": "When the Prophet Hud called his people to believe, the people of 'Ad answered the call by saying, \"Did you be sent to us to turn us away from the religion of our forefathers so that we no longer worship our gods and only worship your God?\" They asked Hud to prove his apostleship by immediately bringing the doom that had been promised to them, if they did not believe. Even in another verse, they accuse Hud of being mad. Allah said: We only say that some of our gods have inflicted madness on you. (Hud\/11:54)"
		   },
		   {
			"id": 4533,
			"surah": 46,
			"ayat": 23,
			"tafsir": "In this verse, the Prophet Hud's response to the challenge of the disbelievers is explained so that the doom that was promised to them should be brought if they do not believe. Prophet Hud replied that the only one who knows when the doom that is being threatened will come is Allah. Prophet Hud himself also did not know when the doom would come. The task of the prophet is only conveying messages from Allah. The people of 'Ad should be grateful that one of their people was sent to be a prophet who gave warnings, information about law, the main points of creed, and the correct ways of worship. All of this was conveyed because of the command of Allah, the Creator of all things. Without guidance from Allah no one knows the nature of true religion. Humans do not know which God is truly entitled to be worshiped and who has the right to determine how to worship properly. Therefore, it is natural that there are people who do not understand everything, because the human mind is indeed limited. This is where it is necessary for Allah to send prophets and messengers, and humans must try to understand and believe this."
		   },
		   {
			"id": 4534,
			"surah": 46,
			"ayat": 24,
			"tafsir": "All kinds of efforts had been made by Prophet Hud to invite his people to embrace the true religion. Even in other verses it is explained that the Prophet Hud challenged his people so that they all and their gods together fought and killed him. However, they ignored the challenge, so Allah decided to inflict punishment on them. The doom begins with the arrival of a long dry season that befalls their country. In this state, they saw a black cloud moving over the sky and moving towards their country. They all rejoiced at the arrival of the cloud. According to them, the cloud is a sign that it will rain in the near future, which they have been hoping for. They say, \"These are clouds that bring rain.\" Then Prophet Hud looked at the cloud and watched it carefully, then he said, \"The cloud that is coming in lumps is not a sign of the coming rain as you think, but the cloud is a sign of the coming of the doom you want and you have been waiting for. The punishment that will come to destroy you will be a strong wind that will destroy you and all that it hits. It will destroy you and all your wealth and will destroy all the power of the gods that you have always been proud of, according to the task that God has commanded it.\" In another verse, the form of punishment that was inflicted on the people of 'Ad was explained. Allah said: As for the people of 'Ad, they were destroyed by a very cold hurricane, Allah brought it down on them for seven nights and eight days continuously; then you see the people of 'Ad at that time dead lying like the trunks of date palms that have been empty (rotted). Then do you see anyone who is still left among them. (al-haqqah\/69: 6-8). And the word of Allah: And (also) in (the story of) 'Ad, when We sent them a destructive wind. (The wind) doesn't let anything it hits, it even turns it into powder. (adh-dzariyat\/51: 41-42) How the terrible punishment that had been inflicted on the people of 'Ad was illustrated in the attitude of the Prophet when a strong wind blew. In a hadith it is explained as follows: 'Aisyah said, \"Rasulullah saw when there was a strong wind blowing, he prayed, 'O God, I beg You for the best wind; both its content and the best that it carries, and I seek refuge in You are from a bad wind; bad contents and bad things that it carries. When the sky shows signs that it will rain, the face of the Messenger of Allah changes. He walks in and out of the house, front and back. So when it rains, his heart is relieved , then I asked him, he replied, 'I do not know, hopefully just as the people of 'Ad said, 'This cloud that comes rains down on us.\" (Muslim history, at-Tirmidhi, and an-Nasa'i) The Messenger of Allah also said the following: 'Aisyah said, \"I never saw the Messenger of Allah laugh so wide that the uvula of his tongue was visible. He only smiled, whereas when he saw clouds and wind , his expression changed. I asked him, 'O Messenger of Allah, I see people when they see clouds they are happy because they hope that the clouds will make it rain, while I see you, when you see clouds, you look unhappy on your face. The Messenger of Allah replied, 'Yes' Aisha, who can guarantee that the cloud will not bring doom? There was once a people who were punished by that wind. Indeed, these people saw the doom, but they thought it was a cloud that brought rain, so they said, 'The cloud is coming to bring us rain.' (Al-Bukhari and Muslim) In another hadith narrated by Muslim, it is explained: Ibn 'Abbas explained that the Prophet said, \"I was helped by an east wind, and the people of 'Ad were destroyed by a west wind.\" (Muslim History)"
		   },
		   {
			"id": 4535,
			"surah": 46,
			"ayat": 25,
			"tafsir": "In this verse, Allah warns the polytheists of Mecca that He has inflicted a very terrible doom on the 'Ad. The doom was so terrible that whatever was hit by the doom in the form of a very cold wind that was blowing violently, would be destroyed. They died all over the place. Houses and buildings collapsed, objects flew, trees were uprooted. Nothing is visible anymore, except for the ruins and their scattered dwellings. Such a punishment also befell other people, such as the Samud, Lut, and Shuaib. All of them are disbelievers and disobedient to Allah. If the Quraysh persisted in their denial, they would be subject to the same punishment."
		   },
		   {
			"id": 4536,
			"surah": 46,
			"ayat": 26,
			"tafsir": "With this verse, Allah compares the situation of the people of 'Ad who were destroyed with the polytheists of Mecca who grew more and more in their denial of the Prophet by saying, \"We have strengthened the position of the people of 'Ad in several aspects of worldly life. We have never strengthened a people like that We strengthened them. We have given them a lot of wealth, a strong and mighty body, and the ability to form a state so that they can rule over the surrounding lands, but all of that cannot prevent them from the punishment of Allah that has been inflicted on them. \" Allah said: Do they not then travel on earth, then they see how the end of those who were before them. They are more numerous and more powerful and (more) the remains of their civilization on earth, so what they try cannot help them. (Gafir\/40: 82) Furthermore, verse 26 explains that Allah has given many pleasures to the people of 'Ad. Allah has given them a good place, bestowed good eyesight and sharp hearing so that they can pay attention to the verses and signs of Allah's greatness. However, they don't use it, they don't even use it properly and correctly. History has proven that the people of 'Ad once had a high culture. They have been able to form a government and build a country. They have built palaces, forts, dug minerals from the bowels of the earth, and made canals to provide regular irrigation. With regular irrigation, their country's land becomes fertile. They can also cultivate the land well so that they live in prosperity. Besides that, they were also able to form a strong army so that their country became the leading country in the Arabian Peninsula at that time. God's Word: Do you build palaces on every high ground for splendor without being occupied, and you build forts in the hope that you will live forever? (asy-Syu'ara'\/26: 128-129) The pleasures and greatness that Allah has bestowed upon them should be food for thought about who has helped them achieve everything they aspire to. But all this added to their arrogance and arrogance. They thought that they had such a state solely by their ability and will, and that they would have it forever. Allah said: So as for the people of 'Ad, they were arrogant on earth without (paying heed to) the truth and they said, \"Who is more powerful than us?\" Do they not see that it is Allah who created them. He is greater in strength than them? And they have denied Our signs. (Fussilat\/41: 15) Furthermore, Allah explained that the people of 'Ad could not take advantage of all that had been bestowed upon them, because they denied the messenger's call that was sent to them and denied the apostle's miracles. As a result, they are subject to the doom that they always ask to hasten, because according to them it is impossible for it to happen."
		   },
		   {
			"id": 4537,
			"surah": 46,
			"ayat": 27,
			"tafsir": "Allah reminded the polytheists of Mecca to take lessons from the bitter experiences that had been experienced by the ancients, who had denied the apostles sent to them. Those ancient people lived not far from Mecca, such as the 'Ad people in Ahqaf, and the Samud people who lived in the area between Mecca and Sham. The signs of the oneness, power and greatness of Allah have been explained to them and His religion has also been conveyed to them. However, they ignored it, even denied and made fun of the apostles. When the doom befell them, none of the offerings could help them, even the statues in the form of lifeless statues were crushed along with them. That was the lie and denial of the ancient peoples and that was also the reward and punishment they received. From this verse, it contains a threat from Allah to the polytheists of Mecca that punishment will surely befall them, as will be experienced by the people of 'Ad, Samud, and other people if they still do not heed Muhammad's call as Allah's messenger sent to them."
		   },
		   {
			"id": 4538,
			"surah": 46,
			"ayat": 28,
			"tafsir": "Allah reminded the polytheists of Mecca to take lessons from the bitter experiences that had been experienced by the ancients, who had denied the apostles sent to them. Those ancient people lived not far from Mecca, such as the 'Ad people in Ahqaf, and the Samud people who lived in the area between Mecca and Sham. The signs of the oneness, power and greatness of Allah have been explained to them and His religion has also been conveyed to them. However, they ignored it, even denied and made fun of the apostles. When the doom befell them, none of the offerings could help them, even the statues in the form of lifeless statues were crushed along with them. That was the lie and denial of the ancient peoples and that was also the reward and punishment they received. From this verse, it contains a threat from Allah to the polytheists of Mecca that punishment will surely befall them, as will be experienced by the people of 'Ad, Samud, and other people if they still do not heed Muhammad's call as Allah's messenger sent to them."
		   },
		   {
			"id": 4539,
			"surah": 46,
			"ayat": 29,
			"tafsir": "In this verse, Allah ordered the Messenger of Allah to convey to the polytheists of Mecca the incident regarding his meeting with a group of jinn who had come to him to listen and pay attention to the recitation of the verses of the Qur'an. When they listened to their recitation, some of them said to others, \"Listen carefully to this recitation of the Qur'an so that we can focus our attention on readings that we have never heard of so far and to show attitude and mind. good manners when listening to the recitation of this noble verse of the Qur'an.\" After they finished listening to the recitation of the Qur'an, they returned to their people to convey what they had heard. In this verse it is explained that the jinn have listened to the recitation of the verses of the Qur'an from the Prophet. How did the genie listen to the recitation and how did the Prophet listen to it? There is no explanation that explains it clearly. Likewise, there is no real evidence that can be put forward with certainty that the jinn world itself exists. The existence of the jinn realm can only be obtained from the verses of the Qur'an and the hadith of the Prophet. So we as Muslims must believe in the existence of the jinn, just as we are obliged to believe in the existence of angels, because belief in the existence of jinn and angels is included in the belief in the entire contents of the Qur'an which is the main source of the Islamic religion. Angels and jinns are supernatural beings, therefore only Allah knows for sure about their nature and events. A Muslim must believe that the Prophet Muhammad had contact with angels, such as when receiving revelations and so on. Likewise a Muslim must also believe that at one time, when the Messenger of Allah was still alive, he had contact with jinns, namely when he recited verses of the Qur'an to them, and when they listened intently, then conveyed to them his kind. Regarding the hadiths of the Prophet which describes his meeting with a group of jinn, among others, the hadith below: Masruq said, \"I asked Ibn Mas'ud about who informed the Prophet Muhammad about the presence of the genie the night they listened to the recitation of the Qur'an.\" an,\" he replied, \"the one that tells of their presence is the tree.\" (Al-Bukhari and Muslim) In another hadith it is stated as follows: 'Alqamah said, \"I asked Ibn Mas'ud, was there one of you who accompanied the Messenger of Allah on the night of his meeting with the jinn?\" Ibn Mas'ud replied, \"None of us was with him.\" (History of Ahmad, Muslim, and at-Tirmidhi) This verse was revealed when the Prophet Muhammad and his companions were facing a very tough challenge from the polytheists of Mecca. After the wife he loved, Khadijah died, followed by the death of his uncle, Abu Talib, he felt the loss of the people who had been protecting and helping him from the disturbances of the Quraysh people. Meanwhile, the threats and harassment of the Quraysh were increasing. Facing this kind of situation he went to the city of Taif in the hope of receiving protection and help from Bani Saqif. But he did not get what he expected, even the Bani Saqif themselves acted harshly by ordering their slaves to drive them away and stone the Prophet so that his feet were injured and bleeding. They forced Rasulullah saw to flee to the gardens of 'Utbah and Syaibah. There he took shelter from the hot sun. After he prayed for help from Allah, then the slaves left. Then the Prophet returned to Mecca. On that trip, he stopped at Nakhlah, a place on the outskirts of Mecca. He spent the night there. So on the night when he was praying and reading the Qur'an in that prayer, Allah sent seven genie leaders to listen to the Prophet saw reading the Qur'an. He did not know the arrival of the genie and he also did not know when the genie returned to its place. With the revelation of this verse, then Rasulullah saw knew the arrival of the genie. This verse was revealed to reassure the hearts of the Prophet and his companions. Not long after that, the Isra' and Mi'raj events took place. These two events strengthened the Prophet's heart and his belief in his success in conveying the message that Allah had assigned him. This verse also explains that the jinn paid attention to the verses of the Qur'an that the Prophet read, then conveyed the contents of the Qur'an to his people. From this event, it can be concluded that the Prophet's call was not only addressed to all humans, but also addressed to jinns, supernatural beings whose essence and condition humans cannot know. It's just that we humans don't know when and how the jinn carry out orders and stay away from God's prohibitions. Some commentators have drawn the conclusion based on this verse that if there are living beings outside this planet whose condition is like that of humans, that is, they can think, act and feel, then Muhammad's message also applies to them, and Muslims are obliged to convey it to them as much as possible. Jin as a supernatural being is obliged to carry out the message of Muhammad saw and of course other creatures that are not supernatural and are the same as humans are even more obligated to carry out the message of Muhammad saw."
		   },
		   {
			"id": 4540,
			"surah": 46,
			"ayat": 30,
			"tafsir": "In this verse it is explained that a group of jinn who had heard the recitation of the Qur'an from the Prophet Muhammad called his people, \"O my people, we have actually heard the recitation of the verses of a book that Allah has revealed after the Torah which was revealed to the Prophet Musa. The book justifies the books that were revealed by Allah before, shows the best path to be taken by someone who wants to achieve happiness in this world and the happiness of life in the hereafter and explains the path that Allah approves and the path that Allah does not approve of. Jin is also a creature who must bear the obligation of worship. God's Word: . I did not create jinn and humans except that they should worship Me. (adh-dzariyat\/51: 56)"
		   },
		   {
			"id": 4541,
			"surah": 46,
			"ayat": 31,
			"tafsir": "Furthermore, the genies called on their people, \"O my people, allow and accept Muhammad's call as Allah's messenger who has called people to follow Allah's religion, believe in Him so that Allah will forgive their sins and protect them from punishment that no one escape from the punishment except by His permission.\" This verse gives the meaning that: 1. Even though there are jinn who believe and there are also those who disbelieve, in this verse they are called upon to believe in Allah. 2. Jin is obliged to worship Allah. Therefore, the jinn accept the Shari'a as the Shari'a conveyed by the prophets and messengers to humans. 3. Jinn who believes will be safe from the fires of hell."
		   },
		   {
			"id": 4542,
			"surah": 46,
			"ayat": 32,
			"tafsir": "Then it is explained in this verse that if any of the jinn rejects Muhammad's call as Allah's apostle, that is, does not carry out Allah's commands and distances himself from His prohibitions mentioned in the Qur'an and hadith, then he cannot avoid being punished. -His. He does not find any helper to free himself from the punishment of Allah, except if Allah Himself wills it. From this verse it can be understood that all the worship that is obligatory for Muslims is also obligatory for all jinn to perform them, such as praying, fasting, helping each other, and so on. It was also explained that the jinn who did not follow Muhammad's call were in error and deviated from the right path."
		   },
		   {
			"id": 4543,
			"surah": 46,
			"ayat": 33,
			"tafsir": "This verse is a strong rebuke to unbelievers who deny the day of resurrection, and the existence of life after death to account for the deeds that humans have done. Allah denounces the disbelievers who are negligent and never reflect on the events of this universe so they do not know that Allah, who has created the heavens and the earth, never feels tired in this creation. God also has the power to bring back the dead. From this verse it is understood that the disbeliever never uses his mind to contemplate the events of the universe in the true sense. They don't want to think about who is the creator of nature which is very orderly and equipped with very neat and sturdy laws. They also do not want to think about who created themselves and maintain their survival. If they would think about it with the aim of wanting to find the truth, they would come to the conclusion that the creator of all that is Allah, the All-Wise, the Almighty. If He is almighty, surely He will be able to carry out whatever He wills, tirelessly. Substances of this nature are certainly easy for Him to revive those whom He has killed, because creating the heavens and the earth is far more difficult than creating humans as well as killing and reviving. Allah says: Indeed, the creation of the heavens and the earth is greater than the creation of man, but most people do not know. (Gafir\/40: 57) Besides, it's usually easier to recreate something than to create it the first time. Allah says: And it is He who began creation, then repeats it again, and it is easier for Him. He has the nature of the Most High in the heavens and on earth. And He is the Most Mighty, the Most Wise. (ar-Rum\/30: 27) At the end of this verse it is emphasized that the Creator of all things and the Almighty is Allah Almighty. He can do whatever He pleases, and no one can hinder and oppose Him."
		   },
		   {
			"id": 4544,
			"surah": 46,
			"ayat": 34,
			"tafsir": "In this verse, Allah explains the consequences that will be received by those who deny the existence of the day of resurrection. On the resurrection day, they and those who do not believe in the existence of Allah's reward and punishment, will be put into the burning hell fire. To those who disbelieve, a question is said that hurts and is full of contempt, \"O disbelievers, isn't the doom you are feeling today the punishment that you were warned about before, when you lived in the world, while you belied and made fun of it?\" .\" They replied, \"Yes, our Lord, we have really felt the consequences.\" Allah told them, \"Now feel what you are making fun of. This is the reward for your attitude and actions.\""
		   },
		   {
			"id": 4545,
			"surah": 46,
			"ayat": 35,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to always remain steadfast in facing the attitudes and actions of the disbelievers who deny and deny the message conveyed to them such as the steadfastness and patience that the previous apostles of ulul 'azmi did. The Messenger of Allah carried out this command of Allah well. He was always patient and steadfast in facing all kinds of trials that came to him. Regarding his patience, this is explained in the hadith as follows: From 'Aisyah, he said, \"Rasulullah SAW always fasted, then his stomach became flat, then he continued to fast, then his stomach became flat, then he fasted. He said, 'Yes Aisha, verily pleasures in this world are not suitable for Muhammad and his family. O Aisyah, verily Allah does not like the apostles ulul 'azmi (Nuh, Ibrahim, Musa, Isa, and Muhammad), except to be patient with all of their trials and be patient with those they love, then Allah does not like me, unless He burdens me as he has imposed on the apostles. So He said, 'Be patient as the apostles 'ulul 'azmi have been patient. And verily I, by Allah, will really be patient like the apostles, and not there is nothing but the power of Allah.\" (History of Ibn Abi hatim and ad-Dailami) Patience is the main trait and the key to success. Blessed are those who have that quality. The opposite of patience is haste. In this verse, Allah denounces haste, and warns the Prophet Muhammad not to have this trait, such as asking Allah to immediately inflict punishment on the polytheists who deny his call because the punishment will surely befall them, and only Allah knows the time of his arrival. know. Allah says: And let Me (who acts) against those who deny, who have all the pleasures of life, and give them a short reprieve. (al-Muzzammil\/73: 11) And the word of Allah: Therefore give reprieve to those who disbelieve. Give them a chance for a while. (ath-thariq\/86: 17) Next, Allah explains the condition of the disbelievers in the hereafter when they see the doom that will befall them. They feel as if they live in this world for only a moment, during the day. This feeling arises because of sin and fear that arises in their hearts when they see the doom that will befall them. Their situation is explained by Allah in another verse when they are asked how long they have lived in this world. He (Allah) said, \"How many years did you live on earth?\" They replied, \"We stayed (on earth) a day or half a day, so ask those who are counting.\" (al-Mu'minun\/23: 112-113) And the word of Allah: On the day when they see the Day of Judgment (because the atmosphere is great), they feel as if they only (for a moment) stay (in the world) in the evening or morning. (an-Nazi'at\/79: 46) In this verse there is the word \"balag\" which in this verse means \"enough\". The point is: Allah states that this verse is a sufficient explanation for humans, especially unbelievers who want to think and reflect on the events of this universe. If they did not heed this explanation, they would surely suffer the consequences. In another verse, Allah says: And (the Qur'an) is a (perfect) explanation for humans, so that they will be warned with it, so that they will know that He is God Almighty and so that people of understanding can take heed. (Ibrahim\/14: 52) And the word of Allah: Indeed, (what is mentioned) in this (Qur'an), is truly a (complete) guide for those who worship (Allah). (al-Anbiya'\/21: 106) At the end of this verse Allah confirms that no matter how great and terrible the punishment of Allah is, it will not befall those who believe and do good deeds. Only disbelievers who do not heed Allah's commands and violate His prohibitions will be subject to this terrible punishment. This verse also describes how great God's grace and gifts are bestowed upon those who obey Him. In connection with this mercy and bounty, doom and calamity, Rasulullah SAW often prayed to Allah, as mentioned in the hadith below: \"Narrated from Anas, the Prophet SAW prayed, \"O Lord, I beg You for the cause of Your mercy, the certainty of Your forgiveness, and the success of all good, and salvation from every act of sin. O God, do not allow me even a single sin, unless You forgive it, and narrowness unless You broaden it, and debts unless You pay them, as well as all the needs of worldly and ukhrawi needs, unless You complete them with Your grace, O God Almighty generous. (History of ath-thabrani)"
		   }
	]
}
