{
	"tafseer": [
		{
			"id": 6126,
			"surah": 97,
			"ayat": 1,
			"tafsir": "There are four places in the Qur'an which explain its descent to the Prophet, namely: 1.In surahh al-Qadr. 2.In surahh ad-Dukhan, namely in His words: ha Mim. By a clear Book (Qur'an), verily We sent it down on a blessed night. Indeed, it is We who warn. On (that night) explained all matters that are full of wisdom, (namely) matters from Our side. Indeed, it is We who sent the messengers, as a mercy from your Lord. Indeed, He is All-Hearing, All-Knowing. (ad-Dukhan\/44: 1-6) 3.In surahh al-Baqarah, namely in His words: The month of Ramadan is (the month) in which the Qur'an was sent down, as a guide for humans and explanations regarding the clue and the differentiator (between the right and the wrong). (al-Baqarah\/2: 185) 4. In surahh al-Anfal, namely in His words: And know, in fact everything that you get as spoils of war, one-fifth is for Allah, the Messenger, the Apostle's relatives, orphans, the poor and ibn sabil, (thus) if you believe in Allah and in what We sent down to Our servant (Muhammad) on the day of Furqan, that is, on the day the two armies meet. Allah is almighty over all things. (al-Anfal\/8: 41) The verse of surahh al-Qadr states that the revelation of the Qur'an from Lauh Mahfudh to Baitul-'Izzah was clear on the night of Lailatul Qadr. The verses of surahh ad-Dukhan corroborate the revelation of the Qur'an on a blessed night, the verses of surahh al-Baqarah indicate the revelation of the Quran in the month of Ramadan. While surahh al-Anfal\/8: 41 above explains the completion of the distribution of spoils of war in the Battle of Badr. This war is called yaumul-furqan because it is a battle between the Muslim army and the infidel army, in which the victory is in the hands of the Islamic army. In this verse it is revealed that Allah revealed the Qur'an for the first time to the Prophet on a glorious night. Then it was sent down continuously gradually according to events and circumstances that required it within a period of more than twenty-two years as a guide for humans in achieving happiness in life in this world and in the hereafter. In connection with the description above, the scholars say that the words anzala and nazzala have different uses and meanings. Therefore, the meaning of anzalnahu in surahh al-Qadr indicates the first descent of the holy book Al-Qur'an and at the same time from the Mahfudh Lake to the sky of the world. Then gradually descended from the sky of the world to the Prophet Muhammad, who was carried by the Angel Gabriel for 22 years, 2 months and 22 days. Meanwhile, the meaning of nazzala means to be passed down gradually. There is no doubt that people really need the Qur'an as a guide that explains something they doubt in matters related to religious matters or worldly matters. The Qur'an also explains to them human events and what will happen when the Day of Resurrection comes. Humans need this guide because without it, they cannot understand the actual principles of benefit to form rules and laws. Therefore, it is true that the opinion states that humans cannot escape from religion and spiritual instructions that determine the size and value of something after knowing scientifically the condition and efficacy of something."
		   },
		   {
			"id": 6127,
			"surah": 97,
			"ayat": 2,
			"tafsir": "Then in this verse, Allah states the virtues of Lailatul-Qadr which cannot be known by scholars and scientists, no matter how high their knowledge is. Even the understanding and knowledge of His Prophet could not determine the greatness and primacy of that night. Only Allah knows all that is unseen, who created the universe, who brought it into existence from nothing."
		   },
		   {
			"id": 6128,
			"surah": 97,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains the true virtue of Lailatul-Qadr. That night is a night that emits the light of guidance as the beginning of tasyri' which is sent down for human happiness. That night was also the laying of the first stone of Islamic law, as the final religion for mankind, which is in accordance with their benefit throughout the ages. That night is more important than the thousand months that they went through wallowing in the sins of polytheism and endless misguidance. Worship on that night has added value in the form of glory and better rewards than worship of a thousand months. The mention of the word \"thousand\" in this verse does not mean to determine the number. However, the intention is to declare an infinite number as desired by the word of God: Each one of them wishes to be given a thousand years of life. (al-Baqarah\/2: 96). Is there a night that is more glorious than the night on which the light of guidance begins to be sent down for mankind after centuries of being in error and disbelief? Is there any greater glory than the night when the full moon of divine knowledge illuminates the soul of Muhammad saw who was sent as a mercy to all mankind, conveying good news and threats and calling them to the straight path, making them a people who free humans from the shackles of slavery and oppress the unjust rulers of the east and west, and unite them after they have been divided and enemies? So Muslims should make this night a holiday because that night is the time when the heavenly basic laws that guide humans in directions that are beneficial to them are revealed. This reduction also renews their promise with God relating to life and property as a sign of gratitude for His favors and expecting His reward in return."
		   },
		   {
			"id": 6129,
			"surah": 97,
			"ayat": 4,
			"tafsir": "In this verse, Allah states some of the features of that night, namely the descent of the angels along with Gabriel from the angelic world so that the Prophet saw, especially Gabriel who conveyed the revelation. Jibril's appearance to the Prophet in his original appearance was an order from Allah, after He had prepared His Prophet to receive revelations that would be conveyed to humans that contained virtues and blessings. The descent of angels to earth is with Allah's permission, we don't need to investigate how and what is the secret. We just have to have faith in it. As for what humans can know about the secrets of nature, only very little, as explained in the word of God: Meanwhile, you were given only a little knowledge. (al-Isra'\/17: 85) That night (Lailatul-Qadr) is a Muslim holiday because it is the time when the Qur'an was revealed and a night of giving thanks to Allah for the goodness and blessings He has bestowed. At that time, the angels join in giving thanks with humans for the greatness of the night of Qadar, as a sign of the glory of humans who are Allah's caliphs on earth. Among the signs of Lailatul-Qadr is the sun rising without its radiating light. Ibn 'Abbas narrated that the Prophet said about Lailatul-Qadr: Lailatul qadar is a calm and clear night, neither hot nor cold, and the sun in the morning is bright red. (History of Abu Dawud)"
		   },
		   {
			"id": 6130,
			"surah": 97,
			"ayat": 5,
			"tafsir": "In this verse, Allah states that the night is filled with goodness and blessings from the beginning until dawn, because the revelation of the Qur'an was witnessed by the angels when Allah expanded the chest of His Prophet and made it easy for him to convey instructions and guidance to his people."
		   }
	]
}
