{
	"tafseer": [
		{
			"id": 4613,
			"surah": 49,
			"ayat": 1,
			"tafsir": "In this verse, Allah teaches Muslims politeness when dealing with the Messenger of Allah in terms of actions and conversations. Allah warns the believers not to precede Allah and His Messenger in determining a law or opinion. They are prohibited from deciding a case before discussing and researching Allah's law and (or) the provisions of His messenger on that matter. This is so that their decision does not violate or even conflict with Islamic law, so that it can cause Allah's wrath. This is in line with what happened to the friend of the Prophet Muhammad, namely Mu'adh bin Jabal when he was about to be sent to Yemen. Rasulullah saw asked, \"You will give a decision with what?\" Mu'adh answered, \"With the book of Allah.\" The Prophet asked again, \"If you don't find it in Allah's book, how?\" Mu'adh replied, \"With the Sunnah of the Prophet.\" Prophet Muhammad asked again, \"If in the Sunnah of the Prophet you do not meet, how?\" Mu'adh replied, \"I will ijtihad with my mind.\" Then Prophet Muhammad saw patted Mu'adh on the chest and said, \"Praise be to Allah who has given His messengers the knowledge of what Allah and His messengers please.\" (History of Abu Dawud, at-Tirmidhi and Ibn Majah from Mu'adh bin Jabal). In this verse, Allah commands the believers to carry out Allah's commandments, stay away from His prohibitions, and not rush into actions or express opinions by going before the Qur'an and the hadith of the Prophet which have anything to do with the reason for the revelation of this verse. It is stated in the book of al-Iklil that they are prohibited from slaughtering sacrifices on Eid al-Adha before the Prophet slaughters them, and are prohibited from fasting on doubtful days, such as whether the beginning of Ramadan has come or not, before the results of ijtihad are clear for its determination. Then Allah ordered them to remain fearful of Him because Allah is All-Hearing all conversations and All-Knowing of everything that is contained in the hearts of His servants."
		   },
		   {
			"id": 4614,
			"surah": 49,
			"ayat": 2,
			"tafsir": "It was narrated by al-Bukhari from Ibn Abi. Beginning that 'Abdullah bin Zubair informed him that a delegation had come from the Bani Tamim tribe to the Messenger of Allah. Abu Bakr said, \"This group should be led by al-Qa'qa' bin Ma'bad.\" 'Umar bin al-Khatthab said, \"It should be chaired by al-Aqra' bin finished.\" Abu Bakr argued, \"You have no other intention but to oppose me.\" 'Umar replied, \"I do not mean to offend you.\" Then a difference of opinion arose between Abu Bakr and 'Umar so that their voices sounded louder, so this verse was revealed. Since then, when Abu Bakr spoke to the Prophet Muhammad, his voice was lowered to a whisper, so did 'Umar. Because his voice was so smooth that it was almost inaudible, he was often asked what he was saying again. They both understand that these verses were deliberately revealed to preserve the honor of the Prophet Muhammad. After this verse was revealed, the sickle bin Qais never came again to attend the Prophet's assembly. When asked by the Prophet about the reason, the sickle replied, \"O Messenger of Allah, this verse has been revealed and I am someone who always speaks loudly and loudly. I am afraid that my merit will be erased as a result of my habit.\" The Prophet Muhammad replied, \"You are very different, you live in goodness and God willing, you will die in goodness too, you are one of the experts in heaven.\" The sickle replied, \"I am very happy because of the good news, and I will not raise my voice against the Prophet for ever.\" (History of al-Bukhari from Ibn Abi Begin). So the next verse came down, namely verse 3 of surahh al-hujurat. From the explanation above, it can be understood how Allah taught the believers politeness in conversation when dealing with the Prophet Muhammad. Allah forbade the believers to raise their voices more than the voice of the Prophet. They were forbidden to speak to the Prophet in a loud voice because such behavior was not appropriate according to decency and could offend the Prophet. Especially if the impolite remarks contained elements of ridicule or humiliation that hurt the Prophet's heart and could drag and lead his people to disbelief, resulting in the loss and fall of all their past merits, even though all of this happened without him realizing it. ."
		   },
		   {
			"id": 4615,
			"surah": 49,
			"ayat": 3,
			"tafsir": "Indeed, those who lowered their voices at the side of the Messenger of Allah after training themselves with various rigorous and severe exercises, they are the people whose hearts have been tested by Allah to be pious. They have succeeded in purifying themselves with effort and awareness and for them forgiveness and great reward. Imam Ahmad from Mujahid narrated that there was a written question submitted to Umar, \"O Commander of the Faithful, there is a man who does not like disobedience and does not do it, and another man whose heart is inclined to disobedience, but he does not do it. Which of the two men is the best?\" Umar replied in writing too, \"Indeed, people whose hearts are inclined to disobedience, but do not do it, they are the people whose hearts have been tested by Allah to be pious. For them is forgiveness and a great reward.\""
		   },
		   {
			"id": 4616,
			"surah": 49,
			"ayat": 4,
			"tafsir": "In this verse, Allah gives lessons in politeness and manners in dealing with the Prophet Muhammad, especially in holding conversations with him. Rasulullah saw while in Medina lived in a house next to the Medina mosque. Inside the house there are nine rooms, and each of them is filled by a prophet's wife. The building was made very simply, the roof was so low that it was easily touched by the hand and the doors consisted of hanging fur animal skins. During the time of Caliph al-Walid bin 'Abd al-Malik, the rooms were dismantled and made into the courtyard of the mosque. This was very sad for the believers in Medina. Sa'id bin al-Musayyab responded and said, \"I would love it if the rooms of the Prophet's wife remained standing and were not remodeled, so that future generations of residents of Medina and those who came could emulate the simplicity of the Prophet Muhammad in managing his household. Ibn Ishaq explained in his Sirah book that the ninth year of the Hijrah was the year when delegates from all over the Arabian Peninsula flowed in. After the Liberation of Mecca, after the Tabuk War, and the Saqif tribe from Taif converted to Islam and joined the pledge of the Prophet Muhammad, they came in droves various delegations to Medina to meet the Messenger of Allah. then we are the happiest with him, and if he is a king then we will be lucky to live beside him.\" Then came Zaid bin Ar qam to Rasulullah SAW delivered the news then they came together to meet him who happened to be in the room of one of his wives. They called out in a very loud voice, \"O Muhammad, O Muhammad, come out of your room to meet us because our aim is very beautiful and our reproaches are very painful.\" The Prophet Muhammad came out of his wife's room to meet them and this verse was revealed. According to Qatadah, the group of seventy people were from the Bani Tamim tribe. They said, \"We are from Bani Tamim, we have come here to bring our poets in poetry and speech to compete with your poets.\" The Prophet replied, \"We were not sent to convey poetry and we were not sent to show arrogance, but if you want to try, you can present your poetry.\" Then a young man appeared among them proud of his people with various virtues. The Prophet Muhammad displayed Hassan bin Scythe to answer their poems and it turned out that Hassan could subdue them all. After they acknowledged Hassan's superiority, they then approached Rasulullah SAW and uttered two sentences of creed and at the same time converted to Islam. The Prophet Muhammad's wisdom in dealing with the impolite delegation from Bani Tamim ended well. Before going home, they had first received instructions about the right path and politeness in association. Allah clearly explained that the people who called the Prophet to leave his wife's room beside the Medina mosque, most of them were stupid, did not know politeness and etiquette when paying a courtesy visit to a head of state let alone a prophet. The procedure set forth in this ayat is now known as protocol and security. From this verse it can also be understood that Islam has long ago regulated its code of ethics with the aim of giving proper respect to the dignitaries they visit."
		   },
		   {
			"id": 4617,
			"surah": 49,
			"ayat": 5,
			"tafsir": "If the delegation's guests had not shouted for the Prophet Muhammad and had waited patiently for him to come out of his resting room, it would have been better for them. Because such an attitude shows reverence and respect for the Prophet Muhammad. Allah is Forgiving to those who call Prophet Muhammad from behind his rooms when they repent and replace their carelessness with politeness of manners. Allah is Most Merciful to them, will not punish them later on the Day of Judgment because they have regretted their shameful actions."
		   },
		   {
			"id": 4618,
			"surah": 49,
			"ayat": 6,
			"tafsir": "In this verse, Allah gives a warning to the believers, if a wicked person comes to them with news about anything, so they are not in a hurry to accept the news before it has been examined and examined for its truth. Before thorough research is carried out, do not be quick to believe the news from the wicked, because a person who does not care about his wickedness, of course, will not care about the lie of the news he conveys. The need to be careful in receiving news is to avoid regrets due to unresearched news or fake news. Regrets that will arise can actually be avoided if you are more careful. This verse provides guidelines for all believers to be careful in receiving news, especially if it comes from an evil person. The purpose contained in this ayat is that research is carried out first regarding the truth. Believing in a news story without investigating the truth, will most likely lead to futile loss of life and property, which will only cause regret."
		   },
		   {
			"id": 4619,
			"surah": 49,
			"ayat": 7,
			"tafsir": "Allah explained that the Prophet Muhammad when he was in the midst of the believers, should be respected and followed all his instructions because he knows better the benefit of his people. The prophet is more important for the believers than themselves, as stated in the word of Allah: The prophet is more important for the believers than themselves (al-Ahzab\/33: 6) Because the Prophet Muhammad was always under the guidance of Divine revelation , then he who is in the midst of the friends should be made an example in all aspects of life and social aspects. If he had followed the will of his companions in solving life's problems, surely they would have encountered various difficulties and disadvantages as in the case of al-Walid bin 'Uqbah. If the Prophet saw received false news about Bani al-Musthaliq, then sent troops to attack those who were suspected of being apostates and refusing to pay zakat, surely this would only cause regret and disaster. However, on the contrary, with the wisdom and guidance of the Prophet Muhammad who was among his companions, they were made by Allah to love faith and made faith beautiful in their hearts, and made them hate disbelief, wickedness and lawlessness. Because perfect faith consists of confessing with the mouth, confirming with the heart, and doing good deeds with the limbs, the hatred of disbelief is opposed to the love of faith. Making faith beautiful in the heart is parallel to justifying (tasdiq) in the heart, and hating disobedience is parallel to doing good deeds. Such people are those who are guided and follow the straight path, which leads directly to the pleasure of Allah."
		   },
		   {
			"id": 4620,
			"surah": 49,
			"ayat": 8,
			"tafsir": "The gifts and gifts are solely the mercy of Allah and are a favor from Him. Allah is All-Knowing who is entitled to receive guidance and who is affected by error, and All-wise in managing all the affairs of His creatures."
		   },
		   {
			"id": 4621,
			"surah": 49,
			"ayat": 9,
			"tafsir": "Allah explains that if there are two groups of believers fighting, then peace must be sought between the two opposing parties by making peace in accordance with the provisions of the law from Allah based on justice for the benefit of those concerned. If after the peace has been worked out there are still those who disobey and continue to persecute other groups, then the aggressive group that commits persecution must be fought so that they return to accept God's law. If the disobedient group has submitted and returned to God's commands, then the two previously hostile groups must be treated fairly and wisely, with full awareness so that such enmity will not be repeated in the future. Allah commands them to continue to do justice in all their affairs, because Allah likes it and will reward those who act justly in all matters."
		   },
		   {
			"id": 4622,
			"surah": 49,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that in fact the believers are all brothers and sisters like a brotherly relationship between bloodlines because they both adhere to the same element of faith and will live forever in heaven. In an authentic hadith it is narrated that a Muslim is another Muslim brother, don't do wrong and don't let him do wrong. He who helps his brother's needs, then Allah helps his needs. Whoever eases one difficulty from a Muslim, Allah will loosen one difficulty among his difficulties on the Day of Judgment. Whoever covers the disgrace of his brother, Allah will cover his shortcomings on the Day of Resurrection. (Al-Bukhari narration from 'Abdullah bin 'Umar) In another authentic hadith it is stated: When a Muslim prays for his unseen brother, the angels say, \"Amen, and may you also receive the same.\" (History of Muslim and Abu ad-Darda') Since brotherhood leads to peace, Allah recommends that it be cultivated among brothers of the same religion as peace among brothers and sisters, so that they maintain piety to Allah. Hopefully they will receive Allah's mercy and forgiveness in return for their peace efforts and piety. From this verse it can be understood that there is a need for power as a mediator to reconcile the warring parties."
		   },
		   {
			"id": 4623,
			"surah": 49,
			"ayat": 11,
			"tafsir": "In this verse, Allah reminds the believers that one people should not make fun of another people because perhaps those who are ridiculed are far more honorable and honorable from those who make fun of them. Likewise among women, there should not be a group of women who make fun of other women because perhaps those who are ridiculed are better and more honorable in the sight of Allah than women who make fun of them. Allah forbids the believers to criticize their own people because the believers must all be seen as one body that is bound by oneness and unity. Allah also prohibits calling with bad names such as calling someone who has faith with the words: O wicked, O infidel, and so on. It is mentioned in a hadith narrated by al-Bukhari and Muslim from an-Nu'man bin Basyir: The parable of the believers in love and compassion between them is like one body; if one part of the body is sick with a fever, then the other body feels feverish and disturbed too. (Muslim and Ahmad's history from an-Nu'man bin Basyir) Indeed, Allah does not look at your appearance and your wealth, but He looks at your heart and your deeds. (Muslim history from Abu Hurairah) This hadith contains a hint that a servant of Allah should not determine the goodness or badness of a person solely by looking at his deeds, because it is possible for someone to appear to be doing good deeds, even though Allah sees in his heart there are reprehensible qualities . On the other hand, there may be someone who seems to be doing something that looks bad, but God sees in his heart a great feeling of remorse that encourages him to repent of his sins. So the deeds that appear outside are only signs that raise strong suspicions, but have not yet reached a convincing level. Allah forbids the believers to call people with bad names after they believe. Ibn Jarir narrated that Ibn 'Abbas in interpreting this verse, explained that there was a man who once in his youth did a bad deed, then he repented of his sin, so Allah forbids anyone who mentions his badness again in the future. then, because it can evoke bad feelings. That's why Allah forbids calling with bad names and titles. As for calls that contain respect are not prohibited, such as the title to Abu Bakr with as-shiddiq, to 'Umar with al-Faruq, to 'Uthman with the title dzu an-Nurain, to 'Ali with Abu Turab, and to Khalid bin al-Walid called Saifullah (sword of Allah). Bad calls are forbidden to be uttered after the person has faith because the titles for that remind of past iniquities, and are no longer appropriate to be made. Whoever does not repent, even continues to call them with those bad titles, then they are branded by Allah as people who are unjust to themselves and will surely receive the consequences in the form of punishment from Allah on the Day of Judgment."
		   },
		   {
			"id": 4624,
			"surah": 49,
			"ayat": 12,
			"tafsir": "In this verse it is explained that their request could not possibly be permitted by Allah. They will not be returned to the world, because their hearts no longer accept the truth. In the world, they disbelieve and deny when called upon to worship only Allah alone, but when Allah is associated with others, they believe and justify it. Their request to get out of hell and be returned to the world to do good deeds, was answered by Allah with His words: He (Allah) said, \"Stay in it with contempt, and do not talk to Me.\" (al-Mu'minun\/23: 108) If their requests were allowed and returned to the world, they would still do things that were forbidden by Allah as before. They are liars, as Allah says: If they were returned to the world, they would surely repeat what they had been forbidden to do. They are real liars. (al-An'am\/6: 28) This verse closes with the firmness that the decision on the Day of Judgment is in the hands of Allah who will give a right and just decision, God, the Most High and Greatest, has nothing equal to Him. God really hates those who associate partners with Him and has implemented a policy that is to eternalize them in hell."
		   },
		   {
			"id": 4625,
			"surah": 49,
			"ayat": 13,
			"tafsir": "In this verse, it is explained that God created humans from a male (Adam) and a woman (Eve) and made them into nations, tribes, and different skin colors not to ridicule each other, but so that they know and help one another. . Allah does not like those who show arrogance with their lineage, rank, or wealth because the most honorable among humans in the sight of Allah are only those who are most pious to Him. The human habit of looking at glory has always had something to do with nationality and wealth. Whereas in the sight of Allah, the most noble person is the one who is most pious to Him. Ibn hibban and at-Tirmidhi narrated from Ibn 'Umar that he said: Rasulullah SAW performed tawaf on his camel whose ears were not perfect (partially cut off) on the day of Fath Makkah (Liberation of Mecca). Then he touched the pillar of the Kaaba with a stick with a bent end. He could not find a place to ride his camel in the mosque so the camel was taken out to the valley and then hummed there. Then the Messenger of Allah praised Allah and glorified Him, then said, \"O people, in fact Allah has removed from you the bad behavior of Ignorance. O people, in fact there are two kinds of humans: those who do good, are pious, and are noble in the sight of their Lord. And people who are disobedient, wretched, and despicable in the sight of their Lord. Then the Messenger of Allah recited the verse: ya ayyuhan-nas inna khalaqnakum min dhakarin wa untsa¦ He read until the end of the verse, then said, \"This is what I said, and I beg Allah's forgiveness for me and for you. (History of Ibn hibban and at-Tirmidhi from Ibn 'Umar). Indeed, Allah is the Acceptor of repentance, the Knower of what is hidden in the human soul and mind. At the end of the verse, Allah states that He is All-Knowing of all that is hidden in people's hearts and knows all their deeds."
		   },
		   {
			"id": 4626,
			"surah": 49,
			"ayat": 14,
			"tafsir": "Allah explains that the Bedouin Arabs claim that they have faith. Their words were disproved by Allah. They should not say they have faith because real faith is justifying with a sincere heart and believing in God completely. This has not been proven because they show that they have given pleasure to Rasulullah SAW by their Islam and by not fighting Rasulullah SAW. They were forbidden by Allah to say the word faith and they should only say 'we have submitted to Islam, because that true faith has never entered their hearts. What they say is not in accordance with their hearts. Az-Zajjaj said, \"Islam is showing obedience and accepting what was brought by the Prophet Muhammad. By showing obedience, blood and soul are preserved, and if the pledge of Islam is accompanied by tasdiq (justified heart), then only that that is called true faith. If they truly obey Allah and His Messenger, sincerely do good deeds, and abandon hypocrisy, then Allah will not reduce the reward of their deeds in the least, and will even improve their reward by multiplying it.\" Against humans who make many mistakes, wherever they are, Allah will forgive them because He is Most Forgiving towards those who repent and do good deeds with sincerity."
		   },
		   {
			"id": 4627,
			"surah": 49,
			"ayat": 15,
			"tafsir": "In this verse, Allah explains the true nature of faith, namely that those who are recognized as having real faith are only those who believe in Allah and His Messenger, without the slightest doubt and do not waver in their stance no matter what they face. They surrender their wealth and soul in jihad in the way of Allah solely to achieve His pleasure. There are three groups of believers in the world: first, those who believe in Allah and His Messenger, then they do not hesitate and strive fi sabilillah with their wealth and themselves. Second, people who do not interfere with other people's property and self. Third, the person who gets the glory of ambition, he leaves it because of Allah. (Ahmad's history from Abu Sa'id al-Khudri) Those are the people whose faith is recognized by Allah. Unlike the Bedouin Arabs who only profess faith with their tongues, while their hearts are empty because they convert to Islam only because they are afraid of being cut by a sword, just to protect their lives and property."
		   },
		   {
			"id": 4628,
			"surah": 49,
			"ayat": 16,
			"tafsir": "Allah ordered His Messenger to ask the Bedouin Arabs, whether they will tell Allah about their beliefs that have been stored in their hearts, even though Allah knows what is in the heavens and what is on earth, including what is contained in their hearts because Allah knows all things."
		   },
		   {
			"id": 4629,
			"surah": 49,
			"ayat": 17,
			"tafsir": "Allah explained that the Bedouin Arabs felt that they had given favors to the Prophet Muhammad. They consider that their Islam and submission to the Prophet Muhammad must be seen as a blessing for which the Prophet must be grateful. Then Allah ordered His messengers to refute their words which always accentuate the giving of favors because in fact only Allah bestows favors on them by showing them faith, if they truly become people of true faith."
		   },
		   {
			"id": 4630,
			"surah": 49,
			"ayat": 18,
			"tafsir": "Verily, Allah is the All-Knower of what is unseen in the heavens and on earth. He is the one who sees what is hidden in the heart and what is spoken by the tongue because Allah is All-Seer of what all of His servants do."
		   }
	]
}
