{
	"tafseer": [
		{
			"id": 6180,
			"surah": 104,
			"ayat": 1,
			"tafsir": "In this verse, Allah threatens that His wrath and punishment will fall on everyone who swears at, criticizes and hurts them both in front of them and behind their backs. Allah's Word: O you who believe! Stay away from prejudice, in fact some prejudice is a sin and do not find fault with others and do not let anyone in you backbite some of the others. Does any of you like to eat the flesh of his dead brother? Of course you feel disgusted. And fear Allah, verily Allah is Most Accepting of repentance, Most Merciful. (al-hujurat\/49: 12)"
		   },
		   {
			"id": 6181,
			"surah": 104,
			"ayat": 2,
			"tafsir": "This verse explains that people who hoard wealth are also threatened with hell because they enrich themselves and always count their wealth. He did this because he loved and loved wealth as if there were no happiness and glory in life except with wealth. When he looked at his vast wealth, he felt that his position was higher than those around him. He does not worry that he will be afflicted because he reviles and tears the honor of others. Because of his arrogance, he forgets and doesn't realize that death is always stalking him, doesn't think about what will happen after death, and doesn't even think about what will happen to him."
		   },
		   {
			"id": 6182,
			"surah": 104,
			"ayat": 3,
			"tafsir": "Then Allah stated that the erroneous assumption of those who cursed and insulted him that the treasure he owned guaranteed him to live in the world forever. Therefore, his actions are the same as those of people who will live forever and if he dies he will not come back to life to receive recompense for his crimes while living in the world."
		   },
		   {
			"id": 6183,
			"surah": 104,
			"ayat": 4,
			"tafsir": "After threatening such people with painful torments, Allah also mentions the reasons that make them practice those accursed traits. The reason is their assumption that all the assets they have can help them in dealing with the difficulties they face. Threats in the form of questions, \"Who would have thought that his wealth could guarantee him from death?\" Allah replied, \"No! Never will he even be thrown into Huthamah Hell, no one pays attention to him and no one cares.\" 'Ali bin Abi Talib once advised Kumail that people hoarding wealth will perish, even though they are still alive, while the scholars will remain eternal even though their bodies are gone, because their virtues are still remembered in their hearts. That is to say, the hoarding of treasures is condemned, reviled, and despised because people derive nothing from their possessions. While scholars and scholars continue to be praised as long as there are people on earth who benefit from their knowledge."
		   },
		   {
			"id": 6184,
			"surah": 104,
			"ayat": 5,
			"tafsir": "In these verses, Allah describes the awesomeness of Huthamah hell in the form of a question, \"Do you know what Huthamah is?\" Allah explains Himself that Huthamah is a fire that He has prepared to torment those who are disobedient and sinful. No one is able to know what it is except Allah the creator."
		   },
		   {
			"id": 6185,
			"surah": 104,
			"ayat": 6,
			"tafsir": "In these verses, Allah describes the awesomeness of Huthamah hell in the form of a question, \"Do you know what Huthamah is?\" Allah explains Himself that Huthamah is a fire that He has prepared to torment those who are disobedient and sinful. No one is able to know what it is except Allah the creator."
		   },
		   {
			"id": 6186,
			"surah": 104,
			"ayat": 7,
			"tafsir": "God then declared that the burning fire was different from the fire of the world. It licks and rises up to the midriff, then enters the abdominal cavity up to the chest and burns the liver. The heart is the most painful of the other members of the body. If the fire burns the heart, it means that the torment he feels has reached its peak."
		   },
		   {
			"id": 6187,
			"surah": 104,
			"ayat": 8,
			"tafsir": "In this verse, Allah reveals that the fire is layered around them. They are not expelled from it, nor are they able to get out on their own. In another verse, Allah says: Every time they want to get out of it (hell) because they are tormented, they are returned (again) to it. (al-hajj\/22: 22)"
		   },
		   {
			"id": 6188,
			"surah": 104,
			"ayat": 9,
			"tafsir": "Allah explains through this verse the condition of the people living in Hell Huthamah. According to Muqatil, the gates of hell are tightly closed, while the inhabitants are tied to iron pillars. The doors were never opened and it was full of all kinds of suffering. The aim is to make them despair because they cannot get out of Huthamah's hell. May Allah save us from His wrath and preserve us from the awesomeness of hell fire with His grace and bounty."
		   }
	]
}
