{
	"tafseer": [
		{
			"id": 3534,
			"surah": 33,
			"ayat": 1,
			"tafsir": "This verse instructs the Prophet Muhammad and the Muslims to fear Allah by carrying out all His commands and stopping all His prohibitions. Allah also forbade the Prophet and the Muslims to follow the wishes of the disbelievers who had advised him to expel the weak and poor believers from his assembly. This verse also forbids the Prophet and the believers from following the hypocrites who were born claiming to be believers, but in their hearts remained disbelievers, and even always tried and cooperated with other infidels to destroy Islam and the Muslims. Based on this verse and the reason for its revelation, what is meant by \"obeying the wishes of the disbelievers and hypocrites\" is \"accommodating their wishes so that the Muslims acknowledge their beliefs and their gods, believing that their gods can intercede and benefit people people who worship them, and acknowledge their Shari'a as recognizing the Shari'a that was revealed by Allah.\" Muslims should be wary of all attempts by disbelievers and hypocrites who intentionally obscure and undermine their religion and beliefs, so that their understanding of religion deviates from the true understanding. The end of this verse warns that Allah is All-Knowing of everything that is said, suggested, conveyed, and hidden in the hearts of the disbelievers, as well as everything they mean and desire. Therefore, He will determine a just punishment for them and He is All-Wise in managing all the affairs of the Prophet and his companions."
		   },
		   {
			"id": 3535,
			"surah": 33,
			"ayat": 2,
			"tafsir": "After Allah forbade the Muslims to fulfill the desires of the disbelievers, then He ordered them to practice and carry out all that He had revealed, namely the Qur'an, by making it a guide in acting, acting, and determining attitudes in their actions. set options. Those that are in accordance with the instructions of the Al-Qur'an must still be carried out, while those that are not in accordance with them are immediately stopped and shunned. Thus, they will live happily, and the da'wah of Islamiyah will succeed brilliantly. They will avoid all possibilities according to the desires of unbelievers and the possibility of misunderstanding religion. Then Allah warned that He knows everything that the Prophet and his companions did. Nothing is hidden from Him. Therefore, He will reward him according to what He has promised, and will reveal to Muhammad all that is necessary for him, everything that is beneficial in conveying the message and in building an Islamic society."
		   },
		   {
			"id": 3536,
			"surah": 33,
			"ayat": 3,
			"tafsir": "In this verse, Allah warns that if Muhammad has followed what has been revealed and does not follow the wishes of the disbelievers, the Muslims should submit themselves to Allah, leave all matters to Him alone, and adhere to His religion in earnest. . Sufficient is He as a caretaker of His servants. No one can hinder if Allah wills to benefit and intercede for someone. Likewise, no one is able to protect, if God wants to give trials and teachings in the form of harm and misery to someone."
		   },
		   {
			"id": 3537,
			"surah": 33,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that He did not make two hearts in one body so that it is impossible for a person to gather faith and disbelief. If a person believes in Allah and His Messenger, surely in his heart there is no disbelief and hypocrisy, even a little, and he certainly follows the Al-Qur'an and the Sunnah of the Prophet, calling people to follow Allah's way, follow His laws and submit only to Allah. On the other hand, if someone is a disbeliever or a hypocrite, of course, in his heart there is no faith in Allah and His Messenger and he will not place his trust in Allah. In other words, it is impossible to gather in a person two opposing beliefs, just as it is impossible for two hearts in one human body. In the period of Jahiliyyah it often happened to the Arabs, for certain purposes and with certain words, they made their wives their mothers. So if he utters certain words to his wife, be his wife as his mother, that is, he cannot interfere with her. According to the custom of the Arabs during the Jahiliyya era, if a husband said to his wife, \"Anti 'alayya kadhahri ummi\" (your back is forbidden to me like my mother's back), then from the moment the husband uttered those words, his wife was forbidden to be mixed with him, just as he was forbidden to interfere with his mother. . Such actions of husbands in the Age of Jahiliyyah were called \"dhihar\". In Islam this law is replaced by the law explained in surah al-MujJadilah\/58 verse 3. And those who make zihar for their wife, then take back what they have said, then (they are obliged to) free a slave before the two husband and wife mix. This is what you have been taught, and Allah is All-Aware of what you do. (al-Mujadilah\/58: 3) Then in this verse, Allah denounces one more habit of the Arabs during the Jahiliyyah, because it involved inventing something that was not true and had no solid foundation, namely adopting a child ). If someone adopts someone else's child as their child during the Jahiliyya period, then the laws that apply to their own biological child apply to that child, such as the occurrence of inheritance-inheritance relationships, mahram relationships, and so on. This habit of the Arab Jahiliah was once carried out by the Prophet Muhammad before the revelation of this verse. He once raised Zaid bin Harisah as his adopted son. This Zaid is the son of Harisah bin Syarahil and comes from Bani Thayyi' in Sham. When there was a war between one of the Arab tribes and the Bani Thayyi', little Zaid was captured and made into a slave. Then Khalil of the Tihamah tribe bought Zaid and then sold him to Hakim bin Ham bin Khuwailid. the judge gave Zaid as a gift to Khadijah, his father's sister. After the Prophet Muhammad married Khadijah, he was attracted to Zaid, so Khadijah presented Zaid to her husband. On hearing the news that Zaid was with Muhammad, Harisa, Zaid's father, went with his brother to Mecca with the intention of ransoming his beloved son. He also asked Muhammad to hand over Zaid. Prophet Muhammad then gave Zaid the freedom to decide for himself, even he did not want to accept the ransom. After being asked by him, Zaid chose to stay with the Prophet Muhammad, not wanting to go with his father to Syria. harisa and his brother then said to Zaid, \"Woe to you Zaid, you prefer slavery to freedom.\" Zaid replied, \"Indeed I see goodness in this man (Muhammad), which makes me unable to part with him, and I can not choose anyone other than him forever.\" The Prophet saw then came out to meet the crowd and said, \"By all of you witness that Zaid is my son, I will inherit him, and he will inherit me ...\" Hearing this, Harisa and his brother's hearts became happy, so Zaid was called \"Zaid bin Muhammad\" until this verse was revealed. According to Qurtubi, all commentators agree that this verse was revealed in connection with Zaid bin Harisah. It was narrated by al-Bukhari, Muslim, at-Tirmidhi, an-Nasa'i, and other hadith priests from Ibn 'Umar that he said, \"We never called \"Zaid bin harisah\", but we called him \"Zaid bin Harisah\". Muhammad\" until the revelation of this verse (al-Ahzab verse 5).\" With the revelation of this verse, the Prophet said, \"You are Zaid bin Harisah.\" At the end of this verse, Allah confirms again that the husband's words that his wife is forbidden to be interfered with by him as he is forbidden to interfere with his mother, and the act of adopting a child and making his position the same as his own (biological) child is just utterances of the tongue, has no basis in religion or true thoughts. Therefore, these remarks will not give rise to the slightest legal consequences. Allah says the truth, so that it is impossible for a wife to be likened to a mother, just as it is impossible for other people to be punished the same as their own children. All the children assign (carrying the father's name after their own name) to their father and mother. It is impossible for someone to say that someone else is the father of a child if it is not his offspring, just as it is also impossible for a mother to say that she is the mother of a child, even though she has never given birth to him. Therefore, Allah says words that are true and straight, so follow those words and follow the straight path that He has laid out. With the revelation of this verse, the bad consequences experienced by wives will disappear because of their husband's zihar and it is unlawful to adopt children and make them have the same laws as their biological children. As for looking after other people's children as a social charity to be raised and educated with the permission of their own parents, without inheriting, not making them a mahram as the status of biological children, and still being assigned to their parents, then that thing is not forbidden, it is even rewarded."
		   },
		   {
			"id": 3538,
			"surah": 33,
			"ayat": 5,
			"tafsir": "This verse explains that Allah commands that Muslims assign a child only to the father and mother, because the child comes from the sulbi bone of the father, then is conceived and born by the mother. Assigning children to their parents is Allah's law which must be obeyed by all Muslims. On the other hand, assigning children to other people who are not their parents is not God's law, but is a law made up by humans themselves, so that the law is unlawful. This opinion is agreed upon by most scholars who say, \"Adopting a child so that the position of the adopted child is the same as the position of a biological child, such as having the right to inherit, making a mahram relationship, and so on, is a major sin based on hadith: It was narrated from Sa'ad bin Abi Waqqash ra that The Messenger of Allah said, \"Whoever assigns himself to other than his father or assigns slaves to other than their master, then he has the right to receive the curse of Allah, the angels, and all of humanity, Allah Ta'ala does not accept the turning away of ransom sins from him. (History of al-Bukhari and Muslim) The hadith of the Prophet saw, he said: There is no one who assigns to other than his father, while he knows, but he has disbelieved. (Al-Bukhari and Muslim from Abu Dzarr) In another pronunciation, also narrated by al-Bukhari and Muslim, the Messenger of Allah said: Whoever attaches himself to other than his father, while he knows that the man is not his father, then it is unlawful upon it heaven. (History of al-Bukhari and Muslim from Sa'ad bin Abu Waqqash and Abu Bakrah) Al-Alusi in Tafsir Ruh al-Ma'ani distinguishes between confession and parenting. Adoption of a child that is carried out by someone against a child and assigns the child to him so that the law is the same as his own (biological) child, has inheritance rights, becomes a mahram and relative, the law is haram. But if someone takes a child and treats him as his own, but does not assign the child to him and does not declare his status equal in law with his own child, then Allah does not forbid him. This verse explains that if a child's father is unknown, and he is cared for by another Muslim, then the maintenance relationship with that child is the relationship between brothers and sisters in religion or the relationship between the master and the maula (servant who has been freed). Therefore, he must address the child as \"brother\" or \"maula\". Other people are also expected to call it that way, for example \"Salim maula Huzaifah\", because this Salim before the advent of Islam was Huzaifah's slave whose father did not know him. Allah then closes this verse by stating that all sinful acts such as imposing a child on someone who is not his father which was committed before this verse was revealed, as long as it is stopped after its descent, Allah will forgive him. Allah is Forgiving, Most Merciful to His servants."
		   },
		   {
			"id": 3539,
			"surah": 33,
			"ayat": 6,
			"tafsir": "This verse explains the position of the Prophet Muhammad among his people. It was explained that even though the believers put themselves first, the Prophet Muhammad paid more attention to, put them first, and put them first. The Prophet always helped and assisted them, and always wished them to follow the straight path that would lead them to eternal happiness. Therefore, in fact the Prophets are more entitled to themselves. The Prophet's love for the Muslims exceeded his love for any of Allah's creatures. Thus, let the Muslims follow all his orders. The Prophet is the leader of the Muslims in worldly life and their guide to the path of Allah. If he invites the Muslims to fight in the way of Allah, they should immediately follow him, no need to wait for permission from your parents. They should also always be willing to be the Prophet's ransom, shield, and caretaker. In another hadith, it is explained about the Prophet's leadership towards Muslims: Verily, the Messenger of Allah said, \"None of those who believe, except for me, is closest to him in this world and in the hereafter. Read the word of Allah, if you wish, \"The Prophet that is more important for the believers than themselves.\" So whoever among the believers (dies) and leaves wealth, then that property should be inherited by his 'ashabah (heir). And whoever leaves a debt or family, then come to me, then I will take care of the situation.\" (Al-Bukhari history from Abu Hurairah) Based on the verses and hadith above, the scholars agree that after the Prophet passed away, it was the priest who replaced him. Therefore, the priest is obliged to pay the debts of the poor who died, as the Prophet had done. The Imam paid the debt by taking the funds from the Baitul Mal or the State Treasury. Because the Messenger of Allah is the father of the Muslims, his wives are also their mothers. The meaning is to occupy the position of mother, in the obligation to glorify and respect it, and it is forbidden to marry her. As for other matters, such as the inheritance-inheritance relationship, the law on looking at her private parts or having khalwat with her is the same as for other women who do not have a mahram relationship. This principle does not contradict the word of Allah: Muhammad is not the father of any of you, but he is the Messenger of Allah and the Seal of the Prophets. (al-Ahzab\/33: 40) Because what is meant is that the Prophet Muhammad was the father of all believers, not the adoptive father of someone. Then this verse explains that relations of relatives are more entitled to be the cause of inheritance than relations of brotherhood, religion, or because of emigration. As it is known that the Muslims at the beginning of Islam in Medina inherited each other by way of brotherhood established by the Prophet, not on the basis of kinship. Therefore, one of the Muhajirin inherits from an Ansar, even though they are not related. They were inherited solely because of the brotherly relationship that had been forged by the Prophet. This kind of relationship was carried out by the Prophet because the immigrants who had just moved from Mecca to Medina were in a poor condition, because they did not have time to bring their belongings from Mecca. Meanwhile, the Ansar people, as the original inhabitants of Medina, naturally became helpers for these poor immigrants. At that time the main task of the Muslims was to strengthen the unity between the Muhajirin and the Ansar to face the enemy who was always looking for opportunities to destroy them. Strengthening the relationship between Muhajirin and Ansar is one way to strengthen that unity. So the Prophet PBUH strengthened this relationship by bringing the Muhajirin and Ansar people closer together. He made this brotherhood the same as brotherhood based on kin ties, so that between Muhajirin and Ansar could be inherited. Therefore, the Prophet brother Abu Bakr as-Siddiq, a Muhajirin, with Kharijah bin Zaid, an Ansar. Likewise Zubair was related to Ka'ab bin Malik and Umar bin Khaththab with 'Utbah bin Malik al-Ansari, Abu 'Ubaidah with Sa'ad bin Mu'az, and others. Hisham bin 'Urwah narrated from his father, from Zubair that he said, \"Surely we are all Quraysh who came to Medina without wealth, and found the Ansar group as the best friends, so we entered into a bond of brotherhood with them, and each had the right to inherit inherited. So Rasulullah saw brother Abu Bakr with Kharijah bin Zaid, I with Ka'ab bin Malik.\" After the Muslims became strong and the Muhajirin and Ansar people had a good life, then a verse came down which abolished the law of brotherhood in religion and migration as the basis of inheritance. Allah determines the relationship of relatives as the legal basis of inheritance, while the relationship between Muslims is returned to its original position, namely the relationship of the same religion, belief, mutual help which does not lead to inheritance, as explained in His word: Indeed, the believers are brothers. (al-hujurat\/49: 10) Hadith of the Prophet: One of you does not believe until he wants his brother what he wants for himself. (History of al-Bukhari, Muslim, Ahmad, and an-Nasa'i from Anas) Furthermore, Allah explained that it is not sinful for a believer to do good to other believers, which has established between them a relationship of affection, religious relations and so on. This kindness is in the form of a will for them, because they no longer have the right to inherit with the revelation of this verse. The value of this will has been determined by the hadith, namely not more than one third of the entire inheritance. Establishing \"ulu al-arham\" (relatives) as the legal basis for inheritance is Allah's decision stipulated in the Qur'an. Therefore, the law may not be exchanged or replaced by anyone."
		   },
		   {
			"id": 3540,
			"surah": 33,
			"ayat": 7,
			"tafsir": "This verse explains that Allah reminded the Prophet Muhammad that He had received promises from Noah, Abraham, Musa, and Isa that they would truly convey Allah's religion to mankind. They will also justify each other in conveying the message, namely by acknowledging the previous prophets from them as God's prophets. This verse is in line with the word of Allah: And (remember), when Allah took the agreement from the prophets, \"When I give you a book and wisdom and then a messenger comes to you who confirms what is in you, surely you will truly believe in him and help him.\" Allah said, \"Do you agree and accept the agreement with Me for that?\" They replied, \"We agree.\" Allah said, \"Then testify you (the prophets) and I will be a witness with you.\" (ali 'Imran\/3: 81) In this verse it is only mentioned the prophets who belong to ulul azmi, namely Nuh, Ibrahim, Musa, Jesus, and Muhammad, because they are the ones who have the Shari'a and the holy book. The promise given by the prophets is a strong and heavy promise that must be kept. In the afterlife, Allah will ask the prophets and their respective people about the implementation of the tasks they have promised. In another verse, Allah says: So surely We will ask the people who have received the call (from the apostles) and We will ask (also) the apostles. (al-A'raf\/7: 6)"
		   },
		   {
			"id": 3541,
			"surah": 33,
			"ayat": 8,
			"tafsir": "In this verse it is explained why Allah took a strong promise from the prophets to convey Allah's religion to people, and to help each other by telling each other that they are all Allah's messengers. The reason is that Allah can ask the prophets in the hereafter the task given to them, whether they have carried it out well or not, and how their people responded to that call. Likewise so that Allah can ask the people themselves in the hereafter about their attitude towards the call of the apostles. Thus, Allah provides a painful doom for those who deny the call of the apostles, as He provides a great reward for those who accept the call of the apostles."
		   },
		   {
			"id": 3542,
			"surah": 33,
			"ayat": 9,
			"tafsir": "In this verse, Allah reminds the Muslims of the great blessings He bestowed on them during the Ahzab War when they were tightly surrounded by allied troops consisting of soldiers from the Quraysh, Bani Gathafan, Bani an-Nadhir who had been exiled by the Prophet to Khaibar. and other soldiers who came to attack them in Medina. After a month of being surrounded, God drove away their enemies with an army of angels and a very cold and strong typhoon on a very cold night, so that the army's tents were blown away. At that time, trembling and fear arose in the hearts of the enemies, so that one of their leaders named thulaihah bin Khawailid al-Asadi said, \"Muhammad has bewitched you, so save yourself, save yourself!\" Thus, the Ahzab War was won by the Muslims without fighting, because the enemy had been driven away by the angelic army and the very strong cold wind. At the end of this verse, Allah explains that He saw and knew everything that the Muslims did in the Ahzab War, such as digging trenches, devising tactics and war strategies to uphold His religion. Allah also knows all the suffering they experienced during the siege of the enemy, but they faced all the suffering steadfastly and patiently. Everything that is experienced by the Muslims will receive a multiplied reward from Allah."
		   },
		   {
			"id": 3543,
			"surah": 33,
			"ayat": 10,
			"tafsir": "This verse explains that Allah knew when the allied army was coming from the bottom of the valley, that is, from the east, consisting of the Gathafan faction, residents of Nejed, and the Bani Quraidhah and Bani an-Nadhir accompanied them. Allah is also aware of the arrival of another allied group that comes from above the valley from the west consisting of Quraysh people and their followers from various tribes with Bani Kinanah and residents of Tihamah. When the enemy began to surround it, fear and trepidation arose, especially in the hearts of the hypocrites who accompanied the Muslims. Their eyes widened and their throats felt congested with fear, and there rose up in their hearts misgivings, doubts, and various prejudices. Some of them even suspected that the Muslims would be defeated by the allied forces, considering that their numbers were far greater than the number of Muslims. As for those who believe, they truly believe in Allah's promise, that the Messenger of Allah and the Muslims will win the war, and Allah's help will definitely come, and they really believe in His power and greatness. While the hypocrites think that the Muslims and the religion of Islam will be destroyed and destroyed. The polytheists of Mecca will conquer the city of Medina and return it to the state of the Jahiliyyah."
		   },
		   {
			"id": 3544,
			"surah": 33,
			"ayat": 11,
			"tafsir": "In such a tense situation, Allah tests the strength of the faith of those who believe, so that it is clear which one is truly a believer, who purifies obedience to Allah alone, believes that Muhammad is the messenger of Allah, and also believes in the victory of Islam and the Muslims. , as well as those whose faith is shaky and fragile, who follow the Messenger of Allah only to seek their own benefit. It's as if the Ahzab War was a selection for Muslims, about who is truly a friend and who is truly an enemy. (12) According to history, thu'mah bin Ubairiq and seventy other people said, \"How did we promise the conquest of the Persian and Roman empires, even though at this point none of us could defecate. \" They deliberately said this statement when they heard the news about the incident that happened when the Prophet was digging a ditch and hoeing a rock that emitted light as has been explained. So Allah sent down this verse. In this verse, the results of Allah's test are explained to the Muslims, namely by the words of hypocrites like Mu'attib bin Qusyair and other people who are still weak in faith, \"All that Allah and His Messenger have promised us, is as will be winning, obtaining happiness in life, and so on, are nothing but deceit and empty promises, even those promises cause misery and havoc for all of us. Muhammad said that the Persian and Roman empires would fall under the rule of the Muslims, but in reality now, the Muslims who will conquer it are being tightly surrounded by the allied army and will experience destruction and annihilation.\""
		   },
		   {
			"id": 3545,
			"surah": 33,
			"ayat": 12,
			"tafsir": "In such a tense situation, Allah tests the strength of the faith of those who believe, so that it is clear which one is truly a believer, who purifies obedience to Allah alone, believes that Muhammad is the messenger of Allah, and also believes in the victory of Islam and the Muslims. , as well as those whose faith is shaky and fragile, who follow the Messenger of Allah only to seek their own benefit. It's as if the Ahzab War was a selection for Muslims, about who is truly a friend and who is truly an enemy."
		   },
		   {
			"id": 3546,
			"surah": 33,
			"ayat": 13,
			"tafsir": "Among them, such as 'Abdullah bin Ubay and his friends, there were also those who said, \"O residents of the city of Medina, this place is not a place for us to live in, so return to your respective homes, so that you will not be afflicted with disaster and tribulation and not be killed by the enemies who are surrounding us.\" Some commentators have interpreted, \"O people of Medina, there is no place for all of you to continue to adhere to the religion of Muhammad. Return to your former religion, and surrender Muhammad and his followers to his enemies who are besieging it, so that the safety of you all guaranteed.\" Because of the words and invitations of the hypocritical and Jewish leaders, some of them were influenced and asked the Prophet to leave the battlefield and return to their homes. Among those asking for it is Bani Harisah. The reason they put forward was that their houses were close to the bases of the enemy troops and the walls were not strong, they were worried that the enemy would take their possessions. At the end of this verse, Allah explains that all the reasons put forward by the hypocrites and the Jews are just made up reasons. They put forward these reasons solely to avoid themselves from participating in the war with the Prophet and the Muslims, because they did not see an advantage that they would get."
		   },
		   {
			"id": 3547,
			"surah": 33,
			"ayat": 14,
			"tafsir": "This verse explains the weakness of heart and confidence of the hypocrites and Jews who are receiving God's trials. They were not able to overcome the difficulties they were facing, and could not face the dangers and threats that came to them, so they asked the Prophet to be allowed to leave the battlefield. The state of their hearts and beliefs is described by Allah as follows, \"Suppose the allied forces entered the houses of the hypocrites and Jews from all over, destroyed and robbed what was in them, abused and killed their children and families, asked them to embracing the religion of shirk again, causing trouble and hitting the Muslims from behind, of course they will allow the actions of the enemy and follow whatever they want. This is due to fear and no aspirations in their hearts, except for seeking worldly pleasures and mere personal gain .\" From this verse it is understood that it is fear that is the cause, so that the hypocrites and the Jews have no stand. The fear arises in their hearts because there is not the slightest faith. Yet if they think correctly and weigh the pros and cons, they are safer if they take part in the war."
		   },
		   {
			"id": 3548,
			"surah": 33,
			"ayat": 15,
			"tafsir": "This verse explains that the people who asked permission to leave the battlefield had promised the Prophet that they would not betray him and would join the fight with the Muslims against the polytheists. However, in the end they broke their promise. According to history, the Bani Harisah once fled from the battlefield of Uhud, then they asked the Prophet to forgive their mistakes. They promised not to run away from the battlefield anymore and to fight with the Prophet and the Muslims. At the end of this verse, Allah confirms that those who have promised will be held accountable for what they have said. On the Day of Judgment, they will be rewarded according to their actions."
		   },
		   {
			"id": 3549,
			"surah": 33,
			"ayat": 16,
			"tafsir": "In this verse, Allah ordered the Messenger of Allah to convey to those who avoided themselves and fled from the battlefield, that their actions would not be of the slightest benefit. They will not be able to avoid the death that Allah has ordained, cannot avoid the killing that Allah has ordained of a person, which will be carried out by his enemies. Everything has been ordained by Allah, no one can change it. If a person can run away from battle and it benefits him, and can avoid his own death, then that is only temporary. Life in this world is a mortal life, even though it feels long, in essence it is very short compared to the eternal life in the afterlife."
		   },
		   {
			"id": 3550,
			"surah": 33,
			"ayat": 17,
			"tafsir": "According to another tradition, it was the Jews who invited him. They invite the hypocrites to avoid the Prophet and the Muslims by saying, \"If Abu Sufyan wins, surely Muhammad and his followers will all be destroyed.\" Because of that this verse came down. In this verse, Allah ordered the Prophet Muhammad to answer the words of those who said that they would be safe if they left the battlefield. Allah said, \"None of you is able to avoid being killed or afflicted if Allah has ordained it. Likewise, no one can bring something good to someone if Allah does not will it. The benefit and poverty are only Allah who determines it, no one is capable of replacing or changing it. Therefore, the hypocrites and Jews who betrayed the Prophet will not find anyone who can help and avert the disaster that will befall them. According to a history, 'Abdullah bin Ubay and his friends, The hypocrites and the Jews said to the Muslims, \"Muhammad and his followers are very few compared to the number of the Quraysh and their allies. Therefore they must perish, and let us flee from them.\""
		   },
		   {
			"id": 3551,
			"surah": 33,
			"ayat": 18,
			"tafsir": "This verse explains that Allah truly knows those who hinder people from following the Messenger of Allah to fight in His way. He also knew of people who were reluctant and asked permission from the Prophet not to join the war, as well as people who invited the people of Medina not to fight with him. Meanwhile, there are also people who take part in the war for a short time just to show the Muslims that in fact they are among those who take part in the war. However, while the Muslims were off guard, they disappeared silently and returned to their respective homes."
		   },
		   {
			"id": 3552,
			"surah": 33,
			"ayat": 19,
			"tafsir": "In this verse, Allah mentions the characteristics of those who always avoided participating in the war with the Prophet: 1. They did not help Muhammad and the Muslims in facing the enemy, whether in the form of material or physical aid. 2. When the enemies have attacked and the believers have fought bravely to repel the enemy's attack, they turn left and right in fear and look for ways and opportunities to escape from the battlefield to avoid death. 3. When the battle is over and they feel they are safe, they act arrogantly and boast about their merit and bravery on the battlefield, even though all of that is sheer nonsense that hurts their hearts. It was as if they were the ones fighting tooth and nail until victory was achieved, even though everything they said was a lie. 4. They are very greedy for the spoils that have been obtained by the Muslims, and do not want to give up what they have earned. Whereas before they did not want to spend money to help the Prophet. People who are like those mentioned above are essentially people who do not believe in Allah and His Messenger, do not do good deeds sincerely and do not want to make the slightest sacrifice, because they are hypocrites. Because of their nature and attitude like that, Allah erases all the rewards of their deeds and makes them as if dust is flying which has no meaning at all. Removing the reward for the deeds of the hypocrites is not difficult for Allah, but very easy for Him, because He is the Almighty, the All-Knowing of everything."
		   },
		   {
			"id": 3553,
			"surah": 33,
			"ayat": 20,
			"tafsir": "Because they were very scared, the hypocrites thought that the allied troops were still on the battlefield, even though the soldiers had fled scattered, returning to their respective countries. This shows that the hypocrites are cowards and have no faith so they don't join the war, as if they weren't there. Therefore, they do not know the enemy's movements. In the meantime, if the allied forces attack again, they want them to be in Badiyah (desert) far from the city together with the Bedouin Arabs and desert residents, so they are not exposed to the danger of war. For them, it would be enough if they could ask the people who came to their place about the condition of the Prophet and the Muslims. Furthermore, Allah explained that in the past war, if the hypocrites had not left the battlefield and remained with the Muslims at the forefront, then there was a terrible battle, then they would not have joined the war either. Even if they go to war, they do not fight with all their heart and faith. They will fight the enemy just to fulfill the Prophet's request."
		   },
		   {
			"id": 3554,
			"surah": 33,
			"ayat": 21,
			"tafsir": "In this verse, Allah warns the hypocrites that they can actually get a good example from the Prophet. The Prophet Muhammad was a man of strong faith, brave, patient and steadfast in facing all kinds of trials, fully believed in all the provisions of Allah, and had noble morals. If they aspire to be good human beings, happy living in this world and in the hereafter, surely they will emulate and follow them. However, their actions and behavior show that they do not expect Allah's pleasure and all kinds of forms of that essential happiness."
		   },
		   {
			"id": 3555,
			"surah": 33,
			"ayat": 22,
			"tafsir": "In this verse, Allah explains the attitudes and actions of the Muslims in facing the Ahzab War. They work and fight solely because of Allah and follow the orders of the Prophet, not because of their own interests. All their property and even their bodies and souls were handed over to the Prophet for the benefit of the struggle. They fought steadfastly and patiently. The greater the danger threatens, the stronger their faith and fortitude will be. When they saw the condition of the allied army which was very large in number and about to attack them, while their numbers were only a few, they said, \"This is what Allah and His Messenger have promised us, in the form of tests and trials, as a prelude to the victory that will come. By Therefore, we must be steadfast and patient in dealing with it. In another verse, it is explained the terms of happiness and victory that will be obtained by those who believe. Allah says: Or do you think that you will enter heaven, but you have not yet come to you (trials) like (experienced) those before you. They were struck by poverty, suffering and shaken (with various trials), so that the Apostle and those who believed with him said, \"When will Allah's help come?\" Remember, verily Allah's help is near. (al-Baqarah\/2: 214) And His word again: Do people think that they will be left alone by saying, \"We have believed,\" and they will not be tested? (al-'Ankabut\/29: 2) It was narrated by Ibn Kasir that when he was digging the trenches before the allied troops arrived, the Messenger of Allah once said that Jibril had told him that the Persian and Roman empires would be subject to the rule of the Muslims. Hearing the news, the Muslims were very happy because they believed that it was God's promise. When the allied troops came to besiege them, they assumed that the arrival of the allied troops was a test and trial for them before gaining victory and before they conquered the Persians and Romans, so they said, \"It is true what Allah promised by expanding the religion of Islam to all corners of the world in in the future, and it is also true what Allah hinted at to achieve that victory and happiness, namely trust and patience in accepting trials and obstacles.\""
		   },
		   {
			"id": 3556,
			"surah": 33,
			"ayat": 23,
			"tafsir": "In a hadith narrated by Ahmad, Muslim, at-Tirmidhi, an-Nasa'i, and other hadith priests from Anas's friend, he said, \"My uncle Anas bin an-Nadhar, did not join the Badr War, so he felt sad and disappointed. He said, 'I was not present at the first battle that the Prophet participated in. Indeed, if Allah gave me the opportunity to join the war with the Messenger of Allah after this, surely Allah Taala would see what I would do. So my uncle could participate in The Battle of Uhud. On the way to Uhud, my uncle met Sa'ad bin Mu'adh, and Sa'ad asked him, 'Hi Abu 'Amr, where are you going? Uhud later. So my uncle continued to Uhud and died as a martyr there. On his body there are about 80 marks of blows, spear thrusts, and arrow holes.\" Then come down this verse. Allah explained that among the Muslims who truly believe in Allah and His Messenger, there are those who keep their promises. They have fought with all their souls and wealth, some of them were martyred in the Badr War, Uhud War, Khandaq War, and other wars, while some others were waiting for their lives to be extended, waiting for the decree of Allah Almighty. . These people who are still alive, will never change their promises to God, they will keep their promises throughout their life in the body. In Tafsir al-Kasysyaf it is explained that some of the companions made a vow: if they joined the war with the Prophet, they would not back down and would persist until they died as martyrs. Among the friends who promised this were Usman bin Affan, thalhah bin 'Ubaidillah, Sa'id bin Zaid, hamza, Mush'ab bin 'Umair, and other friends."
		   },
		   {
			"id": 3557,
			"surah": 33,
			"ayat": 24,
			"tafsir": "In this verse, Allah explains that the reason for trials and trials for believers is to distinguish between the bad and the good, those who truly believe and those who disbelieve. This test also aims to reveal and reveal what is in their true hearts. In this case, Allah says: And indeed, We will really test you so that We know those who really strive and are patient among you; and we will test you. (Muhammad\/47: 31) And the word of Allah: Allah will not let those who believe as in your current situation, so that He distinguishes the bad from the good. (ali 'Imran\/3: 179) Then after their situation is clear, Allah will reward those who truly keep their promises, and punish the hypocrites who do not keep their promises. Even so, the door of repentance is still open for the hypocrites, that is, if they believe, keep their promises and do good deeds. Allah will forgive the sins he has done before. At the end of this verse, Allah confirms to His servants that He is Most Forgiving, Most Merciful, wiping out all the sins of those who truly repent, as if they had never committed those sins. From this verse it is understood that the door of repentance is always open, for every servant who does it. Therefore, let the Muslims always do it."
		   },
		   {
			"id": 3558,
			"surah": 33,
			"ayat": 25,
			"tafsir": "In this verse, Allah again explains about the great blessings He has bestowed on the Muslims in the Ahzab War, so that they are saved from the danger of destruction. The favor is that God has sent them reinforcements in the form of very cold strong winds and invisible angelic armies. As a result, those who disobey Allah and His Messenger, namely the Quraysh and their followers, Gathafan and his followers, the Jews and the hypocrites, do not get what they want, they even run headlong to seek their own safety. , returned to their respective hometowns. Al-Bukhari and Muslim narrated from Abu Hurairah that the Messenger of Allah said: There is no god but Allah alone. He keeps His promise, helps His servant, wins His army, destroys the lone allied army, then there is nothing after that. In another hadith al-Bukhari and Muslim from 'Abdullah bin Abu Aufa, he said, \"Rasulullah saw prayed to Allah: \"O God who has sent down the Qur'an, his reckoning is very fast, destroy the allied army, O Lord , destroy them and shake them.\" According to the history of Muhammad bin Ishaq, when the allied soldiers had fled and left the ditch, the Prophet said: The Quraysh will never fight you after this year, but you will fight them. . This saying of the Prophet was proven later on. After the Ahzab War, the polytheists never again fought the Muslims, but it was the Prophet and the Muslims who fought them, until Mecca was conquered. Therefore, it can be said that the Ahzab war was the culmination the difficulties faced by the Prophet and the Muslims in dealing with polytheists in spreading the religion of Islam.Even though these difficulties still exist, but insignificant when compared with the previous difficulties. At the end of this verse it is emphasized that Allah is Almighty, Mighty, nothing can be matched. Therefore, He easily drove away the many allied armies."
		   },
		   {
			"id": 3559,
			"surah": 33,
			"ayat": 26,
			"tafsir": "This verse describes the war against the Banu Quraiddah, one of the Jewish tribes of Medina who had made a peace treaty with the Prophet. As previously explained, when the Muslims were in critical condition facing the allied army in the Ahzab War, the Jews of Bani Quraidhah who were residents of the city of Medina betrayed the Muslims from within. Their leader, Ka'ab bin Asad, was instigated by the leader of the Banu an-Nadhir, huyai bin Akhthab, to cancel the peace treaty they had made with the Prophet, and to join the allied forces that were besieging the city of Medina. The invitation was initially rejected by Ka'ab bin Asad, but eventually he accepted. So they betrayed the Prophet and joined the Ahzab group. The news of the betrayal of the Bani Quraidhah shocked the Muslims, because it happened in the city of Medina. Therefore, Rasulullah saw immediately sent two of his friends, namely Sa'ad bin Mu'adz, chief of the Aus tribe, and Sa'ad bin Ubadah, chief of the Khazraj tribe, to Bani Quraidhah to advise them not to continue the betrayal. Upon arrival of the two envoys at the place of the Bani Quraidhah, both of them immediately conveyed the messages of the Prophet. However, they rejected the Prophet's request in a rude and haughty manner, and they continued the betrayal. After Allah drove away the allied troops, He revealed to the Prophet Muhammad, so that the Muslims would immediately annihilate the Bani Quraidhah who had betrayed them. Therefore, the Prophet and the Muslims immediately made calculations with the traitors. The Prophet and the Muslims immediately came to their village to surround it. After hearing the arrival of the Prophet and the Muslims, they immediately entered the fortresses to defend themselves. The Muslim army at that time was led by Ali bin Abi Talib. After twenty-five days they were surrounded in the forts in full fear, they wanted to surrender to the Prophet on condition that Sa'ad bin Mu'adz, the chief of the Aus tribe, would be the judge of their actions. The submission and conditions were accepted by the Prophet, so they came down from the forts and surrendered to him. After careful consideration, Sa'ad sentenced them to death, their men were killed, while the women and children were taken prisoner. Such punishment is natural for country traitors who are in a state of war, moreover the betrayal was committed when the enemy was launching an attack. The Islamic community in Medina at that time was a society that had just grown, a society that was just starting to implement laws based on Islamic provisions that were different from the old laws. Therefore, it is only natural that the punishment given to the Bani Quraidhah who betrayed during the war, so that the law of war applies. With that punishment, the city of Medina remained strong and the Prophet remained authoritative and other residents of Medina knew and realized that every betrayal would be subject to appropriate punishment."
		   },
		   {
			"id": 3560,
			"surah": 33,
			"ayat": 27,
			"tafsir": "This verse explains that the property of the Bani Quraidhah who were sentenced to death had been given by Allah to the Muslims, including all the gardens, houses and livestock they owned. Even in this verse, Allah promises the Muslims that He will inherit other lands, which at that time had not yet been entered by the Islamic army, but they will surely enter and conquer them. At the end of this verse, Allah explains that He has the power to give everything to the Muslims to help them carry out His religion and to expand Islam itself. It is a provision that must be fulfilled."
		   },
		   {
			"id": 3561,
			"surah": 33,
			"ayat": 28,
			"tafsir": "Allah ordered Rasulullah saw to convey to his wives so that they choose what they want from two things. The first option is if they want worldly life with all its pleasures, then the Prophet does not have that, and he has nothing to give to fulfill that desire. Therefore, the Prophet would reject them and he gave mut'ah, as had been prescribed by religion. He will also divorce them on good terms too. According to Allah's provisions, a husband who divorces his wife voluntarily gives mut'ah in the form of clothes, money, or jewelry to his divorced wife, according to her ability, the rich according to their wealth and the poor according to their poverty. Allah's Word: And you should give them mut'ah, for those who are able according to their abilities and for those who are unable according to their abilities, namely giving in an appropriate way, which is an obligation for those who do good. (al-Baqarah\/2: 236) Allah also stipulates that if a husband cheats on his wife, then he should release them properly and mentally during the sacred period before interfering, so that they can perform Idah for a short period. Allah said: O Prophet! If you divorce your wives, then you should divorce them when they can (face) their (natural) beauty, and count the time of that beauty, and fear Allah your Lord. (ath-thalaq\/65:1) At the time this verse was revealed, the Prophet had 9 wives, namely 'Aisyah bint Abu Bakr, Hafshah bint 'Umar, Umm Salamah, Umm habibah Ramlah bint Sufyan, Saudah bint Zam'ah, Zainab bint Jahsy, Maimunah bint Hars, safiyyah bint Huyai bin Akhthab, and Juwairiyah bint al-haris. Of his nine wives, five people came from the Quraysh tribe and four people were not from the Quraysh tribe. Allah's Word: If he (the Prophet) divorces you, maybe God will replace him with wives who are better than you, women who are obedient, who believe, who obey, who repent, who worship, who fast, who widows and virgins. (at-Tahrim\/66: 5)"
		   },
		   {
			"id": 3562,
			"surah": 33,
			"ayat": 29,
			"tafsir": "The second choice that the Prophet conveyed was that if his wives choose the pleasure of Allah and His Messenger and the reward of the hereafter, then obey Allah and His Messenger. Allah has prepared a great reward for his wives who are good in words, deeds and behavior. They are placed in a paradise full of pleasure."
		   },
		   {
			"id": 3563,
			"surah": 33,
			"ayat": 30,
			"tafsir": "In this verse, Allah warns the Prophet's wives to always take care of themselves because they are the mothers of all Muslims and become role models for them. Allah's command is, \"Anyone among the wives of the Prophet who commits abominable deeds, forbidden acts, and so on, they will get punishment twice as much as the punishment that ordinary people receive.\" Giving a doubling punishment to the wives of the Prophet this is because they are among those who have actually known the commandments and prohibitions of Allah. Besides that, they are also the guardians of the Prophet's household from all evil deeds that might occur in it. Some scholars stipulate the law based on this verse that for crimes of the same type, the punishment that will be received by those who know is heavier than the punishment that will be received by those who do not know. People who know already know the consequences of an action. If he commits the act, it means that he is doing it with full awareness, while those who don't know, he is doing the crime without real awareness. Therefore, those who know must be punished twice as much as those who do not know. It was narrated that a man said to Zainal 'abidin ra, \"Surely you are the family of the Prophet who has received forgiveness.\" So Zainal 'abidin was angry with the man and said, \"What Allah has ordained for the Prophet's wives is more appropriate for us than what you say. We think that our reward for virtue is multiplied as our mistakes are multiplied.\" Then he read this verse."
		   },
		   {
			"id": 3564,
			"surah": 33,
			"ayat": 31,
			"tafsir": "In this verse, Allah explains that anyone from the wives of the Prophet. peace be upon him who remained obedient to Allah and His Messenger, and did good deeds, He would surely give them a double reward as a reward for them. This award is due to their position as \"Ummahatul Mu'minin\", namely the mother of all believers, and they are in the house of the Prophet, where Allah's revelation descends, light of wisdom and guidance to the straight path. In addition to multiple rewards, Allah will also provide glorious sustenance in this world and in the hereafter. In this world because they are the center of attention of all believing women who look at them with respect and authority and in the hereafter because they are the wives of the Prophet. peace be upon him who will be placed by Allah at a high degree in heaven Jannatun Na'im."
		   },
		   {
			"id": 3565,
			"surah": 33,
			"ayat": 32,
			"tafsir": "In this verse, Allah warns the wives of the Prophet. saw that those with the nickname \"Ummahatul Mu'minin\" cannot be equated with any other believing women in terms of virtue and respect, if they are truly pious. No woman can match their position let alone exceed their virtues because their husbands are \"Sayyidul Anbiya 'wal Mursalin\". Therefore, when holding a conversation with other people, they are prohibited from lowering their voice which could cause bad feelings towards their sanctity and honor, especially if those who are facing are wicked or hypocritical people whose good faith is doubtful. The Prophet's Wives peace be upon him, after he died no one could marry him, in accordance with the word of Allah: And you are not allowed to offend (the heart of) the Messenger of Allah and may not (also) marry his wives forever after (the Prophet's death). Indeed, that is very great (sin) in the sight of Allah. (al-Ahzab\/33: 53)"
		   },
		   {
			"id": 3566,
			"surah": 33,
			"ayat": 33,
			"tafsir": "In this verse, Allah commands that the wives of the Prophet. stay in their respective homes and do not go out unless there is a need. This order applies to the wives of the Prophet. saw. They are prohibited from showing off their jewelry, and behaving like the ancient Jahiliah people before the time of the Prophet Muhammad. After they were prohibited from doing bad things, they were ordered to do good things, such as establishing five daily prayers according to the conditions and pillars and paying zakat on their property. It has become a habit, when it is called prayer, it is always associated with zakat, because both of them produce self-cleanliness and wealth. The lesson from both of them is to remain obedient to Allah and His Messenger because that is the implementation of the contents of the two sentences of creed which are the way of happiness in this world and the hereafter. Allah issued the command accompanied by the title \"ahlul bait\", that is, all the households of the Prophet Muhammad, with the intention of eliminating sins from them. God also intends to cleanse them from the filth of ungodliness and hypocrisy that usually sticks to sinners. Thus, Allah will clean them thoroughly. Anas bin Malik in order to explain who is meant by ahlul bait in this verse narrates: Indeed, the Messenger of Allah always came to the house of his daughter Fatimah, for six months at every Subuh prayer. He called out, \"Salat, O Ahlul Bait, verily Allah wants to remove sins from you, and cleanse you as clean as possible.\" (History of at-Tirmidhi and Abu Dawud ath-thaalisi from Anas bin Malik)"
		   },
		   {
			"id": 3567,
			"surah": 33,
			"ayat": 34,
			"tafsir": "In this verse, Allah explains the reasons why they got this great gift. Among them is because of the residence of the Prophet's wives. those are the places of revelation. Allah ordered the wives of the Prophet. peace be upon them to teach what is recited in their homes from the verses of Allah and the traditions of the Prophet to others. The Sunnah of the Prophet could be in the form of what they witnessed about the Prophet's life in the household environment and related to Islamic law."
		   },
		   {
			"id": 3568,
			"surah": 33,
			"ayat": 35,
			"tafsir": "In this verse Allah explains the characteristics of His servants who will be forgiven for all their sins and mistakes and put into heaven. There are ten types of their characteristics: 1. Obey and submit to Islamic law, both speech and deed. 2. To justify and believe in the teachings of Allah and His messengers. 3. Always carry out religious orders with full solemnity and serenity. 4. Always be true in words and deeds, as a sign of perfect faith. In an authentic hadith it is stated that the Messenger of Allah said, \"Hold the truth, that truth leads to virtue, and virtue will lead to heaven, and stay away from lies, because lying leads to iniquity and disobedience leads to hell.\" 5. Patience in facing difficulties and suffering in carrying out God's commands and holding back lust and lust. 6. Being humble and humble to Allah, both physically and spiritually, in carrying out all duties and obligations and sincerity solely to seek Allah's pleasure. 7. Give charity with wealth and provide assistance to those who are lacking and have no income. 8. Fasting can help subdue lust and lust, as stated in the words of the Prophet Muhammad \"O young people, who among you who can afford to get married please get married, because marriage is more able to hold the eye and protect the genitals better, and goods whoever is not able to, should fast, because fasting can stem his lust.\" (Al-Bukhari and Muslim history from Ibn Mas'ud) 9. Protecting private parts and honor from all acts that are forbidden and heinous, according to the word of Allah: And those who guard their private parts, except for their wives or slaves they have ; then verily they are not reprehensible. But whoever seeks behind it (adultery, and so on), then they are the people who transgress. (al-Mu'minun\/23: 5-7) 10. Always remember Allah with the tongue and heart, in accordance with the hadith narrated from Mujahid which states that a person is not called a lot of remembering Allah except when he can remember Him while standing , sitting, and lying down. Abu Sa'id al-Khudri has narrated a hadith that the Messenger of Allah said: \"If a husband wakes up his wife at night and then they pray two rak'ahs of Tahajud, then both of them that night are among those who remember Allah a lot.\" (History of Abu Dawud, an-Nasa'i, and Ibn Majah) In another hadith from Sahal bin Mu'az al-Juhani from his father it is narrated that a man asked Rasulullah saw: \"Which warriors are the most rewarded O Messenger of Allah?\" The Prophet replied, \"The one who remembers Allah the most. Then he asked again,\" Which way of the fasting person is the greatest reward?\" The Prophet replied, \"The one who remembers Allah the most.\" giving alms, going on hajj and giving alms, and on all of that the Prophet said, \"Those who remember Allah the most.\" Abu Bakr then said to Umar, \"The one who remembers Allah a lot has brought all the good.\" And the Prophet added, \"Indeed it is.\" (Recorded by Ahmad)"
		   },
		   {
			"id": 3569,
			"surah": 33,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains that it is not proper for believers, both men and women, if Allah and His Messenger have determined a provision, they choose another provision that is contrary to the provisions of both. Making your own choices that are not in accordance with the provisions of Allah and His Messenger means disobeying the orders of both of them, and straying from the right path. Such a thing is also threatened by Allah with His word: So let those who violate the orders of His Messenger fear that they will be tested or subjected to a painful punishment. (an-Nur\/24: 63)"
		   },
		   {
			"id": 3570,
			"surah": 33,
			"ayat": 37,
			"tafsir": "Furthermore, in this verse, Allah warned His Prophet that what happened between Zaid bin Haritsah and Zainab bint Jahsy was to strengthen his faith by confirming the truth and removing doubt from the hearts of those who are weak in faith. Allah ordered His Apostle to pay attention to his words when he said to Zaid bin Harithsah, \"Hold on to your wife and fear Allah, and do not part with her because of her pride or arrogance because of heredity, because divorce will result in stains that are difficult to erase.\" The Prophet himself had known that Zaid would eventually divorce Zainab. He felt it would be hard if this became a reality, because it would generate various kinds of responses among the people. The Prophet hid in his heart what Allah revealed, because the Prophet himself realized that he himself had to be set as an example by all his people to carry out Allah's commands even at the cost of feelings. According to instinct, humans are usually afraid of fellow human beings, even though it is Allah who has more right to be feared. He imagined that if he were to marry Zainab, the ex-wife of his adopted son, it would surely become a topic of conversation among the Arabs, because since the Jahiliyyah they considered that an adopted child is the same as a biological child, so they forbade marrying the ex-wife of an adopted son."
		   },
		   {
			"id": 3571,
			"surah": 33,
			"ayat": 38,
			"tafsir": "In this verse, Allah reinforces the law that has been stipulated previously, namely that there is no objection whatsoever to the Prophet saw, what was Allah's decree for him to marry the wife of his adopted son's ex-wife after being divorced by her husband and her end of her waiting period. The Jews often criticized the Prophet Muhammad for having many wives, even though they knew that earlier prophets had more wives, such as Prophet David and Prophet Sulaiman. The Prophet Muhammad was ordered by Allah not to pay attention to the public talk regarding his marriage to Zainab. When Zaid had divorced his wife, Allah married the Prophet to Zainab so that there would be no objection for the believer to marry the ex-wife of his adopted son if he had been divorced. God's decree regarding Zainab's marriage to the Prophet is a definite provision. It was narrated by al-Bukhari and at-Tirmidhi that Zainab often boasted about herself in front of the Prophet's wives. others with the words, \"You were married by your own family, but I was married by Allah. It was narrated by Ibn Jarir ath-tabari from Sya'bi that Zainab once said to the Prophet, \"I have advantages with three things that your wives don't have. another, namely: my grandfather and your grandfather are the same, namely Abdul Muttalib; God married you to me with a revelation from the sky; and the one assigned to convey it is the Archangel Gabriel.\""
		   },
		   {
			"id": 3572,
			"surah": 33,
			"ayat": 39,
			"tafsir": "In this verse, Allah explains that the apostles who preceded the Prophet Muhammad had carried out sunatullah. They are people who are full of piety and sincerity in worship. They are also people who convey Allah's laws, are very afraid of Him and are not afraid of other than Him. The Prophet Muhammad was also ordered to make him an example in carrying out sunatullah, and Allah is sufficient as a reckoning maker."
		   },
		   {
			"id": 3573,
			"surah": 33,
			"ayat": 40,
			"tafsir": "When the Prophet married Zainab, many hypocrites denounced the marriage because it was seen as marrying the ex-wife of one's own child. So Allah sent down this verse which states that the Prophet Muhammad did not have to worry about the ridicule of people who said that he married his son's ex-wife, because Zaid was not his biological son, but only an adopted son. Muhammad peace be upon him was not the father of any man among his people, but he was the Messenger of Allah and His last prophet. There is no other prophet after him. The Prophet Muhammad saw was the father of the Muslims in terms of honor and compassion as every apostle was the father of all his followers. Muhammad was not the father of a man from his people with the meaning of \"father\" in terms of heredity which caused the prohibition of mushaharah (abbreviation), but he was the father of all the believers in terms of religion. He has compassion for all his people to gain happiness in life in this world and in the hereafter, like the love of a father for his children. There were three sons of the Prophet from Khadijah, namely Qasim, Thayyib and Tahir, all of whom died before reaching puberty. From Mariyah al-Qibthiyah, the Prophet had a son named Ibrahim who also died when he was young. Besides three sons, the Prophet also had four daughters from Khadijah, namely Zainab, Ruqayyah, Umm Kaltsum, and Fatima. The first three died before the death of the Prophet. Allah Knows everything about who was appointed as the previous prophets and who was appointed as the final prophet. The following are the hadiths that explain the Prophet Muhammad's position as the closing or final prophet, including: From Jabir bin Mut'im that he said, \"I heard the Messenger of Allah say, 'I have several names: I am Muhammad, I am Ahmad, I am al- Mahi where Allah removes disbelief with me and I am al-hasyir where people are gathered under my feet and I am also al-'aqib where there are no more prophets after me.\" (Al-Bukhari and Muslim) From Jabir bin 'Abdullah that he said, \"Rasulullah said, 'My position among the prophets is like a man who builds a house, he perfects and decorates it except for one place of stone (brick that has not been laid) ). People who entered the house and saw it said, 'How good is this house, except for one stone place (brick that has not been installed), then I am the stone (brick that has not been installed), where I am the cover of prophethood.\" (Muslim history) It was narrated from Abu Hurairah that he said, \"Rasulullah said, 'I am superior to the prophets by six things: 1) I was given a short but solid sentence (broad meaning). 2) I was helped by (given a sense of) fear ( spoils of war for enemies). (Muslim history and at-Tirmidhi) From Anas bin Malik that he said, \"Rasulullah said, 'Apostolate and prophethood have been cut off, there are no more apostles and prophets after me.\" (Ahmad's history)"
		   },
		   {
			"id": 3574,
			"surah": 33,
			"ayat": 41,
			"tafsir": "In this verse, Allah encourages all believers who justify Allah and His messengers to remember Allah a lot in remembrance by saying His name as much as possible with their hearts and tongues in every situation and every time. Because, Allah is the one who bestows all the blessings to those who are not infinite. They were ordered to glorify Him in the sense of cleansing and purifying Allah from everything that is not suitable for Him. This remembrance and chanting is done in the morning when you just wake up from sleep, because at that time it is as if someone has come back to life after death, to face a new life. It was also ordered to glorify in the evening because at that time someone had finished doing all kinds of work throughout the day. Dhikr at that time was a sign of gratitude to Allah for the abundance of His taufik and guidance so that he could carry out his work well, and be able to obtain sustenance for his life needs and maintenance for his family. With lots of remembrance, he can serve himself to Allah and to face the afterlife. Besides that, he can also examine the actions that have been carried out so that he can make the necessary improvements for the days to come."
		   },
		   {
			"id": 3575,
			"surah": 33,
			"ayat": 42,
			"tafsir": "In this verse, Allah encourages all believers who justify Allah and His messengers to remember Allah a lot in remembrance by saying His name as much as possible with their hearts and tongues in every situation and every time. Because, Allah is the one who bestows all the blessings to those who are not infinite. They were ordered to glorify Him in the sense of cleansing and purifying Allah from everything that is not suitable for Him. This remembrance and chanting is done in the morning when you just wake up from sleep, because at that time it is as if someone has come back to life after death, to face a new life. It was also ordered to glorify in the evening because at that time someone had finished doing all kinds of work throughout the day. Dhikr at that time was a sign of gratitude to Allah for the abundance of His taufik and guidance so that he could carry out his work well, and be able to obtain sustenance for his life needs and maintenance for his family. With lots of remembrance, he can serve himself to Allah and to face the afterlife. Besides that, he can also examine the actions that have been carried out so that he can make the necessary improvements for the days to come."
		   },
		   {
			"id": 3576,
			"surah": 33,
			"ayat": 43,
			"tafsir": "Allah explains that it is He who gives mercy to the believers and tests them before the angels in the sky. The angels also asked forgiveness for them so that Allah would bring them out with His taufik, guidance and mercy from the darkness of disbelief to the light of faith. He is Most Merciful to all Muslims in this world and the hereafter. In this world, Allah guides them to the right path, and in the hereafter, He provides safety for them from great shocks and calamities."
		   },
		   {
			"id": 3577,
			"surah": 33,
			"ayat": 44,
			"tafsir": "When the believers enter the courtyard of heaven, the angels pay homage to them with \"greetings\" as in the word of Allah: While the angels enter their places from all the doors; (while saying), \"Peace be upon you for your patience.\" So what a pleasure the end is. (ar-Ra'd\/13: 23-24) Allah provides a reward for them in the hereafter that comes without being asked first. They enjoy the delights of food, drink, clothing, and abodes in the vast heavens. The pleasures of heaven have never been seen by eyes, heard by ears, or even crossed in the heart."
		   },
		   {
			"id": 3578,
			"surah": 33,
			"ayat": 45,
			"tafsir": "In this verse, Allah explained to the Prophet Muhammad that he was sent to be a witness against the people (umma) who had received his treatise. Allah sent him as a bearer of good news for those who justify his message and practice the instructions he brought that they will be admitted to heaven. He is also a warning to those who deny his treatise, that they will be punished with the torments of hell fire. Regarding the function of the Prophet as a witness (martyr), in another verse Allah says: And what (the condition of the disbelievers later), if We bring a witness (Rasul) from every nation and We bring you (Muhammad) as a witness over them. (an-Nisa'\/4: 41)"
		   },
		   {
			"id": 3579,
			"surah": 33,
			"ayat": 46,
			"tafsir": "The prophet also acts as a preacher of Allah's religion for all mankind so that they acknowledge the oneness and all the attributes of His perfection. It also aims for humans to worship Allah sincerely; give light like a bright lamp that can bring them out of the darkness of disbelief to the light of faith, and illuminate the path that will be taken by those who believe so that they will be happy in this world and the hereafter. All of the Prophet's duties were carried out by Allah's permission and orders."
		   },
		   {
			"id": 3580,
			"surah": 33,
			"ayat": 47,
			"tafsir": "Ibn Jarir ath-tabari and 'Ikrimah have narrated a hadith from al-hasan which explains that when verse al-Fath\/48: 2 was revealed: So that Allah will forgive you (Muhammad) for your past and future sins. (al-Fath\/48: 2) The companions asked, \"O Messenger of Allah! We already know what Allah has done for you, so what will Allah have done for us?\" So this verse came down (al-Ahzab\/33: 47) In this verse, Allah ordered the Prophet Muhammad to convey the good news to the believers that Allah had provided for them a very great gift that exceeded the gifts given to the people others, because they are given the ability to improve the morals of society from various tyranny to justice and benefit. They can also change the face of the people they face from a rebellious attitude to a submissive and obedient attitude for the sake of improving their destiny in this world and in the hereafter."
		   },
		   {
			"id": 3581,
			"surah": 33,
			"ayat": 48,
			"tafsir": "In this verse, Allah explains about what can cause harm. Allah forbids believers from obeying disbelievers and hypocrites. They were also ordered not to pay attention to the disturbances of unbelievers in the ongoing da'wah in the way of Allah, and to face them with patience and trust. It is Allah who must be seen as a protector in carrying out the task of da'wah for the splendor of Islamic teachings."
		   },
		   {
			"id": 3582,
			"surah": 33,
			"ayat": 49,
			"tafsir": "In this verse, Allah explains that if there is a divorce between a believer and his wife who has never been interfered with, then the divorced woman does not have a waiting period and the woman can immediately remarry to another man. The ex-husband who divorces must give mut'ah, which is a gift to comfort and please the divorced wife. The size of the mut'ah depends on the ability of the husband in accordance with the word of Allah: There is no sin on you if you divorce your wives whom you have not touched (interfered with) or have not determined the dowries for them. And you should give them mut'ah, for those who are able according to their ability and for those who are unable according to their ability, namely giving in an appropriate way, which is an obligation for those who do good. (al-Baqarah\/2: 236) It is noteworthy that if a woman has to leave the house then the method of removing her should be in a polite manner so as not to cause her pain. Adequate provision must be given to him, so that the gift is truly entertainment that relieves the suffering of his heart due to the divorce he has experienced. It was narrated from Sahal bin Sa'ad and Abu Usaid: The Prophet had married Umaimah bint Syarahil. When Umaimah entered (the Prophet's) house, the Prophet reached out to her, but she seemed to dislike (the Prophet's way of greeting). So the Prophet ordered Abu Usaid to give two pieces of good clothes that were famous at that time (as divorce gifts). (Al-Bukhari)"
		   },
		   {
			"id": 3583,
			"surah": 33,
			"ayat": 50,
			"tafsir": "In this verse, Allah has clearly made it lawful for the Prophet Muhammad to interfere with the women he marries and give them a dowry. It is also lawful for him to be a slave (jariyah) obtained in battle, such as shafiyah bint Huyai bin Akhtab obtained during the Khaibar War. By the Prophet saw, Shafiyah freed, and the independence was used as a dowry. Likewise with Juwairiyah bint al-harits. from Banu Mushthaliq. who was freed and married by the Prophet. The slaves (jariyah) who were awarded to the Prophet were Raihanah bint Syam'un and Mariyah al-Qibthiyah who gave birth to the Prophet's son named Ibrahim. Allah also permitted the Prophet to marry the daughters of his father's brothers and the daughters of his father's sisters, the daughters of his mother's brothers, the daughters of his mother's sisters who migrated with him. Rasulullah and a believing woman who surrendered herself to the Prophet if the Prophet wanted to marry her. These concessions were only specific to the Prophet, and not to all believers, with the understanding that if a woman gives herself up to be married to a Muslim, even if voluntarily, her bridegroom is still obliged to be paid. On the other hand, if the woman gave herself to be married by the Prophet, then she could be married without a dowry. If the dowry is not stated in the form (value) when entering into the marriage contract, then the form can be determined with a dowry. mitsl, namely the dowry whose value is the same as the dowry value that is usually given by his family. The stipulation to pay the dowry for mitsl is after there is a mixture between the two or after the husband dies but has not had time to mix. If there is a divorce between husband and wife before mixing, half of the dowry is obligatory to be paid, which has been determined and can be exempted from paying the dowry if the wife agrees. Allah knows what the believers have made obligatory upon their wives and their slaves, such as the terms of the marriage contract and others, and may not marry a woman by way of gift or without witnesses. Regarding slaves who are purchased or not purchased, it must be lawful slaves who are interfered with by the owner, such as slaves of people of the book, not slaves who are polytheists or religious Zoroastrians. Allah is Most Forgiving, Most Merciful to His believing servants, if they repent of the sins they committed before they were guided."
		   },
		   {
			"id": 3584,
			"surah": 33,
			"ayat": 51,
			"tafsir": "In this verse, Allah gave freedom to the Prophet Muhammad to suspend which of his wives he wanted and was allowed to have intercourse with which of them he wanted. He was also given the freedom to remarry his divorced wives considering it was good for himself and society. It was narrated by Ibn Jarir ath-tabari from Abu Razin that when a verse was revealed which ordered the wives of the Prophet. peace be upon him to choose between remaining the wife of the Prophet. with simple circumstances without luxuries or separation from the Prophet because he pursued the pleasures of life that were more in accordance with the desires of his lust, then a sense of worry arose in the Prophet's wives. saw it. They simultaneously stated their willingness to live with the Prophet under any circumstances because they prioritized the aspect of religious life rather than worldly pleasures. Then the Prophet suspended intercourse with several of his wives at their request, such as Umm Habibah, Maimunah, Saudah, Shafiyah and Juwairiyah. Against these five wives, the Prophet saw did not arrange regular overnight shifts. As for his four other wives, namely 'Aisyah, Hafshah, Zainab and Umm Salamah, he arranged turns to spend the night, and evened out the distribution of clothes and food. The Prophet's freedom to arrange his turn, food, clothing, and other things according to the just nature of the Prophet in carrying out God's instructions, so as not to cause jealousy in the hearts of his wives. They accepted the Prophet's treatment willingly. It was narrated from 'Abdullah bin Yazid that 'Aisha once said, \"It was the Prophet's custom to divide the turns among his wives fairly, then the Prophet prayed, \"O Allah, this is my division of what I control (i.e. the matter of dividing material objects), so don't you scold me about what You are good at and I can't control (a matter of love).\" (Ahmad's history) and His Messenger. Allah is All-Knowing of all the secrets stored in the heart, more Forgiving, always gives an opportunity to repent for those who have realized their error and want to return to the straight path."
		   },
		   {
			"id": 3585,
			"surah": 33,
			"ayat": 52,
			"tafsir": "Allah did not allow the Prophet to marry other women after this verse was revealed. Allah also forbade replacing them with other wives, even though their beauty attracted the attention of the Prophet, except for slave women who were obtained from war or who were presented to him. Abu Dawud and al-Baihaqi narrated from Anas bin Malik that he said, \"After Allah ordered the wives of the Prophet to be chosen, then they chose to remain under the auspices of the Prophet's household, then Allah Taala also restricted the Prophet from adding wives. his wife of nine and never remarried.\" And Allah is the Overseer of all things. Allah allowed the Prophet Muhammad to have more than four wives with very high wisdom because marriage was determined by Allah, the All-Knowing and All-Wise. Among the lessons are: 1. Convey special laws for women that are not known except by husband and wife. If there are many wives, then many laws regarding women can be obtained. Whether or not history is received from them is greatly influenced by the number of narrations. 2. The need for strong supporters for da'wah at the beginning of Islam. Traditionally, the relationship between brother-in-law and marriage must support and help each other. 3. Every Muslim definitely wants to establish a family relationship with the Prophet, so that he is free to enter the Prophet's house. In fact, every Muslim wants to be able to serve the Prophet. 4. The Prophet rewarded the services of those who defended him in the struggle for Islam. The most valuable reward was ordering and marrying his family, such as the Prophet's marriage to 'Aisha bint Abu Bakr and Hafshah bint 'Umar. 5. Removing ignorance traditions with more beneficial laws, such as his marriage to Zainab. Actually the Prophet did not want it because he was afraid of people's reproach, but this was useful for maintaining lineage and relatives. 6. The Prophet was able to do justice and provide guidance to his family, which no one else has."
		   },
		   {
			"id": 3586,
			"surah": 33,
			"ayat": 53,
			"tafsir": "In this verse, Allah teaches courtesy or ethics towards the Prophet's household. Allah forbade those who believe to enter the Prophet's house except with his permission, to eat in his house without waiting for the cooking time. During the Prophet's time there were people waiting for his meal. Then came down this verse which prohibits this action. When the Prophet invited some of his friends to his house to attend the walimah, they were prohibited from entering the Prophet's house, unless they already knew that the food was ready to be served. If the dish was not ready and they were still busy preparing the dish, then the arrival of the guest would disturb the peace of the Prophet's family. This also bothered the Prophet's wife. saw who was working because some of his limbs would be visible which the guests were not allowed to see. They are welcome to enter if they have been invited. When you have finished eating, please leave immediately without prolonging the conversation, because that really annoyed the Prophet, and he himself felt embarrassed to send his guests out. However, Allah does not hesitate to explain the truth. Allah teaches politeness in the household so that all guests who visit other people's homes pay attention. Whenever there is an interest in asking or borrowing an item from the house of the Prophet's wives. peace be upon him, then the request should be made from behind the veil and not face to face. Such a thing purifies the hearts of both parties and does not offend the Prophet's heart. Including the actions that hurt the Prophet's heart was marrying his wives after he died. Prohibition to marry the former wives of the Prophet. peace be upon him is a ban that applies forever because this act is a very big sin in the sight of Allah. The Prophet is more important to the believers than themselves and his wives are their mothers. (al-Ahzab\/33: 6). Imam al-Bukhari narrated from Anas that Umar bin Khattab. once said, \"I have three opinions that are in accordance with the revelations revealed by Allah. First, I said to the Messenger of Allah, 'O Messenger of Allah, it would be nice if you made maqam Ibrahim a place of prayer, then Allah sent down the verse: And make maqam Ibrahim a place of prayer. (al-Baqarah\/2: 125) Second, I said, 'O Messenger of Allah, in fact your wives are often visited by guests of good people and bad people, if you had made a veil for them it would have been better, then Allah sent down this verse of hijab. I once said to the wives of the Prophet, when they had a dispute because of jealousy towards the Prophet, this verse was revealed: If he (the Prophet) divorces you, maybe God will replace him with wives who are better than you. (at -Tahrim\/66:5)"
		   },
		   {
			"id": 3587,
			"surah": 33,
			"ayat": 54,
			"tafsir": "Because of the revelation of this verse, as narrated by Juwaibir from Ibn 'Abbas, that there was someone who had come to some of the wives of the Prophet. peace be upon him, who was the son of his uncle, then conversed with the Prophet's wife. directly. The Prophet saw rebuked it by saying, \"Don't do this on another occasion.\" The man replied, \"O Messenger of Allah, this is my uncle's child, and I have never said something that is wrong, and that woman is also not allowed to say something that is not good to me.\" The Prophet said, \"We have known that. There is no one more jealous than Allah, and no one is more jealous than I am.\" Then the man left saying, \"Who can prevent me from talking to my uncle's daughter; I will definitely marry her after Muhammad's death.\" So this verse of hijab came down, and the man felt sorry for the words he had issued. To cover up his mistakes and atone for his sins, he issued a kifarat by freeing a slave, providing supplies for jihad with ten camels, and going on pilgrimage on foot."
		   },
		   {
			"id": 3588,
			"surah": 33,
			"ayat": 55,
			"tafsir": "There is no sin on the wives of the Prophet. to meet without veil with their fathers, both biological fathers and suckling fathers, their children, both offspring and sucklings, their brothers and sisters, both sons and daughters, women- Muslim women near and far, or their slaves, both men and women. The existence of the hijab among them will cause many difficulties because they are always devoted to household matters. However, what needs to be remembered is to always fear Allah to follow His commands and stay away from His prohibitions, because Allah always witnesses everything they do. The people mentioned in this verse, namely the fathers of the Prophet's wives, their children, their brothers, their nephews or children, whether brothers or sisters, or other women and also their slaves are mahrams, i.e. people who are not allowed to marry them. As for people other than those mentioned above, namely those who are not mahrams, they cannot meet the Prophet's wives. without hijabs. This is to maintain the honor of the Prophet's wives. which is the ummahatul mu'minin."
		   },
		   {
			"id": 3589,
			"surah": 33,
			"ayat": 56,
			"tafsir": "Truly Allah has mercy on the Prophet Muhammad, and the angels ask forgiveness for him. Therefore, Allah advises all Muslims to also pray for the Prophet and greet him with full respect. It was narrated from Abu Sa'id al-Khudri that he asked, \"O Messenger of Allah, as for greetings to you we already know, how should we read salawat?\" The Prophet replied, say: Allahumma shalli 'ala Muhammad wa 'ala ali Muhammad kama shallaita 'ala Ibrahim wa 'ala ali Ibrahim innaka hamid majid. Allahumma barik 'ala Muhammad wa 'ala ali Muhammad kama barakta 'ala Ibrahim wa 'ala ali Ibrahim innaka hamid majid. (History of al-Bukhari, Ahmad, an-Nasa'i, Ibn Majah, and others) Also narrated by 'Abdullah bin Abu Talhah from his father: That the Messenger of Allah came one day and visible signs of joy on his face. Then we asked, \"We have seen signs of joy on your face.\" The Prophet replied, \"Indeed, Gabriel has come to me and said, 'O Muhammad, verily your Lord has greeted you and said,' Aren't you satisfied that no one from your Ummah recites salawat for you but I repay him tenfold. And no one greets you from your people but I greet you tenfold.\""
		   },
		   {
			"id": 3590,
			"surah": 33,
			"ayat": 57,
			"tafsir": "In this verse it is explained that Allah curses those who hurt Him by doing things that are not pleasing to Him, such as disobeying His commandments, namely the sayings of Christians that Jesus is the son of Allah, or like the polytheists who say that angels are daughters of Allah, or associate partners with Him. Allah also cursed those who hurt His Messenger, such as accusing him of being a poet, a sorcerer, or a madman and so on. Allah's curse includes the curse in this world and the hereafter. In this world they are kept away from Allah's mercy and His bounty, so they wallow in error and disobedience. In the afterlife they will be plunged into the fires of hell which is the worst place to return to, and Allah will provide for them a very painful and humiliating punishment."
		   },
		   {
			"id": 3591,
			"surah": 33,
			"ayat": 58,
			"tafsir": "Those who offend believers, both men and women, without any fault that they have committed, and only based on slander and fabricated accusations, then they have indeed committed a real sin. According to Ibn 'Abbas, this verse was revealed in connection with 'Abdullah bin Ubay's accusation against 'Aisha who he said had committed obscenity on the way home with the Prophet Muhammad after fighting the Bani Mushthaliq, who were famous for the hadith al-ifk. In the hadith of the Prophet it is explained: Abu Hurairah narrated that the Messenger of Allah was once asked what it means to gossip. He replied, \"You mention your brother with something he hates.\" The Prophet was asked again, \"What if what is said is true or a fact?\" The Prophet replied, \"If what is said is true, you have sworn at him, and if it is not true then you have fabricated lies against him.\" (History of Abu Dawud)"
		   },
		   {
			"id": 3592,
			"surah": 33,
			"ayat": 59,
			"tafsir": "Allah ordered all Muslims, especially the wives of the Prophet. herself and her daughters to stretch the headscarves over their bodies. It was intended that they would be easily recognized by their clothes because they were different from jariyah (slave women), so that they would not be harassed by people who abused the opportunity. A woman who dresses modestly will more easily avoid harassment by ignorant people. Meanwhile, women who open their genitals in public are easily accused or judged as women who do not have a good personality. For those who, in their past, were not careful about covering their genitals and then made repairs, then Allah is Forgiving, Most Merciful. Because these hurtful acts are often committed by hypocrites, in the following verse Allah threatens them with very strong threats."
		   },
		   {
			"id": 3593,
			"surah": 33,
			"ayat": 60,
			"tafsir": "If the hypocrites and people who have disease in their hearts, and those who spread false news in Medina do not stop denying Allah, hurting His Messenger, and the believers, surely Allah will order His Prophet to fight them so that they will not be harmed. able again to live longer in Medina next door to the Prophet. Those who were threatened to be fought and destroyed by the Prophet were three classes of people: 1. Hypocrites who always opposed God in secret. 2. People are diseased in their hearts, like envy and revenge which always hurt believers like disturbing women. 3. Those who spread false news in Medina so as to hurt the Prophet, with their saying that the Prophet Muhammad would be defeated and expelled from Medina and so on."
		   },
		   {
			"id": 3594,
			"surah": 33,
			"ayat": 61,
			"tafsir": "The three groups were cursed wherever they were, because of their attitude which was always hostile and detrimental to religion and the state, they were always being chased to be arrested and killed. The fate of people like that has also been experienced by people before because that is the sunna of Allah."
		   },
		   {
			"id": 3595,
			"surah": 33,
			"ayat": 62,
			"tafsir": "Thus, the sunnah of Allah that has been applied to the previous people before the sending of the Prophet Muhammad will also apply to generations that come later. It is impossible to change and must apply."
		   },
		   {
			"id": 3596,
			"surah": 33,
			"ayat": 63,
			"tafsir": "Many people ask the Prophet Muhammad about when the Day of Judgment will come. The polytheists asked about the Doomsday in mockery and ridicule, and challenged that the Doomsday would come soon. The hypocrites ask about the Day of Judgment because they are motivated by the assumption that the Holy Prophet will answer as they predict. As for the Jews asking with the intention of testing the truth of the Prophet, whether or not the answer will be the same as stated in the Torah, that the question of the Day of Judgment is actually in the hands of Allah."
		   },
		   {
			"id": 3597,
			"surah": 33,
			"ayat": 64,
			"tafsir": "Then Allah explained that only Allah knows when the Day of Judgment will occur. It is possible that the time for the Day of Judgment is near, because every thing that will come is always approaching and may be close. The Arabic proverb says: \"Everything that is coming is near.\" Then Allah will curse and turn away the disbelievers from His goodness and mercy. Allah also provides for them Sa'ir hell."
		   },
		   {
			"id": 3598,
			"surah": 33,
			"ayat": 65,
			"tafsir": "They will remain in hell forever, and find no one who can protect them from Allah's punishment. They also do not find a helper who can save them from His torment."
		   },
		   {
			"id": 3599,
			"surah": 33,
			"ayat": 66,
			"tafsir": "They don't get anyone's protector and helper when they go back and forth in hell. With regret they said, \"How happy we would have been in the world to obey Allah and also obey Muhammad, His messenger.\""
		   },
		   {
			"id": 3600,
			"surah": 33,
			"ayat": 67,
			"tafsir": "They said with feeling irritated because they were deceived by their leaders and magnifiers in the world, \"O our Lord, indeed we in the world have followed our leaders and magnifiers, then they led us astray from the right path.\""
		   },
		   {
			"id": 3601,
			"surah": 33,
			"ayat": 68,
			"tafsir": "They with a feeling of revenge against those who have led astray said, \"O our Lord, give them a double punishment, first because they have strayed, and both have also led other people astray, and curse them with a very great curse. \" Their complaint is strengthened by another verse as in the word of Allah: And (remember) on the day (when) the wrongdoers bit their two fingers, (remorted for their actions) saying, \"O! I wish (in the past) I had taken the path with the Messenger. O , woe to me! If (in the past) I did not make such and such a close friend (of mine), indeed, he had misled me from the warning (Al-Qur'an) when (Al-Qur'an) had come to me. And satan indeed a human traitor.\" (al-Furqan\/25: 27-29)"
		   },
		   {
			"id": 3602,
			"surah": 33,
			"ayat": 69,
			"tafsir": "Allah forbids the believers not to act like a group of the Children of Israel who hurt the Prophet Musa. Allah cleared him of the accusations that they leveled against him. He is a person who has a very honorable position in the sight of Allah. In this verse it is not mentioned how they hurt the Prophet Musa. In a history about the death of Harun, as narrated by Ibn Jarir ath-Tabari from Ibn 'Abbas from 'Ali bin Abi Talib that he said, \"When the Prophet Musa and Aaron went up the mountain, Prophet Aaron then died. The people of the Children of Israel were angry to Prophet Musa, 'You have killed Aaron, even though he is someone we like more than you. In a hadith, the Messenger of Allah said: It was narrated from Ibn Mas'ud that the Messenger of Allah saw one day distributing wealth to his friends, then a man from the Ansar said that the distribution was not meant to gain the pleasure of Allah. Hearing these words, the Prophet was offended until his face was red and said, \"May Allah have mercy on Musa, who has been hurt by people more than this, but he remains patient.\" (History of al-Bukhari and Muslim)"
		   },
		   {
			"id": 3603,
			"surah": 33,
			"ayat": 70,
			"tafsir": "In this verse, Allah commands believers to remain fearful of Him. Allah also orders believers to always speak the truth, in harmony between what is intended and what is said, because all the words spoken are recorded by the angels Raqib and 'Atid, and must be accounted for before Allah. God's Word:"
		   },
		   {
			"id": 3604,
			"surah": 33,
			"ayat": 71,
			"tafsir": "If they continue to maintain faith and piety and always tell the truth, surely Allah will correct their actions and forgive their sins. Whoever wants happiness in this world and the hereafter, then there is only one path to take, namely obeying Allah and His Messenger. Thus, they will get great happiness in this world and the hereafter."
		   },
		   {
			"id": 3605,
			"surah": 33,
			"ayat": 72,
			"tafsir": "Truly Allah has offered religious duties to the heavens, the earth and the mountains. Because the three of them were not prepared to accept this heavy commission, all of them were reluctant to carry out the mandate that God offered. Then the mandate to carry out religious duties is offered to humans and they accept it with the consequence that whoever carries it out will be rewarded and entered into heaven. On the other hand, whoever betrays him will be tortured and put into the fires of hell. Even though their body shape is smaller than the other three creatures (sky, earth and mountains), humans dare to accept this mandate because humans have potential. However, because in man there is ambition and lust which often deceives the eyes and closes the sight of his heart, Allah treats him very unjustly and stupidly because he does not think enough about the consequences of accepting this mandate."
		   },
		   {
			"id": 3606,
			"surah": 33,
			"ayat": 73,
			"tafsir": "Allah then explained that the result of accepting this mandate was that He would punish the hypocrites and polytheists, both men and women, if they neglected the implementation of the mandate they had carried. Allah will accept the repentance of believing men and women who obey this mandate. Indeed Allah is Forgiving, Most Merciful."
		   }
	]
}
