{
	"tafseer": [
		{
			"id": 4326,
			"surah": 43,
			"ayat": 1,
			"tafsir": "The beginning of this verse consists of hijaiyah letters, as it appears at the beginning of several other surahs. Scholars of commentary differ on the meaning of the letters. Furthermore, please examine this issue in \"The Qur'an and its tafsir\" volume I, namely the tafsir of the first verse of surahh al-Baqarah.\""
		   },
		   {
			"id": 4327,
			"surah": 43,
			"ayat": 2,
			"tafsir": "Allah swore, by the Holy Qur'an which explains guidance and guidance, and explains the things that are needed by humans in this world and in the hereafter to achieve happiness. Whoever follows the instructions outlined in the Qur'an, he will be lucky and safe, and whoever deviates from it, he will lose and go astray from the right path."
		   },
		   {
			"id": 4328,
			"surah": 43,
			"ayat": 3,
			"tafsir": "Allah explained that He had made the Qur'an in Arabic and not in 'Ajam (foreign languages) because the first to be warned were the Arabs so that they could easily understand the lessons and advice contained therein. , and they can easily think of its meaning and meaning. He did not send down the Qur'an in the language of 'Ajam so that there would be no reason for them to say how they can understand the contents of the Qur'an because the language is not Arabic, our language, as Allah says: And if the Qur'an We made it a reading in a language other than Arabic, they would say, \"Why don't the verses explain?\" Is it proper (the Qur'an) to be in a language other than Arabic while (the apostle) is an Arab? Say, \"The Qur'an is a guide and a cure for those who believe. (Fussilat\/41: 44)"
		   },
		   {
			"id": 4329,
			"surah": 43,
			"ayat": 4,
			"tafsir": "Allah explains the position of the Qur'an in Lauh Mahfudz that it already exists in His original knowledge, very high in value because it contains secrets and wisdom that explain human happiness, and instructions that lead them to the right path. Correct. This is in accordance with the word of Allah: And (this) is actually a very noble Qur'an, in the preserved Book (Lauh Mahfudz), no one touches it except the servants who are purified. Sent down from the Lord of all the worlds. (al-Waqi'ah\/56: 77-80)"
		   },
		   {
			"id": 4330,
			"surah": 43,
			"ayat": 5,
			"tafsir": "Allah denounced the polytheists of Mecca by saying: Are We going to stop reminding you with the Qur'an because you are so deep in your disbelief, always abandoning Our commands and doing Our prohibitions? No! We will never do that, because of Our mercy and compassion for you, even though you should be destroyed, or allowed to go astray to death, because your actions have gone too far and exceeded the limit. Qatadah said, \"If the Qur'an had been raised or abolished when it was rejected by the first people from the previous ummah, then surely they would have perished, but Allah has always given His grace and mercy to them and Muhammad SAW has always called on them during twenty more years according to Allah's permission and will.\""
		   },
		   {
			"id": 4331,
			"surah": 43,
			"ayat": 6,
			"tafsir": "In this verse Allah consoles His Prophet Muhammad who is grieving, because he was lied to by his people, and Allah commands him to be patient. Not a few apostles who have been sent by God long ago were denied and ridiculed by their people as he was denied and ridiculed too. Such is the Sunnatullah which is a provision from Allah that cannot be changed anymore, as the word of Allah says: As the sunnah of Allah which (applies also) to those who have gone before (you), and you will not find changes in the sunnah of Allah. (al-Ahzab\/33: 62)"
		   },
		   {
			"id": 4332,
			"surah": 43,
			"ayat": 7,
			"tafsir": "In this verse Allah consoles His Prophet Muhammad who is grieving, because he was lied to by his people, and Allah commands him to be patient. Not a few apostles who have been sent by God long ago were denied and ridiculed by their people as he was denied and ridiculed too. Such is the Sunnatullah which is a provision from Allah that cannot be changed anymore, as the word of Allah says: As the sunnah of Allah which (applies also) to those who have gone before (you), and you will not find changes in the sunnah of Allah. (al-Ahzab\/33: 62)"
		   },
		   {
			"id": 4333,
			"surah": 43,
			"ayat": 8,
			"tafsir": "Allah explains that He destroys those who deny the messengers and they cannot dodge and avoid when the disaster comes, even though they are much stronger and mightier than the people of the Prophet Muhammad. That should be the concern of the people of Muhammad. Allah's Word: Then do they not travel on earth, then they see how the end of those who were before them. They are more numerous and more powerful and (more) the remains of their civilization on earth. (Gafir\/40: 82) This verse closes with a warning to the people of Muhammad that God's provision that applies to people who belie the apostle, may it be a lesson for them because it is not impossible that they will also be afflicted with disasters like the earlier people. Allah's Word: So We made them a former (people) and a lesson for those who are later. (az-Zukhruf\/43: 56) Allah also said: That (provision) of Allah that has been applied to His servants. (Gafir\/40: 85)"
		   },
		   {
			"id": 4334,
			"surah": 43,
			"ayat": 9,
			"tafsir": "This verse was addressed by Allah to His Messenger that when he asked the polytheists of his people, who made the universe like the heavens, the earth and others, they emphatically answered, that everything was created by Allah, God Almighty, All-Knowing. everything, nothing is hidden from Him. God's Word: For God there is nothing hidden in the earth and in the sky. (Ali 'Imran\/3: 5)"
		   },
		   {
			"id": 4335,
			"surah": 43,
			"ayat": 10,
			"tafsir": "Allah explains that it is He who made the earth a stretch and prepared it for His creatures to be a place for them to settle down, step on and swing their feet, equipped with roads so that they can visit from one place to another, both near and far. for the benefit of life and livelihood, economic and trade interests, and others. In line with this verse the word of God: Have We not made the earth as a stretch. (an-Naba'\/78: 6) Allah's Word: And We made (also) broad roads there, so that they may receive guidance. (al-Anbiya'\/21: 31)"
		   },
		   {
			"id": 4336,
			"surah": 43,
			"ayat": 11,
			"tafsir": "Allah sends down rain from the sky according to the need to support plants and vegetation. He sends rain not more than what is needed so that it does not overflow beyond the limit and eventually becomes a disaster, like a flood that destroys and destroys, and not too little so that it does not meet the needs for the fertility of plants and vegetation that causes dryness and withered, and resulted in a famine that befell God's creatures everywhere. With rain falling from the sky according to the amount needed, the dead country will live and prosper, which will no longer grow plants and trees. As Allah has the power to revive a dead land, so He has the power to revive and bring the dead out of the graves alive, as Allah says: And He sends down water (rain) from the sky, then with that water revives the earth after death ( dry). (ar-Rum\/30: 24) And His words: So We directed the cloud to a dead (barren) land then with that rain We revived the earth after it was dead (dry). That's what awakening is like. (Fathir\/35: 9) What is stated in this verse is proven by the science that humans have discovered today. It is estimated that in one second, as many as 16 million tons of water evaporate from the earth. Using this figure, it is calculated that there will be 513 trillion tons of water evaporating from the earth in a year. This figure turns out to be the same as the calculation of the amount of rainwater that falls in a year. Thus, water carries out a constantly balanced circulation. Life on earth is very dependent on the continuation of this water cycle. Although many technologies try to interfere with this natural cycle, such as making artificial rain, in reality the water cycle cannot be created artificially. The proportion of rainwater is important not only in terms of the amount, but also the speed with which the raindrops fall [according to the required size]. The speed of raindrops does not exceed the standard speed, no matter what size the raindrops are. Generally, raindrops have a diameter of 4.5 mm. Its speed is about 8 meters per second. At a smaller size, of course, the speed is lower. On a grain size larger than 4.5 mm, it does not mean that the speed is higher. The speed is constant, which is about 8 meters per second. This is because the liquid form of the droplets will interact with the air and wind so that the shape of the water droplets changes in such a way that the falling speed decreases and does not exceed the standard speed. It has been said in surahh Fussilat\/41: 39 to revive a dead land with water (rain) from the sky, that by raining down on a barren area, the area will (can, by Allah's will) grow trees. In this verse it is emphasized that water from the sky is sent down according to certain levels. The resurrection of humans after the grave is often likened to reviving barren land with rainwater. We can compare this parable to the growth of wild grains or spores that are carried by the wind and scattered on dry ground. If the dry soil gets enough rain showers [according to the size needed], the seeds will grow into sprouts and then become plants. If there is a lot of rainfall, the seeds or spores that become the seeds of plants will be washed away by the flow of water. If the flow of water does not wash it away, but if the moisture content in the soil is too excessive, the seeds will not grow into sprouts, instead they will rot. Everything according to size."
		   },
		   {
			"id": 4337,
			"surah": 43,
			"ayat": 12,
			"tafsir": "Among the attributes of Allah referred to in this verse is that He is the One who created all creatures in pairs, male and female, male and female, both from types of plants, trees, fruits, flowers and so on. -other as well as from animal and human species. He also makes vehicles in the form of boats, ships that can be used to transport people and merchandise needs at sea, and livestock, such as camels, horses, himars, cows and others that can be used as means of transportation on land, and so on. others that can connect one place to another, both on land and at sea with various means of transportation. In accordance with the word of Allah: And (He has created) horses, mules, and donkeys, for you to ride and (to be) ornaments. Allah creates what you do not know. (an-Nahl\/16: 8) An explanation about Allah creating everything in pairs can be seen in the explanation in surahh ash-Shura\/42: 11. Several other verses that talk about the same thing are Yasin\/36: 36, ar-Ra' d\/13: 3, and adh-dzariyat\/51: 49."
		   },
		   {
			"id": 4338,
			"surah": 43,
			"ayat": 13,
			"tafsir": "In this verse, Allah explains that when humans are on the backs of animals, boats, ships, trains, airplanes, etc., they should remember the blessings that Allah has bestowed on them, they should glorify Allah and purify Him of undesirable qualities. worthy of what the polytheists accuse Him of, and let them read this verse as a prayer: Glory be to (Allah) who has subjected all this to us when we were not able to master it, and verily we will return to our Lord. (az-Zukhruf\/43: 13-14) If Allah had not subdued the universe with the knowledge He bestowed, surely humans would not have been able to do it, because that would be beyond their ability. The prayer reading reminds people to always be prepared for the day of vengeance when all humans will face and experience it and do not neglect to remember Allah, whether traveling or not, while sailing or living in your hometown. In connection with the above tafsir, it was narrated by Imam Muslim, Abu Dawud, and an-Nasa'i that the Messenger of Allah, when traveling and driving said three times and recited the prayer mentioned above. When the Prophet saw was driving his vehicle to make a journey, then he said takbir three times. Then he read, \"Glory to God (Allah) who has subjected all of this to us when we were not able to control it before, and verily we will return to our Lord.\" (History of Muslim, Abu Dawud, and an-Nasa'i) The verse above teaches people to be grateful for God's blessings that have been given in the form of animals and treat them well. Equality among creatures, especially between animals and humans, is emphasized by God. One of the verses below explains that animals are also God's people, just like humans. Even though they have different characteristics, specialties and systems, in essence, they are the same as human beings in the eyes of God. And humans are obliged to remember it. And there is not a single animal that is on the earth and birds that fly on its two wings, but all are nations (too) like you. There is nothing that We have omitted in the Book, then to God they are gathered.\" (al-An'am\/6: 38) Several verses of the Qur'an allude to animals, including how humans should behave towards animals, the use of animals for humans, the behavior of animals that humans must imitate, and many others.In this relationship of equality between creatures, there is a writing by a wise man, Muhammad Fazlur Rahman Ansari, which reads, \"Everything on this earth was created for us, so it is already it is our natural duty to: guard against decay; utilize it while maintaining its dignity as God's creation; preserving it as much as possible, thus, being grateful for God's blessings in the form of concrete actions.\" Regarding animals or pets, the Qur'an in surahh an-Nahl\/16: 5 mentions some of the benefits of animals for humans: And livestock have been created - It is for you, there is (fur) that warms and various benefits, and some of it you eat.(an-Nahl\/16: 5) In connection with the verse from surahh an-Nahl above, we must pay attention that, for example, the skin and livestock fur may be used. But the Prophet Muhammad saw continued with one very wise thing. He forbade the use of wild animal skins even just for floor mats. If the rules or advice put forward by the Prophet were obeyed by everyone, then the killing of some types of wild animals for the sake of profit alone certainly do not happen. Similarly, even though Muslims are allowed to consume the meat of certain animals, but keep in mind that this does not justify the cruel and uncontrolled slaughter of them. One of the benefits of animals is as a mount. We must remember that the Arabs in the past relied entirely on camels to help carry goods on their journeys. God states this in the verse below: And he carries your burdens to a land that you cannot reach, except with great difficulty. Verily, your Lord is Most Gracious, Most Merciful. And (He has created) horses, mules and donkeys for you to ride and (to be) ornaments. Allah creates what you do not know. (an-Nahl\/16: 7-8) In essence, Islam teaches its people to love animals and preserve their lives. In the Qur'an, Allah emphasizes that He has bestowed upon mankind a dominion which encompasses everything in this world. And He has subjected what is in the heavens and what is on earth to you all (as mercy) from Him. (al-Jatsiyah\/45: 13). In this verse, the Qur'an does not indicate at all that man has absolute power to do as he pleases everything in the heavens and the earth. Nor do they have unlimited rights to use nature so as to damage their ecological balance. \"....all of that is from Him....\" The verse fragment here should be realized and understood as a reminder from God, that humans do not own anything in this world. So how should we treat other people's things must always be kept in mind \"...people who think....\" Islam basically does not support humans to abuse animals for sporting purposes or to make animals as objects of random experiments. This verse reminds mankind that the Creator has made everything in nature (including animals) a trust that they must protect."
		   },
		   {
			"id": 4339,
			"surah": 43,
			"ayat": 14,
			"tafsir": "In this verse, Allah explains that when humans are on the backs of animals, boats, ships, trains, airplanes, etc., they should remember the blessings that Allah has bestowed on them, they should glorify Allah and purify Him of undesirable qualities. worthy of what the polytheists accuse Him of, and let them read this verse as a prayer: Glory be to (Allah) who has subjected all this to us when we were not able to master it, and verily we will return to our Lord. (az-Zukhruf\/43: 13-14) If Allah had not subdued the universe with the knowledge He bestowed, surely humans would not have been able to do it, because that would be beyond their ability. The prayer reading reminds people to always be prepared for the day of vengeance when all humans will face and experience it and do not neglect to remember Allah, whether traveling or not, while sailing or living in your hometown. In connection with the above tafsir, it was narrated by Imam Muslim, Abu Dawud, and an-Nasa'i that the Messenger of Allah, when traveling and driving said three times and recited the prayer mentioned above. When the Prophet saw was driving his vehicle to make a journey, then he said takbir three times. Then he read, \"Glory to God (Allah) who has subjected all of this to us when we were not able to control it before, and verily we will return to our Lord.\" (History of Muslim, Abu Dawud, and an-Nasa'i) The verse above teaches people to be grateful for God's blessings that have been given in the form of animals and treat them well. Equality among creatures, especially between animals and humans, is emphasized by God. One of the verses below explains that animals are also God's people, just like humans. Even though they have different characteristics, specialties and systems, in essence, they are the same as human beings in the eyes of God. And humans are obliged to remember it. And there is not a single animal that is on the earth and birds that fly on its two wings, but all are nations (too) like you. There is nothing that We have omitted in the Book, then to God they are gathered.\" (al-An'am\/6: 38) Several verses of the Qur'an allude to animals, including how humans should behave towards animals, the use of animals for humans, the behavior of animals that humans must imitate, and many others.In this relationship of equality between creatures, there is a writing by a wise man, Muhammad Fazlur Rahman Ansari, which reads, \"Everything on this earth was created for us, so it is already it is our natural duty to: guard against decay; utilize it while maintaining its dignity as God's creation; preserving it as much as possible, thus, being grateful for God's blessings in the form of concrete actions.\" Regarding animals or pets, the Qur'an in surahh an-Nahl\/16: 5 mentions some of the benefits of animals for humans: And livestock have been created - It is for you, there is (fur) that warms and various benefits, and some of it you eat.(an-Nahl\/16: 5) In connection with the verse from surahh an-Nahl above, we must pay attention that, for example, the skin and livestock fur may be used. But the Prophet Muhammad saw continued with one very wise thing. He forbade the use of wild animal skins even just for floor mats. If the rules or advice put forward by the Prophet were obeyed by everyone, then the killing of some types of wild animals for the sake of profit alone certainly do not happen. Similarly, even though Muslims are allowed to consume the meat of certain animals, but keep in mind that this does not justify the cruel and uncontrolled slaughter of them. One of the benefits of animals is as a mount. We must remember that the Arabs in the past relied entirely on camels to help carry goods on their journeys. God states this in the verse below: And he carries your burdens to a land that you cannot reach, except with great difficulty. Verily, your Lord is Most Gracious, Most Merciful. And (He has created) horses, mules and donkeys for you to ride and (to be) ornaments. Allah creates what you do not know. (an-Nahl\/16: 7-8) In essence, Islam teaches its people to love animals and preserve their lives. In the Qur'an, Allah emphasizes that He has bestowed upon mankind a dominion which encompasses everything in this world. And He has subjected what is in the heavens and what is on earth to you all (as mercy) from Him. (al-Jatsiyah\/45: 13). In this verse, the Qur'an does not indicate at all that man has absolute power to do as he pleases everything in the heavens and the earth. Nor do they have unlimited rights to use nature so as to damage their ecological balance. \"....all of that is from Him....\" The verse fragment here should be realized and understood as a reminder from God, that humans do not own anything in this world. So how should we treat other people's things must always be kept in mind \"...people who think....\" Islam basically does not support humans to abuse animals for sporting purposes or to make animals as objects of random experiments. This verse reminds mankind that the Creator has made everything in nature (including animals) a trust that they must protect."
		   },
		   {
			"id": 4340,
			"surah": 43,
			"ayat": 15,
			"tafsir": "Allah explains that even though the polytheists admit that Allah created the heavens and the earth, besides that they also stipulate that Allah has children, and angels are His daughters. They say, Allah is not eternal like creatures, both of them have children, instead despising Him because Allah is said to have daughters, while they have sons. The Arabs at that time considered it despised to have daughters. So, it is not surprising that the verse closes with the assertion that human beings really deny God's favor, which has been bestowed upon them."
		   },
		   {
			"id": 4341,
			"surah": 43,
			"ayat": 16,
			"tafsir": "Allah uncovers the error of polytheists and the wrongness of their words. Does it make sense that Allah had something for Himself that was worse (as they assumed) while others had good things and chose for Himself daughters and for others sons? Allah's Word: Is it (appropriate) for you who are male and for Him who is female? That is certainly an unfair distribution. (an-Najm\/53: 21-22) And His word: Did He (Allah) choose daughters over sons? Why are you here? How (how) do you determine? So why don't you think about it? (ash-shaffat\/37: 153-155) And His word again: If Allah wanted to take a child, surely He would choose what He wanted from what He had created. Blessed be He. He is God Almighty, Almighty. (az-Zumar\/39: 4)"
		   },
		   {
			"id": 4342,
			"surah": 43,
			"ayat": 17,
			"tafsir": "Allah showed the stupidity of the polytheists and their fraud. When one of them is blessed with a daughter, immediately his face becomes very gloomy because of sadness, he bears a very deep shame, he can't stand face to face with his friends. He was alone in confusion. What would he have done? Will the daughter he got be left alone, even if he has to bear the shame and humiliation, or will he bury her alive? A very disgraceful act, as Allah says: Yet when one of them is given the news of (the birth of) a daughter, his face turns black (red), and he is very angry. He hid from the crowd, because of the bad news that was delivered to him. Will he protect it with (bear) humiliation or will he sink it into the ground (alive)? Remember how bad (the decision) they made it. (an-Nahl\/16: 58-59)"
		   },
		   {
			"id": 4343,
			"surah": 43,
			"ayat": 18,
			"tafsir": "Allah refutes the opinion of the polytheists that Allah has daughters while they have sons. The objection is: Is a person who was born and raised to decorate and if he is in exchanging thoughts and discussions unable to put forward strong proofs or reasons, because he is more influenced by feelings than using reason and thoughts, can someone like this be considered a child of God?"
		   },
		   {
			"id": 4344,
			"surah": 43,
			"ayat": 19,
			"tafsir": "This verse explains that the polytheists have made four major mistakes that show their disbelief. First, he said that God had a son; secondly, female children of God; and third, the children of God are angels, even though angels are His glorified servants, who always worship God day and night, and never violate what they are ordered to do. Angels of this nature are said to be women. Fourth, they think that they are polytheists because God has ordained them. All their statements are grave sins and baseless lies. Did they witness the creation of the angels so that they dared to say so and were sure that the angels were women? Allah said: Or did We create angels in the form of women while they witnessed (it)? Remember, among their lies they actually said, \"Allah has children.\" And really, they are total liars. (as-shaffat\/37: 150-152) Verse 19 closes with a threat to polytheists that what they say about angels, all of that will be recorded and they will be held accountable in the afterlife. One more is shown heretical deeds and polytheists. They said mockingly, \"If Allah, the Most Gracious, had willed, we would not have worshiped that angel.\" As if they worshiped angels because of God's will. Allah says: The polytheists will say, \"If Allah had willed, we would not have associated partners with Him. (al-An'am\/6: 148) Their stance is very wrong and misguided, because Allah has never approved of the worship of anything besides Him, Allah only commands that humans only worship Him, as His word: And indeed, We have sent a messenger for every nation (to call), \"Worship Allah, and stay away from thagut\" (an-Nahl\/16: 36) And His words: And ask (Muhammad) to Our messengers whom We have sent before you, \"Did We appoint gods other than (Allah) the Most Compassionate to be worshiped?\" (az-Zukhruf\/43: 45 ) Verse 20 closes with firmness, rejecting the words of the polytheists, that they do not know the actual situation at all and do not have the slightest knowledge about it. What they say is mere conjecture and is not based on rights and truth."
		   },
		   {
			"id": 4345,
			"surah": 43,
			"ayat": 20,
			"tafsir": "This verse explains that the polytheists have made four major mistakes that show their disbelief. First, he said that God had a son; secondly, female children of God; and third, the children of God are angels, even though angels are His glorified servants, who always worship God day and night, and never violate what they are ordered to do. Angels of this nature are said to be women. Fourth, they think that they are polytheists because God has ordained them. All their statements are grave sins and baseless lies. Did they witness the creation of the angels so that they dared to say so and were sure that the angels were women? Allah said: Or did We create angels in the form of women while they witnessed (it)? Remember, among their lies they actually said, \"Allah has children.\" And really, they are total liars. (as-shaffat\/37: 150-152) Verse 19 closes with a threat to polytheists that what they say about angels, all of that will be recorded and they will be held accountable in the afterlife. One more is shown heretical deeds and polytheists. They said mockingly, \"If Allah, the Most Gracious, had willed, we would not have worshiped that angel.\" As if they worshiped angels because of God's will. Allah says: The polytheists will say, \"If Allah had willed, we would not have associated partners with Him. (al-An'am\/6: 148) Their stance is very wrong and misguided, because Allah has never approved of the worship of anything besides Him, Allah only commands that humans only worship Him, as His word: And indeed, We have sent a messenger for every nation (to call), \"Worship Allah, and stay away from thagut\" (an-Nahl\/16: 36) And His words: And ask (Muhammad) to Our messengers whom We have sent before you, \"Did We appoint gods other than (Allah) the Most Compassionate to be worshiped?\" (az-Zukhruf\/43: 45 ) Verse 20 closes with firmness, rejecting the words of the polytheists, that they do not know the actual situation at all and do not have the slightest knowledge about it. What they say is mere conjecture and is not based on rights and truth."
		   },
		   {
			"id": 4346,
			"surah": 43,
			"ayat": 21,
			"tafsir": "Allah added an explanation in the context of His rejection of the presumption of polytheists that they worship angels because of Allah's will, with His words, \"Have we ever given them a book before the Qur'an, then they stick to the book?\" that? No, absolutely not. Their stance is only based on conjectures and conjectures that contain lies, says Allah: What they follow is mere conjecture and they only fabricate lies. (al-An'am\/6: 116)"
		   },
		   {
			"id": 4347,
			"surah": 43,
			"ayat": 22,
			"tafsir": "Allah explains that what is thought to be a reason to associate partners with Allah, is completely untrue, and does not have a reliable reason. They are simply devoted to following and sticking to what their forefathers have done, because they are sure that their forefathers are knowledgeable, and will not mislead those who follow them, instead they will receive guidance. They reverse the situation, because in fact they have gone astray and have not been guided, as Allah says: Indeed, they have gone astray and have not been guided. (al-An'am\/6: 140)"
		   },
		   {
			"id": 4348,
			"surah": 43,
			"ayat": 23,
			"tafsir": "In this verse, Allah comforted the Prophet Muhammad that no messenger who was sent to a country before Muhammad saw was greeted with pleasant words. They all got an answer that was not pleasant to hear and very annoying. Such an attitude comes from people who are used to living in luxury, are arrogant and arrogant. They said, \"Surely we find our forefathers adhering to a religion and indeed we are followers of their footsteps.\" So, if Muhammad SAW gets an answer like that, there is no need to get upset and feel short of breath. What was said to Muhammad peace be upon him was also said to the previous messengers, as Allah says: What was said (by the disbelievers) to you is none other than what was said to the messengers before you. (Fussilat\/41: 43) Likewise, when it is said that the Prophet Muhammad was a sorcerer, or was mad by his people, even that was because the previous apostles had been accused of the same by their people, Allah said: -the people before them, they (his people) must have said, \"He is a magician or a madman.\" (adh-dzariyat\/51: 52)"
		   },
		   {
			"id": 4349,
			"surah": 43,
			"ayat": 24,
			"tafsir": "Allah explained that the Prophet Muhammad appealed to his people with the words, \"Are you still following in the footsteps of your ancestors, even though I brought you a religion that is real and better than what your ancestors had followed?\" His people answered arrogantly, that they would still follow in the footsteps of their forefathers and would not follow the religion they brought, namely the religion that was assigned to them to convey it, and they would still deny it, as Allah says: Those who are arrogant say, \"Indeed we deny what you believe.\" (al-A'raf\/7: 76)"
		   },
		   {
			"id": 4350,
			"surah": 43,
			"ayat": 25,
			"tafsir": "Allah explains that those who remain disobedient and always deny the messengers sent to them and deny the lordship of Allah, will be destroyed as a result of their actions which always deny the verses of Allah; may this be witnessed and become a reference in accordance with His words: So walk on earth and see how the end of those who deny (the apostles). (an-Nahl\/16: 36)"
		   },
		   {
			"id": 4351,
			"surah": 43,
			"ayat": 26,
			"tafsir": "Allah ordered Muhammad SAW to warn his fanatical people to his ancestors that the Prophet Abraham had separated from his father and his people when he saw them earnestly worshiping idols, because that is something that is inappropriate and leads to misguidance, according to the word Allah: And (remember) when Ibrahim said to his father Azar, \"Is it appropriate for you to make these idols a god? Truly I see you and your people in a clear error.\" (al-An'am\/6: 74)"
		   },
		   {
			"id": 4352,
			"surah": 43,
			"ayat": 27,
			"tafsir": "In this verse the Prophet Abraham emphasized his position after he separated from his father and his people, that he only worshiped Allah who created him and who created all humans. He is the one who will show the good and right path, which will lead people to the happiness of the world and the hereafter. He who provides and gives food and drink, heals the sick. God who kills and gives life, God who is expected to forgive sins in the afterlife. Prophet Ibrahim's affirmation is enshrined in the Qur'an as Allah says: (namely) Who has created me, He is the One who guides me, and Who gives me food and drink; and when I am sick, He is the one who heals me, and Who will kill me, then will revive me (again), and Who I really desire will forgive my mistakes on the Day of Resurrection.\" (asy-Shura \/ 26: 78-82)"
		   },
		   {
			"id": 4353,
			"surah": 43,
			"ayat": 28,
			"tafsir": "Allah explained that the Prophet Abraham made the sentence of monotheism an eternal sentence, so that the people of Mecca could realize it, then leave the religion of their ancestors who went astray and follow the religion of monotheism that their ancestors adhered to who did not go astray, namely Abraham, especially if they remember that Prophet Abraham was their pride. for building Baitullah which is the center of attention for Muslims around the world when establishing prayers. Qatadah said, \"From the descendants of Abraham there will always be those who worship Allah until the Day of Judgment.\" And Ibn 'Arabi said, \"That the descendants of Abraham can be hereditary in the religion of monotheism, because of his two prayers which have been permitted by Allah, first: \"Verily, I have made you a leader for all mankind.\" He (Ibrahim) said, \"And (also ). (Ibrahim\/14: 35)"
		   },
		   {
			"id": 4354,
			"surah": 43,
			"ayat": 29,
			"tafsir": "Allah explains that He has given pleasure to the polytheists and their ancestors since ancient times, lengthened their lives, bestowed various favors, but they were fascinated by the blessings that were in them, influenced by the will of their lusts, then obeyed the invitation. satan and forgot the sentence of monotheism. So Allah made from the descendants of Abraham people who unite with Allah, ordered the disbelievers among them to believe in Him, so He chose Muhammad as a Messenger and He sent down the Qur'an as a book containing instructions to the right path, calling them to do good deeds for the benefit and happiness of the world and the hereafter."
		   },
		   {
			"id": 4355,
			"surah": 43,
			"ayat": 30,
			"tafsir": "Allah explained that when the Qur'an and miracles were delivered to them as proof of the truth of the Prophet, they received it with an unfavorable reception. They said that what was brought to them was magic and not a revelation from Allah, therefore they denied it."
		   },
		   {
			"id": 4356,
			"surah": 43,
			"ayat": 31,
			"tafsir": "They said, \"The position as an apostle is a noble position, so it is fitting that the person who holds that position is also a noble person, has wealth and a high position, while Muhammad did not have that. Those who deserve this position are one of two people who have these things from two noble cities as well, namely al-Walid bin al-Mugirah from Mecca or 'Urwah bin Mas'ud ats-saqafi from taif."
		   },
		   {
			"id": 4357,
			"surah": 43,
			"ayat": 32,
			"tafsir": "This verse shows the rejection of the wishes of polytheists who do not want to accept the appointment of Muhammad as an apostle; as if they are the most entitled and authorized to divide and determine who deserves to receive God's grace. Allah states, \"This is absolutely not the case, We are the ones who have the right and authority to regulate and determine the livelihood of servants in the life of the world. It is We who prefer some servants over others; some are rich and some are weak, some are smart and some are who are ignorant, some are advanced and some are backward, because if We equalize between servants in the matters mentioned above, there will be competition between them, or there will be no situation of mutual assistance between one another, and mutual benefit will not occur between one another, on the contrary they ridicule each other. All of this will lead to destruction and destruction of the world. If they are unable to do as mentioned above regarding worldly affairs, why do they dare to oppose the various wisdoms of Allah in determining who who deserves to be entrusted with the apostolic task.This verse closes with the affirmation that God's grace and virtue are in give to people who have been destined to assume the position of prophethood and follow the instructions of revelation in the Qur'an that has been revealed, far better and nobler than the luxuries and wealth of the world that they hoard. This is because the world with all its wealth is on the brink of collapse and will vanish without even a trace."
		   },
		   {
			"id": 4358,
			"surah": 43,
			"ayat": 33,
			"tafsir": "This verse emphasizes that had it not been because Allah wanted to prevent all human beings from becoming one people in disbelief as a result of seeing disbelievers getting ample sustenance, because they thought that large wealth was proof of Allah's love for them, then Allah would have given it to people. Those who disbelieve are mansions made of gold and silver, but Allah wills their faith."
		   },
		   {
			"id": 4359,
			"surah": 43,
			"ayat": 34,
			"tafsir": "Likewise the doors of the houses of the heathen, and the beds on which they sleep will be made of silver. These are ornaments in which humans are proud; all of that is only the pleasures of the worldly life which are temporary, and can only last a few moments and then disappear, while the afterlife which is full of pleasures and enjoyments that are diverse and innumerable and everlasting has been prepared for those who fear Allah, who do not associate partners with Him, who do not commit immorality by violating His commands, but are obedient and submissive in carrying out His commands. Allah's Word: While you (unbelievers) choose the worldly life, even though the hereafter is better and more lasting. (al-A'la\/87: 16-17)"
		   },
		   {
			"id": 4360,
			"surah": 43,
			"ayat": 35,
			"tafsir": "Likewise the doors of the houses of the heathen, and the beds on which they sleep will be made of silver. These are ornaments in which humans are proud; all of that is only the pleasures of the worldly life which are temporary, and can only last a few moments and then disappear, while the afterlife which is full of pleasures and enjoyments that are diverse and innumerable and everlasting has been prepared for those who fear Allah, who do not associate partners with Him, who do not commit immorality by violating His commands, but are obedient and submissive in carrying out His commands. Allah's Word: While you (unbelievers) choose the worldly life, even though the hereafter is better and more lasting. (al-A'la\/87: 16-17)"
		   },
		   {
			"id": 4361,
			"surah": 43,
			"ayat": 36,
			"tafsir": "In this verse it is emphasized that whoever turns away from Allah's warnings and teachings, namely blinds his heart to believe and believes in His teachings contained in the Qur'an, Satan will always accompany him and will always try to lead him astray, so that Allah will eventually make the devil become his loyal friend. According to az-Zajjaj, the meaning of this verse is that whoever turns away from the Qur'an and does not want to follow the instructions contained therein, satan will constantly tempt him until he falls into a misguided path, therefore he will definitely be punished by Allah. In a hadith Rasulullah saw said: Rasulullah saw said, \"There is not one of you but accompanied by a companion from the group of jinn.\" (Muslim history) In another verse Allah says that people who always deny Allah's verses, Allah will turn their hearts and views back and forth so that they do not become believers and remain in their error: And (similarly) We turn away and their sight was like the first time they did not believe in it (the Qur'an), and We left them confused in error. (al-An'am\/6: 110) Humans who go astray will sin, then the more he wallows in sin, the more his heart is closed so that it is no longer possible to believe and do good, as the words of the Messenger of Allah: Rasulullah saw said, \"Verily, a believer if If he commits a sin, there will be a black spot in his heart, if he repents and leaves and asks for forgiveness, his heart will be clean again. But if his sin increases, the black spot will increase so that it covers his heart.\" (Ahmad's history)"
		   },
		   {
			"id": 4362,
			"surah": 43,
			"ayat": 37,
			"tafsir": "This verse explains the consequences of having Satan as a friend, namely that Satan will always try to prevent them from finding the right path, namely believing in the teachings of Allah contained in the Qur'an. In the end, they did not find the right path, but felt that the misguided path they were following was correct, and the truth of the verses of the Al-Qur'an that were conveyed to them was wrong. That's how great Satan's power over that person."
		   },
		   {
			"id": 4363,
			"surah": 43,
			"ayat": 38,
			"tafsir": "In this verse, it is explained the fate of humans who are friends with Satan in the Hereafter when they face Allah. It was then that the man realized that he had been led astray by the demons. In front of God he regretted why he was too close to the demons while in the world. He regretted why when in the past they and the devil were not as far apart as east and west, that is, like between one end and the other. But that regret is useless, because the world has been rolled up and it is impossible to return it. In the afterlife the demons who were their loyal companions while on earth will leave them. In front of Allah, the demons reneged on friendship and let go of hands, as informed in surahh Ibrahim\/14: 22. And Satan said when the matter (hisab) had been settled, \"Indeed, Allah has promised you a true promise, and I have promised you but I violated it. I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, nor can you help me. Truly I am not justify what you did associating me (with Allah) a long time ago.\" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) Thus, demons are clearly the worst friends: in the world they seduce, but in the afterlife they let go of hands and even plunge humans."
		   },
		   {
			"id": 4364,
			"surah": 43,
			"ayat": 39,
			"tafsir": "Furthermore, Allah confirms to them that no matter how they regret and whatever their reasons, they will not be accepted. This is because they have done wrong, that is, they do not believe in Him and do not carry out His commandments. They will eventually be thrown into hell with the demons of their friends."
		   },
		   {
			"id": 4365,
			"surah": 43,
			"ayat": 40,
			"tafsir": "In this verse, Allah asked the Prophet Muhammad, who always wanted the disbelievers to believe, whether he was able to make deaf people hear the invitation to believe and do good, and whether he was able to open the hearts of people whose eyes had been closed. Of course the Prophet will not be able to, because only Allah is able to do it, while Allah will not return those who have gone astray if they themselves are not willing to return to the right path. Allah swt's question to Prophet Muhammad saw was not for the purpose of asking, but rather to emphasize that their ears and inner eyes were actually deaf and blind, therefore they would not accept any truth that was conveyed to them. Therefore his task as an apostle is only to convey. In conveying the words of Allah to the Meccan infidels, the Prophet had carried them out with all his might and effort, but some of them opposed them. The Prophet saw and his people were boycotted, even threatened with death. To save himself the Prophet ordered his followers to emigrate, first to Abyssinia, and secondly to Medina. Opposition and threats that sometimes make the Prophet's heart. disappointed and almost gave up. But with the revelation of verses like this verse, his heart was comforted again. He realized that he was innocent, but they were the ones who closed his heart. Only Allah is able to open it, because of that he no longer gives up hope, but continues to preach, with the hope that one day Allah will send down His guidance to them. In another verse Allah says regarding the giving of guidance which is the authority of Allah: It is not your (Muhammad's) obligation to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272)"
		   },
		   {
			"id": 4366,
			"surah": 43,
			"ayat": 41,
			"tafsir": "In these two verses it is explained that the Prophet did not need to worry too much about the opposition of the Meccan polytheists. They will surely be punished by Allah at the time He wills. The possibility of punishment was in two ways. First, Allah will punish them after the Holy Prophet died; thus he could not witness the punishment himself in the world. Second, the punishment of those who disbelieved was carried out by Allah right now, namely when the Prophet was still alive. Evidence of such punishment is, according to some scholars, the killing of many of the leaders of the Meccan infidels during the Battle of Badr. Such is God's threat to the disbelievers. This statement again strengthened the Prophet's heart that those who opposed it really really blinded his heart because it needed to be preached more intensively."
		   },
		   {
			"id": 4367,
			"surah": 43,
			"ayat": 42,
			"tafsir": "In these two verses it is explained that the Prophet did not need to worry too much about the opposition of the Meccan polytheists. They will surely be punished by Allah at the time He wills. The possibility of punishment was in two ways. First, Allah will punish them after the Holy Prophet died; thus he could not witness the punishment himself in the world. Second, the punishment of those who disbelieved was carried out by Allah right now, namely when the Prophet was still alive. Evidence of such punishment is, according to some scholars, the killing of many of the leaders of the Meccan infidels during the Battle of Badr. Such is God's threat to the disbelievers. This statement again strengthened the Prophet's heart that those who opposed it really really blinded his heart because it needed to be preached more intensively."
		   },
		   {
			"id": 4368,
			"surah": 43,
			"ayat": 43,
			"tafsir": "In this verse the Prophet was asked by Allah to hold fast to the Qur'an, namely to increase his faith in it and to be more active in conveying Allah's teachings in it. This is because the teachings contained in the Book are absolutely true and guarantee the happiness of human life in this world and the hereafter. As for those who remain disobedient, of course Allah will determine the punishment for them."
		   },
		   {
			"id": 4369,
			"surah": 43,
			"ayat": 44,
			"tafsir": "Allah confirms that the revelation of the Qur'an is actually a glory for the Prophet and his people, namely the Quraysh tribe in particular and the Arab nation in general. That is because the Qur'an was revealed in their language. That way the Arabs, especially the Quraysh tribe, certainly understand the meaning best, because they should be the first to believe in it and carry out the teachings contained in it. In another verse Allah states the Qur'an as an honor that has been given to them: Indeed, We have sent down to you a Book (Al-Qur'an) in which there is a warning for you. Then do you not understand? (al-Anbiya'\/21: 10) Furthermore, the polytheists of Mecca should have been the pioneers in spreading the teachings contained in the Qur'an. For that they will be held accountable. If they do not believe in it, do not practice it, and do not disseminate it, then their positions will be replaced by other peoples, as Allah says: Remember, you are those who are invited to spend (your wealth) in the way of Allah. Then there is one among you who is miserly, and whoever is miserly, he is indeed stingy to himself. And Allah is the Most Rich and you are the needy (His gifts). And if you turn away (from the right path) He will replace (you) with another people, and they will not be (disobedient) like you (these). (Muhammad\/47: 38) Because the Al-Qur'an was revealed in Arabic, Muslims who are not Arab and do not speak Arabic need to learn Arabic in order to understand the teachings contained in the Al-Qur'an properly. Good. Among them there needs to be someone who studies the teachings contained in it, implements it, and preaches it. If they do that, then their position will be on the same level as the Quraysh tribe who was awarded the honor of being the first people to accept Islam and spread it to other nations. They are scholars. Thus on the shoulders of the scholars lies a great responsibility and they will also be held accountable later in the hereafter by Allah swt."
		   },
		   {
			"id": 4370,
			"surah": 43,
			"ayat": 45,
			"tafsir": "This verse contains reproach against the Meccan infidels who still do not want to believe and still worship idols. The blame was directed at them because the Qur'an was revealed in their language, which they should have understood and believed in beforehand. For this reason, Allah asked the Prophet Muhammad to ask the previous messengers, has Allah ever made a god other than Him. The order for the Prophet to ask the previous prophets, according to the opinion of some scholars, occurred when the Prophet made the Isra' Mi'raj. There are also those who argue that the questioning of the apostles was done by examining the contents of the previous holy books, namely the Torah and the Gospels. The prophets will surely answer that they have never witnessed the existence of a god besides Allah. Thus Allah's command to the Prophet Muhammad to ask the previous prophets was not asking because they did not know, but asking to show that the Quraysh who worshiped idols were wrong because this was never taught in previous religions. Therefore they should have faith."
		   },
		   {
			"id": 4371,
			"surah": 43,
			"ayat": 46,
			"tafsir": "In this verse it is explained that Allah has sent the Prophet Musa to Pharaoh and his people to convey Allah's teachings. The Prophet Musa was sent to Pharaoh with several miracles, for example a staff that turned into a snake, hands that glowed, and so on. The essence of the Prophet Musa's call to Pharaoh was for Pharaoh to acknowledge Allah as the Lord who created and sustains the entire universe, and to acknowledge him as His messenger. This affirmation regarding the Prophet Musa also contains an affirmation regarding the Prophet Muhammad. Meccan infidels should also believe in Allah swt as God Almighty, believe in Muhammad saw as His Messenger and believe in his main miracle, namely the Qur'an. Furthermore, this affirmation implies that the religion proclaimed by the Prophet Muhammad is the same as that proclaimed by the Prophet Musa and all the prophets, namely Islam. Allah said: Verily the religion with Allah is Islam. (Ali 'Imran\/3:19)"
		   },
		   {
			"id": 4372,
			"surah": 43,
			"ayat": 47,
			"tafsir": "This verse explains the attitude of Pharaoh and his people towards the call of Prophet Musa. They asked Prophet Musa to convey the proofs of his apostleship, then Prophet Musa presented his miracles, including his staff becoming a snake, hands glowing, and so on. But they laughed at him and mocked him. The Prophet Muhammad was also treated like that by the Meccan infidels. They accused him of being a sorcerer and a liar (shad\/38: 4), and accused the Qur'an of being a dream, fabrication, or poetry composed by the Prophet Muhammad. (al-Anbiya'\/21: 5). What is conveyed in this verse relieves the emotional distress that the Prophet (s) suffered from the fierce opposition of the Meccan infidels. From the contents of the verse, the Prophet learned that it was customary for a prophet to be opposed by his people, therefore it was not only him who opposed him, but all the prophets. He must be patient and steadfast in facing all challenges, as Prophet Musa was patient and steadfast in facing Pharaoh and his troops, so that he won victory. Likewise the Prophet Muhammad saw, if he was patient and steadfast, then he would also gain victory over the Meccan infidels in this world as well, which was later proven by the destruction of the Meccan infidel troops in the Battle of Badr."
		   },
		   {
			"id": 4373,
			"surah": 43,
			"ayat": 48,
			"tafsir": "In this verse it is explained that a miracle is an event or something big and extraordinary that is given to a prophet as proof of his prophethood. But the miracles given to a prophet are greater than the miracles given to previous prophets. Likewise the miracles given to Prophet Musa. In surahh al-Isra'\/17: 101 it is stated that the Prophet Musa was given nine kinds of miracles, namely a stick that became a snake, glowing hands, a long drought, the sea was parted, a terrible typhoon, locusts that destroyed plants, fleas that caused disease, frogs that became pests, and drinking water that turned into blood that Allah sent down to Pharaoh and his people in the form of disaster to awaken them, as Allah said: So We sent them typhoons, locusts, fleas, frogs and blood (drinking water turned to blood) as clear evidence, but they are still arrogant and they are a sinful people. (al-A'raf\/7: 133) With these disasters inflicted on Pharaoh and his followers, it was hoped that they would return, namely to have faith. But not so, they still disobey. Likewise with the Prophet Muhammad, he had conveyed to the Meccan infidels his greatest miracle, namely the Qur'an. But they still refused and stated that the Qur'an was a dream, fabrication, or poetry composed by the Prophet Muhammad."
		   },
		   {
			"id": 4374,
			"surah": 43,
			"ayat": 49,
			"tafsir": "Pharaoh and his followers felt the disasters that had befallen them were very powerful, so they begged the Prophet Musa to pray to Allah to deliver them from this doom. \"O sorcerer!\" they said, \"Pray to your God according to what He promised you! We will certainly accept what you say.\" Calling Prophet Musa a sorcerer has shown that they despised him and did not believe him. But Prophet Musa still granted their request, because God had indeed promised him that if they had faith, the punishment would be stopped. Prophet Musa also prayed after they promised to have faith, then Allah stopped the doom."
		   },
		   {
			"id": 4375,
			"surah": 43,
			"ayat": 50,
			"tafsir": "After the punishment was stopped, it turned out that they broke their promise. They remained disobedient. In another verse the event is also explained: And when they were overwritten by the doom (which has been described) they said, \"O Musa! Ask us to your Lord according to His promise to you. If you can remove the doom from us, we will surely believe in you and we will surely let the Children of Israel go with you.\" But after We removed the punishment from them until the time limit they had to meet, they broke their promise. (surahh al-A'raf\/7: 134-135) In that verse it is explained that they promised that if they were released from these disasters, they would believe and would free the Children of Israel from the torment and slavery they had treated them. But these are just promises. They did not keep that promise, even wanting to harm Prophet Musa and his people."
		   },
		   {
			"id": 4376,
			"surah": 43,
			"ayat": 51,
			"tafsir": "Pharaoh increasingly showed his arrogance and arbitrariness. He asked his people, asking to confirm, didn't the great Egyptian kingdom belong to him and not to anyone else. Are not the rivers as the source of life in that country flowing under his palace and in his gardens. The question was to show his arrogance. With those words he wanted to declare that he was the great and only ruler in the land, who was impossible to fight and defeat. Therefore he will not believe and will not submit to the Prophet Musa. His words also contained a threat to anyone who followed the Prophet Musa that they would have an unfavorable fate."
		   },
		   {
			"id": 4377,
			"surah": 43,
			"ayat": 52,
			"tafsir": "Pharaoh increasingly showed arrogance. He insulted the Prophet Musa. He asked his people, once again to emphasize, isn't he the best, while the Prophet Musa was a despicable person because he did not have anything, such as power, position, and wealth as he had. And wasn't the Prophet Musa so despicable to remember to explain something with words he couldn't. What he meant was the inability of Prophet Musa to speak clearly because of his numb tongue as he confessed in his prayer to Allah to strengthen him by sending his brother, Prophet Harun. Allah said: And my brother Aaron, he is more eloquent in tongue than I am, so send him with me as my helper to justify my (sayings); Really, I'm afraid they will lie to me. (al-Qasas\/28: 34) The purpose of Pharaoh asking his people by conveying the shortcomings of the Prophet Musa was not to ask but for the purpose of insulting him. He hoped that by pointing out the shortcomings of the Prophet Musa, his people would have a bad view of him and would not believe him."
		   },
		   {
			"id": 4378,
			"surah": 43,
			"ayat": 53,
			"tafsir": "Pharaoh gave reasons why Prophet Musa did not deserve glory and did not deserve to be believed as an apostle, because he did not have gold bracelets as a sign that he was rich, and was not accompanied by angels as a sign that he was an apostle. Thus Fir'aun made the benchmark for glory with wealth, and the benchmark for truth was in the things that were visible to the eye. Allah does not place the benchmark of glory on material things but on piety, as Allah says: O people! Indeed, We have created you from a male and a female, then We made you nations and tribes so that you may know one another. Indeed, the most noble of you in the sight of Allah is the one who is the most pious. Indeed, Allah is All-Knowing, All-Aware. (al-hujurat\/49: 13) Allah does not place the standard of truth as an apostle on something that can be sensed, but on the truth of the path he takes, that is, on the truth of the revelation he gets from Allah. Allah said: Say (Muhammad), \"Verily, I am only a human being like you, who has received revelations, that indeed your God is God Almighty.\" So whoever hopes for a meeting with his Lord, let him do good deeds and let him not associate anything with him in worshiping his Lord.\" (al-Kahf\/18: 110) The inappropriate treatment that the Prophet Muhammad saw was even worse. believe him as an apostle because he doesn't have anything. They ask him, besides being a rich man, can also create extraordinary events to the point that they want to see Allah and angels in plain view. This request is certainly impossible for him to fulfill because it was beyond his power and impossible to fulfill. He only replied, \"Glory be to my Lord, and I am only a human being who is an apostle.\" Say (Muhammad), \"Glory be to my Lord, am I not only a human being who is an apostle?\" (al- Isra'\/17: 93)"
		   },
		   {
			"id": 4379,
			"surah": 43,
			"ayat": 54,
			"tafsir": "Pharaoh's efforts to influence and trick his people succeeded. The Egyptian people obeyed him and did not want to believe in Prophet Musa and even hated him. They are classified by God as wicked people, namely people who have really violated religious teachings and left the truth."
		   },
		   {
			"id": 4380,
			"surah": 43,
			"ayat": 55,
			"tafsir": "The wickedness of Pharaoh and his people was getting worse. They are increasingly forgetting land and even view Pharaoh is a god. The act has reached its peak, which is no longer possible to be forgiven by Allah and is deeply regretted. Allah also handed down His punishment, when Pharaoh and his army chased Prophet Musa and his people to the Red Sea, Allah drowned him in that sea. Thus he died because of his pride in having wealth and power, and the truth was revealed even though it was carried only by an ordinary human being who had no power whatsoever. The postponement of punishment for an evil person is called istidraj, that is, the perpetrator of a sinful act is allowed to commit a crime so that his sin continues to increase to its peak, if the perpetrator is no longer able to be advised. When the sins have reached their peak, then Allah will not forgive them again, then He will pass down His punishment. The Prophet said in a history of Ahmad, at-Tirmidhi, ath-thabrani and al-Baihaqi: 'Uqbah bin 'Amir narrated that the Prophet said, \"When you see Allah giving a servant the worldly pleasures he wants from the world while he is always immoral then indeed it is istidraj.\" Then the Holy Prophet recited the verse, \"So when they forgot the warning that had been given to them, We opened all doors (pleasures) for them. So that when they were happy with what was given to them, We punished them suddenly, then when they fell silent in despair.\" (Ahmad's history, at-Tirmidhi, ath-thabrani and al-Baihaqi)"
		   },
		   {
			"id": 4381,
			"surah": 43,
			"ayat": 56,
			"tafsir": "The case of Pharaoh is an example that should be used as a lesson by subsequent generations until the Day of Judgment. The lesson is that no one imitates the behavior of the arrogant and lawless Pharaoh. And that anyone who is arrogant and lawless will suffer the same fate as that Pharaoh."
		   },
		   {
			"id": 4382,
			"surah": 43,
			"ayat": 57,
			"tafsir": "This verse explains that the Prophet Isa, the son of Maryam, was used as an example by the polytheists of Mecca to bring down and make fun of the Prophet Muhammad. This happened when he conveyed the verse,\" \"Indeed, you (unbelievers) and what you worship besides Allah, are fuel for Hell,\" (al-Anbiya'\/21: 98). They cheered for joy, because thought to have reasons to prove that the Prophet Muhammad acted wrongly based on that verse. This is because the Prophet Isa is worshiped by some people. That way he will also go to hell with those who worship him. To refute this view Allah sent down the verse, \"Indeed, long ago for those who have good (statutory) from Us, they will be kept away (from hell),\" (al-Anbiya'\/21:101). Thus the Prophet Isa, 'Uzair, and the priests and monks monks who are devout and only worship Allah, will enter heaven, and misguided people who then make them gods other than Allah will go to hell. Regarding Isa himself who is worshiped by those who are astray this verse was revealed to refute it, \"And when the son of Maryam so fish of parables, suddenly your people, O Muhammad, cheered for it,\" that is, cheered you on for His words. Then Allah explained, \"He (Isa) is nothing but a servant whom We bestow favors on and We make a sign for the Children of Israel. And if We so will, We really make some of you angels on earth for generations. And he (Isa) is indeed proof of the existence of the Last Day.\""
		   },
		   {
			"id": 4383,
			"surah": 43,
			"ayat": 58,
			"tafsir": "In this verse it is explained that the polytheists of Mecca compared their gods, namely idols, with the Prophet Isa whom the heretical people had worshiped before, which one is better. In their view, Prophet Isa is no better than the idols they worship, because Prophet Isa will also go to hell with them and their gods. Then Allah breaks that view by explaining that they are actually only debating and refuting uncertainly, because that is the nature that has been ingrained in them."
		   },
		   {
			"id": 4384,
			"surah": 43,
			"ayat": 59,
			"tafsir": "Allah confirms that Prophet Isa is actually His servant, not His son and not God. He has been blessed with glory, namely being a prophet who conveys God's teachings in the Bible. Besides that, He made the Prophet Isa as an example for the Children of Israel regarding the proof of His power, that He created something through an unnatural process, namely creating humans without a father. By setting this example, the Children of Israel and anyone after him should not see him as a child of God and adopt him as a god."
		   },
		   {
			"id": 4385,
			"surah": 43,
			"ayat": 60,
			"tafsir": "Allah refutes the belief of the polytheists of Mecca that angels are children of Allah who must be worshiped. This belief is the same as the belief of some of the Children of Israel and those after them about the Prophet Isa. Allah emphasized that if He wanted, He could create humans to become angels who inhabit this earth for generations, or replace humans on earth who also live to reproduce until the Day of Judgment. Then are the angels the children of God and worthy of worship? With this explanation, Allah wanted to convey to the polytheists of Mecca that He was able to create anything, including something far greater than the creation of Prophet Isa, therefore only Allah deserves to be worshiped, not His creation."
		   },
		   {
			"id": 4386,
			"surah": 43,
			"ayat": 61,
			"tafsir": "Allah explained further about the advantages given to Prophet Isa, which will be proof of the existence of the Doomsday. That's because Prophet Isa had great miracles, such as bringing the dead back to life, healing blindness, and so on. These miracles are proof that Allah, who gave them, is able to create the Day of Judgment. In addition, authentic hadiths inform that Prophet Isa will come before the Day of Judgment. This hadith was narrated from various sources, including Abu Hurairah, Ibn 'Abbas, 'Ikrimah, al-Hasan, Qatadah, and adh-ahhak, so that it is considered mutawatir by some scholars. Among these hadiths are: The Prophet said, \"By (Allah) who controls my soul, almost came down to you Isa bin Maryam as a just judge. (Al-Bukhari and Muslim) Thus the meaning of this verse is that the emergence of Prophet Isa approaching the Doomsday is a sign that the Doomsday will come. Furthermore, Allah asks people not to doubt the coming of the Doomsday. Therefore they must prepare themselves by believing and doing good, so that they can reap the fruits of their faith and deeds later in the hereafter. In this way humans will live happy forever in the hereafter. Allah asked the Children of Israel to follow the teachings that He conveyed to the Prophet Isa regarding the existence of the Doomsday. The teachings regarding the existence of the Doomsday asked humans to do good in preparation for facing it. This teaching is the straight path that is absolutely true and can definitely lead people to a happy life in the hereafter.The straight path that is taught n Islam, which is the religion brought by all the prophets, including the last prophet, Muhammad saw."
		   },
		   {
			"id": 4387,
			"surah": 43,
			"ayat": 62,
			"tafsir": "Furthermore, God warns people not to be trapped by Satan's deception. Human duty is to worship, that is to serve God by offering goodness to all nature. In his struggle, he will always be hindered and confronted by Satan. Humans must fight it so that their efforts and struggles in realizing goodness will not be stopped by Satan. Thus satan also works hard, to bring down humans. Because he is indeed the true enemy of man. This true enmity occurred because Satan was vengeful as a result of being cursed by Allah and was expelled from heaven, because he did not want to bow down to the ancestor of mankind, namely Adam."
		   },
		   {
			"id": 4388,
			"surah": 43,
			"ayat": 63,
			"tafsir": "This verse explains how the actual preaching of Prophet Isa to the Children of Israel. The Prophet Isa conveyed the main points of the teachings he received from Allah SWT, including faith in Allah as God Almighty, faith in the existence of the afterlife, doing good to fellow human beings, and not doing evil deeds. The Prophet Isa emphasized that the main points of the teachings he conveyed were wisdom, namely monotheism that needed to be practiced, namely doing noble deeds and avoiding evil deeds that would determine the happiness of mankind in this world and the hereafter. (Regarding the details of what wisdom is, read surahh al-Isra'\/17: 23-39). The Prophet Isa also explained his other duties, namely explaining what was disputed by the Children of Israel. There are disputes related to religious matters, for example regarding whether animals with hoofs and fat from cows and sheep are unclean (al-An'am\/6:146). Prophet Isa came to explain the halalness of all that (Ali 'Imran\/3:50). According to Ibn Jarir, the dispute was about world issues, not about religion. This seems to be related to the division of the Children of Israel into various sects which were always fighting each other. After that Prophet Isa asked them to be pious, namely to do what Allah ordered and stay away from what He prohibited. Piety is a consequence of faith, namely carrying out the values contained in the wisdom above. That is, faith needs to be proven by carrying out these good deeds. And Prophet Isa asked his people to obey him, namely to carry out everything he conveyed and not always dispute religious teachings."
		   },
		   {
			"id": 4389,
			"surah": 43,
			"ayat": 64,
			"tafsir": "The Prophet Isa emphasized the core of the teachings he conveyed, namely that God is only Allah. Allah is the God of all creatures, his God and their God too. The consequence of deifying Allah is worshiping Him and serving Him. Worshiping Allah is doing worship for Him, and serving Him is doing good deeds. So do not worship other than Allah, because that will lead people astray. That is the straight path, namely the right way of life that guarantees happiness in this world and in the hereafter. The \"straight path\" in this verse is monotheism and good deeds. The \"straight path\" in verse 61 is believing in the existence of the hereafter which also requires good deeds. Thus the \"straight path\" in the two verses is the same in essence, because faith in Allah requires humans to believe in the hereafter and do good, and faith in the hereafter also requires humans to believe in Allah and do good."
		   },
		   {
			"id": 4390,
			"surah": 43,
			"ayat": 65,
			"tafsir": "The Children of Israel differed in opinion regarding the Prophet Isa both during his life and after his death. What became the scene of dispute when he was alive were those who accepted him as a prophet and a holy man, some accused him of being the child of an illegitimate relationship committed by his mother. And after he died there were those who saw him as a child of God, or God himself, and there were those who saw him as an ordinary man who was sent as an apostle. The dispute was so sharp that many opposing sects were formed. They are not only divided but also killing (fighting). Those who hold wrong views among these sects have wrong views about Prophet Isa as explained in the verses above, will have an unfortunate fate, namely a painful punishment in hell on the day after."
		   },
		   {
			"id": 4391,
			"surah": 43,
			"ayat": 66,
			"tafsir": "This verse refutes the polytheists of Mecca who misunderstood surahh al-Anbiya'\/21: 98, that those who worship other than Allah will go to hell with their worship later. Prophet Isa is worshiped, therefore, according to them, will also go to hell with those who worship him. Allah has denied this by explaining about Prophet Isa at length in the verses above. Prophet Isa is indeed worshiped, but those who worship him are those who go astray. Therefore Prophet Isa will not go to hell. Those who will go to hell are those who go astray. Likewise the heretical people who worship idols, namely the polytheists of Mecca. They and their idols will go to hell. In this verse it is explained that if the Meccan polytheists still refused to accept such a clear explanation, Allah asked them if they would not regret it. Because doomsday must come, and when it comes it will happen suddenly when they are lulled by worldly pleasures. Before it's too late, Allah here asks them to believe in the Prophet Muhammad and the religion he preached."
		   },
		   {
			"id": 4392,
			"surah": 43,
			"ayat": 67,
			"tafsir": "This verse explains that on the Day of Judgment, friendship and close relations between disbelievers, both friendship relations that occur between them and their relationship with the idols they worship besides Allah; will turn into enmity, and they will accuse one another. A friend accused another friend of being the reason he went to hell and was miserable on that day, while the idols deny the worship that their worshipers did while living in the world because the idols, as inanimate objects, do not know anything about what worshipers have done while living in the world. Each escapes from the accusations of the other. What was mentioned above was revealed by the Prophet Abraham to his people as follows: And he (Ibrahim) said, \"Surely the idols that you worship other than Allah, only to create feelings of affection between you in the life of the world, then on the Day of Judgment some you will deny one another and curse one another; and your return will be hell, and there will be no help for you at all.\" (al-'Ankabut\/29: 25) 'Ali bin Abi Talib said, \"Those who are friends (while in the world) will become enemies between some of them and some others on the Day of Judgment, except those who are pious.\" 'Ali continued, \"There were two believers who were friends, and two unbelievers who were friends. Then one of the two believers died. He was given the good news of going to heaven, so he remembered his friends. He said, \"Yes God, actually the fulan my friend used to invite me to obey You and Your messenger. He invites me to good, and forbids me from bad, and informs me that one day I will meet You. Therefore, O Allah, do not lead him astray after my departure, until You show (Paradise) to him, as You have shown me, until You please him as You please me.\" Then it is said to the believer, \"Go, if you only knew what I have prepared for him by My side, of course you will laugh a lot and cry a little.\" 'Ali continued, \"Then the other believer died, so their souls met. After that, it was said to them, \"Each of you should praise his friend.\" So each of them said, \"(You) are the best brother, friend, and friend.\" And if one of the two disbelievers dies, then he will be informed that he will go to hell. Then he remembered his friend, so he said, \"O Allah, actually this and so friend of mine once invited me to be disobedient to You and Your apostle. He invited me to do evil and forbade me to do good, telling me that I would not meet You. Therefore, O Allah, do not guide him after I left, until You show him something (hell) as You showed me, and be angry with him as You were angry with me.\" Then 'Ali continued, \"then another disbeliever, then their souls met. After that it was said to them, \"Each of you should praise his friend.\" So each of them said, \"(You) are the worst of your brothers.\" , friends and lovers. (History of Ibn Abi Hatim)"
		   },
		   {
			"id": 4393,
			"surah": 43,
			"ayat": 68,
			"tafsir": "In this verse, Allah's statement is explained to those who believe, at the time of the Day of Judgment, when all humans will be in confusion and fear. Allah said to them, \"O My servants, there is nothing for you to fear and worry about on the Day of Judgment, you have all walked the straight path while living in the world and have done everything because of your love for Me and because you seek My pleasure. Therefore, on this day, you are all under My protection and in security assurahnce from Me. O My servants, do not grieve over separation from the world and do not worry about facing life at the future. You should be sure that from now on, you have escaped from all the trials and calamities that will befall you, and at this time you will also occupy the best place that has no equal, namely heaven which has perfect enjoyment. \""
		   },
		   {
			"id": 4394,
			"surah": 43,
			"ayat": 69,
			"tafsir": "In this verse, it is explained about the servants whom Allah calls on that day, namely servants who have believed in His verses, whose souls have submitted and obeyed Him, who carry out all His commands and keep away from prohibitions. -His. In Tafsir Ibn Kathir it is stated that al-Mu'tamir bin Sulaiman from his father said, \"At the time of the Day of Judgment, when humans are resurrected from their graves, no one is not afraid and worried and confused. At that time, a voice was heard,\" O My servants, you have nothing to fear and worry about today and don't worry about your heart.\" After hearing that, all humans hoped that he would be one of the servants of Allah referred to in that call, the second call was heard. , \"O you who believe in Our verses, who submit and submit to Allah.\" Hearing that call, the believers rejoiced and lost their sadness, fear and confusion. While the disbelievers despaired ."
		   },
		   {
			"id": 4395,
			"surah": 43,
			"ayat": 70,
			"tafsir": "Then the next call was heard, \"O you who believe, enter you and your wives into the paradise that was promised to you before, have fun and be happy in it enjoying the gifts of God that have been bestowed upon you all. Because of Allah glorify them by entering them into heaven. In another verse, it is explained that those who believe along with their wives and their believing children and grandchildren will be exalted in heaven, like the degrees of their fathers who are steady and strong in faith. Allah says: And those who believe, along with their children and grandchildren who follow them in faith, We bring them together with their children and grandchildren (in heaven), and We do not reduce their reward in the least (virtue). Everyone is bound by what he does .(ath-thur\/52: 21)"
		   },
		   {
			"id": 4396,
			"surah": 43,
			"ayat": 71,
			"tafsir": "After the believers and their families enter heaven, servants will come to them carrying gold plates filled with delicious food and cups filled with drinks that refresh the body and spirit. In that paradise they get everything they desire, everything that cools and reassures them, everything that is beautiful to their sight and hearing. It is impossible to describe the state of heaven beforehand, because all of this has never had an example or comparison in worldly life. It is also stated that those who believe and do good deeds will live in paradise eternally enjoying the pleasures of life in it."
		   },
		   {
			"id": 4397,
			"surah": 43,
			"ayat": 72,
			"tafsir": "Such is the paradise that will be obtained by those who believe in return for the faith and good deeds they have done. Those who believe and do good deeds enter heaven, solely because of Allah's grace and His grace. Because the believers' faith and deeds are different, they will receive different rewards. People who have the best faith and deeds will be placed in heaven with the highest degree, and those who lack faith and deeds will be placed in heaven with the lowest degrees. Abu Hurairah narrated that the Messenger of Allah said, \"No one but has a place in heaven and a place in hell. So the place of the believer in hell is inherited by the unbeliever, and the place of the unbeliever in heaven is inherited by the believer. .. Thus is meant by the word of God, \"And this is the heaven that is inherited to you . . .\" (History of Ibn Abi Hatim)"
		   },
		   {
			"id": 4398,
			"surah": 43,
			"ayat": 73,
			"tafsir": "This verse explains the various fruits that will be obtained by those who believe in heaven. They will have an innumerable variety of fruits and various flavors. They can eat it at any time, place, and condition they choose."
		   },
		   {
			"id": 4399,
			"surah": 43,
			"ayat": 74,
			"tafsir": "This verse explains that those who deny Allah in the world, carry out prohibitions and disobey Allah's commandments, they will be put into hell, as a reward for their disbelief; they are eternal in it and cannot get out even for a moment. The punishment inflicted on the disbelievers will not be lightened even in the slightest, so that they are constantly in pain and confusion. They were desperate because the request they submitted to Allah so that they would be freed from the punishment was not granted."
		   },
		   {
			"id": 4400,
			"surah": 43,
			"ayat": 75,
			"tafsir": "This verse explains that those who deny Allah in the world, carry out prohibitions and disobey Allah's commandments, they will be put into hell, as a reward for their disbelief; they are eternal in it and cannot get out even for a moment. The punishment inflicted on the disbelievers will not be lightened even in the slightest, so that they are constantly in pain and confusion. They were desperate because the request they submitted to Allah so that they would be freed from the punishment was not granted."
		   },
		   {
			"id": 4401,
			"surah": 43,
			"ayat": 76,
			"tafsir": "In this verse, it is explained why they were overwritten by this punishment, Allah stated, \"We did not intend to persecute the disbelievers by punishing them, because We have given them enough warning during their life in the world, but they did not pay any attention to it. In fact, they denied the messengers We sent to them and persecuted the apostles even though sufficient evidence had been presented to them.Because of their actions, they were punished, this means that they themselves were the ones who wronged themselves."
		   },
		   {
			"id": 4402,
			"surah": 43,
			"ayat": 77,
			"tafsir": "Because of the severity of the torment they suffered, they called the angel Malik, the keeper of hell, so that the angel asked Allah to just kill them, so they were free from the torment, they said, \"O angel Malik, ask Allah to just take their lives. us, so that we are released or no longer feel this torment.\" The angel replied, \"There is no way for you to get out of this hell because Allah has decided that you will stay in hell forever.\" Allah says: And those who disbelieve, for them Hellfire. They were not destroyed until they died, and their punishment was not relieved from them. Thus We repay every person who is very disbelieved. (Fathir\/35: 36) In another verse: And those who are wretched (infidels) will stay away from it, (namely) those who will enter the great fire (hell), then he will not die there and will not (also) live. (al-A'la\/87: 11-13)"
		   },
		   {
			"id": 4403,
			"surah": 43,
			"ayat": 78,
			"tafsir": "To those who are being punished in hell it is said, \"O you disbelievers, verily We have explained all that is true and the straight path by means of our messengers and our books when you were in the world before. But you were not If you accept the truth, you even hate the truth and those who follow the truth. Therefore, woe to yourselves now and regret yourself, when all regrets are useless and repentance is also closed."
		   },
		   {
			"id": 4404,
			"surah": 43,
			"ayat": 79,
			"tafsir": "In this verse, it is explained that the reason why disbelievers are put into hell is because they, while living in the world, have always tried to reject all truth by carrying out various deceptions. So Allah destroyed and thwarted all their deceptions. In another verse, Allah says: And they plotted, and We also plotted, while they were not aware. (an-Naml\/27: 50) Allah's Word: Or do they want to do a trick? But those who disbelieve, it is they who are deceived. (ath-thur\/52: 42)"
		   },
		   {
			"id": 4405,
			"surah": 43,
			"ayat": 80,
			"tafsir": "Narrated by Ibn Jarir that Muhammad bin Ka'ab al-Quradzi said, \"When three people were between the Kaaba and the mosquito net, two people from the Quraysh tribe and one from the Saqafi tribe, then one of them said, \"What do you think, Does Allah hear our conversation?\" The second person replied, \"If you raise your voice, He hears it, but if you whisper, He does not hear it.\" The third person said, \"If He hears, if you raise your voice, surely He will hear too. if you whisper.\" Then this verse was revealed. Seeing the attitudes and actions of the disbelievers while living in the world, it was as if they did not believe that Allah knows everything; then it was said about them. \"Do they think that We do not hear the whispers of whispers of their hearts, and do not know all that they discussed in secret in preparing the deception?\" With this verse Allah confirms by saying, \"We know i everything they plan and hear all their whispers, there is nothing that we do not know, besides that, the angel of hafadzah always writes and records all their behavior in the form of words and deeds. Allah's Word: (Remember) when two angels recorded (his actions), one sat on the right and the other on the left. There is not a single word he utters but there is a guardian angel by his side who is always ready (to take notes). (Qaf\/50: 17-18)"
		   },
		   {
			"id": 4406,
			"surah": 43,
			"ayat": 81,
			"tafsir": "Allah ordered the Prophet Muhammad to say to the polytheists of Mecca, that if ar-Rahman, the Most Gracious God had children and they could prove its truth with strong reasons, then the Prophet Muhammad was the first to acknowledge and glorify- Him, as people glorify the son of a king because he glorifies his father. This opinion is based on the fact that God's child is part of God, therefore the position of his son is the same as His own. The understanding above shows an affirmation that this is very impossible for God. God's Word: If God wanted to take a child, surely He would choose what He wants from what He has created. Blessed be He. He is God Almighty, Almighty. (az-Zumar\/39: 4)"
		   },
		   {
			"id": 4407,
			"surah": 43,
			"ayat": 82,
			"tafsir": "This verse states the sanctity of Allah from the opinion of the polytheists by stating, \"Glory to Allah who owns the heavens and the earth and all that is in them, He has a great Throne, it is impossible for Allah to have a child as they say.\""
		   },
		   {
			"id": 4408,
			"surah": 43,
			"ayat": 83,
			"tafsir": "Because the polytheists did not want to change their false and misguided beliefs, Allah conveyed a message to the Prophet, \"O Muhammad, let those who make lies about Allah by saying that He has children, discuss their lies and let them live happily in disbelief in this world, until the doom that Allah promised to them comes."
		   },
		   {
			"id": 4409,
			"surah": 43,
			"ayat": 84,
			"tafsir": "In this verse, the impossibility of God having children is emphasized again by stating, \"Only He is worshiped by the inhabitants of the heavens and the inhabitants of the earth, only He alone has the right to be worshiped, no one else, because He is God whose actions have wisdom in creating and carrying out something according to its nature, uses and benefits, and only He is also All-Knowing of their condition, both visible and invisible, and He is All-Knowing of all the contents of the human heart.In this verse mentioned the two kinds of attributes of Allah, namely judge and 'alim. If Allah had the qualities of being judge and pious, surely His sons would have those qualities too. However, if you pay attention to the qualities possessed by those who are said to be God's children, it turns out that their characteristics are different from those of God. -Lata, al-Uzza and Manat who were worshiped by the polytheists of Mecca, all of them are inanimate objects that cannot do or know anything. Likewise, the Prophet Isa is believed to be the son of God by Christians, even though Christians themselves admit that Jesus sometimes does not know and has no wisdom in carrying out all his actions. Wasn't Jesus ever weeping when he heard the news of the killing of an innocent person so he asked his followers to show them the graves of those who were killed. Such a trait is certainly not natural for someone who is believed to be the son of God."
		   },
		   {
			"id": 4410,
			"surah": 43,
			"ayat": 85,
			"tafsir": "Glory be to Allah who owns and controls the kingdom of the heavens and the earth and all its contents, and other realms whose nature and circumstances are unknown or unknown. He is the one who has the knowledge of the Day of Judgment. No one knows when the Day of Judgment will occur. To Him all things return, then He repays all human deeds with the appropriate reward."
		   },
		   {
			"id": 4411,
			"surah": 43,
			"ayat": 86,
			"tafsir": "This verse explains that all idols and gods are worshiped by polytheists to get their intercession, even though these idols have no power to act and do not own anything, even they themselves are controlled and owned by their worshippers. Is it possible for them to intercede in such circumstances? As for those who pronounce the sentence of monotheism, understand and believe in it, he walks according to Allah's instructions, like the angels, Prophet Isa, then their intercession is beneficial with Allah, and Allah will give intercession to those who deserve it. Sa'id bin Jubair said, \"The meaning of this verse is: the idols do not intercede in the slightest, the only ones who can intercede are those who acknowledge the truth, believe in Allah based on learned knowledge, and far-sightedness."
		   },
		   {
			"id": 4412,
			"surah": 43,
			"ayat": 87,
			"tafsir": "In this verse it is explained that the words and deeds of the polytheists contradict each other. If asked to them, who created all these creatures, then they answer and admit, \"Only Allah created it, not associated with anyone.\" They are unable to refute that fact, but their deeds and actions prove that they are partners with Allah. Why do those polytheists turn away so that they worship other than Allah or only worship Allah according to their confession. This shows their stupidity."
		   },
		   {
			"id": 4413,
			"surah": 43,
			"ayat": 88,
			"tafsir": "Muhammad saw said, \"O my Lord, in fact the people I call to follow your teachings according to your orders are people whose hearts have been locked so they don't want to believe.\" , you (Muhammad) warn or you do not warn, they will not believe. (al-Baqarah\/2: 6)"
		   },
		   {
			"id": 4414,
			"surah": 43,
			"ayat": 89,
			"tafsir": "After Allah heard the words of the Messenger of Allah, He said, \"O Muhammad, turn your back on them, do not despair because of their arrogance to believe, do not entertain their bad words, and actions that humiliate you and your followers, forgive them, later they will admit their mistakes and feel the consequences of their disbelief.\" This verse is Allah's promise to the Muslims, and He kept that promise, by conquering the city of Mecca. This event caused people to convert to Islam in droves. Then spread the religion of Islam to all corners of the world in a short time. Allah says: When Allah's help and victory has come, and you see people flocking to Allah's religion, then glorify your Lord and ask His forgiveness. Truly, He is the Acceptor of repentance. (an-Nasr\/110: 1-3)"
		   }
	]
}
