{
	"tafseer": [
		{
			"id": 4219,
			"surah": 41,
			"ayat": 1,
			"tafsir": "An explanation of the meaning of \"ha Mim\" can be seen in the Qur'an and its Tafsir volume I, regarding the explanation of the meaning of fawatih as-suwar."
		   },
		   {
			"id": 4220,
			"surah": 41,
			"ayat": 2,
			"tafsir": "This verse explains that the Qur'an comes from Allah, the Most Gracious, the Most Merciful, revealed to His Messenger, Muhammad saw, through the angel Gabriel. In this verse it is said that the Qur'an comes from Allah, the Most Gracious, the Most Merciful. This statement implies that the Qur'an was revealed to humans as a sign that Allah is Most Gracious and Most Compassionate to His servants. Al-Qur'an for humans can be likened to a medicine for sick people to cure their illness. Humans really want the happiness of life in this world and the hereafter. They do not know the path to be taken to achieve that desire. Because of the nature of the Most Gracious and Most Merciful to His servants, Allah sends down instructions to the intended path so that humans achieve their desires. These instructions are found in the Qur'an which He revealed to the Prophet Muhammad. Allah said: And We did not send you (Muhammad) but to (become) a mercy to all the worlds. (al-Anbiya'\/21: 107) The meaning of the statement that the Prophet Muhammad was sent to the world as a mercy to the universe is that Allah sent him to convey Allah's religion to mankind. Allah's religion is a mercy for humans, and the main points of Allah's religion are found in the Qur'an. So what is the main blessing is the Qur'an. Allah's Word: And indeed, this (Qur'an) was truly sent down by the Lord of the worlds, brought down by Ar-Ruh Al-Amin (Gabriel), into your heart (Muhammad) so that you may be among those who warn , in clear Arabic. And indeed, (the Qur'an) is (mentioned) in the books of the former. (asy-Syu'ara'\/26: 192-197)"
		   },
		   {
			"id": 4221,
			"surah": 41,
			"ayat": 3,
			"tafsir": "The Qur'an which was revealed to the Prophet Muhammad consists of verses. The verses are explained one by one clearly. Each verse is separated from other verses, with clear signs as well. There is a beginning and an end to each surah. It contains various instructions, some relating to lessons, advice, noble morals, purifying the soul, stories of the former apostles with their followers, instructions to the path of happiness in life in this world and the hereafter, and so on. Allah says: (This is) the Book whose verses are neatly arranged and then explained in detail, (which was revealed) from (Allah) the Most Wise, the Most Observant. (Hud\/11: 1) It was also explained that the Al-Qur'an was revealed in Arabic, the mother tongue of the messenger who delivered it and in accordance with the language used by the nation that first received it. Thus, the Qur'an is easy for them to understand its content and meaning and it is also easy for them to convey it to other nations around the world, whose mother tongue is not Arabic. Allah said: And We did not send any messenger, except in the language of his people, so that he could explain to them. (Ibrahim\/14: 4) At the end of this verse it is explained that the Qur'an is beneficial for those who know and understand it. The point is that the Al-Qur'an will be useful for people who are knowledgeable, want to seek the ultimate truth, and want to get the correct instructions that can lead to happiness in this world and the hereafter. They study the Qur'an, compare it with other teachings and absorb its teachings with the knowledge they already have. They are the ones who can understand and explore the secrets and instructions of the Qur'an. From this understanding, it can be understood that people who have a disease in their hearts do not want to seek the truth, because they are already bound by the religion or belief that they previously adhered to. Likewise, people who follow their own desires, are fanatical towards groups, or prioritize rank and position, will not be able to delve into and understand the contents of the Qur'an, let alone receive guidance from it. Some commentators interpret this verse by saying that the Qur'an will be understood by people who know Arabic, because Arabic is the language that is the most extensive, complete, and deep in its meaning, and easily influences the soul. At that time the Arabs knew the language well, many of them became linguists, famous writers, and many became poets. The Arabic language of the Qur'an is an Arabic language which has a very high value, both in style and in grammar. Therefore, the only person who can understand its verses is someone who has a deep knowledge of Arabic."
		   },
		   {
			"id": 4222,
			"surah": 41,
			"ayat": 4,
			"tafsir": "This verse explains that the Qur'an brings good news to those who practice His instructions. He also brings frightening news to those who deny him. People who follow the instructions will get the pleasures of life in this world and will be entered into a paradise full of pleasures in the hereafter. Meanwhile, people who deny it and deny its verses will get unlimited misery in the hereafter. Even though this is the purpose and content of the Qur'an, polytheists still ignore it, they even boast about it, don't want to listen to it, let alone follow its instructions."
		   },
		   {
			"id": 4223,
			"surah": 41,
			"ayat": 5,
			"tafsir": "This verse mentions the causes of polytheists denying and belittling the verses of the Qur'an, namely: 1. They claim that their hearts are closed, they cannot be entered by calls to faith, carry out the instructions of the Al-Qur'an , and what Muhammad said. 2. They claimed that their ears were clogged so that they could not hear Muhammad's call and the verses of the Qur'an that were recited to him. 3. They say that between them and the Muslims there is a wall of separation that prevents them from accepting this call. Some commentators are of the opinion that what this verse explains is a description of the condition of polytheists whose souls and hearts can no longer understand the Prophet's call and do not want to follow the instructions of the Qur'an. Their hearts are likened to objects lying in a closed place, their ears are likened to the ears of deaf people who cannot hear anything, and their condition is likened to people who stand beside a thick and high wall, so they do not know what is going on behind them. that wall. Because the calls did not benefit the polytheists in the least, they were told to do whatever they wanted, including trying to trick, torture and harm the believers, turn people away from Muhammad, and destroy Islam and the Muslims. However, Allah will protect the Muslims from their actions."
		   },
		   {
			"id": 4224,
			"surah": 41,
			"ayat": 6,
			"tafsir": "Hearing the reasons put forward by the polytheists in the past verses, Allah ordered the Messenger of Allah to answer their words by saying that the prophet is an ordinary human being who is no different from them, it's just that he received a revelation that the God who has the right to be worshiped is God. Almighty. Therefore, they are ordered to worship only Him, are prohibited from associating partners with Him, and ask forgiveness for the sins they have committed. At the end of this verse, Allah confirms that great losses and tribulations will be experienced by those who associate partners with God. They will remain in hell in the afterlife."
		   },
		   {
			"id": 4225,
			"surah": 41,
			"ayat": 7,
			"tafsir": "What is meant by people who associate partners with Allah in the verse above are people who do not pay zakat and people who deny the existence of the Last Day. Zakat was obligatory in the Medina period and these verses are included in the Makkiyyah (verses revealed before the migration to Medina). Therefore, what is meant by zakat is to purify the soul from shirk and stinginess. Ibn 'Abbas explained that the meaning of la yu'tuna az-zakah (not paying zakat) is not testifying that there is no god but Allah. That is zakat al-anfus (purification of the soul) because this surahh is included in the Makkiyyah surahh and zakat is obligatory in Medina. Some commentators are of the opinion that the Meccan infidels like to spend and feed the pilgrims. But they did not give it to the Prophet Muhammad and the believers. Then come down this verse."
		   },
		   {
			"id": 4226,
			"surah": 41,
			"ayat": 8,
			"tafsir": "This verse explains God's promise to those who believe. All those who believe in Allah and His Messenger, carry out Allah's commandments, and stay away from His prohibitions will receive the best and uninterrupted reward from Allah. That is the best revenge, namely the revenge given to those who do good deeds. According to as-Suddi, this verse was revealed to relate to sick people who can no longer be expected to recover, people who are very old, so that they can no longer do good deeds like they did when they were young, but they still have high spirits and want to do good deeds as expected. ever did. Against such a person, Allah gives a reward like the reward given to people who are able to do that deed."
		   },
		   {
			"id": 4227,
			"surah": 41,
			"ayat": 9,
			"tafsir": "Allah ordered the Prophet Muhammad to ask the polytheists of Mecca why they denied Allah who had created the earth in two days. Why do they worship other gods besides worshiping Allah? Whereas Allah is Holy of all things. Some commentators are of the opinion that what is meant by making the earth in this verse is to create its form, and what is meant by \"day or time\" in this verse is time, because day and night did not exist when the heavens and earth were created. The meaning of the formation of the earth within two days, can be scientifically interpreted that the formation of this earth occurred in two periods or two periods. The first day was a time when around 4.6 billion ago, clouds of dust and gas floating in space began to shrink (see explanation in al-A.'raf\/7: 54 regarding the formation of the heavens and the earth in six periods). The material at the center of the cloud collects to form the sun and the remaining gas and dust flattens out to form a disk around the sun. Then the dust grains in the cloud stick together and form planetesimals which then collide with each other to form planets, one of which is the earth. The second day begins when the heating process due to radioactive decay causes the proto-earth to melt, and heavy materials such as iron sink to the center of the earth while light materials such as water and carbon dioxide move out. Planet earth then cooled and about 2.5 billion years ago the earth looked like what we see today. The question posed to the polytheists in this verse is not intended to ask, but to denounce their acts of worshiping idols. It was as if they were being told that didn't they already know for certain that the idols they worshiped were made of stone that couldn't do anything, they even made the idols themselves, why did they worship like that. If they want to serve themselves, then serve those who created the earth in two times and who determines everything. The God they have the right to worship is Allah who creates, controls, regulates, maintains continuity of existence, and determines the end of this universe, not the idols they worship."
		   },
		   {
			"id": 4228,
			"surah": 41,
			"ayat": 10,
			"tafsir": "This verse explains the beauty of creation and the laws that apply to the earth. He has made the mountains on the surface of the earth, some high and some medium, some just plateaus, some are fiery, and mountains are pegs or nails of the earth. With the mountains, the surface of the earth becomes beautiful, some are high and some are low. The mountain plants are also different from the plants in the lowlands as well as the animals. With the mountains, there are rivers that flow from the highlands to the lowlands, and finally empty into the sea. It is as if the mountain is a reservoir of water that constantly flows to meet human needs. Furthermore, Allah explained that He created this earth as a place full of blessings for humans, and full of beauty. The earth is also equipped with all kinds of needs needed by humans for their survival and the needs of other creatures. From the air that is sucked in at any time, the food that is needed, places that are cool and comfortable, the vast ocean, minerals buried in the ground and many other favors that He provides, which are of countless kinds and numbers. He is also the one who has determined the size and content of everything. Provide food that can be satiating according to the condition of animals or humans who need it. For humans provided rice, wheat, and so on. For livestock He provides grass and so on. How many people there are, how many fish in the sea, how many birds fly, the animals that live in the jungle, all of them are provided by Allah for their sustenance and necessities of life, according to their individual circumstances. Allah explained that He created the earth and the mountains on it in two periods and created the necessities, food and so on in two periods as well. Everything is done in four times. Within those four periods, everything and the foundations of everything that existed in this world were created, according to the period and circumstances in its further development. The scientific tafsir of the four days may be reflected in four periods of geological time, namely: the Proterozoic, where life was still very unclear; The Paleozoic, in which life began to clearly be marked, among others, by amphibians, reptiles, large fish and ferns; Mesozoic, medieval life marked by an abundance of vegetation and sea animals, including marine animals, dragons, broadleaf trees; and the Cenozoic, new life, which was marked by much of the Cenozoic life being extinct. The Cenozoic era was marked by the appearance of elephants, and trees grew, and most importantly, humans appeared."
		   },
		   {
			"id": 4229,
			"surah": 41,
			"ayat": 11,
			"tafsir": "In this verse Allah describes the state of the sky. After Allah created the earth He headed to the sky, at that time the sky was in the form of smoke. What is the condition of the smoke and what is its essence, only Allah knows it. Even though there are those who have tried to explain the state of the smoke in question, both those put forward by the Jewish priests, as well as by experts who have tried to investigate it, there is no definite information explaining the circumstances and nature of the smoke. According to scientific theory, the verse above describes the beginning of the universe. This event was marked by the occurrence of an event that scientists call the Big Bang. This event is very clearly seen in surahh al-Anbiya '\/21 verse 30 whose fragment reads thus: \"....that the heavens and the earth were both one solid, then We separated...\" . Modern cosmology, both from observation and theory, clearly indicates that at one time, the entire universe consisted of nothing but clouds of \"smoke\" consisting of a dense and very hot gaseous composition. This collection is made up of a large number of interconnected atomic forces and is under intense pressure. The radius of this spherical collection is estimated at about 5 million kilometers. The first liquid atoms were in the form of a violent explosion (which is commonly called the Big Bang), and resulted in the formation and scattering of various celestial bodies. This has become a principle that has been tested and is the basis of modern cosmology. With the advancement of science, researchers are now able to witness the \"birth\" of stars using very sophisticated telescopes. The theory regarding the formation of \"smoke\" as the origin of a star, has also been mentioned in surahh Fushshilat\/41: 11 above. Because the earth and the sky above it (the sun, moon, stars, planets, galaxies, and so on) were formed from the same \"smoke\", experts concluded that the earth and the contents of the sky were all one entity before. From this same \"smoke\" material, then they separate from each other. This has also been disclosed by the Qur'an in surahh al-Anbiya'\/21: 30 mentioned above. In this verse, it is as if Allah explained that the earth was first created from the sky with everything in it, including the sun, moon and stars. Another verse explains that Allah created the heavens before creating the earth. Therefore, there are some commentators who try to compromise these two verses. According to them, in planning, God first planned the earth and everything in it. However, in practice, God created the sky and everything in it first, then after that just created the earth and everything in it. After finishing creating the heavens and the earth and everything in them, Allah ordered them both to come to Him, either happy or forced. Heaven and earth say that they will come submissively and obediently. Then Allah commanded the sky, \"Pay attention to your sunshine, your moonlight, the sparkling light of the animals and stars, blow your wind, circulate your clouds, so that it can rain.\" God also said to the earth, \"Make your rivers flow, and grow your plants and trees.\" Both of them replied, \"We fulfill all your commands obediently and obediently.\" Some interpreters interpret \"come both of you according to My orders willingly or forcedly\" to \"be both of you according to My Sunnah that I have established, do not deviate in the slightest from My provisions, follow the processes of your events according to the time specified. has been determined.\" In other words, it can be understood that God commands the heavens and the earth to perfect their events according to predetermined provisions, just as the earth will be created in due time, so will mountains, water, air, animals, humans, and plants. Everything will happen at His appointed time, nothing deviates from His provisions. From this verse it can be understood that the events of the heavens and the earth, starting from their occurrence to the form that exists now, go through certain processes in accordance with the sunna of Allah. Everything that exists on earth and in the heavens will exist in due time, and will disappear or be destroyed at the same time, according to the condition of the heavens and the earth at that time."
		   },
		   {
			"id": 4230,
			"surah": 41,
			"ayat": 12,
			"tafsir": "This verse explains that Allah perfected the occurrence of the heavens by making seven heavens in two periods. Thus, the length of time God planned the creation of the heavens and the earth was for six times. Allah's Word: Indeed, your Lord (is) Allah who created the heavens and the earth in six times. (al-A'raf\/7: 54) It was also explained that Allah adorns the sky with sparkling stars. There are stars that shine by themselves and some that receive the reflection of light from other stars. Therefore, the light of the stars looks unequal. The dissimilarity of the light of the stars creates an incomparable beauty. Allah makes in every heaven something that is needed, according to His wisdom and Sunnah. It's like giving each planet a pull and making it run in its orbit, so the planets don't fall and collide with one another. For each planet, certain tasks are assigned according to their circumstances and characteristics, such as the duties of the moon are not the same as those of the sun, because the events of the two are different. Everything described is a creation of Allah, God Almighty, and they must submit to His decrees. Nothing in Allah's creation deviates from His decree. He knows the conditions of the creatures He created, both subtle and gross, both manifest and hidden."
		   },
		   {
			"id": 4231,
			"surah": 41,
			"ayat": 13,
			"tafsir": "This verse explains Allah's command to the Prophet Muhammad to call on unbelievers to believe in Allah who created the heavens and the earth and what is in them. If they did not accept the invitation and turned away, the Prophet was ordered to remind them of the punishment that Allah would inflict on everyone who disobeyed Him. Among the punishments that have been inflicted on those who deny is a loud sound that thunders from the sky and destroys everything it hits, as has been inflicted on the people of 'Ad, the people of Samud, the people of Aikah, and so on. The catastrophe befell them because they denied the call of the apostle sent to them and ignored the warnings of the apostles. The Prophet added that if they do not want such a calamity to befall them, then follow his call and worship only Allah, God Almighty, and not associate anything with Him. The polytheists responded to the call of the Prophet with arrogance and arrogance. They deny it by saying that if Allah wanted to send messengers to humans, surely He would not have sent humans like the Prophet Muhammad. However, Allah will send people who have advantages over ordinary humans, have supernatural powers, are able to grant directly everything that is asked of those they call, such as angels, jinn and so on. According to them, an apostle raised from an ordinary human being would not be able to accept the requests of the people he called for because he did not have any advantages. Meanwhile, according to them, God has not wanted to send the apostle. That is why they deny the apostleship of the Prophet Muhammad. Narrated by al-Baihaqi in the book \"Ad-Dalail\" and Ibn Asakir from Jabir bin 'Abdullah. He said that Abu Jahl and the leaders of the Quraysh said, \"In fact it is not clear to us what was conveyed by Muhammad, if you find a magician, sorcery, and poetry, then let him talk to him, and come to us to explain the intentions what Muhammad said.\" 'Utbah bin Rabi'ah said, \"By Allah, I really have heard of magic, sorcery, and poetry. I really understand your clan, O Muhammad, is the best person in Abdul Muttalib's family?\" Muhammad did not answer. 'Utbah said again, \"Why do you criticize our gods and consider us heretical? If you want women, choose ten of the most beautiful women you want from the Quraysh tribe. If you want wealth, we collect the treasure according to what you need.\" After the Prophet heard the words of 'Utbah, he read this surahh Fushshilat from the beginning of the verse to this verse, which describes the havoc that had befallen the people of 'Ad, and Samud. Hearing the verse recited by Rasulullah saw, Utbah remained silent, then returned to his house, not directly to his people. When his people saw 'Utbah in this state, they said that 'Utbah had been charmed by Muhammad. Then they looked for 'Utbah and said to him, \"O 'Utbah, you did not come to us it is because you have been enchanted.\" So 'Utbah was angry and vowed never to talk to Muhammad again, then he said, \"By Allah, I really spoke to him, then he answered with one answer which in my opinion was not poetry, not magic, nor divination.\" . When he came to the words: lightning that seemed to hit the people of 'Ad and Samud, I was speechless. I really know that Muhammad, when he said something, he was not lying, and he was afraid of the punishment that would befall it .\" As it is known that 'Utbah was a Quraysh leader and a knowledgeable person among them. Apart from being a writer, he also knew the ins and outs of magic and sorcery that people believed in at that time. 'Utbah's silence showed that his heart had faith in the Prophet, but because of the influence of lust and position, he denied his conscience. This is also the case with most polytheists. His heart had faith and he was afraid of the punishment that would befall him if he did not believe, but they still did not believe for fear of being ostracized by his people. Therefore, they are looking for reasons to cover their hearts by saying that it is impossible for Allah to appoint an apostle from ordinary people. If Allah appoints an apostle, of course the apostle is from the angels."
		   },
		   {
			"id": 4232,
			"surah": 41,
			"ayat": 14,
			"tafsir": "This verse explains Allah's command to the Prophet Muhammad to call on unbelievers to believe in Allah who created the heavens and the earth and what is in them. If they did not accept the invitation and turned away, the Prophet was ordered to remind them of the punishment that Allah would inflict on everyone who disobeyed Him. Among the punishments that have been inflicted on those who deny is a loud sound that thunders from the sky and destroys everything it hits, as has been inflicted on the people of 'Ad, the people of Samud, the people of Aikah, and so on. The catastrophe befell them because they denied the call of the apostle sent to them and ignored the warnings of the apostles. The Prophet added that if they do not want such a calamity to befall them, then follow his call and worship only Allah, God Almighty, and not associate anything with Him. The polytheists responded to the call of the Prophet with arrogance and arrogance. They deny it by saying that if Allah wanted to send messengers to humans, surely He would not have sent humans like the Prophet Muhammad. However, Allah will send people who have advantages over ordinary humans, have supernatural powers, are able to grant directly everything that is asked of those they call, such as angels, jinn and so on. According to them, an apostle raised from an ordinary human being would not be able to accept the requests of the people he called for because he did not have any advantages. Meanwhile, according to them, God has not wanted to send the apostle. That is why they deny the apostleship of the Prophet Muhammad. Narrated by al-Baihaqi in the book \"Ad-Dalail\" and Ibn Asakir from Jabir bin 'Abdullah. He said that Abu Jahl and the leaders of the Quraysh said, \"In fact it is not clear to us what was conveyed by Muhammad, if you find a magician, sorcery, and poetry, then let him talk to him, and come to us to explain the intentions what Muhammad said.\" 'Utbah bin Rabi'ah said, \"By Allah, I really have heard of magic, sorcery, and poetry. I really understand your clan, O Muhammad, is the best person in Abdul Muttalib's family?\" Muhammad did not answer. 'Utbah said again, \"Why do you criticize our gods and consider us heretical? If you want women, choose ten of the most beautiful women you want from the Quraysh tribe. If you want wealth, we collect the treasure according to what you need.\" After the Prophet heard the words of 'Utbah, he read this surahh Fushshilat from the beginning of the verse to this verse, which describes the havoc that had befallen the people of 'Ad, and Samud. Hearing the verse recited by Rasulullah saw, Utbah remained silent, then returned to his house, not directly to his people. When his people saw 'Utbah in this state, they said that 'Utbah had been charmed by Muhammad. Then they looked for 'Utbah and said to him, \"O 'Utbah, you did not come to us it is because you have been enchanted.\" So 'Utbah was angry and vowed never to talk to Muhammad again, then he said, \"By Allah, I really spoke to him, then he answered with one answer which in my opinion was not poetry, not magic, nor divination.\" . When he came to the words: lightning that seemed to hit the people of 'Ad and Samud, I was speechless. I really know that Muhammad, when he said something, he was not lying, and he was afraid of the punishment that would befall it .\" As it is known that 'Utbah was a Quraysh leader and a knowledgeable person among them. Apart from being a writer, he also knew the ins and outs of magic and sorcery that people believed in at that time. 'Utbah's silence showed that his heart had faith in the Prophet, but because of the influence of lust and position, he denied his conscience. This is also the case with most polytheists. His heart had faith and he was afraid of the punishment that would befall him if he did not believe, but they still did not believe for fear of being ostracized by his people. Therefore, they are looking for reasons to cover their hearts by saying that it is impossible for Allah to appoint an apostle from ordinary people. If Allah appoints an apostle, of course the apostle is from the angels."
		   },
		   {
			"id": 4233,
			"surah": 41,
			"ayat": 15,
			"tafsir": "In this verse, Allah explains the condition of the 'Ad people who have been afflicted by Allah's punishment and their attitude towards the call of the messenger who was sent to them. It was explained that the people of 'Ad were arrogant, felt that they had no equal, and all submitted to him. Therefore, they were disobedient to God who had created and bestowed gifts upon them, and did not accept the call of Allah's messenger sent to them. They challenge who can match them. Allah threatens and warns them by saying have they really thought about what they are saying, and do they not know who they are talking about? What they are against is Allah Almighty, who created everything including themselves, the Almighty, who is stronger than them. If Allah wills, then He can bring any calamity upon them and they will not be able to escape it in the slightest. They actually already know and believe in the proofs of Our greatness and power, which were conveyed by the apostles who were sent to them. However, they denied it and disobeyed the apostles."
		   },
		   {
			"id": 4234,
			"surah": 41,
			"ayat": 16,
			"tafsir": "In this verse Allah explains the form of punishment that befell the people of 'Ad. He blew out an extremely cold gale accompanied by a roar that annihilated them. A very cold strong wind that continuously hit them for seven nights and eight days, which was an unlucky day for them, as explained in the word of Allah: As for the people of 'Ad, they were destroyed by a very cold hurricane, Allah sent the winds it was to them for seven nights and eight continuous days; then you see the people of 'Ad at that time dead lying like the trunks of date palms that have been empty (rotted). (al-haqqah\/69: 6-7) It is explained in this verse that the purpose of Allah inflicted this terrible doom on the people of 'Ad so that they feel the consequences of being arrogant and arrogant towards Allah and the messengers sent to them, namely humiliation, humility , and the calamities that befell them in earthly life. While the torment of the hereafter is more terrible and very humiliating for them. They will not find a helper who can free them from this punishment."
		   },
		   {
			"id": 4235,
			"surah": 41,
			"ayat": 17,
			"tafsir": "To the Samud people, Allah has conveyed His religion through the intercession of Prophet Saleh. Allah has shown them the way of salvation and the straight path, by showing the signs of His greatness and power which are in this vast horizon. Allah also teaches them laws that can make them happy in this world and the hereafter. However, they prioritize disbelief over faith which also means they prioritize humiliation and misery rather than glory and happiness. Because of their attitudes and actions, Allah sent down upon them the punishment in the form of a loud thundering sound from the sky. In another verse, Allah explains the punishment that befell the Samud people. Allah says: Then a thunderous voice fell on the unjust people, so that they died in their homes. It was as if they had never lived in that place. Remember, the Samud people denied their God. Remember, the Samud people perished. (Hud\/11:67-68)"
		   },
		   {
			"id": 4236,
			"surah": 41,
			"ayat": 18,
			"tafsir": "Prophet Saleh and the believers were saved by Allah from that doom. They were not struck by the catastrophe and terrible calamity because of their faith and piety in Him."
		   },
		   {
			"id": 4237,
			"surah": 41,
			"ayat": 19,
			"tafsir": "This verse explains Allah's command to the Prophet Muhammad to convey to those who deny their condition on the Day of Judgment. On that day, all the enemies of Allah and those who disbelieved in Him will be gathered in hell. They were driven into it like people herding and driving livestock. No one escapes and is left behind among them."
		   },
		   {
			"id": 4238,
			"surah": 41,
			"ayat": 20,
			"tafsir": "When they reach the edge of hell, they are asked about the deeds they have done while living on earth. As witnesses to the deeds they have done are all the members of their bodies that directly commit these sinful acts, such as their ears, eyes and members of their bodies. Each creature is asked according to its circumstances and characteristics. What was asked and how the creatures answered, including the occult knowledge, only Allah himself knows. There may be questions related to his intentions and feelings, or about his actions. If those questions about obedience to worship, good manners, friendly relations, good deeds, and the like are asked to people who like to do those things while living in the world, of course those people will answer them with joy to Allah. If bad manners, breaking friendship relationships, evil deeds, and other similar actions, are confronted with those who do them, they will surely respond with trembling and fear. Allah is All-Knowing about that."
		   },
		   {
			"id": 4239,
			"surah": 41,
			"ayat": 21,
			"tafsir": "When they hear and see that their own skin bears witness to their deeds, the disbelievers criticize their skin by saying, \"Why are you a witness against us, when you are the one who helped and encouraged us to commit immorality while living in the world?\" Their skins answered, \"Almighty Allah has made us eloquent, so that we can explain clearly and completely everything that you ever commanded us to do.\" Allah's Word: On this day We shut their mouths; their hands will speak to Us and their feet will testify to what they used to do. (Yasin\/36: 65) Regarding this question and testimony in the afterlife, it is explained in the hadith of the Prophet PBUH which was narrated from Anas bin Malik, he said: When we were with Rasulullah SAW, he laughed and said, \"Do you know why I laugh?\" We replied, \"Allah and His Messenger know better.\" He said, \"I laughed because of a servant's conversation with God (on the Day of Judgment). The servant said, \"O my Lord, did you not protect me from tyranny?\" The Messenger of Allah said, \"God said, 'True.' The Messenger of Allah said, \"That servant said, 'So I do not allow myself to be except a witness from myself.\" The Messenger of Allah said, \"Allah said, 'It is enough for yourself to be a witness for your own deeds this day, and the witness of the angel who recorded it.\" The Messenger of Allah said, \"Then shut your mouth that person and it was said to his limbs, 'Speak, then the limbs will explain what he has done.\" The Messenger of Allah said, \"Then let that person speak to their limbs.\" The Prophet said, \"Then the servant said (to his limbs) ), 'Woe and ruin you all. I am fighting to defend you.\" (History of Muslim and Ibn Hibban) Allah explains that He is the One who created humans in the first time, from nothing to nothing, and He also made clear arguments for them. If Allah is able to create humans the first time, of course He is also able to repeat the creation the second time, by resurrecting humans after death, then He repays all human actions fairly."
		   },
		   {
			"id": 4240,
			"surah": 41,
			"ayat": 22,
			"tafsir": "Narrated from al-Bukhari and Muslim along with other priests from Ibn Mas'ud he said, \"When I was hiding behind the curtain of the Kaaba, then three people came: a Quraysh and two Bani saqif, or a Bani saqif and two Quraysh, very little knowledge and very distended their bellies, they said words that I had never heard. So one of them said, 'Do you think that Allah hears our words? us, He will hear it, and if we do not amplify it, He will not hear it. Then another said, 'If He hears something from it, He will surely hear it all.\" So Ibn Mas'ud conveyed this to the Prophet, so Allah revealed this verse to His words: mi nal khasirin. This verse explains that man cannot hide and keep secret his heinous deeds, even though he commits disobedience, crime and disbelief openly and denies the Day of Resurrection and Allah's vengeance. In fact, he thought that when he hid his actions from humans, Allah did not know what they were doing. Therefore, he would not be able to punish and recompense. This verse warns believers to always be vigilant and think carefully about the actions they are going to do, because Allah knows everything they do, nothing is hidden from Him."
		   },
		   {
			"id": 4241,
			"surah": 41,
			"ayat": 23,
			"tafsir": "The allegation of disbelievers that Allah does not know and does not see the bad deeds he has done is a bad assumption. Such suspicion will give rise to the courage to commit forbidden acts, resulting in self-harm. As a result of such assumptions, they will receive loss and humiliation in this world and a painful punishment in the hereafter. From this verse, it can be understood that a good thought is to believe that Allah knows all the deeds of His servants from the subtle to the great, from what is seen to what is hidden, and Allah knows all that is in their hearts. If someone has believed in this way, then he always examines everything he will do, which one is pleasing to Allah and which is not pleasing to Him. He will stop and distance himself from all actions that are not pleasing to Allah, because he is sure that Allah sees and knows all of his actions. Narrated by Ahmad, Muslim, Abu Dawud., and Ibn Majah from Jabir bin 'Abdullah: The Messenger of Allah said, \"You should never die unless you have good thoughts on Allah. (History of Ahmad, Muslim, Abu Dawud, and Ibn Majah) Scholars are of the opinion that there are two kinds of assumptions: first, good assumptions, namely thinking that Allah has mercy, virtue, and goodness that He will bestow upon humans, as mentioned in the hadith Qudsi: Allah says, \"I follow the assumptions of My servant to Me.\" (Muslim history from Anas) Second, the bad assumption, that is thinking that Allah does not know all the actions of His servants. According to Qatadah, there are two kinds of suspicion, namely: first, the assumption that saves as explained the word of Allah: Verily, I am sure that (one day) I will receive an account against myself. (al-haqqah\/69: 20) And the word of Allah: (That is) those who believe, that they will meet their Lord, and that they will back to Him. (al-Baqarah\/2: 46) Second, destructive suspicion, as explained in this word of God. Umar bin Khaththab said about this verse, \"They are people who continue to commit immorality, do not repent of their actions, and they argue about God's forgiveness, so they leave the world with nothing.\" Then Umar read this verse. Al-Hasan al-Bashri said, \"Indeed, a people were deceived by their empty wishful thinking so that they died, and they did not have any good. One of them said, 'Truly I am kind to my Lord. Indeed he has lie. If the thought is good, of course the deeds are good too.\" Then Al-Hasan al-Bashri read this verse."
		   },
		   {
			"id": 4242,
			"surah": 41,
			"ayat": 24,
			"tafsir": "In this verse, Allah explains the condition of those who have prejudice against Allah, that is, they will be put into hell. Everything is put into hell without exception and hell is where they return. If among them there are those who ask for a postponement of their punishment or ask Allah's forgiveness and are willing to return to the world if Allah gives them a chance, then all of them will not be granted. Their wish was impossible to grant because they had left the world. The place to do charity and this world has been destroyed, while the hereafter is not a place to do charity, but a place to receive the results of one's charity while living in this world."
		   },
		   {
			"id": 4243,
			"surah": 41,
			"ayat": 25,
			"tafsir": "Allah explains that He has prepared for the disbelievers friends and helpers in the form of demons from the group of jinns and humans. They consider worldly actions that lead to misguidance and disbelief to be good, such as indulging in lust, like to collect wealth solely for their own sake, crazy for power, doing immoral and forbidden acts and so on. This is the case with matters of the hereafter, the demons have instilled belief in the human heart that there is no heaven or hell, no life after death, no resurrection and reckoning, no God to be worshipped, and so on. Therefore, it is easy for them to do what they want and do forbidden things. Allah's Word: And whoever turns away from the teachings of Allah, the Most Compassionate (Al-Qur'an), We let Satan (mislead him) and become his close friend. And indeed, they (the devils) really hindered them from the right path, while they thought that they were being guided. (az-Zukhruf\/43: 36-37) Because of their attitudes and actions, a punishment was decreed for them, like the punishment that had been inflicted on ancient nations, who had followed Satan's tricks. All of them, namely the devils and their followers, suffer loss and destruction together. They will both receive a painful punishment in the hereafter because they are both self-defeating people."
		   },
		   {
			"id": 4244,
			"surah": 41,
			"ayat": 26,
			"tafsir": "Those who disbelieve and deny Allah and His Messenger say to their people, \"Never listen to the verses of the Qur'an recited by Muhammad, do not pay attention to and meditate on their contents. You should try to disturb your hearing. those who heard it, as if by singing, cheering. With your attitude like this, hopefully those who hear it, will not clearly understand the recitation of the Qur'an that they heard.\" In the past, when the Prophet was still in Mecca, before moving to Medina, when he recited the verses of the Qur'an, he raised his voice so that many people could hear him. When the polytheistic youths of Mecca heard him reciting the Qur'an, they chased away those who had heard the Prophet's recitation by saying, \"Disturb Muhammad's voice by crying, whistling, singing, or by clapping.\" Ibn 'Abbas said that Abu Jahl said to his people, \"When Muhammad reads the verses of the Qur'an, shout loudly in his face, so that you cannot hear what he is saying.\" In fact, Allah commands to listen when the Qur'an is recited. His Word: And when the Qur'an is recited, then listen and be silent, so that you may receive mercy. (al-A 'raf\/7: 204)"
		   },
		   {
			"id": 4245,
			"surah": 41,
			"ayat": 27,
			"tafsir": "In this verse, Allah threatens the disbelievers with a painful doom by saying, \"We will truly feel the unspeakable punishment for the disbelievers and we will repay all the sins and prohibitions they have committed. We will not reward all the good deeds they have done, because all good deeds such as connecting friendships, helping people in need, doing good deeds and so on, have been erased by their disbelief. There is nothing they can expect from those good deeds other than from bad deeds.\""
		   },
		   {
			"id": 4246,
			"surah": 41,
			"ayat": 28,
			"tafsir": "The reward for those who make fun of Allah's verses and for their enemies is the fire of hell. They are eternal in it and they feel the punishment continuously. They couldn't avoid it anymore. Then Allah explained that they were in hell forever and ever, as a reward for their actions of denying the verses of Allah while in the world"
		   },
		   {
			"id": 4247,
			"surah": 41,
			"ayat": 29,
			"tafsir": "In this verse it is explained that when the disbelievers feel the punishment of hell, they ask Allah to bring the demons who lead them astray to them. The request was made so they could wreak their grudges. They said, \"O our Lord, confront us with the devils who lead us astray, so that we can vent our hurt on them by trampling on their bodies.\" In other verses it is explained that there are demons of the jinn type and some of the human kind, as Allah says: And thus for every prophet We made enemies consisting of human and jinn devils (al-An' am\/6: 112) And the word of Allah: Who whispers (evil) into the human bosom, from (class of) jinn and humans. (an-Nas\/114: 5-6)"
		   },
		   {
			"id": 4248,
			"surah": 41,
			"ayat": 30,
			"tafsir": "This verse explains that those who say and acknowledge that God is the One Who Creates, Sustains and Sustains Life, Provides sustenance, and has the right to be worshiped, only God Almighty, then they remain steadfast in their stance, then the angels will descend to assist them in times of need. Among them when they die, in the grave, and will be brought to account in the afterlife, so that all the difficulties they face feel lighter. In the hadith of the Prophet it is explained that being firm in your stance is what a believer really needs: Sufyan bin 'Abdullah ats-saqaf narrates that someone said, \"O Messenger of Allah, order me about Islam a commandment that, I will not ask anyone other than you.\" Rasulullah replied, \"Say: I believe in Allah, then firm your stance.\" I said, \"What should I take care of?\" So the Prophet hinted to his own tongue. (Muslim history) According to Abu Bakr, what is meant by the word \"istiqamah\" is not to associate anything with Allah. To those who believe and stand firmly by not associating partners with Him, Allah sends down angels who deliver joyful news, give everything that is beneficial, reject harm, and remove any sorrow that may be in him in all worldly affairs as well as ukhrawi affairs. Thus, their chests became spacious and serene, no worries on them. Meanwhile, to the disbelievers, the devil comes who always tempts them, thus making bad deeds beautiful in their eyes. Waki' and Ibn Zaid argue that angels give good news to believers in three circumstances, namely, when they die, in the grave, and at the time of resurrection. To those who believe, the angels tell them not to worry about the resurrection day and the day of reckoning. They also don't have to be sad about world affairs that escape them, such as those related to family, children, wealth, and so on. According to 'Atha', what is meant by \"alla takhafu wa la tahzanu\" is: don't worry that Allah will not reward your deeds, in fact you are accepted by Allah, and do not grieve over the sins you have committed, then indeed Allah will forgive them. . This verse further explains that the angels tell the believers to be happy with the heaven that the apostles have promised. They will definitely go to heaven, and eternally therein."
		   },
		   {
			"id": 4249,
			"surah": 41,
			"ayat": 31,
			"tafsir": "Furthermore, the angels declare to those who believe that they always accompany and help these people in all world affairs. The angels always give instructions that lead to goodness, truth, and benefit. Likewise the angels will be with the believers in the hereafter, accompanying them in their graves, on the Day of Resurrection, and on the Day of Judgment until they enter Paradise. Some commentators are of the opinion that it is Allah himself who reveals to the believers in this verse, so that the meaning of this verse is: \"And Allah is the guardian of those who believe who are firm in their convictions . . . \" The angel said that in heaven those who believe will get all kinds of pleasures, happiness, and pleasures that they always desire, as well as everything they want and ask for."
		   },
		   {
			"id": 4250,
			"surah": 41,
			"ayat": 32,
			"tafsir": "In this verse it is explained that God bestows such things as a glory for them. He forgave all sins and bestowed grace on them."
		   },
		   {
			"id": 4251,
			"surah": 41,
			"ayat": 33,
			"tafsir": "This verse denounces those who speak nonsense about the Qur'an. The Qur'an asks: which words are better than the Qur'an, who has better words than those who call people to obey Allah. Ibn Sirin, as-Suddi, Ibn Zaid, and al-Hasan are of the opinion that the person with the best speech is the Messenger of Allah. When reading this verse, al-hasan said that what is meant is the Messenger of Allah, he is the love and guardian of Allah. He is that which is sanctified by Allah and is His choice. He is a resident of the earth who loves God the most. God accepted his call and he called on people to follow that call. Some other scholars are of the opinion that this verse has a general meaning, namely all those who call on others to obey Allah. The Messenger of Allah was one of the best in speech, because he called people to the religion of Allah. This verse explains that a person is said to be the best when his words contain three things, namely: 1. Calling on others to follow the religion of monotheism, oneness of Allah and obedience to Him. 2. An invitation to do good deeds, obey Allah's commands and stop His prohibitions. 3. Making Islam a religion and purifying obedience to Allah alone. By explaining the best words, it was as if Allah confirmed to the Messenger of Allah that the task given to him was the most noble task. Therefore, he was asked to continue to carry out da'wah, and be patient in facing the difficulties and obstacles made by unbelievers. From this verse it is understood that the most important thing for a Muslim to do is to improve himself first, by strengthening faith in the heart, obeying all of Allah's commands, and stopping all of His prohibitions. After self-improvement, call on others to follow God's religion. People who are clean in soul, strong in faith, and always do good deeds, people pay more attention to their invitations, because they call on others with strong conviction and in a steady voice, without hesitation."
		   },
		   {
			"id": 4252,
			"surah": 41,
			"ayat": 34,
			"tafsir": "This verse explains that the good that Allah pleases and is rewarded with is not the same as the bad that He hates and those who do it will surely be punished. This verse can be interpreted by stating that the da'wah of people who call on Allah and follow Islam is not the same as the act of denouncing those who carry out the da'wah. The attitude of the disbelievers who denounce the preachers is explained in the word of God:  Our hearts are closed from what you call us to  (Fushshilat\/41: 5) And the word of God: And those who disbelieve say, \"Do not listen to (the recitation ) this Qur'an and make noise against it, so that you can defeat (them).\" (Fushshilat\/41: 26) With this verse, it is as if Allah revealed to the Messenger of Allah that if he does good, then he will receive good rewards in the form of awards while living in this world and great rewards in the hereafter. While those who disbelieve in this crime will receive humiliation in this world, and in the hereafter they will receive a painful punishment. The Prophet was also forbidden to repay their crimes with evil. If he repays evil with evil, of course they will get a double loss. Therefore, the Prophet was ordered to repay their crimes with good. Then Allah explained how to repay the evil of the disbelievers with good by ordering the Messenger of Allah to repay the ignorance and crimes of the disbelievers in the best way, repay their bad deeds with good deeds, forgive their mistakes, and face their anger with patience. . If the Prophet did so, they would gradually judge for themselves what they had done, and bring shame upon them for their actions. Allah explains the results that will be obtained by believers if they repay the bad deeds of disbelievers with good deeds. Allah says if believers succeed in doing this, surely the disbelievers' enmity towards them will turn into friendship, hatred will turn into love. Ibn 'Abbas said that in this verse, Allah commands humans to be patient when angry, to be forgiving to those who are ignorant, and to forgive people's mistakes. If someone does this, Allah will protect them from Satan, and their enemies will submit and obey them. It is narrated that a man taunted Qunbur, the slave of 'Ali bin Abi Talib, whom he had freed. 'Ali then called him and said, O Qunbur, leave the person who reproached you, let him, may God the All-Merciful be pleased, and the devil will be angry.\" According to Muqatil, this verse was related to Abu Sufyan. He was one of the enemies of the Messenger of Allah However, because of the Prophet's patience and kind attitude towards him, Abu Sufyan became a close friend of the Prophet, by establishing friendship relations (mushaharah)."
		   },
		   {
			"id": 4253,
			"surah": 41,
			"ayat": 35,
			"tafsir": "In this verse, Allah explains the best way to deal with disbelievers, namely one who is patient when suffering hardships and tribulations, can hold back anger, is not vindictive, and loves to forgive. Anas ra in interpreting this verse says that what is meant by patience in this verse is when someone is cursed at by another person, he says, \"If you scold me for the right reason, hopefully Allah will forgive your sins. If you scold me for the wrong reason I hope that Allah will forgive my sins.\" The advice to be patient, hold back anger, and like to forgive other people's mistakes is the most important and high-value advice. Those who can receive this advice are only those who believe and do good deeds, who will find happiness in this world and in the hereafter. Qatadah says that the meaning of \"great gain\" is paradise. The meaning of this verse is that patience is only bestowed upon those who will enter heaven."
		   },
		   {
			"id": 4254,
			"surah": 41,
			"ayat": 36,
			"tafsir": "This verse explains that if satan tempts you to repay evil with evil, then seek refuge in Allah from all the deceptions of the accursed satan. Allah is All-Hearing your supplication and All-Knowing of everything that satan whispers into your bosom."
		   },
		   {
			"id": 4255,
			"surah": 41,
			"ayat": 37,
			"tafsir": "This verse explains that among the signs of Allah's greatness and power are the night as a time of rest, during the day when working and trying, the sun emits its light, and the moon shines. It is He who directs the course of the planets in their orbits in the firmament so that the year, month, day and time are known, as Allah says: It is He who makes the sun shine and the moon shine, and He it is Who determines the places in their orbits, so that you may know number of years, and calculation (time). (Yunus\/10: 5) After Allah explained the signs of His greatness and power, He warned His servants not to ever prostrate to His signs of greatness and power, such as the sun, moon, stars, etc. Never glorify, worship, and consider them to have supernatural powers, because only He creates, controls, regulates, and determines whether or not something exists. It is as if this verse explains and reminds us that humans are God's most noble creatures among the creatures He created. Because it is inappropriate for humans to glorify, consider sacred, and respect God's creatures that are lower than them. What deserves to be worshiped, glorified, and respected is something that is most powerful and most glorious, namely Allah. If there are humans who worship and glorify creatures other than Allah, it means that humans have degraded their own dignity. This verse also warns people who associate partners with Allah, idol worshipers, sun, moon and star worshipers to be aware of their position among the other creatures."
		   },
		   {
			"id": 4256,
			"surah": 41,
			"ayat": 38,
			"tafsir": "Then Allah warned the Prophet Muhammad that if the polytheists who worshiped the stars were arrogant and did not heed his call, let them go astray as they did. Allah does not need them in the least. Their belief or non-belief means nothing to Allah in the least. Allah continues His warning that the creatures who are by His side are better than the polytheists, no one is arrogant and arrogant towards Him. They always glorify, pray day and night, and they never feel bored. Allah said: And you (Muhammad) will see angels circling around the 'Throne, glorifying and praising their Lord; then a decision was given between them (servants of Allah) fairly and it was said, \"Praise be to Allah, Lord of the worlds.\" (az-Zumar\/39: 75)"
		   },
		   {
			"id": 4257,
			"surah": 41,
			"ayat": 39,
			"tafsir": "This verse explains that among the proofs of Allah's power to resurrect people on the Day of Judgment is the earth that is barren and dead, not growing any vegetation. However, when He waters the land with rainwater by running water over it, the earth turns green, because the soil becomes fertile and plants grow. Allah said: And you see the earth is dry, then when We send down water (rain) on it, the earth will live and become fertile and grow various types of beautiful plant pairs. (al-hajj\/22: 5) This verse relates to the growth of plants with the gift of water sent down in the form of rain. A similar message can also be found in surahh al-hajj\/22 verse 5, which at the end of the verse reads: \"... And you see the earth is parched, so when We send down water on it it moves and expands and grows various types of plants. the beautiful one.\" The word \"moving and expanding\" is associated with the movement of soil grains as plant seeds germinate and their roots develop and grow into mature trees. God, who revived the dead earth by sprinkling water and revived the plants, so that the earth was green, also has the power to revive dead humans, and the power to raise them from the graves. None of this is difficult for Him. Everything is easy for Him. He is almighty over all things."
		   },
		   {
			"id": 4258,
			"surah": 41,
			"ayat": 40,
			"tafsir": "This verse explains that Allah is All-Knowing of all that is done and devised by those who oppose the Qur'an according to their own desires, deny it, and criticize it. There is nothing hidden and unknown to God. Therefore, He will repay all their deeds with appropriate rewards. Then Allah explains the differences and forms of retribution that will be received by believers and unbelievers in the hereafter by saying that those who are put into hell for denying Allah, the Messenger, and His verses are not the same as those who -a believer who believes in the verses of the Qur'an, follows His messenger, and gets paradise. Allah will make a fair decision between them and the reward they will get will certainly not be the same. This verse is addressed to all human beings who disbelieve and believe. However, some scholars argue that this verse means general and specific. General includes all people who disbelieve and believe, specifically related to Abu Jahal who denied the Prophet and those who believed in him. Narrated by 'Abd ar-Razzaq, Ibn al-Mundzir, Ibn Asakir from Busyair bin Tamim, he said, \"This verse was revealed regarding Abu Jahal and 'Ammar bin Yasir.\" At the end of this verse, Allah confirms that the Prophet Muhammad already knew the consequences for those who commit sins in the hereafter, and the consequences that will be obtained by those who believe later. Therefore, humans are welcome to do whatever they want, they already know the consequences. Allah sees all human actions and rewards according to what he has done."
		   },
		   {
			"id": 4259,
			"surah": 41,
			"ayat": 41,
			"tafsir": "In this verse it is explained that the signs of those who deny it are denying the verses of Allah, and denying the Qur'an when it is conveyed to them. They will be rewarded according to their disbelief. Then Allah explained that the Qur'an is a noble book, the contents of which cannot be canceled, and cannot be changed in the slightest."
		   },
		   {
			"id": 4260,
			"surah": 41,
			"ayat": 42,
			"tafsir": "This verse emphasizes that there is nothing that invalidates the verses of the Qur'an, even though they are God's earlier books, such as the Torah, Zabur, and Gospel, and none of God's books came after the Al-Qur'an. . This meaning is in accordance with the opinion of Sa'id bin Jubair and al-Kalbi. At the end of this verse, it is explained that the entire Qur'an is true, there is not even the slightest mistake, because the Qur'an comes from Allah, Lord of the worlds. Everything that comes from God is absolutely true, nothing is lacking, wrong, or imperfect. He is Most Wise and Most Praised."
		   },
		   {
			"id": 4261,
			"surah": 41,
			"ayat": 43,
			"tafsir": "This verse is God's consolation for the Prophet who was sad because of the attitudes and actions of polytheists towards the Qur'an that he conveyed. Allah says that the attitudes, actions and utterances of the polytheists who deny the verses of Allah are the same as the actions and utterances conveyed by the former nations to their messengers. Even so, they remained patient and steadfast in conveying their message. Therefore, the Prophet Muhammad was also ordered to be patient and steadfast, like the previous messengers. He was also asked to stick to his call. Another verse that has the same content as this verse is His word: Thus whenever an Apostle came to people before them, they (his people) would say, \"He is a sorcerer or a madman.\" (adz-dzariyat\/51: 52) Some commentators are of the opinion that the meaning of this verse is actually what was conveyed to the Prophet Muhammad, such as the teachings of the oneness of Allah, and purifies obedience and submission only to Him, the same as what was conveyed to the apostles previously sent. This is reasonable because God's religion has the same principles and principles. All of them equally determine and command to devote themselves only to Allah, both believe in the existence of the resurrection day, and so on. If there are differences, then those differences are not related to principles or principles, but only those related to furu' or non-principles. This is necessary because of differences in circumstances, times, and places. This tafsir is in accordance with the word of Allah: Indeed, We have revealed to you (Muhammad) as We have revealed to Noah and the prophets after him (an-Nisa'\/4: 163) If this verse is connected with the verses that follow, then the opinion the first is more appropriate, because the discussion of the verses that follow relates to the attitude of polytheists towards the Qur'an. But when connected with the previous verses, the second opinion is appropriate, because the discussion relates to the Qur'an, as a revelation in which there are no mistakes and deficiencies. In tafsir, this verse is included in the group of verses after it. At the end of this verse it is explained to the Prophet Muhammad that his God is God Almighty. The one who has the right to be worshiped is the Most Forgiving God to His servants who want to repent, and also gives very painful punishments to disbelievers who are arrogant and don't want to repent."
		   },
		   {
			"id": 4262,
			"surah": 41,
			"ayat": 44,
			"tafsir": "This verse is the answer to the attitudes and words of the polytheists in the previous verses. They were told that if Allah had sent down the Qur'an to the Prophet Muhammad in a language other than Arabic, surely the Meccan Quraysh would have said, \"Why was the Qur'an not revealed in Arabic? So that we can easily understand the laws and provisions contained therein.\" Even though they used to say, \"Is the Al-Qur'an that was revealed in a language other than Arabic, while the messenger who was sent was in Arabic?\" Allah ordered the Messenger of Allah to answer the questions of the polytheists who did not want to believe in the Al-Qur'an by saying to them, \"This Al-Qur'an is for those who believe in it, believing that it comes from Allah Almighty, and believe in the apostle who conveyed it, is a guide to the path of happiness, bidders, and removes doubts. This verse is in line with the word of Allah: O people! Verily, a lesson (Al-Qur'an) has come to you from your Lord, a healer for a disease that is in the breast and guidance and mercy for those who believe (Yunus\/10: 57) Those who do not believe in Allah, His Messenger, and the Qur'an, have plugs in their ears that block their hearing from hearing the verses of the Qur'an. They are blind so they cannot see the proofs of Allah's greatness and power and cannot accept the lessons conveyed by the apostles. People who do not hear Allah's verses and cannot When he saw the proofs of His greatness and power being likened to someone being called from a faraway place, he could only hear an unclear voice, so he did not understand the meaning of that voice."
		   },
		   {
			"id": 4263,
			"surah": 41,
			"ayat": 45,
			"tafsir": "Furthermore, Allah told the Prophet Muhammad not to trouble himself because the Meccans had disagreements about the Qur'an. Things like that have also been done by the people of the past to the apostles who were sent to them. Allah said that He had sent down the Torah to Moses, to be conveyed to the Children of Israel. They also have different opinions about the Torah. There are those who justify and there are those who deny. There are those who believe in Moses and there are those who disbelieve in him. Therefore, the Prophet Muhammad was ordered not to give up in conveying Allah's religion, and to be patient in facing the actions of those infidels. The Prophet saw was also ordered to follow in the footsteps of the apostles who conveyed His religion. Then Allah said that those who disbelieved would not immediately receive the punishment for their actions, because the punishment was postponed until the appointed time. It is in accordance with His decree that He postpones the punishment of the disbelievers until the Day of Judgment. Had there not been such a stipulation, Allah would have decided their dispute with the believers. Allah said: Even the Day of Judgment is the day promised to them and the Day of Judgment is more terrible and more bitter. (al-Qamar\/54: 46) And the word of Allah: And do not think that Allah is unaware of what the wrongdoers do. Indeed, Allah has delayed them until the day when (their) eyes will widen. (Ibrahim\/14: 42) Allah explained that the causes of the destruction and punishment that befell the polytheists were because they were very doubtful and confused about the Qur'an. Because confused and doubtful, they denied it and did not heed the preaching of the Prophet."
		   },
		   {
			"id": 4264,
			"surah": 41,
			"ayat": 46,
			"tafsir": "At the end of the verse of this surah, Allah explains the recompense that will be given to the deeds done by humans. Whoever obeys Allah and His Messenger in the life of this world, carries out His commandments, and stops His prohibitions, it means that he has tried to do good for himself by obtaining a great reward. Whoever disbelieves in Allah means that he has tried to do bad things for himself by getting a very painful punishment in the hereafter. A person is punished according to what he has done, it is impossible for Allah to punish someone because of the actions of others. Allah said: And a person will not bear the burden of another person's sins. Then to your Lord you will return, and He will inform you of what you used to argue about. (al-An'am\/6: 164)"
		   },
		   {
			"id": 4265,
			"surah": 41,
			"ayat": 47,
			"tafsir": "In this verse, Allah explains that only Allah knows about the Day of Judgment, when and how it will happen. Likewise other unseen events such as the discharge of fruit properly or damage from its petals, and the fetus conceived by the mother, whether it will be born normally or with defects in its limbs, all of that is known only by Allah for certain. Some things do exist that humans know, such as what month the fruits will ripen, when approximately a baby will be born, but that knowledge is still very simple, not as detailed as God's knowledge and not as complete as His statement. In another verse Allah confirms that only He knows exactly the Day of Judgment. Allah says: They ask you (Muhammad) about the Hour, \"When will it happen?\" Say, \"Surely the knowledge of the Last Hour is with my Lord; no one (one) can explain the time of its occurrence other than Him.\" (al-A'raf\/7: 187) The Prophet Muhammad himself in the hadith narrated by 'Umar bin al-Khaththab when asked by the Angel Gabriel about when the Day of Judgment, he replied: Verily Gabriel asked the Messenger of Allah about the Day of Judgment, the Messenger of Allah replied: the one being asked knows no more than the one asking (Muslim history from 'Umar bin al-Khaththab) In the development of science today, there are indeed many new things that are known to humans, such as the time of the fruiting season of several kinds of fruits, conditions regarding the fetus in the womb such as sex, health, and when the fetus will be born. But this human knowledge is still very little compared to God's knowledge and is still approximate so it is uncertain. In contrast to God's detailed and definite knowledge. The Word of Allah swt: Allah knows what every woman contains, what is lacking and what is growing in the womb. And everything has a measure with Him. (Allah) Who knows all that is unseen and that which is real; The Greatest, Most High. (ar-Ra'd\/13: 8-9) It has been explained above that only Allah knows about the Day of Judgment and when it will occur. He knows all women who are pregnant and who have given birth to children. From this information it can be understood that there is knowledge of God that is impossible for humans to know and there is something that they might know if He gives His permission to humans. Of course this has wisdom and purpose, but only Allah knows with certainty the nature of that wisdom and purpose. Even though humans are given some of God's knowledge, the nature and form of that knowledge is not the same and is different for everyone. Allah knows the content of all women who are pregnant and who give birth. God's knowledge about women who are pregnant and who give birth is complete and certain knowledge, comprehensive to the smallest detail. This knowledge has to do with the process of natural events as a whole, from the past to the present and to the future. It is different from the knowledge of an obstetrician about a woman's womb. He only knows in general terms, not in detail. In fact, his knowledge is limited and only conjecture, not certain knowledge because certain and comprehensive knowledge is only with Allah. Furthermore, Allah explains the events that will be experienced by polytheists on the Day of Judgment. On that day Allah will question them firmly and clearly and hold them accountable about His partners whom they worship in the world; where are they now, why are they not with the idols. Finally the polytheists answered with a firm answer, \"O our Lord, we declare to You today that none of us admits that You have partners; You are the only one we worship, no one else. \" Another Word of God that has the same meaning as this verse: Then there is no answer to their lies, except to say, \"By Allah, O our Lord, we do not associate partners with Allah.\" (al-An'am\/6: 23)"
		   },
		   {
			"id": 4266,
			"surah": 41,
			"ayat": 48,
			"tafsir": "This verse explains that on the Day of Judgment those polytheists who went astray did not see any benefit from the idols they worshiped in the former world, that is, on the day they felt that everything they had done in the former world was useless. No one can prevent them from the punishment of Allah. Only then did they believe in the oneness and power of Allah and they also believed that there was no way out to escape Allah's punishment."
		   },
		   {
			"id": 4267,
			"surah": 41,
			"ayat": 49,
			"tafsir": "This verse explains the desires of humans to achieve things that concern themselves. Most humans are greedy people, like to seek wealth and seek pleasure for themselves. They want wealth and power, because according to them with wealth and power all their goals and desires will be achieved. They want offspring, because with that offspring they can inherit all the property they have earned and there will always be people who remember their services and success while living in the world. They want to get as many worldly goods as possible, therefore they are competing to achieve them, as if their life and lives were spent on it. In this verse, what humans always want and seek is called \"khair\" (good). It is called \"khair\" because what humans want is goodness which is God's mercy and grace. They make God's grace and grace a goal that must be achieved in their life and life in this world, not as a tool or path that they can use to achieve something that is more noble and of higher value, so that God's grace and grace were originally good. they make a source of disaster and calamity because of their lust that can befall themselves or others. What is meant by \"seeking good\" in this verse is wanting, trying, seeking, demanding and making goodness a means and way to achieve the goal of life in this world and the hereafter, not to seek goodness so that goodness can be used as a tool and way to achieve the desired goal. lust. Seeking goodness to fulfill the desires of lust can cause havoc for those who seek it. However, if seeking goodness is the goal so that goodness can be used as a tool and a way to seek Allah's pleasure, then seeking such goodness is recommended by Islam. For example, someone tries to find lawful assets so that with these assets he can carry out his duties and obligations as a servant of Allah, such as providing for his family, spending in Allah's way, helping the poor, and so on. Likewise, a person who wants to seek rank and power, he may seek it with the aim of upholding justice, upholding God's laws, and helping people who are in misery. Such efforts are commendable and pleasing to Allah. So, seeking goodness is essentially good if the goodness obtained is used as a tool and a way to seek God's pleasure. However, seeking the good will damage him if the goodness is used to fulfill his lust. Another human trait is that if the good they are looking for does not get them or they are struck by a calamity, then they become hopeless, as if there is no hope for them anymore, there is no earth to stand on and no sky to take shelter in, all that is they want it as if it's gone. In such circumstances, they become hopeless from Allah's mercy and are prejudiced against Allah as if Allah does not have compassion and is not the Giver of mercy to His servants. The characteristics explained by this verse are the characteristics of people who do not believe and do not purify their obedience and obedience to Allah. They still believe in the existence of other forces that can help them apart from the power of God. It's as if they don't believe in the existence of His mercy and grace and don't believe in the real life, namely the afterlife. As for those who believe in Allah, are those who submit and obey Him, feel His majesty and greatness and feel themselves dependent on His mercy and grace. They believe in the existence of an essential life, namely life in the afterlife, and they believe that worldly life is only temporary. Therefore they try and work solely to seek His pleasure. They also believe that Allah besides testing His faithful servants and that test is always given in various forms, some are in the form of misery and suffering, and some are in the form of pleasure and wealth. Whatever form of test and trial it is, it is faced with patience and trust. If they get good and wealth, they are happy and grateful to Him and if disaster strikes, they remain patient and steadfast, even closer to Him. They still hope for God's grace and grace because they truly believe in the nature of God's love that bestows His grace and gifts on every servant who believes in Him. Allah swt said: O my children! Go, seek (news) about Yusuf and his brother and do not despair of Allah's mercy. Indeed, those who despair of Allah's mercy are only those who disbelieve.\" (Yusuf\/12: 87)"
		   },
		   {
			"id": 4268,
			"surah": 41,
			"ayat": 50,
			"tafsir": "In this verse, Allah explains the characteristics of most human beings, that is, if they receive favors and pleasure, they become forgetful and arrogant, thus declaring, \"This is the result of my own work, so I don't have to give some of my wealth to other people, and I don't need to be grateful to others. anyone. I'm also not sure whether the Day of Judgment will come?\" Furthermore, those disbelievers also stated that if I were to be returned to Allah, then I would definitely get goodness on his side as well. Such is their way of thinking that is not clear and is only based on estimates. So this verse ends with the assertion that Allah will really tell the disbelievers what they did in this world and will inflict a painful punishment on them in the hereafter. As for the characteristics of people who are hopeless of Allah's mercy, they are as follows: 1. If the tribulation and difficulties they are suffering are suddenly removed from them, then they are rewarded with grace and bounty, they forget the misery and suffering they have experienced, they forget the source of the grace and gifts they receive, they even say that everything they get is solely due to their own efforts and intelligence, not because of God's grace. What is meant by the words hadha li in this verse are: I got this because of my own effort and intelligence, because of that everything I got was really mine and no one was with me in this ownership. Therefore, I don't need to share it with others and I don't need to offer worship and praise to Allah and remember His grace and goodness. 2. They don't believe in the Last Day. This distrust arises because of the arrogance and arrogance that is in them and because of the pleasures of living in the world that they are enjoying. 3. They say there is no reckoning, no day of reckoning. According to them if they are returned to Allah later, of course they will get a lot of goodness and pleasure too. At the end of this verse Allah threatens disbelievers who do not believe in the Day of Judgment, the Day of Judgment, and the existence of heaven and hell. Allah confirms that those disbelievers will truly experience the Day of Judgment. They will witness for themselves the evil deeds they have done. Then Allah weighs everything they have ever done and gives a fitting reward for the evil deeds they have done with a severe punishment in hell."
		   },
		   {
			"id": 4269,
			"surah": 41,
			"ayat": 51,
			"tafsir": "This verse explains that another bad characteristic of humans is that if they are given grace and gifts, they are preoccupied with these graces and gifts, they are too happy and happy that they forget the source of these graces and gifts. Sometimes they even go further than that. They use those graces and gifts to challenge and destroy Allah's religion: they wreak havoc on the earth, severing ties with other human beings whom Allah commanded to connect it. They feel that they have become people in power so that other people under their authority are obliged to respect and serve them. They have forgotten that they are human beings who must act according to their nature, that is, they can only live with the help of other humans and the help of the Most Helpful, namely Allah. On the other hand, if a calamity or calamity strikes them, they return to remembering Allah. They pray to Allah while lying down, sitting, standing, walking, and in any circumstances. In fact, they promised and swore by saying His name if they were spared from the calamity and calamity, they would become believers. In line with this verse, Allah says: And when a man is struck by danger he prays to Us while lying down, sitting or standing, but after We remove the danger from him, he returns (to a misguided path), as if he had never prayed to We are to (eliminate) the harm that has befallen him. Thus it is made to feel beautiful to those who transgress the bounds of what they are doing. (Yunus\/10: 12)"
		   },
		   {
			"id": 4270,
			"surah": 41,
			"ayat": 52,
			"tafsir": "This verse explains that in fact the polytheists are in a state of doubt about the truth of the Qur'an and Muhammad saw as the messenger of Allah. Their situation is between justifying and denying. They recognized Muhammad as a trusted and respected person and a leader who could solve problems that arose among the Quraysh tribe. Likewise, they admire the content and the high style of the language of the Qur'an which they think is impossible for a human being to produce. However, they are still influenced by the beliefs of their ancestors in addition to worrying about the emergence of antipathy from their own people. If they said what was in their hearts, of course they would no longer be made leaders by their people; they will lose influence. This attitude of doubt is always raging in their minds. In such circumstances, Allah ordered His Messenger to ask the polytheists who went astray. \"O polytheists, what do you think if the Qur'an was really from Allah, while you deny its truth? If that is the case, surely you are all people who go astray and distance yourself from the truth?\" It is as if with that question Allah stated emphatically that it is this attitude of doubt that will lead them into the valley of error and endless regret in the hereafter."
		   },
		   {
			"id": 4271,
			"surah": 41,
			"ayat": 53,
			"tafsir": "This verse explains that those polytheists who doubt the Qur'an and the Messenger of Allah will see with their eyes the proofs of the truth of Allah's verses in all corners of the world and in themselves. They saw and witnessed that the Muslims were weak and oppressed while in Mecca and then the Prophet and his companions migrated to Medina leaving their beloved hometown. Rasulullah saw while in Medina together with the Muhajirin and Ansar formed and fostered an Islamic society. The new society is getting stronger and growing. This is felt by the polytheists in Mecca, because of that they are always trying so that this new power can be broken immediately. The power of Islam and the Muslims was first felt by the Meccan polytheists during the Battle of Badr and then when they were scattered in the Battle of the Khandak. The latter was when the Prophet Muhammad and the Muslims conquered the city of Mecca without any resistance from the polytheists. In the end they saw people converting to Islam in droves, including polytheists, their own families and friends. All of these are proofs of the truth of Allah's verses. Allah says: When Allah's help and victory has come, and you see people flocking to Allah's religion, then glorify your Lord and ask His forgiveness. Truly, He is the Acceptor of repentance. (an-Nasr\/110: 1-3) At the end of this verse, Allah confirms again that He witnesses all the behavior of His servants, whether in the form of words, deeds or behavior, and He is All-Knowing of all that is in the human heart. He stated that Muhammad saw was a truthful person, never lied, everything he said was true, Allah said: But Allah is a witness for (the Qur'an) which He sent down to you (Muhammad). He brought it down with His knowledge. (an-Nisa'\/4: 166) Many people say that studying nature, including ourselves, can lead to an understanding of the existence of God. Nature is a book waiting to be studied. However, God's hope in sending down the verse above is not always understood by humans. surahh Yunus\/10: 101 is one among many verses which tells us that only scientists who have faith can understand God by studying nature. Say, \"Pay attention to what is in the heavens and on the earth!\" Signs (of Allah's greatness) and messengers do not benefit those who do not believe. (Yunus\/10: 101)"
		   },
		   {
			"id": 4272,
			"surah": 41,
			"ayat": 54,
			"tafsir": "This verse explains their doubts about the existence of the Day of Resurrection and the Day of Judgment, because according to them, it is impossible for people who have died to come back to life and it is also impossible for bodies that have been destroyed along with the ground to be collected, returned to their original state and able to live. return. It is because of their doubts that they become unable to pay attention to the truth of the Qur'an and the Prophet Muhammad. At the end of this verse Allah warns the polytheists with a stern warning that He is All-Knowing of everything. Nothing escapes His knowledge. Therefore He will reward His servants as fairly as possible."
		   }
	]
}
