{
	"tafseer": [
		{
			"id": 2792,
			"surah": 24,
			"ayat": 1,
			"tafsir": "Allah explained that this surah contains two things. First, the laws that must be obeyed as will be conveyed in the following verses regarding adultery, accusing women of adultery, and so on. These laws, if humans think about them with an objective mind, will surely admit that these provisions are true and come from God and not man-made. All of that is sent down to be obeyed and carried out in life. Second, concrete evidence that shows the power and oneness of Allah in this world."
		   },
		   {
			"id": 2793,
			"surah": 24,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that Muslims who commit adultery, both women and men, who are of age, are free, and who are not muhsan, are subject to a hundred lashes as punishment for their actions. What is meant by muhsan is a woman or a man who has been married and had intercourse. Not muhsan means never married and had intercourse, meaning girl and virgin. If they commit adultery, the punishment is one hundred lashes. The whippings had to be carried out without mercy, that is, without stopping, on condition that they did not result in injuries or broken bones. For those who believe in Allah and the Hereafter, it is not justified and even prohibited to have mercy on those lawbreakers who do not carry out the provisions outlined in Allah's religion. The Prophet Muhammad must be used as an example or role model in upholding the law. He once said: From 'Aisyah said the Messenger of Allah said, \"If Fatimah bint Muhammad stole, I would have cut off her hand.\" (History of asy-Syaikhan) The caning punishment should be carried out by those in authority and carried out in a public and respectable place, such as in a mosque, so that it can be witnessed by many people, with the intention that those who witness the execution of the flogging punishment receive a lesson, so that they really can refrain from committing adultery. As for muhsan adulterers, both women and men, the punishment is to be stoned to death, which according to Islamic terms is called \"stoning\". This stoning punishment is also carried out by an authorized person and carried out in a public place that can be witnessed by many people. This stoning law is based on the mutawatir sunnah of the Prophet. It was narrated from Abu Bakr, Umar, Ali, Jabir bin Abdillah, Abu Said Al-Khudri, Abu Hurairah, Zaid bin Khalid and Buraidah al-Aslamy, that a friend of the Prophet named Ma'iz was sentenced to stoning based on his own confession that he committed adultery. . Likewise, two women from Bani Lahm and Bani Hamid were sentenced to stoning, based on their confessions that they had committed adultery. The sentence was carried out in public. Such is the punishment for adultery in the world. As for the hereafter, the adulterer will go to hell if he does not repent, as the Prophet said. \"Avoid adultery because in adultery there are four things. Eliminating the authority of the face, cutting off sustenance, angering Allah, and causing eternal death in hell.\" (History of ath-thabrani in Mu'jam al-Ausath, from Ibn 'Abbas) The reality is that the culture of free association of men and women has given rise to diseases that are difficult to cure, namely HIV\/AIDS, the loss of the immune system in humans in eventually the person concerned will die slowly. It has also led to the emergence of many babies born out of wedlock, thereby disrupting offspring and in turn disrupting the legal and social order. The act of adultery has been agreed upon as a major sin which is in the third position after polytheists and killing, as explained in the hadith of the Prophet PBUH: Abdullah bin Mas'ud said, \"O Messenger of Allah! What is the biggest sin in the sight of Allah?\" The Messenger of Allah replied, \"You made Allah partners even though He was the one who created you,\" said Ibn Mas'ud, \"Then what else is sin?\" Said Ibn Mas'ud, \"Then what sins?\" The Prophet replied, \"You committed adultery with your neighbor's wife.\" In line with this hadith, Allah says: And those who do not worship other Gods along with Allah and do not kill a soul that Allah has forbidden (kill) except with the right (reason), and do not commit adultery. (al-Furqan\/25: 68) The punishment in this world will only be carried out when the act of adultery actually occurs. The certainty of whether or not an act of adultery has occurred is determined by one of the following three things: evidence (bayyinah), pregnancy, and the confession of the person concerned, as the words of the Prophet narrated by Huzaifah: The law of stoning in the Book of Allah is clear on who commits adultery if he is muhsan, whether male -male or female, if there is evidence, pregnancy or confession. (Al-Bukhari and Muslim) What is meant by \"evidence\" in this hadith is the testimony of at least four male witnesses who clearly witnessed the occurrence of adultery. If there are no or not enough witnesses, the person's confession is required, if the person concerned does not confess, then the sentence cannot be imposed. The punishment in the hereafter, namely the punishment in hell as explained in the hadith narrated by Huzaifah above, occurs if the person concerned does not repent. If the person concerned repents and is willing to carry out the punishment in this world, then he will be released from the punishment in the hereafter, as in a hadith which tells of a friend named Hilal who accuses his wife of adultery but the wife denies this. The Prophet said that the punishment in the hereafter is more severe than the punishment in this world, namely stoning, which is much lighter. But the woman even denied that she had committed adultery. From this event it is understood that if the adulterer has repented and is willing to carry out the punishment in this world, he will be released from punishment in the hereafter."
		   },
		   {
			"id": 2794,
			"surah": 24,
			"ayat": 3,
			"tafsir": "It was narrated by Mujahid and Ata that in general the Muhajirin people who came from Mecca to Medina were poor people who had no wealth and no family, while at that time in Medina there were many prostitutes who rented themselves out, so that their livelihood was more tolerable than the other people. On the doors of these women's homes, there are signs to introduce herself as a prostitute. Then came masher men to their homes. Seeing the rather tolerable economic condition of prostitutes, the desire of some of the poor Muslims arose to marry these women, so that their livelihood would be adequate, so this verse was sent down as a warning not to carry out this desire. In this verse, Allah explains that adulterers cannot marry women unless they are adulterers or polytheists. Likewise, an adulteress woman cannot be married except to an adulterous man or a polytheist. This means that it is not at all appropriate for a good man to marry an adulterous woman who will defame and damage his good name. On the other hand, a good woman does not deserve to be married to an adulterer who is known by his environment as a man who is depraved and immoral, because such marriage would degrade the woman's dignity and dishonor her family. Unless the adulteress man or woman has repented, then the man or woman may marry or be married in good faith."
		   },
		   {
			"id": 2795,
			"surah": 24,
			"ayat": 4,
			"tafsir": "This verse explains that those who accuse good women (muhsanat) of adultery, then they cannot prove the truth of their accusations, by bringing in four fair witnesses who witness and see with their own eyes the act of adultery, then their punishment was eighty lashes, because they had brought shame and damaged the reputation of the person accused, as well as his family. What is meant by muhsanat women here are Muslim women who are good after reaching puberty and becoming independent. The accusers cannot be trusted with their words and their testimony cannot be accepted in any case forever, because they are liars and wicked, that is, they deliberately break God's laws. Mentioning women clearly here does not mean that this provision only applies to women. This form of punishment is called aglabiyah, namely that the provision according to custom includes other parties. Thus men are also included in the law."
		   },
		   {
			"id": 2796,
			"surah": 24,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that if those who accuse them repent, that is, withdraw their accusations, regret their actions, improve themselves and restore the good name of those accused, then their testimony can be accepted again. Some of the mufassirins are of the opinion that their testimony cannot be accepted forever even though they have repented, but are no longer classified as wicked people. Allah is Most Forgiving and Most Merciful to those who truly repent (repentance nasuha), that is, regret and leave their evil deeds forever, and repair themselves from the damage they have caused."
		   },
		   {
			"id": 2797,
			"surah": 24,
			"ayat": 6,
			"tafsir": "This verse explains that a husband who accuses his wife of committing adultery, and he cannot bring in four witnesses who have personally witnessed the alleged adultery, is asked to swear by Allah four times that his wife really has committed adultery. The oath four times to replace the four witnesses needed for anyone who accuses a woman of adultery. A husband accuses his wife of adultery sometimes because he himself saw his wife committing sexual immorality with another man, or because his wife was pregnant or gave birth, even though he was sure that the fetus in his wife's womb or the child his wife gave birth to was not the result of a relationship with his wife That. To resolve cases of this kind, the husband brings his wife before the authorities and there the accusations are stated against his wife. So the authorities ordered her husband to swear four times, in lieu of the four witnesses required for each female accuser of adultery, that he was right in his accusations. The words of the oath or its translation are: (By Allah, the Most Great, I testify that in fact I am right in my accusation against my wife \"So and So\" that she committed adultery) This oath is repeated four times."
		   },
		   {
			"id": 2798,
			"surah": 24,
			"ayat": 7,
			"tafsir": "In this verse Allah explains that after the husband has said the oath four times, on the fifth time he needs to declare that he is ready to accept Allah's curse, if he lies with his accusation. The editorial of that statement or its translation is: (Allah's curse befalls me if I lie in my accusation)."
		   },
		   {
			"id": 2799,
			"surah": 24,
			"ayat": 8,
			"tafsir": "This verse explains that in order to prevent the wife from being punished as a result of her husband's accusation, she must also testify and take an oath by Allah four times which confirms her testimony that her husband lied about her accusation. The editorial oath and its translation are as follows: (By Allah, the Most High, I testify that in fact this so-and-so, my husband, is lying in accusing me of having committed adultery) This oath is repeated four times"
		   },
		   {
			"id": 2800,
			"surah": 24,
			"ayat": 9,
			"tafsir": "In this verse it is explained that after taking the oath four times, on the fifth time she must confirm that she is ready to accept Allah's curse if her husband is right with his accusations against her. The editorial oath and its translation are as follows: (God's wrath will be upon me if my husband is true) If a husband and wife have sworn an oath and have cursed each other (mulaanah) like that, then there is a forced divorce and the divorce is forever, meaning that the husband and wife are not justified reconcile as husband and wife forever, as explained by Ali and Ibn Mas'ud by saying: wife for ever). (History of ad-Daruquthni from Ibn 'Umar) The wife was given by Allah the right to defend herself from her husband's accusations showing that Allah covers someone's disgrace. But keep in mind that if the wife has indeed committed adultery, but she denies it, then she will indeed be spared the punishment in this world, but will not be released from the punishment in the hereafter, which is of course more severe and painful. Therefore, he needs to repent then Allah will accept him as meant in the next verse."
		   },
		   {
			"id": 2801,
			"surah": 24,
			"ayat": 10,
			"tafsir": "The meaning of this verse is that it facilitates the resolution of domestic crises by allowing mutual curses which result in permanent divorce, closing the disgrace in the household, not carrying out immediate punishment in the world for the person who commits adultery, and giving the opportunity for the sinner to repent from his adultery. It is all the grace of God and His mercy. If he truly repents from his sinful acts, Allah accepts his repentance. Allah is Wise by covering a person's disgrace, not immediately punishing him in this world, and giving him the opportunity to repent. A husband who catches his wife committing adultery with another man what action will he take? If he kills the man, of course he will also be killed (as qisas for him). If he just let it happen, then it is a wrong action. And if he reveals the incident and accuses his wife of adultery even though he has no witnesses, then he will be subject to punishment, subject to flogging and his testimony and words will not be accepted forever, if he cannot bring in four witnesses who have seen it with their own eyes. that event. Is he going to go find four witnesses to be invited to witness his wife's obscene acts? An impossible thing. So by the grace and mercy of Allah, the Most Forgiving and Wise, a husband who sees his wife committing adultery with another man, is no longer burdened with finding four witnesses to accompany him to witness the adultery, but it is sufficient for him to swear an oath and state his testimony four times. times, then added one time with a statement of willingness to accept Allah's curse if he lies, as mentioned above which is known as \"li'an\". In this way he was spared the penalty of accusing him, namely eighty lashes. To prevent his accused wife from being punished for adultery, he only needs to do the same thing, namely submitting his oath and testimony four times and then adding one time the willingness to accept anathema if her husband is correct in his accusation, as mentioned above."
		   },
		   {
			"id": 2802,
			"surah": 24,
			"ayat": 11,
			"tafsir": "This verse explains that the people who fabricated false or slanderous news about the Prophet's household were from among the Muslims themselves. The sources came from Abdullah bin Ubay bin Salul, a leader of the hypocrites in Medina, shafwÂ±n bin Muaththal, the Prophet's nephew, and Hassan bin crescent. Allah comforts their hearts, so that they do not think that the incident was bad and a disaster for them, but in essence the incident was a good thing for them because with that incident, they will receive great reward and honor from Allah by sending down verses which states their cleanliness from the fake news, an authentic proof that can be read throughout the ages. Everyone who spreads fake news will receive a reply, according to their efforts and activities regarding the spread of fake news. While the person who became the first source and spread this fake news, was Abdullah bin Ubay bin Salul, as a dishonest hypocritical figure, in the hereafter he will be punished with a painful punishment."
		   },
		   {
			"id": 2803,
			"surah": 24,
			"ayat": 12,
			"tafsir": "This verse explains that Allah denounces the actions of the believers who hear the fake news as if they believe it. Why didn't they spontaneously reject the slander? Why don't they put their good thoughts first? Their faith should lead them to have a good opinion, and prevent them from being prejudiced against fellow believers, because good or bad fellow believers, in essence, are also good or bad for themselves, as Allah says: O you who believe! Stay away from prejudice, in fact some prejudice is a sin and do not find fault with others and do not let anyone in you backbite some of the others. Does any of you like to eat the flesh of his dead brother? Of course you feel disgusted. And fear Allah, verily Allah is Most Accepting of repentance, Most Merciful. (al-hujurat\/49: 12) That is, do not criticize fellow believers, because the believers are like one body. The Messenger of Allah himself prevented his companions from making such unfavorable assumptions when he picked up Aisyah using the shafwÂ±n bin Muaththal camel in broad daylight and was witnessed by many people, so as to prevent unhealthy assumptions. If there are rumors that are negative in nature, in fact it is the overflow of their hidden prejudices and hatred that has been covered up so far."
		   },
		   {
			"id": 2804,
			"surah": 24,
			"ayat": 13,
			"tafsir": "This verse shows Allah's anger at the spreaders of false news, why didn't they bring four witnesses for the truth of the slander that was spread and accused of Aisha ra? The failure to bring four witnesses by them, means that they are lying, both in the sight of Allah and among humans."
		   },
		   {
			"id": 2805,
			"surah": 24,
			"ayat": 14,
			"tafsir": "In this verse Allah explains that if it were not for the bounty in this world to the spreaders of false news with the many blessings that have been given to them, among others, given the opportunity to repent, and His mercy in the hereafter by forgiving them from their sinful and immoral acts after repentance then Allah will immediately inflict the punishment on those in the world for their actions in spreading slander and false news."
		   },
		   {
			"id": 2806,
			"surah": 24,
			"ayat": 15,
			"tafsir": "This verse explains that had it not been for the grace and mercy of Allah, surely those who spread false news would be punished; spreading fake news in various ways, namely first, they receive the fake news from mouth to mouth and then talk about it, then participate in spreading it so that not a house or a meeting place is spared from the fake news; secondly, they also share fake news that they don't know the ins and outs of; third, they take the fake news lightly, as if it doesn't mean anything, even though the fake news is a very bad thing as a result and a big sin in the sight of Allah. Allah says: Verily (against) those who offend Allah and His Messenger, Allah will curse them in this world and in the hereafter, and prepare a humiliating punishment for them. (al-Ahzab\/33: 57)"
		   },
		   {
			"id": 2807,
			"surah": 24,
			"ayat": 16,
			"tafsir": "In this verse it is explained that Allah regrets the attitude of some Muslims who do not stop discussing this slander and do not feel it is appropriate to say and continue it. They should sanctify Allah, that Allah would not allow such abomination to befall the wife of a prophet let alone the Prophet who is most glorified by Him. They should have reacted that the news was a big lie."
		   },
		   {
			"id": 2808,
			"surah": 24,
			"ayat": 17,
			"tafsir": "In this verse Allah warns the believers not to repeat these evil deeds and grave sins in the future. That is if they have faith. People who have faith certainly take lessons from what Allah teaches, do His commands, and stay away from His prohibitions. Allah has taught the attitude that must be taken in the face of news whose origins are unclear, which harm a Muslim person or community, that such news cannot be continued, but treated as fake news."
		   },
		   {
			"id": 2809,
			"surah": 24,
			"ayat": 18,
			"tafsir": "This verse explains that Allah has explained in His book in detail regarding His Shari'a, good morals and manners, actions and behavior that are pleasing to Him. He is All-Knowing of all things. Nothing is hidden from Him no matter how small, Allah repays well the deeds of those who do good, and repays with punishment those who do evil, Allah is All-Wise arranges the interests of His servants burdening them with things which brings happiness to them in this world and in the hereafter."
		   },
		   {
			"id": 2810,
			"surah": 24,
			"ayat": 19,
			"tafsir": "In this verse, Allah explains that those who enjoy broadcasting heinous and shameful acts such as adultery among muhmin believers, both men and women, they will receive punishment in this world and in the hereafter, if they do not repent and do not carry out the punishment in the world, he will be punished in hell. Dissemination of news that should not be spread is prohibited in Islam. What is required is that news about violations of ethics must be kept, as the Prophet said: The real Muslims are Muslims who are safe from the evil of their tongues and hands, and those who emigrate are those who leave Allah's prohibitions. (Al-Bukhari, Abu Daud and an-Nasa'i) And he said: No servant of a believer, covers the defects of a believer servant unless his defects are also covered by Allah in the Hereafter. And whoever thwarts the crimes of a Muslim, his crimes will also be thwarted by Allah, in the hereafter. (Ahmad bin Hanbal's history) Allah is All-Knowing of the nature and secrets of things that humans do not know. Therefore, return everything to Allah and let us not like to say something that we do not know the slightest bit about, especially matters that concern ourselves or the Prophet's family, because that will lead to destruction. Reporting on acts of adultery or pornography will have a negative impact, namely encouraging people widely to commit adultery. Because of that the bad impact is extraordinary. Regarding this matter, humans need not doubt it, because Allah is the one who knows better than humans. An example is the threat to humanity by the AIDS disease with the HIV virus for which no cure has been found until now."
		   },
		   {
			"id": 2811,
			"surah": 24,
			"ayat": 20,
			"tafsir": "In this verse Allah explains that His prohibition against the spread of pornography and adultery is because of His compassion for mankind. Allah gives His grace and mercy to those spreading fake news, who still gives them life in all its completeness. And if He were not the Most Forgiving and Most Merciful, they would surely have been destroyed. But He always does what His servants bring benefit to them, even though they have committed transgressions and sins and disobey Him. It is thanks to this ban that the world is still safe until now, because most people, especially Muslims, obey it."
		   },
		   {
			"id": 2812,
			"surah": 24,
			"ayat": 21,
			"tafsir": "In this verse, Allah warns those who believe in Him and His Messenger, so that they do not obey Satan's invitation, follow in his footsteps and steps, as if he likes and likes to spread disgrace and heinous deeds among believers. Whoever likes to follow the steps of the devil, he will surely fall into the valley of humiliation, do what is heinous and wrong, because the devil really likes to do that. Therefore, do not ever want to try to follow in his footsteps and steps. If Allah had not bestowed grace and mercy on His servants and who had always provided the greatest possible opportunity to repent of the sins they had committed, surely they would not have been clean from their sins which resulted in disappointment and misery, and there would have been a torturous doom. they are in this world, as Allah says: And Allah punishes people because of their injustice, surely He will not leave anything He left (on earth) even from creatures that creep, but Allah postpones them until an appointed time. (an- Nahl\/16: 61) Allah Who has the highest authority, however, He will still cleanse those whom He wills from His servants, by accepting their repentance like Hassan, Mistah bin Utsatsah and others. They have been cleansed of nifak disease, even though they have been actively fighting in the spread of false news known as \"haditsul-ifki\", Allah is All-Hearing of everything that is said that is accused and the provisions of cleanliness that are accused, All-Knowing of what is contained and hidden in the hearts of those who like to spread vile news that embarrasses others."
		   },
		   {
			"id": 2813,
			"surah": 24,
			"ayat": 22,
			"tafsir": "In this verse Allah explains that those who believe in Allah, they should not swear not to give help to close relatives who need help because they have done something wrong, such as Mistah, the daughter of the sister of Abu Bakr's mother. he was a poor man, emigrated from Mecca to Medina who accompanied the Prophet Muhammad, strengthening the Muslim army in the Battle of Badr. Therefore, after the revelation came down indicating that Aisyah was clean from the things she was accused of, and after Allah had forgiven those who should be forgiven, and given punishment to those who should have received that, then Abu Bakr ra, returned to being friendly. and did good and gave help to his kinsman Mistah. Mistah was his cousin, the son of his mother's sister. Believers should forgive and be tolerant of all persons involved or involved in the hadisul ifki incident. Forgiveness and returning to help them is a means to obtain forgiveness from Allah. Is there a human who does not want that his sins are forgiven by God? Who is without sin in his life? If they do, that is, forgive and help those who are in need, then Allah will forgive their sins and have mercy on them. They will enter heaven."
		   },
		   {
			"id": 2814,
			"surah": 24,
			"ayat": 23,
			"tafsir": "In this verse Allah explains that those who accuse women who are pious and believe in Allah and His Messenger, they will be kept away from Allah's mercy in this world and in the hereafter, and in the hereafter there will be a very painful punishment. , as recompense for the evil they have done. They are the source of the news that hurts the hearts of believing women, spreading the news among the believers. They have become bad for the people who helped spread the vile news, and they will bear the sin for their actions."
		   },
		   {
			"id": 2815,
			"surah": 24,
			"ayat": 24,
			"tafsir": "In this verse Allah explains that when evil people who sin in this world will be punished in the hereafter, they deny and deny their evil deeds, then their limbs become witnesses. Their tongues, hands and feet bear witness and tell what has been done in the world. By the power of Allah the members of the body can speak and tell stories, as Allah says: And they said to their skins, \"Why are you witnesses against us?\" (Skin) they replied, \"What makes us able to speak is Allah, who (also) makes everything able to speak. (Fussilat\/41: 21) And the words of the Messenger of Allah: On the Day of Judgment, disbelievers will be introduced to their deeds. He denies and denied (not admitting his actions). It was said to him, \"Your neighbors are witnesses of your actions.\" He replied, \"They are lying.\" It was said again, \"Your family and close friends of your family are witnesses.\" \"The witnesses were told to swear an oath. They swore (strengthening their testimony) then Allah closed the problem of the disbelievers and testified with their tongues, hands and feet, then they were put into hell. (History of Ibn Abi Hatim and Ibn Jarir from Abu Sa'id al-Khudri) Some commentators explain that the testimony referred to here is not in the form of utterances, but testimony in the form of movements. When it comes to the words, the tongue moves. regarding the actions of the hands or feet, move the hands and feet according to what he has done in the world."
		   },
		   {
			"id": 2816,
			"surah": 24,
			"ayat": 25,
			"tafsir": "In this verse Allah explains that in the hereafter, Allah will perfect the reward for the deeds of every human being. It is there that they will know that the punishment promised to those who commit sins and immorality in this world will really come true and there is no doubt, Allah truly keeps His promises, and explains things according to their true nature. Allah's Word: And fear the day (when) you are all returned to Allah. Then everyone is given a perfect reward according to what he has done, and they are not wronged (harmed). (al-Baqarah\/2: 281) Therefore every human being should be careful in doing something and as far as possible avoid things that cause him to perish and be punished later in the hereafter, as the words of the Prophet saw: Stay away from the seven kinds of destruction. He was asked what the seven are, O Messenger of Allah? He replied, \"Associating partners with Allah, witchcraft, killing (humans) that is forbidden by Allah, except by right, eating usury, consuming the property of orphans, running backwards from battle (fi sabilillah) and accusing good women who are pure in heart and believe in .\" (History of al-Bukhari and Muslim from Abu Hurairah)"
		   },
		   {
			"id": 2817,
			"surah": 24,
			"ayat": 26,
			"tafsir": "In this verse, Allah explains that bad women usually become the wives of bad men. Similarly, men who are not good are for women who are not good too, because at the same time these characteristics and morals contain close friendship and close association. Good women are for good men too, as it is known that hospitality between one and another is established because of similarities in characteristics, morals, ways of getting along and so on. Likewise, good men are for good women too, the stipulation will not change from that. Therefore, if it is believed that the Messenger of Allah is the best man, and the chosen one among the people before and after, then surely Rasulullah's wife Aisha ra is the best woman too. This is a lie and an accusation leveled against Aisyah ra. Those who are good, both men and women including Safwan bin Muattal and Aisyah ra. they obtain forgiveness from Allah and glorious sustenance with Allah in heaven."
		   },
		   {
			"id": 2818,
			"surah": 24,
			"ayat": 27,
			"tafsir": "In this verse, Allah teaches believers how to get along with each other in order to maintain and cultivate love and affection and good association among them, that is, do not enter other people's homes unless they have been given permission and greet them first, so as not to see disgrace. other people, seeing things that other people don't deserve to see, don't witness things that people usually hide and are very careful not to see others. Someone who asks permission to enter someone's house, which is marked by greeting, if you don't get an answer, you should do it up to three times. If there is a permit, then enter and if not as good as he went home. That way is better, that is, if you are going to enter someone else's house, you must first ask permission, greet them and wait until permission is received, if not, it's better to just go home."
		   },
		   {
			"id": 2819,
			"surah": 24,
			"ayat": 28,
			"tafsir": "In this verse Allah explains that if you want to enter another person's house and do not find someone in it who has the right to give permission or if there is no occupant, do not ever enter it, before obtaining permission, unless there is an urgent matter such as a fire in it, which is worrisome. will spread to other places, or to prevent an evil deed from occurring in it, then it is permissible to enter it even if there is no permission. But if the person who has the right to give permission to enter, recommends that he go home, because there are things in the house that the owner of the house feels ashamed to see other people, then he must go home because that way guarantees everyone's safety. Allah is All-Knowing of the contents of the heart and the intentions contained therein."
		   },
		   {
			"id": 2820,
			"surah": 24,
			"ayat": 29,
			"tafsir": "It was narrated by al-Wahidi, that Abu Bakr Siddiq once said, \"O Messenger of Allah, in fact Allah has sent down to you a verse that commands us to ask permission to enter a house. In doing trade, we sometimes stay in an inn. Is it not permissible to enter an inn as well? without permission?\" Then come down this verse. In this verse Allah explains that places that are not specifically provided for residence, but only for temporary stays for people who need them, such as hotels, inns, recreation areas, rest and so on, there are no obstacles and it is a sin to enter them without permission, because there are something needed in it. Things that are usually inappropriate and impolite to be seen by other people in a residential house, are not found in the places mentioned above. Allah knows what is expressed in a person's speech when asking permission to enter the house where one lives, and knows what is hidden in the heart to see the disgrace and things that are not natural and shame the owner of the house."
		   },
		   {
			"id": 2821,
			"surah": 24,
			"ayat": 30,
			"tafsir": "In this verse Allah commands His Messenger and those who believe, so that they guard and restrain their eyes from things that are forbidden for them to see, except for certain things that they are allowed to see. If by chance and unintentionally their gaze is directed to something that is forbidden, they immediately divert that view in order to avoid seeing things that are forbidden. As the words of Rasulullah SAW. From Jarir bin Abdullah al-Bajali he asked Rasulullah SAW. about the view\/vision (of women) suddenly, then he ordered to look away from me (History of Muslim, Abu Daud, Ahmad, at-Tirmizi and an-Nasai). your first glance with a second glance, because what is permissible for you is only the first (unintentional) glance while the second glance is no longer permissible (History of Abu Daud from Buraidah) In addition, Allah ordered His Messenger to advise men who believe that they protect their genitals from immoral acts such as adultery, homosexuality and so on. The words of the Prophet narrated by Ahmad and ashabus-sunan. Take care of your private parts (don't let other people see) except by your wife or your slave. (History of Ahmad and Ashabus-Sunan) Protecting the eyes from seeing things that are forbidden and protecting the genitals from committing adultery or homosexuality are good and holy deeds, both for one's soul and religion. The words of the Prophet narrated by Ahmad from Abi Umamah: Every Muslim who sees the beauty of a woman, then he lowers his head and closes his eyes, Allah replaces it as a worship. (Ahmad's history from Abu Umamah)"
		   },
		   {
			"id": 2822,
			"surah": 24,
			"ayat": 31,
			"tafsir": "In this verse, Allah instructs His Messenger to remind believing women not to look at things that are not lawful for them, such as male or female private parts, especially between the navel and knees for men and the entire body for women. . Likewise, they are ordered to guard their genitals (farji) so that they do not fall into the valley of adultery, or be seen by other people. The words of Rasulullah SAW. From Umm Salamah, that when she and Maimunah were beside the Messenger of Allah, Abdullah bin Umi Maktum came and entered the Prophet's house (at that time there was an order for the hijab). The Messenger of Allah ordered Umm Salamah and Maimunah to take shelter (hijab) from Abdullah bin Umi Maktum, Umm Salamah said, O Messenger of Allah, isn't he blind and doesn't see and knows us? Rasulullah replied, are you both blind and don't see him? (History of Abu Daud and at-Tirmidhi) Similarly, women are required to cover their head and chest with a headscarf, so that their hair and neck and chest are not visible. Because of the habit of their women covering their heads but the veil is strung behind them so that their neck and part of their chest are visible, as is done by ignorant women. In addition, women are prohibited from showing their jewelery to others, except for those that cannot be hidden, such as rings, kohl\/characteristics, girlfriends\/henna, and so on. It is different with bracelets, anklets, necklaces, crowns, sashes, earrings, all of which are prohibited from showing, because they are found in the parts of the body that are included in the genitals of women, because these objects are found on the arms, calves, neck, head, and ears that no one else should see. The jewelery can only be seen by the husband, even the husband may see all the members of his wife's body, his father, husband's father (in-law), his sons, his husband's sons, his brothers, his brothers' sons, his sons. his sister, because of the close association between them, because indecent things rarely happened with them. Likewise, jewelery may be seen by fellow Muslim women, or their slaves, or male servants\/servants who have no desire for women, either because they are old, impotent, or because their genitals have been cut off. Jewelry can also be shown and seen by children who do not understand about women's private parts, so lust will not arise because they do not have lust for women. In addition to women being prohibited from showing their jewelry, they are also prohibited from stamping their feet, with the intention of showing and showing the jewelry they are wearing which should be hidden. The women would often deliberately put something in their anklets, so that they would sound when he walked, even if slowly, to attract attention. Because some humans are sometimes more interested in a distinctive sound than the object itself, while the object is in a woman's calf. At the end of this verse, Allah recommends that humans repent and regain consciousness and be obedient and obedient in carrying out His commands away from His prohibitions, such as limiting views, protecting genitals\/genitals, not entering other people's homes without permission and greeting, if all that they do , will definitely be happy both in this world and in the hereafter."
		   },
		   {
			"id": 2823,
			"surah": 24,
			"ayat": 32,
			"tafsir": "In this verse, Allah calls on all those who bear responsibility for the sanctity and cleanliness of the morals of the people, so that they marry men who are not married, whether widowers or youths, and women who are not married, whether widows or girls. Likewise for male or female servants who deserve to be married, a similar opportunity should also be given. This call applies to all guardians (marriage guardians) such as fathers, uncles and brothers who are responsible for the safety of their families, also applies to people who have slaves, they should not prevent family members or slaves under their authority from getting married , as long as the conditions for marriage have been met. Thus forming a family that is healthy, clean and respectable. It is from this family that an ummah will be formed and surely that ummah or nation will also be strong and honorable. Therefore Rasulullah saw said: Marriage is included in my Sunnah. Whoever hates my Sunnah, he is not in my group. (Muslim History) If among those who wish to marry, there are those who are in a poor condition, so they are not able to fulfill all the needs of their marriage and are not able to fulfill all the needs of their household, let people like it is encouraged and assisted to carry out its good intentions. Don't let someone's poverty be a reason for canceling marriage, as long as it really can be expected from him a strong will to get married. Who knows, at the end of the day, Allah will open for him the doors of lawful, good sustenance and give him His grace and mercy. Verily, Allah is the Most Extensive of His Mercy and His Mercy, the Most Vast of His Knowledge. He widens sustenance for whom He wills and constricts sustenance for whom He wills according to the wisdom of His wisdom. Ibn Abbas said, Allah recommends marriage and promotes it, and orders people to marry free people and slaves, and Allah promises to give sufficient wealth to those who have families. It was narrated from Abu Hurairah Rasulullah said: There are three kinds of people whom Allah is obliged to help: people who marry with the intention of maintaining their chastity, slaves who try to free themselves by paying a ransom to their master, and people who fight in the way of Allah. (Ahmad's history)"
		   },
		   {
			"id": 2824,
			"surah": 24,
			"ayat": 33,
			"tafsir": "For people who really cannot afford to pay for the needs of marriage and family life needs while their guardians and family are also unable to help him, then he should hold back until he has the ability to do so. Refraining means staying away from all actions that are contrary to decency, especially committing adultery because this act is very heinous and includes a grave sin. Among the objectives of the recommendation to marry men and women who are not married or married is to maintain the morals of the people and clean society from immoral acts. If a man or woman who has not been able to marry does not take care of himself and maintain the cleanliness of his community, then of course this goal will not be achieved. As a way to keep oneself from falling into the abyss of immorality, the Great Prophet gave instructions by saying: O youths! Whoever among you is able to marry, let him marry because marriage guarantees the maintenance of eyes and the maintenance of honor. And whoever is unable, then let him fast, because fasting reduces his sex instinct. (Shahihain history from Ibn Mas'ud) In the past the opportunity to commit immoral acts was very narrow because society was very strict about guarding against the possibility of their occurrence and if it was found out that the punishment that was imposed on the perpetrators was very heavy. Therefore, immoral acts are rare. It's different today, where people, especially in big cities, don't pay much heed to this problem, even in certain localized areas, so many of our youths who lack strong faith fall into this underworld. Therefore it is recommended to young people and even to all men who are not married and women who are not married who are obedient and obedient to the teachings of their religion, to really maintain personal and moral cleanliness from this accursed act, especially by fasting as recommended by the Prophet and by busying oneself at work and various kinds of affairs that have many benefits or doing various kinds of hobbies that are liked such as sports, music and so on. Then Allah ordered the owners of slaves to give opportunities to their slaves who wanted to free themselves from slavery by redeeming themselves with wealth, if it turned out that the slaves had good intentions and had honest and trustworthy qualities. Usually the payment was made gradually so that when the specified payment amount was paid off, the slave became free. This is a way prescribed by Islam to eliminate slavery, because basically Islam does not recognize slavery because it is against humanity and also against the dignity of a person who is highly respected in Islam, because all the Children of Adam have been glorified by Allah, as stated in His word. . And indeed, We have glorified the children of Adam, and We carried them on land and in the sea, and We gave them sustenance from the good and We have preferred them over many creatures that We have created with perfect advantages. (al-Isra'\/17: 70) But because during the time of the Prophet all nations practiced slavery, the Prophet Muhammad acknowledged that slavery as an emergency and temporary law. Because the enemies of the Muslims when they defeat the Muslims in a war they consider the prisoners who consist of the Muslims to be considered as slaves as well. Because slavery is contrary to the basic teachings of Islam, then start eradicating it, including as mentioned in this verse. There are many other ways to free the slave, such as kaffarat having intercourse during the month of fasting or during ihram, kaffarat killing, kaffarat breaking an oath and so on. In addition to calling on slave owners to give their slaves the opportunity to free themselves, Muslims are also calling on Muslims to help these slaves with property in the form of zakat or alms so that in a relatively short time the slaves can free themselves. In fact, the existence of slavery and the large number of slaves in a society led to a decline in the morale of the society itself, and led to prostitution, because slaves felt that they were far lower than free people. Thus they do not consider it their duty to maintain high morals and they easily become the play of free men and the means of self-gratification. Furthermore, as a way to eradicate immorality and keep society clean from all kinds of actions that are contrary to morality and morality, Allah forbids the owners of female slaves from forcing them to commit acts of prostitution, while the slaves themselves do not want to do it and want to continue to do so. clean and preserved from that dirty deed. Many of the female slave owners, because they were greedy for their possessions and wealth, did not hesitate and did not feel ashamed in the slightest to prostitute their slaves to anyone who was willing to pay. If there is coercion like this after the revelation of this verse then the slave owners will have a big sin. While the slaves who were prostituted were innocent because they had to carry out the orders of their owners. Hopefully Allah, the Most Merciful and Most Forgiving, forgives them, because they commit immoral acts not of their own volition, but because they are forced by their owners. It was narrated by Muslim and Abu Daud from Jabir ra that Abdullah bin Ubay bin Salul had two very (servants), namely Musaikah and Umaimah. Then he forced her into prostitution, then they complained about it to the Prophet, then this verse was revealed: Those are the rules that Allah revealed for the harmony and cleanliness of a society, if implemented properly it will create a society that is clean, safe and happy far from evil things. thing that harms him."
		   },
		   {
			"id": 2825,
			"surah": 24,
			"ayat": 34,
			"tafsir": "Allah has revealed His verses which are clearly good concerning laws that are very useful for the happiness of human society. Likewise, Allah has sent down stories that can serve as examples and role models, namely the stories of the apostles and earlier people such as the story of the Prophet Yusuf, the story of Maryam and so on, then it depends on the man himself whether he will benefit from the Shari'a and the story. -that story or will he still turn away without heeding those teachings and examples. But those teachings and stories are certainly very useful and beneficial for believers. Ali bin Abi Talib said about the Qur'an, \"In it there are laws (which can be used as guidelines) the stories of the people in the past, and news about what will happen later. He is the one who distinguishes (between the right and the wrong). not words that are useless (just for fun). Whoever ignores them no matter how strong they will be broken by Allah. Whoever seeks guidance (by referring to) other than the Qur'an, Allah will lead him astray.\""
		   },
		   {
			"id": 2826,
			"surah": 24,
			"ayat": 35,
			"tafsir": "This verse explains that Allah is the Giver of light to the heavens and the earth and all that is in them. With that light, everything runs in an orderly and regular manner, no one deviates from the path that has been determined for him, like a person walking in the middle of a pitch black night and in his hand there is a bright lamp that illuminates what is around him. Of course he will be safe on his way and will not get lost or fall into a deep abyss, no matter how many twists and turns he goes through. In contrast to people who do not have lights, of course, will encounter many difficulties. Groping here and there walking stupefied because they don't know the direction, then surely this person will get lost or have an accident because he doesn't see the natural surroundings. The benefits of the light that God has given to this universe are very great. The light that God gives is not just any light. He is a special light that has no equal, because that light not only illuminates the outer world, but illuminates the inward. Allah gives an analogy for His light with something that can be seen and felt by humans at the time this verse was revealed, namely by the light of a lamp which was considered at that time to be the most brilliant light. Maybe for us now the light is meaningless when compared to the light of a thousand watt electric light, let alone the light that can penetrate the layers in front of it. Actually the light that is the source of power for the universe cannot be compared to any light that humans can find like laser light for example. Allah gives an analogy for His light with the light of a lamp that is located in a place on the wall of a house that is deliberately made to place a lamp so that the light is very bright, in contrast to a lamp that is placed in the middle of the house, the light will be reduced because of the area of the room that absorbs the light. . The wick of the lamp is in a clean and clear glass. The glass itself was as bright as crystal. The oil is pressed from olives that are planted on the hill, always exposed to the morning and evening sun. So in this verse it is likened to plants that neither grow in the east nor in the west, because if the tree grows in the east, maybe in the afternoon the sun will not be hit by it again, and vice versa. The oil of the lamp itself, because it is clear and of good quality, almost glows, even though the fire has not touched it, especially when it is lit, of course the light it gives off will double. In addition to the brightness of the lamp itself, the light is also reflected by the location, so the light reflected by the lamp is multiplied. Such is the parable for the light of Allah even though there is a great difference between the light of Allah and the light which is used as a parable. Allah gives instructions to whoever He wants to get that light so that he always takes the straight path that conveys it to his good aspirations and always acts wisely in dealing with various kinds of problems in his life. Blessed is the person who gets the light of Divine Light, because he already has the right guidelines that will not lead him to things that are not true and misleading. In order to obtain Divine Nur, a person must truly believe in and obey Allah's commands and stay away from all immoral acts. Imam Syafi'i once asked his teacher named Waki' about his memorization which was never steady and quickly forgotten, so his teacher advised him to stay away from all immoral acts, because knowledge is Divine Nur, and Divine Nur will not be given to people who commit immorality. As in the verse below: I complained to Waki' about my bad memorization. Then he advised me to leave disobedience. He told me that knowledge is light, and Allah's light is not given to those who commit sins. Yahya bin Salam once said, \"The heart of a believer can know what is right before it is explained to him, because his heart is always in accordance with the truth.\" This is what is meant by the words of the Prophet Muhammad. Beware of the hunch of the believer, because he sees with the Light of Allah. (Al-Bukhari's history in the book at-Tarikh al-Kabir from Abu Sa'id al-Khudri) Of course what is meant by the believers here are those who truly believe and fear Allah completely. Ibn 'Abbas said about this verse, \"This is an example for Allah's Light and His guidance which is in the hearts of believers. If the oil of a lamp can glow itself before it is touched by fire, and when it is touched by fire it shines more brilliantly, then so does the heart of a person. believer, he always gets instructions in his actions before he is given knowledge. If he is given knowledge, his confidence will increase, and the light will increase in his heart."
		   },
		   {
			"id": 2827,
			"surah": 24,
			"ayat": 36,
			"tafsir": "Among those whom Allah will give the light of Divine Light are those who always chant Allah's name in the mosques in the morning and evening and glorify Him to purify Him. They are not negligent in remembering Allah and performing their prayers even though they are doing business and buying and selling, they are not reluctant to pay zakat because they are greedy for accumulating wealth, they always remember the Hereafter when because of the enormity many hearts are shaken and their eyes widen. This does not mean that they completely neglected the affairs of the world and spent their time and energy on dhikr and chanting, as this was disapproved of by the Prophet Muhammad and is contrary to Islamic principles. The Prophet Muhammad has said: Strive like the efforts of people who think that he will not die forever and be vigilant like the vigilance of people who fear that they will die tomorrow. (Al-Baihaqi history from Ibn Auz) Worldly affairs and ukhrawi affairs are both equally important in Islam. A Muslim must be good at creating a balance between the two matters, lest one of the two be overpowered by the other. Neglecting the affairs of the afterlife because they are concerned with the affairs of the world is forbidden, as stated in His word: O you who believe! Do not let your possessions and your children distract you from the remembrance of Allah. And whoever does so, then they are the ones who are the losers. (al-Munafiqun\/63: 9) And His words: O you who believe! If you have been called upon to pray on Friday, then immediately remember Allah and leave buying and selling. That is better for you if you know. (al-Jumu'ah\/62: 9) But when the obligations towards religion have been fulfilled as well as possible, a Muslim is ordered to return to taking care of his worldly affairs with the provision that he does not forget to remember Allah so that he does not violate His commands or carry out the prohibitions Him as stated in His words: When the prayers have been carried out, then scatter you on the earth; seek Allah's bounty and remember Allah a lot so that you will be successful. (al-Jumu'ah\/62: 10) On the other hand, neglecting the affairs of the world and only concerned with matters of the afterlife is also disgraceful, because Muslims are commanded by Allah to seek sustenance to meet their needs and those of their families. People who try to balance between worldly affairs and ukhrawi affairs are the people who are pleased by Allah. He works for his world because he obeys and obeys His commands and instructions. He does good deeds for the afterlife because he is obedient and obedient to His orders and instructions, as a preparation for facing the afterlife which is very terrible and full of difficulties, as mentioned in His word: Indeed, we fear (the punishment) of God on the day (when) people -those with sour faces are full of difficulties.\" So Allah protected them from the troubles that day, and gave them joy and joy. And He rewarded them for their patience (in the form of) paradise and (clothing) silk. (al-Insan\/76: 10-12)"
		   },
		   {
			"id": 2828,
			"surah": 24,
			"ayat": 37,
			"tafsir": "Among those whom Allah will give the light of Divine Light are those who always chant Allah's name in the mosques in the morning and evening and glorify Him to purify Him. They are not negligent in remembering Allah and performing their prayers even though they are doing business and buying and selling, they are not reluctant to pay zakat because they are greedy for accumulating wealth, they always remember the Hereafter when because of the enormity many hearts are shaken and their eyes widen. This does not mean that they completely neglected the affairs of the world and spent their time and energy on dhikr and chanting, as this was disapproved of by the Prophet Muhammad and is contrary to Islamic principles. The Prophet Muhammad has said: Strive like the efforts of people who think that he will not die forever and be vigilant like the vigilance of people who fear that they will die tomorrow. (Al-Baihaqi history from Ibn Auz) Worldly affairs and ukhrawi affairs are both equally important in Islam. A Muslim must be good at creating a balance between the two matters, lest one of the two be overpowered by the other. Neglecting the affairs of the afterlife because they are concerned with the affairs of the world is forbidden, as stated in His word: O you who believe! Do not let your possessions and your children distract you from the remembrance of Allah. And whoever does so, then they are the ones who are the losers. (al-Munafiqun\/63: 9) And His words: O you who believe! If you have been called upon to pray on Friday, then immediately remember Allah and leave buying and selling. That is better for you if you know. (al-Jumu'ah\/62: 9) But when the obligations towards religion have been fulfilled as well as possible, a Muslim is ordered to return to taking care of his worldly affairs with the provision that he does not forget to remember Allah so that he does not violate His commands or carry out the prohibitions Him as stated in His words: When the prayers have been carried out, then scatter you on the earth; seek Allah's bounty and remember Allah a lot so that you will be successful. (al-Jumu'ah\/62: 10) On the other hand, neglecting the affairs of the world and only concerned with matters of the afterlife is also disgraceful, because Muslims are commanded by Allah to seek sustenance to meet their needs and those of their families. People who try to balance between worldly affairs and ukhrawi affairs are the people who are pleased by Allah. He works for his world because he obeys and obeys His commands and instructions. He does good deeds for the afterlife because he is obedient and obedient to His orders and instructions, as a preparation for facing the afterlife which is very terrible and full of difficulties, as mentioned in His word: Indeed, we fear (the punishment) of God on the day (when) people -those with sour faces are full of difficulties.\" So Allah protected them from the troubles that day, and gave them joy and joy. And He rewarded them for their patience (in the form of) paradise and (clothing) silk. (al-Insan\/76: 10-12)"
		   },
		   {
			"id": 2829,
			"surah": 24,
			"ayat": 38,
			"tafsir": "People with such a nature, always fear and put their trust in Allah, they are pleased by Allah and receive the radiance of Divine Nur in their lives because they are always guided by His teachings and do many good deeds, doing good deeds both obligatory and sunnah. They will receive a double reward from Allah according to His word: Whoever does good will be rewarded tenfold for his deeds. And whoever commits a crime will be rewarded in proportion to his crime. They are not the least bit disadvantaged (tortured). (al-An'am\/6: 160) Rasulullah explained Allah's promise to pious people in a hadith qudsi. I (Allah) have prepared for My pious servants blessings which no eye has seen, no ear has heard, and no human heart has ever entered. (History of ash-Syaikhan, Ahmad and Ibn Majah from Abu Hurairah) Thus Allah rewards His pious servants who believe and fear Him with infinite favors and bounties."
		   },
		   {
			"id": 2830,
			"surah": 24,
			"ayat": 39,
			"tafsir": "In this verse, Allah gives a parable for the charities of the disbelievers that seem good and have great benefits, such as establishing orphanages for orphans, hospitals or polyclinics to treat those who are unable, helping the poor by providing clothes and food, establish social associations or foundations, and other social charities that are highly recommended by Islam and are seen as charities with great rewards. Although the deeds of the disbelievers are of great benefit to society, their deeds are of no value in the sight of Allah, because the main condition for receiving a charity is faith in Him and not associate anything with Him, let alone considering creatures His, whether animate or inanimate as God whose mercy and compassion are expected or whose wrath is feared. Allah likens the deeds of disbelievers to a mirage in the desert, visible from a distance like clear water that can quench thirst and refresh the body that has been hit by the hot sun. The people who saw it rushed towards the mirage, but when they got there, all hope was gone and replaced with a feeling of disappointment and despair because what he saw like clear water was nothing but a mere shadow. Not only do they feel disappointed and hopeless, because they don't get a fresh drink, but they are also haunted by bad luck because in front of them are waiting for unbearable suffering, namely thirst and thirst due to the hot sun being hit while all that is visible around them is only sand. mere wide without borders. Likewise the disbelievers in the hereafter, they think that their deeds in this world will help and deliver them from the greatness and difficulties in the desert of Mahsyar, but in fact all of that is of no use at all because they are not based on faith, sincerity and honesty. Not only were they disappointed by false hopes, but in front of them there was also a reply for all their sins and unbelief, namely Hell, which was very hot and blazing. Allah has informed them of the calculation of their charity and the Angel Zabaniah is ready to lead them to hell. Allah said: And We will show them all the deeds they do, then We will make those deeds (like) flying dust. (al-Furqan\/25: 23)"
		   },
		   {
			"id": 2831,
			"surah": 24,
			"ayat": 40,
			"tafsir": "In this verse, Allah gives a parable for the charity of the disbelievers with layers of black darkness, like the darkness of a deep sea at night where the waves continuously increase the darkness in the sea, coupled with thick clouds. the black one covered the sky so that not a shred of light could be seen. All the big and small stars could not reveal themselves to the surface of the sea because they were blocked by the thick and black clouds. Nothing could be seen at that time, so when someone stretched out his hand in front of his face it was not visible at all even though it was really close to his eyes. Such is the blackness of the deeds of the disbelievers. Let alone that charity will be able to help in facing the dangers and difficulties in the afterlife which is very terrible, even seeing that charity is impossible, because all the deeds he does are not accepted and disapproved by Allah because of his misguided beliefs and utterances that contain arrogance or actions. those who are unjust. Al-Hasan al-Basri said about this, \"The disbeliever is in three darknesses, namely the darkness of faith, the darkness of speech and the darkness of deeds.\" Whereas Ibn 'Abbas stated, \"The darkness of his heart, his sight and hearing.\" Such is the condition of the disbelievers, they are in utter darkness, because they do not receive the slightest light from the Divine. Allah will not give them the light of His Light, that's why they are always in darkness. There are no guidelines that can be used as guidelines because indeed they have gone very far astray and there is no hope for them to return to the right path as His words: And Allah misleads those who are unjust and Allah does what He wills. (Ibrahim\/14: 27)"
		   },
		   {
			"id": 2832,
			"surah": 24,
			"ayat": 41,
			"tafsir": "In this verse Allah directs the mind of the Prophet Muhammad in particular and the human mind in general to pay attention to nature, both in the heavens and on earth so that he realizes that besides humans as creatures of Allah, there are various kinds of His creatures in nature. When paid attention to, it will surely lead to confidence in the power of His Creator and His wisdom to arrange everything neatly and in balance. All of these creatures, even though they are not realized by humans, are submissive and glorify Him according to all the provisions that have been determined by Him. If there is a star that goes out of its orbit and does not comply with the order that has been set by Allah, there will certainly be a collision between the stars which results in the destruction of the natural order or the harmonious solar system and the destruction of some of the stars and it is not impossible for the earth we will suffer great calamity as a result. However, it turns out that there has never been such an incident and all creatures believe that Allah always maintains all the rules that He has established. God told humans to pay attention to each of His creatures that are small and weak, namely birds that can fly in the air and sometimes look as if they stop for a moment in the clouds unaffected by the earth's gravity. Allah's Word: Do they not see the birds that can fly in the sky easily. Nothing can hold him but Allah. Indeed, in that there are truly signs (of Allah's greatness) for those who believe. (an-Nahl\/16: 79) Every item that has weight will surely fall to the earth. But even so, the birds continued to frolic in the air safely without the slightest fear of falling to the ground. This is because Allah has arranged the shape of the birds which are equipped with wings that can be spread and closed. With such a shape and arrangement, birds can overcome the earth's gravity on something that has weight and has weight. We cannot see that the birds are enjoying God's grace to them, giving thanks and glorifying God their Creator. Glorifying for creatures other than humans is not like humans glorifying, that is, reciting dhikr in the name of Allah, but these creatures have certain ways that we cannot know. Allah is the All-Knowing of how they glorify and pray. When we realize that all of Allah's creatures, starting from the smallest to the greatest exalts to glorify His name and are grateful for His blessings and gifts, it is very surprising why among humans who have been endowed with reason and feelings, they still deny and disobedient to Him. There are still those among them who worship other than Him and associate Him with idols or objects created by Him. They never glorify Him, purify Him and give thanks for His blessings. How stupid people like that are, even though creatures that don't have any sense always glorify the name of Allah. Once upon a time the Prophet Muhammad, with the grace of his Lord, heard the pebbles under his feet glorifying Allah. Also once when the Prophet David read the Psalms with a melodious voice, Allah ordered the mountains and birds to glorify with the Prophet Dawud to sanctify His name as stated in His words: And indeed, We have given David a gift from Us. (We said), \"O mountains and birds! Glorify again and again with David,\" and We have softened the iron for him, (Saba'\/34: 10)"
		   },
		   {
			"id": 2833,
			"surah": 24,
			"ayat": 42,
			"tafsir": "This verse emphasizes that Allah, who owns the heavens and the earth, is the One who rules and rules over everything between the two. It is to Him that all His creatures will return. Therefore, let humans submit and obey Him and always be grateful to praise Him for all His blessings and gifts. Let man think and meditate on His greatness and power which can be proven by observing and analyzing His creations in the heavens and on earth."
		   },
		   {
			"id": 2834,
			"surah": 24,
			"ayat": 43,
			"tafsir": "In this verse, Allah also directs the attention of the Prophet saw and people to pay attention and reflect on how He drove the clouds with His power from one place to another and then gathered the scattered clouds in an area, so that there was a pile of heavy black clouds. as if the clouds were huge mountains walking in the sky. From these clouds it rains heavily in that area and sometimes the rain is mixed with ice. For those who are on this earth, it is rare to see thick clouds that float like mountains, but if we are in an airplane, we will see that under the plane we are traveling on, the clouds are moving slowly, it is indeed like towering mountains here and there, and if the clouds it sends down rain, it is clear how the water descends to the earth. The heavy rain gives grace and great benefits for humans, because the rice fields and fields that have been dry due to the dry season, become fertile again and various kinds of plants thrive so that humans can reap the results happily and happily. But there are also heavy and continuous rains that cause flooding everywhere. The rice fields were submerged and even the entire village was submerged, so the heavy rain became disastrous for humans and not as a beneficial blessing. Everything that happens is according to His will and will. Until now there is no single science that can regulate wind circulation and cloud travel so as to prevent floods and catastrophes. Everywhere there were dangerous typhoons and torrential rains but scientists could not overcome them. All of this shows the power of Allah, bestowing mercy and favors on whom He wills, and inflicting calamity and calamity upon whomever He wills. According to science and technology scientists, the requirements for how rain can fall, start from the presence of clouds that carry water vapor. These clouds are called cumulus clouds. Clumps of cumulus clouds that were originally scattered, will be \"collected\" by the wind. When the clouds have merged, there will be a wind movement that points upward and carries this collection of clouds, which are now called cumulus nimbus clouds, upwards. This upward movement reaches the ideal height (and temperature), where the water vapor will turn into ice crystals. When ice crystals fall to earth, and the temperature becomes higher, they will turn into raindrops. Among the oddities of nature that can be seen by humans is the occurrence of lightning which continuously occurs when the sky is cloudy and before it rains. Even though scientists can analyze the causes of events, they cannot master and control them. Isn't this a proof for Allah's power in this universe?"
		   },
		   {
			"id": 2835,
			"surah": 24,
			"ayat": 44,
			"tafsir": "Among the things that show God's power is the turning of day into night and night into day. Astronomers can only analyze the cause of night in an area as well as day. This stems from the journey of the sun and the rotation of the earth. But they are completely incapable of changing God's provisions and decrees. They cannot lengthen or shorten the day or night in an area because the rotation of night and day is a provision from the Almighty. All of this should be a concern and a lesson for those who think that humans as creatures of God, with their little knowledge, can only analyze events in nature, but they cannot control them because the real power is in the hands of God. According to scientists, the change of day to night optically (vision) is a shift in the color of light that is diffracted from initially yellow light, to orange to red (before the time of the Isha prayer) to infrared during the Isha prayer. After that, it gets late at night, then the earth is bombarded by shorter waves that can be harmful to humans. The effects of various waves from sunlight with shorter wavelengths are not yet fully understood. But what is clear is that very short waves, towards X-waves or X-ray waves, are quite dangerous for the human body, especially if the power is high. Therefore it is recommended for humans to stay at home and rest according to the guidance of the Qur'an."
		   },
		   {
			"id": 2836,
			"surah": 24,
			"ayat": 45,
			"tafsir": "In this verse Allah directs human attention to pay attention to animals of various types and shapes. He has created all kinds of animals out of water. It turns out that water is indeed the mainstay of animal life because most of the elements contained in their bodies are water. Animals cannot survive without water. Among these animals there are those that crawl, move and walk on their bellies like snakes. Some of them walk on two legs and some walk on four legs, and we can even see that some of these animals have many legs, but this verse is not mentioned because Allah explains that He creates what He wills, not only animals that have many legs but include all animals of various forms. Each of these animals was given instincts, limbs, and means of defense so that he could preserve his life. Zoologists are amazed to note the arrangement of the limbs of each animal so that it can survive or escape from its enemies who want to destroy it. It all shows the power of God, the thoroughness and firmness of His creation. Humans, no matter how high their knowledge and technology, cannot create something like God's creation, as mentioned in His word: (That is) God's creation, which created everything perfectly. Indeed, He is All-Seer of what you do. (an-Naml\/27: 88) According to science and technology, the link between water and life can be identified as follows: 1. Water is thought to be very close to living things, because, especially for most animals, it comes from sperm fluid. It is indicated that the diversity of animals \"comes\" from certain specific water (sperm) and produces according to the characteristics of each animal exemplified in the verse. 2. The second understanding is regarding water as the origin of life, presumably because water is an important part for creatures to live. In fact, most of the body parts of living things consist of water. For example, in humans, 70% of their body weight consists of water. Humans cannot survive long if only 20% of the water supply in their body is lost. However, humans can survive for 60 days without eating. Meanwhile, they will die within 3-10 days without drinking. It is also known that water is the main ingredient in the formation of blood, lymph fluid, urine, tears, milk fluids and all other organs in the human body. That all life started from water. Water here is more appropriate when interpreted as sea. Modern theories about the origin of life were not firmly agreed upon until about two or three centuries ago. Prior to that, the theory that emerged was a concept known as \"spontaneous generation\". In this concept it is believed that living things exist by themselves and arise from nothing. This theory was later challenged by several experts around the 1850s, including by Louis Pasteur. Starting with the research done by Huxley, and up to the present research, other theories are offered as alternatives. This theory believes that life arose from a long and complex chain of chemical reactions. This chemical chain is believed to start from the depths of the oceans. It is suspected that it was in the sea that life began because the atmospheric conditions at that time had not yet developed into an area habitable for living things. Ultraviolet radiation that is too strong will kill every living thing on land. It is estimated that new life moved towards land in 425 million years ago, when the ozone layer began to form and protect the earth's surface from ultraviolet radiation. Protoplasm is the basis of all living things. While the work of protoplasm in supporting life is very dependent on the presence of water. Back water became everything. From this description the role of water for life is very clear, starting from the existence of living things on earth (originating from the depths of the sea), for their survival (water is needed for the formation of organs and carrying out organ functions) and starting life (especially for certain groups of \"water\" animals which specifically “sperm). Apart from protoplasm, which is the basis of life, most parts of the body contain water. This indication states that even though they live on land, everything is still related to the place where life started, namely the ocean. In vertebrates (mammals, birds, etc.), a connection with the sea is seen at several stages of fetal development (embryology). Some of the organs as possessed by fish are owned by them. The description above seems to agree with the theory of evolution put forward by Charles Darwin. It should be noted here, however, that the Qur'an does not provide any special opportunity to support the theory of evolution. Although all of the above verses give unmistakable indications that Allah created all living things from water, there are many other verses which emphasize His Power over all that exists in the universe, such as, among others, the two passages of verse 47 of surahh Ali 'Imran \/3 (\" ........ He just said \"be\" then .....\" ) and surahh Fussilat\/41:39."
		   },
		   {
			"id": 2837,
			"surah": 24,
			"ayat": 46,
			"tafsir": "Everything mentioned in the verses before this shows the power of Allah and the perfection of His creation. For scientists in all fields the widest possible field is opened to examine and investigate the various kinds of creations of Allah, and marvel at how solid and perfect these creations are. Indeed, in that there is clear evidence about the existence of a Supreme Creator, but there are also many among humans, even though they admire all of Allah's creations, do not benefit from their research except just research and do not bring it to faith. This is indeed the case, for Allah only points whomever He wills to the straight path."
		   },
		   {
			"id": 2838,
			"surah": 24,
			"ayat": 47,
			"tafsir": "In this verse Allah explains the characteristics of hypocrites, they always say we believe in Allah and His Messenger, but they always do things that are contrary to Islam and never obey and obey the laws of Allah and His Messenger. Actually they are not believers. Their faith is only in their mouths, but their hearts are still disbelievers, and filled with the filth of lust. If something goes in their favor, they can swear that they are truly believers. But if there is something detrimental to the statement of faith, they run to side with the enemies of Islam. Allah's Word: And when they meet people who believe, they say, \"We have believed.\" But when they return to their demons (leaders), they say, \"Surely we are with you, we are only making fun.\" (al-Baqarah\/2: 14)"
		   },
		   {
			"id": 2839,
			"surah": 24,
			"ayat": 48,
			"tafsir": "Among the characteristics of the hypocrites, when they are called upon to accept the decree of Allah and His Messenger they turn away and do not want to accept that decree. They prefer to accept the stipulations of anyone other than Allah and His Messenger as long as the stipulations benefit them. They categorically reject the decrees of Allah and His Messenger even though these decisions are clearly based on justice and truth and are also supported by clear evidence. In another verse Allah says explaining the nature of the hypocrites. Do you not (Muhammad) pay attention to those who claim that they believe in what has been revealed to you and in what has been revealed before you? But they still wanted a legal ruling on Tagut, even though they had been ordered to deny Tagut. And Satan intends to lead them astray (by) going astray as far as possible. And when it is said to them, \"Come (obey) to what Allah has sent down and (obey) the Messenger,\" (undoubtedly) you (Muhammad) will see the hypocrites blocking you hard. (an-Nisa'\/4: 60-61)"
		   },
		   {
			"id": 2840,
			"surah": 24,
			"ayat": 49,
			"tafsir": "Among the characteristics of the hypocrites, when they are called upon to accept the decree of Allah and His Messenger they turn away and do not want to accept that decree. They prefer to accept the stipulations of anyone other than Allah and His Messenger as long as the stipulations benefit them. They categorically reject the decrees of Allah and His Messenger even though these decisions are clearly based on justice and truth and are also supported by clear evidence. In another verse Allah says explaining the nature of the hypocrites. Do you not (Muhammad) pay attention to those who claim that they believe in what has been revealed to you and in what has been revealed before you? But they still wanted a legal ruling on Tagut, even though they had been ordered to deny Tagut. And Satan intends to lead them astray (by) going astray as far as possible. And when it is said to them, \"Come (obey) to what Allah has sent down and (obey) the Messenger,\" (undoubtedly) you (Muhammad) will see the hypocrites blocking you hard. (an-Nisa'\/4: 60-61)"
		   },
		   {
			"id": 2841,
			"surah": 24,
			"ayat": 50,
			"tafsir": "Then Allah raises the question of the causes that make the hypocrites are like that. Is it because they really have a disease in their hearts that they are always doubtful of any decisions that harm them even though the evidence and arguments corroborate the decisions? Or are they basically doubtful of Muhammad's apostleship and prophethood. Or are they worried that Allah and His Messenger will be unjust to them? That is their morals, behavior, and characteristics. The characteristics of people who have gone astray, do not want to accept the truth if it will harm them. That is the nature of the disbelievers who have gone astray. They are the unjust people who like to harm others and are also unjust to themselves."
		   },
		   {
			"id": 2842,
			"surah": 24,
			"ayat": 51,
			"tafsir": "People who truly believe when asked to judge Allah and His Messenger, they submit and obediently accept the decision, whether the decision is beneficial or detrimental to them. They believe wholeheartedly without the slightest doubt that this decision is the right one, because that decision is the decision of Allah and His Messenger. Of course whose decision should be accepted and trusted for its truth and justice besides the decision of Allah and His Messenger? Such are the characteristics of those who believe truly believe in Allah and His Messenger and are fully convinced that Allah is the Most Righteous and the Most Just."
		   },
		   {
			"id": 2843,
			"surah": 24,
			"ayat": 52,
			"tafsir": "Who obeys all of Allah's commands and stays away from all of His prohibitions because he believes that doing Allah's commands will lead to happiness in life in this world and in the hereafter, leaving all His prohibitions, will keep them away from danger and calamity in this world and in the hereafter and always fear Him, and do good to fellow human beings, then they are included in the group of people who achieve Divine pleasure and are free from all His torments in the hereafter."
		   },
		   {
			"id": 2844,
			"surah": 24,
			"ayat": 53,
			"tafsir": "In this verse, Allah again explains the behavior of the hypocrites, that is, they easily make grandiose promises and are strengthened by oaths, but they never fulfill them. They swear by the name of Allah that if they are asked to join the fight with the believers they will definitely participate and will not refuse, no matter what their circumstances and situations are and will not think about what will happen in the battle, as if they are sure it is true that the command to fight is for the common good and to uphold the religion of Allah. But Allah knows what is stored in their hearts, that if they are really invited to fight against their enemies, they will find excuses and excuses so they don't go along and just stay in Medina. Therefore, Allah ordered the Prophet Muhammad to forbid them from taking an oath, because such an oath carries heavy risks. They don't need to swear an oath because Allah already knows that their obedience and obedience is only verbal and does not come from a clean conscience. In line with this verse Allah says: They will swear to you, so that you are willing to accept them. But even if you accept them, Allah will not be pleased with the wicked. (at-Taubah\/9: 96) And His words: And they (the hypocrites) swear by (name) Allah, that they are indeed among you; but they are not from your class, but they are people who are very afraid (of you). (at-Taubah\/9: 56) Therefore Allah reminded them of the false oath they uttered and threatened to exact recompense for their evil deeds, and made it clear that He knew all their behavior and their evil intentions and the ruse they have orchestrated to deceive the Muslims."
		   },
		   {
			"id": 2845,
			"surah": 24,
			"ayat": 54,
			"tafsir": "Then Allah ordered again to the Prophet Muhammad to tell them to obey Allah and His Messenger earnestly. Don't always pretend to have faith, but their deeds and behavior contradict the words they speak. This is a final warning to them. If they still turn away from the truth and do things that are detrimental to the struggle of the Muslims, then tell them that the sins of their actions will be borne on their own shoulders and will not harm the Prophet and the Muslims in the slightest. They will be subject to Allah's wrath and His torment. If they really obey and get out of error by accepting the guidance of Allah and His Messenger, they will undoubtedly be among the lucky ones. The responsibility of the Apostle is only to convey instructions and advice. Accepting or rejecting is an individual decision, outside the responsibility of the Apostle."
		   },
		   {
			"id": 2846,
			"surah": 24,
			"ayat": 55,
			"tafsir": "Rabi 'bin Anas once said about this verse, \"The Prophet Muhammad was in Mecca for ten years calling the Meccan infidels to the religion of monotheism, worshiping Allah without associating partners with Him while those who believe are always in fear and anxiety. They they had not been ordered to fight. Then they were ordered to migrate to Medina. After the order was carried out an order was issued to fight. They were always in fear and anxiety, still wearing weapons morning and evening, and they remained steadfast and patient. Then a friend came to the Prophet and said , \"O Messenger of Allah, do we have to be in this worry and vigilance forever? When will the time come when we can feel safe and free from bearing arms?\" So the Prophet replied, \"You will not have to wait long for that situation. Soon the time will come when one can sit in a large meeting where there is not a single weapon in the meeting. Then came down this verse. Allah promises those who believe and do good deeds to make them rule over the earth. Will make their religion a solid and strong religion, and will give them the pleasure of security and prosperity. That is God's promise and that promise is a promise that must be fulfilled because it is impossible for God to deny His promise as long as they stick to His commands and teachings. Indeed, this promise has been fulfilled with successive victories achieved by the Muslims during the time of the Prophet and during the Khulafa'urrasyidin period and after. At the time of the Prophet Muhammad, the Muslims had been able to conquer the cities of Mecca, Khaibar, Bahrain and the entire Arabian Peninsula. After the Prophet died and the government was controlled by his companions (Khulafaurrasyidin) they always followed in the footsteps of the Prophet in all matters. Thus their power extended both to the east, to the west, to the north and to the south, the religion of Islam spread rapidly so that it was embraced by the inhabitants of the countries which were successfully controlled without coercion and threats. They truly enjoy safety and well-being. The Islamic government has indeed become strong, respected by friend and foe alike. Allah has reminded the Muslims who have succeeded in achieving victory, security and prosperity with His words: And remember when you (the Muhajirin) were still (numbered) few, were oppressed on earth (Mecca), and you were afraid of people (Mecca) ) will kidnap you, so He gave you a place to live (Medinah) and He made you strong with His help and He gave you good sustenance so that you would be grateful. (al-Anfal\/8: 26) Thus the Muslims became strong and respected, enjoyed security and prosperity during the time of the Caliphs Abu Bakr, Umar, Usman, until great conflict arose between the Muslims during the reign of Ali bin Abi Talib resulting in civil war between themselves even though the war among Muslims is very contrary to the word of Allah: And all of you hold fast to the rope (religion) of Allah, and do not be divided, and remember Allah's favor upon you when you were enemies (in the days of ignorance), then Allah united your hearts, so that by His grace you may become brothers. (Ali 'Imran\/3: 103) And His words: And do not be like those who are divided and disputing after clear information has come to them. And they are the people who will receive a severe punishment. (Ali 'Imran\/3: 105) Since then there have been ups and downs in Islamic governance. At one time they are victorious and glorious and at other times they are weak and helpless and even become prey for other people according to their circumstances and conditions in practicing Islamic teachings, obeying the commands of Allah and His Messenger, upholding justice and truth and maintaining the unity of the people. so as not to be divided."
		   },
		   {
			"id": 2847,
			"surah": 24,
			"ayat": 56,
			"tafsir": "In this verse Allah accompanies the promise to achieve victory with orders to establish prayers, pay zakat and obey Allah and His Messenger. That is the first condition for achieving victory and maintaining it. Sometimes achieving something is not so hard, but maintaining the continuity of what has been achieved is harder than achieving it. Therefore, Muslims must strengthen themselves and cultivate defense with three kinds of very powerful weapons, namely first, strengthen their minds by always being in touch with the Almighty. The second is zakat which cleanses oneself from miserliness and miserliness, so that when the time comes for a person he does not hesitate to sacrifice his wealth, energy and even his soul. Third, obey and obey Allah and His Messenger where all actions are in accordance with His teachings and if there are differences of opinion, they should be returned to the law of Allah and His Messenger. That is the guideline for all movements and steps. By fulfilling these three conditions, the strength of the ummah and its resistance to all threatening dangers will be developed and the glory that has been achieved can be maintained and maintained."
		   },
		   {
			"id": 2848,
			"surah": 24,
			"ayat": 57,
			"tafsir": "In this verse Allah confirms to the Prophet Muhammad that the disbelievers will not be able to escape Allah's punishment if Allah wills their destruction or the collapse of their power. Therefore, do not take their strength too seriously as long as the Muslims maintain their condition with the three conditions stated in verse 56. They will surely meet the consequences of their disobedience and denial both in this world and in the hereafter. In the afterlife they will be placed in Hellfire and that is the worst place to return."
		   },
		   {
			"id": 2849,
			"surah": 24,
			"ayat": 58,
			"tafsir": "It was narrated by Ibn Abi Hatim from Muqatil Ibn Hayyan, that a man from the Ansar and his wife Asma' bint Musyidah made food for the Prophet, then Asma' said, \"O Messenger of Allah, how ugly this is. In fact, entering the (room) of the wife and her husband were both in a sarong each of them without permission, then this verse was revealed.As we know, nowadays a house usually consists of several rooms, and each room is occupied by family members and other people who are in that house. There are rooms for the head of the family and his wife, there are rooms for the children and rooms for the maids and so on. Usually each family member can enter a room that is not his room if there is a need and there is no need to ask permission from the occupants that room. However, Islam provides time limits for the freedom to enter other people's rooms. So slaves, and children who have not yet returned g is not allowed to enter the parents' room or the rooms of family members who are adults and have families at set times unless they ask permission first, such as by knocking on the door and so on. If there is an answer from within \"Please come in\", then they may enter. The specified times are the first in the morning before the Fajr prayer, the second after the Zuhr, and the third after the Isha prayer. These times are referred to in this verse as \"aurat\", because at those times people usually did not wear their clothes and their private parts were not completely covered with clothing. In the morning, before getting up for the dawn prayer, people usually still wear their nightgowns. The same goes for the rest time after noon and long rest after Isha'. During such breaks a husband and wife may do things that are not suitable for the eyes of other people, servants, or children. As for outside the three predetermined times, it is very difficult to ask permission first before entering the rooms, because it is natural for the maids and children to move freely in the house because there is much to be taken care of and much to be taken from these rooms. The maids used to enter the room to clean the room or to take something ordered by the master or mistress of the house and so it was with the children. Allah explains the etiquette of manners in the household that must be obeyed and carried out. Psychologists after conducting in-depth research argue that underage children (before they reach puberty) should not see things that are not appropriate for them to see because it will greatly affect their mental development and may cause various kinds of mental illness. There is great wisdom in this manners for the peace of the household, and this is indeed the case because this manners was ordered by Allah, the All-Knowing and All-Wise."
		   },
		   {
			"id": 2850,
			"surah": 24,
			"ayat": 59,
			"tafsir": "If the children have reached the age of maturity, they are treated like other adults, if they want to enter the room, they must ask permission first, not only at the specified time, but at any time. Then Allah repeats His explanation that the instructions in this verse are His decrees which contain wisdom and benefits for harmony in the household. Verily, He is All-Knowing of all things and All-Wise."
		   },
		   {
			"id": 2851,
			"surah": 24,
			"ayat": 60,
			"tafsir": "For old women who no longer have the desire to have intercourse and no longer have attractiveness, they are allowed to take off some of their clothes that are usually worn by women to cover their entire genitals, such as hauscoats (open clothes that cover the entire body) and so on. But it is not permissible to open the genitals which are usually neatly closed such as the chest, calves, thighs and others. If the old woman still wants to be fully clothed as usual, so much the better for her. However, a woman, even though she is old, is more honorable if she still pays attention to and emphasizes what is good for her as a woman. Allah is All-Hearing and All-Knowing of all the behavior of His servants and what is stored in their hearts."
		   },
		   {
			"id": 2852,
			"surah": 24,
			"ayat": 61,
			"tafsir": "According to the custom of the Arabs since the time of Jahiliyyah they did not mind anything even uninvited in the homes of relatives and sometimes they brought their disabled relatives to eat together. In this verse, we have arranged the order of relatives starting from the closest, then those who are close, even including holders of power or assets and close friends, because it is not uncommon for a friend to be left at our house without being invited or asking permission first. The order of the relatives is as follows: 1. Those closest to a person are his wife and children, but in this verse there is no mention of children and wife because it is enough to say \"in your house\" because normally a person lives with his wife and children. So at home, the wife and children don't need permission or an invitation to eat first, then they are allowed to eat. Likewise, if the child has established his own household, the father may come to his son's house to eat without invitation or solicitation, because the child's house is actually his father's house because the Prophet Muhammad saw said: \"You yourself and your wealth belong to your father. \" (History of Ahmad and Ashabus-Sunan) 2. Father. Children do not need to ask permission from the father beforehand to eat, because it is indeed an obligation for the father to provide for his child. If the child is already married and separated from his father, he does not need to ask permission to eat even though he no longer lives at his father's house. 3. Mother. We already know how a mother's love for her child. Even though her children are big and have children and grandchildren, mother's love remains as before. The saying is true, \"Children's love goes all the way and a mother's love goes all the way.\" It doesn't matter to him if his child eats at his house without being invited, in fact he will be very happy to see his child behaving like before when he was still immature. 4. Brother. The relationship between a person and his brother is a blood relationship that cannot be broken, even though there are disputes and fights. So as to foster a sense of brotherhood in each other's hearts, the relationship should not be limited by ethical formalities and protocols that apply to other people. How close is the relationship between brothers and sisters if at any time someone comes to their relative's house and eats together there. 5. Sister, this is the same as eating at your brother's house. 6. Father's brother (uncle). 7. Father's sister (aunt). 8. Mother's brother. 9. Mother's sister. 10. People who are authorized to take care of someone's property. 11. Close friends. Thus Allah states that no one who has or does not have a physical disability objects to eating at the house of his relatives as long as his relatives really do not object to it, because kinship relations must be fostered and fertilized. Meanwhile, relations with other people, such as with neighbors, both near and far, must be maintained as well as possible, especially relations with relatives. However, one should not do as he pleases with his relatives, especially if those relatives are having difficulties in their household and live in poverty, then because we have a kinship relationship, they eat together at their house. A sense of tolerance and a sense of helping must be fostered as well as possible. If we see a relative in need, let his relatives work together to help and help him. Then Allah explained again that it is okay for someone to eat together or separately. It was narrated from Ibn 'Abbas, adh-ahhaq and Qatadah that this verse was revealed regarding Bani Lais bin Amr bin Kinanah, they objected to eating separately. It happened that one of them did not eat all day because no guests were going to eat with him. As long as no one is going to accompany him to eat he does not want to eat. Sometimes there are also those who have food in front of them but they don't want to touch the food until late in the evening. There are also some of them who do not want to drink their camel's milk even though their camel is still full of milk because there are no guests who will drink with him. It was only when it was evening and there were no guests that he would eat alone. Hatim Ath-thÂ±i, the most famous person who is very generous, uttered a verse of poetry to his wife: When you cook food, then find someone who will eat it with me, because I will not eat the food alone. So in order to get rid of habits that may seem good because of showing generosity to someone, but sometimes not suitable for everyone's situation, Allah explained that one may eat together and may eat alone. Let no one burden himself with the habit of eating with guests, then because there are no guests he doesn't want to eat. Then Allah calls on every believer so that when he enters the house of one of his relatives, he should first greet the whole house, namely the greeting ordained by Allah, a greeting that is full of blessings and goodness, namely, \"Assalamu'alaikum warahmatullahi wabarakatuh.\" Thus, the relatives who are in the house will be happy and happy and receive it with an open heart. Al-Hafiz, Abu Bakr al-Bazzar narrated that Anas said: The Messenger of Allah taught me five things. The Messenger of Allah said, \"O Anas! Make ablutions perfectly, of course your age will increase, greet whom you meet among my people, of course your goodness will increase, when you enter your house, say hello to your family; of course your house will be full of blessings, do the duha prayer because the duha prayer was the prayer of pious people in the past. O Anas, love your children and respect your parents, you will be among my friends on the Day of Resurrection.\" Thus Allah explains His verses as a guide for His servants, not only guidance regarding big things, but also guidance regarding small things. Hopefully by practicing the instructions we can think about how good and valuable the instructions are."
		   },
		   {
			"id": 2853,
			"surah": 24,
			"ayat": 62,
			"tafsir": "In this verse, Allah explains that people who truly believe in Allah and His Messenger are people who, when they are with the Messenger of Allah to discuss an important matter regarding Muslim affairs, they do not want to leave the meeting before obtaining permission from the Prophet. After receiving permission, they left the meeting and greeted those present who were still living with the Prophet. From Abu Hurairah from the Messenger of Allah, he said, \"When one of you has arrived at a majlis, let him greet you. If he wants to sit, then sit down. Then if you want to go, let him greet you. The person who used to have no more right from the latter. (History of Ahmad, Abu Daud, Ibn hibban and al-hakim) People whose behavior is like that, are those who truly believe in Allah and His Messenger. Then Allah ordered the Messenger of Allah, if someone submitted a request to leave a meeting with the Prophet, then the Prophet had the full right to accept the request or reject it according to the circumstances of the person asking for permission and for what purpose he left the meeting.Omar bin al-Khaththab once asked permission from the Prophet returned to Medina to meet his family on a trip with other friends to Tabuk, the Prophet gave permission to Umar and said to him. come back! You are not a hypocrite. The Prophet was also ordered after giving permission to the person who asked him to ask Allah's forgiveness for those asking for that permission. This is a sign that asking for permission even though it is permissible to leave the meeting with the Messenger of Allah, the Messenger of Allah was ordered to ask Allah for forgiveness for that person. This shows that asking for permission and leaving the meeting is something that is inappropriate or reprehensible. It was as if that person prioritized his own personal interests rather than the common interests before the Prophet. That is one of the manners in associating with the Prophet Muhammad. The Messenger of Allah is a Messenger who is glorified by Allah, because it is not appropriate for a Muslim to treat him like other leaders who may have mistakes and oversights."
		   },
		   {
			"id": 2854,
			"surah": 24,
			"ayat": 63,
			"tafsir": "It was narrated by Abu Daud that there were among the hypocrites who did not like listening to the sermon. What's more, he saw a Muslim asking permission to leave and was given permission by the Messenger of Allah, he just went out with the person who had received the permission by taking refuge in him. Then come down this verse. Then as a tribute to the Prophet, a Muslim is forbidden by Allah to call the Prophet by name alone as is usually done by Arabs among themselves. So it is not permissible for a Muslim to call him \"O Muhammad\" or \"O Qasim's father.\" And as a manners and manners to the Messenger of Allah, he should be called according to the position that Allah has bestowed on him, namely Allah's Messenger or Allah's Prophet. Then Allah threatened people who came out of a meeting with the Prophet in a secret way for fear of being seen by people. This kind of behavior, even though the Prophet did not know about it, but Allah knows it and knows the reasons that prompted them to leave the meeting. Allah gives a warning to such people who like to disobey orders, that they will get a disaster or a painful punishment. Even though in this world they are not overwritten by any calamity, in the hereafter they will go to hell and that is the worst possible outcome."
		   },
		   {
			"id": 2855,
			"surah": 24,
			"ayat": 64,
			"tafsir": "It was narrated by Abu Daud that there were among the hypocrites who did not like listening to the sermon. What's more, he saw a Muslim asking permission to leave and was given permission by the Messenger of Allah, he just went out with the person who had received the permission by taking refuge in him. Then come down this verse. Then as a tribute to the Prophet, a Muslim is forbidden by Allah to call the Prophet by name alone as is usually done by Arabs among themselves. So it is not permissible for a Muslim to call him \"O Muhammad\" or \"O Qasim's father.\" And as a manners and manners to the Messenger of Allah, he should be called according to the position that Allah has bestowed on him, namely Allah's Messenger or Allah's Prophet. Then Allah threatened people who came out of a meeting with the Prophet in a secret way for fear of being seen by people. This kind of behavior, even though the Prophet did not know about it, but Allah knows it and knows the reasons that prompted them to leave the meeting. Allah gives a warning to such people who like to disobey orders, that they will get a disaster or a painful punishment. Even though in this world they are not overwritten by any calamity, in the hereafter they will go to hell and that is the worst possible outcome. (64) Allah closes this surahh an-Nur after explaining that He is the Giver of light to the heavens and the earth and what is between them and guides His servants through His messengers, and threatens those who disobey orders. Him by affirming that everything in the heavens and on earth belongs to Him and He knows the condition of all His servants and will take into account all their deeds and repay them. Evil deeds are rewarded according to the evil that is done and good deeds are rewarded multiplied, as stated in His word: And are you (Muhammad) in an affair, and do not read a verse of the Qur'an and neither do you do a job, except that We bear witness over you when you do it. Do not be careless in the least from the knowledge of your Lord, even if it is as small as a particle, whether on earth or in the sky. There is nothing smaller or greater than that, but everything is recorded in the real Book (Lauh Mahfudh). , \"I saw the Messenger of Allah when he was reading the last verse of surahh an-Nur, he put his two fingers under his eyelids and said: Allah is Seeing of all things.\" (History of ath-tabari and others)"
		   }
	]
}
