{
	"tafseer": [
		{
			"id": 5324,
			"surah": 69,
			"ayat": 1,
			"tafsir": "Al-haqqah according to language means that which must happen. The Day of Judgment is named al-haqqah because that day will definitely happen. Humans cannot explain and explain their circumstances and characteristics, because knowledge of the Day of Judgment is knowledge of the occult. What man knows about the Last Day is limited to what the Qur'an says. In another verse, Allah says: They ask you (Muhammad) about the Hour, \"When will it happen?\" Say, \"Indeed, the knowledge of the Hour is with my Lord; no one (one) can explain the time of its occurrence other than Him. (The Hour) is very heavy (commotion for creatures) in the heavens and on earth, will not come to you unless suddenly.\" They ask you as if you know it. Say (Muhammad), \"Surely the knowledge of (the Day of Judgment) is with Allah, but most people do not know.\" (al-A'raf\/7: 187) The Day of Judgment, like some other occult matters, is known only to Allah. His Word: Verily, only with Allah is the knowledge of the Day of Judgment; and He who sends down the rain, and knows what is in the wombs. And no one can know (with certainty) what he will do tomorrow. And no one can know on which earth he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman\/31: 34) What can be used as a source of knowledge to find out the Day of Judgment? From this question it is understood that there are several things that can provide information to humans about the events that will occur on the Day of Judgment, because knowledge about the Day of Judgment is knowledge that can be attained by creatures with the help of various kinds of knowledge. Indeed, the events of the Day of Judgment cannot be estimated. Its happenings and events were greater than anyone has ever described. Because the essence of the Day of Judgment cannot be known by creatures, polytheists cannot deny it. If they deny it, they are denying something that their minds cannot know or attain."
		   },
		   {
			"id": 5325,
			"surah": 69,
			"ayat": 2,
			"tafsir": "Al-haqqah according to language means that which must happen. The Day of Judgment is named al-haqqah because that day will definitely happen. Humans cannot explain and explain their circumstances and characteristics, because knowledge of the Day of Judgment is knowledge of the occult. What man knows about the Last Day is limited to what the Qur'an says. In another verse, Allah says: They ask you (Muhammad) about the Hour, \"When will it happen?\" Say, \"Indeed, the knowledge of the Hour is with my Lord; no one (one) can explain the time of its occurrence other than Him. (The Hour) is very heavy (commotion for creatures) in the heavens and on earth, will not come to you unless suddenly.\" They ask you as if you know it. Say (Muhammad), \"Surely the knowledge of (the Day of Judgment) is with Allah, but most people do not know.\" (al-A'raf\/7: 187) The Day of Judgment, like some other occult matters, is known only to Allah. His Word: Verily, only with Allah is the knowledge of the Day of Judgment; and He who sends down the rain, and knows what is in the wombs. And no one can know (with certainty) what he will do tomorrow. And no one can know on which earth he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman\/31: 34) What can be used as a source of knowledge to find out the Day of Judgment? From this question it is understood that there are several things that can provide information to humans about the events that will occur on the Day of Judgment, because knowledge about the Day of Judgment is knowledge that can be attained by creatures with the help of various kinds of knowledge. Indeed, the events of the Day of Judgment cannot be estimated. Its happenings and events were greater than anyone has ever described. Because the essence of the Day of Judgment cannot be known by creatures, polytheists cannot deny it. If they deny it, they are denying something that their minds cannot know or attain."
		   },
		   {
			"id": 5326,
			"surah": 69,
			"ayat": 3,
			"tafsir": "Al-haqqah according to language means that which must happen. The Day of Judgment is named al-haqqah because that day will definitely happen. Humans cannot explain and explain their circumstances and characteristics, because knowledge of the Day of Judgment is knowledge of the occult. What man knows about the Last Day is limited to what the Qur'an says. In another verse, Allah says: They ask you (Muhammad) about the Hour, \"When will it happen?\" Say, \"Indeed, the knowledge of the Hour is with my Lord; no one (one) can explain the time of its occurrence other than Him. (The Hour) is very heavy (commotion for creatures) in the heavens and on earth, will not come to you unless suddenly.\" They ask you as if you know it. Say (Muhammad), \"Surely the knowledge of (the Day of Judgment) is with Allah, but most people do not know.\" (al-A'raf\/7: 187) The Day of Judgment, like some other occult matters, is known only to Allah. His Word: Verily, only with Allah is the knowledge of the Day of Judgment; and He who sends down the rain, and knows what is in the wombs. And no one can know (with certainty) what he will do tomorrow. And no one can know on which earth he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman\/31: 34) What can be used as a source of knowledge to find out the Day of Judgment? From this question it is understood that there are several things that can provide information to humans about the events that will occur on the Day of Judgment, because knowledge about the Day of Judgment is knowledge that can be attained by creatures with the help of various kinds of knowledge. Indeed, the events of the Day of Judgment cannot be estimated. Its happenings and events were greater than anyone has ever described. Because the essence of the Day of Judgment cannot be known by creatures, polytheists cannot deny it. If they deny it, they are denying something that their minds cannot know or attain."
		   },
		   {
			"id": 5327,
			"surah": 69,
			"ayat": 4,
			"tafsir": "In this verse, it is explained that the people of Samud and the people of 'Ad do not believe in the Doomsday. They do not believe that there will be world destruction and catastrophic events whose turmoil is unbearable. Allah also said this: (The people of) Samud denied (his messenger) because they transgressed (unjust), when the most wretched person arose among them, then Allah's Apostle (Saleh) said to them, \"(Let) the female camel from Allah with his drink.\" But they belied him and slaughtered him, so God destroyed them because of their sins, then He leveled them (to the ground). (as-Shams\/91: 11-14)"
		   },
		   {
			"id": 5328,
			"surah": 69,
			"ayat": 5,
			"tafsir": "The Samud people have been destroyed by Allah with thagiyah, namely the sound of thunder that thunders from the sky which destroys everything on the surface of the earth. It is called thagiyah (something extraordinary) because indeed the sound is extraordinary; unlike the sound of thunder had ever occurred. They were punished by God because they had acted beyond the limits that Prophet Saleh had set for them. They killed the she-camel that Nabi Saleh ordered to take good care of. In another word of God it is explained that the Samud were destroyed by sa'iqah (lightning). And as for the Samud people, We have given them guidance but they preferred blindness (guidance) to that guidance, so they were struck by lightning as a humiliating punishment because of what they had done. (Fussilat\/41: 17)"
		   },
		   {
			"id": 5329,
			"surah": 69,
			"ayat": 6,
			"tafsir": "As for the people of 'Ad destroyed by Allah with a very strong cold wind (sarsar 'atiyah). In another verse, Allah says: So We blew a very thunderous wind on them on some fateful days, because We wanted them to feel humiliating torments in this worldly life. Meanwhile, the punishment in the hereafter will be more humiliating and they will not be given any help. (Fussilat\/41: 16)"
		   },
		   {
			"id": 5330,
			"surah": 69,
			"ayat": 7,
			"tafsir": "This fierce cold wind blew over their land continuously for seven nights and eight days, destroying their houses, palaces, property, livestock, crops, and everything in their land. The 'Ad or nation 'Ad is a semitic race, who lived around 5000-4000 years ago. These people live in the region of South Arabia, in an area of the hills of al-Ahqaf (see surahh al-Ahqaf\/46: 21), or what is now known as Rab al-Khali, which stretches from southern Yemen to Oman. . The majority of 'Ad have rejected Prophet Hud's apostleship and mission. They received punishment from Allah in the form of a very cold and strong wind that continued continuously for seven nights and eight days. Paleogeological scientific data about the event has not been obtained. But maybe we can compare it with what happened in the United States, in the State of New Orleans to be precise, when the area was hit by Hurricane Katrina (Katrina Hurricane) on 23-31 August 2005. Hurricane Katrina has a storm speed of 280 km\/h, pressure (minimum) 902 mbar (hPa: 26.65 inHg); the temperature of the storm is quite warm, around 28.4 oC, lasts for approximately 8 (eight) days, continuously. Its area of impact includes the Bahamas, South Florida, Cuba, Louisiana (mainly Greater New Orleans), Mississippi, Alabama, Florida Panhandle, and most of the east coast of North America. The radius of this Hurricane Katrina is about 160 km from the center point of the storm. The human victims died 1,836 souls. Victims of assets amounting to US $ 84 billion. Hurricane Katrina was recorded as the sixth strongest type of Atlantic hurricane in American history, or the third strongest, which occurred during the landfall season (autumn) in the United States. As a comparison, the Galveston Hurricane that occurred in 1900 in the United States killed between 6000-12,000 people. Thus, a very cold and violent wind or storm, which befell the people of 'Ad for seven nights and eight days continuously, may have been similar to or far more severe than this Hurricane Katrina; because the temperature is very cold and capable of destroying a people (people). The words \"seven nights and eight days\" warn that the world's strong winds will truly be their doom, and will befall all that is in the land."
		   },
		   {
			"id": 5331,
			"surah": 69,
			"ayat": 8,
			"tafsir": "This fierce cold wind blew over their land continuously for seven nights and eight days, destroying their houses, palaces, property, livestock, crops, and everything in their land. The 'Ad or nation 'Ad is a semitic race, who lived around 5000-4000 years ago. These people live in the region of South Arabia, in an area of the hills of al-Ahqaf (see surahh al-Ahqaf\/46: 21), or what is now known as Rab al-Khali, which stretches from southern Yemen to Oman. . The majority of 'Ad have rejected Prophet Hud's apostleship and mission. They received punishment from Allah in the form of a very cold and strong wind that continued continuously for seven nights and eight days. Paleogeological scientific data about the event has not been obtained. But maybe we can compare it with what happened in the United States, in the State of New Orleans to be precise, when the area was hit by Hurricane Katrina (Katrina Hurricane) on 23-31 August 2005. Hurricane Katrina has a storm speed of 280 km\/h, pressure (minimum) 902 mbar (hPa: 26.65 inHg); the temperature of the storm is quite warm, around 28.4 oC, lasts for approximately 8 (eight) days, continuously. Its area of impact includes the Bahamas, South Florida, Cuba, Louisiana (mainly Greater New Orleans), Mississippi, Alabama, Florida Panhandle, and most of the east coast of North America. The radius of this Hurricane Katrina is about 160 km from the center point of the storm. The human victims died 1,836 souls. Victims of assets amounting to US $ 84 billion. Hurricane Katrina was recorded as the sixth strongest type of Atlantic hurricane in American history, or the third strongest, which occurred during the landfall season (autumn) in the United States. As a comparison, the Galveston Hurricane that occurred in 1900 in the United States killed between 6000-12,000 people. Thus, a very cold and violent wind or storm, which befell the people of 'Ad for seven nights and eight days continuously, may have been similar to or far more severe than this Hurricane Katrina; because the temperature is very cold and capable of destroying a people (people). The words \"seven nights and eight days\" warn that the world's strong winds will truly be their doom, and will befall all that is in the land."
		   },
		   {
			"id": 5332,
			"surah": 69,
			"ayat": 9,
			"tafsir": "In these verses, it is explained that Pharaoh and Lut's people and their followers have also done great damage, namely denying the apostles sent by Allah to them. Therefore, they were punished by God. In another verse, Allah says: All have denied the apostles, so My threat applies (to them). (Qaf\/50: 14)"
		   },
		   {
			"id": 5333,
			"surah": 69,
			"ayat": 10,
			"tafsir": "In this verse Allah commands the Muslims to do good deeds by saying, \"O you who believe in Allah and His Messenger, do you all want me to show you a trade that is beneficial and sure to bring multiple profits and everlasting luck or deliver you from the fire of hell.\" The expression of the verse above gives the understanding that good deeds with great rewards are as great as a business that never loses because it will enter heaven and be safe from the fires of hell. Allah's Word: Indeed, Allah buys from the believers, both themselves and their property by providing heaven for them. (at-Taubah\/9: 111) Then mention the forms of trading that provide huge profits, namely: 1. Always believe in Allah, the angels, His books, His messengers, the existence of the Day of Judgment, qadha' and qadar Allah. 2. Doing good deeds solely for the sake of Allah, not because of pleasure, is a manifestation of one's faith. 3. Jihad in the way of Allah. Jihad is all kinds of efforts and efforts made to uphold the religion of Allah. There are two kinds of jihad mentioned in this verse, namely jihad with the body and soul and jihad with wealth. Jihad with body and soul is fighting against the enemies of religion who want the destruction of Islam and the Muslims. Jihad with wealth, namely spending property to uphold God's sentence, such as for war costs, building mosques, houses of worship, schools, hospitals, and other public interests. In addition, there are other forms of jihad, namely jihad against lust, self-control, trying to form good character in oneself, eliminating jealousy, and so on. At the end of this verse it is emphasized that faith and jihad are deeds with the best consequences, both for oneself, children, family, property and society, if humans truly understand."
		   },
		   {
			"id": 5334,
			"surah": 69,
			"ayat": 11,
			"tafsir": "In this verse Allah commands the Muslims to do good deeds by saying, \"O you who believe in Allah and His Messenger, do you all want me to show you a trade that is beneficial and sure to bring multiple profits and everlasting luck or deliver you from the fire of hell.\" The expression of the verse above gives the understanding that good deeds with great rewards are as great as a business that never loses because it will enter heaven and be safe from the fires of hell. Allah's Word: Indeed, Allah buys from the believers, both themselves and their property by providing heaven for them. (at-Taubah\/9: 111) Then mention the forms of trading that provide huge profits, namely: 1. Always believe in Allah, the angels, His books, His messengers, the existence of the Day of Judgment, qadha' and qadar Allah. 2. Doing good deeds solely for the sake of Allah, not because of pleasure, is a manifestation of one's faith. 3. Jihad in the way of Allah. Jihad is all kinds of efforts and efforts made to uphold the religion of Allah. There are two kinds of jihad mentioned in this verse, namely jihad with the body and soul and jihad with wealth. Jihad with body and soul is fighting against the enemies of religion who want the destruction of Islam and the Muslims. Jihad with wealth, namely spending property to uphold God's sentence, such as for war costs, building mosques, houses of worship, schools, hospitals, and other public interests. In addition, there are other forms of jihad, namely jihad against lust, self-control, trying to form good character in oneself, eliminating jealousy, and so on. At the end of this verse it is emphasized that faith and jihad are deeds with the best consequences, both for oneself, children, family, property and society, if humans truly understand."
		   },
		   {
			"id": 5335,
			"surah": 69,
			"ayat": 12,
			"tafsir": "These verses explain the punishment that was inflicted on Noah's people, so that they were all destroyed. What remains are only the people who came with Noah to board the ark or ship. It was explained that after the water inundated the whole country accompanied by a powerful hurricane gust, Allah commanded that Prophet Noah and those who believed with him boarded the ark that had been provided, so that they would not be among those who drowned. Based on this information, some commentators argue that Prophet Noah is the second human father after Adam, because only he and the people who were with him are still alive, who then descended all of today's humans. Allah saved all those who believed from the flood and typhoon, and drowned and destroyed those who disobeyed Noah, so that this event would be used as a reminder and lesson for those who came later. In this way, Allah shows man His power and greatness. God telling this story is also intended so that the ears of those who truly believe in Him can hear and benefit from the revelations that He sent down and put the messages that He brought into practice."
		   },
		   {
			"id": 5336,
			"surah": 69,
			"ayat": 13,
			"tafsir": "In this verse it is explained that when Allah wishes to bring about the Day of Judgment, He orders the Angel Israfil to blow the first trumpet. God's Word: Then the trumpet is blown, so immediately they come out of their graves (alive), heading to their Lord. (Yasin\/36: 51)"
		   },
		   {
			"id": 5337,
			"surah": 69,
			"ayat": 14,
			"tafsir": "At that moment the whole earth shook, and the mountains were lifted from their places and they struck one another. The shaking of the earth and the movement of mountains indicates that there has been a terrible earthquake which destroyed everything on the surface of the earth, including the humans who live on it. In another word of Allah explained: And (remember) on the day (when) We traveled the mountains and you will see the earth is level and We gathered them (all mankind), and We did not leave any of them. (al-Kahf\/18: 47)"
		   },
		   {
			"id": 5338,
			"surah": 69,
			"ayat": 15,
			"tafsir": "At the time of the Day of Judgment, the sky will be so weak that it will split open. If one pays attention to God's laws that apply in space, then what is stated in this verse is in accordance with that law. Each planet in space has its attractions. With this power, all the planets are always circulating in a fixed orbit, not falling and not deviating. If even one of the many planets shifts from its celestial sphere, then the balance of attraction that exists between the planets is lost, so that the small planet is attracted by the large planet. There was a collision between the planets that destroyed the entire universe. Today's modern scientific studies state that the entire universe began with its formation from a singularity. Singularity is something where space, energy, matter, and time are still gathered as one (unified). The Big Bang exploded this singularity and it grew like a spiral-cone constantly expanding wider and wider. Since the Big Bang, time began to separate itself from space, as well as energy, matter and forces, and over billions of years formed the entire universe which contains billions of galaxies. Space and time continue to experience widespread expansion. Bahiruddin S. Mahmud explained that the expansion of the universe is not unlimited and continuous. The rate of expansion or development is gradually decreasing, because the gravitational force between galaxies (from which they continue to move away from each other) begins to relax, so that one day the expansion of the universe will stop. When the universe or the universe stops its expansion (expansion), its period of shrinkage (condensation) begins. If the expansion starts from the singularity, the Big Bang, and the expansion of the universe; then the shrinking of the universe or compaction (condensation) of the universe begins with a slowly shrinking universe, where space, time, energy, matter, and forces will reunite into a singularity. This shrinkage is getting faster and faster, from the dimension of time billions of years, millions of years, tens of years, yearly, monthly, weekly, daily, continuing to hours, minutes, seconds, micro-seconds and finally there is a violent explosion called the Big Crunch. ) becomes a singularity again. So the Big Crunch, is like the Big Bang in the opposite direction. This process of shrinking the universe towards the Big Crunch, takes place over a very long period of time, then accelerates, and super fast!! According to Paul Davies, when the universe has compressed to one-hundredth (1\/100) of its present extent, the pressure effect will cause the temperature to rise until it reaches the boiling point of liquid matter; and the earth becomes an uninhabitable place. Galaxies are no longer distinguishable from one another, because they have fused, and are close together. Furthermore, the movement of density increases until it reaches the point of incandescent fire. It is at this time that space appears like a glowing ball of plasma fire. It is this possibility that is mentioned in surahh al-Ma'arij\/70: 8, \"On the day when the sky becomes like molten silver.\" When there is a process towards the Big Crunch, namely the process of condensing or shrinking the universe, then all matter breaks back into fundamental matter such as quarks, electrons, and so on, forces such as gravitational, electromagnetic, strong nuclear, and weak nuclear forces. starting to come back together. It was then that the celestial bodies began to lose their gravitational forces, and as a result there were catastrophic collisions between planets, so that the earth collided with other planets, mountains collided because of the loss of the gravitational force that supported them so that they collided with each other. The space sky begins to weaken due to the absence of the support of gravity, and begins to shrink \/ shrink and crack \/ split. This process gave rise to a tremendous roar, culminating with the Big Crunch boom. Is the trumpet (sur) referred to the start of the roar when this shrinking process occurs? Wallahu a'lam bis-sawab. Finally, after the Big Crunch bang, return to the singularity again, everything is mortal, except for Allah, as His word says: Everything on earth will perish, but the face of your Lord who has greatness and glory remains eternal. (ar-Rahman\/55: 26-27)"
		   },
		   {
			"id": 5339,
			"surah": 69,
			"ayat": 16,
			"tafsir": "At the time of the Day of Judgment, the sky will be so weak that it will split open. If one pays attention to God's laws that apply in space, then what is stated in this verse is in accordance with that law. Each planet in space has its attractions. With this power, all the planets are always circulating in a fixed orbit, not falling and not deviating. If even one of the many planets shifts from its celestial sphere, then the balance of attraction that exists between the planets is lost, so that the small planet is attracted by the large planet. There was a collision between the planets that destroyed the entire universe. Today's modern scientific studies state that the entire universe began with its formation from a singularity. Singularity is something where space, energy, matter, and time are still gathered as one (unified). The Big Bang exploded this singularity and it grew like a spiral-cone constantly expanding wider and wider. Since the Big Bang, time began to separate itself from space, as well as energy, matter and forces, and over billions of years formed the entire universe which contains billions of galaxies. Space and time continue to experience widespread expansion. Bahiruddin S. Mahmud explained that the expansion of the universe is not unlimited and continuous. The rate of expansion or development is gradually decreasing, because the gravitational force between galaxies (from which they continue to move away from each other) begins to relax, so that one day the expansion of the universe will stop. When the universe or the universe stops its expansion (expansion), its period of shrinkage (condensation) begins. If the expansion starts from the singularity, the Big Bang, and the expansion of the universe; then the shrinking of the universe or compaction (condensation) of the universe begins with a slowly shrinking universe, where space, time, energy, matter, and forces will reunite into a singularity. This shrinkage is getting faster and faster, from the dimension of time billions of years, millions of years, tens of years, yearly, monthly, weekly, daily, continuing to hours, minutes, seconds, micro-seconds and finally there is a violent explosion called the Big Crunch. ) becomes a singularity again. So the Big Crunch, is like the Big Bang in the opposite direction. This process of shrinking the universe towards the Big Crunch, takes place over a very long period of time, then accelerates, and super fast!! According to Paul Davies, when the universe has compressed to one-hundredth (1\/100) of its present extent, the pressure effect will cause the temperature to rise until it reaches the boiling point of liquid matter; and the earth becomes an uninhabitable place. Galaxies are no longer distinguishable from one another, because they have fused, and are close together. Furthermore, the movement of density increases until it reaches the point of incandescent fire. It is at this time that space appears like a glowing ball of plasma fire. It is this possibility that is mentioned in surahh al-Ma'arij\/70: 8, \"On the day when the sky becomes like molten silver.\" When there is a process towards the Big Crunch, namely the process of condensing or shrinking the universe, then all matter breaks back into fundamental matter such as quarks, electrons, and so on, forces such as gravitational, electromagnetic, strong nuclear, and weak nuclear forces. starting to come back together. It was then that the celestial bodies began to lose their gravitational forces, and as a result there were catastrophic collisions between planets, so that the earth collided with other planets, mountains collided because of the loss of the gravitational force that supported them so that they collided with each other. The space sky begins to weaken due to the absence of the support of gravity, and begins to shrink \/ shrink and crack \/ split. This process gave rise to a tremendous roar, culminating with the Big Crunch boom. Is the trumpet (sur) referred to the start of the roar when this shrinking process occurs? Wallahu a'lam bis-sawab. Finally, after the Big Crunch bang, return to the singularity again, everything is mortal, except for Allah, as His word says: Everything on earth will perish, but the face of your Lord who has greatness and glory remains eternal. (ar-Rahman\/55: 26-27)"
		   },
		   {
			"id": 5340,
			"surah": 69,
			"ayat": 17,
			"tafsir": "On the Day of Resurrection, angels will be all over the sky. Eight angels carry the 'Throne of Allah above their heads. The issue of the angels and the Throne is an unseen matter, no one knows about it. The form of the 'Arsh that the angels carried and where they took them was not explained. Therefore, we receive all of it based on our faith in God."
		   },
		   {
			"id": 5341,
			"surah": 69,
			"ayat": 18,
			"tafsir": "On the Day of Resurrection, all human beings will be brought before Allah's presence, to be judged and weighed for their deeds and deeds. There is not a single human deed or deed that escapes the knowledge of Allah, from the smallest to the greatest, from the hidden and the real, the subtle and the gross; everything is known to Allah. On that day the only one who can help someone is Allah. The help is given based on their charity while living in the world."
		   },
		   {
			"id": 5342,
			"surah": 69,
			"ayat": 19,
			"tafsir": "This verse describes the servant of Allah who believes and does good deeds on the Day of Judgment. At that time, they were happy because the distance they would travel to reach their desired destination was getting closer to the place that God had prepared for them. They have actually felt such joy since their spirits parted ways with their bodies. At that time, they saw signs of good luck, as Allah says: (That is) a person who, when the angels passed away in good condition, they (the angels) said (to them), \"Salamun 'alaikum, enter heaven because what have you done.\" (an-Nahl\/16: 32) They always remember Allah's promise in His word: A powerful surprise will not make them feel sad, and the angels will greet them (with saying), \"This is your day that has been promised to you.\" (al-Anbiya'\/21: 103) So the day they have been waiting for comes and the believers receive their charity note with their right hand proffered from their right, so joy explodes in their hearts. They also want their charitable records to be read by their friends who are in the same situation as them, saying, \"O my friends who are both pleased by Allah, this is a note that we are the same. Take it and read its contents, of course you will know that we all get the notebook from the right hand side and will be equally rewarded from Allah.\" So they were happy together."
		   },
		   {
			"id": 5343,
			"surah": 69,
			"ayat": 20,
			"tafsir": "With pride and satisfaction the believers said, \"I have been sure that God will judge me and I will be responsible for all my actions today. That's why, while living in the world I believe in Allah and carry out orders and stay away from His prohibitions conveyed by the Prophet Muhammad. I also believe that my Lord will give account and weigh my deeds.\" According to adh-ahhak, every word of dhann (supposition) relating to believers, contained in the Qur'an means to be sure, and when it relates to disbelievers it means to be in doubt. Al-Hasan said, \"Surely those who believe have suspicions that approach the best belief (dhann) in their Lord, then they increase their deeds for the hereafter, while the hypocrites have the worst doubts (dhann) about their Lord. ; then he has bad deeds also for the hereafter.\" Likewise in this verse. The word dhanantu means \"I am sure\" not \"I doubt\", or \"I suspect\". A similar meaning is also found in the word of Allah: Why do the believers and the believers not be kind to themselves, when you hear the fake news and say, \"This is (a news) a real lie.\" (an-Nur\/24: 12)"
		   },
		   {
			"id": 5344,
			"surah": 69,
			"ayat": 21,
			"tafsir": "In this verse, it is explained that the reward received by those who receive their deeds with the right hand is in a life that is pleased. The life that is pleased is the life that every believer aspires to, namely the life that pleases God, all human beings, even all of God's creatures. No one is jealous, jealous, revengeful, and hates him, so that everything he encounters is good and brings goodness to him. There is nothing that hurts him and there are no actions or attitudes that offend him, everything is pleasant to hear and feel. In the last word of God it is explained that a calm soul is a soul that lives a life that is pleased and belongs to the group of God's servants: O calm soul! Return to your Lord with a heart that pleases and pleases Him. Then enter into the ranks of My servants, and enter into My heaven. (al-Fajr\/89: 27-30)"
		   },
		   {
			"id": 5345,
			"surah": 69,
			"ayat": 22,
			"tafsir": "This verse describes the condition of the place that is prepared for believers in the hereafter, namely a beautiful and comfortable place with gardens and parks that please those who look at it, and trees that bear low fruit, easy to pick. by anyone who wants it, whether standing, sitting or lying down. In another verse, Allah says: There they sat reclining on a couch, there they did not see (feel the heat) of the sun nor was it excessively cold. And the shade (trees) is close above them and it is made easy for them to pick (fruit). (al-Insan\/76: 13-14)"
		   },
		   {
			"id": 5346,
			"surah": 69,
			"ayat": 23,
			"tafsir": "This verse describes the condition of the place that is prepared for believers in the hereafter, namely a beautiful and comfortable place with gardens and parks that please those who look at it, and trees that bear low fruit, easy to pick. by anyone who wants it, whether standing, sitting or lying down. In another verse, Allah says: There they sat reclining on a couch, there they did not see (feel the heat) of the sun nor was it excessively cold. And the shade (trees) is close above them and it is made easy for them to pick (fruit). (al-Insan\/76: 13-14)"
		   },
		   {
			"id": 5347,
			"surah": 69,
			"ayat": 24,
			"tafsir": "The angels say to those who receive their deeds with their right hands in heaven, \"Eat all kinds of fruits and all kinds of food that are found in this paradise, and drink to your heart's content delicious and refreshing drinks. Nothing can prevent you from taking it, everything is provided for you all. All of this is provided because you all have believed in Allah, done righteous deeds and submitted and surrendered yourself to Him while you lived in the world before.\" From the words \"bima aslaftum\" (because of the deeds you have done) it can be understood that the reward received in the hereafter is a reward for the results of faith and deeds done while living in this world. This means that it is impossible for a servant to get a reward from Allah if he does not believe and do good deeds. From the words hani'an (deliciously) it can be understood that the food and drink given in heaven are extraordinarily delicious food and drink, and there has never been anything so delicious in the world."
		   },
		   {
			"id": 5348,
			"surah": 69,
			"ayat": 25,
			"tafsir": "In this verse, the condition of the disbelievers in the hereafter is explained when they receive a record of the deeds they have done while living in this world. They are given a record of their deeds from the left and receive them with the left hand. After reading the note, fear arose in his heart because based on the note, he would definitely be put in hell. He said, \"How bad my deeds and how happy I would be if my deeds which contained like this were not given to me, I did not think that all my deeds in the world were recorded in this book.\" The disbeliever is in extreme fear when he receives the record of his charity, as if a terrible punishment has been overwritten. Though they have not overwritten the punishment. This gives an understanding that spiritual punishment is more severe than physical punishment."
		   },
		   {
			"id": 5349,
			"surah": 69,
			"ayat": 26,
			"tafsir": "The statement that spiritual punishment is more severe than physical punishment is reinforced by the words of those disbelievers, \"How happy I would be, if I did not know the record of my deeds, so that I did not know the punishment that would befall me later in hell.\""
		   },
		   {
			"id": 5350,
			"surah": 69,
			"ayat": 27,
			"tafsir": "This verse seems to give an understanding that the disbeliever does not know at all that there will be Doomsday, there will be life after death, at which time good deeds will be rewarded multiplied while evil deeds will be rewarded with painful punishments. Therefore, they say, \"It would be better if the death that befell me in the past, which was the end of my whole life, was not raised again like now, so that I do not meet severe suffering.\" But actually those disbelievers have known for sure as long as they live in the world that there will be a day like this. Indeed, such are the characteristics of unbelievers who always deny their beliefs. And (remember) when your Lord brought out from the sulbi (spine) the children and grandchildren of Adam their offspring and Allah took testimony against their spirits (while saying), \"Am I not your Lord?\" They replied, \"Yes (You are our God), we testify.\" (We did that) so that on the Day of Resurrection you would not say, \"Indeed, at that time we were negligent of this.\" (al-A'raf\/7: 172) They hope that their affairs will end with death, solely because they are afraid of being tortured, not because they do not know that there will be a Day of Judgment and a day of reckoning."
		   },
		   {
			"id": 5351,
			"surah": 69,
			"ayat": 28,
			"tafsir": "This verse explains the way of thinking of unbelievers while living in the world. According to them, what determines a person's condition and degree is rank, power, and wealth. With wealth, they would be able to obtain anything they wanted, and with rank and power, they would be able to satisfy their lusts. After being in the afterlife, it is clear to them that such a mistake in the way of thinking was, so that the feelings of the heart at that time were also expressed in their mouths by saying, \"The wealth that I had when I was in the world before could not help and prevent me from the punishment of Allah. Likewise the power that was what I had in the world is gone at this moment, so I have no helper.\" The assumption of the disbelievers of the time in the world that what determines everything is wealth and power is explained in the word of Allah: And he has great wealth, so he said to his friends (who believe) when conversing with him, \"My wealth is more than yours and my followers are stronger.\" (al-Kahf\/18: 34) And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba'\/34: 35)"
		   },
		   {
			"id": 5352,
			"surah": 69,
			"ayat": 29,
			"tafsir": "This verse explains the way of thinking of unbelievers while living in the world. According to them, what determines a person's condition and degree is rank, power, and wealth. With wealth, they would be able to obtain anything they wanted, and with rank and power, they would be able to satisfy their lusts. After being in the afterlife, it is clear to them that such a mistake in the way of thinking was, so that the feelings of the heart at that time were also expressed in their mouths by saying, \"The wealth that I had when I was in the world before could not help and prevent me from the punishment of Allah. Likewise the power that was what I had in the world is gone at this moment, so I have no helper.\" The assumption of the disbelievers of the time in the world that what determines everything is wealth and power is explained in the word of Allah: And he has great wealth, so he said to his friends (who believe) when conversing with him, \"My wealth is more than yours and my followers are stronger.\" (al-Kahf\/18: 34) And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba'\/34: 35)"
		   },
		   {
			"id": 5353,
			"surah": 69,
			"ayat": 30,
			"tafsir": "Because of the attitude of the disbelievers and based on their record of deeds, Allah ordered the angels to carry out the punishment for the disbelievers. At the time of Doomsday, they will be in a state of suffering, humiliation, and will not be able to get away from this situation in the slightest. In fact, the doom is added to the shackles of them. This gives an understanding that the disbelievers in hell do not have any way to reduce and alleviate this painful doom."
		   },
		   {
			"id": 5354,
			"surah": 69,
			"ayat": 31,
			"tafsir": "Because of the attitude of the disbelievers and based on their record of deeds, Allah ordered the angels to carry out the punishment for the disbelievers. At the time of Doomsday, they will be in a state of suffering, humiliation, and will not be able to get away from this situation in the slightest. In fact, the doom is added to the shackles of them. This gives an understanding that the disbelievers in hell do not have any way to reduce and alleviate this painful doom."
		   },
		   {
			"id": 5355,
			"surah": 69,
			"ayat": 32,
			"tafsir": "Because of the attitude of the disbelievers and based on their record of deeds, Allah ordered the angels to carry out the punishment for the disbelievers. At the time of Doomsday, they will be in a state of suffering, humiliation, and will not be able to get away from this situation in the slightest. In fact, the doom is added to the shackles of them. This gives an understanding that the disbelievers in hell do not have any way to reduce and alleviate this painful doom."
		   },
		   {
			"id": 5356,
			"surah": 69,
			"ayat": 33,
			"tafsir": "The cause of the infidels being afflicted with a very painful punishment is because apart from associating partners with Allah, they are leaders of the infidels who pioneered disbelief, and did not encourage themselves and others to feed the poor. It is also mentioned in this verse that it is necessary to feed the poor after believing in Allah. This shows how high the value of the act of feeding the poor is in the sight of Allah, so that in another of His words it is stated that a person who does not feed the poor is a person who denies religion. Do you know people who reject religion? So that's the person who rebukes the orphan, and does not encourage feeding the poor. (al-Ma'un\/107: 1-3) In other words it can be said that the sign of a person who truly believes in Allah is that he enjoys helping the poor-poor, because that effort is an increase in his faith."
		   },
		   {
			"id": 5357,
			"surah": 69,
			"ayat": 34,
			"tafsir": "The cause of the infidels being afflicted with a very painful punishment is because apart from associating partners with Allah, they are leaders of the infidels who pioneered disbelief, and did not encourage themselves and others to feed the poor. It is also mentioned in this verse that it is necessary to feed the poor after believing in Allah. This shows how high the value of the act of feeding the poor is in the sight of Allah, so that in another of His words it is stated that a person who does not feed the poor is a person who denies religion. Do you know people who reject religion? So that's the person who rebukes the orphan, and does not encourage feeding the poor. (al-Ma'un\/107: 1-3) In other words it can be said that the sign of a person who truly believes in Allah is that he enjoys helping the poor-poor, because that effort is an increase in his faith."
		   },
		   {
			"id": 5358,
			"surah": 69,
			"ayat": 35,
			"tafsir": "This verse explains the condition of polytheists in hell: 1. They have no friends or helpers. As it is known that humans are social creatures. Happy human life is if they can fulfill their personal interests and the interests of life in social relations. If in the world under normal circumstances, humans feel tormented living alone, surely in the afterlife it will be even more tormented. 2. Their food is blood and pus, a food that is not eaten by people while living in the world."
		   },
		   {
			"id": 5359,
			"surah": 69,
			"ayat": 36,
			"tafsir": "This verse explains the condition of polytheists in hell: 1. They have no friends or helpers. As it is known that humans are social creatures. Happy human life is if they can fulfill their personal interests and the interests of life in social relations. If in the world under normal circumstances, humans feel tormented living alone, surely in the afterlife it will be even more tormented. 2. Their food is blood and pus, a food that is not eaten by people while living in the world."
		   },
		   {
			"id": 5360,
			"surah": 69,
			"ayat": 37,
			"tafsir": "The food that the disbelievers eat, consisting of blood and pus, is food that no one eats. This shows the humiliating picture of a hellish life."
		   },
		   {
			"id": 5361,
			"surah": 69,
			"ayat": 38,
			"tafsir": "According to Muqatil, these verses were revealed in connection with the attitude of Quraysh leaders when they heard the recitation of verses from the Qur'an, such as the words of al-Walid bin al-Mugirah that Muhammad was actually a magician, the words of Abu Jahl that Muhammad was a poet, and 'Uqbah said that Muhammad was a sorcerer. This verse refutes those sayings. Allah confirmed to the polytheists of Mecca by swearing by His creatures, whether visible, known, and felt with the five senses or not, that the Al-Qur'an which was revealed to Muhammad was truly a revelation from Him. The Qur'an is not the words of Muhammad or the words that Muhammad invented and then said to be the word of God. From the words of Bima Tubsirun (everything you can see) it can be understood that actually the polytheists of Mecca should have been able to convince that the Qur'an was from Allah, not made by Muhammad. This is based on the knowledge they already have, such as knowledge about Muhammad, knowledge of the style and beauty of the Arabic language contained in the Qur'an, and the contents of the Qur'an itself. Then from the words \"wama la tubsirun\" (and what you don't see) it is understood that many things were not known to the polytheists of Mecca. If they knew that, of course they would be able to add to their faith and trust in Muhammad."
		   },
		   {
			"id": 5362,
			"surah": 69,
			"ayat": 39,
			"tafsir": "According to Muqatil, these verses were revealed in connection with the attitude of Quraysh leaders when they heard the recitation of verses from the Qur'an, such as the words of al-Walid bin al-Mugirah that Muhammad was actually a magician, the words of Abu Jahl that Muhammad was a poet, and 'Uqbah said that Muhammad was a sorcerer. This verse refutes those sayings. Allah confirmed to the polytheists of Mecca by swearing by His creatures, whether visible, known, and felt with the five senses or not, that the Al-Qur'an which was revealed to Muhammad was truly a revelation from Him. The Qur'an is not the words of Muhammad or the words that Muhammad invented and then said to be the word of God. From the words of Bima Tubsirun (everything you can see) it can be understood that actually the polytheists of Mecca should have been able to convince that the Qur'an was from Allah, not made by Muhammad. This is based on the knowledge they already have, such as knowledge about Muhammad, knowledge of the style and beauty of the Arabic language contained in the Qur'an, and the contents of the Qur'an itself. Then from the words \"wama la tubsirun\" (and what you don't see) it is understood that many things were not known to the polytheists of Mecca. If they knew that, of course they would be able to add to their faith and trust in Muhammad."
		   },
		   {
			"id": 5363,
			"surah": 69,
			"ayat": 40,
			"tafsir": "According to Muqatil, these verses were revealed in connection with the attitude of Quraysh leaders when they heard the recitation of verses from the Qur'an, such as the words of al-Walid bin al-Mugirah that Muhammad was actually a magician, the words of Abu Jahl that Muhammad was a poet, and 'Uqbah said that Muhammad was a sorcerer. This verse refutes those sayings. Allah confirmed to the polytheists of Mecca by swearing by His creatures, whether visible, known, and felt with the five senses or not, that the Al-Qur'an which was revealed to Muhammad was truly a revelation from Him. The Qur'an is not the words of Muhammad or the words that Muhammad invented and then said to be the word of God. From the words of Bima Tubsirun (everything you can see) it can be understood that actually the polytheists of Mecca should have been able to convince that the Qur'an was from Allah, not made by Muhammad. This is based on the knowledge they already have, such as knowledge about Muhammad, knowledge of the style and beauty of the Arabic language contained in the Qur'an, and the contents of the Qur'an itself. Then from the words \"wama la tubsirun\" (and what you don't see) it is understood that many things were not known to the polytheists of Mecca. If they knew that, of course they would be able to add to their faith and trust in Muhammad."
		   },
		   {
			"id": 5364,
			"surah": 69,
			"ayat": 41,
			"tafsir": "The Qur'an is not poetry as their poets used to pronounce it, because the Qur'an, in addition to its beautiful stylistic arrangement, also has deep content. The poems uttered by their poets do not have a stylistic arrangement as beautiful as that of the Qur'an and do not have a high meaning. There are many verses in the Al-Qur'an that challenge polytheists to make something similar or comparable to the Al-Qur'an, but they are unable to do so. And if you doubt (the Qur'an) that We sent down to Our servant (Muhammad), then compose a surahh like it and invite your helpers besides Allah, if you are truthful. If you are not able to make it, and (certainly) will not be able to, then fear the fire of hell whose fuel is human and stone, which is prepared for the disbelievers. (al-Baqarah\/2: 23-24) It was also emphasized that the Qur'an did not originate from the words of a soothsayer. Usually soothsayers are friends of the devil because they are looking for the devil's whispers. Even though the Al-Qur'an denounces the actions of satan, so that as such, it is not a whisper of satan nor is it the product of a sorcerer. In this regard, this verse refutes polytheists so they do not rush to conclusions that the Al-Qur'an is divination simply because they have not or do not know the contents of the Qur'an. Very few of them wanted to believe in the Qur'an at that time, and wanted to take lessons from its contents. The miracle of the Qur'an lies in its content. The higher a person's knowledge, the easier it will be to understand his meaning, in addition to the value of his language. Indonesian Muslims in general have difficulty proving and knowing the location of the miracles of the Qur'an in terms of language, because to know the height of the arrangement of words one must be able to feel the beauty of the style and language itself. Therefore, to know the level of the Al-Qur'an, it is enough to know the opinions and attitudes of Arab writers who challenged Islam towards the Al-Qur'an. Among them was Abu al-Walid, a well-known Arab leader and writer at that time. He was once sent by his people to the Prophet to ask him to stop his preaching. Hearing Abu al-Walid's request, the Prophet saw read surahh Fussilat\/41 from the first verse to the end of verse 14. Abu al-Walid was fascinated by hearing the verses, so he pondered thinking about the beauty of the language style. Then he immediately returned to his people. When asked about the results of the meeting, he told his people, \"I have never heard words as beautiful as that. What was read was not poetry, magic, or the words of a soothsayer. Hearing Abu al-Walid's answer, they alleged that he had been enchanted by Muhammad and had betrayed the religion of their forefathers. Among the leaders and elders of the Quraysh was al-Walid bin al-Mugirah. This man had heard the verses of the Qur'an recited by the Prophet. So he said to his people (Bani Makhzum), \"Recently I heard from Muhammad a saying which I don't think is the word of a human or a jinn. These words are pleasant to hear, pleasant to hear, like a tree which bears fruit at the top and sinks to the ground below. He truly excelled and could not be surpassed. Besides these two people, there were also many Arab writers at that time who tried to make similar verses from the Koran, but no one was able to do it. From these two verses it can be understood that very few among the polytheists of Mecca admit that the Qur'an is a book revealed by Allah to Muhammad, as well as those who take lessons from its contents. This is because: 1. They are afraid of being ostracized by their people by studying the Qur'an, even though their hearts and minds have acknowledged it, as was the case with Abu al-Walid and al-Walid bin al-Mugirah. 2. Some of them don't know the contents because they don't want to study it seriously. They denied it first."
		   },
		   {
			"id": 5365,
			"surah": 69,
			"ayat": 42,
			"tafsir": "The Qur'an is not poetry as their poets used to pronounce it, because the Qur'an, in addition to its beautiful stylistic arrangement, also has deep content. The poems uttered by their poets do not have a stylistic arrangement as beautiful as that of the Qur'an and do not have a high meaning. There are many verses in the Al-Qur'an that challenge polytheists to make something similar or comparable to the Al-Qur'an, but they are unable to do so. And if you doubt (the Qur'an) that We sent down to Our servant (Muhammad), then compose a surahh like it and invite your helpers besides Allah, if you are truthful. If you are not able to make it, and (certainly) will not be able to, then fear the fire of hell whose fuel is human and stone, which is prepared for the disbelievers. (al-Baqarah\/2: 23-24) It was also emphasized that the Qur'an did not originate from the words of a soothsayer. Usually soothsayers are friends of the devil because they are looking for the devil's whispers. Even though the Al-Qur'an denounces the actions of satan, so that as such, it is not a whisper of satan nor is it the product of a sorcerer. In this regard, this verse refutes polytheists so they do not rush to conclusions that the Al-Qur'an is divination simply because they have not or do not know the contents of the Qur'an. Very few of them wanted to believe in the Qur'an at that time, and wanted to take lessons from its contents. The miracle of the Qur'an lies in its content. The higher a person's knowledge, the easier it will be to understand his meaning, in addition to the value of his language. Indonesian Muslims in general have difficulty proving and knowing the location of the miracles of the Qur'an in terms of language, because to know the height of the arrangement of words one must be able to feel the beauty of the style and language itself. Therefore, to know the level of the Al-Qur'an, it is enough to know the opinions and attitudes of Arab writers who challenged Islam towards the Al-Qur'an. Among them was Abu al-Walid, a well-known Arab leader and writer at that time. He was once sent by his people to the Prophet to ask him to stop his preaching. Hearing Abu al-Walid's request, the Prophet saw read surahh Fussilat\/41 from the first verse to the end of verse 14. Abu al-Walid was fascinated by hearing the verses, so he pondered thinking about the beauty of the language style. Then he immediately returned to his people. When asked about the results of the meeting, he told his people, \"I have never heard words as beautiful as that. What was read was not poetry, magic, or the words of a soothsayer. Hearing Abu al-Walid's answer, they alleged that he had been enchanted by Muhammad and had betrayed the religion of their forefathers. Among the leaders and elders of the Quraysh was al-Walid bin al-Mugirah. This man had heard the verses of the Qur'an recited by the Prophet. So he said to his people (Bani Makhzum), \"Recently I heard from Muhammad a saying which I don't think is the word of a human or a jinn. These words are pleasant to hear, pleasant to hear, like a tree which bears fruit at the top and sinks to the ground below. He truly excelled and could not be surpassed. Besides these two people, there were also many Arab writers at that time who tried to make similar verses from the Koran, but no one was able to do it. From these two verses it can be understood that very few among the polytheists of Mecca admit that the Qur'an is a book revealed by Allah to Muhammad, as well as those who take lessons from its contents. This is because: 1. They are afraid of being ostracized by their people by studying the Qur'an, even though their hearts and minds have acknowledged it, as was the case with Abu al-Walid and al-Walid bin al-Mugirah. 2. Some of them don't know the contents because they don't want to study it seriously. They denied it first."
		   },
		   {
			"id": 5366,
			"surah": 69,
			"ayat": 43,
			"tafsir": "Al-Qur'an really comes from God the Creator, the Supreme Ruler, the Supreme Guardian and the Supreme Master of all nature."
		   },
		   {
			"id": 5367,
			"surah": 69,
			"ayat": 44,
			"tafsir": "These two verses confirm that the Al-Qur'an really comes from Allah, and was not created by Muhammad, poetry, or a soothsayer's imagination, because no human being is capable of producing such verses of the Al-Qur'an. Allah emphasized that if the Prophet Muhammad said something about Him and uttered words that he said came from Him, even though He never stated or said them, Allah would definitely hold his right hand to receive punishment from Him. For Allah is not heavy and difficult to punish him with a very big punishment, because He is Almighty over all things. The expression \"holding the right hand\" (al-akhdhu bil yamin) in this verse is an expression for an action taken against a person who is under someone's authority, with the intention of punishing that person. For example, like a king who gives punishment to a rebel. In this verse, this expression is used to state that for Allah there is no objection whatsoever to taking an action against Muhammad, if he does something that is not right against Him. This was a punishment for the Prophet, however severe the punishment was. This verse also implies that had the Qur'an been made by Muhammad, humans would have rejected him and he would have failed in carrying out his da'wah. The reality is the opposite, Muhammad was accepted by the believers because they believed in the truth of the Qur'an. And it turns out that Islam is growing day by day."
		   },
		   {
			"id": 5368,
			"surah": 69,
			"ayat": 45,
			"tafsir": "These two verses confirm that the Al-Qur'an really comes from Allah, and was not created by Muhammad, poetry, or a soothsayer's imagination, because no human being is capable of producing such verses of the Al-Qur'an. Allah emphasized that if the Prophet Muhammad said something about Him and uttered words that he said came from Him, even though He never stated or said them, Allah would definitely hold his right hand to receive punishment from Him. For Allah is not heavy and difficult to punish him with a very big punishment, because He is Almighty over all things. The expression \"holding the right hand\" (al-akhdhu bil yamin) in this verse is an expression for an action taken against a person who is under someone's authority, with the intention of punishing that person. For example, like a king who gives punishment to a rebel. In this verse, this expression is used to state that for Allah there is no objection whatsoever to taking an action against Muhammad, if he does something that is not right against Him. This was a punishment for the Prophet, however severe the punishment was. This verse also implies that had the Qur'an been made by Muhammad, humans would have rejected him and he would have failed in carrying out his da'wah. The reality is the opposite, Muhammad was accepted by the believers because they believed in the truth of the Qur'an. And it turns out that Islam is growing day by day."
		   },
		   {
			"id": 5369,
			"surah": 69,
			"ayat": 46,
			"tafsir": "In these two verses, Allah's power over His creatures is emphasized again. If Allah wants to do something to His servants, no one can prevent it, even if that action is an act that determines a person's life and death, such as the act of severing his heart artery, which results in his death. Likewise with Muhammad. If he lied against Allah, surely Allah would be angry with him and punish him with the death penalty, namely by severing his blood vessels. No one can prevent Him from carrying out the sentence."
		   },
		   {
			"id": 5370,
			"surah": 69,
			"ayat": 47,
			"tafsir": "In these two verses, Allah's power over His creatures is emphasized again. If Allah wants to do something to His servants, no one can prevent it, even if that action is an act that determines a person's life and death, such as the act of severing his heart artery, which results in his death. Likewise with Muhammad. If he lied against Allah, surely Allah would be angry with him and punish him with the death penalty, namely by severing his blood vessels. No one can prevent Him from carrying out the sentence."
		   },
		   {
			"id": 5371,
			"surah": 69,
			"ayat": 48,
			"tafsir": "The Qur'an is not the word of a poet, nor the result of soothsayers, nor is it the word of Muhammad, but is the word of Allah which was sent down to the Prophet Muhammad to be conveyed to mankind. With the Al-Qur'an, humans will believe and will receive guidance in rowing the ark of their life to the island they aspire to, namely the happiness of living in this world and in the hereafter. From this verse it is understood that in order to achieve happiness in life in this world and in the hereafter, humans need guidance. There are instructions that can be achieved by the mind, and some are not. What the mind can achieve is how they live, make a living, plant rice, raise livestock, how to protect themselves from rain and heat, and so on. There are also clues that cannot be reached by the human mind, so someone has to show them. Only Allah, as the creator, owner and ruler of all creatures, can provide such instructions. All of Allah's instructions are contained in the Qur'an and explained by the traditions of the Prophet, and given to people who think. Do non-believers think like that?"
		   },
		   {
			"id": 5372,
			"surah": 69,
			"ayat": 49,
			"tafsir": "This verse is a strong warning to the polytheists. It was explained that Allah is All-Knowing of everything that exists in this nature, from the small to the large, the subtle to the gross, and the invisible to the visible. Therefore, Allah knows everyone who denies the Qur'an, denies the messenger, and commits forbidden acts. Then Allah will take action and punish as fairly as possible among humans, according to their deeds. From the words \"minkum\" (part of you) contained in this verse, it can be understood that there are polytheists who believe in the truth of the Qur'an and the Messenger of Allah. However, because of lust, fear of being ostracized by their people, fear of losing rank and wealth, they belied him. Allah said: Verily he has thought and determined (what he determined), so woe to him! How did he determine? Again, woe to him! How did he determine? Then he (contemplated) thought, then his face was sour and sullen, then turned away (from the truth) and boasted, then he said, \"This (Qur'an) is only magic learned (from the ancients). This is only human words.\" (al-Muddatstsir\/74: 18-25)"
		   },
		   {
			"id": 5373,
			"surah": 69,
			"ayat": 50,
			"tafsir": "In this verse it is explained that the Qur'an causes disappointment for disbelievers, both during life in this world and in the hereafter. In the world they are disappointed because the influence of the Islamic religion has grown stronger so that the influence of the shirk belief has diminished, and in the end it has completely disappeared without a trace. The Qur'an states that their beliefs are wrong, such as worshiping statues that cannot cause harm or benefit. In the afterlife, after experiencing a terrible punishment, they will regret why they did not follow the call of the Prophet Muhammad, as did believers. However, their regret is of no use anymore because the door of repentance has been closed."
		   },
		   {
			"id": 5374,
			"surah": 69,
			"ayat": 51,
			"tafsir": "In this verse, it is emphasized again that the Qur'an is a true and real truth. It really comes from the Lord of the Worlds, not the words that Muhammad made up."
		   },
		   {
			"id": 5375,
			"surah": 69,
			"ayat": 52,
			"tafsir": "Therefore, the Prophet Muhammad was ordered to glorify in the name of Allah and give thanks to Him because He has bestowed countless blessings on him and on all mankind in the form of the Qur'an, as a guide in achieving happiness in life in this world and in the hereafter. Indeed, God who has given grace is God Almighty."
		   }
	]
}
