{
	"tafseer": [
		{
			"id": 6177,
			"surah": 103,
			"ayat": 1,
			"tafsir": "In this verse, Allah swears by the period that occurred in it various events and experiences which are proof of Allah's absolute power, His high wisdom, and His vast knowledge. The great changes that occurred at that time itself, such as the alternation of day and night continuously, the end of the human lifespan, and so on, were signs of God's majesty. In another verse, Allah says: And some of His signs are the night, the day, the sun and the moon. (Fussilat\/41: 37) What humans experienced at that time from joy and sorrow, poverty and wealth, free and busy, joy and sorrow, and so on clearly shows that for this universe there is a creator and controller. He is the God who must be worshiped and it is only Him we ask to ward off harm and reap benefits. As for the disbelievers, they only relate these events to a certain period, so they assume that if a disaster befalls them, it is only the will of nature. Allah explains that time (time) is one of His creatures and in it various events, evil and good occur. When a person is struck by a calamity, it is the result of his actions. Period (time) did not intervene with the occurrence of the disaster."
		   },
		   {
			"id": 6178,
			"surah": 103,
			"ayat": 2,
			"tafsir": "In this verse, Allah reveals that humans as God's creatures really as a whole are at a loss if they do not use their time well or are used to do bad things. Man's bad deeds are the source of accidents that plunge him into destruction. A person's sin against his Lord who gives him immeasurahble favors is an incomparable offense that harms him."
		   },
		   {
			"id": 6179,
			"surah": 103,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains that if man does not want his life to suffer losses, then he must believe in Him, carry out worship as he is commanded, do good for himself, and try to benefit others. In addition to believing and doing good deeds, they must advise each other to obey the truth and remain patient, stay away from immoral acts that everyone tends to, because of the impulse of their desires."
		   }
	]
}
