{
	"tafseer": [
		{
			"id": 5105,
			"surah": 58,
			"ayat": 1,
			"tafsir": "This verse explains that Allah has accepted a woman's lawsuit filed against Rasulullah SAW about her husband's actions. She felt aggrieved by her husband, because her dizihar would end her life in a tailspin. Allah has also heard the question and answer that occurred between the suing wife and Rasulullah SAW. Therefore, Allah sent down a law that could eliminate the wife's worries. Zihar is a husband's words to his wife, \"Anti 'alayya ka dhahri ummi (You think it is forbidden for me to interfere, like I am forbidden to interfere with my mother).\" Zihar is part of the Jahiliyyah Arabic law which was later declared valid among Muslims by the revelation of this verse. However, the law has changed in such a way that the elements that could harm the wife have disappeared. According to Arab Jahiliyyah law, if a husband commits zihar to his wife, then from then on his wife is forbidden to be mixed with him. So since then his wife lived in a state of limbo. After the zihar, her marriage to her husband has not been broken, but her husband cannot interfere with her anymore. Usually, the wife who is given zihar is no longer supported by her husband, and the possibility of marrying someone else is hindered by the fact that there is still a marriage bond with her husband. Zihar was done by the husband to his wife in the Arab Jahiliyya era, usually because the husband did not love his wife anymore or because he was angry with his wife, but he intended to tie his wife up. Such behavior was common in the Arab Jahiliyya era because it despised the status of women. Meanwhile, Islam equates women with men."
		   },
		   {
			"id": 5106,
			"surah": 58,
			"ayat": 2,
			"tafsir": "This verse denounces husbands who have made zihar to their wives by saying that those who have made zihar are untruthful words spoken by people who do not use their common sense. Is it possible that the wife is the same as the mother? The wife is a life partner who is connected by a marriage contract, while the mother is the person who gave birth to them so there is a blood relationship. Therefore, such a person is a person who says words that are unethical and are not justified by religion, reason or custom. Those words are unethical words, without the slightest reason. Even so, Allah will forgive the sins of the person who has made zihar his wife, if he follows His provisions. There is a principle in Islam that must be upheld, namely \"acknowledging the facts that exist in accordance with sunatullah.\" In establishing the laws that apply in this nature, Allah knows the wisdom and the consequences correctly and definitely. Therefore, it is very despicable for those who want to change the sunatullah, such as seeing a wife as a mahram, even though Allah has decreed that a man should marry a man who is forbidden (see surahh an-Nisa'\/4: 22-24, and several other verses). In verse 4 of surahh al-Ahzab\/33, the words of zihar are coupled with the words of an adopted child. Because recognizing someone else's child as one's own biological child is as legal as one's own child, including saying something that is not in accordance with sunatullah, and is not in accordance with the truth. Then Allah confirms that the adopted child is the child of the father and mother, not the child of the person who adopted him. Allah said: Call them (adopted children) by (using) the names of their fathers; that is what is fair with Allah, and if you do not know their father, then (call them as) your brothers in religion and your masters. And there is no sin on you if you make mistakes about it, but (which is a sin) what your heart intends. Allah is Forgiving, Most Merciful. (al-Ahzab\/33: 5) From the third verse of this surahh it can be understood that a husband who commits zihar to his wife receives ukhrawi punishment and worldly punishment. Ukhrawi's punishment is that they sin because they say nonsense, namely saying that his wife is forbidden to be mixed with him, just as he is forbidden to interfere with his mother. In religion, it is a forbidden act if someone justifies what is unlawful or forbids what is lawful, because it is only Allah who determines what is lawful and what is unlawful. The worldly punishment is that he is obliged to pay expiation if he wants to interfere with his wife again, and the amount of expiation is quite large, as will be explained later. Scholars agree that equating a wife with a mother with the intention of expressing affection for her or expressing respect and gratitude to her is not considered zihar. Because the zihar is only the words of the husband stating that his wife is unlawful for him to interfere with. The word anti 'alaiyya ka dhahri ummi is an expression (idiom) that has a special meaning in Arabic. Only a person who has a deep sense of language can feel the meaning of that expression. Therefore, if a husband who only understands Indonesian, says sigat dhihar in an expression that is understood by Indonesians, then the above law also applies to him. According to Hanifah, Auza'i, ats-tsauri and one of Imam Syafi'i's qauls may be called in sigat dhihar women other than mothers, as long as the woman named is a male muhrim who performs zihar, like a husband who says, \"You are unlawful for me interfere, as I was forbidden to interfere with my biological sister.\" If a husband has made the pilgrimage to his wife, it does not mean that there has been a divorce between the husband and wife. Each is still bound by rights and obligations as husband and wife. They are only forbidden to have intercourse. Likewise, in order to avoid committing unlawful acts, it is also forbidden for both husband and wife to do khalwat (together in a quiet place) before the husband pays expiation. In order for the wife not to be in a bind and suffer because of the zihar, it is better to set a waiting time for the wife. The waiting time can be compared to the waiting time in ila'ï€ª), which is four months. If four months have passed since the husband said his zihar, while the husband has not yet made a decision, divorced or continued the marriage by paying expiation, then the wife has the right to file a lawsuit with the court. The judge will certainly grant the wife's claim if the lawsuit is proven. If the zihar results in divorce, then talak ba'in kubra will fall, where remarriage between the former husband and wife must be conditional on paying expiation."
		   },
		   {
			"id": 5107,
			"surah": 58,
			"ayat": 3,
			"tafsir": "In these verses it is explained the conditions for husband and wife so that they can mix or remarry if they are divorced, that is, the husband is obliged to pay expiation. The obligation to pay expiation is due to the occurrence of zihar and the intention of the husband to interfere with his wife ('aud). In this verse, the three stages of expiation of zihar are explained. The first step is to try to implement it. If the first stage cannot be carried out, may carry out the second stage. If the second stage is also not able to carry out, the third stage must be carried out. These stages are: 1. Freeing a slave before carrying out sexual intercourse again. This is Allah's stipulation that has been stipulated for all believers, so that they are careful of wrongdoing and pay for the expiation as an expiation for the sin of wrongdoing. Allah pays attention to and knows all the deeds of His servants, and will forgive all His servants who want to stop wrongdoing and carry out Allah's laws. At this time slavery has been removed from the surface of the earth, because of this first degree of expiation is no longer possible. Liberating slaves as expiation is one of the ways in Islam to get rid of slavery, which was once entrenched among the nations of the world, as happened in America, Europe and others. Therefore, Islam is a religion that seeks to abolish slavery and prescribes ways to abolish it immediately. 2. If the first cannot be done, then you should fast for two consecutive months. Successively is one of the conditions of the fast that will be carried out. This means that if there are days of fasting that are not carried out, such as fasting one day or more and then not fasting on another day during the two months, then the fast cannot be made expiatory, even if the non-fasting was due to a long journey (sagafar) or illness. . Fasting must be done before sexual intercourse between husband and wife. 3. If the second cannot be carried out, then the third stage is carried out, namely feeding sixty poor people. Zihar is a kind of oath, namely the husband's oath stating that it is forbidden for his wife to interfere with her, just as it is forbidden for her to interfere with her mother. Therefore, the husband who is obliged to pay expiation is the husband who performs zihar only, because he is the one who swears, while a wife who has never performed zihar is not obliged to pay expiation. The amount or form of zihar expiation that is determined is a very high amount or form, especially when it is remembered that the law applies to all Muslims, whether rich or poor. For a rich person there is no difficulty in paying expiation, but it is difficult and hard to pay for poor people. Facing problems like this, Islamic law has principles that can lighten a burden that Allah bears on Muslims, namely the principle, \"Difficulties create ease,\" provided that difficulties are really difficulties that cannot be overcome, accompanied by desire in the heart to seek the pleasure of Allah. In connection with this, in the continuation of the hadith of Khuwailah bint Malik narrated by Abu Dawud, it is said: So the Messenger of Allah said, \"Let him free a slave.\" Khaulah said, \"He was not able to afford it.\" The Prophet said, \"(If so) then he fasted two months in a row.\" Khaulah said, \"O Messenger of Allah, in fact he (my husband) is an old fart, unable to fast anymore.\" The Prophet said, \"Then let him feed sixty poor people.\" Khaulah said, \"He has nothing to give in charity.\" The Messenger of Allah said, \"(If so) then surely I will help him with a bowl of tamar.\" Khaulah said, \"And I will help him too with a bowl of wine.\" The Messenger of Allah said, \"You are really good, go, then tell it on his behalf, feed sixty poor people with this tamar.\" (History of Abu Dawud) In another history it is explained that Khaulah told Rasulullah SAW that the poorest people in this country are his family. So the Messenger of Allah ordered Khaulah to bring the dates as expiation back to his house to be eaten by his own family. Basically the Islamic religion does not approve of the existence of the zihar, and even views it as an evil and sinful act, because the zihar is an act that has no basis, saying something nonsense. However, because the zihar was a custom of the Jahiliyyah Arabs, while erasing this habit in a short time would cause shock to the newly growing Islamic society, while this society originated with the Arabs of the Jahiliah period, the religion of Islam did not immediately abolish it. the habit. The Islamic religion eliminates all the consequences caused by the zihar act by setting a waiting time of four months. During that period, the husband may divorce his wife or pay expiation for those who want to interfere with his wife again, that is, revoke the zihar words he has spoken. So the zihar comes from the Arabic law of the Jahiliyya era which was abolished by Islam. Therefore, for countries or Muslims who do not know the zihar, there is no need to include the law when they make a marriage law. At the end of this verse it is explained that Allah explains that the obligation to pay expiation for a husband who has committed adultery with his wife is to deepen the soul of monotheism, to believe in the Prophet Muhammad as Allah's messenger, and to be careful in saying a word, so that he does not lie and say something that is not. No. Thus, instilled in the hearts of every believer the desire to carry out all of God's laws as well as possible. It is also embedded in their hearts that disobeying Allah's laws will cause misery in this world and in the hereafter."
		   },
		   {
			"id": 5108,
			"surah": 58,
			"ayat": 4,
			"tafsir": "In these verses it is explained the conditions for husband and wife so that they can mix or remarry if they are divorced, that is, the husband is obliged to pay expiation. The obligation to pay expiation is due to the occurrence of zihar and the intention of the husband to interfere with his wife ('aud). In this verse, the three stages of expiation of zihar are explained. The first step is to try to implement it. If the first stage cannot be carried out, may carry out the second stage. If the second stage is also not able to carry out, the third stage must be carried out. These stages are: 1. Freeing a slave before carrying out sexual intercourse again. This is Allah's stipulation that has been stipulated for all believers, so that they are careful of wrongdoing and pay for the expiation as an expiation for the sin of wrongdoing. Allah pays attention to and knows all the deeds of His servants, and will forgive all His servants who want to stop wrongdoing and carry out Allah's laws. At this time slavery has been removed from the surface of the earth, because of this first degree of expiation is no longer possible. Liberating slaves as expiation is one of the ways in Islam to get rid of slavery, which was once entrenched among the nations of the world, as happened in America, Europe and others. Therefore, Islam is a religion that seeks to abolish slavery and prescribes ways to abolish it immediately. 2. If the first cannot be done, then you should fast for two consecutive months. Successively is one of the conditions of the fast that will be carried out. This means that if there are days of fasting that are not carried out, such as fasting one day or more and then not fasting on another day during the two months, then the fast cannot be made expiatory, even if the non-fasting was due to a long journey (sagafar) or illness. . Fasting must be done before sexual intercourse between husband and wife. 3. If the second cannot be carried out, then the third stage is carried out, namely feeding sixty poor people. Zihar is a kind of oath, namely the husband's oath stating that it is forbidden for his wife to interfere with her, just as it is forbidden for her to interfere with her mother. Therefore, the husband who is obliged to pay expiation is the husband who performs zihar only, because he is the one who swears, while a wife who has never performed zihar is not obliged to pay expiation. The amount or form of zihar expiation that is determined is a very high amount or form, especially when it is remembered that the law applies to all Muslims, whether rich or poor. For a rich person there is no difficulty in paying expiation, but it is difficult and hard to pay for poor people. Facing problems like this, Islamic law has principles that can lighten a burden that Allah bears on Muslims, namely the principle, \"Difficulties create ease,\" provided that difficulties are really difficulties that cannot be overcome, accompanied by desire in the heart to seek the pleasure of Allah. In connection with this, in the continuation of the hadith of Khuwailah bint Malik narrated by Abu Dawud, it is said: So the Messenger of Allah said, \"Let him free a slave.\" Khaulah said, \"He was not able to afford it.\" The Prophet said, \"(If so) then he fasted two months in a row.\" Khaulah said, \"O Messenger of Allah, in fact he (my husband) is an old fart, unable to fast anymore.\" The Prophet said, \"Then let him feed sixty poor people.\" Khaulah said, \"He has nothing to give in charity.\" The Messenger of Allah said, \"(If so) then surely I will help him with a bowl of tamar.\" Khaulah said, \"And I will help him too with a bowl of wine.\" The Messenger of Allah said, \"You are really good, go, then tell it on his behalf, feed sixty poor people with this tamar.\" (History of Abu Dawud) In another history it is explained that Khaulah told Rasulullah SAW that the poorest people in this country are his family. So the Messenger of Allah ordered Khaulah to bring the dates as expiation back to his house to be eaten by his own family. Basically the Islamic religion does not approve of the existence of the zihar, and even views it as an evil and sinful act, because the zihar is an act that has no basis, saying something nonsense. However, because the zihar was a custom of the Jahiliyyah Arabs, while erasing this habit in a short time would cause shock to the newly growing Islamic society, while this society originated with the Arabs of the Jahiliah period, the religion of Islam did not immediately abolish it. the habit. The Islamic religion eliminates all the consequences caused by the zihar act by setting a waiting time of four months. During that period, the husband may divorce his wife or pay expiation for those who want to interfere with his wife again, that is, revoke the zihar words he has spoken. So the zihar comes from the Arabic law of the Jahiliyya era which was abolished by Islam. Therefore, for countries or Muslims who do not know the zihar, there is no need to include the law when they make a marriage law. At the end of this verse it is explained that Allah explains that the obligation to pay expiation for a husband who has committed adultery with his wife is to deepen the soul of monotheism, to believe in the Prophet Muhammad as Allah's messenger, and to be careful in saying a word, so that he does not lie and say something that is not. No. Thus, instilled in the hearts of every believer the desire to carry out all of God's laws as well as possible. It is also embedded in their hearts that disobeying Allah's laws will cause misery in this world and in the hereafter."
		   },
		   {
			"id": 5109,
			"surah": 58,
			"ayat": 5,
			"tafsir": "This verse warns people who oppose Allah and His Messenger, by choosing the law that applies to them, not the law that has been established by Allah and His messengers, and embracing a religion that is not a religion that has been prescribed by Him. They will be punished in the form of humiliation while living in the world, as has been inflicted on the ancients who denied the messengers sent by God to them. This verse is good news and adds to the enthusiasm of the Muslims who are currently experiencing pressure from those who have allied themselves in the Ahzab War. At that time, the Jews, the polytheists of Mecca, and the hypocrites united and allied themselves against the Muslims, so that their number was far greater than the number of Muslims. Because of the high morale of the Muslims and their belief in Allah's help that will be given to them, they were able to defeat the allied army. This verse is a warning to leaders that they will be held accountable by Allah in the hereafter, whether they have carried out Allah's laws in their government. This is because Allah has confirmed that the law and religion that humans are allowed to follow is only Islam. Apart from that, humans are prohibited from following and adhering to it. Allah says: This day I have perfected your religion for you, and I have completed My blessings upon you, and I have approved Islam as your religion. But whoever is forced because of hunger, not because he wants to sin, then indeed, Allah is Forgiving, Most Merciful. (Al-Ma'idah\/5: 3) The Islamic religion in question is the religion preached by the Prophet Muhammad received from Allah. Meanwhile, regarding matters that have been determined, rulers or people who represent their people are allowed to stipulate other laws that regulate the life of their people, as long as these laws do not conflict with the laws that have been determined by Allah. It was explained that Allah had revealed His verses to the Prophet Muhammad, who put forward strong arguments and evidence for the truth of religion and its laws. No one can break the arguments and evidence, even though they still deny and violate these laws. From these verses it can be understood that Allah commands humans, especially intelligent people, to study and discuss Allah's laws, use their reason, mind and experience, even with all the abilities they have. Then provide a proper and objective assessment. In the last 4th verse it says, \"Wa lil-kafirina 'adhabun alim\" (and for those who disbelieve a painful punishment), while in this fifth verse it says, \"Wa lil kafirina 'adhabun muhin\" (and for those who disbelievers humiliating punishment). What is meant by unbelievers in verse 4 are believers who violate the provisions. They get a painful doom as a lesson for them to immediately repent and realize their mistakes. Whereas what is meant by infidels in the fifth verse is people who are truly infidels, do not believe. For them the punishment that causes humiliation during the life of the world, such as losing their sense of shame, feeling used to doing forbidden actions, feeling used to cheating and committing heinous deeds. Such people are usually powerful people who can do whatever they want, but other people no longer have true respect for them. There are many more serious forms of humiliation they receive."
		   },
		   {
			"id": 5110,
			"surah": 58,
			"ayat": 6,
			"tafsir": "This verse describes the condition of those who oppose and violate God's laws in the hereafter. Allah gathered them all from the first human, namely Adam, until the last moment of human life, on the Day of Resurrection. Then Allah tells them what they have done while living in the world. All of this is recorded in their respective notebooks, not a single thing is forgotten, even though they themselves have forgotten it because nothing escapes the knowledge of Allah."
		   },
		   {
			"id": 5111,
			"surah": 58,
			"ayat": 7,
			"tafsir": "This verse explains how extensive, deep, and complete God's knowledge is about the creatures He created, from the smallest to the largest. It was explained that Allah's knowledge includes everything in the heavens and on earth, however small and subtle. If there are three people in the heavens and on earth whispering, then Allah is the fourth. If it is four people whispering and holding secret negotiations, then Allah is the fifth, and if it is five people whispering and holding secret negotiations, then Allah is the sixth. Even how many people whisper and hold secret negotiations and wherever they do it, Allah knows it. The mention of the numbers three, four, and five people in the verse is only to state that usually the negotiations are carried out by several people, such as three, four, five, and so on, and each of these negotiations is sure to be witnessed by Allah. Allah said: Do they not know that Allah knows their secrets and whispers, and that Allah knows everything that is unseen? (at-Taubah\/9: 78) And said: Or do they think that We do not hear their secrets and whispers? Actually (We hear), and Our messengers (angels) always record by their side. (az-Zukhruf\/43: 80) At the end of this verse, Allah confirms that the truth about Allah is All-Knowing of all things, only then will they know on the Day of Resurrection, when they put forward their record of deeds in which all the deeds they have done are recorded while living in the world, namely in the form of good deeds and bad deeds, nothing is forgotten to be recorded. Only then do the disbelievers regret their actions, but regretting later is of no use whatsoever."
		   },
		   {
			"id": 5112,
			"surah": 58,
			"ayat": 8,
			"tafsir": "This verse denounces the actions of the Jews who took actions that provoked discord and enmity between them and the Muslims, even though a peace agreement had been made between them and the Muslims. Rasulullah saw warned their attitude, but they did not heed it. Their conversation in whispers can actually magnify their sins against Allah. The sin was because they had violated the peace agreement they made with the Prophet, that they and the Muslims would maintain peace and try to create a peaceful atmosphere in the city of Medina. They are guilty because every time they look for opportunities to destroy the Muslims and thwart the preaching of the Prophet Muhammad. The Jews, when they met or came to Rasulullah saw, they said greetings, but the contents insulted Rasulullah saw. 'Aisyah answered with a harsher answer, because the attitudes and actions of the Jews transgressed, both in terms of social decency and in terms of the customs that prevailed at that time. In terms of the Islamic religion, the actions of the Jews have really crossed the line, because Muhammad saw was a prophet and messenger of Allah, where every Muslim prays for safety and goodness for him. Allah swt said: Verily Allah and His angels pray for the Prophet. O you who believe! Salawat you for the Prophet and greet him with full respect. (al-Ahzab\/33: 56) From the verse above and the reasons for its decline, it can be understood that we must be patient with the abominable utterances that are thrown at us. Don't reply right away like they did, for therein lies the difference between a Muslim and an infidel. With patience they will realize and realize that they have made a mistake. After the Jews said insulting greetings to the Prophet as mentioned above, they said to each other, \"Why doesn't Allah inflict punishment on us as a result of Muhammad's answer. If Muhammad were really a prophet and messenger sent by Allah, we would have doomed.\" Such assumptions about Allah, that Allah will immediately punish everyone who disobeys Him, are wrong assumptions. It is true that He will punish everyone who disobeys Him, but when the punishment comes is His business. He will inflict the punishment when He wills. But when the punishment comes, no one can escape it. In terms of answering greetings to non-Muslims, the scholars differed. Ibn 'Abbas, ash-Sya'bi, and Qatadah stated that it is obligatory to answer greetings to non-Muslims, as is the case with greetings to fellow Muslims. Meanwhile, Imam Malik and Shafi'i stated that it is not obligatory, in the sense that it is only permissible. When they greet us, it is enough for us to answer them with \"'alaika.\" At the end of this verse, Allah refutes their claim firmly that they will definitely be put into Hell. They will be scorched in it. Hell is the worst possible place to return to for unbelievers."
		   },
		   {
			"id": 5113,
			"surah": 58,
			"ayat": 9,
			"tafsir": "Then Allah confronted his commandment to believers not to ever hold secret negotiations between them with the aim of sinning, holding enmity, and disobeying Allah and the Messenger. If they hold secret negotiations too, that is permissible, but what is discussed in the negotiations is only good deeds, discussing good methods, doing pious deeds, and avoiding wrongdoing. It should be known that Allah knows everything, there is nothing that escapes His knowledge. Therefore, no matter how secret the negotiations are, He must know them. And whoever disobeys Allah and His Messenger and transgresses the limits of His law, Allah will put him in the fire of hell, he will abide therein and he will receive a humiliating punishment. (an-Nisa'\/4: 14) In one hadith it is explained as follows: If there are three of you, then don't two of you whisper without inviting the third one so that you join the others, because that attitude makes his feelings sad. (History of al-Bukhari and Muslim)"
		   },
		   {
			"id": 5114,
			"surah": 58,
			"ayat": 10,
			"tafsir": "In this verse it is explained that whispering and holding secret negotiations to create enmity and conflict are the efforts and actions of Satan. He encourages people to do it, so they disobey Allah and His Messenger. That is the purpose of satan's life. He influenced humans from their ancestor, namely the Prophet Adam. The more humans he can seduce, the more friends he will have in hell. It is also explained that Satan's attempt is to cause sorrow in the hearts of believers. Whispers and secret negotiations conducted by the Jews and hypocrites, created a sense of insecurity in the hearts of believers. In fact, the human accidents that are attempted by satan will not materialize and be carried out, without the permission of Allah, the Almighty, who determines all things. At the end of this verse, Allah confirms that Muslims must not be provoked and feel insecure because of whispers and secret agreements made by unbelievers. Everything will not be accomplished, unless Allah allows it. Therefore, every Muslim must put his trust in Allah and not believe in anyone except Him."
		   },
		   {
			"id": 5115,
			"surah": 58,
			"ayat": 11,
			"tafsir": "This verse provides an explanation that if among the Muslims there are those ordered by the Messenger of Allah to stand up to give certain people the opportunity to sit down, or they are ordered to leave first, they should either stand up or leave, because he wants to pay homage to those people, wants to be alone. to think about religious matters, or carry out tasks that needed to be completed urgently. From this verse, the following matters can be understood: 1. The companions are vying to find a place near the Messenger of Allah so that it is easy to hear the words he conveyed to them. 2. The order to give places to people who have just arrived is a suggestion, if possible, to create a sense of friendship among those present. 3. In fact, for everyone who makes room for Allah's servant in doing good deeds, Allah will also make it easy for him in this world and in the hereafter. Providing space for fellow Muslims in socializing and seeking virtue and goodness, trying to please their brothers and sisters, giving help, and so on is included in what the Prophet Muhammad recommended. He said: Allah always helps the servant as long as the servant helps his brother. (Muslim history from Abu Hurairah) Based on this verse, the scholars are of the opinion that those who attend an assembly should comply with the provisions that apply in that assembly or obey the orders of those who govern the assembly. If you study the meaning of the verse above, there is a provision that is determined by this verse, namely that people attend an assembly whether they come on time or who are late, always maintain a good atmosphere, be full of brotherhood and be tolerant of one another. For those who come first, they should fill the space in advance, so that those who come later do not have to step over or disturb those who have attended first. For people who arrive late, they should be willing with the circumstances they encounter, such as not getting a seat. This is what is meant by the words of the Prophet: Do not order someone to get up from their seat, then he sits in that place, but let them move and make room.\" (Muslim history from Ibn 'Umar) The end of this verse explains that Allah will raise up degree of people who believe, obey and obey Him, carry out His commands, stay away from His prohibitions, try to create an atmosphere of peace, security and peace in society, as well as knowledgeable people who use their knowledge to enforce Allah's sentence. it is understood that those who have the highest degree in the sight of Allah are those who believe and have knowledge. Their knowledge is practiced in accordance with what Allah and His Messenger have commanded. Then Allah confirms that He is All-Knowing of everything that humans do, nothing is hidden from Him. He will reward him justly according to the deeds he has done. Good deeds will be rewarded with heaven and evil and forbidden deeds will be rewarded with the punishment of hell."
		   },
		   {
			"id": 5116,
			"surah": 58,
			"ayat": 12,
			"tafsir": "According to the history of Ibn Abi Hatim from Ibn 'Abbas, it was explained that many of the companions wanted to ask the Messenger of Allah, so that it was a burden to him. To lighten his burden, Allah sent down this verse, by ordering charity before facing the Messenger of Allah. This verse instructs believers if they want to talk secretly with the Messenger of Allah about something important, they should give charity before having the conversation. The order was to prove the greatness of the Prophet by glorifying him, and bringing benefits to the poor. This is also to distinguish between people who truly love the Messenger of Allah and expect lessons from him, and hypocrites whose words and deeds are different. On the other hand, this order prevented people from coming to the Messenger of Allah without very important needs so that it would keep him busy. According to Abu Muslim, Allah ordered this because it is the hypocrites whose mouths express faith, while their hearts are still disbelievers. Declare that they converted to Islam in truth. To test this statement, an order was given to give alms before facing the Messenger of Allah. The benefits of giving alms are getting multiple rewards from Allah, cleaning and purifying possessions, and cleansing the soul from the desire to collect wealth and make it a goal in life. Like giving alms can reduce the misery of poor people and can also exalt the sentence of Allah. The assets donated are directly given to those who are entitled to receive them, not given to the Prophet, because one of the goals of the charity is to glorify the Prophet and ease the burdens of the poor. At the end of this verse it is explained that if the person who is going to meet the Messenger of Allah does not have anything to give in charity, while he really needs to meet with him, then Allah will give him relief by not requiring him to give charity. The alms referred to here are sunnah alms, not obligatory alms, and the amount is not determined, only according to the sincerity and ability of the giver. What this verse emphasizes is that Muslims love to give alms, are not stingy, and are aware that the wealth they earn is solely a tool to seek Allah's pleasure. The obligation to give alms in this verse is to test the will of the hypocrites who have just converted to Islam."
		   },
		   {
			"id": 5117,
			"surah": 58,
			"ayat": 13,
			"tafsir": "According to the history of Ibn Abi Hatim from thalhah from Ibn 'Abbas it is said that after verse 12 above was revealed, most people refrained from asking the Prophet because they had to pay alms. Therefore, this verse was revealed as a warning to people who did not want to ask the Prophet Muhammad because they had to pay alms. This verse reprimands people who hold themselves from meeting the Messenger of Allah because of the obligation to pay alms in advance. In this verse it is stated, \"Did you not come to the Messenger of Allah because you were afraid of being poor because you had to pay alms in advance, even though you really needed an explanation and explanation?\" Allah then gave relief to these people by translating verse 12 with verse 13, especially by stating, \"If all of you are really unable to carry out the recommendation to give alms before facing the Messenger of Allah, then you may all face to ask something that explanation is needed, without giving alms first. Carry out what has been explained as well as possible. \" Then Allah reminded Muslims of another obligation that must be carried out, namely that they pray continuously according to a predetermined time, never leaving it, even under any circumstances. Prayer is very beneficial for humans, namely to perfect self-serving to Allah, and purify obedience and submission only to Him, not to others. The prayer can eliminate and erode the desires to do heinous and unjust acts. Muslims are also ordered to issue zakat if it meets the conditions. Zakat aims to purify the soul, eliminate the miserly qualities that exist in the heart, and help the suffering of the poor. Then it was emphasized that Muslims obey the commands of Allah and His Messenger and stop everything that He has forbidden. At the end of this verse, Allah warns people to always be careful of all the actions and desires of their heart. Because, Allah knows everything, nothing escapes His knowledge. Based on that knowledge, He recompenses every human being accordingly. Allah says: So whoever does an atom's weight of good, surely he will see (reply) it, and whoever does a particle's weight of evil, surely he will see (reply) it. (az-Zalzalah\/99: 7-8) And Allah's Word: (That is) that a person who sins will not bear the sins of others, and that man only gets what he has worked for, and indeed his efforts will be shown (to him), then he will be rewarded with the most perfect reward. (an-Najm\/53: 38-41)"
		   },
		   {
			"id": 5118,
			"surah": 58,
			"ayat": 14,
			"tafsir": "Allah ordered the Muslims to pay close attention to the hypocrites who made the Jews their loyal companions, and they conveyed to the Jews the secrets they often heard from the Holy Prophet and the Muslims. When they meet believers, they declare their faith and promise to join in preaching and fight to uphold God's word. However, when they met the Jews, they described the ugliness of the Muslims and promised together they would destroy Islam and the Muslims. Allah's Word: And among mankind there are those who say, \"We believe in Allah and the Last Day,\" but in fact they are not believers. They deceive Allah and those who believe, but they are only deceiving themselves without knowing it. In their hearts there is a disease, then God increases the disease; and they will have a painful punishment, because they lied. (al-Baqarah\/2: 8-10) According to the history of Ahmad and al-hakim received from as-Suddi from Ibn 'Abbas, that this verse was revealed in connection with 'Abdullah bin Nabtal, a hypocrite who often conveys the secrets of the Muslims to the Jewish people. One day, the Messenger of Allah was sitting in his house, then he told his friends who were sitting around him, \"A person will come to your place who looks like the eyes of the devil. If he comes later, don't talk to him.\" Not long after, someone came, namely 'Abdullah bin Nabtal, and Rasulullah said to him, \"Why are you and your friends insulting me and my friends?\" The man replied, \"I will call my friends to prove the untruth of the accusation.\" After he and his friends arrived before the Messenger of Allah, they swore by the name of Allah, that they had never done what was alleged. Allah confirms that the hypocrites are not true believers, as they claim to be. They profess to have faith solely to win the hearts of those who believe, and to maintain good relations with them. The hypocrites were also not among the true Jews. They claim to be Jews solely to ingratiate themselves with the Jewish people, thus obtaining protection from them. With that two-faced way, they thought they would be able to avoid the war that took place between the Muslims and the infidels, including the Jews. Allah says: Those who are in a state of doubt between that (faith or disbelief), do not belong to this group (believers) and not (also) to that group (disbelievers). Whoever is allowed to go astray by Allah, then you will not find a way (to guide) for him. (an-Nisa'\/4: 143) It was explained that the hypocrites did not hesitate to swear by the name of Allah to convince those who believe and declare that they truly believe in Allah and His Messenger. Likewise, when they met Jews, they also swore that they were loyal friends and promised to help each other in dealing with Muslims. The hypocrites know very well that their actions are not good and forbidden"
		   },
		   {
			"id": 5119,
			"surah": 58,
			"ayat": 15,
			"tafsir": "In this verse it is explained that because of that hypocrisy, Allah prepared for them a very severe punishment. From this verse it can be understood that hypocrisy includes bad deeds, endangers society, and is a grave sin. The hypocrites deceived and revealed the secrets of the Muslims to their enemies, namely the Jews and the polytheists of Mecca. This action can result in the destruction of the religion of Islam and the Muslims. Allah provides for them in the hereafter the punishment of hell as a punishment for their actions in this world."
		   },
		   {
			"id": 5120,
			"surah": 58,
			"ayat": 16,
			"tafsir": "This verse explains the purpose of their hypocrisy. By telling a lie that was confirmed by an oath, many Muslims believed them. Because he was suspected of being a true believer, thus avoiding reprisals or expulsion by the Muslims. By that action, they benefited from the Muslims, who believed their words, thus defending them. In this way, they can prevent other people from embracing Islam by vilifying Islam and Muslims. In fact, they can create fear and reluctance in the hearts of Muslims to join the war with the Prophet. In one of His words, Allah explains the attitude of the hypocrites: Those who were left behind (did not join the war), were happy to sit quietly after the death of the Messenger of Allah. They do not like to wage jihad with their wealth and souls in the way of Allah and they say, \"Do not go to war in this scorching heat.\" Say (Muhammad), \"The Fire of Hell is hotter,\" if they knew. (at-Taubah\/9: 81) Because of the great sin they have committed, it is only fitting that hypocrites receive humiliating punishment in this world and in the hereafter, as a reward for their actions."
		   },
		   {
			"id": 5121,
			"surah": 58,
			"ayat": 17,
			"tafsir": "In this verse it is emphasized that the wealth and children of the hypocrites cannot help save them and prevent them from the punishment of Allah. This verse illustrates that the character and nature of the hypocrites is to feel proud of having children and lots of wealth, as if what they have can defend them and deliver them from the calamity that threatens them. Allah said: And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba'\/34: 35) Because they have received great favors in this world, the hypocrites feel that they are people who are loved by Allah and will not be punished in the hereafter. According to them, the picture of the afterlife for a person is his worldly life. If someone is happy in the life of this world, of course they will be happy in the life hereafter. Conversely, if they are miserable in the life of this world, they will also be miserable in the life hereafter. Their suspicions were wrong, because the main purpose of life is to seek the pleasure of Allah. As long as a person seeks Allah's pleasure in his life, as long as he is protected by Him, whether he seems to live well or not. At the end of this verse it is emphasized that those who claim that their wealth and children can be used to avoid Allah's punishment will become residents of hell in the hereafter. They will live in it with suffering."
		   },
		   {
			"id": 5122,
			"surah": 58,
			"ayat": 18,
			"tafsir": "People who claim that their wealth and children can be used to avoid Allah's punishment in the hereafter, they also lie before Allah on the day of reckoning. They swear that they are really among the believers, as they had sworn while they were living in the world, as if they could trick Allah with that claim. They think that by lying like that, they will be able to avoid the punishment that will befall them. This verse implies that the character and characteristics of a human while living in the world will be shown by Allah in the hereafter. If their character, nature and character are good while living in this world, then it will look good in the hereafter. Conversely, if their character, character and character are bad while living in this world, it will look bad in the hereafter. In this world they can still deceive human eyes, whereas in the hereafter, they are directly confronted by Allah, who is all-knowing and all-powerful. In other verses, Allah explains the attitude of the hypocrites in the hereafter, namely: And when it is said to them, \"Do not do mischief on earth!\" They replied, \"Surely we are the ones who are doing the repairs.\" Remember, they are actually the ones doing the damage, but they don't realize it. (al-Baqarah\/2: 11-12)"
		   },
		   {
			"id": 5123,
			"surah": 58,
			"ayat": 19,
			"tafsir": "Allah explained that the reasons why the hypocrites above were included in the hellfire were because their hearts and minds had been influenced by the whispers of Satan, so that they could no longer remember Allah, follow orders and stay away from His prohibitions. What is good according to their minds is what according to their lusts and desires is good. Therefore, they vow to win the sympathy of others, as if what they say is the truth. Allah's Word: And thus for every prophet We made enemies consisting of human and jinn devils, some of them whispered to others beautiful words as deception. And if your Lord had willed, they would not have done it, so leave them with what (lies) they fabricated. (al-An'am\/6: 112) At the end of this verse it is emphasized that the hypocrites described above are satanic soldiers and messengers. They gathered and held secret negotiations to carry out sinful acts and create enmity among the Muslims. Their purpose in doing so is to indulge their passions. Satan's soldiers and messengers are people who are disobedient to God. Those who disobey Allah will surely perish and be destroyed, and in the hereafter will be put into hell."
		   },
		   {
			"id": 5124,
			"surah": 58,
			"ayat": 20,
			"tafsir": "This verse describes those who oppose Allah, they do not heed His commandments, do not obey His prohibitions, and are reluctant to carry out the obligations that Allah has ordained for them. They are among the despised people because the Muslims will defeat them by fighting and capturing them. Some of them were even expelled from their country. This verse reminds Muslims of Allah's punishment that befell the polytheists of Mecca in the form of defeat at the Meccan fath. As a result of the Ahzab War, the Jews were expelled from the city of Medina for violating the peace agreement with the Prophet Muhammad. People who have been declared by Allah as despicable people, cannot be glorified by anyone, as stated in His words: O our Lord, verily those whom You put into hell, then indeed, You have humiliated them, and no one a helper for the wrongdoers. (Â'li 'Imran\/3: 192) This 20th verse is good news for believers who are receiving very severe trials that they will be able to defeat their enemies and the religion of Islam will flourish where -where in the near future."
		   },
		   {
			"id": 5125,
			"surah": 58,
			"ayat": 21,
			"tafsir": "Allah reminds people of His sunnah which has been established in Lawh Mahfudh and applies at all times and in all places. His Sunnah is regarding the decree of Allah and His messenger which will definitely defeat everyone who disobeys Him. Among them Allah has destroyed Noah's people, Lut's people, Saleh's people, Pharaoh and his followers in various ways. Such a victory will also be obtained by the Prophet Muhammad and his followers, and also everyone who truly practices Islam as well as possible. This is the sunatullah that applies to His servants. Allah said: And indeed, Our promise has been fixed for Our slaves who are messengers, (namely) they will surely receive help. And verily it is Our army that will surely win. (as-saffat\/37: 171-173) At the end of this verse it is emphasized again that Allah has absolute power, the power to help His messengers and those who believe, and defeat the disbelievers. No one in the heavens or on earth can go against His will. He is very easy to carry out His will. Allah said: Surely it is His business when He wills something He only says to it, \"Be it!\" Then be that something. (Yasin\/36: 82)"
		   },
		   {
			"id": 5126,
			"surah": 58,
			"ayat": 22,
			"tafsir": "Narrated by Ibn Abi Hatim, Ath-Thabrani, Abu Nu'aim, and al-Baihaqi from Ibn 'Abbas that he said, \"This verse was revealed to be related to Abu Ubaidah bin 'Abdillah al-Jarrah, who in the Battle of Badr, was always challenged fought by his father, 'Abdullah al-Jarrah. However, he always tried to avoid that duel. Because he was constantly sought after and hunted by his father, he was forced to serve him, so Abu Ubaidah killed his father. So this verse was revealed. this explains that in fact the hypocrites are truly disbelievers, even more dangerous than people who openly declare their disbelief. The hypocrites referred to in this verse are people who always try and devise in achieving their goal of destroying religion of Islam and Muslims. Infidels who are not hostile to Muslims or people who do not try to destroy the religion of Islam and Muslims are not included in the verse This. Muslims are prohibited from making friends with infidels who are enemies of Islam because doing so means participating in trying to destroy Islam and the Muslims. As for the disbelievers who are not hostile to Muslims and do not try to destroy the religion of Islam, Muslims are allowed to make friends and associate with them, just as the Prophet himself and his companions did. In accordance with the word of Allah: Allah does not forbid you to do good and to be fair to those who do not fight you in matters of religion and do not expel you from your hometown. Verily, Allah loves those who act justly. (al-Mumtahanah\/60: 8) Then it was emphasized, if there were Muslims who were close friends with infidels who were enemies of Islam then that would be an unnatural attitude. Because, it is impossible for believers who truly believe in Allah to be friends with infidels who want to destroy Islam. Thus, Muslims are asked to always be vigilant whenever there is hostility and fighting with unbelievers. Never be close friends with them, because it will endanger the Muslims. Allah explains that people who have explained the strength of their faith and the sincerity of their hearts, such as Abu Ubaidah, are people who have faith in their hearts. So that they can't bear to hear that Allah and His Messenger are insulted by people, or the religion of Islam is humiliated. In addition to having strong faith, Allah has also strengthened their hearts and souls so as to create peace of mind and determination in upholding Allah's religion. Therefore, they cannot cooperate with people who are hostile to Islam and Muslims. At the end of this verse, it is explained that the rewards they will receive from Allah are: 1. In the hereafter they will be placed in a paradise full of pleasures, and beneath which rivers flow. They live in it. 2. Allah is pleased and loves the deeds they have done while living in this world and their condition in the hereafter. They are also pleased and happy with the reward that Allah bestows upon them sooner or later. 3. They are among those who are glorified by God because they are willing to become God's soldiers and sacrifice everything they have to exalt His sentence. 4. They are among the lucky ones, because they have succeeded in carrying out their life duties as servants of Allah in this world and in the hereafter."
		   }
	]
}
