{
	"tafseer": [
		{
			"id": 6024,
			"surah": 90,
			"ayat": 1,
			"tafsir": "This verse literally translates, \"I do not swear by this land.\" The word \"no\" (lA) in this verse has the function of strengthening, because it means, \"I really swear by this country.\" Or the verse reads, \"No! I swear by this country,\" which also means emphasizing. Allah swears by the city of Mecca, the place where there is the Kaaba which is intended by humans from all over since it was founded by the Prophet Abraham until now to carry out the pilgrimage. Besides that, this city has also been a center of commerce since a long time ago. Because it is visited every year from all over it, the city is also called Ummul-Qura (Mother of Countries). The city was prosperous even though the surroundings were desert."
		   },
		   {
			"id": 6025,
			"surah": 90,
			"ayat": 2,
			"tafsir": "The word hill in the verse means \"placed\". The point is that this city is also the birthplace of Prophet Muhammad who is the greatest and last prophet who brought Islam. Thus, Allah swears by the great city of Mecca because it is the birthplace of the great man, namely Muhammad saw. There are also those who interpret the hill in the verse as \"halal\", that is, it is lawful for the Prophet to fight in that city if he is fought, what is not lawful for other people."
		   },
		   {
			"id": 6026,
			"surah": 90,
			"ayat": 3,
			"tafsir": "Allah swears by a father, namely Ibrahim, and his son, namely Ismail, who later brought down the Prophet Muhammad. Thus, Allah swears by the ancestors of the Prophet Muhammad after previously Allah swore by him and the city where he was born, which shows the affinity of the two prophets. There are also those who interpret \"father\" with Adam who is the father of mankind and anyone who is born after that."
		   },
		   {
			"id": 6027,
			"surah": 90,
			"ayat": 4,
			"tafsir": "After taking the oath, Allah conveyed an important message that He wanted to present, which is why He needed to take an oath first. The message is that humans are born in trouble. That is, humans can no longer live effortlessly as their ancestors, Adam and Eve, experienced in heaven, because everything is available. But they must live by first struggling: trying, seeking sustenance, overcoming various obstacles, and so on. Based on that struggle, Allah judges the human being. The greater the struggle that humans carry out and the greater the benefits that the results of their struggle provide for mankind, the higher the value of humans in the sight of God. Likewise the Prophet Muhammad in this city, he needed to fight for the truth to become real and falsehood to disappear. So are all humans. Therefore, dead humans should leave merit."
		   },
		   {
			"id": 6028,
			"surah": 90,
			"ayat": 5,
			"tafsir": "In this verse, Allah asks whether humans who are always in trouble, and to be able to live must be able to overcome these difficulties, can be proud of themselves after succeeding in that struggle. Arrogance is for example thinking that he is so powerful that he thinks that no one will be able to compete and defeat him, including God himself. He should not have that view because if there is someone who is great, there will surely be someone who is greater than him. Above all that is great, Allah is the greatest of all that is great, as He says: And above every person who knows there is one who knows better. (Yusuf\/12: 76)"
		   },
		   {
			"id": 6029,
			"surah": 90,
			"ayat": 6,
			"tafsir": "His arrogance, for example, regarding his expenses to help others. The expenditure in his view was so great, that he considered it a waste. He felt that the expenditure was so much that no one would be able to match it, therefore he became arrogant."
		   },
		   {
			"id": 6030,
			"surah": 90,
			"ayat": 7,
			"tafsir": "Allah asked about the person who was arrogant with his expenses, \"Did he think that no one saw what he was doing?\" That is, if he is arrogant with his expenses, it means that he has sacrificed his wealth just to make a name for himself, then that sacrifice will not be accepted by Him. Don't let him think that God doesn't see what he's done and doesn't know the motive behind that good deed, which is unknown to humans."
		   },
		   {
			"id": 6031,
			"surah": 90,
			"ayat": 8,
			"tafsir": "Allah then asked about that person, \"Did We not give him two eyes?\" That is, to be able to seek wealth, he needs two eyes, then who gave him those two eyes if not Allah? To earn a living he needs to speak, so who has given him a tongue and two lips to be able to speak? In raising him, he has suckled on both of his mother's milk, who has provided his mother's milk if not Allah? Thus, his success is due to Allah's help and mercy. Hence, there was no need for him to boast about his wealth. Besides that, eyes, tongue, and lust are God's unparalleled blessings on him. He will meet the two ways that God has provided, namely the right way and the wrong way. He needs to use those eyes, tongue, and lust for the path that is pleased by Allah."
		   },
		   {
			"id": 6032,
			"surah": 90,
			"ayat": 9,
			"tafsir": "Allah then asked about that person, \"Did We not give him two eyes?\" That is, to be able to seek wealth, he needs two eyes, then who gave him those two eyes if not Allah? To earn a living he needs to speak, so who has given him a tongue and two lips to be able to speak? In raising him, he has suckled on both of his mother's milk, who has provided his mother's milk if not Allah? Thus, his success is due to Allah's help and mercy. Hence, there was no need for him to boast about his wealth. Besides that, eyes, tongue, and lust are God's unparalleled blessings on him. He will meet the two ways that God has provided, namely the right way and the wrong way. He needs to use those eyes, tongue, and lust for the path that is pleased by Allah."
		   },
		   {
			"id": 6033,
			"surah": 90,
			"ayat": 10,
			"tafsir": "Allah then asked about that person, \"Did We not give him two eyes?\" That is, to be able to seek wealth, he needs two eyes, then who gave him those two eyes if not Allah? To earn a living he needs to speak, so who has given him a tongue and two lips to be able to speak? In raising him, he has suckled on both of his mother's milk, who has provided his mother's milk if not Allah? Thus, his success is due to Allah's help and mercy. Hence, there was no need for him to boast about his wealth. Besides that, eyes, tongue, and lust are God's unparalleled blessings on him. He will meet the two ways that God has provided, namely the right way and the wrong way. He needs to use those eyes, tongue, and lust for the path that is pleased by Allah."
		   },
		   {
			"id": 6034,
			"surah": 90,
			"ayat": 11,
			"tafsir": "In this verse, Allah asks, \"Shouldn't he tidy up the steep ascent?\" That is, humans should work hard and struggle as much as possible to overcome all obstacles in order to successfully complete great works and leave great merits."
		   },
		   {
			"id": 6035,
			"surah": 90,
			"ayat": 12,
			"tafsir": "Allah asks people to motivate them, \"What is the steep climb?\" That is, big jobs that are difficult to do but must be overcome."
		   },
		   {
			"id": 6036,
			"surah": 90,
			"ayat": 13,
			"tafsir": "God confirmed that the great work that is difficult to do is to free slaves. This was because slavery at that time had deeply penetrated into everyday people's lives, both in the Arab world and beyond. All human activities, such as trade, agriculture, military, even daily life, and so on, would not have been able to run well at that time without slaves doing the hard work. But Allah asked Muslims to abolish slavery. The implementation is not all at once, but gradually. A master should be able to free his slaves, this is what they feel very hard. The liberation of slaves was also carried out in other ways, for example by sanctioning violations whose punishment was freeing slaves. Also by giving the slave a chance to redeem himself."
		   },
		   {
			"id": 6037,
			"surah": 90,
			"ayat": 14,
			"tafsir": "Other big and hard jobs that are hard to do are feeding people during the famine season, the economy is in a mess, and so on. That's because those who give also need it. However, Allah is testing the Muslims, whether they are willing and able to do it."
		   },
		   {
			"id": 6038,
			"surah": 90,
			"ayat": 15,
			"tafsir": "Feeding the hungry in times of famine is primarily aimed at orphans who are related to the giver. Who else would want to take care of them if not their own family because their parents were gone? Attention to the family must indeed come first as the following words of the Prophet Muhammad saw: Alms to the poor is alms (one charity), alms to people who have family relations there are two charities, alms and silaturrahim. (History of Ahmad, at-Tirmidhi, and an-Nasa'i). Furthermore, what needs to get the main attention is the poor people who are thrown to the ground, namely people who are so poor that they have no place to take shelter. They are for example the homeless, homeless people, street children, and so on."
		   },
		   {
			"id": 6039,
			"surah": 90,
			"ayat": 16,
			"tafsir": "Feeding the hungry in times of famine is primarily aimed at orphans who are related to the giver. Who else would want to take care of them if not their own family because their parents were gone? Attention to the family must indeed come first as the following words of the Prophet Muhammad saw: Alms to the poor is alms (one charity), alms to people who have family relations there are two charities, alms and silaturrahim. (History of Ahmad, at-Tirmidhi, and an-Nasa'i). Furthermore, what needs to get the main attention is the poor people who are thrown to the ground, namely people who are so poor that they have no place to take shelter. They are for example the homeless, homeless people, street children, and so on."
		   },
		   {
			"id": 6040,
			"surah": 90,
			"ayat": 17,
			"tafsir": "Another hard job is having faith and advising one another to be patient and compassionate among fellow Muslims. Patience is the ability to hold back, be steadfast in the face of difficulties, and work hard to overcome these difficulties. Muslims must be able to prove their faith by carrying out this patient attitude, and encourage other Muslims to carry it out. Also what is hard to do is to love others like loving yourself or your own family. However, Muslims must be able to prove their faith by practicing mutual love, as the Prophet also commanded: People who are merciful are loved by the Most Merciful. Love those who are on earth, then those in the sky will love you. (History of at-Tirmidhi, Abu Dawud, and Ahmad from Abdullah bin 'Amr)."
		   },
		   {
			"id": 6041,
			"surah": 90,
			"ayat": 18,
			"tafsir": "The Muslims who succeeded in carrying out the difficult jobs above were classified as the \"rightist group\". The reward for the \"right group\" is heaven full of favors, as stated in surahh al-Waqi'ah\/56: 27-40."
		   },
		   {
			"id": 6042,
			"surah": 90,
			"ayat": 19,
			"tafsir": "Those who disbelieve do not want to carry out those great and difficult works. They are called ashabul-masy'amah, namely the leftist group. Their place is a sealed hell, so hell is so incredibly hot. They will certainly suffer greatly in it. Thus, he finds the incomparable hardships of life in the afterlife, incomparable to the difficulties of doing good deeds while in this world."
		   },
		   {
			"id": 6043,
			"surah": 90,
			"ayat": 20,
			"tafsir": "Those who disbelieve do not want to carry out those great and difficult works. They are called ashabul-masy'amah, namely the leftist group. Their place is a sealed hell, so hell is so incredibly hot. They will certainly suffer greatly in it. Thus, he finds the incomparable hardships of life in the afterlife, incomparable to the difficulties of doing good deeds while in this world."
		   }
	]
}
