{
	"tafseer": [
		{
			"id": 5178,
			"surah": 62,
			"ayat": 1,
			"tafsir": "In this verse, Allah explains that everything in the heavens and on earth, whether animate or not, hard or liquid objects, trees, and so on, glorifies Allah, purifies Him from things that are not natural, such as the qualities of deficiency and so on. Every time we look and look at what is on earth and in the sky, all of that shows us the oneness of the creator, namely Allah and the greatness of His power. This is in line with the word of Allah: And there is nothing but glorify Him with praise. (al-Isra'\/17: 44) This first verse closes with the assertion that Allah reigns over all that is in the earth and in the sky, glorifies Him by His will based on His power and wisdom, is holy from all that unworthy and not according to His height and perfection. Almighty God, subdues all His creatures with His power. All-wise in managing their affairs. He is the one who knows their benefit better, which will bring them happiness in this world and in the hereafter."
		   },
		   {
			"id": 5179,
			"surah": 62,
			"ayat": 2,
			"tafsir": "Allah explained that it was He who sent to the Arabs who were still illiterate, who at that time did not know how to read and write, an apostle from among themselves, namely the Prophet Muhammad with the following tasks: 1. Read the verses of the holy Qur'an in which there are instructions and guidance to obtain the goodness of the world and the hereafter. 2. Cleanse them of misleading beliefs, polytheism, barbaric ignorance so that they believe in monotheism to unite Allah, do not submit to misleading leaders and no longer believe in their idols such as stones, idols, trees, wood, and so on . 3. Teach them the al-Kitab which contains religious law along with the laws and wisdoms contained therein. Special mention of illiterate Arabs does not mean that the Prophet Muhammad's apostolate was directed only to Arabs. However, the apostleship of the Prophet Muhammad is intended for all creatures, especially jinns and humans, as Allah says: And We did not send you (Muhammad) but to (become) a mercy to the whole world. (al-Anbiya'\/21: 107) And His words: Say (Muhammad), \"O people! Truly I am Allah's Messenger to all of you,\" (al-A'raf\/7: 158) The second verse of surahh al- This Jumu'ah ends with the statement that the Arabs were actually in a real error. They generally adhere to and adhere to the divine religion, namely the religion of the Prophet Abraham. They then changed and exchanged the belief in monotheism with shirk, their belief with doubt, and worshiped other than Allah."
		   },
		   {
			"id": 5180,
			"surah": 62,
			"ayat": 3,
			"tafsir": "Allah explained that Muhammad's apostleship was not limited to the Arab nation that existed at that time, but also to those who had not joined them until the Day of Judgment, i.e. those who came after the companions of the Prophet, until the Day of Judgment, such as the Persian, Roman and others. In a hadith narrated by al-Bukhari from Abu Hurairah, he said: Abu Hurairah narrated that when we sat with the Prophet, then surahh al-Jumu'ah was revealed to him \"wa akharina minhum lamma yalhaqu bihim.\" Abu Hurairah asked, \"Who are they, O Messenger of Allah? But the Prophet did not answer until he asked three times. Abu Hurairah said, \"At that time Salman al-Farisi was with us. Then the Prophet put his hand on Salman's shoulder, saying, 'If faith were in the stars, then surely those of them (the Persians) would have attained it.\" (Al-Bukhari) Allah is Mighty, the power increases people's intelligence the ignorant, and strengthens the weak by sending an apostle from among them too, to save them from going astray, and to guide them to the truth, from darkness to bright light. to goodness and profit."
		   },
		   {
			"id": 5181,
			"surah": 62,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that the messenger was sent to humans, to cleanse them from polytheism and barbarity. This is God's greatest favor and gift given to whom He wills, from His servants whom He has chosen, because of the cleanliness of their hearts and willingness to accept it."
		   },
		   {
			"id": 5182,
			"surah": 62,
			"ayat": 5,
			"tafsir": "In this verse God expresses His wrath against the Jews who have been sent down to them the Torah to practice, but they do not carry out its contents. They are no different from a donkey that carries a large number of books, but does not know what it is carrying. In fact, they are even more stupid than donkeys, because donkeys don't have the mind to understand it, while they have reason, but don't use it. On the other hand, when using reason, they use it to distort the Torah by subtracting, adding to, changing, or interpreting it to the meaning they want. Their situation is described in this verse, as follows: They are like livestock, even more astray. They are the ones who are heedless. (al-A'raf\/7: 179) How bad is the parable given to them. That is none other than because they belied the verses of Allah brought by their apostles. Allah will not give guidance to those who are unjust to themselves, who are wallowing in sin so that their eyes cannot see the light of truth. His heart is languishing unable to feel the right things, even he is in darkness which causes him to not be able to see the way to the target."
		   },
		   {
			"id": 5183,
			"surah": 62,
			"ayat": 6,
			"tafsir": "In this verse, Allah gives a warning to the Jews that if they really accuse and deny that they are Allah's beloved and beloved, then please ask Allah so that they will die quickly and soon meet their Lord. Usually people who want to quickly meet their lover and beloved, want to quickly be free from the troubles and troubles of the world and occupy heaven which is full of all kinds of pleasures. Allah's Word: Say (Muhammad), \"If the land of the Hereafter is with Allah, exclusively for you and not for others, then ask for death if you are righteous.\" (al-Baqarah\/2: 94)"
		   },
		   {
			"id": 5184,
			"surah": 62,
			"ayat": 7,
			"tafsir": "God confirmed that adherents of the Jewish religion would not ask for a quick death, because they realized and knew their mistakes and sinful circumstances. If they really want to die quickly, then it will be carried out according to God's will and nature, and God's torment will be very painful for them. And indeed, you (Muhammad) will find them (Jews), people who are most greedy for life (world), even (more greedy) than polytheists. Each of them wants to be given a thousand years of life, even though that long life will not keep them from doom. And Allah is Seeing of what they do. (al-Baqarah\/2: 96)"
		   },
		   {
			"id": 5185,
			"surah": 62,
			"ayat": 8,
			"tafsir": "In this verse Allah explains that the Jews were very afraid of death and tried to avoid it. Therefore, Allah ordered the Messenger of Allah to convey to them that death would surely come to meet them. Then they are returned to Allah, Who is All-Knowing of the unseen and the visible, both in the heavens and on earth. So Allah told them everything that they had done, then rewarded according to their deeds. Evil is rewarded with evil, namely hell, good is rewarded with good, namely heaven, as God says: They are not rewarded except according to what they have done. (Saba'\/34: 33) And He said: And to Allah belongs whatever is in the heavens and whatever is on the earth. (Thus) He will reward those who do evil according to what they have done and He will reward those who do good with a better reward (heaven). (an-Najm\/53: 31)"
		   },
		   {
			"id": 5186,
			"surah": 62,
			"ayat": 9,
			"tafsir": "Allah explained that when the muezzin calls the call to prayer on Friday, then we should leave commerce and all worldly endeavors and hurry to the mosque to listen to the sermon and perform the Friday prayers, in a natural way, not running around, but walking calmly to the mosque. as the words of the Prophet saw: When the prayer has been recited, then do not go to it in haste. But come to prayer in a normal walking state full of calm. Then, how many cycles you get, then follow it, while the cycles that are left behind, complete them. (Al-Bukhari and Muslim from Abu Hurairah) If someone knows how great the reward will be obtained by someone who performs Friday prayers well, then carrying out the order (fulfilling the call to prayer and leaving trading) is better than staying in place carry out trading and continue the business to gain world profits. God's Word: Whereas the hereafter is better and more lasting. (al-A'la\/87: 17)"
		   },
		   {
			"id": 5187,
			"surah": 62,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that after completing the Friday prayers, Muslims may spread across the face of the earth to carry out worldly affairs, and try to seek halal sustenance, after fulfilling what is beneficial for the hereafter. Let's remember Allah as much as possible in carrying out his business by avoiding cheating, fraud, and others. Allah is All-Knowing of everything that is hidden, let alone that which appears evident, as Allah says: The Knower of the unseen and the real. The Almighty, the Most Wise. (at-Tagabun\/64: 18) Thus, happiness and luck will be achieved in this world and in the hereafter. It is recommended to those who have finished the Friday prayer to read the prayer that is usually done by Arrak bin Malik \"O Allah! Verily I have fulfilled Your call, and carried out my obligations to You, and scattered (on earth) as You commanded me, so bestow to me Your bounty. You are the best provider of sustenance.\" (History of Ibn Abi Hatim)"
		   },
		   {
			"id": 5188,
			"surah": 62,
			"ayat": 11,
			"tafsir": "It was narrated by al-Bukhari, Muslim, Ahmad, and at-Tirmidhi from Jabir bin 'Abdullah that when the Prophet stood up to preach on Friday, suddenly a group of camels (merchandise carriers) came, so the companions of the Prophet rushed to him so that no one just listen to the sermon except for 12 people. I (Jabir), Abu Bakr, and Umar were among those who remained, so Allah Ta'ala sent down the verse: wa idha ra'au tijaratan au lahwan, until the end of the surah). In this verse Allah denounces the actions of the believers who are more concerned with the newly arrived trade caravan than the Prophet, so that they leave the Prophet standing in a state of preaching. This verse has something to do with the arrival of Dihyah al-Kalbi from Syria (Syria), along with a group of camels carrying merchandise such as flour, wheat, oil and others. According to custom, when a caravan of trading camels arrives, young women come out to greet them by beating drums, as a notification of the arrival of the caravan, so that people come shopping to buy the merchandise they have brought. Furthermore, Allah ordered His Prophet to convey the mistakes of their actions by emphasizing that what is with Allah is far better than the benefits and pleasures of this world. Happiness hereafter is eternal, while the benefits of this world will disappear. This verse closes with an affirmation that Allah is the best provider of sustenance. Therefore, it is to Him that we must direct all efforts and endeavors to obtain lawful sustenance, following His instructions and His approval."
		   }
	]
}
