{
	"tafseer": [
		{
			"id": 6189,
			"surah": 105,
			"ayat": 1,
			"tafsir": "In this surah, Allah reminds the Prophet Muhammad and his followers with an event that shows how great the power of Allah is. The event was an elephant army raid led by commander Abraha from Yemen to subdue the people of Mecca and tear down the Kaaba. However, God destroyed them before the evil purpose was accomplished. The Elephant incident is the most well-known event among the Arabs, so they make this event a benchmark for other events. The conclusion of his history is that a warlord who ruled in Yemen wanted to take control of the Kaaba and destroy it, with the intention of forbidding the Arabs from making the pilgrimage to the Kaaba. Then his army moved toward the Ka'bah accompanied by several elephants to frighten him. When the convoy of the army arrived at a place called Muqammas (a place close to Mecca), they rested there. The warlord sent his envoy to the people of Mecca to convey his intention, namely not to fight the people but to destroy the Kaaba. The people of Mecca became frightened and ran to the mountains around the Kaaba to see from afar what would happen and what the warlord would do. In this surahh Allah also explains what happened to the elephant troops in the form of a question that Muhammad did not know about the very strange circumstances and the very terrible events that prove Allah's power, knowledge and high wisdom against the elephant soldiers who wanted to destroy the Kaaba. This event is different from other events that have a cause and effect."
		   },
		   {
			"id": 6190,
			"surah": 105,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that He has thwarted their plot to destroy the Kaaba. Allah revealed a way to thwart their deceit, namely by sending an army of birds in droves to throw stones at them from the ground so that they were crushed and their flesh was flying everywhere. So the army of elephants became like leaves eaten by worms."
		   },
		   {
			"id": 6191,
			"surah": 105,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains that He has thwarted their plot to destroy the Kaaba. Allah revealed a way to thwart their deceit, namely by sending an army of birds in droves to throw stones at them from the ground so that they were crushed and their flesh was flying everywhere. So the army of elephants became like leaves eaten by worms."
		   },
		   {
			"id": 6192,
			"surah": 105,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that He has thwarted their plot to destroy the Kaaba. Allah revealed a way to thwart their deceit, namely by sending an army of birds in droves to throw stones at them from the ground so that they were crushed and their flesh was flying everywhere. So the army of elephants became like leaves eaten by worms."
		   },
		   {
			"id": 6193,
			"surah": 105,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that He has thwarted their plot to destroy the Kaaba. Allah revealed a way to thwart their deceit, namely by sending an army of birds in droves to throw stones at them from the ground so that they were crushed and their flesh was flying everywhere. So the army of elephants became like leaves eaten by worms."
		   }
	]
}
