{
	"tafseer": [
		{
			"id": 5230,
			"surah": 66,
			"ayat": 1,
			"tafsir": "In this verse, Allah rebukes the Prophet for swearing never to drink honey again, even though honey is a lawful drink. The reason is simply because he wants the pleasure of his wives. This verse closes with the assertion that Allah is Forgiving for the sins of His repentant servants, and He has forgiven the mistakes of the Prophet who had sworn that he would no longer drink honey."
		   },
		   {
			"id": 5231,
			"surah": 66,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that He has stipulated one condition, namely that it is obligatory for a person to free himself from an oath he has ever uttered by paying expiation as explained in the word of Allah: what you used to give to your family, or clothe them or free a slave. Whoever is unable to do so, then (his expiation) fast three days. That is expiation of your oaths when you swear. (al-Ma'idah\/5: 89) An oath that must be violated is if it makes lawful something that is unlawful, or conversely the oath forbids something lawful. In order to cancel the oath of not drinking honey, the Prophet had complied with Allah's provisions mentioned above, by paying expiation, namely freeing a slave, as informed in a hadith: From Ibn 'Abbas, he said, \"I asked 'Umar bin al-Khaththab who were the two women? He said, 'Aisyah and Hafsah. He started the story about Umm Ibrahim (Mariyah) al-Qibthiyyah whom the Prophet had sexual intercourse with at Hafsah's house on his (turn) day, then Hafsah found out. Hafsah then said, 'O Prophet of Allah, you have treated me in a way that you do not treat your other wives on my day, in my house, and on my bed. The Prophet said, 'Would you like it if I forbid it by not having intercourse with it anymore? He replied, 'Okay, ban him! The Prophet then said, 'Don't tell this to anyone. But Hafsah said it to 'Aisyah. Then Allah told it to Nab i saw, then lowered the verse: \"ya ayyuhan-nabiyyu lima tuharrimu¦\" and so on. We received news that the Prophet paid his oath expiation and had intercourse with Maryam al-Qibtiyyah again.\" (History of Ibn Jarir and Ibn Mundhir) The conclusion from what is contained in this verse is that what the Prophet saw made forbidden for him was something that Allah had made lawful, could in the form of slaves, drinks, or something else. Whatever the case, what is clear is that the Prophet prohibited something that Allah made lawful. Therefore, Allah rebuked and asked the Prophet to cancel his oath and pay expiation. At the end of this verse it is explained that Allah is the protector of the believer , defeat his enemies, make it easier for him to take a profitable path in this world and in the hereafter, provide guidance and guidance to achieve happiness in this world and the hereafter. the goal is human benefit."
		   },
		   {
			"id": 5232,
			"surah": 66,
			"ayat": 3,
			"tafsir": "In this verse, Allah reminds of an incident that happened to the Prophet himself, namely when he asked Hafsah (one of his wives) to keep it secret and not tell anyone that he had drunk honey at Zainab bint Jahsy's house, then vowed not to repeat this. it again. After Hafsah told this to 'Aisha, Allah then told the Prophet the conversation between the two of them. The Holy Prophet then informed Hafsah of his deed of disclosing her secret. At that time Hafsah became surprised and asked, \"Who has told you this?\" He thought that it was 'Aisha who told him, the Prophet replied that it was Allah who told him, God who is All-Knowing of all secrets and whispers, All-Knowing of what is on earth and what is in the sky, nothing is hidden from Him. God's Word: For God there is nothing hidden in the earth and in the sky. (Ali 'Imran\/3: 5)"
		   },
		   {
			"id": 5233,
			"surah": 66,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that if Hafsah and 'Aisyah want to repent, and say that they have violated the will of the Prophet, both of them love what he loves, and hate what he hates, it means that both of them have tended to receive goodness. In another narration, Ibn 'Abbas said, \"I always wanted to ask Umar about the two wives of the Prophet who meant the word of Allah, \"If you both repent to Allah¦,\" until 'Umar performed the pilgrimage and I also performed the pilgrimage with him. When 'Umar stopped on his way to perform ablution, I splashed his hands and asked, 'O Commander of the Faithful! Who are the two wives of the Prophet that the word of Allah addressed, \"If you both repent to Allah ¦.\"' Umar then replied, 'O Ibn 'Abbas! The two wives of the Prophet in question are 'Aisyah and Hafsah. If the two ('Aisyah and Hafsah) still agreed to do what hurt the Prophet's heart by broadcasting his secrets, that would not cause trouble for the Prophet, because Allah is his protector, and helped him with his religious affairs and all the things he faced. Likewise Gabriel, the pious believers, and the angels, all helped and assisted him."
		   },
		   {
			"id": 5234,
			"surah": 66,
			"ayat": 5,
			"tafsir": "Anas narrated from 'Umar that he said, \"It has come to me that some of the Prophet's wives were hard on the Prophet and hurt him. So I investigated this. I advised her one by one and forbade her to hurt the Prophet's heart, I said, \"If you still don't want to obey, maybe Allah will give the Prophet new wives who are better than you. And after I met Zainab, she said, 'O Ibn Khaththab! Wasn't the Prophet trying to advise his wives? So advise them until they are not divorced, then this verse was revealed.\" This verse contains a warning from Allah to wives who hurt the Prophet's heart. If the Prophet divorced them, Allah may replace them with new wives who are better than them, both in Islam and in their faith, namely wives who are diligent in worship, repent to Allah, obey the orders of the Apostle."
		   },
		   {
			"id": 5235,
			"surah": 66,
			"ayat": 6,
			"tafsir": "In this verse, Allah orders believers to protect themselves from the fires of hell whose fuel consists of humans and stones, by obeying and dutifully carrying out Allah's commands. They are also ordered to teach their families to obey and obey Allah's commands to save them from the fires of hell. The family is a mandate that must be maintained for its welfare both physically and spiritually. Among the ways to save yourself from the fires of hell is to establish prayer and be patient, as Allah says: And order your family to pray and be patient in doing it. (thaha\/20: 132) And warn your closest relatives (Muhammad). (asy-Syu'ara'\/26: 214) It is narrated that when this 6th verse was revealed, 'Umar said, \"O Messenger of Allah, we have taken care of ourselves, and how to take care of our family?\" Rasulullah SAW replied, \"Prohibit them from doing what you are prohibited from doing and order them to do what Allah has commanded you. That's how to save them from the fire of hell. Hell is guarded by angels who are rough and hard whose leaders are nineteen angels. They are given authority torture in hell. They are the angels who do not disobey Allah in what He commands and always do what He commands."
		   },
		   {
			"id": 5236,
			"surah": 66,
			"ayat": 7,
			"tafsir": "In this verse, Allah issues a firmness addressed to disbelievers that in the future, it will no longer be useful for them to make excuses and wish for one wish and hope. The time and opportunity to present reasons and hopes is past. The Day of Judgment is only a day to account for and receive retribution for what has been done in the world, as Allah says: Thus We punished them for their iniquity. And verily, We are Truthful. (al-An'am\/6: 146) Also explained in another verse: Thus We rewarded them for their disbelief. And We do not impose punishment (such as that), but only on those who completely disbelieve. (Saba'\/34: 17)"
		   },
		   {
			"id": 5237,
			"surah": 66,
			"ayat": 8,
			"tafsir": "The appeal in this verse is addressed to those who believe in Allah and His messengers. They are ordered to repent to Allah from their sins with true repentance (tobat nasuha), namely repentance that fulfills three conditions. First, stop from the immorality that he did. Second, regretting his actions, and third, being determined not to repeat the immoral act. When these conditions are met, Allah erases all past mistakes and crimes and admits them into paradise beneath which rivers flow. At that time, Allah did not disappoint and humiliate the Holy Prophet and those who believed with him. Even on that day, their happiness was emphasized, their light shone on them as they walked to Mahsyar where the accounts and accounts were held. They ask Allah for their light to be perfected, continue to shine and will not be extinguished until they pass through the Sirathal Mustaqim, where the hypocrites, both men and women, beg desperately to be waited on to be able to take advantage of their light. They also ask that their sins be erased and forgiven. Thus, they do not feel ashamed and disappointed when reckoning and accountability are held. There is nothing to ask for to perfect the light and forgive sins except Allah, because He is the Almighty over all things, acts according to His nature and iradat."
		   },
		   {
			"id": 5238,
			"surah": 66,
			"ayat": 9,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to take up arms and fight the disbelievers seriously and to threaten and act decisively and harshly against the hypocrites. The Prophet was also ordered to explain that they will experience disappointment in the hereafter because of their hypocrisy. Because of that, the Prophet once expelled some hypocrites and told them to get out of the mosque. They will be put into hell Hell which is the worst place to live, as explained by Allah in His word: Indeed, Hell is the worst place to live and a place to live. (al-Furqan\/25: 66) In another verse it is also explained: So those people's place is in Hell Hell, and (Jahanam) is the worst place to return to. (an-Nisa'\/4: 97)"
		   },
		   {
			"id": 5239,
			"surah": 66,
			"ayat": 10,
			"tafsir": "In this verse, Allah makes a parable that explains the situation of disbelievers who no longer benefit him from the lessons and advice of honest believers, including the prophets and apostles because of the hardness of their hearts. There is no willingness for them to believe and their nature has deviated from the truth, like the wives of Prophet Noah and the wives of Prophet Lut. Both are under the care and supervision of two prophets, who should be able to provide guidance so as to obtain happiness in the world and the hereafter. However, both of them did not want to, they even committed betrayal and disbelief. Prophet Noah's wife accused her husband of being crazy, while Prophet Lut's wife led her husband's people to act unnaturally and impolitely towards her husband's guests, namely the angels. The closeness of the two wives to their husbands, namely Prophet Noah and Prophet Lut, two pious servants of Allah, could not stem and prevent them from committing treason and kufr. Therefore, the two wives deserve Allah's punishment and will be put into hell with the entourage of the inhabitants of hell, as a fitting recompense for their evil deeds, which are a great sin."
		   },
		   {
			"id": 5240,
			"surah": 66,
			"ayat": 11,
			"tafsir": "In this verse, Allah makes the opposite parable, namely the condition of those who believe. The parable is Asiyah bint Muzahim, Pharaoh's wife. In this parable, Allah explains that the relationship between believers and unbelievers will not be dangerous if they are pure and pure from dirt. Even though Asiyah bint Muzahim was under the supervision of her husband, a very dangerous enemy of Allah, she still believed. He always begged and prayed, \"O my Lord! Build for me a house by Your side in heaven and save me from Pharaoh and his deeds, and save me from the wrongdoers.\""
		   },
		   {
			"id": 5241,
			"surah": 66,
			"ayat": 12,
			"tafsir": "In this verse, Allah once again makes a parable for the believers, namely the condition of Maryam bint Imran who has maintained her honor and has been given karamah in this world and the hereafter. She was chosen by her God because she reacted to Gabriel about the filling of her womb with a saying as immortalized in the Qur'an: She (Maryam) said, \"Indeed, I seek refuge in God, the Most Merciful, for you, if you are a pious person.\" (Maryam\/19: 18) Thus, her piety becomes stable and her purity perfect, so Jibril blows into her womb some of the spirits created by Allah, who embodies a prophet, namely Isa bin Maryam bint Imran, confirming Allah's Shari'a and the books that were revealed Him to His prophet. He includes and counts people who are pious, diligent in worship, humble themselves, and obey their Lord. Ahmad narrated in his Musnad that the head of the female inhabitants of heaven will be Maryam then Fatimah followed by Khadija and Asiyah. In the authentic book, it is explained that there are many perfect men, but only four perfect women, namely Asiyah bint Muzahim (Pharaoh's wife), Maryam bint 'Imran, Khadijah bint Khuwailid, and Fatima bint Muhammad. While Siti 'Aisyah's advantage over other women is like the tsarid's advantage over other foods."
		   }
	]
}
