{
	"tafseer": [
		{
			"id": 3971,
			"surah": 38,
			"ayat": 1,
			"tafsir": "Allah begins His word with Fawatih as-Suwar \"shad.\", just as He began several surahhs which were revealed in Mecca and two surahs which were revealed in Medina. Regarding the tafsir of Fawatih as-Suwar, it has been widely stated in the tafsir of the first verse of the second surah (al-Baqarah in the Qur'an and its Tafsir Volume 1). Then Allah swears by the Qur'an which has the majesty of its contents, the glory of its dignity and the perfection of its laws which are exalting and amazing. The Al-Qur'an is characterized as \"having majesty\" so that people understand that the Al-Qur'an which was revealed to His messengers is truly from Allah, and contains the true teachings conveyed by the Messenger of Allah to all mankind."
		   },
		   {
			"id": 3972,
			"surah": 38,
			"ayat": 2,
			"tafsir": "Allah revealed the condition of the Meccan disbelievers who denied the truth of revelation, and were unable to see its truth values, which were actually very important for their welfare in this world and happiness in the hereafter, because of the pride and enmity that nestled in their souls. Their arrogance is seen in their actions towards the Apostle and his followers. They are very condescending to the Muslims because they feel stronger and have more wealth. While the Muslims consist of poor people and are few in number. The fierce enmity was caused because the teachings brought by the Apostle threatened the religion of their forefathers, and humiliated the statues that they made to be worshiped beside Allah."
		   },
		   {
			"id": 3973,
			"surah": 38,
			"ayat": 3,
			"tafsir": "Allah condemned their arrogance and enmity by explaining how many people before them, who insulted and denied Allah's messengers, were destroyed by Him. When the punishment was inflicted, they asked for help from Allah. But those requests were of no use, and they would not be able to escape the ravaging torment. Allah said: So when they saw Our punishment, they said, \"We believe in Allah alone and we disbelieve in the idols that we have associated with Allah.\" (al-Mu'min\/40: 84) And His words: So when they felt Our punishment, suddenly they fled from (their country). Do not run hastily; return to the pleasures of your life and to your (good) dwellings, so that you may be questioned. (al-Anbiya'\/21: 12-13)"
		   },
		   {
			"id": 3974,
			"surah": 38,
			"ayat": 4,
			"tafsir": "This verse describes the condition of the Meccan unbelievers who were very surprised when the prophet who came to them turned out to be an ordinary human being from among them too. According to them, Muhammad, who claimed to be appointed as an apostle, had no special privileges, both physical and spiritual, even though the position of the apostle was high. Thus, it is impossible for Muhammad to occupy a high position. That is why they say that Muhammad was just a sorcerer. He's a cheat and a liar. What is conveyed either in the form of orders or prohibitions said from Allah is a lie. God's Word: Is it appropriate for people to be surprised that We gave a revelation to a man among them, \"Give warning to people and make the believers happy that they have a high position in the sight of God.\" The disbelievers said, \"This man (Muhammad) is a real magician.\" (Yunus\/10: 2)"
		   },
		   {
			"id": 3975,
			"surah": 38,
			"ayat": 5,
			"tafsir": "Because the nuzul verse is as narrated by Ibn Jarir. ath-tabari from Ibn 'Abbas who stated that after Abu Talib was sick, a group of Quraysh people entered, among them was Abu Jahal. They said, \"Indeed your nephew abused our gods. He actually did and said it. It would be nice if you sent someone to ban it.\" So Abu Talib sent a messenger to him. Then the Prophet came and entered his house, while the distance between the people of Quraysh and Abu Talib was very close, only a seat was enough for one person. Ibn 'Abbas said that Abu Jahl was worried that the Prophet would sit beside Abu Talib. Then he became soft. He then jumped and sat in a place that had not been occupied by Abu Talib's side. Thus the Prophet did not get a seat near his uncle. He sat by the door. Then Abu Talib said to him, \"O my nephew, why do your people complain about you. They accuse you of insulting their gods and you say things like that.\" Ibn 'Abbas continued that the Quraysh talked a lot with Abu Talib. Then Rasulullah said, \"O my uncle. Actually I want them to say just one sentence, with that sentence the Arabs submit to them, and the people of 'Ajam (other than Arabs) pay jizya (head tax) to them .\" So they were happy with the sentence (which was suggested) and also happy with the words of the Apostle. Then the Quraysh asked, \"What is that sentence? By your father, of course we will reward you tenfold.\" Rasulullah also said, \"La ilaha ilallah.\" So they got up trembling, rolled up their sleeves and said, \"Why did he make the gods the One God, in fact this is really an astonishing thing.\" Then come down this verse. Allah explained the astonishment of the polytheists at the apostle's call. They wonder why Muhammad made God only one, this is contrary to the beliefs of their ancestors. When the Prophet invited them to leave their many offerings and replace them with worshiping Allah Almighty, they considered that Muhammad's call was not a trivial matter, but was truly something astonishing. They ignored the call because they believed that it was impossible for their ancestors to have held false beliefs, but that Muhammad was a self-righteous liar."
		   },
		   {
			"id": 3976,
			"surah": 38,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that the Quraysh leaders left Abu Talib's house after being silenced by the Apostle's answer, as explained in the reason for nuzul above. They know Muhammad stubbornly defended religion. That is why they have no more hope of softening Muhammad's heart through the intercession of his uncle. They deliberated on what should be done, and racked their brains for a settlement. Finally they decided to strengthen the beliefs of their followers to stick with their beliefs and continue to worship their gods. At the end of the verse, Allah reveals the words of the Quraysh leaders to their followers, that worshiping idols is what Allah really wants."
		   },
		   {
			"id": 3977,
			"surah": 38,
			"ayat": 7,
			"tafsir": "Allah explained another reason put forward by the Quraysh leaders to their followers, that Muhammad's call was not true. They say they have never heard a call like that made by Muhammad in the last revealed religion. The religion they are referring to is Christianity. Muhammad's call for people to unite with God was just a lie concocted by Muhammad saw and did not come from Allah."
		   },
		   {
			"id": 3978,
			"surah": 38,
			"ayat": 8,
			"tafsir": "Then Allah explains the denial of the disbelievers of Mecca that Muhammad was given revelations, even though he was an ordinary human being. According to their opinion, those who deserve to be appointed as envoys are people who have glory and leadership that exceeds them. Muhammad did not have such special qualities, so it is impossible for the Qur'an to be revealed to him. While among them there are people who are nobler, and more fit to hold leadership. Allah said: And they (also) said, \"Why was this Qur'an not revealed to a great man (rich and influential) from one of these two lands (Mecca and Taif)?\" (az-Zukhruf\/43: 31) They denied Muhammad's revelations and prophethood because according to their way of thinking, the people who were sent to be apostles were wealthy and influential people. They do not realize that Allah has the power to make choices according to His will, including appointing His servant to become a Prophet. Allah said: And they said, \"Why did this Apostle (Muhammad) eat food and walk in the marketplaces? Why wasn't an angel sent down to him (so that the angel) gave a warning with him, or (why didn't wealth) be sent down to him or (why there is no) garden for him, so that he can eat from (the produce) of it?\" And the wrongdoers said, \"You are only following a man who is bewitched.\" (al-Furqan\/25: 7-8) In the final part, this verse explains that the reason they are far from the truth is because their hearts are shrouded in doubts that cannot be penetrated by the light of the truth of the Qur'an, and they have not felt the torment of Allah that sore. If they were willing to pay attention to the signs of the truth of the revelation revealed to His Messenger, they would have acknowledged his prophethood, because the revelation received was sufficient to be a sign of his prophethood. However, because of the jealousy and jealousy that had lodged in their chests, they did not want to accept this revelation. Finally they fall into the valley of denial."
		   },
		   {
			"id": 3979,
			"surah": 38,
			"ayat": 9,
			"tafsir": "In this verse, Allah condemns the people of Quraysh who reject Muhammad's prophethood because he is not a respected person among them. Allah ordered His Messenger to ask whether they have the power to participate in determining and distributing the treasures of Allah's grace. At the end of the verse, Allah mentions His attributes as the Most Mighty and Most Giver. Omnipotence that cannot be matched by anyone and the all-giving nature that cannot be hindered by other powers. Allah says: And your Lord creates and chooses what He wills. For them (humans) there is no choice. (al-Qashash\/28: 68) And His words: ¦God knows better where He places His apostolic task¦. (al-An'am\/6: 124)"
		   },
		   {
			"id": 3980,
			"surah": 38,
			"ayat": 10,
			"tafsir": "Then Allah ordered His Messenger to ask the people of Quraysh for his denial and arrogant attitude. This question contains ridicule because indeed they do not have the slightest power over the heavens, the earth, and the contents of both. If they feel that they do not have the slightest power in the universe, they should also not interfere in the appointment of apostles, which are part of the occult, whose power rests with the Almighty and the Most High. At the end of the verse, Allah orders His Messenger to challenge them to climb the steps to heaven, and seeks efforts to block the revelations that were brought to Allah's chosen apostles. In fact they will not be able to do it. Thus, it is clear that their denial of revelation is only because of jealousy."
		   },
		   {
			"id": 3981,
			"surah": 38,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains that the condition of the Meccan polytheists who denied Muhammad's apostleship and denied the monotheism religion was like a large army, which was a combination of army units. The allied armies moving to destroy the Muslims will surely be defeated, because the basis of their struggle is not based on firm belief, but only because of jealousy and arrogance. The incident as described in this verse did not occur at the time the verse was revealed, because at that time the Muslims did not yet have an army, the number of their followers was still small, and there was no sign of forming a force that could defeat the combined army as described in the verse. However, this event only occurred at the time of the Battle of Badr, where the polytheists whose numbers multiplied more than the Muslims were defeated with the help of Allah. Allah's Word: Or they say, \"We are a united group that will surely win.\" That faction would definitely be defeated and they would fall backwards. Even the Day of Judgment is the day promised to them and the Day of Judgment is more terrible and more bitter. (al-Qamar\/54: 44-46) The explanation given by Allah to His Messenger contained in this verse is one of the miracles of the Prophet and at the same time a sign of the truth of the revelation he received that the revelation was really from Allah not made by Muhammad ."
		   },
		   {
			"id": 3982,
			"surah": 38,
			"ayat": 12,
			"tafsir": "In these two verses, Allah explains the six peoples who denied Allah's messengers, and the consequences they suffered, with the intention of being a lesson for the polytheists of Mecca, so that they are released from misguidance, and want to receive guidance. They are: First, Noah's people who accused Noah of giving advice and warnings that were made up. Therefore, they made fun of, even said that Noah was crazy. Even though Prophet Noah had repeatedly called on them gently to believe in monotheism, their challenges did not decrease, they even increased, finally Prophet Noah prayed to Allah. God's Word: And Noah said, \"O my Lord, do not let any of the disbelievers live on the earth. Verily, if You let them stay, they will surely lead Your servants astray, and they will only give birth to children who are evil and ungrateful. (Nuh\/71: 26-27) Noah's people still deny his call, even drowning in error. Allah destroys them through storms, typhoons, and floods as recompense for the crimes they have committed. However, Noah and his followers were saved by Allah from the torment. Allah said: Then We opened the gates of heaven by (sent down) pouring water, and We made the earth spout springs of water so that (the waters) met so that ( overflowing caused) a predetermined (disaster). who have been denied (their people). (al-Qamar\/54: 11-14) Second, the people of 'Ad denied Hud's call that invited them to worship Allah Almighty and abandon the offerings that they associated with Allah. However, the people of 'Ad opposed the call, they even made fun of Hud and called him crazy. That is why they were destroyed by a very cold and strong wind. Allah said: As for the people of 'Ad, they were destroyed by a very cold hurricane, Allah brought it down on them for seven nights and eight days continuously; then you see the people of 'Ad at that time dead lying like the trunks of date palms that have been empty (rotted). So do you see anyone left among them? (al-haqqah\/69: 6-8) Third, Pharaoh who had a large army. Besides that, he has a special torture place to torture his enemies and a tall and sturdy building. Allah has sent Musa to Pharaoh and his followers to stop his heresy and worship Allah Almighty. The truth of Moses' call was also strengthened by a miracle. However, Pharaoh and his followers persisted in rejecting Musa's call, even being arrogant and insulting him by declaring that he was the supreme god. So Allah ordered Musa to evacuate his people in order to be safe from Pharaoh's cruelty. That way, Musa and the Children of Israel were saved from the pursuit of Pharaoh while he and his army were drowned by the waves of the sea. Allah said: And We saved the Children of Israel across the sea, then Pharaoh and his army followed them, to oppress and oppress (them). So that when Pharaoh almost drowned he said, \"I believe that there is no god but the God that the Children of Israel believe in, and I am one of the Muslims (surrender).\" Why only now (you believe), when in fact you have been disobedient long ago, and you are among those who do mischief. So today We saved your body so that you can be a lesson for those who come after you, but most people do not heed Our signs (power). (Yunus\/10: 90-92) Another meaning of autad is the shackles used by Pharaoh to torture him. There are also those who say that Pharaoh had a magnificent and sturdy palace. Fourth, the Samud people who denied the call of Prophet Saleh who was sent for them. They have made a mistake that exceeds the limit. They had slaughtered the camel that was supposed to be looked after. In recompense for their disobedience, Allah sent down a loud thunderous sound, until they perished like dry grass. Allah said: Even the Samud people have denied the warning. So they said, \"How are we going to follow a human (ordinary) among us? Indeed, then we really have gone astray and are crazy. Was the revelation sent down to him among us? Surely he (Saleh) is a very liar ( and) arrogant.\" Later they will know who is really a liar (and) arrogant. Verily, We will send a she-camel as a trial for them, so wait for them and be patient (Pious). And tell them that the water is divided among them (with the she-camel); everyone has the right to have a turn drinking. So they called their friend, and he caught (the camel) and slaughtered it. Then how terrible is My punishment and My warning! We sent upon them a loud sound of thunder, and they became like rotten dry sticks. (al-Qamar\/54: 23-31) Fifth, the Prophet Lut was also belied by his people. He repeatedly warned his people to fear Allah and abandon heinous acts, homosexuality, but they still ignored him. God then ordered Lut and his family to leave Sodom because they would be punished with devastating torments. Allah said: The people of Lut also denied the warning. Verily, We sent them a storm that brought stones (that fell on them), except the family of Lut. We saved them before dawn. (al-Qamar\/54: 33-34) Sixth, A.shhabul Aikah, who belonged to the people of the Prophet Shuaib, also denied his prophet. The Prophet Shuaib invited them to worship Allah Almighty, forbid associating partners with Him, and not to reduce their scales. However, his people not only rejected the call, they even allied against it. That is why they were destroyed by lightning striking them in complete darkness. Allah said: Then drop us a lump from the sky, if you are of the truthful.\" He (Syuaib) said, \"My Lord knows best what you do.\" Then they denied him (Syuaib), then they were punished on the day the dark. Verily, that is the punishment on the terrible day. (asy-Syu'ara'\/26: 187-189)"
		   },
		   {
			"id": 3983,
			"surah": 38,
			"ayat": 13,
			"tafsir": "In these two verses, Allah explains the six peoples who denied Allah's messengers, and the consequences they suffered, with the intention of being a lesson for the polytheists of Mecca, so that they are released from misguidance, and want to receive guidance. They are: First, Noah's people who accused Noah of giving advice and warnings that were made up. Therefore, they made fun of, even said that Noah was crazy. Even though Prophet Noah had repeatedly called on them gently to believe in monotheism, their challenges did not decrease, they even increased, finally Prophet Noah prayed to Allah. God's Word: And Noah said, \"O my Lord, do not let any of the disbelievers live on the earth. Verily, if You let them stay, they will surely lead Your servants astray, and they will only give birth to children who are evil and ungrateful. (Nuh\/71: 26-27) Noah's people still deny his call, even drowning in error. Allah destroys them through storms, typhoons, and floods as recompense for the crimes they have committed. However, Noah and his followers were saved by Allah from the torment. Allah said: Then We opened the gates of heaven by (sent down) pouring water, and We made the earth spout springs of water so that (the waters) met so that ( overflowing caused) a predetermined (disaster). who have been denied (their people). (al-Qamar\/54: 11-14) Second, the people of 'Ad denied Hud's call that invited them to worship Allah Almighty and abandon the offerings that they associated with Allah. However, the people of 'Ad opposed the call, they even made fun of Hud and called him crazy. That is why they were destroyed by a very cold and strong wind. Allah said: As for the people of 'Ad, they were destroyed by a very cold hurricane, Allah brought it down on them for seven nights and eight days continuously; then you see the people of 'Ad at that time dead lying like the trunks of date palms that have been empty (rotted). So do you see anyone left among them? (al-haqqah\/69: 6-8) Third, Pharaoh who had a large army. Besides that, he has a special torture place to torture his enemies and a tall and sturdy building. Allah has sent Musa to Pharaoh and his followers to stop his heresy and worship Allah Almighty. The truth of Moses' call was also strengthened by a miracle. However, Pharaoh and his followers persisted in rejecting Musa's call, even being arrogant and insulting him by declaring that he was the supreme god. So Allah ordered Musa to evacuate his people in order to be safe from Pharaoh's cruelty. That way, Musa and the Children of Israel were saved from the pursuit of Pharaoh while he and his army were drowned by the waves of the sea. Allah said: And We saved the Children of Israel across the sea, then Pharaoh and his army followed them, to oppress and oppress (them). So that when Pharaoh almost drowned he said, \"I believe that there is no god but the God that the Children of Israel believe in, and I am one of the Muslims (surrender).\" Why only now (you believe), when in fact you have been disobedient long ago, and you are among those who do mischief. So today We saved your body so that you can be a lesson for those who come after you, but most people do not heed Our signs (power). (Yunus\/10: 90-92) Another meaning of autad is the shackles used by Pharaoh to torture him. There are also those who say that Pharaoh had a magnificent and sturdy palace. Fourth, the Samud people who denied the call of Prophet Saleh who was sent for them. They have made a mistake that exceeds the limit. They had slaughtered the camel that was supposed to be looked after. In recompense for their disobedience, Allah sent down a loud thunderous sound, until they perished like dry grass. Allah said: Even the Samud people have denied the warning. So they said, \"How are we going to follow a human (ordinary) among us? Indeed, then we really have gone astray and are crazy. Was the revelation sent down to him among us? Surely he (Saleh) is a very liar ( and) arrogant.\" Later they will know who is really a liar (and) arrogant. Verily, We will send a she-camel as a trial for them, so wait for them and be patient (Pious). And tell them that the water is divided among them (with the she-camel); everyone has the right to have a turn drinking. So they called their friend, and he caught (the camel) and slaughtered it. Then how terrible is My punishment and My warning! We sent upon them a loud sound of thunder, and they became like rotten dry sticks. (al-Qamar\/54: 23-31) Fifth, the Prophet Lut was also belied by his people. He repeatedly warned his people to fear Allah and abandon heinous acts, homosexuality, but they still ignored him. God then ordered Lut and his family to leave Sodom because they would be punished with devastating torments. Allah said: The people of Lut also denied the warning. Verily, We sent them a storm that brought stones (that fell on them), except the family of Lut. We saved them before dawn. (al-Qamar\/54: 33-34) Sixth, A.shhabul Aikah, who belonged to the people of the Prophet Shuaib, also denied his prophet. The Prophet Shuaib invited them to worship Allah Almighty, forbid associating partners with Him, and not to reduce their scales. However, his people not only rejected the call, they even allied against it. That is why they were destroyed by lightning striking them in complete darkness. Allah said: Then drop us a lump from the sky, if you are of the truthful.\" He (Syuaib) said, \"My Lord knows best what you do.\" Then they denied him (Syuaib), then they were punished on the day the dark. Verily, that is the punishment on the terrible day. (asy-Syu'ara'\/26: 187-189)"
		   },
		   {
			"id": 3984,
			"surah": 38,
			"ayat": 14,
			"tafsir": "Allah explained the reason why they were tortured and suffered destruction, that is, because the former peoples denied the call of Allah's apostles, so they deserved to be tortured and suffered destruction. The stories of the past ummah were presented to the polytheists of Mecca, as a warning so that they are aware and willing to change their attitude which denies the Apostle's call and instead become obedient people and accept his call. This story also serves as entertainment and encouragement for the believers to be steadfast in the face of torture and humiliation by the enemies of Allah, that enemy serves as an example for them that the struggle to defend the religion of monotheism certainly receives help from Allah and must end in victory."
		   },
		   {
			"id": 3985,
			"surah": 38,
			"ayat": 15,
			"tafsir": "In this verse, Allah threatens the polytheists of Mecca who do not want to change their denial of the Prophet, with threats in the form of shouts that are very loud and fast, as a sign of the coming of the Day of Judgment which will destroy. At that time, they have no chance to escape the destruction that comes suddenly and does not last a moment."
		   },
		   {
			"id": 3986,
			"surah": 38,
			"ayat": 16,
			"tafsir": "In this verse, Allah reveals the rejection of the disbelievers of Mecca against the punishment that was threatened to them. They made fun of the Prophet after hearing that the punishment that was threatened to them was the punishment on the Day of Judgment. They ask Allah so that the punishment that is threatened to come to them is hastened and there is no need to wait until the day of reckoning arrives. Allah said: And (remember), when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then shower us with stones from the sky, or bring us painful doom.\" (al-Anfal\/8: 32) According to the history of Imam an-Nasa'i from Ibn 'Abbas, that the person who requested that Allah's punishment be hastened was an-Nadhir bin al-harits bin 'Alaqah bin Kaladah. An-Nadhir was killed in the Battle of Badr. What is meant by the day of reckoning is the day that every person's deeds are examined, with a thorough examination in order to receive a reward according to his deeds. The occurrence of the day of reckoning is preceded by a loud scream that destroys all life on the Day of Judgment."
		   },
		   {
			"id": 3987,
			"surah": 38,
			"ayat": 17,
			"tafsir": "Allah ordered the Messenger of Allah and his followers to remain patient with whatever the polytheists say, even though the words are insults and lies. The same thing did not only happen to the Prophet and his followers, but also to the prophets who were sent before. For those who believe, the denial and persecution that comes from the enemies of Allah, do not reduce their enthusiasm for struggle in upholding the religion of monotheism, and even becomes an incentive to maintain the truth of monotheism and continue to fight to destroy polytheism. Allah ordered the Messenger of Allah to remind his people of the story of the Prophet David who had power. What is meant by strength in this verse is strength in obeying Allah and strength in understanding religion. His obedience to Allah and knowledge of religion is reflected in his actions, which are always struggling to carry out the mandate, spreading calls for embracing the monotheistic religion, without showing the slightest weakness. Prophet David is known as the most powerful prophet in worship. He uses a third of the night to pray, and every day he fasts. Regarding David's obedience to his Lord, it is further explained in several hadiths as follows: The fast that is most loved by Allah is the fast of David. He fasts one day and breaks his fast one day. The most beloved prayer to Allah Ta'ala is the prayer of David, He sleeps half the night, prays one third, then sleeps one sixth. (History of A.hmad, al-Bukhari, Muslim, Abu Dawud, and an-Nasa'i from Ibn 'Umar) From this history it can be understood that the Prophet David in all matters always returned it to Allah. If he feels guilty, or it crosses his heart that there is a mistake in him, then he always asks God for forgiveness. Imam al-hakim narrated from Abu ad-Darda' which stated: If the Prophet (Muhammad) saw mentioned the Prophet David or spoke about him, then he gave the characteristic that he was a human being who worshiped the most. Imam adh-ailami narrated from Ibn 'Umar who stated that the Messenger of Allah said: It is not appropriate for someone to say that I worship more than the Prophet David. These narrations show that the Prophet David was a prophet who was very obedient to Allah, as confirmed by Allah at the end of this verse."
		   },
		   {
			"id": 3988,
			"surah": 38,
			"ayat": 18,
			"tafsir": "In these verses, Allah mentions some of the blessings that were given to David. First, that God has subjected the mountains to glorify with David in the evening and in the morning. An expression like this implies that the Prophet David always obediently worshiped Allah. He always glorifies, praises His greatness morning and evening. Allah equates this obedience of David with the obedience of the mountains to show how deep the obedience of the Prophet David was. As for the observance of the glorified mountains, it lies in the fact that these mountains follow the unchanging sunnah of Allah, which is of course different from human obedience. Allah says: And there is nothing but glorify Him with praise, but you do not understand their tasbih. (al-Isra'\/17: 44) If someone pays close attention to the meaning and usefulness of the creation of mountains for humans, and also pays attention to their best functions, then he will know that mountains are one of the causes of rain, which gives life to humans . It is also a medium for storing water in the rainy season, which it distributes in the dry season, as well as the minerals it spews out to fertilize agricultural land. Likewise, in his stomach there are all kinds of minerals that are very necessary for the benefit of equipment for human life. The mountains carry out their duties to the best of their ability and never stray from the provisions in force. Allah further explained that He also subdued the birds who always glorified Him with the Prophet David. This similar expression implies how beautiful the voice of the Prophet David was when he read the Psalms, so that it seemed as if the vibrations of his voice could captivate the birds flying in the sky. It is described as if the birds that were flying stopped in the air because they heard the voice of the Prophet David who was chanting, and also sang along with him. The tasbih of birds is not the same as the tasbih of humans. Birds have their own way of expressing the majesty of Allah. After that, Allah emphasized that each of the creatures mentioned earlier, namely mountains and birds, is submissive, submissive and tame, obedient to Allah's provisions for the benefit of mankind. In this verse there is an allusion to the polytheists of Mecca, first that if the mountains and birds that were created without reason always comply with Allah's provisions, then those who were created as beings who are more perfect and equipped with intelligence should be more obedient to the laws. God. If the opposite happens, it means that something unusual has happened to them. Second, Allah has strengthened the kingdom of the Prophet David with a large army, abundant wealth, highly respected person, and expertise in managing war tactics so that he always wins. Third, Allah has bestowed upon him wisdom. What is meant by wisdom in this verse is prophethood, perfection of knowledge, and thoroughness in carrying out deeds, as well as proper understanding. Among the knowledge that God gave to the Prophet David is as mentioned in the word of God: ¦ and We have softened the iron for him, (namely) make large armor and measure the plaiting; and do good. Verily, I am All-Seeing of what you do. (Saba'\/34: 10-11) While what is meant by his thoroughness in carrying out deeds is that he does not want to start an action, unless he knows what the cause is and for what the deed is being done. Fourth, Allah has bestowed upon him wisdom in resolving disputes. In resolving disputes, he always examines the parties based on convincing evidence, far from being one-sided, and free from the influence of lust. To find true beliefs that can be used as the right basis for deciding cases requires extensive knowledge, a gentle attitude, mastery of disputed issues, and strong patience."
		   },
		   {
			"id": 3989,
			"surah": 38,
			"ayat": 19,
			"tafsir": "In these verses, Allah mentions some of the blessings that were given to David. First, that God has subjected the mountains to glorify with David in the evening and in the morning. An expression like this implies that the Prophet David always obediently worshiped Allah. He always glorifies, praises His greatness morning and evening. Allah equates this obedience of David with the obedience of the mountains to show how deep the obedience of the Prophet David was. As for the observance of the glorified mountains, it lies in the fact that these mountains follow the unchanging sunnah of Allah, which is of course different from human obedience. Allah says: And there is nothing but glorify Him with praise, but you do not understand their tasbih. (al-Isra'\/17: 44) If someone pays close attention to the meaning and usefulness of the creation of mountains for humans, and also pays attention to their best functions, then he will know that mountains are one of the causes of rain, which gives life to humans . It is also a medium for storing water in the rainy season, which it distributes in the dry season, as well as the minerals it spews out to fertilize agricultural land. Likewise, in his stomach there are all kinds of minerals that are very necessary for the benefit of equipment for human life. The mountains carry out their duties to the best of their ability and never stray from the provisions in force. Allah further explained that He also subdued the birds who always glorified Him with the Prophet David. This similar expression implies how beautiful the voice of the Prophet David was when he read the Psalms, so that it seemed as if the vibrations of his voice could captivate the birds flying in the sky. It is described as if the birds that were flying stopped in the air because they heard the voice of the Prophet David who was chanting, and also sang along with him. The tasbih of birds is not the same as the tasbih of humans. Birds have their own way of expressing the majesty of Allah. After that, Allah emphasized that each of the creatures mentioned earlier, namely mountains and birds, is submissive, submissive and tame, obedient to Allah's provisions for the benefit of mankind. In this verse there is an allusion to the polytheists of Mecca, first that if the mountains and birds that were created without reason always comply with Allah's provisions, then those who were created as beings who are more perfect and equipped with intelligence should be more obedient to the laws. God. If the opposite happens, it means that something unusual has happened to them. Second, Allah has strengthened the kingdom of the Prophet David with a large army, abundant wealth, highly respected person, and expertise in managing war tactics so that he always wins. Third, Allah has bestowed upon him wisdom. What is meant by wisdom in this verse is prophethood, perfection of knowledge, and thoroughness in carrying out deeds, as well as proper understanding. Among the knowledge that God gave to the Prophet David is as mentioned in the word of God: ¦ and We have softened the iron for him, (namely) make large armor and measure the plaiting; and do good. Verily, I am All-Seeing of what you do. (Saba'\/34: 10-11) While what is meant by his thoroughness in carrying out deeds is that he does not want to start an action, unless he knows what the cause is and for what the deed is being done. Fourth, Allah has bestowed upon him wisdom in resolving disputes. In resolving disputes, he always examines the parties based on convincing evidence, far from being one-sided, and free from the influence of lust. To find true beliefs that can be used as the right basis for deciding cases requires extensive knowledge, a gentle attitude, mastery of disputed issues, and strong patience."
		   },
		   {
			"id": 3990,
			"surah": 38,
			"ayat": 20,
			"tafsir": "In these verses, Allah mentions some of the blessings that were given to David. First, that God has subjected the mountains to glorify with David in the evening and in the morning. An expression like this implies that the Prophet David always obediently worshiped Allah. He always glorifies, praises His greatness morning and evening. Allah equates this obedience of David with the obedience of the mountains to show how deep the obedience of the Prophet David was. As for the observance of the glorified mountains, it lies in the fact that these mountains follow the unchanging sunnah of Allah, which is of course different from human obedience. Allah says: And there is nothing but glorify Him with praise, but you do not understand their tasbih. (al-Isra'\/17: 44) If someone pays close attention to the meaning and usefulness of the creation of mountains for humans, and also pays attention to their best functions, then he will know that mountains are one of the causes of rain, which gives life to humans . It is also a medium for storing water in the rainy season, which it distributes in the dry season, as well as the minerals it spews out to fertilize agricultural land. Likewise, in his stomach there are all kinds of minerals that are very necessary for the benefit of equipment for human life. The mountains carry out their duties to the best of their ability and never stray from the provisions in force. Allah further explained that He also subdued the birds who always glorified Him with the Prophet David. This similar expression implies how beautiful the voice of the Prophet David was when he read the Psalms, so that it seemed as if the vibrations of his voice could captivate the birds flying in the sky. It is described as if the birds that were flying stopped in the air because they heard the voice of the Prophet David who was chanting, and also sang along with him. The tasbih of birds is not the same as the tasbih of humans. Birds have their own way of expressing the majesty of Allah. After that, Allah emphasized that each of the creatures mentioned earlier, namely mountains and birds, is submissive, submissive and tame, obedient to Allah's provisions for the benefit of mankind. In this verse there is an allusion to the polytheists of Mecca, first that if the mountains and birds that were created without reason always comply with Allah's provisions, then those who were created as beings who are more perfect and equipped with intelligence should be more obedient to the laws. God. If the opposite happens, it means that something unusual has happened to them. Second, Allah has strengthened the kingdom of the Prophet David with a large army, abundant wealth, highly respected person, and expertise in managing war tactics so that he always wins. Third, Allah has bestowed upon him wisdom. What is meant by wisdom in this verse is prophethood, perfection of knowledge, and thoroughness in carrying out deeds, as well as proper understanding. Among the knowledge that God gave to the Prophet David is as mentioned in the word of God: ¦ and We have softened the iron for him, (namely) make large armor and measure the plaiting; and do good. Verily, I am All-Seeing of what you do. (Saba'\/34: 10-11) While what is meant by his thoroughness in carrying out deeds is that he does not want to start an action, unless he knows what the cause is and for what the deed is being done. Fourth, Allah has bestowed upon him wisdom in resolving disputes. In resolving disputes, he always examines the parties based on convincing evidence, far from being one-sided, and free from the influence of lust. To find true beliefs that can be used as the right basis for deciding cases requires extensive knowledge, a gentle attitude, mastery of disputed issues, and strong patience."
		   },
		   {
			"id": 3991,
			"surah": 38,
			"ayat": 21,
			"tafsir": "Allah mentions one interesting event in the story of Prophet David. This story begins with a question addressed to the Prophet and his followers, to show that the story is really interesting and worthy of imitation. This interesting story is the story of litigants who came to the Prophet David. David at that time was in his place of worship. Prophet David was shocked because he thought they had come to deceive him. Prophet David suspected so, because they came in an unusual way and time. At that moment, they asked David not to be afraid. Then they explained that they had a case to decide, and asked that the case be decided by a fair decision, again not deviating from the truth."
		   },
		   {
			"id": 3992,
			"surah": 38,
			"ayat": 22,
			"tafsir": "Allah mentions one interesting event in the story of Prophet David. This story begins with a question addressed to the Prophet and his followers, to show that the story is really interesting and worthy of imitation. This interesting story is the story of litigants who came to the Prophet David. David at that time was in his place of worship. Prophet David was shocked because he thought they had come to deceive him. Prophet David suspected so, because they came in an unusual way and time. At that moment, they asked David not to be afraid. Then they explained that they had a case to decide, and asked that the case be decided by a fair decision, again not deviating from the truth."
		   },
		   {
			"id": 3993,
			"surah": 38,
			"ayat": 23,
			"tafsir": "In this verse Allah explains what they made the matter. One of them explained that his brother had ninety-nine goats. While he himself has only one goat. His brother demanded that he give up the goat he owned. Because his brother was good at twisting facts, while he himself did not have strong evidence to fend it off, he felt defeated and had to hand over that one goat to his brother. That was the case they submitted to the Prophet David with the intention of getting a fair decision."
		   },
		   {
			"id": 3994,
			"surah": 38,
			"ayat": 24,
			"tafsir": "In this verse it is explained that the Prophet David decided the case by saying that the defendant had mistreated the plaintiff, because the plaintiff had taken the plaintiff's goats to own, so that his goats had increased. In this verse it is not further explained whether the Prophet David, after receiving information from the plaintiff, also asked the defendant for information. It is also not explained whether the answer of the Prophet David was based on convincing evidence. According to the understanding that appears in the verse, the Prophet David only gave an answer after receiving information from the plaintiff. In fact, it is possible that the plaintiff may present a statement that is contrary to reality, or because the way of expressing words is arranged in such a way, that it appears as if the plaintiff is an honest person. The Prophet David should not have given a hasty answer, or just postponed his answer until he got real confidence. Judging from the way they entered to meet David by climbing over the fence, and the timing was not right, and the questions raised, they actually did not intend to ask David for a decision, but they had other intentions. Only because of the vigilance of the Prophet David, they could not carry out their plan. It is known in history that the Children of Israel often tried to kill their prophet, for example they killed Ilyasa' and Zakaria. It is reasonable to suspect that the two men (the plaintiff and the defendant) actually wanted to persecute the Prophet David, it's just that they did not carry out their evil intentions because their intentions were known in advance. Then God explained David's answer in more detail. David told the litigant that most people who hold unions abuse other members. This happens because of hasad, envy, and following lust so that the rights of one member are taken by another member. Except for those whose hearts are full of faith and love of good deeds who are spared from these evil deeds. At the end of the verse, Allah explains that the Prophet David realized that he was being tested by Allah. Then he asked Allah for forgiveness for his mistakes, while bowing down to repent to Him because he felt the shortcomings and mistakes that were in him. The mistakes and shortcomings that befell him were his haste to provide answers to litigants, even though he had not yet obtained the conviction and evidence he should have. He decided only based on his prejudice that the arrival of people who wanted to trick him was a trial from God, even though what he expected did not happen."
		   },
		   {
			"id": 3995,
			"surah": 38,
			"ayat": 25,
			"tafsir": "Then God explained that He had forgiven David for a mistake he was aware of. Allah considers that his high awareness of the events that he lives, and the sharpness of his conscience towards what is moved in his heart and obedience to Allah, are signs that he has a close position on the side of Allah. Servants of Allah like him are entitled to a good place to return, namely the Na'im heaven which is full of pleasures."
		   },
		   {
			"id": 3996,
			"surah": 38,
			"ayat": 26,
			"tafsir": "In this verse, Allah explains the appointment of the Prophet David as ruler and enforcer of law among his people. God declared that he appointed David as ruler over his people. The definition of a ruler is expressed by the caliph, which means substitute, is a sign that David in exercising his power is always adorned with good manners, which are pleasing to Allah, and in carrying out regulations he should be guided by Allah's guidance. Thus, the characteristics of the caliph of Allah are reflected in his personality. The people will certainly obey all the rules and behavior that is exemplary. Furthermore, Allah explained that He ordered the Prophet David to make decisions on matters that occurred between humans with fair decisions based on the revelations revealed to him. In that revelation there are laws that regulate human welfare in the world and their happiness in the hereafter. Therefore God forbade the Prophet David to indulge his desires in carrying out all kinds of affairs related to human welfare and happiness in this world and the hereafter. In this verse there is a sign that shows David's appointment as an apostle and what tasks an apostle should carry out which contains lessons for subsequent leaders in carrying out their leadership. At the end of the verse Allah explains the consequences of a person who indulges in lust and what punishment he deserves. Indulging in lust causes one to lose consciousness. Thus, he will lose personal control so that he strays from the path that pleases Allah. Then when the error has enveloped a person's heart, he forgets the belief that is inherent in his heart that above his power there is still someone who is more powerful. That is why people who follow their passions are threatened with harsh threats, which they will suffer on the Day of Judgment, the day when all human deeds are reckoned in order to be rewarded accordingly."
		   },
		   {
			"id": 3997,
			"surah": 38,
			"ayat": 27,
			"tafsir": "Allah explains that He made the heavens, the earth, and whatever creatures are in between, not in vain. The sky with all the stars that adorn it, the sun that emits its light during the day, and the moon that shows its changing shape from night to night, is very beneficial for humans. Likewise the earth with all its contents, whether visible on the surface or stored in its bowels, is of great significance to human life. All of that was created by Allah on His power and will as a priceless mercy. If one wants to pay close attention to the creatures in this universe, one will surely know that all existing creatures are subject to and obey the regulations that apply, which cannot be avoided. Likewise in terms of human creation. They cannot escape God's provisions, as soon as they are born they are subject to the gravitational pull of the earth, they breathe acidic substances and so on. There has never been a human being who deviates from this provision. When he grows up, he needs a life partner to fill the void in his soul, and to carry out his life goals he breeds offspring. Then when death has come, he returns to his origin. He will be revived in the afterlife, in order to account for all his deeds while living in this world. Allah said: And fear the day (when) you are all returned to Allah. Then everyone is given a perfect reward according to what he has done, and they are not wronged (harmed). (al-Baqarah\/2: 281) If humans think clearly and earnestly, they will certainly acknowledge the oneness and power of Allah over all that is in the heavens, the earth, and all creatures that are in between. If humans acknowledge God's omnipotence, they will certainly also acknowledge His power to send down revelations to His chosen servants. Then Allah explained the attitude of the Meccan disbelievers. They don't want to pay attention to the signs of Allah's power in the heavens and the earth, and they also don't want to examine the signs of Allah's greatness in themselves. That is why they deny the oneness of Allah and the resurrection day. Allah says: And We did not play in creating the heavens and the earth and what is between them. We did not create both except with the truth, but most of them do not know. (ad-Dukhan\/44: 38-39) And His words: So do you think that We created you playfully (without any intention) and that you will not be returned to Us? (al-Mu'minun\/23: 115) At the end of the verse, Allah confirms that they will get a different reality from what they expected while living in the world. They will experience the wail hell which is provided as a doom for them, as a fitting reward for their denial of the oneness of Allah, the truth of revelation, and the occurrence of the day of resurrection."
		   },
		   {
			"id": 3998,
			"surah": 38,
			"ayat": 28,
			"tafsir": "In this verse, Allah explains that among His wisdom is not to regard His servants who do good as the same as those who fall into the valley of disobedience. It is inappropriate for Allah's substance with all His majesty, to regard His servants who believe and do good as equals and those who deny His oneness and indulge their desires. The believers referred to in this verse are those who believe that Allah is One and does not need partners in carrying out His power and will. Based on that belief they realize and carry out what should be done to each other and to their Creator. With that same belief, they obey the orders of their Creator that are conveyed through His messengers and stay away from all His prohibitions. They always try hard to keep their soul clean from the stains that pollute it. Allah says: And the most pious person will be kept away from (hell), who spends his wealth (in the way of Allah) to purify (himself), and no one gives him a favor that he must repay. (al-Lail\/92: 17-19) While what is meant by people who do damage on earth are people who do not want to follow the truth and always follow their desires. They do not want to acknowledge the oneness of Allah, the truth of revelation, and the occurrence of the Day of Resurrection and Judgment. Therefore, those who are far from God's grace dare to violate His prohibitions. They do not believe that they will be resurrected from their graves, they will still be gathered at Padang Mahsyar to be accountable for their deeds. Allah says: And for every human being We have put a necklace (record) of his deeds around his neck. And on the Day of Resurrection We will bring out for him an open Book. \"Read your book, suffice yourself today as your counter.\" (al-Isra'\/17: 13-14) If any of Allah's servants are rewarded for their good deeds in this world, and are tortured for their bad deeds, this is according to the wisdom and wisdom of Allah. He has given reason so that they can know how extensive the grace of God has been given to them. However, they do not want to make the best use of their reason, so they are not grateful for the blessing, they even deny it. Allah has also sent His messenger to guide them to the right path. Not only did they ignore the instructions and guidance of the apostle, but they even denied it."
		   },
		   {
			"id": 3999,
			"surah": 38,
			"ayat": 29,
			"tafsir": "Allah explained that He had sent down the Qur'an to the Holy Prophet and his followers. Al-Qur'an is a perfect book containing guidance that is very beneficial to mankind. Guidance guides people to live prosperously in this world and be happy in the hereafter. By contemplating its contents, humans will find ways to manage the benefit of life in the world. Parable parables and stories from past people are lessons in achieving their life goals and avoiding obstacles and obstacles that hinder the achievement of life goals. The Qur'an was sent down with the intention that its contents should be contemplated, then understood with the correct understanding, then practiced accordingly. A correct understanding is obtained by following the instructions of the apostle, with the help of the knowledge one has, whether related to language or social development. Likewise, in studying the instructions contained in the book, it should be based on the guidance of the apostles and try to enrich their experiences with knowledge from their experiences and thoughts. Al-Hasan al-Bashri explained the meaning of this verse by saying, \"Many of Allah's servants and children do not understand the meaning of the Qur'an, even though they have read it by heart. They memorize it so well that they don't miss a single letter. But they ignore the provisions of the Qur'an until one of them says, \"By Allah I have read the Qur'an, so that I do not miss a single letter.\" Actually people like that have missed the Al-Qur'an. The entire Qur'an, because the influence of the Qur'an does not appear in him, either in his manners or in his actions. By Allah, what is the use of him memorizing every letter, as long as they ignore the provisions of Allah. They are not experts in wisdom and experts teacher. May Allah not increase the number of such people.\" Ibn Mas'ud said: When people among us learn ten verses of the Qur'an, they do not move on to another verse, until they understand the contents of the ten verses and practice their contents. (History of A.hmad)"
		   },
		   {
			"id": 4000,
			"surah": 38,
			"ayat": 30,
			"tafsir": "Allah explained that besides David who was awarded glory and power, he was also awarded a pious son who had the ability to continue his struggle, namely Solomon. He inherited the traits of his father. He is known as a devout servant in worship and in all matters he is always grateful to Allah. He believes that all kinds of enjoyment and beauty are realized only because of the abundance of God's grace and His grace. That is why he is called the best servant of Allah, and as the praise he deserves. Allah characterizes him as His servant who is very obedient to Him. Thus Allah appointed Prophet Sulaiman to be the successor to the prophethood and kingdom of Prophet David, and inherited his knowledge contained in the Psalms. Allah said: And Solomon has inherited David. (an-Naml\/27: 16)"
		   },
		   {
			"id": 4001,
			"surah": 38,
			"ayat": 31,
			"tafsir": "Allah mentions one of the events that Solomon faced, which caused him to deserve praise. The incident occurred while he was inspecting the cavalry which was usually done in the afternoon. The horses were trained so that their dexterity and movement abilities could be known so that it was possible to carry them on the battlefield. Also trained the ability to reduce speed or stop suddenly and increased endurance against sudden attacks. The horses were trained in such a way that they could be controlled according to the tactics desired by the troops riding them. Horse dexterity also determines the success or failure of troops in mastering the battlefield and breaking enemy attacks"
		   },
		   {
			"id": 4002,
			"surah": 38,
			"ayat": 32,
			"tafsir": "Then Allah explained the condition of Solomon when he witnessed the horse training. He said that he likes horses because they are very useful as a means of upholding the truth and defending Allah's religion. His pleasure in training the horse was so deep that every evening he visited the horse training ground until the sun set in the western sky, that is, until the sunlight began to fade, and the darkness of the night prevented him from witnessing the training. It was at those moments that there was an upheaval within him, which interest should take precedence between the two interests. The first interest is the awareness of his soul to worship Allah. While the second interest is to train horses for the sake of upholding the truth and defending the sentence of monotheism. Under such circumstances, he realized that if he watched the equestrian practice until late at night, it meant that he was neglecting the worship he had to perform. In this verse it is not explained in detail whether Solomon's pleasure in checking the horse's training caused him to miss time to perform worship or not. Similarly, it was not explained which of the following was prioritized by Sulaiman, checking horse training or carrying out worship. However, what can be understood from this verse is that when he is engrossed in watching horse training, an awareness of worshiping Allah is born in his heart. So the understanding that should be taken from this verse is that the upheaval that occurred in Solomon was regret for not worshiping Allah at the beginning of his time, because he was busy watching horse training. Then he realized and carried it out at the end of time."
		   },
		   {
			"id": 4003,
			"surah": 38,
			"ayat": 33,
			"tafsir": "In this verse, Allah explains what Solomon ordered his horse trainers to do. He ordered his trainer to bring the horses back to him. After the coach brought the horse to him, he approached. Then he rubbed the horses' legs and necks as a sign of Solomon's satisfaction with the glorious results achieved by the horses. Thus the horse can be used in battle to attack the enemy or to evade enemy attacks that come suddenly. From this description it can be said that Sulaiman, a servant of Allah, is pious, obedient in worship, conscientious, and meticulously plans the struggle to uphold the sentence of monotheism and has high awareness in moments of determining which is more important than what is important."
		   },
		   {
			"id": 4004,
			"surah": 38,
			"ayat": 34,
			"tafsir": "Then Allah explained Solomon's condition at the time of his trial and his condition after he had finished facing the ordeal. God tried it by inflicting severe pain. So great was the attack of the disease that he lost all strength. His body limp limp lying in his chair as if lifeless again. Abu Hurairah narrated that the Prophet said: Prophet Sulaiman said, \"I will go around tonight to collect ninety wives, all of them will later give birth to children who are good at riding horses and jihad fi sabilillah\". So a friend of his said to him. \"Say God willing\", but Prophet Sulaiman did not say God willing. Prophet Sulaiman then gathered all his wives, but none of them became pregnant except one wife, who then gave birth to an imperfect child. By the Substance that controls Muhammad, \"If Prophet Sulaiman had said insya Allah, surely all his wives would have given birth to children who are good at riding horses and jihad fi sabilillah.\" (Al-Bukhari and Muslim history from Abu Hurairah) Another explanation explains that what is meant by The ordeal relates to Prophet Sulaiman's desire to come to his ninety wives in one night and each wife gave birth to a horse rider. However, he did not say insya Allah, so Allah tested him with trials that no one gave birth except for only one person and gave birth to a paralyzed baby and was placed on the chair of Prophet Sulaiman. In moments of receiving trials like that, he always put his hope in Allah and surrendered himself to accept the trials with sincerity. At the end of the verse, Allah confirms that Solomon then repented and asked forgiveness for the weaknesses that were in him and surrendered to Allah."
		   },
		   {
			"id": 4005,
			"surah": 38,
			"ayat": 35,
			"tafsir": "Allah then explained that after Solomon recovered from his illness, he realized the weakness that was in him. He has chosen things that are less important. He had missed a prime time of worship due to witnessing the horse training. Then Prophet Sulaiman prayed to Allah to be awarded a kingdom that was incomparable, which no one else would have afterward. In the hadith of the Prophet it was narrated: That the Prophet said: That Ifrit from the jinn group spat at me last night so that I would cancel my prayer but Allah gave me strength so that I could catch the jinn. I intend to tie it to one of the pillars of the mosque so that you can see it. But I remembered the prayer of my brother Sulaiman, \"O Allah, forgive me, and give me strength that is not worthy to be given to people after me\". So I drove him away. (Al-Bukhari and Muslim) Prophet Sulaiman grew up in a royal and prophetic environment. Since childhood he was trained as a child of a king and prophet. Solomon also inherited the ability of both of them and Allah also bestowed on him that ability. That is why Allah bestowed on him a very strong kingdom and abundant wealth, which is incomparable. At the end of the verse, Allah mentions the reason that Sulaiman put forward in his prayer, namely because Allah will truly grant everyone's prayers, accompanied by the effort and ability requirements according to His will."
		   },
		   {
			"id": 4006,
			"surah": 38,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains some of the favors given to Prophet Sulaiman, as an answer to his prayer. First: Allah bestowed upon Solomon the power to subdue the winds. With God's permission, the wind blows swiftly or gracefully according to his will anyway. Allah said: And (We subject) to Sulaiman a very strong wind that blows by his order to the land that We have blessed him with. And We are All-Knowing of all things. (al-Anbiya'\/21: 81) Second: Allah bestowed upon him the ability to subdue demons who are skilled builders and skilled divers, who carry out tasks according to Solomon's orders. If he orders them to build a building such as palace meeting halls, defensive fortifications, or buildings where Solomon's wealth is stored and others, then they can complete this task in a very short time. If Solomon ordered them to collect pearls and marjans and other marine wealth, the task could be completed quickly too. Third: Allah bestowed upon him the power to subdue the devil who opposed his orders. Their hands and feet were bound in shackles, so as not to be a danger to others, and as punishment for their disobedience. The power given by Allah to Solomon to subdue Satan means the power to move them to carry out heavy tasks, namely the task of building buildings and diving to extract the wealth of the sea. However, there is no definite information about how Solomon shackled the demon. The most important attitude is that we accept the information contained in the Qur'an and to express its meaning, we leave it to science."
		   },
		   {
			"id": 4007,
			"surah": 38,
			"ayat": 37,
			"tafsir": "In this verse, Allah explains some of the favors given to Prophet Sulaiman, as an answer to his prayer. First: Allah bestowed upon Solomon the power to subdue the winds. With God's permission, the wind blows swiftly or gracefully according to his will anyway. Allah said: And (We subject) to Sulaiman a very strong wind that blows by his order to the land that We have blessed him with. And We are All-Knowing of all things. (al-Anbiya'\/21: 81) Second: Allah bestowed upon him the ability to subdue demons who are skilled builders and skilled divers, who carry out tasks according to Solomon's orders. If he orders them to build a building such as palace meeting halls, defensive fortifications, or buildings where Solomon's wealth is stored and others, then they can complete this task in a very short time. If Solomon ordered them to collect pearls and marjans and other marine wealth, the task could be completed quickly too. Third: Allah bestowed upon him the power to subdue the devil who opposed his orders. Their hands and feet were bound in shackles, so as not to be a danger to others, and as punishment for their disobedience. The power given by Allah to Solomon to subdue Satan means the power to move them to carry out heavy tasks, namely the task of building buildings and diving to extract the wealth of the sea. However, there is no definite information about how Solomon shackled the demon. The most important attitude is that we accept the information contained in the Qur'an and to express its meaning, we leave it to science."
		   },
		   {
			"id": 4008,
			"surah": 38,
			"ayat": 38,
			"tafsir": "In this verse, Allah explains some of the favors given to Prophet Sulaiman, as an answer to his prayer. First: Allah bestowed upon Solomon the power to subdue the winds. With God's permission, the wind blows swiftly or gracefully according to his will anyway. Allah said: And (We subject) to Sulaiman a very strong wind that blows by his order to the land that We have blessed him with. And We are All-Knowing of all things. (al-Anbiya'\/21: 81) Second: Allah bestowed upon him the ability to subdue demons who are skilled builders and skilled divers, who carry out tasks according to Solomon's orders. If he orders them to build a building such as palace meeting halls, defensive fortifications, or buildings where Solomon's wealth is stored and others, then they can complete this task in a very short time. If Solomon ordered them to collect pearls and marjans and other marine wealth, the task could be completed quickly too. Third: Allah bestowed upon him the power to subdue the devil who opposed his orders. Their hands and feet were bound in shackles, so as not to be a danger to others, and as punishment for their disobedience. The power given by Allah to Solomon to subdue Satan means the power to move them to carry out heavy tasks, namely the task of building buildings and diving to extract the wealth of the sea. However, there is no definite information about how Solomon shackled the demon. The most important attitude is that we accept the information contained in the Qur'an and to express its meaning, we leave it to science."
		   },
		   {
			"id": 4009,
			"surah": 38,
			"ayat": 39,
			"tafsir": "Allah further explained that all kinds of favors were gifts that He gave to Solomon specifically. The favor includes a great kingdom, abundant wealth and power that has never been given to anyone else. These favors were bestowed upon him to be used properly. Allah emphasized that these blessings were given to Solomon without accountability, because Solomon had been given the ability to control all kinds of blessings."
		   },
		   {
			"id": 4010,
			"surah": 38,
			"ayat": 40,
			"tafsir": "Then Allah explained that in addition to the glory he had achieved in the world, which was very amazing, he would be blessed with even more favors and a more noble position. Allah promised him that he would be included in the ranks of His servants who have a position that is very close to Allah, namely the position obtained by the apostles and prophets, a good place of return, namely the Na'im heaven which is full of all kinds of pleasures."
		   },
		   {
			"id": 4011,
			"surah": 38,
			"ayat": 41,
			"tafsir": "Allah ordered Rasulullah saw to tell his people the story of Job who was very patient in facing life's trials and obedient to Allah. At the time of facing this very heavy ordeal, he prayed to Allah and complained that his suffering would be removed. Some commentators say that Job was a very wealthy prophet. He was a farmer and livestock keeper. In addition, also as the leader of his people in a country located southeast of the Dead Sea. His country is located between the city of Adum and the Arabian desert, very fertile, flowed by a very many springs. He lived between the times of Prophet Abraham and Prophet Musa. At first he lived a prosperous and happy life, was very religious, and had many relatives. He is very happy with the results of his efforts, as well as his wealth, family, and health. Allah then wanted to test his fortitude by inflicting a very severe skin disease. So serious was his illness and suffered for so long that his possessions were depleted, and his family scattered to the surrounding countries in search of a living. In the midst of his suffering, he felt very tired and suffering. He felt that there was a demon that disturbed his soul when he worshiped Allah. Then he complained to Allah to be given instructions to release himself from the suffering and torment he was experiencing. Allah said: And (remember the story of) Ayub, when he prayed to his Lord, \"(O my Lord), indeed, I have been afflicted with a disease, even though You are God, the Most Merciful of all the merciful.\" (al-Anbiya'\/21: 83)"
		   },
		   {
			"id": 4012,
			"surah": 38,
			"ayat": 42,
			"tafsir": "This verse explains that because of Job's obedience and patience in facing trials, God granted his prayer by ordering him to stamp his feet on the earth. Then from the earth gushed cool springs. Then Job was ordered to bathe and drink the water. Instantly, God healed his illness as if he had never been sick before. Then he reunited his family that had been scattered, and they were finally able to spread many descendants, as a mercy from Allah to him and to his descendants. At the end of the verse, God emphasizes that Job's obedience and patience is a lesson for people of understanding and a guide for all mankind that God's grace is very close to those who always do good deeds. This is also an example that every struggle, even though it feels very tiring at first, but if it is done with steadfastness, surely all difficulties can be overcome, and victory can definitely be achieved. The valuable experience that can be learned from Job's story is that a person should not give up on finding a way out in facing obstacles, until he finds a way to overcome these obstacles, by asking Allah for guidance to be given an abundance of His guidance."
		   },
		   {
			"id": 4013,
			"surah": 38,
			"ayat": 43,
			"tafsir": "This verse explains that because of Job's obedience and patience in facing trials, God granted his prayer by ordering him to stamp his feet on the earth. Then from the earth gushed cool springs. Then Job was ordered to bathe and drink the water. Instantly, God healed his illness as if he had never been sick before. Then he reunited his family that had been scattered, and they were finally able to spread many descendants, as a mercy from Allah to him and to his descendants. At the end of the verse, God emphasizes that Job's obedience and patience is a lesson for people of understanding and a guide for all mankind that God's grace is very close to those who always do good deeds. This is also an example that every struggle, even though it feels very tiring at first, but if it is done with steadfastness, surely all difficulties can be overcome, and victory can definitely be achieved. The valuable experience that can be learned from Job's story is that a person should not give up on finding a way out in facing obstacles, until he finds a way to overcome these obstacles, by asking Allah for guidance to be given an abundance of His guidance."
		   },
		   {
			"id": 4014,
			"surah": 38,
			"ayat": 44,
			"tafsir": "Then God related the leniency for his wife given to Job. God commanded Job to take a sheaf of grass to beat his wife. This blow of grass was sufficient as a substitute for the oath he had once uttered. In the verses of the Qur'an it is not stated why he swore and what his oath was. Only the hadith mentions that he swore because his wife, whose name was Rahmah the daughter of Ifraim, went for something necessary and came late. Job vowed to beat him 100 times when he recovered. With that blow of a sheaf of grass, he was deemed to have fulfilled his vow, as a favor to Job himself and to his wife who had served him well in his illness. With God's grace, Job was spared from breaking his oath. At the end of the verse, God praises that Job is His patient, kind, and obedient servant. Patience in facing the trials that are given to him, both the trials that befall him, his wealth, and his family. He is included in the class of His servants who are good in temperament because they do not give up easily, and shed their hope in Allah. He is also His obedient servant, because of his persistence in fighting for religious orders and protecting himself, his family and his people from destruction. Regarding Job's obedience, it can be seen from a history that when he encountered trials he said: \"O Allah, You are the one who takes and You are also the one who gives.\" At the time of mujanat he also said: \"O my Lord, \"You know very well that my speech will not differ from my heart, my heart does not follow visions, my slaves will not play tricks on me, I do not eat except with orphans and I do not are full and clothed while beside me there are people who are hungry or naked.\""
		   },
		   {
			"id": 4015,
			"surah": 38,
			"ayat": 45,
			"tafsir": "Allah ordered His Messenger to tell his people the struggle of the Prophet Abraham, and his son Isaac who was also appointed a prophet, and his grandson Jacob who also achieved the degree of prophethood. They are God's servants who are known for their fortitude and achieve glory because of their obedience to God. Because of their persistent struggle in upholding the truth and destroying falsehood, they are empowered by Allah to have extensive religious knowledge and the power to lead their people to a bright path, far from astray. They are also given the ability to carry out deeds that are pleasing to Allah, which are beneficial for the interests of the lives of their people in this world and their happiness in the hereafter. In this verse there is an insinuation for the polytheists that if they do not want to take lessons from the story, they will certainly remain in error and in the hereafter they will experience terrible suffering."
		   },
		   {
			"id": 4016,
			"surah": 38,
			"ayat": 46,
			"tafsir": "In this verse, Allah explains that the reasons why the prophets attained glory in both the world and the hereafter were due to keeping their souls clean and keeping away from despicable sins. Because their souls are clean from the stains of polytheism, they sincerely obey God's commands. Also because they always stay away from despicable actions, they are persistent in fighting for the truth and eliminating wrongdoing. Thus, it is reflected in their souls of high morals and noble qualities that make them exemplary. All their activities, whether in the form of energy, wealth or thoughts, are solely used for pure worship, with the aim of wanting to please Allah and uphold the sentence of monotheism. With that basis, they always warn their people in the eternal afterlife. The enjoyment in this world which is only temporary should be used as a means to serve Allah, so that in the hereafter they will receive uninterrupted enjoyment, which is provided for servants who earn His approval. While the servants who disobey and always wallow in the error of life, will feel a very painful punishment."
		   },
		   {
			"id": 4017,
			"surah": 38,
			"ayat": 47,
			"tafsir": "In this verse, Allah confirms that His chosen servants, namely Abraham, Isaac, and Jacob, truly have clean souls. There is not the slightest implied in their souls reprehensible qualities, such as jealousy and arrogance, but emanate from within them commendable qualities that serve as role models and good examples for their people. The lesson that can be drawn from this verse is that a clean soul and a sound mind are conditions that must be met by those who desire glory in both this world and the hereafter. People whose souls are clean and their minds are healthy certainly see the signs of Allah's greatness in them and in the heavens and the earth and everything in them. While people whose souls are dirty and their minds are shackled by material things, of course they will not see the signs of Allah's greatness and will not see the truth of the revelations brought by the apostles."
		   },
		   {
			"id": 4018,
			"surah": 38,
			"ayat": 48,
			"tafsir": "In this verse, Allah ordered Rasulullah SAW to tell about other prophets, namely Ismail, Ilyasa', and Zulkifli to his people. They are prophets who are persistent in fighting for the upholding of Allah's religion in the midst of their people. This verse separates the mention of Ishmael from his father Abraham. This indicates a separation between the two. Indeed Prophet Ismail separated from his father, after he was left with his mother, Hajar, in Mecca. thahir bin 'Asyur, as quoted by Quraish Shihab, understood that the separation was because the Prophet Ismail would later become the ancestor of a great ummah, namely the Arab nation. While Isaac and Jacob were united with Abraham because they were indeed the forefathers of the Children of Israel. The merging of Ilyasa' and Ismail because of the similarities between the two, among other things, they are both chosen humans, the position of Ilyasa' among the Children of Israel is similar to that of Ismail among the descendants of Abraham. The similarity is that Ilyasa' helped Prophet Ilyas, as Ismail helped Ibrahim. According to ash-Syaukani in Tafsir Fath al-Qadir it is stated that the combination of the mentions of Zulkifli, Ilyasa', and Ismail is because they have something in common, namely patient people. At the end of the verse, Allah confirms that they are the best servants of Allah, have high morals, are virtuous, and guide their people to obey Allah and stay away from polytheism."
		   },
		   {
			"id": 4019,
			"surah": 38,
			"ayat": 49,
			"tafsir": "Allah explained that the verses that tell about the glory of the prophets and their happiness in the hereafter is an honor for them to always be remembered by humans. In addition to obtaining glory in the world, they are also provided with a good place to return to in the hereafter. In this verse, the prophets are included in a group of people who are pious, so that those who pay attention to the Prophet's call when they hear this word of God become aware that if they want to imitate and emulate the struggle of the apostles, of course they will also receive honor. in this world and goodness in the hereafter. Likewise, people who want to carry out God's commands and stay away from His prohibitions, will certainly get the same fate."
		   },
		   {
			"id": 4020,
			"surah": 38,
			"ayat": 50,
			"tafsir": "In these verses Allah explains how enjoyable the place of return is provided for the apostles and those who are pious. The gates of heaven 'Adn are always open, and conditions are always pleasant, as a sign that everything has been prepared to honor the chosen servants of Allah who will inhabit it. The rooms are splendidly spacious, the maids are lovely to the eye, and the surroundings are astounding. Everything is in a dazzling created order, which has never been seen before, has never ringed in the ear and has never entered the heart. In that heaven their desires are fulfilled, the couches where they lie down, all kinds of satisfaction are available, various kinds of fruits, kinds of tastes and aromas, as well as drinks of all kinds, ready to be served. In fact, the enjoyment in heaven is the culmination of all pleasures. The pleasures that exist in heaven are expressed in fruits and drinks as enjoyment according to the conditions of the people of Mecca at that time. If one mentions various kinds of fruits and various kinds of drinks, of course their appetite will be aroused, and their desire to enjoy will arise. In addition, they were accompanied by very polite angels. Each resident of heaven is served by heavenly women who are specific to him, and do not provide their services to other residents of heaven. All the women of heaven are equally beautiful and all are teenagers."
		   },
		   {
			"id": 4021,
			"surah": 38,
			"ayat": 51,
			"tafsir": "In these verses Allah explains how enjoyable the place of return is provided for the apostles and those who are pious. The gates of heaven 'Adn are always open, and conditions are always pleasant, as a sign that everything has been prepared to honor the chosen servants of Allah who will inhabit it. The rooms are splendidly spacious, the maids are lovely to the eye, and the surroundings are astounding. Everything is in a dazzling created order, which has never been seen before, has never ringed in the ear and has never entered the heart. In that heaven their desires are fulfilled, the couches where they lie down, all kinds of satisfaction are available, various kinds of fruits, kinds of tastes and aromas, as well as drinks of all kinds, ready to be served. In fact, the enjoyment in heaven is the culmination of all pleasures. The pleasures that exist in heaven are expressed in fruits and drinks as enjoyment according to the conditions of the people of Mecca at that time. If one mentions various kinds of fruits and various kinds of drinks, of course their appetite will be aroused, and their desire to enjoy will arise. In addition, they were accompanied by very polite angels. Each resident of heaven is served by heavenly women who are specific to him, and do not provide their services to other residents of heaven. All the women of heaven are equally beautiful and all are teenagers."
		   },
		   {
			"id": 4022,
			"surah": 38,
			"ayat": 52,
			"tafsir": "In these verses Allah explains how enjoyable the place of return is provided for the apostles and those who are pious. The gates of heaven 'Adn are always open, and conditions are always pleasant, as a sign that everything has been prepared to honor the chosen servants of Allah who will inhabit it. The rooms are splendidly spacious, the maids are lovely to the eye, and the surroundings are astounding. Everything is in a dazzling created order, which has never been seen before, has never ringed in the ear and has never entered the heart. In that heaven their desires are fulfilled, the couches where they lie down, all kinds of satisfaction are available, various kinds of fruits, kinds of tastes and aromas, as well as drinks of all kinds, ready to be served. In fact, the enjoyment in heaven is the culmination of all pleasures. The pleasures that exist in heaven are expressed in fruits and drinks as enjoyment according to the conditions of the people of Mecca at that time. If one mentions various kinds of fruits and various kinds of drinks, of course their appetite will be aroused, and their desire to enjoy will arise. In addition, they were accompanied by very polite angels. Each resident of heaven is served by heavenly women who are specific to him, and do not provide their services to other residents of heaven. All the women of heaven are equally beautiful and all are teenagers."
		   },
		   {
			"id": 4023,
			"surah": 38,
			"ayat": 53,
			"tafsir": "Allah confirms that all kinds of pleasures found in heaven are promised to God's pious servants, which will definitely come after all humans are resurrected from their graves, and judged in Padang Mahsyar. Allah confirms that the favors in heaven are not just any enjoyment, but eternal favors."
		   },
		   {
			"id": 4024,
			"surah": 38,
			"ayat": 54,
			"tafsir": "Allah confirms that all kinds of pleasures found in heaven are promised to God's pious servants, which will definitely come after all humans are resurrected from their graves, and judged in Padang Mahsyar. Allah confirms that the favors in heaven are not just any enjoyment, but eternal favors."
		   },
		   {
			"id": 4025,
			"surah": 38,
			"ayat": 55,
			"tafsir": "This verse describes the condition of the disbelievers in hell. They gain a bad place of return, experiencing incomparable tribulations in hell. Every place they occupy, be it a seat, a bed, a place to rest, and so on, is a place they don't like, because in that place they are always subjected to severe torment. In another verse explaining the condition of the disbelievers in hell, Allah says: For them a sleeping mat from the fire of hell and on them is a blanket (fire of hell). Thus We recompense the wrongdoers. (al-A.'raf\/7: 41)"
		   },
		   {
			"id": 4026,
			"surah": 38,
			"ayat": 56,
			"tafsir": "This verse describes the condition of the disbelievers in hell. They gain a bad place of return, experiencing incomparable tribulations in hell. Every place they occupy, be it a seat, a bed, a place to rest, and so on, is a place they don't like, because in that place they are always subjected to severe torment. In another verse explaining the condition of the disbelievers in hell, Allah says: For them a sleeping mat from the fire of hell and on them is a blanket (fire of hell). Thus We recompense the wrongdoers. (al-A.'raf\/7: 41)"
		   },
		   {
			"id": 4027,
			"surah": 38,
			"ayat": 57,
			"tafsir": "Allah reveals to the disbelievers in hell, \"O disbelievers, this is the doom that I promised before, so you feel how heavy and painful the punishment is, drink in hell that boiling hot water that burns your mouth and intestines. your intestines or the rotten pus that flows from the bodies of the very cold inhabitants of hell. Apart from that you all will feel other punishments that you yourself do not know the form of punishment, besides you will only feel extraordinary misery.\" The Messenger of Allah said: From Abu Sa'id al-Khudri, from the Prophet saw, he said, \"If a bucket of drink from the inhabitants of hell is spilled in the world, then all the inhabitants of the world will stink. (History of al-hakim) If you pay attention to the verses this verse and it is connected with the previous verses as if this verse is a counterbalance to God's words to the people of heaven. hell is told to feel boiling hot water and flowing pus. This means that the people of heaven get everything they ask for and want, while the people of hell are told to do something they don't want. If people who believe in heaven get angels who don't wild in sight and as old as their age, then the inhabitants of hell will receive a variety of punishments that are very heavy and painful."
		   },
		   {
			"id": 4028,
			"surah": 38,
			"ayat": 58,
			"tafsir": "Allah reveals to the disbelievers in hell, \"O disbelievers, this is the doom that I promised before, so you feel how heavy and painful the punishment is, drink in hell that boiling hot water that burns your mouth and intestines. your intestines or the rotten pus that flows from the bodies of the very cold inhabitants of hell. Apart from that you all will feel other punishments that you yourself do not know the form of punishment, besides you will only feel extraordinary misery.\" The Messenger of Allah said: From Abu Sa'id al-Khudri, from the Prophet saw, he said, \"If a bucket of drink from the inhabitants of hell is spilled in the world, then all the inhabitants of the world will stink. (History of al-hakim) If you pay attention to the verses this verse and it is connected with the previous verses as if this verse is a counterbalance to God's words to the people of heaven. hell is told to feel boiling hot water and flowing pus. This means that the people of heaven get everything they ask for and want, while the people of hell are told to do something they don't want. If people who believe in heaven get angels who don't wild in sight and as old as their age, then the inhabitants of hell will receive a variety of punishments that are very heavy and painful."
		   },
		   {
			"id": 4029,
			"surah": 38,
			"ayat": 59,
			"tafsir": "The angels say to the disbelievers who have entered hell earlier when they chase away the large group of disbelievers, \"Here is the other group that was driven into hell so that they may live in it with you.\" The group that had previously entered hell, saw the new group that was being herded, said, \"That is a large group that will live in hell with us, so accidents will befall them as well as accidents that have befallen us and them.\" will be burned to the ground like us.\""
		   },
		   {
			"id": 4030,
			"surah": 38,
			"ayat": 60,
			"tafsir": "Hearing these words, the group that was being led by the angel replied, \"Actually, you are the one who deserves more harm, because you were the one who misled us before, and you were the one who always invited and encouraged us to do the works that resulted in us going to hell.\" In another verse, Allah says: Allah says, \"Enter the fires of hell with a group of jinn and humans who have preceded you. Every time a people enters, he curses his brother¦ (al-A.'raf\/7: 38 ) It's different with the inhabitants of heaven, every time a group enters it, they are always greeted with joy and joy, in an atmosphere of brotherhood and affection, and they are said \"greetings\". There is a big difference between the acceptance of believers when they enter heaven with the acceptance of unbelievers when they go to hell."
		   },
		   {
			"id": 4031,
			"surah": 38,
			"ayat": 61,
			"tafsir": "Even the inhabitants of hell who have just come pray to God to add a severe punishment to those who have led them astray by saying, \"O our Lord, inflict multiple punishments on our leaders and religious leaders who have caused we suffer because of this severe punishment. Another verse that is equivalent to this verse says Allah: ¦Our Lord, they have led us astray. multiplied, but you do not know. (al-A.'raf\/7: 38)"
		   },
		   {
			"id": 4032,
			"surah": 38,
			"ayat": 62,
			"tafsir": "The disbelievers asked each other, after they did not see any believers whom they despised while in the world, \"Why don't we see anyone from the people who in the world we view as stupid, evil, and a contemptible person in whom there is no good.\" Ibn 'Abbas said, \"What they mean by stupid and evil people are the companions of the Apostle. Abu Jahl said, 'Where is Bilal, where is Shuhaib, where is Ammar, they are all in heaven. Poor Abu Jahal, his sons 'Ikrimah and Juwairiyah converted to Islam, so did his mother, his brothers, while he himself was a disbeliever.\""
		   },
		   {
			"id": 4033,
			"surah": 38,
			"ayat": 63,
			"tafsir": "Then they asked each other, \"Is it because we ridiculed and made fun of while in the world, so they don't go to this hell, while they are people who don't deserve to be ridiculed and made fun of. Or have they actually entered together? with us into hell, but we did not see them.\" Such is the condition of the disbelievers in hell, they wrongly blame each other, accuse each other, they even fight with each other."
		   },
		   {
			"id": 4034,
			"surah": 38,
			"ayat": 64,
			"tafsir": "In this verse Allah confirms that everything that is told will really happen, there is no doubt about it. Those disbelievers will always fight among themselves in hell later."
		   },
		   {
			"id": 4035,
			"surah": 38,
			"ayat": 65,
			"tafsir": "Allah ordered His Messenger to convey to the polytheists of Mecca that he was Allah's messenger who conveyed His promises and threats to mankind. His threat is a painful punishment that will be meted out to those who violate His commands as it has been inflicted on people before, such as the people of 'Ad, Samud, and so on. Furthermore Rasulullah saw stated that he was only a news giver and not a sorcerer as they accused and not a liar either. He is not someone who has power over humans, as explained in the word of Allah: So give a warning, because you (Muhammad) are only a warner. You are not the one who has power over them. (al-Gasyiyah\/88: 21-22) Allah explains the duties of an apostle and the limits of his abilities. He explained the teachings that must be conveyed to unbelievers, namely: There is no God who has the right to be worshiped except Allah, God Almighty, without partners for Him."
		   },
		   {
			"id": 4036,
			"surah": 38,
			"ayat": 66,
			"tafsir": "He is the God that no one can match. God Almighty, Almighty, Almighty, controls, regulates, supervises, and maintains the continuity of everything in the heavens and the earth. He is God, the Most Forgiving of all the sins of His servant."
		   },
		   {
			"id": 4037,
			"surah": 38,
			"ayat": 67,
			"tafsir": "The Prophet Muhammad was ordered to tell polytheists that the news about Allah's messenger or messenger who gave warning to people and the news of His oneness and power, is news that is of great benefit to all humans. This news can save people from going astray, can show people the straight path, the path to happiness in life in this world and the hereafter. However, most people do not want to understand and even they turn away from Allah's religion."
		   },
		   {
			"id": 4038,
			"surah": 38,
			"ayat": 68,
			"tafsir": "The Prophet Muhammad was ordered to tell polytheists that the news about Allah's messenger or messenger who gave warning to people and the news of His oneness and power, is news that is of great benefit to all humans. This news can save people from going astray, can show people the straight path, the path to happiness in life in this world and the hereafter. However, most people do not want to understand and even they turn away from Allah's religion."
		   },
		   {
			"id": 4039,
			"surah": 38,
			"ayat": 69,
			"tafsir": "Furthermore, the Prophet was ordered by Allah to declare to the polytheists of Mecca that if Allah had not sent down revelations to him, surely he would not have known about the angels who were always submissive and obedient to Allah. Nor would he know of the conversation that the angels, Satan, and Adam had before God. Angels and Adam submit and obey Allah, while the Devil disobeys and disobeys Him. At the end of this verse, the Prophet emphasized again the task given by Allah, \"I am only a messenger who gives instructions and warnings, not someone who can force people to convert to Islam.\""
		   },
		   {
			"id": 4040,
			"surah": 38,
			"ayat": 70,
			"tafsir": "Furthermore, the Prophet was ordered by Allah to declare to the polytheists of Mecca that if Allah had not sent down revelations to him, surely he would not have known about the angels who were always submissive and obedient to Allah. Nor would he know of the conversation that the angels, Satan, and Adam had before God. Angels and Adam submit and obey Allah, while the Devil disobeys and disobeys Him. At the end of this verse, the Prophet emphasized again the task given by Allah, \"I am only a messenger who gives instructions and warnings, not someone who can force people to convert to Islam.\""
		   },
		   {
			"id": 4041,
			"surah": 38,
			"ayat": 71,
			"tafsir": "In this verse it is explained that the angels and demons asked God questions after He told the angels that he would create a man from dust. Their statement regarding the benefits of the existence of humans that God will create. This question is explained in the word of Allah: And (remember) when your Lord said to the angels, \"I will make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Regarding the creation of humans from soil, it is explained here that based on scientific studies the material for human creation is soil, which is called more precisely in this verse, namely clay. The term clay is usually used to name the smallest grains of soil, with a diameter of under 0.5 microns (= 1\/2000 mm). The term clay is also commonly used to name the type of mineral that forms the smallest soil grains. Because of its small size, when put in water, clay is colloidal: it does not dissolve but is evenly distributed and difficult to separate from the water. As a mineral, clay is a group of hydrated alumino-silicates with a sheet structure. Due to its structure, clay particles have an electrical charge. The properties of other clay minerals are plastic, but this plasticity disappears when heated to a certain temperature because the mineral structure changes. The traditional use of clay is based on its physical properties, among others because it is easily shaped and hardens when heated, so it is commonly used as a material for pottery or pottery and ceramics. Modern use of clay is based more on its chemical-physical properties, generally used as a catalyst in chemical reactions. Because of its chemical-physical properties, clay is the part of the soil that is most likely to have played a major role in the early formation of life on earth, including the creation of humans (see also al-An'am\/6: 2, Fathir\/35: 11; al-hijr\/15: 26-28-33; al-Mu'minun\/23: 12, 14; ash-shaffat\/37: 11)"
		   },
		   {
			"id": 4042,
			"surah": 38,
			"ayat": 72,
			"tafsir": "God told the angels that when He had perfected the creation of man and breathed a spirit into his body, they were commanded to bow down to Adam, as a sign of respect for him. This verse explains one of the processes by which Adam was created, namely from the ground. The angels bowed down in honor of him, because he obeyed Allah, except for Satan. He was reluctant to respect Adam, so he was a creature that disobeyed God. Satan's defiance of the order to prostrate to Adam has been mentioned in his words: And (remember) when We said to the angels, \"Protect yourself to Adam!\" So they bowed down except for Iblees. He refuses and boasts, and he is among those who disbelieve. (al-Baqarah\/2: 34)"
		   },
		   {
			"id": 4043,
			"surah": 38,
			"ayat": 73,
			"tafsir": "God told the angels that when He had perfected the creation of man and breathed a spirit into his body, they were commanded to bow down to Adam, as a sign of respect for him. This verse explains one of the processes by which Adam was created, namely from the ground. The angels bowed down in honor of him, because he obeyed Allah, except for Satan. He was reluctant to respect Adam, so he was a creature that disobeyed God. Satan's defiance of the order to prostrate to Adam has been mentioned in his words: And (remember) when We said to the angels, \"Protect yourself to Adam!\" So they bowed down except for Iblees. He refuses and boasts, and he is among those who disbelieve. (al-Baqarah\/2: 34)"
		   },
		   {
			"id": 4044,
			"surah": 38,
			"ayat": 74,
			"tafsir": "God told the angels that when He had perfected the creation of man and breathed a spirit into his body, they were commanded to bow down to Adam, as a sign of respect for him. This verse explains one of the processes by which Adam was created, namely from the ground. The angels bowed down in honor of him, because he obeyed Allah, except for Satan. He was reluctant to respect Adam, so he was a creature that disobeyed God. Satan's defiance of the order to prostrate to Adam has been mentioned in his words: And (remember) when We said to the angels, \"Protect yourself to Adam!\" So they bowed down except for Iblees. He refuses and boasts, and he is among those who disbelieve. (al-Baqarah\/2: 34)"
		   },
		   {
			"id": 4045,
			"surah": 38,
			"ayat": 75,
			"tafsir": "God said to the Devil, \"O Devil, what causes you to refuse to bow down to respect Adam, the creature that I created myself with My power? I created Adam myself, not My creatures who created it. Why are you being arrogant and arrogant. you feel yourself higher and more respected among the creatures that I have created, so you think that you have the right and authority to do what you want?\" Satan answered and gave the reason for his defiance. He said that he was better than Adam because God made him from fire, while Adam from the ground. According to the Devil, fire is better than earth because the nature of fire is always up and the ground is always below. In fact, the origin material cannot be used as an indicator of the glory of a creature. That glory depends on obedience and obedience to God. The conversation above is mentioned in the word of Allah: (Allah) said, \"What prevented you (so) you did not prostrate (to Adam) when I ordered you to?\" (Satan) replied, \"I am better than him. You created me from fire, while you created him from clay.\" (al-A.'raf\/7: 12)"
		   },
		   {
			"id": 4046,
			"surah": 38,
			"ayat": 76,
			"tafsir": "God said to the Devil, \"O Devil, what causes you to refuse to bow down to respect Adam, the creature that I created myself with My power? I created Adam myself, not My creatures who created it. Why are you being arrogant and arrogant. you feel yourself higher and more respected among the creatures that I have created, so you think that you have the right and authority to do what you want?\" Satan answered and gave the reason for his defiance. He said that he was better than Adam because God made him from fire, while Adam from the ground. According to the Devil, fire is better than earth because the nature of fire is always up and the ground is always below. In fact, the origin material cannot be used as an indicator of the glory of a creature. That glory depends on obedience and obedience to God. The conversation above is mentioned in the word of Allah: (Allah) said, \"What prevented you (so) you did not prostrate (to Adam) when I ordered you to?\" (Satan) replied, \"I am better than him. You created me from fire, while you created him from clay.\" (al-A.'raf\/7: 12)"
		   },
		   {
			"id": 4047,
			"surah": 38,
			"ayat": 77,
			"tafsir": "Because of the iniquity of Satan who was reluctant to obey God's commands, God expelled Satan from heaven, and made him a cursed creature. The curse remains in effect until the Day of Judgment, which is the day of retribution for all human actions. Allah's Word: (Allah) said, \"Then come down from it (heaven); for you should not boast in it. Come out! Indeed, you are among the despicable creatures.\"(al-A.'raf\/7: 13)"
		   },
		   {
			"id": 4048,
			"surah": 38,
			"ayat": 78,
			"tafsir": "Because of the iniquity of Satan who was reluctant to obey God's commands, God expelled Satan from heaven, and made him a cursed creature. The curse remains in effect until the Day of Judgment, which is the day of retribution for all human actions. Allah's Word: (Allah) said, \"Then come down from it (heaven); for you should not boast in it. Come out! Indeed, you are among the despicable creatures.\"(al-A.'raf\/7: 13)"
		   },
		   {
			"id": 4049,
			"surah": 38,
			"ayat": 79,
			"tafsir": "After becoming a cursed creature, the Devil begged Allah, \"O my Lord, if You have made me Your creature who is accursed and far from Your grace, then I ask that my life be extended, until the day of resurrection later. Do not leave I am as long as the world exists.\""
		   },
		   {
			"id": 4050,
			"surah": 38,
			"ayat": 80,
			"tafsir": "Allah granted the Devil's request by letting him live until the appointed time, as Allah said: (Devil) replied, \"Give me a reprieve, until the day they are resurrected.\" (Allah) said, \"Yes, you are among those given a reprieve.\" (al-A.'raf\/7: 14-15)"
		   },
		   {
			"id": 4051,
			"surah": 38,
			"ayat": 81,
			"tafsir": "Allah granted the Devil's request by letting him live until the appointed time, as Allah said: (Devil) replied, \"Give me a reprieve, until the day they are resurrected.\" (Allah) said, \"Yes, you are among those given a reprieve.\" (al-A.'raf\/7: 14-15)"
		   },
		   {
			"id": 4052,
			"surah": 38,
			"ayat": 82,
			"tafsir": "Furthermore, the Devil begged again, \"O my Lord, for the sake of Your power and glory, give me the opportunity to tempt and mislead people from Your way, by making them look good at the bad deeds and immorality they are doing.\""
		   },
		   {
			"id": 4053,
			"surah": 38,
			"ayat": 83,
			"tafsir": "Furthermore, Satan said, \"Surely those of Your servants who are strong in faith, who are submissive and obedient to You, I cannot seduce and lead astray. Only disbelievers like me and those whose faith is weak I may lead astray.\""
		   },
		   {
			"id": 4054,
			"surah": 38,
			"ayat": 84,
			"tafsir": "Allah granted the Devil's request and said, \"The right is with Me. Indeed, the right is I say. I filled Hell with you and your descendants who came later and who followed you in error from some of Adam's children and grandchildren. Allah threaten those who make satan as their leaders and ignore Allah's commandments that lead them to happiness in this world and the hereafter, Allah says: and I will certainly lead them astray, and I will awaken empty dreams in them and I will order them to cut off their ears livestock ears, (then they actually cut it off), and I will order them to change the creation of Allah, (then they really change it). Whoever makes Satan as a protector besides Allah, then indeed, he suffers a real loss.(an -Nisa'\/4: 119)"
		   },
		   {
			"id": 4055,
			"surah": 38,
			"ayat": 85,
			"tafsir": "Allah granted the Devil's request and said, \"The right is with Me. Indeed, the right is I say. I filled Hell with you and your descendants who came later and who followed you in error from some of Adam's children and grandchildren. Allah threaten those who make satan as their leaders and ignore Allah's commandments that lead them to happiness in this world and the hereafter, Allah says: and I will certainly lead them astray, and I will awaken empty dreams in them and I will order them to cut off their ears livestock ears, (then they actually cut it off), and I will order them to change the creation of Allah, (then they really change it). Whoever makes Satan as a protector besides Allah, then indeed, he suffers a real loss.(an -Nisa'\/4: 119)"
		   },
		   {
			"id": 4056,
			"surah": 38,
			"ayat": 86,
			"tafsir": "Allah ordered the Messenger of Allah to convey to polytheists that he did not expect or even ask for a reward from them as a reward for the task of conveying Allah's religion. The Apostle did not expect it in the slightest. Only Allah will reward him. People already know the apostle well that he never made things up and made up things.\" From this verse it is understood that people who believe imitate what the Messenger of Allah has done, namely always convey Allah's religion to people, although he only knew a little. Imam Muslim narrated that Ibn Mas'ud said: O people, whoever among you has knowledge, let him say it. And whoever does not know let him say, \"Allah Taala knows better.\" Allah Taala said to Rasulullah SAW, \"Qul ma'as 'alukum. . .\" to the end of the verse\"."
		   },
		   {
			"id": 4057,
			"surah": 38,
			"ayat": 87,
			"tafsir": "Allah confirms that this Qur'an contains instructions and teachings for the jinn and humans. Everyone who is of sound mind, of course, admits the truth. Al-Qur'an is a guide to the straight path and the difference between right and wrong."
		   },
		   {
			"id": 4058,
			"surah": 38,
			"ayat": 88,
			"tafsir": "At the end of this surahh, Allah conveys to those who do not heed the Prophet's call, that one day after death they will know whether their actions were wrong or right."
		   }
	]
}
