{
	"tafseer": [
		{
			"id": 4902,
			"surah": 55,
			"ayat": 1,
			"tafsir": "In this verse Allah, the Most Gracious, states that He has taught the Qur'an to Muhammad, who then taught it to his followers. This verse came down as a rebuttal for the people of Mecca who said: Indeed, the Qur'an was only taught by a human being to him (Muhammad). (an-Nahl\/16: 103) Because the contents of this verse reveal some of Allah's favors upon His servants, this surah begins by mentioning the favors that are most beneficial and have the most benefits for His servants, namely the pleasure of teaching the Qur'an. to humans. This is because humans by following the teachings of the Qur'an will be happy in this world and in the hereafter and by adhering to His instructions, their goals will be achieved in both places. Al-Qur'an is the mother of heavenly books which were revealed through Allah's best creation on earth, namely the Prophet Muhammad."
		   },
		   {
			"id": 4903,
			"surah": 55,
			"ayat": 2,
			"tafsir": "In this verse Allah, the Most Gracious, states that He has taught the Qur'an to Muhammad, who then taught it to his followers. This verse came down as a rebuttal for the people of Mecca who said: Indeed, the Qur'an was only taught by a human being to him (Muhammad). (an-Nahl\/16: 103) Because the contents of this verse reveal some of Allah's favors upon His servants, this surah begins by mentioning the favors that are most beneficial and have the most benefits for His servants, namely the pleasure of teaching the Qur'an. to humans. This is because humans by following the teachings of the Qur'an will be happy in this world and in the hereafter and by adhering to His instructions, their goals will be achieved in both places. Al-Qur'an is the mother of heavenly books which were revealed through Allah's best creation on earth, namely the Prophet Muhammad."
		   },
		   {
			"id": 4904,
			"surah": 55,
			"ayat": 3,
			"tafsir": "In this verse, Allah mentions another of His favors, namely the creation of human beings. That pleasure is the foundation of other blessings. After Allah declared the favor of teaching the Qur'an in the last verse, then in this verse He created the best type of His creatures, namely humans and taught Him to be good at expressing what is etched in his heart and what is on his brain, because the ability to think and speaking that the Qur'an can be taught to mankind. Humans are God's most perfect creatures. He made him upright, so that his hands fell off. With free hands, the brain is free to think, and the hands can realize what the brain is thinking. The brain produces knowledge, and the hands produce technology. Science and technology are civilizations, thus only humans have civilizations. The tongue is an organ located in the oral cavity. This organ, which is a muscular structure consisting of seventeen muscles, has several functions. Taste function is one of the main functions of the tongue. There are about 10,000 taste buds on the tongue. The tongue also functions to help regulate sounds for communication. The tongue, in religion, is almost always associated with the heart, and is used to measure the merits of one's behavior. Humans will be good if both are good. And humans will be bad, if both are bad. The Prophet Muhammad pointed to the tongue as the main factor that brings disaster to human beings, and it is a benchmark for other parts of the body. He said in his hadith: Don't people turn their faces upside down in hell because of their tongues? (History of at-Tirmidhi and Ibn Majah) If humans wake up in the morning, then all their limbs alert the tongue and order, \"Take fear of Allah regarding us, because we are none other than you. If you are straight, we are straight, and if you crooked, we are crooked.\" (History at-Tirmidhi) To be able to make different sounds, or what is called speaking, the tongue cooperates with several other organs, such as the lips, oral cavity, lungs, esophagus, and vocal cords. We can communicate by speaking, after all people agree on the meaning of a sound. Then the sounds whose meanings have been agreed upon are combined in the right order to form sentences. In the next stage, a language will be created. Language is described in one of Allah's verses thus: And among His signs (greatness) is the creation of the heavens and the earth, the difference in your language and the color of your skin. Verily, in that there are signs for those who know. (ar-Rum\/30: 22)"
		   },
		   {
			"id": 4905,
			"surah": 55,
			"ayat": 4,
			"tafsir": "In this verse, Allah mentions another of His favors, namely the creation of human beings. That pleasure is the foundation of other blessings. After Allah declared the favor of teaching the Qur'an in the last verse, then in this verse He created the best type of His creatures, namely humans and taught Him to be good at expressing what is etched in his heart and what is on his brain, because the ability to think and speaking that the Qur'an can be taught to mankind. Humans are God's most perfect creatures. He made him upright, so that his hands fell off. With free hands, the brain is free to think, and the hands can realize what the brain is thinking. The brain produces knowledge, and the hands produce technology. Science and technology are civilizations, thus only humans have civilizations. The tongue is an organ located in the oral cavity. This organ, which is a muscular structure consisting of seventeen muscles, has several functions. Taste function is one of the main functions of the tongue. There are about 10,000 taste buds on the tongue. The tongue also functions to help regulate sounds for communication. The tongue, in religion, is almost always associated with the heart, and is used to measure the merits of one's behavior. Humans will be good if both are good. And humans will be bad, if both are bad. The Prophet Muhammad pointed to the tongue as the main factor that brings disaster to human beings, and it is a benchmark for other parts of the body. He said in his hadith: Don't people turn their faces upside down in hell because of their tongues? (History of at-Tirmidhi and Ibn Majah) If humans wake up in the morning, then all their limbs alert the tongue and order, \"Take fear of Allah regarding us, because we are none other than you. If you are straight, we are straight, and if you crooked, we are crooked.\" (History at-Tirmidhi) To be able to make different sounds, or what is called speaking, the tongue cooperates with several other organs, such as the lips, oral cavity, lungs, esophagus, and vocal cords. We can communicate by speaking, after all people agree on the meaning of a sound. Then the sounds whose meanings have been agreed upon are combined in the right order to form sentences. In the next stage, a language will be created. Language is described in one of Allah's verses thus: And among His signs (greatness) is the creation of the heavens and the earth, the difference in your language and the color of your skin. Verily, in that there are signs for those who know. (ar-Rum\/30: 22)"
		   },
		   {
			"id": 4906,
			"surah": 55,
			"ayat": 5,
			"tafsir": "Allah mentions that the sun and the moon, which are among the largest celestial bodies, revolve in their respective orbits which are very definite, because of this, the seasons change. By taking into account these changes humans can regulate agriculture, trade, education and so on. Many verses in the Qur'an mention and explain about the pair of sun and moon. The sun is a bright source of burning light (wahhaj) due to nuclear reactions in it. While the moon is only a reflector of the light it receives from the sun, it has a shining bright surface (munir). The sun and moon along with other heavenly bodies are not silent. They move in space on their respective paths (orbits) as Allah says in surahh adhdzariyat\/51:7. The path in question is the orbit of the heavenly bodies, including the sun and moon. In physics, the orbit of a celestial body is called an orbit, which is the path or trajectory that is passed by a celestial body, around another celestial body, under the influence of certain forces. Orbits were first analyzed mathematically by Johannes Kepler who formulated the results of his calculations in Kepler's laws of planetary motion. He discovered that the orbits of the planets in our solar system were ellipses and not circular or epicycle as was previously believed. In 1601 Kepler tried to match the various shapes of geometric curves to existing data on the position of Mars. It wasn't until 1606, after nearly a year just trying to find a solution to a difference of 8 arc minutes (perhaps to most people this would be negligible), Kepler got the orbit of Planet Mars. According to Kepler, elliptical paths are the most suitable for the orbits of planets around the sun. In 1609 he published Astronomia Nova which stated the two laws of planetary motion. The movements of these celestial bodies are completely controlled and all must move in a calculated orbit. If not what will happen is a collision which means fatal destruction. It should be noted that the moon revolves around the earth in 29.53059 days. This time is the moon's orbit relative to the earth without including elements of the earth's circulation to the sun. If you include the elements of the relative movement of the moon and sun to all the stars in nature, the duration of the earth's circulation is not 24 hours but 23 hours 56 minutes 4 seconds and the moon's orbit around the earth is 27.321661 days or 86164.0906 seconds. A fantastic number, Subhanallah. This is confirmed again in His words in surahh Yasin 36: 38, 40 and surahh al-Anbiya'\/21: 33. Earth and other planets in this solar system move in their respective orbits around the sun. The sun in its orbit also moves around a larger system, namely the Milky Way galaxy, and so on. But none of the stars, planets and other heavenly bodies in space move uncontrollably or cross other orbits or collide with each other. It is clear that fate has paid close attention to the harmony between creation and movement. In this vast sky, the movement of every celestial body is not one hair off the mark or one second too late. The Qur'an hints at the harmonious movement of the celestial bodies in the universe, this is stated in adhdzariyat\/51:7"
		   },
		   {
			"id": 4907,
			"surah": 55,
			"ayat": 6,
			"tafsir": "Allah states that shrubs, and branched trees, both submit to His will instinctively, as humans are subject to nature. The difference between plants and trees in shape and form, color and taste, all of that is due to obedience and submission to the power that created Him."
		   },
		   {
			"id": 4908,
			"surah": 55,
			"ayat": 7,
			"tafsir": "Allah states that He created the heavens where His orders and prohibitions were sent down to His servants, where the angels descended to bring His revelations to His prophets. In addition, He wanted a balance in all things. Among them is the balance of faith, namely monotheism in Him, because monotheism is the middle between denying the existence of Allah by associating partners with Him for granted, Balance in worship, in charity and in character, balance in spiritual and physical strength and so on. Such is the balance and justice that He wants by not allowing something because it is small and not giving importance to others because of its size. His Balance includes all that exists in this nature."
		   },
		   {
			"id": 4909,
			"surah": 55,
			"ayat": 8,
			"tafsir": "Allah states that He does this so that humans do not exceed and overstep the boundaries of justice and the smooth running of things according to the balance that has been determined for everything, then in this way the condition of humans will improve, morals and deeds will be more noble and orderly."
		   },
		   {
			"id": 4910,
			"surah": 55,
			"ayat": 9,
			"tafsir": "Allah commands humans to uphold the scales fairly and not to cheat. This shows that humans must pay attention to the fair balance in all their deeds and words. In the Qur'an Allah not only informs people about His creation, but also gives indications for making use of all creation for the welfare of mankind. In relation to the sun and moon, Allah gave very clear instructions that these two celestial bodies would be very useful as a benchmark. It is said that the circulation of the two celestial bodies has a calculation. Science then uses this regularity to be used as a time marker or calendar. The instructions are also in the following two verses: And He has subjected the sun and the moon to you which are constantly circulating (in their orbits); and have subjected the night and the day to you. (Ibrahim\/14: 33) Indeed, the number of months according to Allah is twelve months, (as) in Allah's decree when He created the heavens and the earth, among which there were four forbidden months. That is the (statutory) of the straight religion, so do not wrong yourself in that (fourth month), and fight all the polytheists as they also fight you all. And know that Allah is with those who are pious. (at-Taubah\/9: 36) Humans have been given instructions to divide time and calendar clearly. In modern astronomy, what is called a year in the calculation of the Solar Calendar is the period of time needed by the earth to make one rotation in its orbit around the sun. The time required is 365 days, 5 hours, 48 minutes, 46 seconds. Or about 365.25 days less 1 minute 14 seconds. If one Solar month is about 30 days. Meanwhile, one year in the calculation of the Lunar Calendar is one period of 12 Lunar months. If a Lunar month (the period it takes the moon to revolve around the earth) is 29.5 days, then a Lunar year is 354 days. The history of human civilization in making calendars shows different numbers. The ancient Romans divided the year into 10 months. In the Pre-Julius Caesar period, it was corrected and it became 12 months. Then refined again by Pope Gregory XIII (Gregorian Calendar) and used as the modern calendar used today. Calendars have also been used in older civilizations. The Akkadians, Sumerians, Babylonians, Assyrians, Jews, Indians and Chinese assigned 12 months of the year. Meanwhile, the Greeks counted 10 months in a year. The Aztecs, Mayans and Incas in South America, divided a year into 13 months, with 20 days per month. In one of the above verses there is the word \"subdue\". This suggests that humans use reason in utilizing the two celestial bodies. Here was contained an order to develop technology. One way is to use the regularity of the sun's and moon's orbits for the construction of the calendar and timekeeping. It is He who makes the sun shine and the moon shine, and it is He who determines the places of their orbits, so that you may know the number of years and the reckoning (time). Allah did not create that way but correctly. He explains the signs (His greatness) to those who know. (Yunus\/10: 5) The orbits of the sun, moon and earth are well known. But that the sun also has its own orbital trajectory was only discovered by modern astronomers and astrophysicists in the last half of the 20th century. The sun orbits the galactic center on the outskirts of the Milky Way's galactic disk. The diameter of the disk of this galaxy is 3 x 107 km. The time it takes the sun to circle the center of the galaxy is 250 million years. Especially for surahh at-Taubah\/9 verse 36 above, it reminds us of the four sacred months (the months of Muharram, Rajab, Zulkaidah and Zulhijah). These four months have been sanctified by the people of the Middle East since the time of the Prophet Abraham."
		   },
		   {
			"id": 4911,
			"surah": 55,
			"ayat": 10,
			"tafsir": "Allah explained that He flattened the earth for the habitat of animals, and all kinds that have a spirit and on that earth a place of life to be able to take advantage of the things on the surface of the earth and what is in their stomachs,"
		   },
		   {
			"id": 4912,
			"surah": 55,
			"ayat": 11,
			"tafsir": "Allah informs that on this earth there are various materials that can be used as food from various kinds of fruits, both eaten after they are ripe from the tree or after being cooked neatly, both from the fruits after they have been dried or when they are still wet. Then Allah said, the palm trees that had a sash wrapping their fruit when he came out. This date is specifically called because it is grown in Arab land and has many benefits. The fruit is good to eat when it is still young and after it is ripe, both wet and after it has been dried. Uses can also be taken from all the trees, such as the leaves for baskets and mats, the husks for ropes, the fronds for roofs, and the stems for poles. Of the several benefits mentioned, this type of date is specifically mentioned among other fruits."
		   },
		   {
			"id": 4913,
			"surah": 55,
			"ayat": 12,
			"tafsir": "In this verse Allah states that all grains that are used as food ingredients, such as wheat, rice and barley have leaves that cover their clusters, as well as all that smells good from plants."
		   },
		   {
			"id": 4914,
			"surah": 55,
			"ayat": 13,
			"tafsir": "Allah challenges humans and jinn; which of the blessings they have tasted do they deny. What is meant by the denial of these blessings is their disbelief towards their Lord, because they associate their gods with Allah. In worship is evidence of their disbelief in their god, because for these blessings one must be thankful, while gratitude means worshiping those who give them favors. This verse is repeated in this surahh thirty-one times to reinforce the existence of blessings and to warn them. From that, while Allah mentions one by one of these blessings, He separates them with the words of warning and strengthening about the existence of these blessings. This arrangement of words is common in Arabic, so it has become a custom for a person to say to a friend who has received his kindness, but he denies it. \"Didn't you used to be poor, then I helped you to be affluent? Did you deny it? Didn't you used to be undressed, so I gave you clothes; did you deny it? Weren't you previously unknown, then I raised your rank, then you became known, did you deny it? \" It's as if Allah swt said, \"Didn't I create man, teach him to speak fluently, I make the sun and moon rotate according to calculations. I make all kinds of wood. port for those who believe and disbelieve in Me, sometimes I water it with rain water, sometimes with river water and canals; do you, O people and jinn, deny that?\""
		   },
		   {
			"id": 4915,
			"surah": 55,
			"ayat": 14,
			"tafsir": "This verse explains that God created the first human Prophet Adam from dry soil like pottery, and hard like clay that has been baked. In the Qur'an there are many verses that mention that man was created from clay and others say that he was created from clay and here it is mentioned dry soil like pottery. The clay is baked over hot coals to keep it together, not torn apart. Likewise, humans have an appetite to eat and drink, have an appetite to marry so that their body can be maintained and can continue their life, and have children. He has a passion for anger that makes him brave and strong to maintain his survival and defend himself from the dangers that threaten him and the attacks of the enemies around him. This human strength is as if the same as clay that has been cooked to become dry soil whose parts are firmly attached. If it were not for these things, surely he would not be able to defend himself from danger and from his enemies, from other humans or wild animals, so he would be crushed into pieces to become food for birds and animals, like uncooked soil. scattered by the wind. The creation of humans from soil has been much discussed in previous verses, including in verses: al-hijr\/15: 26 (from black mud), al-hijr\/15: 28 (dry clay), ar-Rum\/ 30: 20 (from the ground), Fathir\/35: 11 (from the ground), shad\/38: 71 (clay), Gafir\/40 (from the ground), while in surahh al-Furqan\/25: verse 54 it is stated that humans created from water. From the various statements of the verses above about the material for human creation, there are two ingredients, namely water and soil. While the type of soil that is often described is clay, a type of soil composed of very fine particles, with a particle size of less than 2 microns in diameter. This type of soil has physical properties that are plastic when it contains water. Chemically, a solution of clay in water has a cation exchange capacity, that is, it can bind ions or other electrically charged chemical compounds, but the bonds are not too strong so that the bound ions can be changed easily. This type of soil is also commonly used as a material for making pottery. While very little is known about the process of its creation (see Tafsir al-Hijr\/15: 26 and 28)."
		   },
		   {
			"id": 4916,
			"surah": 55,
			"ayat": 15,
			"tafsir": "In this verse Allah explains that if the first human was created from the ground, then the first jinn or demons are different, he was made from fire (from the flame), from the flame which joins with the others; of flames that are yellow-red and greenish in color. As humans are made from various soils. These verses remind us that Adam was created through the process of first being made of clay, then mud which was formed later from dry earth like pottery."
		   },
		   {
			"id": 4917,
			"surah": 55,
			"ayat": 16,
			"tafsir": "This verse shows the abundant blessings that Allah has given to His creatures, both from the jinn and humans, but why do they deny it. In connection with this verse, Ibn 'Umar said: The Messenger of Allah recited surahh ar-Rahman or the surah was read to him, then he said, \"Why do I hear that the jinn answer better to their Lord than you?\" They asked, \"What is that, O Messenger of Allah?\" He explained about their (jinn) answers when I read the word of Allah, \"Then which of the favors of your Lord do you deny?\" So they said, \"There is nothing from God's favor that we deny.\" (History of Ibn Jarir from Ibn 'Umar)"
		   },
		   {
			"id": 4918,
			"surah": 55,
			"ayat": 17,
			"tafsir": "This verse explains about the circulation of the sun and the moon, that it is He who created them and who regulates their circulation according to precise calculations. God maintains two sunrises, two sunsets and summer and winter. The change in Index 687 causes summer, winter, spring and autumn and also causes changes in the air which results in changes in rainfall, changes in trees and plants and rivers. The \"Two Easts\" and \"Two Wests\" written in the verse above relate to the spherical shape of the earth. Because, only on objects that are shaped like a ball can this happen (two east and two west). In reality, indeed the earth has two points where the sun rises and two points where the sun sets. Here, Allah's verses and science again agree with each other. The explanation is this: \"When the sun rises at one point on one side of the earth, then at the same time the sun will set on the other side of the earth. When the sun sets on one side of the earth, return, at the same time, on the other side of the earth, the sun is rising. Thus, in fact, it is true that there are two points where the sun rises, and at the same time, there are two points where the sun sets.\" Such a situation was reported by astronauts when they looked at the earth from space. The Qur'an describes this in such a way as if the concept of a spherical earth was already known to mankind at that time. While in fact it is not so. The spherical shape of the earth can also be seen in several other verses, such as the two verses below: Have you not seen that Allah causes the night to enter into the day and causes the day to enter into the night and He subdues the sun and the moon, each one rotating until specified time. Verily, Allah is All-Seer of what you do. (Luqman\/31: 29) He created the heavens and the earth with the right (purpose); He causes the night to become the day and the day to the night, and subdues the sun and the moon, each running according to its appointed time. Keep in mind! He is the Most Glorious, Most Forgiving. (az-Zumar\/39: 5) Currently, we can see on the globe (globe) a picture of the earth which has a shape like a ball. In fact, 1400 years ago, the Qur'an already gave such an indication. The two verses above, using parables, have explained the shape of the earth. At a time when people in Europe still believed that the earth was flat, students at universities in the Islamic world had studied the earth using a globe. Because the Al-Quran was not revealed as science, there is no specific statement in it that the shape of the earth is round like a ball. However, from several verses, people began to think that the shape of the earth is like a ball. For example in surahh Luqman\/31 verse 29. Another verse, surahh az-Zumar\/39 verse 5 shows how Allah \"rolls up\" the day with the night. The word \"roll\" in the verse above is a translation of the Arabic word \"kawwara\", which is used to describe a person wrapping a turban around his head. To understand more clearly about the two verses above, do an experiment at home. The tools needed are a globe and a flashlight. Take these two tools to a dark room. Illuminate the globe with a flashlight from one side. The light from this flashlight will act like sunlight. Then it will appear that some parts of the world will be light, and other parts dark. Then rotate the globe slowly, just as the earth rotates on its axis. Watch as the globe rotates, then the sun's rays will continuously begin to illuminate the previously dark part of the earth. So is dark. He will slowly replace the light in other parts of the earth. The verse below also talks about the shape of the earth: God (who cares for) the two easts and God (who cares for) the two west. So which of the favors of your Lord do you deny? (ar-Rahman\/55: 17-18) When humans believed that the earth was flat and fixed (not moving), the Qur'an had already revealed, explicitly or implicitly, that the earth was round. Not just round, but more detailed, that is, they are more egg-like than round. Concerning the maintenance of the places where the sun rises and sets. When humans believe that the earth is flat and still\/not moving, then the Qur'an reveals that the earth is round, through His words in the verse above. Because only an object shaped like a ball can occur, two east and two west? Sayyid Quthub thinks maybe it is the place where the sun and moon rise and where the sun and moon set. But it can also mean two different places where the sun rises in summer and winter. Likewise the two places of sunset. While Science argues that when the sun rises at one point in the hemisphere, then at the same time the sun will set, seen from the point of the other hemisphere which is far to the east. Likewise, when the sun is seen setting at a point in the hemisphere, then at the same time from the hemisphere that is far to the west, the sun is seen rising. This phenomenon is interpreted as (as if) there are two points where the sun rises and at the same time there are two points where the sun sets. Whatever the meaning of the message, something that is important to be grateful for is that Allah's maintenance of the two easts and two wests is part of His blessings in this universe? ("
		   },
		   {
			"id": 4919,
			"surah": 55,
			"ayat": 18,
			"tafsir": "In this verse, Allah challenges humans and jinns as to which of God's favors they deny. Do they deny the rain and its benefits? Or do they deny the benefits of a change of seasons in which there is a change in the crops to be planted in summer or winter? Or do they deny the privilege inherent in changes in the air that govern the feelings of humans and animals. ("
		   },
		   {
			"id": 4920,
			"surah": 55,
			"ayat": 19,
			"tafsir": "These verses explain that Allah drains salty water from nearby fresh water which then gathers into one, each does not affect the other, the salty does not affect the fresh so that the unsalted becomes salty and the salty becomes tasteless. Allah has limited between the two with a limit that has been created by His power or limited by a boundary in the form of land. Allah's Word: And it is He who let the two seas flow (side by side); this one fresh and fresh and the other very salty and bitter; and He made between them an impenetrable wall and boundary. (al-Furqan\/25: 53) The events above can be seen as rivers that flow from the mountains which eventually enter the sea and it tastes salty while the river water remains fresh. According to scientific studies, the sea has physical and chemical properties that are not homogeneous. This inhomogeneity causes the sea to move dynamically. The processes that trigger this movement are very complex and involve external forces such as wind, earth's rotation, seabed topography and the relationship between each other between the seas. The distribution of mass density which depends on the level of salt, temperature and air pressure also has an important role. Warm surface currents from the tropics flow across the equator to the North Atlantic Ocean and the Norwegian Sea, to then experience cooling. As a result of this cooling, there is an increase in mass density and the sea moves downward as an undercurrent and moves towards the South Atlantic Ocean, the Indian Ocean and towards the Pacific Ocean. This downstream flow movement is known as a thermohaline circulation pattern whose movement is often identified with a conveyor belt that moves water, temperature and other properties and materials in the ocean. What is described above is a global picture of the movement of ocean currents. In reality the movement of ocean currents is more complex. An example is what is described by Djamil (2004) which states that under the equator in the Pacific Ocean, Atlantic and Indian Ocean there are currents that move against the surface currents and are known as the Pacific Equatorial Undercurrent or also known as the Cromwell Current. This current moves to the east, which opposes the Pacific South Equatorial Current which moves west. The current, which is 150 m thick and 402 km long, and has an upper limit between 42-91 m, always moves below the equator. The sea water that moves in the Cromwell current that moves eastward opposes the westward flow and between the two there is a boundary. The boundary between these two seas is not only limited to the area mentioned above but is also found in the Strait of Gibraltar, as well as in the east of Japan. ("
		   },
		   {
			"id": 4921,
			"surah": 55,
			"ayat": 20,
			"tafsir": "These verses explain that Allah drains salty water from nearby fresh water which then gathers into one, each does not affect the other, the salty does not affect the fresh so that the unsalted becomes salty and the salty becomes tasteless. Allah has limited between the two with a limit that has been created by His power or limited by a boundary in the form of land. Allah's Word: And it is He who let the two seas flow (side by side); this one fresh and fresh and the other very salty and bitter; and He made between them an impenetrable wall and boundary. (al-Furqan\/25: 53) The events above can be seen as rivers that flow from the mountains which eventually enter the sea and it tastes salty while the river water remains fresh. According to scientific studies, the sea has physical and chemical properties that are not homogeneous. This inhomogeneity causes the sea to move dynamically. The processes that trigger this movement are very complex and involve external forces such as wind, earth's rotation, seabed topography and the relationship between each other between the seas. The distribution of mass density which depends on the level of salt, temperature and air pressure also has an important role. Warm surface currents from the tropics flow across the equator to the North Atlantic Ocean and the Norwegian Sea, to then experience cooling. As a result of this cooling, there is an increase in mass density and the sea moves downward as an undercurrent and moves towards the South Atlantic Ocean, the Indian Ocean and towards the Pacific Ocean. This downstream flow movement is known as a thermohaline circulation pattern whose movement is often identified with a conveyor belt that moves water, temperature and other properties and materials in the ocean. What is described above is a global picture of the movement of ocean currents. In reality the movement of ocean currents is more complex. An example is what is described by Djamil (2004) which states that under the equator in the Pacific Ocean, Atlantic and Indian Ocean there are currents that move against the surface currents and are known as the Pacific Equatorial Undercurrent or also known as the Cromwell Current. This current moves to the east, which opposes the Pacific South Equatorial Current which moves west. The current, which is 150 m thick and 402 km long, and has an upper limit between 42-91 m, always moves below the equator. The sea water that moves in the Cromwell current that moves eastward opposes the westward flow and between the two there is a boundary. The boundary between these two seas is not only limited to the area mentioned above but is also found in the Strait of Gibraltar, as well as in the east of Japan. ("
		   },
		   {
			"id": 4922,
			"surah": 55,
			"ayat": 21,
			"tafsir": "In this verse, Allah SWT challenges the jinn and humans to present a favor that does not come from Him. Try to imagine if salty water affects fresh water so that it becomes salty too, then of course there will be no water for humans and animals to drink, no water to water the plants so the plants die, humans and animals die of thirst and starving."
		   },
		   {
			"id": 4923,
			"surah": 55,
			"ayat": 22,
			"tafsir": "This verse explains that in the sea there are very valuable items, such as pearls and marjan from the salty and fresh seas. Both can be used as high-value and expensive jewelry."
		   },
		   {
			"id": 4924,
			"surah": 55,
			"ayat": 23,
			"tafsir": "Allah swt challenges the jinn and humans if there are blessings that do not come from Him who is in the sea, of course the jinn and humans will not deny them, especially the favors in the form of pearls and marjans."
		   },
		   {
			"id": 4925,
			"surah": 55,
			"ayat": 24,
			"tafsir": "This verse explains that it is Allah who is in control of the ships whose sails are as high as the mountains in the sea, he sails on the seas and provides benefits to humans in transporting merchandise from one country to another, food that is abundant in one place and another there is a shortage of these materials, and so on. Thus, the exchange of merchandise is carried out and human needs for food and drink are met."
		   },
		   {
			"id": 4926,
			"surah": 55,
			"ayat": 25,
			"tafsir": "This verse challenges the jinn and humans to explain the blessings they deny as follows: Who created the materials for the ark? Or how to make it? Do they think that faith in Allah is enough just to be grateful for the blessings He has given them? Did He make the sun, moon and stars, trees, herbs, and grains, rivers and seas, pearls and coral reefs for people who have no sense? Or made it for people who are good at thanking Him for the blessings He gives? And how will they thank Him if they do not know it?"
		   },
		   {
			"id": 4927,
			"surah": 55,
			"ayat": 26,
			"tafsir": "These verses explain that everything in the earth and in the sky will be destroyed and the only thing that is eternal is Allah, the Greatest and Most Glorious Substance. He is the one who remains alive forever and will not die. Therefore, humans should not be fascinated by the pleasures that exist in the world, because all of them will become extinct and disappear, humans will be held accountable for all the blessings they have obtained. Allah's Word: And do not (also) you worship other gods besides Allah. There is no god (who has the right to be worshiped) besides Him. Everything must perish, except Allah. All decisions become His authority, and only to Him you are returned. (al-Qasas\/28: 88)"
		   },
		   {
			"id": 4928,
			"surah": 55,
			"ayat": 27,
			"tafsir": "These verses explain that everything in the earth and in the sky will be destroyed and the only thing that is eternal is Allah, the Greatest and Most Glorious Substance. He is the one who remains alive forever and will not die. Therefore, humans should not be fascinated by the pleasures that exist in the world, because all of them will become extinct and disappear, humans will be held accountable for all the blessings they have obtained. Allah's Word: And do not (also) you worship other gods besides Allah. There is no god (who has the right to be worshiped) besides Him. Everything must perish, except Allah. All decisions become His authority, and only to Him you are returned. (al-Qasas\/28: 88)"
		   },
		   {
			"id": 4929,
			"surah": 55,
			"ayat": 28,
			"tafsir": "In this verse Allah challenges the jinn and humans to reveal His blessings which they deny. Try them to imagine, it is not destruction but a door to eternal life. If no one dies, life in the hereafter will be hindered. Look at human life, if they have children all the time, no one dies, then this earth will be full of people so that animals, plants, and food will no longer meet their needs and in the end there will be no other way for them except to kill their fellow humans. eventually this world will be full of human corpses."
		   },
		   {
			"id": 4930,
			"surah": 55,
			"ayat": 29,
			"tafsir": "Allah always gives life and death, and gives sustenance, glorifies and humiliates, gives sickness and heals, commands and forbids, forgives and punishes, loves and scolds His creatures. And He also gives what is requested by all that is in the heavens and on earth, as expressed in this hadith: From 'Abdullah bin Munib, he said, \"Rasulullah recited to us this verse, then we said, O Messenger of Allah, what is meant by 'business? Rasulullah said,' Forgives sins, relieves distress, elevates one group and lowers another (History of al-Bazzar, Ibn Jarir, ath-thabrani and Ibn 'Asakir)"
		   },
		   {
			"id": 4931,
			"surah": 55,
			"ayat": 30,
			"tafsir": "In this verse, Allah challenges the jinn and humans to reveal His blessings which they deny. How many requests He has granted. How many new things He created. And how many weak people He helps."
		   },
		   {
			"id": 4932,
			"surah": 55,
			"ayat": 31,
			"tafsir": "Allah explains that He will pay attention to and repay all the deeds of all humans and jinns, this verse is a very frightening threat, for all of His servants to remember on the Day of Judgment."
		   },
		   {
			"id": 4933,
			"surah": 55,
			"ayat": 32,
			"tafsir": "Allah swt challenges the jinn and humans, to reveal which blessings they deny. Is there anything they deny that the rewards they will receive on the Day of Resurrection, whether in the form of rewards or in the form of punishment, on that day there is no lie."
		   },
		   {
			"id": 4934,
			"surah": 55,
			"ayat": 33,
			"tafsir": "This verse calls on jinns and humans if they are able to penetrate, cross the corners of the heavens and the earth for fear of Allah's torment and punishment, they may try to do so, they will not be able to do so. They do not have the slightest strength in the face of the power of Allah swt. According to some commentators, the meaning of sultan in this verse is science. This shows that with science humans can penetrate space."
		   },
		   {
			"id": 4935,
			"surah": 55,
			"ayat": 34,
			"tafsir": "In this verse Allah asks jinn and humans who do evil then repent, then Allah accepts their repentance, isn't that a blessing? Before that God threatened those who did evil. Therefore which of Allah's favors do you deny?"
		   },
		   {
			"id": 4936,
			"surah": 55,
			"ayat": 35,
			"tafsir": "This verse explains that various forms of punishment will be inflicted on the jinn and humans, namely a bolt of fire or a liquid mixed with copper. They cannot escape from it."
		   },
		   {
			"id": 4937,
			"surah": 55,
			"ayat": 36,
			"tafsir": "Allah swt challenges the jinn and humans, do they still deny God's grace. Among the blessings about the threat of punishment listed in ayat 35 above has been reported in this world. If you in this world have the opportunity to do good and avoid that torment, that is a pleasure."
		   },
		   {
			"id": 4938,
			"surah": 55,
			"ayat": 37,
			"tafsir": "This verse explains that when the Day of Judgment comes, the sky will be split open and the color will be rose red like the shine of oil. Then the natural rules were broken and the stars and everything in the sky were scattered, moved from their places because of the terrible day. In other verses Allah says: When the heavens are split open, and when the stars fall and scatter. (al-Infithar\/82: 1-2) When the heavens are split open, and obey their Lord, and should obey. (al-Insyiqaq\/84: 1-2). And the heavens were torn asunder, for on that day the heavens were frail. (al-haqqah\/69: 16) The verse above talks about the universe. The universe is estimated to be between 15 and 18 billion years old. The oldest rocks ever found on earth are about 4.6 billion years old. The oldest life on earth was found to be 3.8 million years ago. Meanwhile, humans began to inhabit the earth only about 100,000 years ago. Whatever caused the formation of the universe, for sure, it is very big and great, and could not have been created by chance. What the Qur'an reveals, it seems impossible to say by someone who lived 1400 years ago. The theory regarding the \"birth\" of this universe, can only be explained by someone who is very familiar with the science of \"nuclear physics\" (nuclear physics). A scientific field that has just developed in the last few decades. How could a Muhammad at that time be able to say that the origin of the earth and all the contents of the sky from the same \"smoke\" matter. Very impossible. Verse 37 of surahh ar-Rahman above describes the explosion of a star. This picture of the star's explosion is confirmed by modern science. Such an explosion of stars cannot be seen with the naked eye. This natural phenomenon also cannot be captured using ordinary binoculars. Necessary super-sophisticated star binoculars caliber \"Huble Space Super Telescope\" owned by NASA, a United States space agency. But this was described in the Koran very clearly 1400 years ago. With advances in technology, it turns out that what is described in the Qur'an, is proven in detail. The explosion that occurred was indeed very similar to a red rose in bloom. A star explosion, also known as a supernova, is a giant star that \"self-destructs\" in a violent explosion. The core material will be scattered in all directions. The light produced in this event is thousands of times brighter than normal. Today's scientists think that supernovas played an important role in the creation of the universe. This explosion causes different elements or matter to scatter and move to other parts of the universe. It is assumed that the matter ejected from these explosions later coalesced to form new galaxies or stars in other parts of the universe. According to this hypothesis, our solar system, the sun and its planets including the earth, is a product of a supernova that occurred a long time ago. Although a supernova looks like an ordinary explosion, in reality, it is highly structured in every detail. The distances between supernovae, and indeed between all stars, are important for another reason. The distance between the stars in our galaxy is about 30 million light years. If this distance were any closer, the orbits of the planets would be unstable. If it were any further, then the dust from the supernova would be scattered so randomly that a planetary system like our own could never have formed. If the universe is to be home to life, then the twinkling of supernovae must occur at a very precise rate and the average distance between them must be very close to the distance observed today. Comparisons between supernovae and interstellar distances are just two of the finer details of the marvelous universe. If you take a closer look at the universe, then its arrangement will look so beautiful, both in design and arrangement."
		   },
		   {
			"id": 4939,
			"surah": 55,
			"ayat": 38,
			"tafsir": "In this verse Allah challenges the jinn and humans whether they still deny His grace. Allah informs everything that can cause humans to avoid all evil, so that they are finally safe from threats, that is God's grace."
		   },
		   {
			"id": 4940,
			"surah": 55,
			"ayat": 39,
			"tafsir": "This verse explains that on the day of resurrection they are not asked about sins, because those who sin can be seen by certain characteristics, when they leave their graves and are herded to Padang Mahsyar. God's Word: This is the day when they cannot speak, and they are not allowed to make excuses for them to be forgiven. (alMursalat\/77: 35- 36) Then they will be asked about their deeds with His words: So by your Lord, We will definitely ask them all, about what they have done before. (al-hijr\/15: 92-9"
		   },
		   {
			"id": 4941,
			"surah": 55,
			"ayat": 40,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. Allah also reminds us of the painful news and warnings that He has delivered, namely that humans leave and stay away from sinful acts."
		   },
		   {
			"id": 4942,
			"surah": 55,
			"ayat": 41,
			"tafsir": "This verse explains that sinners can be identified by the signs that distinguish them from other people, namely: their faces are pitch black, their eyes widen with fear. On the day of reckoning they will not hear their arguments or explanations. Their forelocks and feet are held as an insult, then dragged, put into the fires of Hell."
		   },
		   {
			"id": 4943,
			"surah": 55,
			"ayat": 42,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. Allah also reminds us of the painful news and warnings that He has delivered, namely that humans leave and stay away from sinful acts."
		   },
		   {
			"id": 4944,
			"surah": 55,
			"ayat": 43,
			"tafsir": "Allah proves His promises to those who do evil that now they have witnessed and have seen with their own eyes the punishment of God that they are waiting for; so that they feel the torment of the fire of Hell and drink boiling water, which can destroy the intestines and stomach contents of whoever drinks it. They wandered between fire and scalding boiling water. Strictly speaking, if they ask for help to be removed from the fire of hell, then they will be moved to a place where the hot water is to be drunk. As expressed in God's word as follows: When the shackles and chains were put on their necks, as they were dragged, into very hot water, then they were burned in the fire (Gafir\/40: 71-72)"
		   },
		   {
			"id": 4945,
			"surah": 55,
			"ayat": 44,
			"tafsir": "Allah proves His promises to those who do evil that now they have witnessed and have seen with their own eyes the punishment of God that they are waiting for; so that they feel the torment of the fire of Hell and drink boiling water, which can destroy the intestines and stomach contents of whoever drinks it. They wandered between fire and scalding boiling water. Strictly speaking, if they ask for help to be removed from the fire of hell, then they will be moved to a place where the hot water is to be drunk. As expressed in God's word as follows: When the shackles and chains were put on their necks, as they were dragged, into very hot water, then they were burned in the fire (Gafir\/40: 71-72)"
		   },
		   {
			"id": 4946,
			"surah": 55,
			"ayat": 45,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. Allah also reminds us of the painful news and warnings that He has delivered, namely that humans leave and stay away from sinful acts."
		   },
		   {
			"id": 4947,
			"surah": 55,
			"ayat": 46,
			"tafsir": "This verse explains that Allah provides two heavens for people who fear their Lord and believe that they will be rewarded for their deeds. If his heart is moved to commit immorality, then he remembers God who knows everything, both visible and hidden. Therefore he abandoned the deed, fearing the doom and punishment that would be received. They do good and invite people to do good too. The two heavens are: 1. Spiritual heaven where they get God's approval. Allah's Word: And the pleasure of Allah is greater. That's a great victory. (at-Taubah \/ 9: 72) 2. The physical heaven they get is in accordance with the good deeds they have done in the world."
		   },
		   {
			"id": 4948,
			"surah": 55,
			"ayat": 47,
			"tafsir": "This verse explains that Allah provides two heavens for people who fear their Lord and believe that they will be rewarded for their deeds. If his heart is moved to commit immorality, then he remembers God who knows everything, both visible and hidden. Therefore he abandoned the deed, fearing the doom and punishment that would be received. They do good and invite people to do good too. The two heavens are: 1. Spiritual heaven where they get God's approval. Allah's Word: And the pleasure of Allah is greater. That's a great victory. (at-Taubah \/ 9: 72) 2. The physical heaven they get is in accordance with the good deeds they have done in the world."
		   },
		   {
			"id": 4949,
			"surah": 55,
			"ayat": 48,
			"tafsir": "This verse explains that the two heavens have shady trees and fruits of various colors, which make them more lustful, more appetizing to eat them. Then Allah said, \"Do you, O humans and jinns, covet"
		   },
		   {
			"id": 4950,
			"surah": 55,
			"ayat": 49,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. The news of suffering and the painful warning that He has delivered, namely so that humans leave and stay away from sin. So which of the favors of your Lord do you deny, O mankind and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing and for all of you. ("
		   },
		   {
			"id": 4951,
			"surah": 55,
			"ayat": 50,
			"tafsir": "This verse explains that in the two heavens there are two springs flowing, watering the trees of various kinds. The water goes wherever they want. One of the springs is named at-tasnim and the other is named as-salsabil, according to Allah's word: And the mixture is from tasnim, (ie) springs that are drunk by those who are close to Allah. (al-Muthaffifin\/83: 27-28) And His words: And there they were given a glass of drink mixed with ginger. (Which came from) a spring (in heaven) called Salsabil. (al-Insan\/76: 17-18)"
		   },
		   {
			"id": 4952,
			"surah": 55,
			"ayat": 51,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. The news of suffering and the painful warning that He has delivered, namely so that humans leave and stay away from sin. So which of the favors of your Lord do you deny, O mankind and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing and for all of you. Therefore, which of God's favors do you deny, O jinns and humans? Because it is a fact that cannot be denied and is a truly great blessing."
		   },
		   {
			"id": 4953,
			"surah": 55,
			"ayat": 52,
			"tafsir": "This verse explains that in the two heavens there are various kinds of wet and dry fruits, both of which are equally delicious, different from the fruits in this world."
		   },
		   {
			"id": 4954,
			"surah": 55,
			"ayat": 53,
			"tafsir": "This verse explains that at that time Allah asked which other blessings did you deny, especially the blessings that Allah has given today. The news of suffering and the painful warning that He has delivered, namely so that humans leave and stay away from sin. So which of the favors of your Lord do you deny, O mankind and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing for all of you."
		   },
		   {
			"id": 4955,
			"surah": 55,
			"ayat": 54,
			"tafsir": "This verse describes rugs or mattresses. They sat relaxed sleeping on the mattress inside which was made of thick silk. If the inside is so beautiful, then imagine how the outside is. Allah's Word: So no one knows what is hidden for them, namely (various favors) that pleases the heart in return for what they do. (as-Sajdah\/32: 17) Ibn 'Abbas said that This shows how good the rugs are and how much lasting pleasure they receive from the rewards given to them. The fruits of the two heavens are close to them if they want to pick them, as stated in other verses which have the same meaning: The fruits are near. (al-haqqah\/69: 23) And His words: And the shade (trees) is close above them and makes it easy for them to pick (fruit). (al-Insan\/76: 14) The fruits will not shy away, they will even lower themselves so that they are easy to pick."
		   },
		   {
			"id": 4956,
			"surah": 55,
			"ayat": 55,
			"tafsir": "This verse explains that at that time Allah asked which other blessings did you deny, especially the blessings that Allah has given today. The news of suffering and the painful warning that He has delivered, namely so that humans leave and stay away from sin. So which of the favors of your Lord do you deny, O mankind and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing for all of you."
		   },
		   {
			"id": 4957,
			"surah": 55,
			"ayat": 56,
			"tafsir": "In this verse it is explained that in heaven there are polite maidens who lower their eyes, not wanting to look at anyone other than their husbands; there will be no human being better than them. They are still girls, virgins who have never been touched by humans or jinn, before the inhabitants of heaven who enter them become their husbands. If so, then which of the favors of your Lord do you deny? ("
		   },
		   {
			"id": 4958,
			"surah": 55,
			"ayat": 57,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. The news of suffering and the painful warning that He has delivered, namely so that humans leave and stay away from sin. So which of the favors of your Lord do you deny, O mankind and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing for all of you."
		   },
		   {
			"id": 4959,
			"surah": 55,
			"ayat": 58,
			"tafsir": "This verse explains that an angel is clear as a yakut gem and white as a pearl and marjan. This is an expression in Arabic which means to say that an angel is very beautiful and beautiful."
		   },
		   {
			"id": 4960,
			"surah": 55,
			"ayat": 59,
			"tafsir": "This verse explains that at that time Allah asked which other blessings did you deny, especially the blessings that Allah has given today. The news of suffering and the painful warning that He has delivered, namely so that humans leave and stay away from sin. So which of the favors of God do you deny, O people and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing for all of you."
		   },
		   {
			"id": 4961,
			"surah": 55,
			"ayat": 60,
			"tafsir": "In this verse, Allah reveals that there is no reward for good deeds except goodness. In another verse with the same meaning, Allah says: For those who do good, there is the best reward (heaven) and additional (the pleasure of seeing Allah). And their faces are not covered with black dust and are not (also) in humiliation. They are the inhabitants of heaven, they will remain there forever. (Yunus\/10: 26) In connection with verse 60, Ibn Abi Hatim From Anas bin Malik that the Messenger of Allah read the verse (which means), \"There is no reward for good but good,\" then he asked, \"What do you know from God's word ?\" They replied, \"Allah and His Messenger know better.\" The Prophet replied, \"Allah said, 'There is no reward for good for those whom I have bestowed favors by uniting (Me) except heaven.\" (History of Ibn Abi Hatim, Ibn Mardawaih, and al-Baihaqi)"
		   },
		   {
			"id": 4962,
			"surah": 55,
			"ayat": 61,
			"tafsir": "This verse explains that at that time Allah asked about which other blessings did you deny, especially the blessings that Allah has given today. Allah also reminds us of the painful news and warnings that He has delivered, namely that humans leave and stay away from sinful acts. So which of the favors of your Lord do you deny, O mankind and jinn? Each is rewarded as Allah has explained. Isn't that a great blessing for all of you."
		   },
		   {
			"id": 4963,
			"surah": 55,
			"ayat": 62,
			"tafsir": "In this verse, Allah explains that apart from the two heavens previously mentioned, there are two more paradises reserved for the believers from the Assabul-yamin group. That is, the two previous heavens were reserved for groups of people who were formerly believers and the other two heavens were reserved for the Ashabul-yamin group of people who believed later. This is in accordance with the words of the Prophet in his hadith: Two paradises of gold for Muqarrabin and two more heavens of silver for Ashabul-yamin.\" (History of Ibn Jarir, Ibn Abi hatim, Ibn Mardawaih from Abu Musa) denied by jinns and humans?"
		   },
		   {
			"id": 4964,
			"surah": 55,
			"ayat": 63,
			"tafsir": "In this verse, Allah explains that apart from the two heavens previously mentioned, there are two more paradises reserved for the believers from the Assabul-yamin group. That is, the two previous heavens were reserved for groups of people who were formerly believers and the other two heavens were reserved for the Ashabul-yamin group of people who believed later. This is in accordance with the words of the Prophet in his hadith: Two paradises of gold for Muqarrabin and two more heavens of silver for Ashabul-yamin.\" (History of Ibn Jarir, Ibn Abi hatim, Ibn Mardawaih from Abu Musa) denied by jinns and humans?"
		   },
		   {
			"id": 4965,
			"surah": 55,
			"ayat": 64,
			"tafsir": "In the other two heavens there are plants and flowers that are dark green in color. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4966,
			"surah": 55,
			"ayat": 65,
			"tafsir": "In the other two heavens there are plants and flowers that are dark green in color. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4967,
			"surah": 55,
			"ayat": 66,
			"tafsir": "This verse reveals that in heaven there are two springs that emit water, different from the water in the previous heaven. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4968,
			"surah": 55,
			"ayat": 67,
			"tafsir": "This verse reveals that in heaven there are two springs that emit water, different from the water in the previous heaven. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4969,
			"surah": 55,
			"ayat": 68,
			"tafsir": "This verse explains that in the two heavens there are fruits with various tastes, including dates and pomegranates. He mentioned dates and pomegranates even though both belong to a type of fruit, because there is a difference with other fruits because both are found in autumn and winter. In addition, dates are nutritious fruits, and pomegranates can be used as medicine. So which of Allah's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4970,
			"surah": 55,
			"ayat": 69,
			"tafsir": "This verse explains that in the two heavens there are fruits with various tastes, including dates and pomegranates. He mentioned dates and pomegranates even though both belong to a type of fruit, because there is a difference with other fruits because both are found in autumn and winter. In addition, dates are nutritious fruits, and pomegranates can be used as medicine. So which of Allah's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4971,
			"surah": 55,
			"ayat": 70,
			"tafsir": "This verse reveals that in heaven there are maidens who are good-natured and beautiful in appearance. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4972,
			"surah": 55,
			"ayat": 71,
			"tafsir": "This verse reveals that in heaven there are maidens who are good-natured and beautiful in appearance. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4973,
			"surah": 55,
			"ayat": 72,
			"tafsir": "This verse reveals that the angels are women who are good in character and beautiful in appearance with beautiful eyes, sweet, white, clean around the black, secluded in the house, not those who roam the streets."
		   },
		   {
			"id": 4974,
			"surah": 55,
			"ayat": 73,
			"tafsir": "This verse reveals that the angels are women who are good in character and beautiful in appearance with beautiful eyes, sweet, white, clean around the black, secluded in the house, not those who roam the streets."
		   },
		   {
			"id": 4975,
			"surah": 55,
			"ayat": 74,
			"tafsir": "This verse reveals that the angels were never touched by humans or jinns before the occupants of heaven who became their husbands came. Only their husbands have the right to touch them. The repetition of this statement, which has previously been mentioned in verse 56 of surahh ar-Rahman, is to show that they are truly holy and their purity is very well maintained. Therefore, which of God's favors do the jinn and humans deny? ("
		   },
		   {
			"id": 4976,
			"surah": 55,
			"ayat": 75,
			"tafsir": "This verse reveals that the angels were never touched by humans or jinns before the occupants of heaven who became their husbands came. Only their husbands have the right to touch them. The repetition of this statement, which has previously been mentioned in verse 56 of surahh ar-Rahman, is to show that they are truly holy and their purity is very well maintained. Therefore, which of God's favors do the jinn and humans deny? ("
		   },
		   {
			"id": 4977,
			"surah": 55,
			"ayat": 76,
			"tafsir": "This verse reveals that the inhabitants of heaven are sitting relaxed on green cushions, big and beautiful rugs, beautiful in appearance and beautifully woven, and inside are made of silk. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4978,
			"surah": 55,
			"ayat": 77,
			"tafsir": "This verse reveals that the inhabitants of heaven are sitting relaxed on green cushions, big and beautiful rugs, beautiful in appearance and beautifully woven, and inside are made of silk. So which of God's favors do the jinn and humans deny?"
		   },
		   {
			"id": 4979,
			"surah": 55,
			"ayat": 78,
			"tafsir": "This verse reveals that, only Allah has greatness and grace for all the blessings He has given, very many favors and very valuable rewards. This is a lesson for His servants that all of it is His grace. He who made heaven and earth, heaven and hell, torments sinners, rewards those who obey Him."
		   }
	]
}
