{
	"tafseer": [
		{
			"id": 5994,
			"surah": 89,
			"ayat": 1,
			"tafsir": "Allah swore by the dawn. The dawn in question is the dawn of yaumun-nahr (day of sacrificial slaughter), which is the 10th of Zulhijah, because the next verse talks about \"the tenth night\", namely the first ten days of the month. However, there are those who argue that the dawn in question is the dawn every day that starts to break which indicates the night is over and the day has begun. There are also those who argue that the dawn is the dawn of 1 Muharram as the beginning of the year, or the dawn of 1 Zulhijah as the month of the pilgrimage."
		   },
		   {
			"id": 5995,
			"surah": 89,
			"ayat": 2,
			"tafsir": "Next Allah swears by \"ten nights\". What is meant is the first ten days of the month of Zulhijah, which are very glorified days of doing good deeds on these days, as informed by the following hadith: There is no day doing good is more loved by Allah to him than these days. (Al-Bukhari history from Ibn 'Abbas) However, some argue that what is meant is the first ten days of the month of Muharram, or the first ten days of Ramadan, or the first ten days of each month."
		   },
		   {
			"id": 5996,
			"surah": 89,
			"ayat": 3,
			"tafsir": "Next again Allah swears by \"the even and the odd\". \"The even ones are the yaumun-nahr above, which is the 10th of Zulhijah, and the \"odd\" ones are the days of 'Arafat, which are the 9th of Dhulhijah. Those are also glorified days. The 9th of Zulhijah is the day of standing in 'Arafah, namely the day of the start of the pilgrimage, and the 10th of Zulhijah is the day when the sacrificial animal is slaughtered."
		   },
		   {
			"id": 5997,
			"surah": 89,
			"ayat": 4,
			"tafsir": "Furthermore Allah swears by \"the night when it passes\". The night in question is the night when the pilgrims have passed from 'Arafah and stopped at Muzdalifah on their way to Mina in the pilgrimage. Thus Allah swears by the days of the pilgrimage to show that the pilgrimage is of great significance in the sight of Allah. This is because the pilgrimage reminds people of death. By remembering death, humans are expected to have faith and do good. This verse can also be interpreted that Allah swears by successive days to show that Allah Almighty protects and manages nature. When the time comes, namely the Day of Judgment, He Almighty also destroys it and revives it"
		   },
		   {
			"id": 5998,
			"surah": 89,
			"ayat": 5,
			"tafsir": "The message that Allah wants to convey by swearing above is that people who want to use their minds must understand that Allah Almighty created, preserved, destroyed, and revived this nature. Therefore, they should have faith and do good. This verse is a warning to the infidels of Mecca at the time this verse was revealed, to believe in Allah and the Last Day, do good, and leave their evil deeds. It is also a warning to all mankind"
		   },
		   {
			"id": 5999,
			"surah": 89,
			"ayat": 6,
			"tafsir": "Allah asked the Prophet Muhammad, whose purpose was to inform him or anyone to ponder, about the people of 'Ad. These people are the people of Prophet Hud who inhabit an area called Ahqaf in the Hadramaut area, Yemen. 'Ad was the name of their ancestor, 'Ad bin Iram bin Sam bin Nuh. They are named after their ancestors. They are known as a strong nation and have a tall, big, and mighty body. The proof of their might is that they have been able to build a city called Iram with buildings that are sturdy, tall, and magnificent for the size of that time. They also rule over the surrounding nations. Even though they are so mighty and have a high civilization, Allah is still able to destroy them so that only names remain. All of this is the result of their disobedience to Allah and their arbitrariness towards humans."
		   },
		   {
			"id": 6000,
			"surah": 89,
			"ayat": 7,
			"tafsir": "Allah asked the Prophet Muhammad, whose purpose was to inform him or anyone to ponder, about the people of 'Ad. These people are the people of Prophet Hud who inhabit an area called Ahqaf in the Hadramaut area, Yemen. 'Ad was the name of their ancestor, 'Ad bin Iram bin Sam bin Nuh. They are named after their ancestors. They are known as a strong nation and have a tall, big, and mighty body. The proof of their might is that they have been able to build a city called Iram with buildings that are sturdy, tall, and magnificent for the size of that time. They also rule over the surrounding nations. Even though they are so mighty and have a high civilization, Allah is still able to destroy them so that only names remain. All of this is the result of their disobedience to Allah and their arbitrariness towards humans."
		   },
		   {
			"id": 6001,
			"surah": 89,
			"ayat": 8,
			"tafsir": "Allah asked the Prophet Muhammad, whose purpose was to inform him or anyone to ponder, about the people of 'Ad. These people are the people of Prophet Hud who inhabit an area called Ahqaf in the Hadramaut area, Yemen. 'Ad was the name of their ancestor, 'Ad bin Iram bin Sam bin Nuh. They are named after their ancestors. They are known as a strong nation and have a tall, big, and mighty body. The proof of their might is that they have been able to build a city called Iram with buildings that are sturdy, tall, and magnificent for the size of that time. They also rule over the surrounding nations. Even though they are so mighty and have a high civilization, Allah is still able to destroy them so that only names remain. All of this is the result of their disobedience to Allah and their arbitrariness towards humans."
		   },
		   {
			"id": 6002,
			"surah": 89,
			"ayat": 9,
			"tafsir": "Likewise, Allah has destroyed the Samud people, Prophet Saleh's people. This nation also has a high civilization, which is shown by their ability to build magnificent buildings in flat and cut places, carve stones in the mountains to make resting places, and make reliefs and ornaments from stone or marble. Their skill is described in another verse: And you skillfully carved part of the mountains to make houses. (asy-Syu'ara'\/26: 149) Even though they are so advanced, strong, and have a high civilization, Allah still has the power to destroy them because of their disobedience."
		   },
		   {
			"id": 6003,
			"surah": 89,
			"ayat": 10,
			"tafsir": "Allah also destroyed Pharaoh. He was known as a tyrannical king and even saw himself as the god of the Egyptians. This nation under Pharaoh has also achieved high civilization, among the evidence is their ability to build pyramids which are one of the wonders of the world until now. They also have a large armed forces. However, all of that has also been destroyed by Allah so that now they only have names to remember."
		   },
		   {
			"id": 6004,
			"surah": 89,
			"ayat": 11,
			"tafsir": "All the nations mentioned above, namely the 'Ad, Samud, and Pharaohs have committed arbitrariness on this earth, namely deifying humans or objects and violating human rights."
		   },
		   {
			"id": 6005,
			"surah": 89,
			"ayat": 12,
			"tafsir": "In addition, they have done damage to the earth, such as oppressing the weak and even killing whoever they want."
		   },
		   {
			"id": 6006,
			"surah": 89,
			"ayat": 13,
			"tafsir": "Finally Allah \"poured out on them the scourge of doom\", which means that the punishment was poured out on them in its entirety, so that they were completely destroyed and all that was left was a name to be remembered by people. It was \"your Lord\" (yes, Muhammad!) who met the doom, meaning that these events should serve as a lesson to the Meccan infidels so that they would not continue to rebel. How the punishment that befell those nations is stated in other verses: So as for the people of Samud, they were destroyed with a very loud voice, while the people of 'Ad, they were destroyed with a very cold hurricane, Allah brought that wind on them for seven nights and eight days continuously; then you see the people of 'Ad at that time dead lying like the trunks of date palms that have been empty (rotted). So do you see anyone left among them? Then came Pharaoh and the people who were before him and (the inhabitants of) the countries that were turned upside down because of a big mistake. So they disobeyed their Lord's messenger, Allah tortured them with very severe torments. (al-haqqah\/69: 5-10)"
		   },
		   {
			"id": 6007,
			"surah": 89,
			"ayat": 14,
			"tafsir": "Allah confirms that He is really very strong in His supervision of His creatures. There is not the slightest deed that He is not aware of. Therefore, those who are disobedient and sinful should be aware and then have faith and repent of their sins."
		   },
		   {
			"id": 6008,
			"surah": 89,
			"ayat": 15,
			"tafsir": "This verse states that Allah tests humans with His glory and various favors, such as power and wealth. Disbelievers and disobedient people will see this as a sign that Allah loves them."
		   },
		   {
			"id": 6009,
			"surah": 89,
			"ayat": 16,
			"tafsir": "On the other hand, if Allah tests them by limiting their sustenance, they think that Allah has hated them. This view is incorrect, because Allah gives whom He likes or does not give whom He does not like. God wants to test humans, and because of that He wants them to always be obedient to Him, whether they are sufficient or lacking. If Allah gives, then the people who are given must be grateful, and if He does not give, humans must be patient."
		   },
		   {
			"id": 6010,
			"surah": 89,
			"ayat": 17,
			"tafsir": "However, many people are ungrateful, they are not grateful for the blessings given to them. Being grateful is saying words of gratitude and using the favors according to the provisions of the Giver. One of His provisions is that those who are given excess sustenance must pay attention to those who are lacking. Among them are orphans. Orphans need to be cared for until they grow up. Humans who deny and don't want to be grateful don't want to pay attention to the care of the orphans."
		   },
		   {
			"id": 6011,
			"surah": 89,
			"ayat": 18,
			"tafsir": "Besides, they have no pity for the suffering of the poor. Let alone getting them out of poverty, helping to fulfill their basic needs, they don't pay any attention."
		   },
		   {
			"id": 6012,
			"surah": 89,
			"ayat": 19,
			"tafsir": "In addition, people who deny and disobey are very greedy. They have the heart to seize the inheritance that belongs to orphans by subterfuge, for example mixing it into their wealth and then claiming that what they eat is their own property."
		   },
		   {
			"id": 6013,
			"surah": 89,
			"ayat": 20,
			"tafsir": "The disobedient person continues to seek and accumulate wealth tirelessly and does not care whether it is lawful or unlawful. In addition, they are very stingy, do not want to issue obligations regarding assets, namely paying zakat and helping people who are in need. It is impossible for God to love a wealthy person who has acquired wealth in an unrighteous way. Also to people who do not want to help others. They should not think that their getting riches is a sign that Allah loves them. Instead, God actually hates them. It is not impossible that they will be punished as He has inflicted on the former nations. In the afterlife, Allah will put them in hell. This fact should be realized by Meccan infidels who are still disobedient. This should be a lesson for all mankind."
		   },
		   {
			"id": 6014,
			"surah": 89,
			"ayat": 21,
			"tafsir": "In this verse, Allah informs that the disbelievers will regret it later in the hereafter. Allah announced that this world will be destroyed because these planets will crash into each other violently and all creatures will die. After that Allah brought all these creatures back to life and confronted them at Padang Mahsyar. Then Allah and the angels who make special formations examine every human deed. It was at that time that the hell of Hell was confronted by those who were disobedient while in the world. At that time those who disobeyed realized their disobedience. However, realizing at that time was of no use, because \"the rice has turned to mush\", the world where charity has ended, and there is only a place to see the results of charity in the world."
		   },
		   {
			"id": 6015,
			"surah": 89,
			"ayat": 22,
			"tafsir": "In this verse, Allah informs that the disbelievers will regret it later in the hereafter. Allah announced that this world will be destroyed because these planets will crash into each other violently and all creatures will die. After that Allah brought all these creatures back to life and confronted them at Padang Mahsyar. Then Allah and the angels who make special formations examine every human deed. It was at that time that the hell of Hell was confronted by those who were disobedient while in the world. At that time those who disobeyed realized their disobedience. However, realizing at that time was of no use, because \"the rice has turned to mush\", the world where charity has ended, and there is only a place to see the results of charity in the world."
		   },
		   {
			"id": 6016,
			"surah": 89,
			"ayat": 23,
			"tafsir": "In this verse, Allah informs that the disbelievers will regret it later in the hereafter. Allah announced that this world will be destroyed because these planets will crash into each other violently and all creatures will die. After that Allah brought all these creatures back to life and confronted them at Padang Mahsyar. Then Allah and the angels who make special formations examine every human deed. It was at that time that the hell of Hell was confronted by those who were disobedient while in the world. At that time those who disobeyed realized their disobedience. However, realizing at that time was of no use, because \"the rice has turned to mush\", the world where charity has ended, and there is only a place to see the results of charity in the world."
		   },
		   {
			"id": 6017,
			"surah": 89,
			"ayat": 24,
			"tafsir": "At that time the disobedient people regretted themselves why in the past they did not do something useful for their life in the hereafter."
		   },
		   {
			"id": 6018,
			"surah": 89,
			"ayat": 25,
			"tafsir": "In the afterlife, there will only be doom for those who disobey. The punishment is incomparable so that there is no comparison. The punishment fell according to their sins while in the world."
		   },
		   {
			"id": 6019,
			"surah": 89,
			"ayat": 26,
			"tafsir": "At that time, no one was more trusted in carrying out his duties besides Angel Zabaniyah. The angel will carry out his duties exactly as commanded by Allah, namely that the disobedient people will be punished in the Hellfire according to their sins. Thus, it is proven that the abundance of blessings they received while in this world is not a sign that God loves them."
		   },
		   {
			"id": 6020,
			"surah": 89,
			"ayat": 27,
			"tafsir": "In these verses, God calls a soul that is calm and peaceful when it dies, that is, a soul that is pure because of the faith and good deeds it has done, so that it gets what God has promised it. The soul is asked by God to return to fulfill His call by facing Him again with a feeling of satisfaction and joy because it has fulfilled His commandments while living in the world. Allah is also satisfied and pleased with him because he has carried out His commands. After coming to Him, the soul is welcome by God to enter into the group of His servants, namely into His heaven."
		   },
		   {
			"id": 6021,
			"surah": 89,
			"ayat": 28,
			"tafsir": "In these verses, God calls a soul that is calm and peaceful when it dies, that is, a soul that is pure because of the faith and good deeds it has done, so that it gets what God has promised it. The soul is asked by God to return to fulfill His call by facing Him again with a feeling of satisfaction and joy because it has fulfilled His commandments while living in the world. Allah is also satisfied and pleased with him because he has carried out His commands. After coming to Him, the soul is welcome by God to enter into the group of His servants, namely into His heaven."
		   },
		   {
			"id": 6022,
			"surah": 89,
			"ayat": 29,
			"tafsir": "In these verses, God calls a soul that is calm and peaceful when it dies, that is, a soul that is pure because of the faith and good deeds it has done, so that it gets what God has promised it. The soul is asked by God to return to fulfill His call by facing Him again with a feeling of satisfaction and joy because it has fulfilled His commandments while living in the world. Allah is also satisfied and pleased with him because he has carried out His commands. After coming to Him, the soul is welcome by God to enter into the group of His servants, namely into His heaven."
		   },
		   {
			"id": 6023,
			"surah": 89,
			"ayat": 30,
			"tafsir": "In these verses, God calls a soul that is calm and peaceful when it dies, that is, a soul that is pure because of the faith and good deeds it has done, so that it gets what God has promised it. The soul is asked by God to return to fulfill His call by facing Him again with a feeling of satisfaction and joy because it has fulfilled His commandments while living in the world. Allah is also satisfied and pleased with him because he has carried out His commands. After coming to Him, the soul is welcome by God to enter into the group of His servants, namely into His heaven."
		   }
	]
}
