{
	"tafseer": [
		{
			"id": 5076,
			"surah": 57,
			"ayat": 1,
			"tafsir": "In this verse it is explained that everything that was created by Allah, whether in the heavens or on earth such as animals, plants, stones and other things that have life or not, should sincerely and sincerely glorify Him at all times. declare His greatness, and acknowledge that He is the Almighty. All are subject to worship and obey all His commands. If so, humans as creatures endowed with reason should sanctify Allah, carry out His commands and stay away from His prohibitions. In another verse that shows the position of creatures, Allah says: The seven heavens, the earth and everything in them glorify Allah. And there is nothing but glorify Him by praising Him, but you do not understand their tasbih. Indeed, He is Most Forbearing, Most Forgiving. (al-Isra'\/17: 44) He is also the Almighty, nothing can compete with Him. He is All-Wise creating, governing and governing His creatures with the rules that He has determined, which is according to His will."
		   },
		   {
			"id": 5077,
			"surah": 57,
			"ayat": 2,
			"tafsir": "In this verse it is explained that to Allah belongs the kingdom of the heavens and the earth. He is the one who has the power to do something for His creatures, create, give life and death, provide sustenance to whoever He wants, according to the circumstances He wants. He is the Almighty over all things. What He wills will happen and what He does not will will not happen. This requires humans to worship and ask for help from Him."
		   },
		   {
			"id": 5078,
			"surah": 57,
			"ayat": 3,
			"tafsir": "In this verse Allah states that He is the Beginning, who existed before everything existed, because He is the one who made it, and created it. He is the Â¨final, who is real, because of the many proofs about the existence. He is the Most High of all, there is nothing higher than Him. He is the Inner One, Whose essence of His Substance cannot be described by reason. He knows all that is stored up, that which is unreal and that which is hidden. He is closest to what He has created. Nothing is closer to His creatures than Him; as He says: And indeed, We have created man and know what his heart whispers, and We are nearer to him than his jugular vein. (Qaf\/50: 16) In the hadith narrated by Ahmad and Muslim from Abu Hurairah: Fatimah came to the Prophet asking for a maid, then the Prophet told her to pray, \"O Allah, Lord of all things, who sent down the Torah, Bible and Al-Qur'an 'an, who splits the grain. I seek refuge in You from the evil of every thing. You are the one who arranges it. You are the first Substance that did not exist before You anything, You are the final Substance that does not exist after You anything. You are adz-Â¨ahir who has nothing above You, and You are al-Bathin who has nothing below You. Pay off our debts and fulfill our needs. (History of Ahmad and Muslim from Abu Hurairah)"
		   },
		   {
			"id": 5079,
			"surah": 57,
			"ayat": 4,
			"tafsir": "In this verse it is explained that Allah created the heavens and the earth and all that is in them. It is He who arranges it with the system that He has determined for six periods, then He resides on the Throne according to His greatness and holiness. From there governed the whole kingdom with wisdom and wisdom. He bestows upon some of His servants instructions that can lead them to the perfect path to serve and be grateful to Him so that they can live happily in this world and in the hereafter. He knows all His creatures that enter into the earth, nothing escapes His knowledge and He also knows what comes out of the earth, in the form of plants, plants and fruits and objects in the form of gold. , silver, petroleum and others. In another verse Allah says: And the keys to all that is unseen are with Him; no one knows but Him. He knows what is on land and in sea. Not a leaf falls that He doesn't know about. There is not a grain in the darkness of the earth nor anything wet or dry that is not written in a real Book (Lauh Mahfudz). (al-An'am\/6: 59) Allah knows what descends from the sky such as rain, angels and good deeds, as Allah says in the following verse: Whoever desires glory, then (know) that all glory belongs to Allah . To Him will ascend good words, and good deeds He will lift them up. As for those who plot their crimes, they will be met with a very severe punishment, and their evil plans will be destroyed. (Fathir\/35: 10) Allah sees all human actions wherever he is. He watches over people, hears their words, knows what people hide and what moves in their hearts, as Allah says in the following verse: It's the same (to Allah), who among you keeps his words secret and who is frank with him; and who hid by night and walked by day. (ar-Ra'd\/13: 10)"
		   },
		   {
			"id": 5080,
			"surah": 57,
			"ayat": 5,
			"tafsir": "In this verse Allah explains that the kingdoms of the heavens and the earth and everything that is in them both belong to Him. It is He who governs both of them with wise wisdom and it is His decision that applies to both of them according to His will and provisions, and to Him all creatures and all matters will return. As He says in the following verses: And indeed Ours is the hereafter and the world. (al-Lail\/92: 13) And Allah said: And He is Allah, there is no god (who has the right to be worshiped) besides Him, all praise be to Him in this world and in the hereafter, and to Him all judgment and to Him you returned. (al-Qasas\/28: 70)"
		   },
		   {
			"id": 5081,
			"surah": 57,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that it is He who causes the night to enter into the day and the day to enter into the night according to the wisdom and provisions that He wills. Sometimes the day is longer than the night, sometimes the night is longer than the day and sometimes it is the same length. He made summer, winter, spring and autumn, beneficial to His servants, and according to His plan. It is He who knows everything that is hidden down to the smallest object and He also knows what moves in the hearts and desires of His servants just as He can know their good and bad deeds. With this Allah encourages us to think deeply and thoroughly about everything that is truly beneficial and then to be grateful for the gifts and favors that He has bestowed which give us good luck in this world and in the hereafter."
		   },
		   {
			"id": 5082,
			"surah": 57,
			"ayat": 7,
			"tafsir": "In this verse, Allah SWT commands that those who believe in Him and His Messenger spend the wealth they have, because the wealth and children are entrusted by Allah to someone, of course one day the deposit will be taken back. Syu'bah said, \"I heard Qatadah tell about Muththarif who met the Prophet, he read surahh at Takatsur, then said: Humans say, \"My treasure, my treasure.\" Your wealth is only what you have eaten and then runs out, or the clothes you wear then become worn out, or something that you give in charity and then becomes eternal (permanent). Then apart from that it will disappear and for other people. (Muslim History) belonging to the legacy of the former, they will receive a great reward that has never been seen and etched in the heart."
		   },
		   {
			"id": 5083,
			"surah": 57,
			"ayat": 8,
			"tafsir": "In this verse Allah denounces those who do not believe by stating, what is the reason for not believing in Allah, while His Messenger is among you who invites you to believe and confirms Him by presenting concrete evidence. Regarding human faith, the Prophet saw once said: In your opinion, who is the most amazing in his faith? They (the companions) replied, \"Angels.\" The Prophet said, \"How can they not believe while they are with their Lord.\" Then they said, \"The Prophets.\" The Prophet replied, \"How can they not believe when they receive revelations.\" Then they said, \"Then we are the ones.\" The Prophet replied, \"How can you not believe while I am in the midst of you. The faith of the most amazing people are those who come after you, read the Qur'an and believe in it.\" (Al-Bukhari) Furthermore, Allah denounces the disbelievers, why do you not believe, even though Allah has shown proof of His monotheism in the universe, both rationally and logically. The earth, sky, sea, land and all of Allah's creations that you see both in yourself and in all of His creations are clear evidence if you really hold on to Him. The point is that the obligatory proof of belief in Allah and His Messenger is found in all His creations and the apostles have proven the truth of their preaching and miracles, but why else do you not want to believe?"
		   },
		   {
			"id": 5084,
			"surah": 57,
			"ayat": 9,
			"tafsir": "This verse explains why disbelievers do not believe even though Allah has sent His messengers with clear evidence so that they can bring them out of darkness, disbelief to the light of faith and from error to guidance. It is also by His grace that humans are invited to think about the wonders of His creation so that faith is more perfect."
		   },
		   {
			"id": 5085,
			"surah": 57,
			"ayat": 10,
			"tafsir": "After Allah rebuked them for not wanting to believe, then in this verse Allah rebuked them for not wanting to spend in His way. Why does man not want to spend the wealth that Allah has given him in His way, while his wealth will return to Allah. If he does not spend in His way, it means that he is not sure that all of these assets essentially belong to Allah, because the heavens and the earth and all that is in them will return to Him."
		   },
		   {
			"id": 5086,
			"surah": 57,
			"ayat": 11,
			"tafsir": "After Allah rebuked them for not wanting to believe, then in this verse Allah rebuked them for not wanting to spend in His way. Why does man not want to spend the wealth that Allah has given him in His way, while his wealth will return to Allah. If he does not spend in His way, it means that he is not sure that all of these assets essentially belong to Allah, because the heavens and the earth and all that is in them will return to Him. Allah commands humans to spend their wealth in the way of Allah before they die, so that it becomes a deposit with Allah. Such a thing cannot be done by humans after death because all assets will return to Allah, the Owner of all the worlds. Furthermore, Allah swt states the difference in degrees obtained by those who spend money because of the differences in their conditions and situations in doing it. That the degree of those who spent and emigrated before the liberation of Mecca was higher than the degree of those who spent and emigrated after that, because in the period prior to the liberation of Mecca, humans were in a difficult condition and were always threatened. No one will believe and spend except those who are truly aware, but after the liberation of Mecca, Islam has developed and people have flocked to follow it. The degree of those who fought and spent before the liberation of Mecca was greater than the rewards that were obtained by those who fought and spent afterward. Qatadah said, \"There are two jihads, one of which is of higher value than the other, and there are two kinds of infak which one is more important than the other; jihad and infak before the liberation of Mecca is more important than jihad and infak after it.\" However, for each person who strives and spends before or after the liberation of Mecca, there is a reward, even though there is a difference between how big and small the reward is. In another verse that has almost the same meaning. Allah says: It is not the same between a believer who sits (who does not take part in the war) without any excuse (obstacle) and a person who strives in the way of Allah with his wealth and his soul. Allah exalts the degrees of those who strive with their wealth and souls over those who are sitting (not participating in the war without hindrance). To each of them, Allah promises a good reward (heaven) and Allah gives priority to those who strive over those who sit with a great reward. (an-Nisa'\/4: 95) It has been narrated, that there had been a dispute of words between Khalid bin al-Walid and 'Abdurrahman bin 'Auf, then Khalid said to Abdurrahman, \"You consider yourself more noble than us, because you were first follow the Prophet Muhammad (peace and blessings be upon him) than us.\" Then Khalid's words were known to the Prophet, then he said Let me judge my friends. By Allah, Whose life is in His power, if you spend gold as big as the hill of Uhud or as big as a mountain you will not get the reward of their deeds. (Ahmad's history from Anas) Do not insult my friends, for the sake of Allah, the Lord whose life Muhammad is in His power, if one of you spends gold as big as the hill of Uhud, he will not reach one mud they donate and not even half of it. \" (Narrated by al-Bukhari and Muslim from Abu Sa'id al-Khudri) Allah said: And those who were earlier were the first (to convert to Islam) among the Muhajirin and Ansar and those who followed them well, Allah is pleased with them and they are pleased with Allah. Allah has prepared for them gardens beneath which rivers flow. They will remain in them forever. That is a great victory. (atTaubah\/9: 100) In closing the verse this, Allah warns that He knows all human conditions, physically and spiritually, therefore He will reward him accordingly. Because of His knowledge, Allah exalts the reward of infak and also jihad before the Mecca's liberation from the rewards of infaq and jihad afterwards, the sincerity of spending and jihad is more severe in difficult and difficult circumstances. In this case Abu Bakr was the happiest because he had spent all of his wealth in order to demand the pleasure of Allah alone. (11) Allah invites people to spend in His way and promises those who want to do it. Whoever spends in the way of his Lord in the hope of getting a reward, his Lord will multiply the reward of his spending by giving one virtue to seven hundred times and will get an infinite reward in heaven. Ibn Mas'ud said, \"When before this verse was revealed, Abu Dahdah al-Ansari asked the Prophet. \"O Messenger of Allah, according to my understanding, that Allah actually wants a loan.\" Muhammad saw \"O Messenger of Allah, give me your hand,\" then he held his hand and said, \"O Messenger of Allah, I will lend my date palm garden to Allah. There were seven hundred dates in it, and Abu Dahdah's wife and their children lived there and he told her about it. \"Get out of this garden, O my wife with your children, because in fact I have lent our garden to Allah,\" his wife replied, \"It is true that you are saying, O Abu Dahdah.\" Then his wife and children came out of the garden. Then the Prophet Muhammad said, \"How many springs in heaven belong to Abu Dahdah.\""
		   },
		   {
			"id": 5087,
			"surah": 57,
			"ayat": 12,
			"tafsir": "In this verse it is explained that believers will receive a great reward in the hereafter, that is, they will be given light in front of them and to their right according to the level of good deeds done, which will lead them to heaven. In a hadith it is stated: They receive their light according to the level of their deeds. They passed as-sirath. Among them there is a light as big as a mountain, some are as big as a date palm, while the smallest light is as big as a thumb's finger, sometimes it lights up and sometimes it goes out. (History of Ibn Jarir, Ibn Mardawaih, and al-Baihaqi) They cleanse their souls with monotheism and good deeds, do not associate partners with Him, so that they return to Him with a sincere soul and receive a book of their deeds with their right hand, as Allah states in His word: So as for the person whose record is given from his right hand, then he will be examined with an easy examination, and he will return to his family (who both believe) with joy. (al-Insyiqaq\/84: 7-9) At that time the angel said to the believers, \"Rejoice in entering heaven in which rivers flow as a reward commensurahte with your deeds and your efforts to distance yourself from shirk and sin, by because of your constant remembrance, you will be happy in your deeds.\" In another verse Allah states: (Namely) the heavens of 'Adn, they enter them together with the righteous from their ancestors, their spouses, and their offspring, while the angels enter their places from all the doors; (while saying), \"Peace be upon you for your patience.\" So what a pleasure the end is. (ar-Ra'd\/13: 23-24) In concluding this verse, Allah states that the greatness of living in paradise whose conditions the believers have known is a great victory that is coveted after they are free from Allah's punishment. ("
		   },
		   {
			"id": 5088,
			"surah": 57,
			"ayat": 13,
			"tafsir": "After Allah reveals the state of the believers on the Day of Judgment. In this verse Allah reveals that the hypocrites on the Day of Judgment call out to the believers who are pleased with Him and become residents of heaven. \"Wait for us so that we together meet Allah and let him take a bit of your light so that we can get out through your light from a painful punishment.\" Then this request was answered with an answer that cut off their hopes and caused sadness and regret, namely, \"Stay where you are, look for the light there and do not expect from us what we have done for ourselves from good deeds, because it will not benefit someone except one's own good deeds.\" That is a mockery of them as they mocked the believers in the world when they said: We believe, but they do not believe. This is what is desired by His word; Allah will make fun of them and let them drift in error. (al-Baqarah\/2: 15) So to repay all their deeds, a section was set that delimited the places of the believers and the hypocrites. The portion occupied by the believers is a paradise full of pleasures, whereas the portion occupied by the hypocrites is a hell filled with torment."
		   },
		   {
			"id": 5089,
			"surah": 57,
			"ayat": 14,
			"tafsir": "Then in this verse Allah states the events that will be experienced by the hypocrites in the hereafter, namely they call on the believers and say, \"Weren't we with you while living in this world?\" Then the believers replied, \"Yes, it's true, we pray together, stay at Arafah, fight and carry out other religious obligations but you splurge on delicacy and immorality, doubt about the day of resurrection, deceived by wishful thinking that you say that your sins will be forgiven by Allah, because of the whispering of satan telling you that Allah is Forgiving, and He will forgive your sins.\" That is, in fact you hypocrites are with us in the world only with your rough body, even though your soul is not with us, you do not have firmness in your stance, so you rarely remember Allah.\""
		   },
		   {
			"id": 5090,
			"surah": 57,
			"ayat": 15,
			"tafsir": "In this verse Allah explains the consequences of the actions of the hypocrites. They will continue to perish and there is no way to escape from hell, that is, if one of them wants to redeem himself from doom with a ransom in the form of gold all over the earth, he will not be accepted either. They are still thrown into hell because there is no more worthy place for them than that. And that's the worst place."
		   },
		   {
			"id": 5091,
			"surah": 57,
			"ayat": 16,
			"tafsir": "In this verse Allah rebukes and warns the believers about their neglectful condition. Hasn't the time come for believers to have soft hearts, always remember Allah, love to hear and understand the teachings of their religion, obey and obediently follow the instructions of the truth that has been revealed, which is spread out in the Qur'an Furthermore Believers are warned not to imitate Jews and Christians who have been given the Torah and the Bible. Even though it has been a long time and it has taken quite a long time, they have not yet followed and understood their teachings and those of their prophets, so their hearts have become hard and hard to help, they are no longer able to accept advice, they do not leave themselves with the threats directed at them. . They changed the Scriptures that were in their hands and the teachings of their Scriptures were thrown far away. Their priests and priests make gods besides Allah, create religions without reason. Most of them became wicked, abandoning their original teachings. In line with this verse Allah says: (But) because they broke their promise, We cursed them, and We made their hearts hard of stone. They like to change the word (Allah) from its place, and they (deliberately) forget some of the messages they have been warned about. You (Muhammad) will always see betrayal from them except for a small group of them (who are not treacherous), so forgive them and leave them be. Indeed, Allah loves those who do good. (al-Ma'idah\/5: 13)"
		   },
		   {
			"id": 5092,
			"surah": 57,
			"ayat": 17,
			"tafsir": "In this verse Allah explains that He is the one who revives the earth after it dies. Allah softens hard hearts, guides people who are astray, removes difficulties that befall them with explanations and guidance of the Qur'an with advice and teachings that can soften hard stones, namely hard hearts, as revives and nourishes arid land petrified by rain. dense. Thus Allah has explained so that humans can think and use their minds as well as possible."
		   },
		   {
			"id": 5093,
			"surah": 57,
			"ayat": 18,
			"tafsir": "In this verse Allah explains that those who justify and believe in Allah and His Messenger both men and women and lend to Allah good loans by giving charity and donating their wealth in the way of Allah with sincerity, hoping only for His pleasure -eyes, do not want a reply and thank you, will be multiplied by Allah swt. One good that is done is rewarded with ten good deeds and multiplied up to seven hundred times, and for them that is a lot of reward and a good place to live, namely Jannatun Na'im in the hereafter."
		   },
		   {
			"id": 5094,
			"surah": 57,
			"ayat": 19,
			"tafsir": "Allah swt explains that those who believe and acknowledge the oneness of Allah swt, justify His messengers, believe in what is brought to them from their Lord, according to Allah's judgment, they are equal to the siddiqin people, namely people who are very firm in their belief in the truth Apostles, and those who died martyrs in the way of Allah. For them the rewards are many and a bright light shines on them. In line with that the word of Allah: And whoever obeys Allah and the Messenger (Muhammad), then they will be with people who are given favors by Allah, (namely) the prophets, lovers of truth, people who died martyrs and people pious. They are the best friends. (an-Nisa'\/4: 69) As for the disbelievers who deny the reasons and signs that show the oneness of Allah and the greatness of His Messenger, they are the inhabitants of the hell of Jahim, eternal and eternal in it. In line with this the word of Allah: As for those who disbelieve and deny Our verses, they are the inhabitants of hell. They live in it. (al-Baqarah\/2: 39)"
		   },
		   {
			"id": 5095,
			"surah": 57,
			"ayat": 20,
			"tafsir": "In this verse, Allah SWT explains to humans that the life and pleasures of this world are just like toys and funny things, they are the subject of jokes between them, as well as jewelry to complement their makeup. They are proud of the treasures and descendants bestowed upon them. The world which is temporary, lasts only a few moments and then disappears and ends its form. This situation is no different from the earth that is hit by heavy rains and then grows plants that amaze the farmers, causing them to be cheerful, bright-faced and feel happy. Then it turned dry and withered, shattered and fell to the wind. Furthermore, Allah SWT explained that in the hereafter there will be a painful punishment that will continue to be prepared for people who really love the world, leave good deeds, and involve themselves in polytheism and idol worship. In addition, there is forgiveness from Allah and His pleasure which is bestowed on those who purify themselves from sin and immorality, humble themselves before Allah and return to Him, obey and comply with all His commands and prohibitions. Verse 20, closes with an assertion that the life of the world is only a pleasure that will vanish and be lost and deceiving. Those who incline toward the world will be deceived and beguiled. They think that life is only in this world, and there is no life after."
		   },
		   {
			"id": 5096,
			"surah": 57,
			"ayat": 21,
			"tafsir": "In this verse, Allah orders that humans should hurry up and compete in doing good deeds in order to be able to obtain forgiveness from Allah and get paradise in the hereafter, which is as wide as the heavens and the earth, which is prepared for those who believe, in Allah and in the messengers of Allah. His apostles, acknowledge the oneness of Allah justify His apostles. All that Allah has prepared for them, is a gift, mercy and grace from Him. In the hadith narrated by Imam Muslim from Abu Salih from Abu Hurairah it is explained as follows: The poor from among the Emigrants complained, \"O Messenger of Allah! The rich have taken away rewards, high degrees and endless favors.\" The Prophet asked, \"What is that?\" The poor Muhajirin replied, \"They (wealthy people) pray as we pray, fast as we fast, but they give charity while we don't, they free slaves while we don't (because we can't.)\" The Prophet replied, \"Would you like me to Show practices that if practiced, you will surely precede those after you and no one is more noble than you except someone who does deeds like yours, namely reading tasbih, takbir, tahmid, thirty-three times after each prayer. Abu Salih (narrator ) said, \"Then the poor Muhajirin returned to the Prophet and said, 'Our rich brothers have heard what we have done and then they have practiced what we have done. Then the Prophet said, 'That is the primacy of Allah which is given to whoever he wants.\" (Muslim history from Abu Salih from Abu Hurairah) This verse closes with the assertion that Allah is very wide in His gifts and great in His gifts. He gives people whatever He wants according to His will; expanding his sustenance in the world, being awarded various favors, being told where he should be grateful, then being rewarded in the afterlife with a pleasant reply, namely heaven Jannatun Na'im."
		   },
		   {
			"id": 5097,
			"surah": 57,
			"ayat": 22,
			"tafsir": "This verse explains that all disasters and calamities that befall the surface of the earth, such as earthquakes, floods and other natural disasters as well as disasters that befall humans, such as accidents, diseases and so on, have been determined to occur beforehand and are written in the Lawh Mahfudz, before Allah created creatures. -His. This means that nothing happens in nature that escapes the knowledge of Allah and is not written in the Lawh Mahfudz. Determining everything that will happen is very easy for Allah, because He is All-Knower of all things, both those that have existed and those that will exist in the future, both big and small, visible and invisible. This verse is a warning for some Muslims who still believe in divination, like to ask something from cemeteries that are considered sacred, ask shamans and so on about what will happen. Let them only believe in Allah alone, because only He determines everything. Believing in the existence of supernatural powers, apart from Allah's power, includes associating Him with His creatures and means not believing in monotheistic rububiyyah that exists in Allah. ("
		   },
		   {
			"id": 5098,
			"surah": 57,
			"ayat": 23,
			"tafsir": "In this verse, Allah swt states that all events are determined before they occur, so that humans are patient in accepting Allah's trials. God's trials are sometimes in the form of tribulation and calamity, sometimes in the form of pleasure and joy. Therefore, don't be too sad to accept the tribulations and calamities that befall you, on the other hand, don't be too happy and overjoyed to receive something that pleases your heart. The best attitude is to be patient in accepting the disasters and calamities that befall and to be grateful to Allah for each of the blessings He bestows. This verse is not to prohibit Muslims from being happy and sad, but the intention is to prohibit Muslims from being overly happy and sad. 'Ikrimah said, \"There is no one but he is in a state of sadness and joy, but let him make that joy a sign of gratitude to Allah and that sadness a sign of being patient.\" At the end of this verse it is emphasized that a person who is too happy to receive something that pleases him and is too sad to receive a disaster that befalls him is a person who has signs of tabkhil and arrogance in himself, as if he only thinks about his own interests. Allah swt states that He does not like people who have miserly and arrogant traits."
		   },
		   {
			"id": 5099,
			"surah": 57,
			"ayat": 24,
			"tafsir": "People who are arrogant and arrogant are people who, when they receive a favor, pleasure or wealth, think that all of this was obtained solely because of their own ability and intelligence. Because he tried, he got it, not because of God's help and grace to him. Then Satan whispered in his ear that he was a strong and capable person, not needing the help of others. Because he is sure of his own abilities, he feels he does not care about others and gives to others. If he gives and cares for others he will become poor. This belief is also conveyed to other people and encourages other people to have the same belief, namely to be miserly so as not to become poor. In this verse it is emphasized that people who have the characteristics as above are people who turn away from God's commands. Allah commands that humans are humble, like helping others, helping the poor, spending in the way of Allah and so on, but they recommend and do the opposite. Allah states that their attitude and actions like that will not harm Allah in the slightest, but will harm themselves, because Allah does not need the slightest of their possessions and gifts, but they are the ones who need it. Allah is Most Praised because He is the One who bestows favors on all His creatures. Another verse which has the same meaning as this verse, is: And to Allah belongs what is in the heavens and what is in the earth, and indeed, We have commanded those who were given the scriptures before you and (also) you to fear Allah God. But if you deny, then (know), to Allah belongs what is in the heavens and what is in the earth, and Allah is Rich, Most Praised. (an-Nisa'\/4: 131)"
		   },
		   {
			"id": 5100,
			"surah": 57,
			"ayat": 25,
			"tafsir": "Allah explains that He has sent messengers to His people with strong evidences to prove the truth of His message. Among the evidences, are the miracles given to the apostles. Among these miracles such as not being burned by fire as a miracle of Prophet Abraham, true dreams as a miracle of Prophet Joseph, a stick as a miracle of Prophet Musa, the Qur'an as a miracle of Prophet Muhammad saw and so on. Each apostle sent was tasked with conveying Allah's religion to his people. Religious teachings are sometimes written in sahifahs and sometimes contained in a book, such as the Torah, Psalms, Bible and Al-Qur'an. The teachings of religion are instructions for humans to achieve happiness in life in this world and in the hereafter. As a basis for regulating and fostering society, every religion brought by the apostles has a principle of \"justice\". Justice must be upheld by the apostles and their followers in society, namely the justice of the ruler over his people, the justice of the husband as the head of the household, the justice of the leader over those he leads and so on, so that all members of society are equal in law, attitude and treatment. Besides that, Allah swt bestowed upon the \"iron\" man a gift of incalculable value and benefits. With iron, various kinds of human needs can be made, from large to small, such as various types of vehicles on land, at sea and in the air, household needs and so on. It is also with iron that humans can build up the strength of their nation and state, because all kinds of equipment for national defense and security are made from iron, such as guns, war vehicles and so on. Of course all of that is only permitted by Allah to use it to uphold His religion, uphold justice and maintain the security of the country. An encyclopedia of modern science describes the chemical elements present on our earth as having an astonishing variety, some of which are hard to find but some of which are abundant. Some are visible to the naked eye because they are liquids and solids, but some are invisible because they are gases. About 300 years ago only 12 elements were known, of which the element Ferrum (Fe) had atomic number 26 on the Periodic Table of the Elements. Fe is better known as iron. Iron is one of the easiest elements to find on Earth. It is estimated that 5% of the Earth's crust is iron. Most iron is found in the form of ferrous oxide, such as the minerals hematite, magnetite and taconite. It is also strongly suspected that the earth's surface contains a lot of iron-nickel metal alloys. It is said that the element iron is not the original element \"belongs\" to the earth but it comes from outside the earth. Experts agree that meteorites contributed to the formation of the iron-nickel alloys that exist on earth. Perhaps, this is the \"way\" of God bringing \"the element of iron to the surface of the earth long before humans existed. In general, iron is a metal that is obtained from iron ore, and is found not in a free state but always in the form of compounds or mixtures with other elements. Therefore to obtain the element iron, other elements must be separated which is usually done through a chemical process.As in the iron and steel industry, iron is widely used, namely in the form of alloys.There are types of mixtures consisting of different metals but there are also materials the mixture used comes from non-metals, for example carbon. Everything is done with the aim of getting the desired quality according to needs and with consideration to reduce production costs. The physical properties of the element Fe if it is heated continuously before melting it will experience a melting phase. The phase in which iron in the solid state but it has a malleable property.Therefore in the phase or kead This iron is easy to form, even if only by using simple traditional technology, such as blacksmith technology. With this simple technology, in the history of human development the use of iron has been used in many aspects of everyday human life, including for war. Sayyid Quthub in his writings describes, \"Allah sends down iron '¦in which there is great strength¦, namely strength in war and peace. Then '¦And so that Allah knows who helps His (religion) and His messengers when Allah does not see him ¦ This passage implies jihad with weapons. A presentation that is in harmony with the context of the surahh which is talking about sacrifice with life and property.\" In the knowledge of biology, the element iron (Fe) in the form of iron is also very much needed by all organic creatures, except for a small number of bacteria. As in our body iron is needed. In the human body iron is mostly found in a stable metal-protein (metalloprotein) form, otherwise it can cause free radicals which tend to be toxic to cells. In the human body iron is involved in the formation of red blood cells. While red blood cells are very important because it is he who carries oxygen (oxygen) from the lungs to all the tissues in our body. Living tissue requires a supply of acids. The more active a tissue is, the more it needs acid. A lack of iron in the blood can cause anemia, possibly because the number of red blood cells or hemoglobin (a material that contains red iron that can transport acids) in red blood cells is reduced than usual. Allah swt explained that He did this so that He would know which of His servants followed and helped the religion conveyed by the apostles sent by Him and who denied it. With that gift Allah wants to test humans and know the attitude of humans towards His favors. A man who is obedient and submits to God will do everything that was said by the apostles, because he is sure that all his actions, attitudes and thoughts are known to God, even though he does not see God watching over him. At the end of this verse, Allah swt confirms to people that He is All-Powerful, that nothing can defeat Him, that He is All-Mighty and that no one can escape the punishment He has ordained."
		   },
		   {
			"id": 5101,
			"surah": 57,
			"ayat": 26,
			"tafsir": "Allah explained that He had sent Noah as a messenger to his people, then He sent Abraham as a messenger to other people. It was also explained that the apostles who came later after the two apostles, all came from the descendants of the two of them, none of the apostles sent by Allah were not from the descendants of the two of them. This can be proven true up to the last apostle of the Prophet Muhammad. It was explained that not all of Noah's and Abraham's descendants believed in Allah, some of them believed, but most of them did not believe, they were wicked people, who reduced, added and changed the religion brought by the apostles according to the wishes of Eve. their lust. From this verse it is understood that it is not certain that a pious servant will have his child become a pious servant too, but a lot depends on how a person educates and raises his child. This verse is also a stern warning from Allah to those who have believed and followed the apostles sent to them, but they did not follow the teachings brought by the apostles."
		   },
		   {
			"id": 5102,
			"surah": 57,
			"ayat": 27,
			"tafsir": "Thus Allah sent the apostles, then accompanied by the apostles after him, to convey His religion to humans, so that there is no reason for humans in the hereafter to say, why they were punished even though no apostle was sent to them. In this verse Allah specializes in information about Jesus because many of his followers were wicked, namely changing, adding and subtracting the teachings conveyed by Jesus. It was explained that Jesus was the son of Maryam, given to him the Bible, containing the main teachings that his people should use as a guide in achieving happiness in life in this world and in the hereafter and as a refinement of God's teachings contained in the Torah which had been revealed to the Prophet Musa before. Then explained the characteristics of the followers of Prophet Isa: 1. Allah SWT made in their hearts a sense of mutual support for each other, they tried to avoid the destruction that came to them and their brothers and tried to repair the destruction that happened to them. 2. Between them there is a relationship of affection and want good for themselves. Even though they already have commendable and good qualities as taught by Prophet Isa, they still commit wickedness, namely making up rahbaniyyah, by imposing provisions prohibiting marriage for their priests, even though marriage is a sunna of Allah which has been stipulated for His creatures. They determine the rabbaniyah with the intention of getting closer to Allah, but Allah never determines it. Because of that they are people who like to make things up that are contrary to sunatullah, namely not making marriage laws for their priests whose purpose is to continue offspring and maintain human survival. Another wicked deed they did, was that they changed, added and subtracted the religion brought by the Prophet Isa, which is contained in the Bible, because it followed their passions. At the end of this verse, Allah confirms that He will give multiple rewards to those who believe, follow the Shari'a brought by the apostles, do not make up nonsense and do not add or change His books. As for the wicked, there will be a very severe punishment."
		   },
		   {
			"id": 5103,
			"surah": 57,
			"ayat": 28,
			"tafsir": "Allah swt ordered the Children of Israel who had believed in Isa bin Maryam as His apostle and messenger to believe in Muhammad saw who came after that, follow the commands and stop His prohibitions contained in the Qur'an and Hadith. This command essentially strengthens God's commands contained in the Bible revealed to Prophet Isa. If the Children of Israel followed Allah's commands, then Allah promised them a reward double the reward that would be received by those who believe in the Prophet Muhammad alone. Besides, it will forgive their sins, because He forgives the sins of those He wills. If what Allah promised to the followers of Prophet Isa and they also believe in Muhammad are: 1. They will be rewarded twice as much. 2. They will be enlightened by the light of guidance in facing adversity and calamity on the Day of Judgment and in going to heaven which is full of pleasures. 3. Allah swt forgives the sins they have committed. In the following hadith it is explained that those who will get double the reward are: Narrated by ash-Sha'biy from Abu Burdah from his father Abu Musa al-Asy'ari, he said, \"Rasulullah SAW said, 'Three he who is given a double reward, that is, a person of the Book who believes in his prophet and also believes in me, he will have two rewards, and a slave who fulfills the right of Allah and the right of his master, he will have two rewards, and the one who educates his female slave properly and then is released and married, he will receive two rewards.\" (History of al-Bukhari and Muslim)"
		   },
		   {
			"id": 5104,
			"surah": 57,
			"ayat": 29,
			"tafsir": "In this verse Allah rejects the opinion of the Children of Israel who say that the apostles and prophets were only raised from their descendants. Allah raised Prophet Muhammad saw not from the descendants of the Children of Israel, so that they would know that only He determines everything and those who will get double the reward are only people of the book who believe in Muhammad saw only, if they do not believe in Prophet Muhammad saw they will not will get any reward. At the end of this verse Allah explains that He has unlimited gifts, which will be bestowed on those whom He wills."
		   }
	]
}
