{
	"tafseer": [
		{
			"id": 5200,
			"surah": 64,
			"ayat": 1,
			"tafsir": "Allah explains that whatever is in the heavens and on earth glorifies Him. This means that what is in the heavens and on earth shows the holiness and perfection of Allah and all creatures submit and surrender to Him. He is the Maharaja who has the authority to act according to His will towards all that exists, entitled to be praised for His creation, because He is the source of all goodness. Allah is Almighty over all things, what He wills must manifest and come true without anything being able to hinder Him. As for what He does not will, it will not exist."
		   },
		   {
			"id": 5201,
			"surah": 64,
			"ayat": 2,
			"tafsir": "This verse explains that it is Allah who creates everything that exists according to His will. Allah says: Allah is the creator of all things and He is the Sustainer of all things. (az-Zumar\/39: 62) Basically when humans are born in a state of fitrah, but some of these humans choose disbelief that is contrary to their nature and some choose faith according to the demands of their nature, as the words of the Prophet saw: Every child is born in a state of nature (Islam). So it is the two parents who will make him a Jew, Christian, or Zoroastrian. (Al-Bukhari and Muslim) If humans wanted to think about what happened and what is happening in this universe, it would be enough to guarantee that humans would return to their rights by choosing faith and being grateful for the blessings that have been bestowed upon them. However, humans are not aware and aware of all that, so that division occurs, they deny God who created them, and the blessings that have been bestowed upon them. It is appropriate for a human being to realize that Allah sees everything he does, and in the hereafter he will be rewarded for all of that. The good ones are rewarded with heaven, while the bad ones are rewarded with torment and put into hell Hell, the worst places to live, as Allah says: Verily, Hell is the worst place to live and a place to live. (al-Furqan\/25: 66)"
		   },
		   {
			"id": 5202,
			"surah": 64,
			"ayat": 3,
			"tafsir": "This verse explains that Allah created the heavens and the earth with the right purpose, full of wisdom, and guarantees the happiness of his creatures in this world and the hereafter. He is also the one who makes humans in the best possible form, different from other creatures. Humans will be held accountable for all their actions in the world and then get a proper reward, Allah says: Indeed, We have created humans in the best form. (at-Tin\/95: 4) In another verse Allah says: And be afraid of the day (when) you are all returned to Allah. Then everyone is given a perfect reward according to what he has done, and they are not wronged (harmed). (al-Baqarah\/2: 281) An explanation regarding creation with the right purpose can be seen in the description of the same matter in surahh ad-Dukhan\/44: 38-39 and sad\/38: 27."
		   },
		   {
			"id": 5203,
			"surah": 64,
			"ayat": 4,
			"tafsir": "This verse states that Allah is All-Knower of what is in the heavens and on earth. Nothing is hidden from Him. It is He who arranges things according to His extensive knowledge and His power which encompasses and encompasses everything according to His will, as Allah says: Surely it is His business, if He wills something, He only says to it, \"Be it!\" Then be that something. (Yasin\/36: 82) Allah knows everything, both what is kept secret and what seems real. So humans should act in accordance with what is outlined in the religion of Allah brought by our master the Prophet Muhammad, namely Islam, to gain His pleasure, obtain multiple rewards, and be happy in this world and the hereafter. This fourth verse closes with the assertion that Allah is All-Knowing of all that is in the heart, nothing is hidden from Him. Allah's Word: Indeed, Allah is All-Knower of all things. (al-'Ankabut\/29: 62) In another verse Allah says: Surely Allah is All-Knowing of all that is in the heart. (Luqman\/31: 23)"
		   },
		   {
			"id": 5204,
			"surah": 64,
			"ayat": 5,
			"tafsir": "When the hypocrites were invited to come to the Messenger of Allah so that he would ask Allah for forgiveness for the sins they had committed, they flatly refused the invitation. They turned their heads away in a manner that conveyed arrogance and arrogance. This is also mentioned in the word of Allah: And when it is said to them, \"Come (obey) what Allah has sent down and (obey) the Messenger,\" (undoubtedly) you (Muhammad) will see the hypocrites blocking you hard. (an-Nisa'\/4: 61)"
		   },
		   {
			"id": 5205,
			"surah": 64,
			"ayat": 6,
			"tafsir": "Allah warned the polytheists of Mecca about the incidents that had been experienced by people who denied the apostles before them, such as Noah's, Hud's, Saleh's, and others. They have been subjected to various punishments and torments of various forms. Some are in the form of floods that drown and destroy what is on the earth, some are in the form of hurricanes that blow away and destroy the buildings where they live, and so on. (6) Allah explained that the reasons for the various punishments inflicted on the earlier people were because of their carelessness in belittling the apostles after they were given clear information and shown real miracles. They said, \"It's a miracle that the person who will guide us is an ordinary human being who doesn't have the slightest advantage over us. He doesn't have a mind superior to ours, and doesn't have the strength and power to subdue us.\" In another verse Allah says: So they said, \"How shall we follow a human (ordinary) among us?\" (al-Qamar\/54: 24) They did not know that the prophets and apostles were people whom Allah had chosen according to His will, as explained in His word: Allah knows best where He places His apostolic task. (al-An'am\/6: 124) After their long denial and their disobedience dragged on, Allah destroyed them. Allah does not need them and does not have the slightest interest in them. He is Almighty, does not have the slightest need for anything, Praiseworthy for all the blessings that have been assigned to His creatures."
		   },
		   {
			"id": 5206,
			"surah": 64,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains that polytheists think that there will not be a resurrection day, a day of reckoning, and a day of reckoning. Their opinion is also expressed in the verse which reads: If we have become soil, will we (returned) become new creatures? (ar-Ra'd\/13: 5) Allah's Word: Who can revive the bones, which have been crushed? (Yasin\/36: 78) The opinion of the polytheists who are wrong is rejected by Allah firmly. God declares that there must be a day of resurrection and a day of vengeance, and that all humans will be resurrected on that day. Then it is announced everything they have ever done in the world down to the smallest to be reckoned with and rewarded. This is very easy for Allah and there is no difficulty at all. Allah's Word: Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36:79) In another verse Allah says: And those who disbelieve say , \"The Doomsday will not come to us.\" Say, \"It will definitely come, by my Lord, who knows the unseen, the Doomsday will surely come to you. (Saba'\/34: 3)"
		   },
		   {
			"id": 5207,
			"surah": 64,
			"ayat": 8,
			"tafsir": "In this verse, Allah orders the polytheists, after being confirmed that the Day of Resurrection will surely come, to believe in Him, His Messenger, and the light of the Qur'an which He has sent down, which will guide and guide mankind. to the right path. Their deeds are not hidden from Allah. Everything is known to Him and will be rewarded on the day of resurrection, both good and bad."
		   },
		   {
			"id": 5208,
			"surah": 64,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains that on the Day of Judgment He will gather those who were former and those who came later in a field, as He says: That is the day when all mankind is gathered (to be reckoned with), and that is the day that is witnessed (by all creature). (Hud\/11: 103) Allah's Word in another verse: Say, \"(Yes), indeed those who were before and after, surely all will be gathered at a certain time, on an understandable day.\" (al-Waqi'ah\/56: 49-50) On that day will be examined and rewarded charity that has been done every human being in this world. All deeds, be they wrong or right, will be exposed on that day. That day is called \"tagabun\" day. Unbelievers who have exchanged the afterlife for the world, namely choosing the pleasures of this world from the pleasures of the hereafter, will lose and gain nothing. As for the believers who have sacrificed themselves to gain heaven, they are the ones who are lucky and will not lose in the slightest. In a hadith it is narrated: No one enters heaven unless he is shown the place (which was reserved for him) in hell, if he does bad things to increase gratitude. And no one will enter hell unless he is shown the place (which was reserved for him) in heaven, if he does good so that his regret will increase. (Ahmad and al-Bukhari's history from Abu Hurairah) Those who believe in Allah and obey His commands, stay away from His prohibitions, all their mistakes and sins will be erased, and forgiven and entered into heaven where rivers flow underneath river. They are eternal in it, will not die, and will not come out of it. That is an advantage and happiness that is incomparable, because it has been spared from destruction and destruction. Allah says in another verse: But whoever comes to Him in a state of faith, and has done good deeds, then they are the ones who get a high (noble) degree, (namely) the heavens of 'Adn, beneath which rivers flow river, they are eternal in it. That is the reward for those who purify themselves. (thaha\/20: 75-76)"
		   },
		   {
			"id": 5209,
			"surah": 64,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that those who deny His oneness, and deny the verses of the Qur'an which were revealed to the Prophet Muhammad, are the inhabitants of hell. They will live in it eternally, as Allah says: As for those who disbelieve and deny Our verses, they are residents of hell, they will abide therein. (al-Baqarah\/2: 39) In another verse Allah says: As for those who disbelieve and deny Our verses, they are the inhabitants of hell. (al-Ma'idah\/5: 10) What a loss for the inhabitants of hell because that place is the worst place to return to, and the worst place to live, as Allah says: Indeed, Hell is the worst place to live and a place to live. (al-Furqan\/25: 66)"
		   },
		   {
			"id": 5210,
			"surah": 64,
			"ayat": 11,
			"tafsir": "Allah explains that what befalls humans, whether it is the pleasures of this world or in the form of punishment, is qadha' and qadar, according to Allah's will that has been determined on earth. In trying hard, humans should not regret and feel disappointed if they encounter things that are not in accordance with their efforts and desires. It is beyond his ability, because it is God's provision that will apply and come true. As He said: Say (Muhammad), \"Nothing will happen to us but what Allah has ordained for us.\" (at-Taubah\/9: 51) Allah gives instructions to a believer to broaden his chest, accept with all pleasure what happens to him, whether according to what he wants or not, because he believes that everything is from Allah. Ibn Abbas interprets that Allah gives the believer in his heart a belief. Likewise, when someone is struck by a calamity, he says inna lillahi wa inna ilaihi raji'un, it is because of faith that causes patience and in the end the calamity is light for him."
		   },
		   {
			"id": 5211,
			"surah": 64,
			"ayat": 12,
			"tafsir": "Allah commands that humans obey Him and His Messenger by carrying out His commands and leaving His prohibitions. If they still disobey and obey, know that the Messenger of Allah's duty is only to convey what is his duty and obligation, as confirmed in the word of Allah: If you turn away, then know that the obligation of Our Messenger is only to convey (the message) clearly. (al-Ma'idah\/5: 92)"
		   },
		   {
			"id": 5212,
			"surah": 64,
			"ayat": 13,
			"tafsir": "Allah explains that He is God Almighty, there is no God but Him. So let us all acknowledge Him, serve Him sincerely, and not associate anything with Him, as explained in His words: (He is) the Lord of the east and the west, there is no god but Him, so make Him the protector. (al-Muzzammil\/73: 9) And also explained in another verse: And worship Allah and do not associate anything with Him. (an-Nisa'\/4: 36) Because Allah is the Creator and the Giver of sustenance. It is in Allah that the believers should place their trust. Allah's Word: And put your trust only in Allah, if you are believers. (al-Ma'idah\/5: 23)"
		   },
		   {
			"id": 5213,
			"surah": 64,
			"ayat": 14,
			"tafsir": "Allah explains that there are wives and children who are enemies to their husbands and parents who prevent them from doing good and drawing closer to Allah, hindering them from doing good deeds that are useful for their hereafter. Sometimes it even plunges them into immoral acts, unlawful acts prohibited by religion. Out of love and affection for his wife and children, so that both of them can live a luxurious and happy life, a husband or father does not hesitate to do things that are prohibited by religion, such as corruption and others. Therefore, he must be careful and patient with his wife and children. They need to be guided, not pushed too hard, better forgiven and not scolded, but forgiven. Allah himself is also Forgiving, more Merciful, as explained in His word: But if you are patient, it is better for you. Allah is Forgiving, Most Merciful. (an-Nisa'\/4: 25)"
		   },
		   {
			"id": 5214,
			"surah": 64,
			"ayat": 15,
			"tafsir": "Allah explains that the love of wealth and children is a trial. If not careful, will bring disaster. Not a few people, because of their excessive love for wealth and their children, dare to do nonsense and violate religious regulations. In this verse, wealth takes precedence over children because the tests and disasters of wealth are greater, as Allah says: Absolutely not! Truly, humans really transgress, when they see that they are self-sufficient. (al-'Alaq\/96: 6-7) Also explained in the words of the Prophet. Indeed, for every community there is a trial and in fact the trials of my people (the tough ones) are treasures there will not be excessive love for wealth and children, if his love for Allah is greater than his love for others, then he will get a big and multiple reward."
		   },
		   {
			"id": 5215,
			"surah": 64,
			"ayat": 16,
			"tafsir": "Allah commands that people who have wealth, children and wives fear Him with all their might and abilities, as explained by the words of the Prophet SAW: If I order you to do something, do it to the fullest and what I forbid you to do, then stay away from it. (Al-Bukhari's history from Abu Hurairah) In the word of Allah it is also explained: Fear Allah, truly fear Him and do not die except in a Muslim state. (Ali 'Imran\/3: 102) Furthermore, Allah commands believers to listen to and obey the commands of Allah and His messengers. Not affected by the surrounding circumstances, thus violating what is prohibited by religion. Property should be spent to relieve the suffering of the poor, help people who need help, and to help various activities that are useful for people and religion, which bring happiness in the world and the hereafter. That is much better than accumulating wealth and spoiling children. This 16th verse closes with an affirmation that people who stay away from stinginess and greed for wealth are lucky people. He will achieve his desires in this world and the hereafter, and be liked by his friends. In the afterlife, he will be very happy because he is close to his Lord, he is liked, he is pleased, and he is put into heaven."
		   },
		   {
			"id": 5216,
			"surah": 64,
			"ayat": 17,
			"tafsir": "Allah explains that those who lend to Him with good loans while in the world, namely spending their wealth in a way that pleases Him, drawing closer to Him with sincerity and a relieved heart, will be multiplied in reward. One kindness will be rewarded with ten to seven hundred merits. In fact, it will be multiplied more than that, according to the sincerity that is firmly in the heart, as explained in the word of Allah: Whoever lends Allah with a good loan, Allah multiplies it in exchange for him with a lot. (al-Baqarah\/2: 245) Apart from that, Allah will forgive his sins. He is the Most Rewarding, multiplies the reward for those who obey Him, more Forgiving. Allah does not hasten the punishment of sinners, even though their sins and mistakes are piled up."
		   },
		   {
			"id": 5217,
			"surah": 64,
			"ayat": 18,
			"tafsir": "This verse explains that Allah is All-Knowing of the unseen and what is visible. Whatever is done by humans, everything is recorded and stored by His side. Not a single one has escaped even as big as a mustard seed, as explained by Allah in His word: What book is this, nothing is left, the small and the large but all are recorded,\" (al-Kahf\/18: 49) The verse above encourage people to spend, because all actions must be seen by Allah and rewarded multiplied. Deeds recorded in one's book will be rewarded by Allah very carefully. The good ones are rewarded with goodness, namely heaven, and the bad ones are rewarded with torment in hell. He is almighty and almighty.All His wishes come true, the All-Wise governs His creation, grants what is good to whom He wills."
		   }
	]
}
