{
	"tafseer": [
		{
			"id": 3470,
			"surah": 31,
			"ayat": 1,
			"tafsir": "This surah Luqman begins with hijaiyah letters \"Alif Lam Mim\". Next, see the tafsir of Alif Lam Mim in volume I."
		   },
		   {
			"id": 3471,
			"surah": 31,
			"ayat": 2,
			"tafsir": "This verse explains that the verses of the Al-Qur'an are arranged neatly and carefully, with a style of language that has high literary value, and with a noble and noble purpose for humans who follow its instructions. There are no flaws, blemishes, and deficiencies in it, even if it's a little. Nor do any of his verses contradict each other. His orders are easily carried out by anyone, under any circumstances and wherever he is."
		   },
		   {
			"id": 3472,
			"surah": 31,
			"ayat": 3,
			"tafsir": "These verses emphasize that the verses of the Qur'an contain instructions for humans in navigating all aspects of life in this world that will accompany and lead them to achieve happiness in the afterlife. If humans open the pages of history from ancient times to the present, they will conclude that with the sending of the Prophet Muhammad by Allah with the Al-Qur'an containing the main points of the treatise he brought, the doors of goodness were opened for the universe. With that, the development of science with all kinds of branches also increases. Even though there had been high cultures as a result of human thought in the previous period, such as the cultures of ancient Egypt, Babylonia, Greece, and so on, they did not yet have strong and solid foundations to achieve further and perfect human development in the future. . In the field of life and human life, the Qur'an provides instructions so that humans maintain a balance between physical and spiritual life, as well as balance in achieving worldly and spiritual life. Likewise in social and state life, what is lawful and good to eat may be eaten and what is not good should not be eaten. There are also guidelines on how to speak and socialize well and so on. The Al-Qur'an gives instructions and rules, then humans process and adapt themselves to the environment around them based on those instructions and rules, which ones are the best and most appropriate to implement, and which ones must be shunned and abandoned. People who think, contemplate, process, and practice the instructions of the Qur'an to the best of their ability are \"those who are muhsin\"."
		   },
		   {
			"id": 3473,
			"surah": 31,
			"ayat": 4,
			"tafsir": "In these verses it is stated that among the signs of a muhsin person are: 1. Always perform the five daily prayers that are required of him at each predetermined time. He always tries to carry out the prayer as well as possible, complete with pillars and conditions. 2. Always pay zakat if the obligatory conditions have been fulfilled. He believes that paying zakat is an obligation because in his wealth there are other people's rights that must be handed over immediately. 3. Convinced that there is still life after death, namely in the hereafter. In the afterlife, every human being will get perfect justice from Allah. Good deeds are rewarded with heaven and bad deeds are rewarded with the torments of hell."
		   },
		   {
			"id": 3474,
			"surah": 31,
			"ayat": 5,
			"tafsir": "Those who have the signs and characteristics mentioned in the previous verses are those who follow the guidance of their Lord. He is lucky because he gets good results and pleases him, after working and trying to follow the instructions of the Qur'an. A person who does good deeds will get good luck in this world and in the hereafter, and this will be obtained by doing good deeds."
		   },
		   {
			"id": 3475,
			"surah": 31,
			"ayat": 6,
			"tafsir": "This verse explains that there are people among humans who do not pay attention to words that are beneficial, which can increase people's faith in religion and improve their morals. They prefer to say words that are of no use, convey superstitions, tales of the past, jokes that have no meaning. Among the examples is what Nadhar bin Haris did, by buying books in Persian that contained stories, then he mocked them at the Quraysh people. If necessary, they hire singers to let the crowds hear their voices. The contents of the songs and their voices are made in such a way as to stimulate those who listen to them to do prohibited acts, and further distance them from religion. It was narrated from Nafi', he said, \"I was walking with 'Abdullah bin 'Umar on a trip, then I heard the sound of a flute. 'Abdullah then put his finger in his ear hole so as not to hear the sound of the flute and he turned by another way. Then he said, Nafi do you still hear that sound? I replied, 'No. So he took his finger out of his ear and said, 'This is how I see what the Messenger of Allah does when he hears such a sound.\" In another narration from 'Abdurrahman bin 'Auf that the Messenger of Allah said: I am prohibited from (listening to) two kinds of sounds (sounds) that are meaningless and cause evil deeds, namely the sound of neglectful songs and satanic flutes and (second) the sound of when disaster strikes, namely face-slapping, torn clothes, and satanic chants. (History of at-Tirmidhi) According to Ibn Mas'ud, what is meant by the words lahw al-hadith in this verse is singing because it can cause hypocrisy in the heart. Some scholars say that all sounds, words, songs, sounds that can damage obedience to Allah and encourage those who hear them to do forbidden actions, are called lahw al-hadith. From the verses and hadiths above, it can be concluded that what is prohibited is listening to songs that can arouse lust and lead to adultery, such as songs that contain dirty words. This includes singing or music that causes listeners to do prohibited acts, such as drinking khamr and so on. Listening to songs or music whose purpose is to broaden the mind during breaks or holidays is not prohibited. They were even told to listen to it if the singing or music had a good meaning, increased faith, improved character, and increased enthusiasm for work and struggle. Qusyairi said, \"They beat the tambourine in front of the Prophet when he entered the city of Medina, then Abu Bakr wanted to stop him, so the Messenger of Allah said, 'Let them beat the tambourine, O Abu Bakr, until the Jews know that our religion is not narrow. They The beating of the tambourine is accompanied by songs and verses, between the verses of which it reads: \"Nahnu banatun Najjar, habbadha Muhammadun min jar\" (we are Bani Najjar women, how good our fate would be if Muhammad were to be our neighbour).\" In this verse, Allah explains the consequences of hearing and playing forbidden songs, music, and words. They will receive a very humiliating punishment on the Day of Judgment due to their actions that do not heed the right and choose wrong, and exchange guidance for sin."
		   },
		   {
			"id": 3476,
			"surah": 31,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains the characteristics of those who exchange Allah's books with useless tales. When Allah's verses are read to them, they turn their backs on them in a haughty and arrogant manner, as if they had not heard them because their ears were clogged and deaf. In another verse Allah says: Say, \"The Qur'an is a guide and a cure for those who believe. And those who do not believe in their ears there is a blockage, and (the Qur'an) is darkness for them (Fushshilat\/41: 44) Because of this, they will receive a painful punishment in the hereafter as a reward for their deeds and actions."
		   },
		   {
			"id": 3477,
			"surah": 31,
			"ayat": 8,
			"tafsir": "This verse explains that for those who believe in Allah, justify the apostles, and do good deeds, both those contained in the books that He sent down and those conveyed by the apostles, stop everything that He has forbidden, do not listen to songs, fairy tales , and all kinds of sounds that can undermine faith, reduce obedience, and lead to evil deeds, a heaven full of enjoyment is provided. In it are all kinds of pleasures one could desire, such as food, drink, clothing, rooms, and so on."
		   },
		   {
			"id": 3478,
			"surah": 31,
			"ayat": 9,
			"tafsir": "They will remain in that heaven forever. All of that is God's promise to His creatures, which is sure to happen, and will not be denied in the slightest. On the other hand, the punishment that He inflicted on those who sinned and prevented people from following His path was very severe. Allah is Wise in managing and completing all the affairs of His creatures."
		   },
		   {
			"id": 3479,
			"surah": 31,
			"ayat": 10,
			"tafsir": "This verse explains several signs and proofs of Allah's power in nature, namely: 1. Creating the universe with all its contents, in the form of countless planets. The many planets are huge balls floating in space. In this verse it says \"without a pillar as you see\". From these words it can be understood that the sky has a pillar, namely a force that supports it and functions as a pillar, so that the planets do not fall apart. Only people of knowledge can see those solid pillars with their inner knowledge. 2. Allah created mountains on the surface of the earth so that the earth is stable, does not shake, so that humans, animals and plants can live peacefully on it. The mountain seems to be a peg that can fix the earth's surface like the masts of a towering ship, which can stabilize a ship sailing and anchoring in the middle of the ocean, so that it does not sway. Apart from that, mountains also have other benefits for humans, including to regulate the distribution and distribution of rainwater that pours out from the sky, so that the water remains on the surface of the earth even though it is the dry season. There are many other benefits of mountains for humans and other creatures of God. 3. Allah created animals that cannot be counted in number and type, shape and color, from the largest to the smallest so that they cannot be seen by the eye. All the animals that were created have benefits and benefits. Sometimes humans, because they do not know the benefits and uses of these animals, they kill and annihilate them, so that without realizing it, damage occurs in nature. However, Allah knows with certainty the number, type, color, uses, and benefits of all the animals He created. 4. Allah sends down rain from the sky. The rain comes from a cloud that He drives to a certain place, then turns into rain that wets the surface of the earth. With the rain water, all kinds of diverse plants grow, with beautiful colors and many benefits. According to scientists, the sky with its visible reality, as far as the eye can see, is not a single pillar supporting it. Human logic requires that there is a support pillar so that it does not collapse. However, Allah with His power is able to act beyond the reach of human logic. Humans and all creatures that live on earth are under the earth's gravitational system. Thus, they can work stably on earth, not floating in the air. When they leave the earth and enter a gravitational realm, humans also know that there all objects float weightlessly, including humans themselves. It is very easy for Allah to make anything according to His will, including making the sky \"light\" weightless so that no pillars are needed to support it. But it can also be considered that the force fields that exist in this universe as \"virtual poles\" that are not visible to the eye?"
		   },
		   {
			"id": 3480,
			"surah": 31,
			"ayat": 11,
			"tafsir": "In this verse, Allah confirms that what is mentioned in the verse above is Allah's creation, both in the heavens and on earth. Nothing has partnered with Allah in creating all these creatures, and nothing has power over it other than Allah. Everything necessary for the survival of the creature, where it can live and where it will die, as well as the uses and harms that the creature can cause, are all known, arranged and cared for by Allah. Then Allah challenges those who associate partners with Him, \"Try to show me what those idols and statues that you worship have created. Do these statues do anything so that they can be believed to be Gods besides Me.\" At the end of this verse it is explained that those who worship God besides Allah are stupid, misguided, and follow their own desires. They are people who are unjust to themselves, so they are punished for following their lusts."
		   },
		   {
			"id": 3481,
			"surah": 31,
			"ayat": 12,
			"tafsir": "This verse explains that Allah bestowed upon Lukman wisdom, namely subtle feelings, reason, and wisdom that can convey it to true knowledge and the right path to eternal happiness. Therefore, he is grateful to Allah who has given him the favor. This shows that the knowledge and teachings conveyed by Lukman were not derived from the revelations that Allah revealed to him, but were solely based on the knowledge and wisdom that Allah had bestowed upon him. Based on the narrations of Ibn Abi Syaibah, Ahmad, Ibn Abi Dunya, Ibn Jarir ath-Tabari, Ibn Mundzir, and Ibn Abi Hatim from Ibn 'Abbas that Lukman was a servant\/slave and carpenter from Habasyah. Most scholars say that Lukman is a wise man, wise, and not a prophet. There are many narrations that explain the origins of Lukman, and these narrations do not match one another. Said bin Musayyab said that Lukman was from Sudan, south of Egypt. Zamakhsyari and Ibn Ishaq say that Lukman is a descendant of the Children of Israel and one of the grandchildren of Azar, Ibrahim's father. According to this opinion, Lukman lived before the arrival of the Prophet David. Meanwhile, according to al-Waqidi, he was one of the qadhi of the Children of Israel. There is also a history that explains that Lukman was only a very pious person (wali), not a prophet. Regardless of all the opinions in the history above, whether Lukman was a prophet or not, whether he was a Sudanese or a descendant of the Children of Israel, what is clear and certain is that Lukman is a servant of Allah who has been endowed with wisdom, has the correct creed, understands the basics the religion of Allah, and know the noble character. His name is mentioned in the Qur'an as one of those who always serve Him. As a sign that Lukman is a servant of Allah who always obeys Him, feels His greatness and power in this universe, is his attitude of always being grateful to Allah. He felt himself very dependent on God's grace and felt he had received wisdom from Him. According to a history from Ibn 'Umar that he once heard the Messenger of Allah say, \"Lukman is not a prophet, but he is a servant who does a lot of contemplation, he loves Allah, so Allah loves him too.\" At the end of this verse, Allah explains that a person who is grateful to Allah means that he is grateful for his own sake. Because, Allah will bestow upon him a lot of rewards because of that gratitude. Allah says: Whoever is grateful, then indeed he is grateful for (the good of) himself, and whoever denies, then indeed my Lord is Rich, Most Glorious. (an-Naml\/27: 40) Sufyan bin Uyainah said, \"Whoever performs the five daily prayers means he is grateful to Allah, and the person who prays for his parents after each prayer, he has been grateful to both of them.\" People who deny Allah's favors and are not grateful to Him mean that they have wronged themselves, because Allah will not reward them and even torture them with painful torments. Allah Himself does not need the gratitude of His servant because the gratitude of His servant will not benefit Him in the slightest, nor will it add to His glory. He is Almighty, Most Praised."
		   },
		   {
			"id": 3482,
			"surah": 31,
			"ayat": 13,
			"tafsir": "Allah reminded Rasulullah of the advice that Lukman had given to his son when he taught him lessons. The advice is, \"O my son, do not associate anything with Allah, actually associating partners with Allah is a very great injustice.\" Associating partners with Allah is said to be tyranny because that act means placing something out of place, namely equating something that bestows favors and gifts with something that is unable to provide all of that. Equating Allah as the source of favors and gifts with statues that cannot do anything is an act of wrongdoing. This act is considered a great tyranny because what is equated with a creature who cannot do anything is God the Creator and Ruler of the universe, to whom all creatures should serve and dedicate themselves. Al-Bukhari narrated from Ibn Mas'ud that when the verse was revealed: Those who believe and do not mix their faith with shirk, they are the ones who feel safe and they are guided. (al-An'am\/6: 82) anxiety arose among the companions of the Prophet Muhammad. They argue that it is very difficult to keep faith from mixing with tyranny. They then said to the Messenger of Allah, \"Which of us has not confused faith with injustice?\" So the Prophet replied, \"That's not what you mean, didn't you hear Lukman's words, 'O my son, don't associate anything with Allah, actually associating partners with Allah is a great injustice.\" From this verse it is understood that among the duties of a father to his children is to give advice and lessons, so that his children can follow the right path and avoid going astray. This is in accordance with the word of Allah: O you who believe! Protect yourself and your family from the fires of hell whose fuel is humans and stones. (at-Tahrim\/66: 6) If you pay attention to the sentence structure of this verse, it can be concluded that Lukman forbade his son to associate partners with God. This prohibition is something that Lukman deserves to convey to his son because associating partners with Allah is the greatest sin. Children are the next generation of their parents. The ideals that have not been achieved by parents while living in the world are expected to be achieved by their children. Likewise the beliefs held by their parents, in addition to noble character, children are expected to inherit and have all the values that their father followed in the future. Lukman has done a very important task for his son, by conveying the true religion and noble character. Lukman's way of conveying this message must be emulated by every parent who claims to be a Muslim."
		   },
		   {
			"id": 3483,
			"surah": 31,
			"ayat": 14,
			"tafsir": "In this verse, Allah commands humans to be devoted to their parents by trying to carry out His commands and fulfill their desires. In other verses, Allah also commands this, His words: And your Lord has commanded you not to worship other than Him and to do good to your parents. (al-Isra'\/17: 23) Things that cause a child to be ordered to do good to the mother are: 1. The mother bears a child until it is born. During that period of pregnancy, the mother patiently endures quite heavy suffering, starting in the first months, then the content gets heavier and heavier, and the mother becomes weaker, until she gives birth. His strength just recovered after the puerperium expired. 2. Mothers breastfeed their children until they are two years old. Mothers experience a lot of suffering and difficulties while breastfeeding their children. Only Allah knows all that suffering. This verse only mentions the reasons why a child must obey and do good to his mother. It does not mention why a child must obey and do good to his father. This shows that the difficulties and suffering of mothers in conceiving, caring for, and educating their children are far more severe than the suffering experienced by fathers in caring for their children. The suffering is not only in the form of sacrificing part of the time of his life to care for his child, but also physical and spiritual suffering. A mother also provides important substances in her body for food for her child as long as her child is still a fetus in the womb. After being born into the world, the child is then breastfed for two years (the main one). Mother's milk (ASI) also consists of important substances in the mother's blood, which are served with affection for her child to suck. In breast milk there are all kinds of substances needed for the physical and spiritual growth of children, and to prevent all kinds of diseases. These substances are not found in cow's milk. Therefore, cow's milk and the like will not be of the same quality as breast milk. All kinds of powdered milk or canned milk are not of the same quality as breast milk. A mother is strongly encouraged to breastfeed her child with breast milk. Do not replace it with powdered milk, except in very compelling situations. Getting breast milk from the mother is a child's right, and breastfeeding a child is an obligation that Allah has imposed on the mother. In this verse, Allah only mentions the reasons why humans must obey and do good to their mothers. The Prophet himself ordered that a child prioritize doing good to his mother rather than to his father, as explained in the hadith: From Bahz bin Hakim, from his father, from his grandfather, he said, \"I ask O Messenger of Allah, to whom should I be devoted?\" The Prophet replied, \"To your mother.\" I asked, \"Then to whom?\" The Prophet replied, \"To your mother.\" I asked, \"Then who else?\" The Prophet replied, \"To your mother.\" I asked, \"Then who else?\" Rasulullah replied, \"To your father. Then to a closer relative, then a closer relative.\" (History of Abu Dawud and at-Tirmidhi) As for the duration of breastfeeding, the Qur'an orders that a mother breastfeed her child for a maximum of two years, as explained in this verse, with His words, \"and wean her in a period of two years .\" In another verse, Allah determines the period for suckling the child for two years. Allah says: And mothers should breastfeed their children for two whole years, for those who want to breastfeed perfectly. (al-Baqarah\/2: 233) His word again: The period from pregnancy to weaning for thirty months. (al-Ahqaf\/46: 15) The meaning of the verse above is the time needed for a mother to conceive her child at least six months, and the breastfeeding period is twenty-four months or two years. If the two are added together, they will find the number 30 months. The Qur'an teaches that a mother should breastfeed her child within two years. In verse 233 of surahh al-Baqarah it is explained that the two-year breastfeeding period is for a mother who wants to breastfeed her child perfectly. That is, if there is an obstacle, or the two year period is felt to be very heavy, then it may be reduced. The two-year breastfeeding period contains another lesson, namely to space births. Undertaking this natural arrangement, a mother will only give birth once every three years at the earliest, or a little less. Because during breastfeeding, it is generally difficult for a woman to get pregnant again. Then Allah explains that the meaning of \"doing good\" in this verse is so that humans are always grateful for each of the blessings that have been bestowed upon them, and are also grateful to parents because both of them are the ones who raise, nurture, and educate and are responsible for themselves. , from in the womb until they are adults and able to stand alone. The period of raising children is a difficult time because parents bear all kinds of hardships and suffering, both in caring for and in trying to make a living for their children. Ladies and gentlemen in this verse are referred to in general, without distinguishing between Muslim and non-Muslim mothers and fathers. Therefore, it can be understood that children are obliged to do good to their parents, whether the parents are Muslims or infidels. Apart from what was mentioned above, there are still a number of things that require children to respect and be kind to their parents, including: 1. Mothers and fathers have poured out their love for their children. Love and affection manifest in various forms, including raising, educating, caring for, and fulfilling the wishes of their children. These non-binding efforts are carried out without expecting anything in return from their children, except that in the future they will become children who are useful for their religion, nation and nation. 2. Children are the fruit of the heart and heart of their parents, as mentioned in a history that the Messenger of Allah said, \"Fatimah is the fruit of my heart.\" 3. Since in the womb, then born into the world until adulthood, the needs of food, drink, clothing, and other needs of children are borne by their parents. In other words, it can be said that the greatest blessing received by a human being is a favor from Allah, then the favor received from his parents. That is why, Allah places the obligation to do good to both parents, after the obligation to worship Him. At the end of this verse, Allah warns that humans will return to Him, not to anyone else. At that time, He will give just vengeance to His servants. Good deeds will be rewarded with multiple rewards in the form of heaven, while bad deeds will be rewarded with the punishment of hell."
		   },
		   {
			"id": 3484,
			"surah": 31,
			"ayat": 15,
			"tafsir": "It was narrated that this verse was revealed in connection with Sa'ad bin Abi Waqqash, he said, \"When I converted to Islam, my mother swore that she would not eat and drink before I left Islam. For that on the first day I begged her to eat and drink, but he refused and persisted in his position. On the second day, I also asked him to eat and drink, but he still remained in his position. On the third day, I asked him to eat and drink, but still refused Therefore, I said to him, 'By Allah, if you have a hundred souls and come out one by one in front of me until you die, I will not leave this religion that I embrace. After my mother saw my conviction and the strength of my convictions, she too want to eat.\" From the reason this verse was revealed, it can be understood that Sa'ad was innocent because he did not follow his mother's will to return to the religion of shirk. This law also applies to all followers of the Prophet Muhammad who were not allowed to obey their parents following the religion of shirk and other sinful acts. This verse explains that in certain cases, a child is prohibited from obeying his parents if they order him to associate partners with Allah, which he himself does not know that Allah has partners, because He has no partners. As far as human knowledge is concerned, Allah has no partners. Because according to instinct, man must unite God. Furthermore, Allah commands that a child remains kind to both his parents in world affairs, such as respecting, pleasing, and providing proper clothing and housing for him, even if they force him to associate partners with God or commit other sins. In another verse it is warned that a child must say good words to his parents. Never act or say words that offend her, even if it's just an \"ah\" word. Allah said: ¦so in no case do you say to both of them the word \"ah\". (al-Isra'\/17: 23) At the end of this verse, Muslims are ordered to follow the path of those who lead to Allah, God Almighty, and not to follow the path of those who associate Him with creatures. Then this verse closes with a warning from Allah that only to Him do humans return, and He will tell them what they have done while living on earth."
		   },
		   {
			"id": 3485,
			"surah": 31,
			"ayat": 16,
			"tafsir": "Lukman willed his son to do good deeds because what humans do, from the big to the smallest, visible and invisible, visible and hidden, both in the heavens and on earth, must be known by Allah. Therefore, Allah will surely give a reward according to human deeds. Good deeds will be rewarded with heaven, while bad deeds and sins will be rewarded with hell. Allah's knowledge encompasses everything and nothing escapes His knowledge. Allah then describes in His word about the weighing of human actions: And We will set the right scales on the Day of Resurrection, so no one will be harmed even a little. (al-Anbiya'\/21: 47)"
		   },
		   {
			"id": 3486,
			"surah": 31,
			"ayat": 17,
			"tafsir": "In this verse, Lukman bequeaths to his son the following: a. Always perform prayers in the best way possible, so that Allah pleases him. If the prayer is pleasing to Allah, abominable and unjust acts can be prevented, the soul becomes clean, there is no worry for that person, and they will not grieve when trials befall them, and feel closer to their Lord. The Prophet said: Worship Allah as if you see Him, so if you do not see Him, then He actually sees you. (Al-Bukhari and Muslim) b. Trying to invite people to do good deeds that please Allah, trying to cleanse the soul and achieve good luck, and prevent them from doing sinful deeds. Allah says: The person who purifies it (the soul) is indeed lucky, and the person who pollutes it is truly a loss. (asy-Shams\/91: 9-10) c. Always be patient and steadfast in all kinds of trials that befall, the result of inviting people to do good and leave bad deeds, whether the trials are in the form of pleasure and splendor, or in the form of glory misery and suffering. At the end of this verse it is explained that Allah commands the three things mentioned above because it is a very beneficial work for those who do it and provide benefits in this world and in the hereafter."
		   },
		   {
			"id": 3487,
			"surah": 31,
			"ayat": 18,
			"tafsir": "This verse explains the continuation of Lukman's will to his son, namely that his son should have good character, by: 1. Never be arrogant and arrogant, proud of yourself and look down on others. The signs of someone who is arrogant and arrogant are: -When walking and meeting other people, he turns his head away, does not want to reprimand or show a friendly attitude. -Walk haughtily, as if he were in power and the most honorable. God's Word: And do not walk on this earth arrogantly, for in fact you will not be able to penetrate the earth and will not be able to rise as high as a mountain. (al-Isra'\/17: 37) In a hadith, Rasulullah SAW said: Do not hate each other, do not turn your back on each other and do not envy each other, and be servants of Allah who are brothers. It is not permissible for a Muslim to isolate himself from his friends for more than three days. (Malik's history from Anas bin Malik) 2. Walk naturally, not pretend and look haughty or arrogant, and be gentle in speaking, so that those who see and hear them feel happy and at ease. Talking loudly, arrogantly, and arrogantly is forbidden by Allah because such a style of speech is unpleasant to hear, hurts the heart and ears. This is likened to Allah with the sound of a donkey that is uncomfortable to hear. Yahya bin Jabir ath-tha'i narrated from Gudhaif bin Haris, he said, \"I sat near 'Abdullah bin 'Amr bin al-'ash, then I heard him say, 'Surely the grave will speak to the people buried in it. , he said, 'O son of Adam, what has deceived you, so that you enter into my hole? Don't you know that I am a house where you are alone? Don't you know that I am a dark place? Don't you know that I am a house of truth? who deceived you so that you entered into my hole? Surely you were arrogant when you lived.\" Modest or natural in walking and speaking does not mean walking with bowed head and speaking softly. However, the intention is to walk and speak politely and gently, so that people feel good to see them. As for walking in a gallant and natural manner, and speaking firmly which shows a strong stance, this is not prohibited by religion. According to a history from 'Aisyah ra that he saw a man walking with his head down weakly, as if he had lost his body strength, he asked, \"Why is that person walking too weak and slow?\" Someone replied, \"He is a very pious fuqaha.\" Hearing that answer, 'Aisyah said, \"Umar is the head of the jurists, but when he walks, he walks with a dashing attitude, when he speaks, he makes a louder voice, and when he hits, he hits very hard.\""
		   },
		   {
			"id": 3488,
			"surah": 31,
			"ayat": 19,
			"tafsir": "This verse explains the continuation of Lukman's will to his son, namely that his son should have good character, by: 1. Never be arrogant and arrogant, proud of yourself and look down on others. The signs of someone who is arrogant and arrogant are: -When walking and meeting other people, he turns his head away, does not want to reprimand or show a friendly attitude. -Walk haughtily, as if he were in power and the most honorable. God's Word: And do not walk on this earth arrogantly, for in fact you will not be able to penetrate the earth and will not be able to rise as high as a mountain. (al-Isra'\/17: 37) In a hadith, Rasulullah SAW said: Do not hate each other, do not turn your back on each other and do not envy each other, and be servants of Allah who are brothers. It is not permissible for a Muslim to isolate himself from his friends for more than three days. (Malik's history from Anas bin Malik) 2. Walk naturally, not pretend and look haughty or arrogant, and be gentle in speaking, so that those who see and hear them feel happy and at ease. Talking loudly, arrogantly, and arrogantly is forbidden by Allah because such a style of speech is unpleasant to hear, hurts the heart and ears. This is likened to Allah with the sound of a donkey that is uncomfortable to hear. Yahya bin Jabir ath-tha'i narrated from Gudhaif bin Haris, he said, \"I sat near 'Abdullah bin 'Amr bin al-'ash, then I heard him say, 'Surely the grave will speak to the people buried in it. , he said, 'O son of Adam, what has deceived you, so that you enter into my hole? Don't you know that I am a house where you are alone? Don't you know that I am a dark place? Don't you know that I am a house of truth? who deceived you so that you entered into my hole? Surely you were arrogant when you lived.\" Modest or natural in walking and speaking does not mean walking with bowed head and speaking softly. However, the intention is to walk and speak politely and gently, so that people feel good to see them. As for walking in a gallant and natural manner, and speaking firmly which shows a strong stance, this is not prohibited by religion. According to a history from 'Aisyah ra that he saw a man walking with his head down weakly, as if he had lost his body strength, he asked, \"Why is that person walking too weak and slow?\" Someone replied, \"He is a very pious fuqaha.\" Hearing that answer, 'Aisyah said, \"Umar is the head of the jurists, but when he walks, he walks with a dashing attitude, when he speaks, he makes a louder voice, and when he hits, he hits very hard.\""
		   },
		   {
			"id": 3489,
			"surah": 31,
			"ayat": 20,
			"tafsir": "This verse reminds people by asking if they do not pay attention to the signs of the oneness and power of Allah in this vast universe? Do they not see that it is Allah who has subjected everything in this world to them, so that they can benefit from it. He is the one who makes the sun shine, so that the day becomes bright. Sunlight can grow plants that will become food for humans. He made the moon and stars luminous, which could illuminate the dark night and be a guide for ships crossing the seas. He sends down rain that moistens the earth and fertilizes plants, and the water is for human and animal drinking, and some of the water is stored in the ground in preparation for the dry season. He makes various kinds of minerals, natural gas, and so on, all of which can be utilized by humans. No one can count the blessings of Allah that He has bestowed on humans. From Ibn 'Abbas ra, \"I asked the Prophet, 'O Messenger of Allah, what is the meaning of external favors? He replied,'A person's good deed. And inner favors are that he is given Islamic guidance.\" (Al-Baihaqi History) There are people who argue that adh-dhahirah is health and noble character, and al-bathinah is knowledge and reason. There are also those who interpret adh-dhahirah with all the visible blessings of God, such as wealth, splendor, beauty, and obedience, while al-bathinah is knowledge of God, good faith, knowledge of the true nature of life, and so on. Even though there are differences in the meaning of adh-dhahirah and al-bathinah, it can be concluded that both are blessings bestowed by Allah upon humans and they can feel them. At the end of this verse, Allah warns that even though He has bestowed countless blessings on humans, there are still many people who deny and deny these blessings, such as Nadhar bin Haris, Ubay bin Khalaf, and others. They dispute the evidence presented by the Qur'an and the words of the Prophet that are not based on science, true arguments, and revelations and books sent down by Allah."
		   },
		   {
			"id": 3490,
			"surah": 31,
			"ayat": 21,
			"tafsir": "This verse explains that the disbelievers as mentioned in the verse above can no longer be expected to believe because they are very disbelievers and their minds have been covered by blind obedience to their ancestors. Therefore, they no longer pay attention to the arguments put forward. Their character and attitude is described by Allah in this verse by saying, \"When it is said to those who deny the oneness of Allah, 'Follow what Allah has revealed to His Messenger, they answer,' We follow what has been taught to us by your father. -our fathers, and they have taught us the true religion and good regulations.\" At the end of this verse it is explained that those polytheists still follow the religion of their ancestors, even though their parents were ignorant and never received any guidance. This shows that in matters of belief, they no longer use reason, but have been enslaved by lust. Such passions are breathed and instilled by Satan into the hearts of unbelievers, so that they will not be able to see the truth. As a result of that action, they will fall into the torments of Hell in the afterlife."
		   },
		   {
			"id": 3491,
			"surah": 31,
			"ayat": 22,
			"tafsir": "This verse explains that those who worship Allah, submit and humble themselves to Him, are sincere and earnest in carrying out His commands, and abandon all immoral and unjust deeds, mean that they have held on to a firm knot. The meaning of the word \"ihsan\" in this verse is to truly worship Allah, so that you feel as if you are dealing directly with Him, as the hadith explains, that the Prophet was asked by Jibril: Tell me about ihsan, the Prophet replied, \" That you worship Allah as if you see Him, so if you do not see Him, He actually sees you.\" (Muslim history from 'Umar) Allah likens a person who does \"ihsan\" who truly believes in Him, obediently carries out His commands, and stops His prohibitions as a mountain climber, who uses a rope that is bundled holding place. He doesn't need to worry because he uses a rope with strong knots and holds on firmly. There was not the slightest worry in his heart that it would fall. At the end of this verse it is explained that all creatures return to Allah alone. Therefore, only He gives good rewards to those who put their trust in them by giving good recompense."
		   },
		   {
			"id": 3492,
			"surah": 31,
			"ayat": 23,
			"tafsir": "This verse is entertainment for the Prophet and his companions who were saddened by the attitude and behavior of polytheists towards them. It's as if Allah said, \"O Prophet, do not grieve because of their disbelief. Because your task is only to convey My religion to them, not to make them believe. They will all return to Me on the Day of Resurrection, then it will be announced to them everything they have ever done while living on earth. I will make a fair judgment on them because I know everything that is in their hearts.\""
		   },
		   {
			"id": 3493,
			"surah": 31,
			"ayat": 24,
			"tafsir": "This verse explains to disbelievers that they are only given the pleasures of life that are short and temporary. During that little time, they can make use of the blessings provided by Allah and taste the pleasures of life. However, temporary pleasures are nothing when compared to ukhrawi pleasures. The temporary pleasure will disappear, as if they had never experienced it, when they meet a painful doom in hell later. This is confirmed by another word of Allah: Say, \"Those who invent lies against Allah will not prosper.\" (For them) (momentary) pleasure while in the world, then they return to Us, then We feel for them a severe punishment, because of their disbelief. (Yunus\/10: 69-70)"
		   },
		   {
			"id": 3494,
			"surah": 31,
			"ayat": 25,
			"tafsir": "This verse states the stupidity and bigotry of the polytheists towards the religion of their ancestors. The proof of their stupidity was stated by Allah, \"And if you ask those polytheists, O Muhammad, about who created the heavens and the earth, they will answer that the creator of both of them and what is in them is Allah.\" Their acknowledgment is a true acknowledgment, and they will be forced to answer that way, because it is very clear that it is God who made this world. Based on this confession, they should worship and serve only Allah, because He is God who has the right to be worshiped. However, their actions and attitudes contradict their claims for associating partners with Allah with something that is neither beneficial nor harmful. Then Allah taught His Messenger that when the polytheists answered like this, then say, \"Praise be to Allah.\" Because with such an answer, they have admitted their mistake of worshiping what should not be worshipped. Allah also warns that if they commit acts that are contrary to their own confession, then this is because most of the polytheists do not know who is entitled to praise and human expressions of gratitude. In the confession of the polytheists there is a fact that even though they belied the Prophet Muhammad, but because they believe that this universe is God's creation, in essence they acknowledge the apostleship. According to logic and thought, God has created this nature, including humans, of course He will not just let it go. God certainly sent messengers to give taufik and His guidance to humans."
		   },
		   {
			"id": 3495,
			"surah": 31,
			"ayat": 26,
			"tafsir": "Only Allah owns the heavens and the earth and everything in them, nothing else because He created them. He is the one who arranges, guards, maintains, and determines the end of events. He does according to what He wills. Therefore, he deserves to be praised and praised, and also deserves to be thanked to Him. He does not require anything from His creatures. From this verse it can be understood that according to the Islamic religion, this treasure belongs to Allah. Humans are only loaned and allowed to use it, in accordance with religious provisions. Therefore, God could have forcibly taken all that belongs to man. However, because God knows that humans are miserly, He does not do that. Allah only takes part of the assets that must be zakat. In this case, the waliyyul-amri (government) has the right to take, if necessary by force, the zakat assets that belong to the Muslims, to be distributed in the way of Allah."
		   },
		   {
			"id": 3496,
			"surah": 31,
			"ayat": 27,
			"tafsir": "It is narrated that when the Prophet was still in Mecca the verse was revealed: And they ask you (Muhammad) about the spirit. Say, \"The spirit is part of my Lord's affairs, while you are given only a little knowledge.\" (al- Isra'\/17: 85) When he migrated to Medina, Rasulullah SAW came to the Jewish monks. They said, \"O Muhammad, it has reached us that you said, 'and you were not given knowledge but a little. Do you mean us by that word, or your people?\" Rasulullah replied, \"Everything that I mean.\" They said, \"Didn't you read in the book that was revealed to you that the Torah has been sent down to us and in it is knowledge of everything?\" The Messenger of Allah said, \"Knowledge in the Torah is little, when compared with the knowledge of Allah, and verily Allah sent down to me something, which if you practice, will undoubtedly benefit you.\" They said, \"O Muhammad, why do you say that, while you say, 'and whoever is given wisdom, has indeed been given many virtues. How is it possible to gather in something, a little knowledge and a lot of goodness?\" So Allah sent down this verse as an answer. This verse describes the breadth of Allah's knowledge. This is likened to that if all the trees on the face of the earth were used as pens to record Allah's knowledge, and all the sea water was used as ink, then added seven times that much, then Allah's sentence would not have been written down. In another verse, Allah says: Say (Muhammad), \"If the ocean were ink for (writing) the sentences of my Lord, then the ocean would surely have been used up before the completion (writing) of the sentences of my Lord, even though We brought an additional amount of it (too) .\" (al-Kahf\/18: 109) The meaning of \"words of Allah\" in this verse are many, including the power of Allah, the essence of everything, the provisions and words of Allah, knowledge and all kinds of His creations. In addition, it also includes the creation of the heavens and the earth and all kinds that are in it, from the largest to the subtlest, from the biggest animals to thousands of the most subtle bacteria. The various plants, the animals that are in the firmament with all the rules and countless others, all are included in the word of Allah. In this verse it is emphasized that Allah is strict in His demands. All His will and decisions must be carried out and He is All-Wise in all His actions."
		   },
		   {
			"id": 3497,
			"surah": 31,
			"ayat": 28,
			"tafsir": "This verse explains that making everything is easy for Allah. Whether making something big, small, complicated, or making something in a small amount, everything is the same to Allah. Similarly, resurrecting humans from their graves on the Day of Judgment is easy for Allah. Raising up all people for God is like raising up just one person. Nothing is difficult for Him. If Allah wills something to happen, it is enough for Him to say, \"Kun\" (be), then it will be what He wills. Allah said: Surely it is His business when He wills something He only says to it, \"Be it!\" Then be that something. (Yasin\/36: 82) And the word of Allah: And Our command is only (with) one word like the twinkling of an eye. (al-Qamar\/54: 50) At the end of this verse, Allah states that He hears all the words of His servants and is Seeing of all their deeds."
		   },
		   {
			"id": 3498,
			"surah": 31,
			"ayat": 29,
			"tafsir": "In this verse, Allah commands people to pay attention and think about His power. He subverts the night for the day, and the day for the night. The meaning is that Allah takes part of the night, then adds it to the day, then the day is extended, otherwise the night becomes shorter, but the day and night are still 24 hours. This happens in summer. Meanwhile, Allah also took part of the day, then included it in the night, so the night was long, and the day was short. This happens in winter. Events like the above are very clear to see and experienced by residents of countries located in areas that have four seasons in a year, namely summer, autumn, winter, and spring, namely the North and South Moderate regions. As for countries that are located on the equator, there are only two seasons in a year, namely the dry season and the rainy season. While at times when the night is longer than the day, or the day is longer than the night, the difference is not felt because the difference in the length of the night or day is not much. The occurrence of four different seasons in a year, and the occurrence of a longer day than night or vice versa in the North and South Moderate regions, is because Allah tilts the earth's position at 22 Â½ degrees latitude, as known in Astronomy. All of this contains great wisdom. Allah also subjected the sun and the moon for the benefit of humans. Sunlight is a lamp that illuminates people during the day, so they can work and try. Sunlight also nourishes plants, creates winds and clouds, and has many other uses. Likewise, the moon and its light and its various forms have many uses for man, but he knows only a small part of these uses. The moon and the sun revolve in their respective orbits, according to the provisions that have been determined by Allah, until the time that has been determined by Him. When the appointed time comes, the heavens and the earth will be rolled up, as Allah says: (Remember) on the day of the sky We will roll up like sheets of paper. (al-Anbiya'\/21: 104) At the end of this verse it is stated that Allah knows all the actions that His servants have done, whether they are good deeds or bad deeds. Nothing escapes His knowledge. Allah will give him a just revenge."
		   },
		   {
			"id": 3499,
			"surah": 31,
			"ayat": 30,
			"tafsir": "This verse explains that the purpose of Allah to show signs of His power to humans is to become a strong argument and proof for them that humans are obliged to worship Him and only He has the right to be worshiped. Worshiping or worshiping other than Allah is an act of vanity because everything other than Him is mortal, impermanent. He is Mahakaya and does not need anything else, while all creatures are very dependent on His grace. Finally, this verse emphasizes that Allah is the Most High, above all things, the Greatest, and controls all things. All submit and obey Him. (31) In this verse, Allah commands people to see the signs of His power and greatness on earth by saying, \"Have you not noticed, O Muhammad, the arks that sail in the ocean that connect countries that are far apart. \" With this relationship, residents of a country will know residents of other countries. The needs and needs of the people who are not in their country can be picked up and transported by ships from other countries, such as food, clothing, medicine, jewelry, machinery, and so on. With the existence of these ships, it is as if the relationship between nations and countries today is getting closer. The ship was made for the first time by Prophet Noah in accordance with Allah's command on a mission to save faithful humans plus a number of pairs of animals (read further in surahh Hud\/11: 40). However, with human thinking ability, ship technology develops. Ships are not only made of wood, they have even developed using metal. Although lately with the development of material technology, humans have been able to \"concoct\" available materials into materials that are lighter, compact, malleable, strong, weather resistant, and impact resistant. The iron should sink, because the density of metal is much greater than the density of water, but with the use of science and technology, namely by applying Archimides' law (physics), the iron can float on the surface of the water. In essence, the laws of physics are God's decrees. God's provision that benefits can be felt in human life. That is the true grace of Allah. Everything that Allah has explained is proof of His power and greatness which is real for people who are patient in facing all kinds of trials and difficulties, as well as for people who are grateful for the blessings Allah has bestowed upon them. The sign that people are grateful to God is by expressing gratitude in the form of words or deeds when receiving the favor. Asy-Sya'bi said, \"Patience is part of faith, gratitude is part of faith, and being sure is all faith. Haven't you noticed the word of God which is at the end of this verse and His words:\" wa fi al-ardhi ayatun li al-muqinin\" (and on the earth there are signs of Allah's power for those who are sure) and the words of the Messenger of Allah saw: Faith has two parts, namely partly in patience and partly in gratitude. (Narrated by al-Baihaqi from Anas )"
		   },
		   {
			"id": 3500,
			"surah": 31,
			"ayat": 31,
			"tafsir": "This verse explains that the purpose of Allah to show signs of His power to humans is to become a strong argument and proof for them that humans are obliged to worship Him and only He has the right to be worshiped. Worshiping or worshiping other than Allah is an act of vanity because everything other than Him is mortal, impermanent. He is Mahakaya and does not need anything else, while all creatures are very dependent on His grace. Finally, this verse emphasizes that Allah is the Most High, above all things, the Greatest, and controls all things. All submit and obey Him."
		   },
		   {
			"id": 3501,
			"surah": 31,
			"ayat": 32,
			"tafsir": "In this verse, Allah commands people to see the signs of His power and greatness on earth by saying, \"Have you not noticed, O Muhammad, the arks that sail in the ocean that connect countries that are far apart.\" With this relationship, residents of a country will know residents of other countries. The needs and needs of the people who are not in their country can be picked up and transported by ships from other countries, such as food, clothing, medicine, jewelry, machinery, and so on. With the existence of these ships, it is as if the relationship between nations and countries today is getting closer. The ship was made for the first time by Prophet Noah in accordance with Allah's command on a mission to save faithful humans plus a number of pairs of animals (read further in surahh Hud\/11: 40). However, with human thinking ability, ship technology develops. Ships are not only made of wood, they have even developed using metal. Although lately with the development of material technology, humans have been able to \"concoct\" available materials into materials that are lighter, compact, malleable, strong, weather resistant, and impact resistant. The iron should sink, because the density of metal is much greater than the density of water, but with the use of science and technology, namely by applying Archimides' law (physics), the iron can float on the surface of the water. In essence, the laws of physics are God's decrees. God's provision that benefits can be felt in human life. That is the true grace of Allah. Everything that Allah has explained is proof of His power and greatness which is real for people who are patient in facing all kinds of trials and difficulties, as well as for people who are grateful for the blessings Allah has bestowed upon them. The sign that people are grateful to God is by expressing gratitude in the form of words or deeds when receiving the favor. Asy-Sya'bi said, \"Patience is part of faith, gratitude is part of faith, and being sure is all faith. Haven't you noticed the word of God which is at the end of this verse and His words:\" wa fi al-ardhi ayatun li al-muqinin\" (and on the earth there are signs of Allah's power for those who are sure) and the words of the Messenger of Allah saw: Faith has two parts, namely partly in patience and partly in gratitude. (Narrated by al-Baihaqi from Anas )"
		   },
		   {
			"id": 3502,
			"surah": 31,
			"ayat": 33,
			"tafsir": "This verse explains the characteristics of the polytheists by describing them, \"When the polytheists who worship statues and worship the gods sail into the middle of the ocean, suddenly a big wave comes and throws their boat left and right, and feels that they will not survive, they will even die in the waves, so that's when they return to their fitrah, by praying to God Almighty sincerely. At such times they believe that nothing can save them except Allah alone, as Pharaoh had done at times when he was about to drown in the sea. After Allah accepted the prayer and saved them from the raging waves, only some of them continued to acknowledge the oneness of Allah, while the others returned to associating partners with God. At the end of this verse, Allah confirms that those who deny His verses and return to associating partners with God are those who nature of his life is full of deceit and rottenness, and deny the grace of Allah. (33) In this verse, Allah commands humans to carry out commands and abstain from things that are prohibited. God who created man and created the heavens and the earth and everything in it for his sake. Humans should be afraid of the day when a terrible catastrophe occurs, no one can save themselves from this catastrophe. At that time, a father could not help his child, and likewise a child could not help his father, because all matters at that time were in God's hands. Everyone is responsible for all the actions he has done. They each bear their sins. Only the good deeds he has done while living on earth can help people from this calamity. God warns that His promise to raise people from the grave is something that will actually happen and a truth that cannot be doubted in the slightest. Therefore, let people never be deceived by the pleasures of life in this world and all the pleasures that exist in it, so that they try and spend all the time available to obtain and enjoy worldly pleasures. As a result, there is no more time to worship Allah, and do good and good deeds. Whereas the afterlife is the real life, eternal and better life. Likewise, Allah warns humans about the deception of Satan, who is always looking for opportunities to deceive humans. Satan makes the world's life beautiful in his eyes, so that they forget the task that Allah has assigned to them as khalifatullah fil ardh (creatures that He has given the task of prospering the earth)."
		   },
		   {
			"id": 3503,
			"surah": 31,
			"ayat": 34,
			"tafsir": "In this verse, Allah explains five unseen things that only He knows about, namely: 1. Only Allah knows when the Day of Judgment will come. There is not a single creature that knows even though it is an angel, even though angels are the creatures closest to Him. This was also not known by the prophets who were sent. No one (one) can explain the time of occurrence other than Him. (al-A'raf\/7: 187) 2. Only Allah sends down rain. He determines when, where, and how much water He will pour out. This decree no one can know. 3. Only Allah can know for sure what is in a woman's womb, whether it is defective or perfect, and when she will be born. 4. Only He also knows for sure what someone will do the next day. Even though humans can plan what they will do, but all of that is only a plan. If God wills, the work will be done. However, if He does not wish, it is not difficult for Him to prevent it from being carried out. 5. One does not know where one will die later. Whether on land, at sea, or in the air. Is it in this country, or in another country. Only God can know for sure. It was narrated from Ibn Mundzir from 'Ikrimah that a man named al-Waris bin 'Amr bin Harisah came to the Prophet, he asked, \"O Muhammad, when will the Day of Judgment come? Our earth has dried up, when will it become fertile? Truly I left my wife pregnant, when will she give birth? I know what I am doing now, so what will I do the next day? I know where I was born, so where will I die? In response, this verse was revealed. Al-Bukhari and Muslim narrated from Ibn 'Umar that the Messenger of Allah said: There are five keys to the unseen problem, \"Indeed, only in Allah is the knowledge of the Day of Resurrection. It is He who sends down the rain, He knows what is in the womb, a person does not know what he will do the next day, and he also does not know on which earth he will die. Indeed, Allah is All-Knowing, Most Merciful.\" (Narrated by al-Bukhari and Muslim from Ibn 'Umar)"
		   }
	]
}
