{
	"tafseer": [
		{
			"id": 6231,
			"surah": 114,
			"ayat": 1,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad, including all of his people, to seek protection from God who creates, protects, grows, develops, and maintains the survival of mankind with His grace and love and warns them with threats. His."
		   },
		   {
			"id": 6232,
			"surah": 114,
			"ayat": 2,
			"tafsir": "Allah explained that God who educates human beings is the one who owns and regulates all Shari'a, who makes laws, regulations, and religious laws. Whoever adheres to it will be happy living in this world and in the hereafter."
		   },
		   {
			"id": 6233,
			"surah": 114,
			"ayat": 3,
			"tafsir": "Allah adds information about God as a human educator who controls their souls with His greatness. They do not know the power of God as a whole, but they submit to Him wholeheartedly and they do not know how this impulse comes to them, so that it can affect their whole soul and body. These verses prioritize the word Rabb (educator) from the words Malik and Ilah because education is the most important and greatest blessing of Allah for humans. Then the second is followed by the word Malik (King) because humans must submit to God's kingdom after they grow up and have reason. Then it is followed by the word Ilah (worship), because after understanding humans realize that only to Allah they must submit and only He has the right to be worshiped. Allah reveals in these verses that He is the King of mankind. Owner of man and God of man, even He is the God of all. But on the other hand, it is human beings who make mistakes and mistakes in the character of Allah so that they stray from the straight path. They make other gods that they worship with the assumption that these gods are the ones who give pleasure and happiness and repel harm from them, who regulate their lives, outline the boundaries of what they may or may not do. They gave the names of the gods and their assistants and thought that the gods were the ones who controlled all their movements. In another verse, Allah says: They made the pious (Jews) and their monks (Christians) gods besides Allah, and (also) Al-Masih son of Maryam; even though they were only ordered to worship God Almighty; there is no god but Him. Glory be to Him from what they associate. (at-Taubah\/9: 31) And he did not (perhaps even) order you to make the angels and prophets God. Did he (appropriately) order you to become disbelievers after you became Muslims? (Ali 'Imran\/3: 80) That is, by this Allah warns people that He is the one who educates them while they are human beings who like to think and He is their King and He is also their God according to their thoughts. So it is not true what they invented to deify themselves even though they are ordinary people."
		   },
		   {
			"id": 6234,
			"surah": 114,
			"ayat": 4,
			"tafsir": "In this verse, Allah commands people to take refuge in Allah Rabbul-'Alamin from the evil whispers of Satan who always hide in the hearts of humans. The whispers and anxieties that come from Satan's temptations when faced with common sense must be defeated and the person who is tempted becomes conscious again, because all the whisperings and misgivings by Satan that will harm humans will become empty when the soul is aware of its commands. religious orders. Likewise, if a person tempts another friend to commit a crime, but that friend adheres to religious orders, he will undoubtedly stop teasing and feel disappointed because the temptation was not successful but he is still waiting for another opportunity."
		   },
		   {
			"id": 6235,
			"surah": 114,
			"ayat": 5,
			"tafsir": "Allah explains in this verse about the temptation, namely the hidden devil whispers that are blown into the human chest, which may come from jinn or humans, as in another verse Allah says: And thus for every prophet We made enemies consisting of devils humans and jinns. (al-An'am\/6: 112) The jinn devils often whisper a doubt in a very subtle way to humans. Often he shows himself as a sincere adviser, but when you rebuke him he backs off and if you pay attention to what he is talking about he continues to tease him extravagantly. This surah begins with the word educator, therefore God as human educator, has the power to reject all temptations of Satan and his whispers from humans. Allah gives instructions in this surahh so that humans seek help only from Allah as He has given similar instructions in surahh al-Fatihah, that the most important basis in religion is to face oneself with sincerity to Allah both in speech and other actions and seek protection. to Him from all the temptations of Satan which he himself was unable to resist."
		   },
		   {
			"id": 6236,
			"surah": 114,
			"ayat": 6,
			"tafsir": "Allah explains in this verse about the temptation, namely the hidden devil whispers that are blown into the human chest, which may come from jinn or humans, as in another verse Allah says: And thus for every prophet We made enemies consisting of devils humans and jinns. (al-An'am\/6: 112) The jinn devils often whisper a doubt in a very subtle way to humans. Often he shows himself as a sincere adviser, but when you rebuke him he backs off and if you pay attention to what he is talking about he continues to tease him extravagantly. This surah begins with the word educator, therefore God as human educator, has the power to reject all temptations of Satan and his whispers from humans. Allah gives instructions in this surahh so that humans seek help only from Allah as He has given similar instructions in surahh al-Fatihah, that the most important basis in religion is to face oneself with sincerity to Allah both in speech and other actions and seek protection. to Him from all the temptations of Satan which he himself was unable to resist."
		   }
	]
}
