{
	"tafseer": [
		{
			"id": 2349,
			"surah": 20,
			"ayat": 1,
			"tafsir": "thaha includes hijaiyyah letters which are located at the beginning of several surahs of the Qur'an. The Mufassirins differed on the meaning of the letters. For details, please review the description at the beginning of surah al-Baqarah volume I \"The Qur'an and its commentary\" with the title \"Fawatihus Suwar\"."
		   },
		   {
			"id": 2350,
			"surah": 20,
			"ayat": 2,
			"tafsir": "In this verse Allah explains that the Qur'an was sent down not to cause trouble and harm. For the Prophet Muhammad, this verse is as entertainment. It was emphasized that the Qur'an was sent down to him not to make it difficult, nor to be forced on stubborn people, but the Qur'an was sent down to him to be conveyed to his people and to be a warning to them about his misguided actions. If the task of the Prophet Muhammad has been carried out and his da'wah has been carried out, but his people are still disobedient and do not want to obey him, then it is left to Allah, because the Prophet's obligation is only to convey what is his duty, as Allah says: So if they turn away, then know the obligation that is imposed upon you (Muhammad) is only to convey (the message of Allah) clearly. (an-Nahl\/16: 82) Therefore, the Prophet Muhammad did not need to feel anxious, let alone destroy himself because humans did not want to follow his call, as Allah described in His words: Then perhaps you (Muhammad) will harm yourself because grieve after they turn away, if they do not believe in this information (Al-Qur'an). (al-Kahf\/18: 6) Likewise the Prophet Muhammad did not need to feel difficult in conveying the Qur'an to humans, as Allah said: (This is) the Book that was sent down to you (Muhammad); so do not be short of breath over it, so that you may warn with it (the Book) and become a lesson for those who believe. (al-A'raf\/7: 2) Al-Qurthubi explained about Umar bin al-Khaththab's conversion to Islam, at that time Umar bin al-Khaththab entered the house of his brother-in-law Sa'id bin Zaid, he was reading surahh Thaha with his wife Fatimah bint al-Khatthab (Umar's younger brother), and Umar asked for it but was not given it so he got angry and seized the manuscript. When Umar read it, soft and soft heart to accept Islam."
		   },
		   {
			"id": 2351,
			"surah": 20,
			"ayat": 3,
			"tafsir": "In this verse Allah explains that the Qur'an was revealed to be a warning and a lesson for humans. God-fearing man will immediately accept it and make use of the warnings and lessons for him. Whereas a person who does not fear Allah, because his soul is frozen, has a heart as hard as a rock or even harder, will not leave the slightest trace of the warnings and lessons contained in the Qur'an on him. They are as if deaf, mute and blind without reason, like other creatures. They will be put into hell later. As mentioned in the word of God: And indeed, We will fill Hell with many from among the jinn and humans. They have hearts, but they do not use them to understand (the verses of Allah) and they have eyes (but) they do not use them to see (signs of Allah's power), and they have ears (but) they do not use them to hear (the verses of Allah) ). They are like livestock, even more astray. They are the ones who are heedless. (al-A'raf\/7: 179)"
		   },
		   {
			"id": 2352,
			"surah": 20,
			"ayat": 4,
			"tafsir": "In this verse Allah explains that the Qur'an which was brought by the Prophet Muhammad came from Allah, the God who created nature, the Almighty for all that He wills. He is the one who created the earth and all that is in it. He is the one who created the vast sky and everything in it."
		   },
		   {
			"id": 2353,
			"surah": 20,
			"ayat": 5,
			"tafsir": "In this verse Allah explains that the Creator of the heavens and the earth is the Most Gracious One who resides on the Throne. Allah resides on the 'Throne, never to be described as like a king sitting on his throne, because to describe like that, means to have likened the Khaliq to His creatures. Such an assumption is totally not justified by Islamic teachings, in accordance with the word of Allah: There is nothing similar to Him. And He is All-Hearing, All-Seeing. (asy-Syura\/42: 11) Ibn Kasir said in his book of commentary, that the best way to understand this verse is the way that has been taken by the Ulama of the Salaf, namely believing in the expression as stated above 'Arsy (sitting on the throne) but the way or kaifiat (sitting on the throne) should not be equated with the way a creature sits, such as someone sitting on a chair. It is entirely the authority of Allah alone, humans cannot know its essence."
		   },
		   {
			"id": 2354,
			"surah": 20,
			"ayat": 6,
			"tafsir": "In this verse Allah explains that all that is in the heavens, on earth, between the heavens and the earth, as well as everything that is in the ground, both what is known and what is not known belongs to Allah. It is He who rules over all, and arranges as He wills. He is the Knower of all that exists, both the unseen and the real. Nothing moves, remains motionless, changes, remains, and so on except with His permission, according to His divine nature. Allah's Word: To Allah belongs whatever is in the heavens and whatever is on the earth. If you reveal what is in your heart or hide it, Allah will take it into account (about that deed) for you. He forgives whom He wills and punishes whom He wills. Allah is almighty over all things. (al-Baqarah\/2: 284)"
		   },
		   {
			"id": 2355,
			"surah": 20,
			"ayat": 7,
			"tafsir": "This verse explains that when saying a prayer or remembrance, it is not necessary to say it out loud. To Allah it is the same whether it is loud or not. Allah knows what is kept secret as well as what is more hidden than that secret, such as a whisper in the heart, or something that crosses the mind. Prayers and remembrance are said with the tongue only to express what is in our hearts. Allah said: And keep your words secret or reveal them. Indeed, He is All-Knowing of all the contents of the heart. (al-Mulk\/67: 13) In line with this verse, Allah says: And remember your Lord in your heart with humility and fear, and by not raising your voice in the morning and evening, and do not be of those who are heedless. (al-A'raf\/7: 205)"
		   },
		   {
			"id": 2356,
			"surah": 20,
			"ayat": 8,
			"tafsir": "Allah who sent down the Qur'an is the Creator and Owner of this world, therefore the truth of the Qur'an is beyond doubt. Allah is Almighty and where humans ask. To call Him, Allah has many names. All names are good, because they refer to His perfection, might and majesty. However, His substance remains, not enumerated. In a mutawatir hadith, it is stated that Allah has 99 names. Word of the Prophet Muhammad saw: Verily Allah has 99 names, one hundred minus one. Whoever memorizes it (adapts it) will enter paradise. (Al-Bukhari and Muslim from Abu Hurairah) It is narrated that when Abu Jahl heard the Prophet Muhammad in his exclamation saying, \"O Allah! O Rahman!\" Abu Jahl said to Walid bin Mugirah, \"Muhammad forbade us to call on Allah with another God, even though he himself called on Allah with Ar Rahman.\" Then came the verse which confirms that Allah has many names, as Allah says: Say (Muhammad), \"Call on Allah or call on Ar-Rahman. With whichever name you can call, because He has the best names (Asma' ul husna) and do not raise your voice in prayer and do not (also) lower it and try to find a middle way between the two.\". (al-Isra'\/17: 110)"
		   },
		   {
			"id": 2357,
			"surah": 20,
			"ayat": 9,
			"tafsir": "In this verse, Allah begins the story of Prophet Musa as with an expression as if asking the Prophet Muhammad, did the events and stories of Prophet Musa reach him when preaching to his people? Such a method is usually done to focus attention, in this case the attention of the Prophet Muhammad and also his people on what will be conveyed. It has become the custom of the Arabs, when a news or story is to be presented, it is preceded by an expression in the form of a question, to attract attention so that listeners follow the news or story with great attention."
		   },
		   {
			"id": 2358,
			"surah": 20,
			"ayat": 10,
			"tafsir": "After the end of the contract period, Musa tended Sheikh Madyan's goats, as a dowry that Musa had to pay to his in-laws in Madyan, he asked permission to return to Egypt, to meet his mother who had been abandoned for more than ten years. After obtaining permission, Musa went with his family to Egypt, avoiding the usual roads and taking the road on the slopes, for fear that his family would be disturbed by the king of Syria. In the tafsir of ar-Razi and al-Qurthubi it is stated that after arriving in the Tuwa valley to the west of Mount Tursina, his wife gave birth to a child, on a pitch black, cold night and was lost. In order to warm the bone-chilling cold and get light in the pitch darkness, Musa (as) tried to find fire, but his efforts were not successful. Then unexpectedly, he saw fire from afar on the left side of the road. So he said to his family happily, \"You guys stay here first, I saw the fire from afar, and now I'm going there. Hopefully I can bring the fire here, or get directions from it, to get out of the way.\" this is our way.\" Events like these, are also related in other verses in the Qur'an, as Allah says: So when Musa had finished the appointed time and he set out with his family, he saw fire on the mountainside, he said to his family, \" Wait (here), actually I see a fire, hopefully I can bring you some news from (place) the fire or (bring) a spark of fire, so you can warm yourself.\" (al-Qashash\/28: 29)"
		   },
		   {
			"id": 2359,
			"surah": 20,
			"ayat": 11,
			"tafsir": "When Musa (as) arrived at the place of the fire, he saw the fire shining white and clean around a green tree. Musa was amazed to see this incident, because the pure white light of the fire did not reduce the green color of the tree, and vice versa, the green color of the tree did not reduce the white light of the fire. It was at that time that Musa (as) heard a voice calling, \"O Musa.\""
		   },
		   {
			"id": 2360,
			"surah": 20,
			"ayat": 12,
			"tafsir": "Hearing the call, Musa was surprised and doubted, where did the voice come from. The calling voice was followed later by a voice, which stated that Allah is the God who has created human beings perfectly, then the voice asked him to take off his two sandals because he was in a valley called \"thuwa\", a sacred and highly respected valley."
		   },
		   {
			"id": 2361,
			"surah": 20,
			"ayat": 13,
			"tafsir": "In this verse Allah explains that He has chosen and appointed Musa as a prophet and apostle and then he is asked to listen to the revelations that will be conveyed to him. In line with this verse the word of God: (God) said, \"O Musa! Truly I chose (preferably) you over other human beings (in your time) to carry My message and My word., therefore hold fast to what I give to you and be among the grateful.\" (al-A'raf\/7: 144)"
		   },
		   {
			"id": 2362,
			"surah": 20,
			"ayat": 14,
			"tafsir": "In this verse Allah explains that the main revelation and what is conveyed is that there is no true God but Allah and there is no partner for Him, to instill a sense of monotheism, oneness of Allah, confirming confession accompanied by belief and proven by deeds. Therefore only He is the only one who must be worshiped, obeyed His rules. This monotheism, is the essence of all that is essential, and this monotheism is also the first obligation and must be taught first to humans, before other religious lessons. At the end of this verse Allah emphasizes that prayers should be established. Of course, pray in accordance with His commands, complete with its pillars and conditions, to remember Allah and pray to Him sincerely. Salat is mentioned here specifically, to show the superiority of the prayer service compared to other obligatory worship services, such as fasting, zakat, pilgrimage and others. The virtues of praying, among other things, are that when it is carried out as well as possible, in accordance with the rules that have been outlined for it, it will prevent a person from committing heinous and unjust acts, as Allah says: Read the Book (Al-Qur'an) that has been revealed to you (Muhammad) and pray. Verily prayer prevents from (deeds) abominable and unjust. And (know) the remembrance of Allah (prayer) is greater (its priority than other acts of worship). Allah knows what you do. (al-'Ankabut\/29: 45) Some Tafsir experts are of the opinion that the conclusion of this verse, is addressed to people who do not perform their prayers on time, whether due to forgetfulness or otherwise, so that they carry them out when they are aware and remember Allah's abandoned command as the words of Rasulullah saw. Whoever sleeps from the prayer or forgets, then his compensation (gafarat) is the prayer when he remembers. There is no other balance besides that. (Al-Bukhari and Muslim from Anas bin Malik) And he also said: If one of you sleeps so he doesn't pray or forgets to pray, let him perform it when he has remembered it, because Allah says, \"And pray in remembrance of Me.\" (Al-Bukhari and Muslim history from Anas) One of the functions of prayer is to remember Allah, but that does not mean that it is permissible not to pray, it is enough just to remember Allah, because dhikr is done with the heart, mouth and limbs."
		   },
		   {
			"id": 2363,
			"surah": 20,
			"ayat": 15,
			"tafsir": "In this verse Allah explains that the Day of Judgment will definitely come, but Allah deliberately keeps it secret and does not explain when the Doomsday will occur. Allah deliberately kept the time of the Day of Judgment a secret so that humans would always be careful and alert and ready to face it. Concealing the arrival of the Day of Judgment is the same as concealing when someone's death will come. No man knows when or where he will die, as Allah says: And no one can know on what earth he will die. (Luqman\/31: 34) If a person knows when his death will come, of course he will do whatever he wants, follow his desires, do all kinds of immorality that he wants. After his death is near then he repents and Allah will accept his repentance according to His promise. Allah will not break His promise, as His word: Truly, Allah does not break promises. (Ali Imran\/3: 9) But if he does not know when his death will come, of course he is always careful, he carries out orders, avoids prohibitions. If he commits immorality, he immediately repents for fear that his death will come suddenly before he repents. So, the purpose of keeping the doomsday a secret is so that people are active in doing good, if a human who is supposed to do good does evil, then that person deserves to be punished. Therefore it is very fair if those who do good are rewarded and those who do evil are punished. Allah's Word: So whoever does an atom's weight of good, surely he will see (reply) it, and whoever does an atom's weight of evil, surely he will see (reply) it. (az-Zalzalah\/99: 7-8) And His words: Indeed, you are only rewarded for what you have done. (ath-thur\/52: 16)"
		   },
		   {
			"id": 2364,
			"surah": 20,
			"ayat": 16,
			"tafsir": "Even though this verse is addressed to Prophet Musa as, it is a lesson for Muslims. Allah asks that we are not influenced by people who do not believe in the Last Day and people who only follow their desires. If we follow the wishes of those people, then we will lose and regret. Wealth, luxury will not be able to help us from Allah's punishment, as Allah says: \"And his wealth is of no use to him when he has perished.\" (al- Lail\/92: 11) Also our family will not be able and may help as Allah says: On that day man will flee from his brother, and from his mother and father, and from his wife and children. Every one of them that day had some business to occupy him with. ('Abasa\/80: 34-37)"
		   },
		   {
			"id": 2365,
			"surah": 20,
			"ayat": 17,
			"tafsir": "In this verse it is explained that Allah asked the Prophet Musa as, what was in his right hand, even though Allah knew it; the intention is to explain that the stick made of wood which in essence has no important meaning and many benefits will be made by Him an object that has great advantages and benefits that never crossed his mind, namely as a miracle for him. The stick can become a big snake, and when it is hit into the sea, the sea will split open and when it is hit against a rock, water will emit water with Allah's permission. These incidents show the perfection, power and greatness of Allah."
		   },
		   {
			"id": 2366,
			"surah": 20,
			"ayat": 18,
			"tafsir": "In this verse Allah explains the answer of Prophet Musa as to His question that, \"The stick that he used to lean on, when he was walking or when he was tired, dropped leaves for his goats to eat, and many other needs, such as carrying provisions to drive away wild beasts that would eat his goats. Musa's answer was finally cut short by saying, \"And I have some for my other needs,\" because he hoped that his conversation with his Lord would last longer, and to maintain good manners before God because of the possibility there is another question from God."
		   },
		   {
			"id": 2367,
			"surah": 20,
			"ayat": 19,
			"tafsir": "After the Prophet Musa answered God's question about the function of the staff he held, including supporting his body, driving his animals, and other functions that help with his daily work. So Allah wanted to show Prophet Musa another function of his stick that Prophet Musa had never imagined. The stick became a miracle that would prove his prophethood and help his function as a prophet. Allah ordered Prophet Musa to throw his stick."
		   },
		   {
			"id": 2368,
			"surah": 20,
			"ayat": 20,
			"tafsir": "As soon as Moses fulfilled God's command, his stick turned into a big scary snake, crawling agilely from one place to another, just like a small nimble snake, seeing this fact Prophet Musa was scared, intending to run away, but due to so much fear, he only fixed where he stood, as Allah said: And throw your staff!\" Do not be afraid! Truly in My presence, the apostles have nothing to fear. (an-Naml\/27: 10)"
		   },
		   {
			"id": 2369,
			"surah": 20,
			"ayat": 21,
			"tafsir": "Because Moses was afraid, God ordered Prophet Musa to catch the snake without hesitation and fear, because the big snake that was in front of him would be restored to its original shape as a staff."
		   },
		   {
			"id": 2370,
			"surah": 20,
			"ayat": 22,
			"tafsir": "In this verse, Allah ordered Musa (as) to insert his right hand from his sleeve and place it under his left armpit, so that when he removes his hand, it will become pure white, shining and without the slightest blemish. This was the second miracle after the first which turned a staff into a nimble snake, to demonstrate the truth of his apostolate for the people he sent to him."
		   },
		   {
			"id": 2371,
			"surah": 20,
			"ayat": 23,
			"tafsir": "Allah did it all to show the proofs of the perfection of His power and the wonders of His deeds in the heavens and on earth."
		   },
		   {
			"id": 2372,
			"surah": 20,
			"ayat": 24,
			"tafsir": "After Allah showed signs of His power and greatness, He then ordered Moses to go to the cruel Pharaoh and invite him to worship Allah and threaten him with wrath and punishment from Allah if he disobeyed, and transgressed, rebellious and arrogant. he even dared to admit that he was a god with his words, \"I am your high god.\" It was narrated from Wahb bin Munabbih that after the order came, Musa was silent for seven days thinking about the weight of the task assigned to him. After he was visited by an angel with the words, \"Obey your Lord according to His commands,\" then he got up to carry out the order and hoped that Allah would expand his chest to be able to carry out his duties properly and bravely in facing Pharaoh. He feels that the burden that is carried on him is a big and very heavy matter, which cannot be carried out except with steady courage and an open chest. He was warned to face a king whose power was the greatest, most cruel, very disloyal, very many soldiers, prosperous in his kingdom, excessive in every way. The peak of that arrogance is that he knows no god but himself."
		   },
		   {
			"id": 2373,
			"surah": 20,
			"ayat": 25,
			"tafsir": "God's command to Moses to go and meet Pharaoh was a very difficult task, therefore Moses prayed and asked God to broaden his chest and strengthen his mind when he faced Pharaoh. God's Word: So that my chest feels tight and my tongue is not smooth, then Aaron sent (with me). (asy-Su'ara\/26: 13) Besides that, he also asked Allah to make all his affairs easier, especially in conveying his apostolic news to Pharaoh, and to be given enough strength to be able to spread religion and improve the condition of the people, because without the help and Allah's help, Musa will not be able to do anything."
		   },
		   {
			"id": 2374,
			"surah": 20,
			"ayat": 26,
			"tafsir": "God's command to Moses to go and meet Pharaoh was a very difficult task, therefore Moses prayed and asked God to broaden his chest and strengthen his mind when he faced Pharaoh. God's Word: So that my chest feels tight and my tongue is not smooth, then Aaron sent (with me). (asy-Su'ara\/26: 13) Besides that, he also asked Allah to make all his affairs easier, especially in conveying his apostolic news to Pharaoh, and to be given enough strength to be able to spread religion and improve the condition of the people, because without the help and Allah's help, Musa will not be able to do anything."
		   },
		   {
			"id": 2375,
			"surah": 20,
			"ayat": 27,
			"tafsir": "Musa asked that his tongue be eloquent and free, so that he could speak fluently and firmly, so that his listeners would easily digest and understand his words, so that they would receive God's guidance. For if Moses' tongue was mute, he would not speak fluently. The mufassir differed on the cause of Musa's eloquence, as follows: a. That when Musa was small, he pulled a hair from Pharaoh's chin, so Pharaoh became angry and he planned to vent his anger. Then he asked his wife to bring balah (raw dates) and a pile of burning coals. Pharaoh's wife defended Musa by saying, \"Moses was still small, did not know anything.\" Even though there was a defense, Pharaoh still carried out his evil intentions, and the coal was placed on Moses' tongue. Since then Musa's tongue became stiff. Therefore Musa asked Allah to remove the confusion of his tongue. b. His tongue was caused by psychological factors that burdened Musa, as a result of his actions and deeds slapping and killing a Qibty. c. According to another opinion, that the confusion is congenital."
		   },
		   {
			"id": 2376,
			"surah": 20,
			"ayat": 28,
			"tafsir": "Musa asked that his tongue be eloquent and free, so that he could speak fluently and firmly, so that his listeners would easily digest and understand his words, so that they would receive God's guidance. For if Moses' tongue was mute, he would not speak fluently. The mufassir differed on the cause of Musa's eloquence, as follows: a. That when Musa was small, he pulled a hair from Pharaoh's chin, so Pharaoh became angry and he planned to vent his anger. Then he asked his wife to bring balah (raw dates) and a pile of burning coals. Pharaoh's wife defended Musa by saying, \"Moses was still small, did not know anything.\" Even though there was a defense, Pharaoh still carried out his evil intentions, and the coal was placed on Moses' tongue. Since then Musa's tongue became stiff. Therefore Musa asked Allah to remove the confusion of his tongue. b. His tongue was caused by psychological factors that burdened Musa, as a result of his actions and deeds slapping and killing a Qibty. c. According to another opinion, that the confusion is congenital."
		   },
		   {
			"id": 2377,
			"surah": 20,
			"ayat": 29,
			"tafsir": "Because Musa felt that the task entrusted to him was quite big and heavy, he asked Allah to appoint a helper from his own family, to carry out da'wah together, sharing the fate and bearing in the ups and downs that his people would face."
		   },
		   {
			"id": 2378,
			"surah": 20,
			"ayat": 30,
			"tafsir": "This verse explains that Musa (pbuh) suggested that Aaron, his own brother who was older than him, be appointed as his assistant. the people of Egypt, a place to carry out his da'wah with Musa as, This act of Moses is a good thing to emulate and emulate, because a leader or ruler should have helpers to carry out their responsibilities, but of course good helpers who can be relied on for their good intentions in carrying out his duties as an assistant. The Prophet Muhammad himself had helpers as he said: Verily I have two helpers in the sky and two helpers on earth. As for my two helpers in the sky, Jibril and Mikail, and my two helpers on earth Abu Bakr and Umar. (History of al-hakim from Abi Sa'id)"
		   },
		   {
			"id": 2379,
			"surah": 20,
			"ayat": 31,
			"tafsir": "Musa asked Allah, so that by appointing Harun as his assistant, it is hoped that he will increase his strength and abilities. Also so that Aaron is always with him in all his affairs, shoulder to shoulder in carrying out his heavy and holy task, so that he succeeds well, does not miss the intended target, and achieves the ideals that he desires properly."
		   },
		   {
			"id": 2380,
			"surah": 20,
			"ayat": 32,
			"tafsir": "Musa asked Allah, so that by appointing Harun as his assistant, it is hoped that he will increase his strength and abilities. Also so that Aaron is always with him in all his affairs, shoulder to shoulder in carrying out his heavy and holy task, so that he succeeds well, does not miss the intended target, and achieves the ideals that he desires properly."
		   },
		   {
			"id": 2381,
			"surah": 20,
			"ayat": 33,
			"tafsir": "In these verses Allah explains the background of Musa's request, so that he will always be accompanied and accompanied by Aaron in the success of his prophetic task, namely so that he can glorify Allah a lot, glorify and purify Him of the qualities and deeds that are unworthy of Him, such as the Pharaoh's claim that he announced himself as a god. In addition, so that he always remembers Allah, and always hopes for His pleasure."
		   },
		   {
			"id": 2382,
			"surah": 20,
			"ayat": 34,
			"tafsir": "In these verses Allah explains the background of Musa's request, so that he will always be accompanied and accompanied by Aaron in the success of his prophetic task, namely so that he can glorify Allah a lot, glorify and purify Him of the qualities and deeds that are unworthy of Him, such as the Pharaoh's claim that he announced himself as a god. In addition, so that he always remembers Allah, and always hopes for His pleasure."
		   },
		   {
			"id": 2383,
			"surah": 20,
			"ayat": 35,
			"tafsir": "In this verse, Musa (as) emphasizes that whatever he asks of Allah, He knows better its nature and purpose. Hopefully with Harun the spread of religion can be carried out properly, smoothly, successfully, and can paralyze various efforts of people who are misguided and misleading, can guide them to the right path."
		   },
		   {
			"id": 2384,
			"surah": 20,
			"ayat": 36,
			"tafsir": "In this verse, Allah explains that He has allowed all of Moses' requests, namely to broaden his chest, to make his affairs easier to remove the stiffness and disturbance of his tongue, to make Aaron his brother as a helper for him, so that his strength and abilities increase, working hand in hand with Aaron in carrying out his duties. So that he reads a lot of prayer beads and always remembers and remembers Allah. The six kinds of requests, as in the previous verse, are permitted by Allah for the successful implementation of this heavy and difficult mandate."
		   },
		   {
			"id": 2385,
			"surah": 20,
			"ayat": 37,
			"tafsir": "In this verse it is revealed that Allah has bestowed upon Moses several favors that were bestowed without a request, long before Moses made the above request. If God had been pleased with His generosity to give Moses many favors since his childhood without prior request, then after Moses asked for a number of things that were very necessary to expedite the path of his da'wah, towards the target he was aiming for, surely Allah would have allowed his request. Eight gifts had been given to Moses since his childhood."
		   },
		   {
			"id": 2386,
			"surah": 20,
			"ayat": 38,
			"tafsir": "This verse reminds us that when Allah was about to bestow eight kinds of gifts on Prophet Musa as, Allah gave inspiration to Musa's mother, including telling and teaching Musa's mother how to save her child from the tyranny of Pharaoh, who ordered his soldiers to kill all male babies. under his rule all were killed."
		   },
		   {
			"id": 2387,
			"surah": 20,
			"ayat": 39,
			"tafsir": "When Moses' mother was in a state of panic, she was ordered by God to put her child in a neat and strong box, then throw him into the Nile. This order was carried out by the mother of Moses immediately so that the casket fell into the hands of Pharaoh, the enemy of God and the enemy of Moses himself in the future. It is reported that one evening Pharaoh and his wife were sitting relaxed on the bank of the Nile, when suddenly he saw a chest not far from where he was. He ordered his maids to fetch the chest and bring it before him. When the chest was opened, a beautiful baby boy was seen. How happy Pharaoh's wife saw the baby. The affection and love for the baby is very deep. So he took the baby and nurtured and educated in his palace. This is the first gift. The second gift is that God has bestowed sincere affection on Moses and this love has been instilled in everyone's heart. Anyone who looks at Moses will feel affection for him. So it is not surprising that Pharaoh and his wife felt affection and love for Musa, so that his wife said to her husband, as stated in the Qur'an: And Pharaoh's wife said, \"(He) is a coolness for my heart and for you. Do not kill him. , hopefully he is useful to us or we take him as a child,\" while they are not aware. (al-Qashash\/ 28: 9) The third gift is the upbringing of Musa in the Pharaoh's palace under the supervision and observation of Allah and guarding him from everything that would disturb him, when he was raised by the family of the cruel human Pharaoh who did not know humanity."
		   },
		   {
			"id": 2388,
			"surah": 20,
			"ayat": 40,
			"tafsir": "When Moses was under the care of Pharaoh's family, they were busy looking for women who would suckle him. Every woman who had been appointed to suckle him, Moses would not suckle him. This is a hint from Allah: And We prevented him (Moses) from breastfeeding women who wanted to breastfeed (him) before that. (al-Qashash\/28: 12) Before they found the woman that Musa wanted to breastfeed him, Maryam, Musa's sister, was told by her mother to follow her sister's coffin secretly and offer the Pharaoh's family a woman who would breastfeed Musa and raise him as told in in the word of Allah: \"Shall I show you, a family that will take care of him for you and they can be good to him?\" (al-Qashash\/28: 12) Maryam's offer was well received by Pharaoh's family, so her mother, namely Musa's own mother, was brought in, and Musa followed her to her mother. Thus, Musa was brought back to the care of his own mother and his mother's worries and sorrows disappeared. In fact, how happy she was to see her child safe, fresh and fit. This is the fourth gift. The fifth gift, namely when Moses entered the land of Manuf, the land of Pharaoh, during the day which was quiet because the inhabitants were resting. He saw two people fighting, one from the Children of Israel, namely his group, and the other from the Kibti nation from the Pharaoh's group, in fact he was Pharaoh's cook. When the Children of Israel asked for help, Musa then punched the enemy of the Children of Israel. Unexpectedly, as a result of Musa's fist, the Kibti died. Upon this accidental incident, Musa felt anxious and afraid, as told in the word of God: Because of that, he (Moses) became afraid to be in the city while waiting (due to his actions). (al-Qashash\/28: 18) When the incident became known to Pharaoh, he was very angry and tried to kill Musa. Pharaoh's anger and evil intentions were told to Moses by a member of the Pharaoh's group who had faith in Moses, so Musa went away to escape to the land of Midian. Thus he was saved from Pharaoh's persecution. Moses was not only saved from persecution and murder in this world, but also from the punishment in the hereafter, because the sins of people who kill accidentally have been forgiven by Allah, for his prayers, as told by Allah in His word: He (Moses) prayed, \"O my Lord, indeed I have wronged myself, so forgive me.\" So He (Allah) forgave him. Indeed, Allah, He is the Most Forgiving, the Most Merciful. (al-Qashash\/28: 16) Allah gave Musa a succession of trials, to find out how far Musa's mental endurance was, as is usually the case for someone who is prepared to receive the apostles from Allah, but he could pass all of them safely, just as Musa was saved from slaughtering babies en masse by order of Pharaoh, he was saved when he was about to be killed by Pharaoh because he plucked Pharaoh's beard, Moses was defended by Pharaoh's wife on the grounds that he was still small, could not distinguish between good and bad, so Pharaoh's anger subsided and he was saved Moses from the murder of Pharaoh and other trials. This is the sixth gift. The seventh gift is the flight of Moses to Midian, where he stays for a long time, about ten years. At first, he experienced a bitter life among the people of the Madyan country, feeling the pain of living as a foreigner who needed many necessities. In the end, he was forced to become a laborer, herding his father-in-law's goats, in order to get a modest fee, to cover his needs, who was then married to Safura, the daughter of Sheikh Madyan. Thus Moses, until he reached the appointed age, neither more nor less to be made an apostle, that is, when he reached the age of forty."
		   },
		   {
			"id": 2389,
			"surah": 20,
			"ayat": 41,
			"tafsir": "The eighth gift is that Allah has chosen Musa to be an apostle, establishes evidence for the truth he has brought, leads mankind to believe in oneness of Allah and acts as an intermediary between the Creator and His creatures, conveys His true religion, which brings people to the happiness of the world and hereafter."
		   },
		   {
			"id": 2390,
			"surah": 20,
			"ayat": 42,
			"tafsir": "This verse explains that God ordered Moses and his brother Aaron to go to Pharaoh and his people with the evidence and miracles that had been shown to him, such as the change of a staff into a large, agile snake, slithering here and there, the discharge of Moses' hands from his armpits in a white state. clean shining like the sun without blemish to be used as proof and reason for the truth of his prophethood. In this verse, Allah also warns Musa and Harun that in carrying out their da'wah and conveying the message of their Lord to Pharaoh and his people, they should be serious and not negligent. Moses was ordered to explain to them that Allah sent them both to give good news of the reward that had been prepared for those who responded well to his call, and to give a painful threat to those who disobeyed and did not want to accept it."
		   },
		   {
			"id": 2391,
			"surah": 20,
			"ayat": 43,
			"tafsir": "This verse explains that Allah ordered Musa as and Harun as to go to Pharaoh to present the proofs of the truth of his prophethood bestowed by Allah, and explains Pharaoh's fallacy, because Pharaoh had gone too far in his actions beyond limits, to the extent that he claimed that he was God. He declared to his people with the words, \"I am your most high god.\" This verse specializes in preaching and appealing to Pharaoh, while in the previous verse, preaching is called upon to the public, because if Pharaoh had believed in the teachings brought by the Prophet Musa (as), and Prophet Aaron, of course all Egyptians would follow him as the saying goes: 'The people follow the religion of their king. ."
		   },
		   {
			"id": 2392,
			"surah": 20,
			"ayat": 44,
			"tafsir": "Allah taught Musa and Harun how to deal with Pharaoh, namely with soft words and gentle speech. Someone who is faced in this way will be impressed in his heart and will tend to welcome and accept the da'wah and invitations that are called upon him. Such a wise method has also been taught to the Prophet Muhammad by Allah, as His word: \"Call (humans) to the way of your Lord with wisdom and good lessons and refute them in a good way.\" (an-Nahl\/16: 125) On the other hand, if a person is confronted with violence and with shouts, let alone be subdued and submissive, instead he will oppose and distance himself, as explained in the word of Allah: If you had been tough and hard-hearted, they would have stay away from your surroundings. (Ali 'Imran\/3: 159) In addition to Allah's instructions to Musa and his brother, so that they were polite to face Pharaoh, they were also taught the words that Musa would convey to Pharaoh, as narrated by Allah in His word: So say (to Pharaoh ), \"Is there your desire to cleanse yourself (from misguidance), and I will lead you to the way of your Lord so that you will fear Him?\" (an-Nazi'at\/79: 18-19) It was hoped that Pharaoh would realize his error and fear the punishment that would befall him if he persisted in disobedience."
		   },
		   {
			"id": 2393,
			"surah": 20,
			"ayat": 45,
			"tafsir": "Before Musa and Harun as carried out God's command to come to Pharaoh and deliver appeals to him, they both frankly told God, that they were afraid and worried about facing Pharaoh, lest they be tortured by Pharaoh, or before delivering da'wah and explaining miracles which showed the truth of his preaching, Pharaoh had acted, issued words that were inappropriate against Allah, because he was a cruel, hard-hearted person, without the slightest humanity."
		   },
		   {
			"id": 2394,
			"surah": 20,
			"ayat": 46,
			"tafsir": "Allah consoled Musa and Harun a.s. so that they both did not need to be afraid of Pharaoh, because Allah would help him. He was the one who strengthened and protected him from the evil Pharaoh. He always heard and saw what happened between the two of them and Pharaoh, both in words and deeds. He was the one who would protect them both from the evil that Pharaoh might throw at him."
		   },
		   {
			"id": 2395,
			"surah": 20,
			"ayat": 47,
			"tafsir": "Allah ordered again that Musa and Harun a.s. went to Pharaoh and informed him that the two of them were Allah's Apostles who had been sent to him to deliver the correct message so that Pharaoh would know the positions and duties of the two of them. Before Musa and Aaron invited Pharaoh to believe in Allah, both of them asked Pharaoh, so that he would free the Children of Israel from their torture and oppression, free them from hard work, such as digging, building, lifting stones, both men and women. Pharaoh to let the Children of Israel go to Palestine. After that, Musa and Harun as explained the duties and obligations of Allah that the two of them came to explain proofs and clear evidence for the truth of their apostolate. Happiness, prosperity in this world and in the hereafter for those who obey Allah's messengers, and believe in His signs, and stay away from bad and misleading things. Such utterances were also used by the Prophet Muhammad when he sent a letter containing preaching to Heraclius king of Rome, as follows: \"In the name of Allah, the Most Gracious, the Most Merciful. From Muhammad the servant and messenger of Allah to Heraclius, ruler of the Roman country. Safety is bestowed upon those who follow the instructions. As for after that, in fact I call you to Islam. Adopt the religion of Islam so that you are safe, Allah will give you a double reward.\" (History of al-Bukhari and Muslim from Ibn 'Abbas)"
		   },
		   {
			"id": 2396,
			"surah": 20,
			"ayat": 48,
			"tafsir": "In this verse Allah explained that it was revealed to Musa and Harun that punishment would be inflicted both in this world and in the hereafter on those who denied the preaching and call of the apostles who called to monotheism, and turned their backs and ignored the teachings and instructions of the apostles. In line with these verses, Allah says: So as for those who transgress the limits, and prioritize the life of the world, then indeed, hell is the place where they live. (an-Nazi'at\/79: 37-38 and 39) And His words: So I warn you with a burning hell, which only the most wretched people enter, who deny (the truth) and turn away (from the faith). (al-Lail\/92: 14-15 and 16)"
		   },
		   {
			"id": 2397,
			"surah": 20,
			"ayat": 49,
			"tafsir": "It was narrated from Ibn 'Abbas that when Musa and Harun (as) arrived in front of Pharaoh's palace the two of them stood there, waiting for permission to enter. After being detained for a long time, because of very tight security, the two of them were only allowed to enter to meet Pharaoh; and a dialogue ensued between the two of them and the Pharaoh. In this verse Allah narrates the dialogue. Pharaoh asked, \"If you are really the messengers of your God who sent you here, I hope you will tell me, who is your God?\" In this verse, it is as if it was Moses who was asked by Pharaoh, because only Moses' name was called, even though the question was addressed to Moses and Aaron, because indeed Moses was the main one, while Aaron was only his helper."
		   },
		   {
			"id": 2398,
			"surah": 20,
			"ayat": 50,
			"tafsir": "In this verse, God explains Moses' answer to Pharaoh's question that the one who sent the two of them is God who has equipped the creatures he created with limbs according to their respective interests, such as eyes to see, ears to hear, as well as hands, feet, nose and so on. -other members of the body according to their respective functions in accordance with instructions from Allah. God's Word: And God brought you out of your mother's belly knowing nothing, and He gave you hearing, sight and conscience, that you might be grateful. (an-Nahl\/16: 78) Then it is Allah who guides by giving him the function of these members to be able to distinguish between what is good and what is bad. In line with this verse. Allah's Word: For the sake of the soul and its (creation) perfection, He inspired it (way) of evil and piety, (asy-Shams\/91: 7 and 8) And His words: And We have shown him two ways (virtue and evil) ). (al-Balad\/90: 10)"
		   },
		   {
			"id": 2399,
			"surah": 20,
			"ayat": 51,
			"tafsir": "To divert Musa from preaching to another situation, Pharaoh asked him, \"O Musa, what will happen to the afterlife in the future for the people who used to be like the people of 'Ad, the Samud people who did not worship Allah, but they worshiped other than Allah. They have offerings of inanimate objects such as stones, trees, wood and others. Will they be put into heaven or will they be put into hell, tortured and punished?\" Pharaoh deliberately did this so that Musa would stop presenting his arguments and other strong reasons justifying his preaching, because Pharaoh was worried that Musa's preaching would be consumed by his people, so they believed in Moses and abandoned his misguided belief that he believed that Pharaoh was Lord."
		   },
		   {
			"id": 2400,
			"surah": 20,
			"ayat": 52,
			"tafsir": "Pharaoh's question was answered by Musa (as) that the question he put forward was a question about the unseen, while the unseen, no one knows except Allah, as stated in His word: He is Allah, there is no god but Him. Who knows the unseen and the real. (al-hasyr\/59: 22) He knows the unseen, but He does not show anyone about the unseen. (al-Jin\/72: 26) The fate of idol worshipers, people who have worships other than Allah, is completely in Allah's knowledge, no human being knows about it. All human actions, including the fate of the people that Pharaoh asked about, have been recorded and concluded in a book, namely \"Lauh Mahfudz\". Nothing is left out, neither the big nor the small, except in the book, as explained in the word of Allah: What book is this, nothing is left, the small and the big but everything is recorded,\" and they found ( all) what they have done (written). (al-Kahf\/18: 49) Based on that record they will be rewarded according to their deeds in this world. This verse closes with an affirmation that Allah will not make mistakes and will not forget , to prevent false assumptions and accusations, that the notes in the book could be wrong, misrecorded, or that there are things that were left behind which were not recorded by the authorities because they forgot, so something happened that was not in accordance with the actual reality ."
		   },
		   {
			"id": 2401,
			"surah": 20,
			"ayat": 53,
			"tafsir": "In order to strengthen that Allah will not make mistakes and forget, and to reject the possibility of suspicion arising that the records in \"Lauh Mahfudz\" could be wrong and some were not recorded due to forgetting, this verse emphasizes that God is in control of the records, namely It is God Who made this earth a vast expanse for humans to use as a place to live, wake up, sleep and travel freely everywhere, as Allah says: Allah is the One who made the earth for you as a place to live. (al- Mu'min\/40: 64) And His words: It was He who made the earth for you easy to explore, so explore in all directions. (al-Mulk\/67: 15) It is God who has made roads on this earth, both in the mountains and in low places to connect one place to another, between one city and another, between one village to another, in order to facilitate carrying out human needs. In line with the word of Allah: And Allah made the earth for you as an expanse, so that you can go to and fro on broad roads. (Nuh\/71: 19-20) And His words: \"And We have made solid mountains on this earth so that it (does not) shake with them, and We made (also) wide roads there, so that they may be guided.\" (al-Anbiya'\/21: 31) It is God, who sends down rainwater from the sky which causes the growth of plants and fruits of various tastes, some sour, some sweet, various kinds and types and benefits. There are things that are suitable for humans, and there are things that are good for animals, all of which show the magnitude of the gifts and the many blessings that God has bestowed on all of His servants. In line with the word of Allah: It is He who sends down water (rain) from the sky, then He produces with it (rain) fruits as sustenance for you. (al-Baqarah\/2: 22)"
		   },
		   {
			"id": 2402,
			"surah": 20,
			"ayat": 54,
			"tafsir": "God commanded us to eat the fruits and plants, which are of various kinds and varieties, and we give them to animals to eat. Whatever is suitable for humans to eat, such as rice, sweet potatoes, corn, sago and others, then eat according to Allah's word: And eat of what Allah has given you as a lawful and good sustenance. (al-Ma'idah\/5: 88) Whichever is suitable for animals such as grass given to animals. At the end of this verse it is emphasized that all of the characteristics mentioned above show the power of Allah and the greatness of His kingdom, are clear evidence of His oneness and show that there is no God but Him. People who are reasonable and sane-minded, of course, will acknowledge and believe in the oneness of Allah."
		   },
		   {
			"id": 2403,
			"surah": 20,
			"ayat": 55,
			"tafsir": "Apart from the uses and benefits of the earth and those mentioned above, in this verse Allah explains other uses and benefits, namely that from the earth every human being was made by Allah, since the Prophet Adam was the first human being in this world. Also to the land, humans will be returned after death, and the land will return to the way it was before it was created. From that also humans will be resurrected after he dies and rearrange his limbs which have been destroyed mixed with the soil, as their original form which then returns his spirit. In line with this verse, the word of Allah: (Allah) said, \"There you live, there you die, and from there (also) you will be resurrected.\" (al-A'raf\/7: 25) In the hadith it is explained as follows: \"Verily, the Messenger of Allah visited a corpse. After the corpse was buried, he took a handful of soil and then threw it into the grave while saying \"minha khalaqnakum\" (from it We made you), then take another one and say \"fiha nu'idukum\" (to him We will return you), then take another for the third time and say \"minha nukhrijukum taratan ukhra\" (and from it We will take you out another time) (History of Ahmad and al-hakim from Abu Umamah) In another hadith it is explained that after the body of Umm Kulsum bint Rasulullah saw was placed in his grave, Rasulullah saw said: \"From it (land) We made you, and to it We will return you, and from it We have brought you out again in the name of Allah, and in the way of Allah and in the religion of the Messenger of Allah.\" (Ahmad and al-hakim's history from Abu Umamah)"
		   },
		   {
			"id": 2404,
			"surah": 20,
			"ayat": 56,
			"tafsir": "This verse explains that Allah has shown and introduced the signs of His power and the proofs of the truth of Moses' prophethood in the form of miracles that have been given to Moses, but Pharaoh and his followers still denied and denied Moses and did not want to believe in what was conveyed to him. , even though they have essentially believed in its truth, as Allah says: \"And they denied it because of their tyranny and arrogance, even though their hearts believed in (the truth) of it.\" (an-Naml\/27: 14)"
		   },
		   {
			"id": 2405,
			"surah": 20,
			"ayat": 57,
			"tafsir": "In this verse, it is explained how Pharaoh disobeyed, and how Pharaoh vilified Moses' efforts and work. Pharaoh said, \"O Musa! Did you come here to the place where you once lived, after being invisible for a long time, with the intention of instilling understanding in the general public that you are a prophet, and they must follow you and believe in the religion that you bring, so that you are who was on the winning side, then drove us out of our place with your magic that you call a miracle, and you are the one who reigns as king?\" Pharaoh deliberately issued such words with the intention to bring and make his people angry and hate Moses. He explained that Musa's arrival was not just to save the Israelites from their dominion, but his real intention was to drive the Egyptians out of their homeland, then to take control of all their possessions. Thus Musa's efforts failed, because no one would hear and pay attention to his preaching, regardless of the miracles he brought. They will defend their country desperately by using all the power that is in them."
		   },
		   {
			"id": 2406,
			"surah": 20,
			"ayat": 58,
			"tafsir": "This verse explains that Pharaoh promised earnestly to bring magicians to match the magic of Moses. Pharaoh asked Moses to determine a place and time to meet with his magicians, and promised that he and Moses would not violate the agreed terms. This was done by Pharaoh to show that he really had a hard heart and solid preparation to compete against Musa's magic, with the belief that he would win in the match later. Also Pharaoh suggested that Moses choose a wide area, not hilly so that the audience could watch and see the match clearly, not obstructed by anything."
		   },
		   {
			"id": 2407,
			"surah": 20,
			"ayat": 59,
			"tafsir": "This verse explains that according to Pharaoh's request, Musa determined the time of the meeting intended to complain about his miracles with Pharaoh's magic, namely on the day of Syam an-Nasim which was usually held at the end of the year. They all gathered on that day with beautiful clothes and beautiful ornaments, almost nothing was left behind. Musa also determined the time for the gathering, namely when the sun had risen, a time when the sun had already risen, so that all the spectators could watch and see the match later clearly."
		   },
		   {
			"id": 2408,
			"surah": 20,
			"ayat": 60,
			"tafsir": "In this verse Allah explains that an agreement was reached between Moses and Pharaoh regarding the place, day and time for the match to be held later, Pharaoh left the place of the debate, to arrange his deception. The sorcerers were gathered, their equipment perfected, their backers and assistants and others prepared. On the day that had been determined together, namely on the feast of Syam an-Nasim, Pharaoh and his entourage departed to the place he had agreed with Musa. He sat on his royal chair, accompanied by his top officials, flanked by his people on his left and right. Not long after that, Moses came with his staff accompanied by his brother Aaron. Pharaoh galvanized his magicians who had stood and lined up neatly in front of him, expecting them to do their job, demonstrating their skills to the best of their ability, promising to fulfill all their requests, if they won, as explained in the word of God: And the magicians came to Pharaoh. They said, \"(Will) we get rewarded, if we win?\" He (Pharaoh) replied, \"Yes, even you must be among those who are close (to me).\" (al-A'raf\/7: 113 and 114)"
		   },
		   {
			"id": 2409,
			"surah": 20,
			"ayat": 61,
			"tafsir": "When Moses was face to face with Pharaoh's sorcerers, Moses warned them not to follow Pharaoh's invitation, fabricate lies to Allah, say nonsense to Him, such as assuming the miracles he brought were magic, even though it was wrong. one of His greatness and power. If you take such an attitude as Pharaoh, God will torment you, consume your offspring so that no one is left, as recompense for your misguided actions. God's Word: Someday Allah will repay all that they invented. (al-An'am\/6: 138) Those who invent lies against Allah are the losers. He will not be successful in his endeavors, will not reach his goals, because he is the most persecuted, as Allah says: And who is more unjust than one who invents a lie against Allah, or who denies His verses? Indeed, the wrongdoers are not lucky. (al-An'am\/6: 21) Therefore, wake up and be aware. Leave the act of inventing a lie to Allah. The misguided path that you are following, so that you will be safe from the punishment that will befall those who invent lies against Allah. people who have gone astray in this world, but they still think that what they do is good and right."
		   },
		   {
			"id": 2410,
			"surah": 20,
			"ayat": 62,
			"tafsir": "After the Pharaoh's magicians heard Moses' warnings and threats, they became confused, each having their own different responses. Then they held a special meeting, brainstormed what they should have done. Their conversation is kept very secret so as not to leak. That's usually how it is, a meeting is held to find tactics to beat the opponent, the conversations and decisions of the meeting must be kept secret, lest the opponent find out about it. Likewise Pharaoh's magicians, fearing that their conversation would be heard and known by Moses and Aaron, then both of them made preparations and equipment that was tough enough to deal with his magic which was difficult to defeat."
		   },
		   {
			"id": 2411,
			"surah": 20,
			"ayat": 63,
			"tafsir": "Among their undisclosed conversations that can be recorded is that if what Musa displays later is really magic, it is clear that they will defeat it. But if what he displays is a miracle from God, they may not be able to defeat him. If he beats us in the match later, what can we do, we just give up, and follow him.\" Finally they agreed to say that Moses and Aaron were very clever magicians, would drive us out of our country with that magic, and will strip us of this noble position. They deliberately compile a formula in such a way that contains these three factors which can result in the hatred of Moses and Aaron and the influence of both of them disappears, but common sense and sane minds, will not accept the reasons of sorcerers, people who want to violate a person's human rights by expelling him from his place of residence, as well as people who want to eliminate his position."
		   },
		   {
			"id": 2412,
			"surah": 20,
			"ayat": 64,
			"tafsir": "According to Pharaoh's sorcerers, Moses and Aaron were magicians who wanted to expel them from the land of their homeland and wanted to seize power. tactics and trickery and show all the intelligence that is owned on the day of the match later. Thus, it was easy for them to defeat the magic of Musa and his brother Aaron. How happy they would be on that day if victory would be on our side. Allah's Word: So when the magicians came, they said to Pharaoh, \"Are we really going to get a big reward if we win?\" He (Pharaoh) replied, \"Yes, and even you will certainly get a close position (to me).\" (asy-Syu'ara\/26: 41 and 42)"
		   },
		   {
			"id": 2413,
			"surah": 20,
			"ayat": 65,
			"tafsir": "In this verse Allah explains that after Pharaoh's sorcerers felt that they had sufficient preparations, had all their supplies complete, they came to the designated match venue in neat rows. After they were confronted by Moses, they gave him choices for Moses to choose, did Moses throw the stick first? Or did the sorcerers cast it first? The action of these sorcerers is a wisdom that manifests good adab and their obedience to Musa, as if they had received inspiration from Allah. Musa after thinking for a while then chose that they should be the first to throw their staff, with the consideration that if the sorcerers had demonstrated their magic with sincerity and ability, it was then that God would show His power, by winning the right over the right. vanity, won a miracle over witchcraft and lost the magic of vanity. In accordance with the word of Allah: Actually, We throw the right (truth) to the wrong (not right) then that right destroys it, then immediately (the wrong) disappears. (al-Anbiya'\/21: 18)"
		   },
		   {
			"id": 2414,
			"surah": 20,
			"ayat": 66,
			"tafsir": "In this verse Allah explains that after Moses made his choice, he said to Pharaoh's sorcerers, \"You were the first to start, so that we could see your magic, and know what you were actually doing. After that they threw their ropes and sticks, saying , \"By the glory of Pharaoh, indeed we will win.\" Unexpectedly, suddenly the ropes and sticks that were thrown by them, were seen by Moses, as if he was crawling fast, it looked as if a snake was moving agile here and there"
		   },
		   {
			"id": 2415,
			"surah": 20,
			"ayat": 67,
			"tafsir": "This time, Pharaoh's magicians demonstrated their special sorcery, so that Moses was afraid in his heart to see what happened. It was not only Moses who was afraid, but the spectators were afraid, because their eyes had been enchanted, with that special magic, as God said: Then after they had cast them, they cast a spell on the eyes of the people and made the people afraid, because they performed a magic that great (amazing). (al-A'raf\/7: 116)"
		   },
		   {
			"id": 2416,
			"surah": 20,
			"ayat": 68,
			"tafsir": "In this verse it is explained that God comforted Moses. He said to Musa, O Musa! will be defeated and will not move.\""
		   },
		   {
			"id": 2417,
			"surah": 20,
			"ayat": 69,
			"tafsir": "After that God ordered Moses to throw the stick that was in his right hand. Moses immediately carried out the order. By God's nature and will, Moses' staff became a huge snake and swallowed up everything Pharaoh's sorcerers made, namely the ropes and staff looked like moving snakes. In fact, what they are doing is mere fantasy and just a trick of the sorcerers, as a result of an orderly and long enough practice, it has absolutely no substance and will not last long. However, the sorcerer will not win with his deceptive magic. That is an act of sin, and will not prosper those who commit sins. As Allah says: Indeed, those who sin will not prosper. (Yunus\/10: 17)"
		   },
		   {
			"id": 2418,
			"surah": 20,
			"ayat": 70,
			"tafsir": "In this verse it is said that after Moses threw down the stick that was in his right hand, the stick became a big snake and swallowed up everything that Pharaoh's sorcerers did. Pharaoh's sorcerers seeing the majesty of the incident, and knowing that what Moses did, was not magic, but a miracle, not from the sorcery that they knew, nor was it a trick that they knew, and that was the truth which cannot be doubted, and no one can do such a thing, except those who have the power that if He wills something, it is enough to say, \"be it,\" then it will be; they immediately fall down, prostrate themselves with a pledge that they have faith in the Lord of all the worlds. God of Moses and Aaron."
		   },
		   {
			"id": 2419,
			"surah": 20,
			"ayat": 71,
			"tafsir": "In this verse Allah explains that Pharaoh, after learning that his magicians had surrendered and believed in the God of Moses and Aaron, was very angry with them, because they had committed two grave mistakes. First, they recklessly believed in Moses, before they thought it through and before getting permission from him. Second, because he thought that they were Musa's students in witchcraft, they agreed to show their weaknesses, in order to make Musa's preaching stronger and acceptable to many people so that Pharaoh felt that his business was being seen as bigger and bigger. To prevent the sorcerers from being followed by the crowd, Pharaoh threatened to cut off their hands and feet crosswise, so they could no longer do anything. Also Pharaoh threatened to crucify them at the base of a date palm. Pharaoh threatened severe torture to his magicians who had believed in Moses, so that the magicians compared his torment with the torment of the God of Moses who did not cut off hands and feet by crossing each other, so that they would return to their original beliefs. and abandoned his belief in Moses, because Pharaoh thought that his magicians had faith in Moses, only because they were afraid of the painful and prolonged torment and punishment of the God of Moses."
		   },
		   {
			"id": 2420,
			"surah": 20,
			"ayat": 72,
			"tafsir": "This verse explains that Pharaoh's threat was ignored by the sorcerers who had faith in Moses, and it had no effect on them in the slightest. They will not return to adopting a misguided belief, but they will continue to believe in Moses based on clear evidence, namely the miracles they witnessed on Moses' rod that came from Allah, the Lord who created them. They will not waver and shift from their current beliefs no matter what Pharaoh will do to them. They are of the opinion that even if Pharaoh can carry out his threat only in this world, because Pharaoh can only carry out his cruelty and tyranny in this mortal world, but they prioritize and expect pleasant rewards in the hereafter, a place that is eternal and eternal."
		   },
		   {
			"id": 2421,
			"surah": 20,
			"ayat": 73,
			"tafsir": "Pharaoh's sorcerers were determined to have faith in Allah. God calls all the worlds, God who has done a lot of good to them during his life. Whatever will happen, whatever will befall them, they hope that Allah will forgive all the mistakes and sins they have committed, especially the sin of witchcraft which Pharaoh has ordered to do. This verse closes with an affirmation that Allah is the best giver of rewards to those who obey His commands, and His punishment is more painful and eternal for those who commit immorality, violate His commands, and at the same time as an answer to the words Pharaoh said, \"Surely you will know which of us is more painful and more enduring in torment.\""
		   },
		   {
			"id": 2422,
			"surah": 20,
			"ayat": 74,
			"tafsir": "In this verse, Allah explains that whoever comes to his Lord in the hereafter will be in a state of sin, because when he was in the world he denied, did not want to believe in Allah's verses, and did a lot of immorality, abandoned Allah's commands and violated His prohibitions, he will put into hell hell. He will not die in it and continue to be tortured without end. In line with this verse, the word of Allah: And those who disbelieve, for them hell is Hell. They were not destroyed until they died, and their punishment was not relieved from them. (Fathir\/35: 36) And His words: And those who are wretched (infidels) will stay away from it, (namely) those who will enter the great fire (hell), then he will not die there and not (also) live . (al-A'la\/87: 11-12 and 13)"
		   },
		   {
			"id": 2423,
			"surah": 20,
			"ayat": 75,
			"tafsir": "On the other hand, in this verse Allah explains that whoever comes to his Lord in the hereafter with a state of faith in Allah and in what His messenger brings such as miracles and others, and has done good deeds truly and sincerely, he will obtain a high and noble place, because of his faith and good deeds. Each person in the hereafter will receive degrees according to his deeds, as explained in the word of Allah: And each person has a rank, (according to) what they do. And your Lord is not unaware of what they do. (al-An'am\/6: 132)"
		   },
		   {
			"id": 2424,
			"surah": 20,
			"ayat": 76,
			"tafsir": "In this verse, Allah explains that what is meant by a high and noble place is Jannatu 'Adn, namely heaven where one resides. In heaven rivers flow, the contents of which include wine, honey, milk and water, the inhabitants of which will live forever. That is the reward for people who are clean from disbelief and disobedience. How lucky are they as Allah says: Really lucky are those who purify themselves (by faith). (al-A'la\/87: 14)"
		   },
		   {
			"id": 2425,
			"surah": 20,
			"ayat": 77,
			"tafsir": "In this verse Allah explains that there is no sign that Pharaoh will accept the reasons and evidence put forward to him, he is still in his arrogance and arrogance, Allah reveals to the Prophet Musa so that he will leave Egypt, the land of Pharaoh at night so that Pharaoh will not see and his army, along with the servants of Allah whom he sent to save them from the tyranny of Pharaoh. Musa and the Children of Israel left Egypt, when they arrived at the shores of the Red Sea, the Children of Israel said to Moses, \"O Musa, Pharaoh and his army caught up with us from behind, in front of us a vast expanse of sea, what should we do, to cross the sea .\" God commanded Moses to beat the sea with his staff. After Moses carried out this order, the sea parted to the other side. The parts of the sea are as many as the number of tribes in the Children of Israel, namely twelve and is a dry road in the middle of the sea that is not muddy and not watery. Between the halves, the water stood like a mighty mountain. Each tribe followed only one road. They can look at each other, can see one tribe to another. Musa and the Children of Israel walked their own way feeling safe, not worrying about being overtaken by Pharaoh and his army, and not feeling afraid that they would drown until they reached the other side of the sea safely as stated in the word of Allah: Then We revealed to Moses, \"Strike the sea with your stick.\" So the sea was torn apart, and each part was like a great mountain. (asy-Syu'ara\/26: 63) And His words: And We saved Musa and those who were with him. (asy-Syu'ara\/26: 65)"
		   },
		   {
			"id": 2426,
			"surah": 20,
			"ayat": 78,
			"tafsir": "In this verse, Allah explains that after Pharaoh learned that Musa and the Children of Israel left Egypt, he sent people to the cities to gather his troops with the intention of following Musa and his entourage. Pharaoh was so angry that he ordered his soldiers to chase Musa and his people, because they were thought to always do things that made him angry. As Allah says: Then Pharaoh sent people to the cities to gather (his army). (Pharaoh said), \"Indeed they (the Children of Israel) are only a small group, and indeed they have done things that anger us. (asy-Syu'ara\/26: 53-54 and 55) After that Pharaoh and his army immediately chased after Musa and his entourage. After arriving at the edge of the sea and seeing many roads stretching out before them, with no slightest suspicion they followed the paths that Musa and his entourage had passed, thinking they were normal roads. After Pharaoh with his army was in in the middle of the ocean, while Musa and his entourage had reached the other side and had landed safely, suddenly the sea waters reunited and covered Pharaoh and his army, so they all drowned. Pharaoh before drowning and when he saw a dangerous situation and it was impossible to save himself from the danger of drowning, then he realized and said the words that show that he acknowledges and believes that there is no god but Tuha n whom the Children of Israel believed in, and he was a person who submitted himself to Allah. Pharaoh's confession was useless, because he had committed a grave sin and caused corruption on earth. Pharaoh drowned but his body was saved to be a proof of Allah's power for generations to come, as Allah says: So that when Pharaoh was about to drown he said, \"I believe that there is no god but God in whom the Children of Israel believe, and I am one of those -Muslims (surrender).\" Why only now (you believe), when in fact you have been disobedient long ago, and you are among those who do mischief. So today We saved your body so that you can be a lesson for those who come after you, but most people do not heed Our signs (power). (Yunus\/10: 90-91 and 92)"
		   },
		   {
			"id": 2427,
			"surah": 20,
			"ayat": 79,
			"tafsir": "This verse explains that Pharaoh misled his people. He thought that Musa and the Children of Israel would not be able to escape from his pursuit because the ocean stretched wide in front of him. After they reached the shore, he acted as if because of his greatness the sea was split to form roads, so he invited his soldiers to enter the streets until they all drowned. Pharaoh could not get instructions at all to avoid the danger of drowning, so he and his army perished."
		   },
		   {
			"id": 2428,
			"surah": 20,
			"ayat": 80,
			"tafsir": "This verse explains that Allah has given the Children of Israel three kinds of favors. 1. He saved them from the cruelty of their enemy, namely Pharaoh and his people. When Pharaoh inflicted the severest punishment on the Children of Israel, they slaughtered the sons and spared the daughters, and when Allah drowned Pharaoh and his army while Moses was watching. As Allah says: And (remember) when We saved you from (Pharaoh and) Pharaoh's followers. They inflicted very severe torments on you. They slaughtered your sons and spared your daughters' lives. And in that is a great trial from your Lord. And (remember) when We parted the sea for you, so that We could save you and We drowned (Pharaoh and) Pharaoh's followers, while you watched. (al-Baqarah\/2: 49 and 50) 2. Musa spoke directly to his Lord on the right side of Mount Sinai and Allah sent down the Torah to him detailing clearly His Shari'a. 3. They were awarded Mann, which is food like honey, tastes very sweet, and the color is white like ice, and Salwa, which is a quail that has delicious meat, when they get lost in the vast desert. This food is available from dawn until sunrise."
		   },
		   {
			"id": 2429,
			"surah": 20,
			"ayat": 81,
			"tafsir": "In this verse Allah orders them to eat of the good sustenance, which tastes delicious and which Allah has bestowed upon them, they should never misuse it, such as spending it extravagantly, not being grateful for it, donating to disobedience, and so on. , because if so it means they have invited God's wrath that will inflict His punishment. Woe and perish to those on whom the wrath of God has fallen."
		   },
		   {
			"id": 2430,
			"surah": 20,
			"ayat": 82,
			"tafsir": "In this verse, Allah confirms that He is Most Forgiving to those who repent of shirk, cleanse themselves from sins, are sincere and their deeds are done solely for the sake of Allah, fulfill His obligations, stay away from disobedience, istiqamah in worship until he dies, and fulfill Allah's commands. , as explained in His word: And worship your Lord until sure (death) comes to you. (al-hijr\/15: 99)"
		   },
		   {
			"id": 2431,
			"surah": 20,
			"ayat": 83,
			"tafsir": "God gave a warning to Moses, because he quickly climbed the mountain and left his people below, even though God had ordered him to go up to the hill together with his people to receive some of the Torah in pieces and sheets. Actually, he really wanted to pray with his God to receive the pieces of the Torah. Because of that very desire, he left without inviting his people until he climbed up the hill alone. He left his people below and he ordered Aaron to watch over them as long as he was not among them. Arriving on the hill he concentrated his soul and mind waiting for what God would reveal to him as He had promised. Suddenly Allah said asking with a tone of rebuke or reproach. Why did he rush up the hill alone without taking his people with him, when he had been ordered to come with them? Indeed, God's rebuke was right for his mistake, because apart from not carrying out God's command as a whole, Moses had left his people without a leader even though there was his brother Aaron who would watch over them. It was as if Moses, because he was driven by a strong desire to do munajat with his Lord, had let go of his responsibility towards his people and no longer cared about what would happen to them while he was gone. This for a Prophet entrusted by Allah to lead and supervise his people is a negligence or neglect of his main duties which should be regretted and he deserves to receive a rebuke or reproach from his Lord."
		   },
		   {
			"id": 2432,
			"surah": 20,
			"ayat": 84,
			"tafsir": "Musa answered his Lord's warning by saying that his people were behind him and the distance between him and his people was not that far. If he takes a few steps before going up the mountain, it is not with the intention of leaving them and if they are summoned, they will definitely be able to gather with him in a short time. Indeed he rushed up this hill, because he wanted to carry out Allah's command immediately, at the time as it had been determined, that is, after he and his people had been around this hill of Tur for 40 nights. He came in a hurry because he wanted to quickly gain Allah's approval. It was because of this strong desire to please him that he became heedless and negligent of Allah's command to come with them."
		   },
		   {
			"id": 2433,
			"surah": 20,
			"ayat": 85,
			"tafsir": "In this verse it is explained that after Musa left his people to pray with his God, his people had deviated from the religion of Tawheed and had worshiped a calf statue made by Samiri. Indeed, Allah wanted to test the faith of the Prophet Musa's people, did they really have a strong and steely faith or did they still have traces of shirk or belief in worshiping idols in their hearts and souls. It turned out that their faith was not that strong and deep because only a few days after they were left by Musa and they were still under Aaron's supervision, they were easily deceived and fell into the trap of Samiri who came from the cow worshipers. But Allah will not let or accept it when people claim to have faith without being tested first according to His words: Do people think that they will be left alone by saying, \"We have believed,\" and they will not be tested? And verily, We have tested those before them, so Allah will surely know those who are truthful and surely will know those who are lying. (al-'Ankabut\/29: 2 and 3) It turned out that the people of Musa were not among those who had a strong and deep faith because they had just been abandoned by Musa for a short time (according to history, only 20 days) they had left the religion of monotheism and reverted to the religion of worshipers. - idol worshippers. This was unrepentant and probably happened because they had been under the pharaohs for so long. Because of this, their mentality is damaged and their morals are weak, so that loyalty and patience cannot be expected from them to defend a principle. So it was easy for Samiri to trick them by making a golden calf-shaped statue that could sound like a calf, so they were attracted by Samiri's words that this was the real God. As for the God of Moses and Aaron who cannot be seen, why do we want to worship him?"
		   },
		   {
			"id": 2434,
			"surah": 20,
			"ayat": 86,
			"tafsir": "Hearing the word of his Lord explaining that his people had been led astray by Samiri, he quickly returned to his people in a state of great annoyance and anger. He found his people kneeling in front of a golden image of a calf, worshiping and worshiping it. They said among themselves, \"This is our god and also the god of Moses. In fact, Moses had forgotten so he went to meet his Lord to the top of the hill, even though his Lord was here.\" It cannot be described how sad Musa's heart was when his people saw that his people could easily be led astray by Samiri and how great the anger in his heart was when he saw the atmosphere and condition of his people. According to one report, after seeing his people worshiping idols, he then heard the noise and various shouts of his people and saw them dancing around the statue. Qurtubi narrated that Abu Bakr ath-Turthusy was once asked by people about a group of people chanting the name of Allah and chanting the name of the Prophet Muhammad by dancing and beating drums and because of the fun some of them fainted, then they took the food they brought and have been prepared, what is the law of their deeds? Is this permissible in Islam or not? ath-Turthusy replied, \"The Sufi School, which is like that is vanity, an ignorance and misguidance. Islam is the (teachings) of the book of Allah and the Sunnah of His Messenger. As for beating the drum (and dancing) until it is like a person who is possessed at first it was Samiri when he made a statue of a calf to be worshiped by the people of Moses by dancing around it. So such an act is the act of unbelievers and calf worshippers.\" Then Moses said to his people, \"Why do you worship the statue when Allah has promised you good and profitable promises after giving you various favors such as freeing you from Pharaoh's people placing you in this place, giving you delicious and nutritious food. Allah promises will send down the Bible to you, in which there are laws and regulations for your good and happiness in this world and in the hereafter. He will also promise you a lot of rewards if you remain faithful and do good deeds and also promises that you will enter the holy land of Palestine by defeating its inhabitants who are strong and mighty. Why are you so quick to turn away from the religion of Allah when not long ago the promise was announced by Allah to you, and the signs of that promise will surely come true and be fulfilled as you see and experience yourself? thought that you had been waiting a long time u the fulfillment of the promise or are you deliberately waiting for Allah's wrath upon you by this deed. Haven't you promised me that you will remain faithful until I return to you, and will not concoct anything that undermines your belief or contradicts it.\""
		   },
		   {
			"id": 2435,
			"surah": 20,
			"ayat": 87,
			"tafsir": "His people replied, \"We broke the promise not with our will and will, because we cannot control ourselves. If we were left to our own will, of course we would not do this. But Samiri has tricked us fools so that we are attracted by his words and persuasion that charmed our hearts. Samiri had forced us to carry a heavy burden consisting of jewels he lent from the Egyptians when we were about to leave Egypt. He said that a feast would be held later, because of the jewels the jewelery had to be brought and we were ordered to carry it. This was hidden from you, O Musa because he was afraid that he would be forbidden to carry it. After you died he told us to dig a big hole in the ground and light a fire to burn the jewelery, so we threw all the jewelery that we brought .\""
		   },
		   {
			"id": 2436,
			"surah": 20,
			"ayat": 88,
			"tafsir": "Then Samiri took out from the hole a gold nugget in the shape of a calf and made a sound like a cow's croak. Indeed Samiri is an expert; and he was able to make a pipe in the image so that when the wind blew a calf would sound. Samiri told us that this is the god who is actually the god of all of us and also the god of Moses, he is the one we will worship and worship, it is him we ask for something when we want or need it. Samiri also said that you, O Musa, went up to the mountain to meet God even though the god that Moses was going to meet was here. Indeed, Moses was so forgetful that he struggled to find something far away, even though what he was looking for was right here."
		   },
		   {
			"id": 2437,
			"surah": 20,
			"ayat": 89,
			"tafsir": "In this verse Allah explains how stupid the people of Moses were because they could not consider something carefully whether it was bad or good, acceptable to reason or something impossible. Do they not notice that the statue is an inanimate object that can't speak and can't answer questions, let alone provide help or ward off a danger. Meanwhile, a cow that is actually animate, moves by itself, can gore and kick, can lift goods or pull a cart."
		   },
		   {
			"id": 2438,
			"surah": 20,
			"ayat": 90,
			"tafsir": "Harun once gave advice and warned them when he saw his people turning away from worshiping Allah to worshiping idols and holding worship ceremonies that were contrary to the monotheism they had adhered to so far and promised Musa that they would continue to worship Allah until he returned to them from top of the Tour hill. Harun said to them, \"O my people, you have actually been tested by the statue of the calf, do you really believe and hold fast to your religion, so that nothing can be doubted by any persuasion, or is your faith only in words so that when there is something that attracts your attention or deceives you, then you leave your true religion and belief. Your God is actually God the Most Compassionate, the Most Creator, Who created all things Who proves His mercy and compassion can be seen in the universe and can be seen felt by His creatures. He has bestowed upon you physical and spiritual perfection and given you laws and regulations that guarantee your safety and happiness in this world and the hereafter. He has bestowed upon you the favor of faith and freed you from the cruelty and ferocity of Pharaoh. can be tricked and tricked by Samiri with the ema statue s in the form of a calf making sounds like a real calf? You have really deviated from the right path and have broken your promise with my brother Moses when he was going up the hill to receive the Torah scrolls as a guide from your Lord. Leave worshiping statues that cannot benefit and reject harm and return to the religion of monotheism and repent, Allah will accept your repentance and forgive your mistakes because He is Most Forgiving and Most Merciful. Follow my advice and my call so that you become servants of Allah whom He pleases."
		   },
		   {
			"id": 2439,
			"surah": 20,
			"ayat": 91,
			"tafsir": "All of Harun's advice, even though it was stated in a gentle manner and with proof and reasons that could be accepted by reason, did not get a good reception among them. They were more interested in Samiri's persuasion and deception, they said to Aaron, \"We will continue to worship that statue until Musa returns to us and he will decide whether we are in error and deviation or whether the statue we worship is just Samiri's deception."
		   },
		   {
			"id": 2440,
			"surah": 20,
			"ayat": 92,
			"tafsir": "Musa was very sorry for Aaron's attitude that did not act decisively against the abuses of his people. Why does he only admonish and advise his people, even though worshiping statues is shirk that cannot be forgiven, and cannot be tolerated no matter what the reasons put forward by his people. Why didn't he follow Moses with the believers to tell him about it and take a firm stand against disobedient people. If Aaron had taken such an action, his heathen people would have been afraid and would probably have abandoned worshiping the image for fear of losing their beloved leader."
		   },
		   {
			"id": 2441,
			"surah": 20,
			"ayat": 93,
			"tafsir": "Musa again snapped at Aaron with rather harsh words, \"Have you disobeyed and disobeyed my orders. I have instructed you that you take my place after me, act and prevent following the path of those who want to cause damage.\" The author of Al-Kasysyaf's commentary explains this as follows, \"Moses was a tough person and sometimes acted harshly on matters related to the rights of Allah and religion. Because of that he could not control himself when he saw that his people had deviated from the monotheistic religion so he threw the Torah sheets he was carrying because he was shocked and amazed at the abuses of his people. He yelled at and rebuked his brother Aaron while pulling his hair and beard as if his brother was his enemy not his brother and servant.\""
		   },
		   {
			"id": 2442,
			"surah": 20,
			"ayat": 94,
			"tafsir": "This verse explains that Aaron, a man of calm and gentle character, did not reply to his brother's harsh and harsh words either harshly or harshly, but calmly spoke to Moses. \"O son of my mother, don't tug at my beard and hair. Indeed, I did not take firm action as you wish, because if I did so, they would certainly be divided into two groups. The believer group and the disobedient group, enmity ensued and maybe a war between the two groups. If this happened, of course you would blame me too by accusing me of dividing the Children of Israel. Therefore we took a cautious stance while waiting for your return from the hill.\""
		   },
		   {
			"id": 2443,
			"surah": 20,
			"ayat": 95,
			"tafsir": "In this verse Allah explains that Musa rebuked Samiri with the question, \"Why did you do such a disgraceful and disgraceful act of Allah that some of the Children of Israel became disbelievers after believing and worshiping idols that you deliberately made for them, you have damaged the true faith of my people and have led them astray. Do you know what the consequences of your very wrongdoing were?\""
		   },
		   {
			"id": 2444,
			"surah": 20,
			"ayat": 96,
			"tafsir": "Samiri answered Musa's shouts and rebukes. I already know something that is not known by your people, so I made a statue of gold brought from Egypt in the shape of a calf and I made the statue as beautiful as possible to attract their attention. Such is my opinion and that is the best course of action in my opinion. According to some of the Mufasirin, Samiri answered Musa's shouts with strange answers that left the impression as if he had also received a revelation from God and had been in contact with Gabriel and had known him. Samiri said that he burned the gold they brought from Egypt in a hole that they made themselves. He took a handful of soil where Gabriel's footprints were, and something like a calf came out of the hole. In this way, some of the Children of Israel were attracted to Samiri's persuasion and deceit to worship the calf-shaped statue. Because the calf statue is not just any statue, but really has been sent by God to be worshiped and adored."
		   },
		   {
			"id": 2445,
			"surah": 20,
			"ayat": 97,
			"tafsir": "Musa said to Samiri, go away from here, you have no right to associate with anyone and no one is allowed to associate with you. If someone asks you about your case, you must answer \"I am not allowed to approach someone and no one is allowed to approach me.\" This is the act of Moses who is very hard and firm against him. Where Samiri will go, there will be no place to live because around that place there is only a very wide and barren desert, not a single piece of land in the Sahara desert that can be inhabited by humans. Meanwhile wild and savage animals will find it difficult and will suffer living in that endless desert. It is narrated that Samiri after being expelled by Musa, he left that place without knowing what direction and purpose he was going to achieve. He traveled in the vast Sahara desert and encountered nothing but wild and wild animals. So it is evident what Musa said to him when he met someone asking if he should answer \"La misasa\". Even though he never said the word \"La misasa\" but in practice his experience of adventuring in the desert was as if he himself had shouted the word so that no one dared to get close to him. Then Musa said parting words to him that he would meet a day that could not be avoided, namely the Day of Judgment, the day of retribution where he would receive a reward for his deeds commensurahte with the magnitude of the sins he had committed. Then Musa ordered Samiri to turn to the god he made and worshiped and said, \"I will destroy this statue to dust and I will spread the dust into the sea so that it disappears without a trace.\""
		   },
		   {
			"id": 2446,
			"surah": 20,
			"ayat": 98,
			"tafsir": "In this verse, Moses says that the statue is not a god, their God is God Almighty. There is no god but Allah. He is the one who deserves to be worshiped and glorified, only to Him are all prayers and supplications offered, all creatures wish to Him because He is the Creator and Almighty. His knowledge is very broad, without limit covering everything, nothing escapes his knowledge, neither on earth, nor in the heavens nor in between, according to His word: Nothing is hidden from Him, even if it is as heavy as a particle, both in the heavens and in the sky. earth, which is smaller than that or larger, all (written) in a clear Book (Lauh Mahfudz),\" (Saba'\/34: 3)"
		   },
		   {
			"id": 2447,
			"surah": 20,
			"ayat": 99,
			"tafsir": "In this verse, Allah explains to the Prophet Muhammad that the stories reported in the past verses, such as the story of Musa with Pharaoh and Samiri, as well as the stories of previous prophets, should serve as examples for him in dealing with his people who were very disobedient and disobedient. . Because that was indeed the situation of every apostle, even though books and miracles had been sent down to him to declare the truth of his preaching, his people still denied and tried their best to oppose his call and remained hostile and even wanted to kill him to eliminate him so that the voice of the truth he conveyed was no longer heard. As Allah sent down the Book of Zabur to the Prophet David as, Torah to Prophet Musa as and the Gospel to Prophet Isa as, Allah has sent down the Al-Qur'an to Muhammad, a Book that they deserve well because the teachings contained in it are for their benefit and happiness in this world and in the hereafter. Al-Qur'an is a complete holy book containing various guidelines regarding laws, social relations, economics, morals and so on. Besides that the Qur'an is the greatest miracle for the Prophet. No one can match the beauty of his language and the height of his literature. Therefore, let the Prophet be patient and never give up or be sad, keep fighting until victory is achieved and all evil disappears from the face of the earth, there is nothing worthy of worship except Allah, the One and the Almighty."
		   },
		   {
			"id": 2448,
			"surah": 20,
			"ayat": 100,
			"tafsir": "Whoever turns away from the teachings of the Qur'an even though it is clear to him that it is a revelation from Allah and that its truth cannot be denied, his rejection of this teaching is solely due to indulging his passions, or because he is afraid of losing influence, position and so on. It's normal for people like that to be considered as stubborn people, people who go astray and don't want to accept the truth, then Allah will not forgive them and on the Day of Judgment he will bear the sins of his denial and arrogance, the biggest and most serious sins. heavy and barely able to bear it. He will be thrown into Hellfire, he will remain there forever, and a very painful punishment will be inflicted on him according to his denial and iniquity. The sins he carried were very heavy and the torments he received were very painful."
		   },
		   {
			"id": 2449,
			"surah": 20,
			"ayat": 101,
			"tafsir": "Whoever turns away from the teachings of the Qur'an even though it is clear to him that it is a revelation from Allah and that its truth cannot be denied, his rejection of this teaching is solely due to indulging his passions, or because he is afraid of losing influence, position and so on. It's normal for people like that to be considered as stubborn people, people who go astray and don't want to accept the truth, then Allah will not forgive them and on the Day of Judgment he will bear the sins of his denial and arrogance, the biggest and most serious sins. heavy and barely able to bear it. He will be thrown into Hellfire, he will remain there forever, and a very painful punishment will be inflicted on him according to his denial and iniquity. The sins he carried were very heavy and the torments he received were very painful."
		   },
		   {
			"id": 2450,
			"surah": 20,
			"ayat": 102,
			"tafsir": "This will happen on the Day of Judgment, namely at the time of the second trumpet blowing as a sign for all humans to gather in Padang Mahsyar to receive an account of their deeds and efforts while he is still in the world. Good deeds will be rewarded with multiple rewards and bad deeds will be rewarded with appropriate retribution. On that day God gathered the sinners while their faces were pale and blue in color, because of the severity of the suffering they felt and the greatness and enormity of the atmosphere at that time, especially after thinking about the bad luck that had befallen them, why did they not want to accept the truth before? and still indulge the lust and will of satan."
		   },
		   {
			"id": 2451,
			"surah": 20,
			"ayat": 103,
			"tafsir": "They whispered to each other and asked each other in a barely audible voice because they were so afraid and worried. \"We have only lived in this world for ten days? Why have we been gathered in this Mahsyar field when we haven't had the slightest opportunity to do good deeds and get ready to face this day?\" It is true that every person who has been hit by a severe calamity, imagines in his mind the twists and turns of his past life, everything has passed very quickly, as if the life he had enjoyed for decades happened in just a few moments."
		   },
		   {
			"id": 2452,
			"surah": 20,
			"ayat": 104,
			"tafsir": "In this verse Allah confirms that He knows everything they are discussing in whispers, when one of the most intelligent among them says that they live on earth only one day. Maybe it means just one day so that they will be released from the torment of their iniquity and from the retribution for their deeds because they only stay in this world for a short time, they are not given a longer chance to repent and do good deeds. But there is no point in talking about that anymore, because in fact they have been given a very wide opportunity during their life on earth to return to the truth, but they have not used this opportunity at all. In another verse Allah explains their condition, namely: And on the day (when) the Doomsday occurs, those who sin swear that they dwell (in their graves) only for a moment (only). (ar-Rum\/30: 55) And His words: And (remember) on the day (when) Allah gathered them, (they felt) as if they had never lived (in the world) except for a moment during the day, (on time) they got to know each other. It is a loss for those who deny their meeting with Allah and they are not guided. (Yunus\/10: 45)"
		   },
		   {
			"id": 2453,
			"surah": 20,
			"ayat": 105,
			"tafsir": "In this verse, Allah explains in response to the question of the polytheists to Muhammad that the mountains on the Day of Judgment are crushed to pieces so that they fly in the air, like dust carried by the wind everywhere so that there is no trace at all. With the discovery of the atomic bomb in the twentieth century, one can imagine how great and terrible the destruction and desolation will be on the Day of Judgment. While the atomic bomb that was dropped on Hiroshima and Nagasaki is still considered to have a small explosive power compared to the explosive power of a nuclear bomb now, the devastation that has arisen is so great, moreover the destruction that arises on the Day of Judgment is of course thousands of times greater and enormous than the devastation caused. the atomic bombs on Hiroshima and Nagasaki. In another verse Allah also explains how the condition of the mountains on the Day of Judgment is His word: And (remember) on the day (when) the trumpet is blown, then what is in the heavens and what is on the earth will be surprised, except who Allah wills . And all of them came before Him humbled themselves. And you will see the mountains, which you think are still in place, but they walk (like) the clouds walk. (That is) the creation of Allah who created everything perfectly. Indeed, He is All-Seer of what you do. (an-Naml\/27: 87 and 88)"
		   },
		   {
			"id": 2454,
			"surah": 20,
			"ayat": 106,
			"tafsir": "After the mountains were crushed and blown everywhere by the wind, the place where the mountains stood became level and the face of the earth was changed, which was once beautiful to the eye, because there are valleys and hills, there are plateaus, there are shady trees and the green plants, all that is gone, all have returned to the mortal realm. On that day, all humans panic, running here and there to save themselves, having no sense of direction and purpose, as stated in His words: On that day, humans will be like flies flying around, and the mountains will be like feathers that will be scattered. (al-Qari'ah\/101: 4 and 5) Man wonders what has happened to the earth as mentioned in His word: And man asks, \"What happened to this earth?\" On that day the earth will deliver its message, for verily your Lord has commanded (such) upon it. (az-Zalzalah\/99: 3-4 and 5)"
		   },
		   {
			"id": 2455,
			"surah": 20,
			"ayat": 107,
			"tafsir": "After the mountains were crushed and blown everywhere by the wind, the place where the mountains stood became level and the face of the earth was changed, which was once beautiful to the eye, because there are valleys and hills, there are plateaus, there are shady trees and the green plants, all that is gone, all have returned to the mortal realm. On that day, all humans panic, running here and there to save themselves, having no sense of direction and purpose, as stated in His words: On that day, humans will be like flies flying around, and the mountains will be like feathers that will be scattered. (al-Qari'ah\/101: 4 and 5) Man wonders what has happened to the earth as mentioned in His word: And man asks, \"What happened to this earth?\" On that day the earth will deliver its message, for verily your Lord has commanded (such) upon it. (az-Zalzalah\/99: 3-4 and 5)"
		   },
		   {
			"id": 2456,
			"surah": 20,
			"ayat": 108,
			"tafsir": "In an atmosphere of commotion and in a state of panic, they heard the voice of a caller, namely an angel who caught their attention entirely and without realizing it they submitted and obediently followed the order of the caller without thinking about the consequences of that order as stated in the word of Allah: By obeying them immediately come to the caller. The disbelievers said, \"This is a difficult day.\" (al-Qamar\/54: 8) They are all called upon to appear before the presence of Allah, the Almighty and the Almighty, to receive an account of their deeds while living in this world. No one can avoid or free themselves from that calculation. At that time all creatures were silent, no sound was heard except for the whispers that occurred among themselves. No one dared to raise their voice because of the great atmosphere at that time, the atmosphere of facing God's presence to receive reckoning. Whoever believes and has good deeds, will certainly receive a double reward and will be admitted to heaven and whoever disbelieves and has many sins will receive a suitable reward and will be thrown into hell."
		   },
		   {
			"id": 2457,
			"surah": 20,
			"ayat": 109,
			"tafsir": "On that day, no one can help a person or give intercession to him either from angels or from humans except those who have been given permission by Allah that he will give intercession which is also acceptable to Allah according to the verse: And how many angels are in the sky , their intercession (help) is of no use unless Allah has permitted (and only) for whom He wills and is pleased with. (an-Najm\/53: 26) Angels who are not sinful are not accepted for their intercession to help someone at that time unless Allah's permission let alone demons, idols or other polytheistic leaders, of course they cannot help in the least his followers. Meanwhile, to help themselves they are helpless, let alone to help others."
		   },
		   {
			"id": 2458,
			"surah": 20,
			"ayat": 110,
			"tafsir": "In this verse, Allah explains the reasons why intercession is useless without His permission. These reasons are because Allah knows all human actions, faith and unbelief, nothing is hidden from Him. He is actually the one who can determine whether a person is entitled to intercession, because of his faith and deeds while living in the world and He is also the one who has the right and can determine that a person cannot be interceded because of kufr and sins that cannot be forgiven. Meanwhile, angels or humans, even though they have been permitted by Him to intercede, do not know this in detail."
		   },
		   {
			"id": 2459,
			"surah": 20,
			"ayat": 111,
			"tafsir": "At that time, all faces bowed down feeling humble before Allah Almighty and Almighty Who will give the final decision regarding the fate of each of them according to their faith and deeds, a decision from the Most Just that cannot be disputed and must be implemented. At that time it was regretful for people who denied and sinned why in the past they followed the will of Satan and lust, cared for the world without the slightest thought that they would meet the day of reckoning, insulted and made fun of the calls of the prophets and apostles for their happiness in the world and the hereafter."
		   },
		   {
			"id": 2460,
			"surah": 20,
			"ayat": 112,
			"tafsir": "Those who believe and do good deeds in preparation for this day of reckoning, they feel happy and grateful and imagine in their minds the reward that Allah will bestow upon them according to His promise, according to His justice and mercy. They are fully confident that they will not be wronged, will not be harmed in the slightest, they will be entered into Jannatun Na'im heaven in which there is endless pleasure and pleasure."
		   },
		   {
			"id": 2461,
			"surah": 20,
			"ayat": 113,
			"tafsir": "This verse explains that Allah sent down the Qur'an in Arabic so that it is easily understood by the polytheists of Mecca and so that they are interested in paying attention to its contents and the teachings contained therein. Thus they are expected to return to the truth and leave misleading beliefs such as worshiping misleading beliefs such as worshiping idols and can live peacefully and happily by carrying out the regulations contained in them because all the commands and prohibitions in them are merely -eyes for the good and happiness of humans in this world and in the hereafter. In the Qur'an, several warnings and threats are also given to disobedient people who do not want to pay attention to the calls of the prophets and messengers, and even reject them, because they are contrary to their desires, like the stories of earlier peoples. who have been destroyed because of their iniquities and information regarding the fate of disbelievers and sinners in the hereafter. In order to return the Arabs who are so hard-hearted and deep in shirk and their beliefs to the truth, it is not enough just to preach and explain, but this preaching and information must also be accompanied by warnings and threats. This does not only apply to the polytheists of Mecca but also applies to all humans. If da'wah and explanations are also not useful, then the time has come to give a warning by explaining historical facts and examples of past ummah, calamities and calamities that occurred in society due to moral decay and destruction of the norms of justice and truth. In this way, it is hoped that humans will become aware and converted, become people who fear God, acknowledge His greatness and power, and submit to the rules He made for the benefit of mankind."
		   },
		   {
			"id": 2462,
			"surah": 20,
			"ayat": 114,
			"tafsir": "It is narrated that the Prophet Muhammad saw when Jibril recited to him some of the verses that were revealed, he quickly re-read them even though Jibril had not finished reading all the verses that were to be conveyed to the Prophet. This was because the Prophet was afraid that if he did not quickly repeat it, he might forget and not be able to recall. Therefore Allah forbade him to act like that, because such an action might mess up his memorization even more because when he repeated reading what had been read to him his attention was focused on repeating the reading not on the next verses to be recited by Jibril even though Allah guaranteed that he would preserve Al-Qur'an as well as possible, so it is impossible for the Prophet Muhammad to forget or to be made by Allah to forget that he first listened carefully to all the verses that Jibril recited, then when Jibril finished reading them all, then the Prophet read them again. This verse emphasizes that Allah is the Most High, the Most Great, the Most Vast in Knowledge, with whose knowledge He regulates everything and makes rules according to the interests of His creatures, including regulations for the safety and happiness of mankind. It was he who sent the prophets and apostles and revealed holy books such as the Psalms, the Torah and the Bible and it was he who revealed the Qur'an to the Prophet Muhammad. The Qur'an was revealed to the Prophet Muhammad gradually not all at once in accordance with His wisdom. Sometimes only a few short verses or short surahhs were revealed and sometimes long verses were revealed according to the needs and needs of that time. Regarding this Allah said: Do not you (Muhammad) move your tongue (to read the Qur'an) because you want to quickly (master) it. Indeed, We will collect it (in your bosom) and recite it. When We have finished reading it, then follow the reading. Then surely We will explain it. (al-Qiyamah\/75: 16-19) Regarding Allah's guarantee and the preservation of the Qur'an, it is stated in the verse: Indeed, it is We who sent down the Qur'an, and surely We (also) maintain it. (al-hijr\/15: 9) Then Allah told the Prophet Muhammad to pray that He would give him additional knowledge. It was narrated by at-Tirmizi from Abu Hurairah that the Messenger of Allah prayed as follows: O Allah. Make the knowledge that You taught me useful for me, teach me the knowledge that is useful for me and give me additional knowledge. Praise be to Allah for everything, I seek refuge in Allah from the circumstances and everything that is done by the inhabitants of hell. (at-Tirmidhi, Ibn Majah and al-Bazzar)"
		   },
		   {
			"id": 2463,
			"surah": 20,
			"ayat": 115,
			"tafsir": "In this verse Allah has explained that He has instructed Adam to always be vigilant against Satan who is his enemy and the enemy of his wife Eve. Indeed, Satan has deceived him with his persuasion and told him that the khuldi (immortality) tree is the best tree, whoever eats from its fruit will surely remain in heaven forever. Because of his very desire that he will remain in heaven to enjoy God's unending gifts, Adam forgot about God's mandate and His prohibition not to eat this holy fruit. Adam forgot that Satan was his enemy who wanted to plunge him into the abyss of sin. Adam forgot that God forbade him to eat the forbidden fruit so he ate it. Here it appears that Adam, who already had knowledge of the Devil's bad intentions, could still be deceived by attractive promises made by the Devil to him, let alone an ordinary human being. no matter what, he must always remember and be vigilant and desperately defend his convictions and beliefs so that he cannot be tempted by Satan."
		   },
		   {
			"id": 2464,
			"surah": 20,
			"ayat": 116,
			"tafsir": "As a detailed explanation of how Adam was tricked by Satan into eating a fruit he was forbidden to eat. Allah explained the story from the beginning when He ordered the angels to bow down to Adam. Obediently and submissively, the angels prostrate to Him without arguing, without jealousy in their hearts, without feeling arrogant and arrogant, and not being the least bit reluctant to carry out their Lord's commands. Unlike the devil who is arrogant and arrogant, he is reluctant and does not want to bow down to Adam because he considers himself higher and more noble than Adam. Why should he bow down to Adam when Adam should be the one who bowed down to him. This is stated in the word of God: Then the angels all prostrated themselves. Except for the Devil; he is arrogant and he is among those who disbelieve. (Allah) said, \"O Satan, what prevents you from bowing down to what I have created with My power. Are you arrogant or do you (feel) among the (more) high class?\" (Satan) said, \"I am better than him, because You created me from fire, while You created him from clay.\" (shad\/38: 73-76)"
		   },
		   {
			"id": 2465,
			"surah": 20,
			"ayat": 117,
			"tafsir": "Because Satan did not want to bow down to Adam because of his pride and jealousy of the glory and honor given to Adam. God confirmed to him that Satan was his enemy and his wife's enemy. Therefore he must be careful and aware of his behavior, never follow his flattery which may be in the form of advice or suggestions. There is no purpose except to inflict calamity or calamity on him. If he is deceived by his sweet mouth which if he follows it may cause Adam to be banished from heaven which is full of His grace and gifts. If this happened, of course the Devil would laugh happily while Adam would suffer a hard life on earth, where he had to fight and work hard for his survival while in heaven he lived a full life without lacking anything, all his wishes were easily achieved and done."
		   },
		   {
			"id": 2466,
			"surah": 20,
			"ayat": 118,
			"tafsir": "God promised Adam that while in heaven he would not feel hungry or thirsty because a variety of delicious foods, various drinks and fruits were always provided for him. He will never feel thirsty because a variety of delicious drinks are also provided for him and he will not be exposed to the hot sun because he is always in the shade with a cool breeze blowing. She will not be naked because Allah has given her very good and beautiful clothes. All that is liked and liked can be enjoyed in heaven as in His words: We are your protectors in the life of this world and the hereafter; in it (heaven) you get what you want and get what you ask for. As a tribute (to you) from (Allah) the Most Forgiving, the Most Merciful. (Fushshilat\/41: 31-32) And His words: And in heaven there is what the heart desires and all that is pleasing to the eye. (az-Zukhruf\/43: 71)"
		   },
		   {
			"id": 2467,
			"surah": 20,
			"ayat": 119,
			"tafsir": "After Satan saw how happy Adam and his wife were in heaven enjoying various kinds of Divine grace, jealousy and envy arose in his heart and he really wanted the favors and gifts bestowed by Allah to be immediately removed from both of them. He saw that there was no more appropriate and powerful way to make that wish come true than to tempt the two of them to eat the forbidden fruit of khuldi. Thus surely Allah will be angry with Adam and expel him from heaven for disobeying His commands. Then the devil came to Adam pretending to be a loyal friend who always prioritized his goodness and happiness, and told him that the khuldi tree was a special tree, its fruit was very delicious, there are no fruits in heaven that are more delicious than khuldi . Whoever eats it will surely live forever and live in heaven forever. If Adam wanted to remain forever in this paradise then he must eat the fruit, surely he will live forever in a paradise that will not collapse forever."
		   },
		   {
			"id": 2468,
			"surah": 20,
			"ayat": 120,
			"tafsir": "This verse describes the condition of Adam and his wife Eve, when the Devil seduced them, without remembering God's mandate that the Devil was an enemy who wanted to harm him and Allah prohibited him from eating the forbidden fruit, Adam and Eve picked the fruit and immediately ate it with full hope that he would be with them. his wife will live eternally in heaven. Not long after Adam and Eve ate the forbidden fruit, their private parts were exposed, even though before eating the forbidden fruit, they did not pay the slightest attention to it, then they felt ashamed and quickly picked leaves in paradise to cover them. Some commentators argue that as a result of eating the fruit of khuldi, sexual urges (instincts) arose in Adam and Eve, because of that they felt ashamed to see each other's private parts. Thus, because he was driven by a very strong desire, Adam forgot about God's message until he disobeyed His commandment. He failed to face the test of his God, became weak in determination and will because of the temptations of Satan and because of the temptations of his own lust and desires so that he fell into the abyss of transgression."
		   },
		   {
			"id": 2469,
			"surah": 20,
			"ayat": 121,
			"tafsir": "After realizing that he and his wife had disobeyed God's commandment by eating the forbidden fruit, he regretted his delay, felt disappointed because he justified Satan's enticements and was deceived by the sweet words of his enemy. He was very worried about his fate with his wife because he had disobeyed his Lord. He felt sinful and asked forgiveness for his mistakes as mentioned in the verse: Both said, \"O our Lord, we have wronged ourselves. If You do not forgive us and give mercy to us, surely we will be among the losers.\" (al-A'raf\/7: 23)"
		   },
		   {
			"id": 2470,
			"surah": 20,
			"ayat": 122,
			"tafsir": "God is Most Gracious, Most Merciful to His servants, especially to those who are appointed as caliphs on earth, therefore Allah will not repay Adam for eating the forbidden fruit by inflicting torture on him, in a state of forgetfulness so that he is deceived by the entreaties of his enemies, even though Adam had violated the prohibition of God who had ordered him not to be deceived by his enemy Satan, so that Adam was expelled from heaven. Adam and his wife were very sorry for what they had done and had repented and asked Him for forgiveness. Therefore Allah forgave his sins and chose him to be someone close to him. As a result of disobeying God's command, Adam was ordered out of heaven and down to earth, thus Allah's decree that Adam would be made the Caliph on earth was carried out, as stated in His words: \"I want to make the caliph on earth.\" (al-Baqarah\/2: 30)"
		   },
		   {
			"id": 2471,
			"surah": 20,
			"ayat": 123,
			"tafsir": "Not only did Adam have to come down to earth but the enemy Satan who deceived him also had to come down to earth. These two types of creatures will be enemies for each other, the enmity of Satan towards humans is an eternal and continuous enmity until the Day of Judgment comes. The devil will always try to mislead people from the right path with all kinds of tricks. Therefore, God reminds Adam's children and grandchildren to always be aware of their main enemy. If instructions have come from God through His prophets and apostles, then humans should follow the instructions as taught by the apostles. Thus he will not go astray and will not be harmed. Ibn Abbas said regarding this verse that Allah protects those who follow the teachings of the Qur'an from going astray in this world and from accidents and calamities in the hereafter. From Ibn Abbas ra, Rasulullah said, \"Who follows the book of Allah, Allah will guide him to avoid going astray in the world and keep him from the bad reckoning on the Day of Resurrection.\" (History of Ibn Abi Syaibah and ath-thabrani)"
		   },
		   {
			"id": 2472,
			"surah": 20,
			"ayat": 124,
			"tafsir": "Allah explains that those who turn away from the teachings of the Qur'an do not heed them and oppose the instructions contained therein, as punishment they will always live in narrowness and difficulty. He will always be confused and anxious even though he has wealth, rank and position because he is always disturbed by thoughts and fantasies that are not true about his wealth and position. He will always be haunted by the specter of losing the pleasures he has achieved, so he commits acts that generate hatred and harm in his society. Then in the afterlife he will be gathered by Allah with other human beings in a state of blindness in his heart. Just as in this world he always rejects Allah's bright instructions and narrows his eyes so that these instructions are not seen by him so that he goes astray, so in the hereafter he cannot see any reason to defend himself against Allah's decree, the Most Just. Some commentators say that a person who turns away from Allah's teachings becomes blind to the five senses and does not see anything as an additional torment for him. A person who is blind at the time of commotion and catastrophe will be more confused because he does not know what to do and is unsure of the direction to go to save himself because he does not see where the threatening danger is coming from. But after that his eyes will brighten again because he saw his own charity record book and how great and terrible the torments of hell are as mentioned in the verse: And those who sinned saw hell, then they thought, that they would fall into it, and they could not find a place to turn from him. (al-Kahf\/18: 53)"
		   },
		   {
			"id": 2473,
			"surah": 20,
			"ayat": 125,
			"tafsir": "Those who disbelieve will ask God why you made me blind when my eyes were clear before. God answered, that it was so! Because in the world when the apostles came to him with His instructions he turned away from him as if his eyes had been blinded and as if he had forgotten him because he did not heed and pay attention to him. Therefore Allah makes the eyes of his heart blind on the Day of Judgment so that you cannot put forward an excuse to defend yourself from the punishment that has been prepared for him in return for their blindness while in the world."
		   },
		   {
			"id": 2474,
			"surah": 20,
			"ayat": 126,
			"tafsir": "Those who disbelieve will ask God why you made me blind when my eyes were clear before. God answered, that it was so! Because in the world when the apostles came to him with His instructions he turned away from him as if his eyes had been blinded and as if he had forgotten him because he did not heed and pay attention to him. Therefore Allah makes the eyes of his heart blind on the Day of Judgment so that you cannot put forward an excuse to defend yourself from the punishment that has been prepared for him in return for their blindness while in the world."
		   },
		   {
			"id": 2475,
			"surah": 20,
			"ayat": 127,
			"tafsir": "Thus Allah repays those who transgress and do not believe in the proofs of His power. In the world he encounters various difficulties, is always indecisive and restless, because there is nothing to hold on to in his life except wealth, rank and position. If he is struck by a difficulty or distress, he immediately panics and does not know what he is going to do, and sometimes without realizing it he does something that is detrimental to himself. He never felt peace and equanimity. This means he never felt true happiness. In the afterlife he will be tortured with various torments including heart torment because the eyes of his heart have become blind cannot provide reasons or proofs to free himself from Allah's punishment or he is indeed made completely blind so that he will be tormented even more because he is completely helpless to overcome the atmosphere of chaos and awesomeness. Indeed, the punishment in the hereafter is much more severe and terrible, especially the punishment in hell which is eternal forever."
		   },
		   {
			"id": 2476,
			"surah": 20,
			"ayat": 128,
			"tafsir": "In these verses, Allah calls the attention of the disbelievers so that they think calmly about how the past peoples ended, they were destroyed by Allah because of their disbelief by sending down various kinds of calamities, some in the form of hurricanes, terrible earthquakes and there were also in the form of a loud thundering sound. They could see with their own eyes the marks left by those people who had perished. The remains show that they were strong and victorious people in their time, had large and sturdy buildings, had a high culture, more than what the Meccan infidels had. But because of their disobedience and disobedience, they were destroyed by Allah in the twinkling of an eye, no one survived this catastrophe. What can be seen now are the ruins of the former palaces and their fortifications. The polytheists of Mecca on their trade trips in the summer and in the winter through the former kingdoms that had collapsed, but they never thought about why the kingdoms were destroyed and destroyed, and considered this to be the result of natural disasters. They should be able to take lessons from the previous peoples and realize that no matter how strong and mighty a people are, if Allah wills their destruction, because of rebellion and disbelief no one can defend or defend them. Why doesn't this all concern them. In fact, if they want to think, there are many lessons and proofs of God's power in those people who have been destroyed, but strangely they don't heed it."
		   },
		   {
			"id": 2477,
			"surah": 20,
			"ayat": 129,
			"tafsir": "Had it not been for Allah's mercy and compassion or for His decree that the rebellious Ummah of Muhammad would not be destroyed like those former nations, and the retribution for their disbelief was postponed until the Day of Judgment, they would surely have suffered destruction as well. This is stated in His word: In fact, the Day of Judgment is the day promised to them and the Day of Judgment is more terrible and more bitter. (al-Qamar\/54: 46) Scholars say that the wisdom in suspending the torment of the ungodly followers of Muhammad until the Day of Judgment is to give them an opportunity to repent or to be among their descendants who believe. It is an honor and glory for the Prophet Muhammad and Allah's mercy and compassion for his people, thus the followers of his teachings will increase in number. This is in accordance with his expectations as mentioned in his words narrated by al-Bukhari and Muslim from Abi Hurairah: What was given to me was revelation revealed to me by Allah. So I hope that I will be the Prophet with the most followers among the Prophets. (History of ash-Shaikhan)"
		   },
		   {
			"id": 2478,
			"surah": 20,
			"ayat": 130,
			"tafsir": "Then Allah ordered the Prophet Muhammad peace be upon him to remain patient with the actions of his disbelieving people and their ridicule and contempt for him such as accusing him of being a sorcerer, a madman, a poet and so on. In addition, he should always remember and purify God by glorifying and praying before sunrise, before sunset and at midnight. Indeed, by remembering Allah and by praying one can free himself from the confusion of thoughts, sadness and indecision. Prophet Muhammad himself once said about the benefits of prayer to reassure his heart. And make my heart calm when praying. (Ahmad and an-Nasai's history from al-Mugirah) In another verse, Allah commands that to deal with a complicated problem, we should be patient and establish prayer. And ask for help (of Allah) with patience and prayer. And (prayer) is really heavy, except for those who are solemn. (al-Baqarah\/2: 45) In a hadith narrated by Ibn Jarir, the Messenger of Allah said: The Messenger of Allah said: \"Surely you will see your Lord as you see this month, you are not hindered when you see Him. If you If you can try so that you don't miss your prayers before the sun rises and before it sets, then do it.\" (History of al-Bukhari and Muslim) Then the Prophet recited this verse 130. Narrated from Abu Hurairah. The Prophet Muhammad said, \"Allah said, O son of Adam, use your time to worship Me, then I will fill your chest with wealth (inner) and remove your poverty. But if you don't want to do it, I will fill your chest with busyness and will not cover your poverty. .\" (Ahmad and at-Tirmidhi's history) Then Allah said to the Prophet Muhammad saw that if you have done what I have commanded you, namely pray before sunrise, before sunset, and in the middle of the night, surely your soul will be peaceful and serene, and you will be pleased with what Allah has bestowed on you as stated in the verse: And indeed, your Lord will surely give His grace to you, so that you will be satisfied. (adh-dhuha\/93: 5) Regarding this pleasure and inner satisfaction, an authentic hadith reveals the following: The Messenger of Allah said, \"Allah said to the inhabitants of heaven, O inhabitants of heaven. They replied, We are ready to listen to your words O our Lord , safe and happy for You, then Allah says are you satisfied and satisfied? They replied: How can we not be pleased and satisfied You have bestowed upon us the favors that You do not give to other than us among Your creatures. So Allah said, I will grant you something better than that. They asked: What is this, O our Lord, which is better than the bounty we have received? Allah said, Allah said, I will give you My good pleasure, so I will not mad at you after that for all eternity.\" (Narrated by al-Bukhari and Muslim from Abu Hurairah) This is the case if someone who has achieved the pleasure of Allah thanks to his obedience and obedience, to his Lord."
		   },
		   {
			"id": 2479,
			"surah": 20,
			"ayat": 131,
			"tafsir": "This verse explains that in order to strengthen the Prophet's heart and strengthen his stance in the face of the struggle to uphold the sentence of Allah, Allah instructed him that he should not divert his attention to the pleasures, luxuries and wealth enjoyed by some disbelievers because it will weaken his enthusiasm if his eyes are dazzled by the glare the jewels of the world and want to have what the rich have. All the blessings given to disbelievers are temporary, like a flower that is blooming, but soon the fragrant flower will wither and fall off its leaves one by one and all its beauty and allure will be lost. The enjoyment of wealth given to disbelievers is only temporary as a test for them, will they thank God with faith and use it to achieve His pleasure or will they remain disbelievers and sink further into error. so that the property becomes the cause of their own accident. Allah has bestowed upon the Prophet in exchange for outward favors better favors, namely peace of mind and happiness in the form of Divine pleasure. Narrated by Abu Rafi', a guest came to visit the Prophet, while there was nothing in his house that should be served to the guest. Rasulullah ordered me to borrow some wheat flour from the Jews and it will be paid later in the month of Rajab. The Jew would not lend unless it was guaranteed. I returned to the Prophet preaching it. The Messenger of Allah said: \"By Allah, I am a person who can be trusted among the inhabitants of the heavens and a person who can be trusted among the inhabitants of the earth. If he lent or sold me, of course I paid for it. Bring this armor of mine. (History of al-Bazzar). Then this verse came down (thaha\/20: 131)."
		   },
		   {
			"id": 2480,
			"surah": 20,
			"ayat": 132,
			"tafsir": "This verse explains the next mandate which is no less important than the previous commandment, namely Allah's command to the Prophet to order his family to pray and be patient in carrying out prayers by keeping the time and its continuity. This order was accompanied by the second commandment, namely with a warning that Allah did not ask the Prophet for sustenance, instead Allah would provide sustenance for him, so that the Prophet did not have to think about the sustenance of his family. Therefore, his family should not be affected or be dazzled by the wealth and pleasures possessed by the wives of those who disbelieve. Such is the mandate of Allah to His Messenger as a provision to face a hard struggle, which should be an example for every fighter who wants to uphold the truth on earth. They must first establish a close relationship with their Creator, namely by continuing to pray and strengthening their minds with steadfastness and patience. In addition, the whole household must have the same characteristics as he has. Thus he will be steadfast in fighting not to be swayed by the adornments of worldly life such as wealth, rank and position. These mandates were practiced by the Prophet Muhammad and his companions so that they were truly successful in their struggle so that in a period of approximately 23 years, Islam had developed rapidly throughout the Arabian Peninsula and became the highest and most noble word of Allah. If the Apostle and his family faced various difficulties, he invited his family to pray, as narrated from the sickle, he said: When the Prophet's family is overwritten by trouble, he ordered them, \"Come on, pray, pray,\" the sickle said, \"The prophets if trouble befalls them immediately pray.\" (History of Ibn Abi Hatim)"
		   },
		   {
			"id": 2481,
			"surah": 20,
			"ayat": 133,
			"tafsir": "The Meccan infidels ridiculed the Prophet Muhammad by saying that his appeal to the religion he brought was sheer nonsense. If the religion he brought was true, surely he would prove it with miracles such as that given to the Prophet Saleh, namely the she-camel, that which was given to the Prophet Musa like a staff and that which was given to Jesus, namely bringing the dead back to life and curing hair loss. If they had even a little bit of will to think and inclination to accept the truth they would not have uttered such words, because the Qur'an itself which was revealed to the Prophet Muhammad is his greatest miracle among the miracles given to the prophets before the Prophet Muhammad saw. Various evidences have shown that they cannot imitate the beauty of the arrangement of sentences and vocabulary of the Qur'an, nor can they come up with a single short surahh that is on a par with the surahhs in the Qur'an. Isn't it true that in the Qur'an there are stories about earlier peoples while the Prophet Muhammad himself did not know these stories before. Isn't it that in the Qur'an there are shari'ahs and regulations which have the same aims and objectives as the shariahs brought by the previous Prophets, namely shariahs for the benefit and happiness of mankind in this world and in the hereafter. Actually, the Al-Qur'an alone is enough proof for the truth of Muhammad saw and is enough as a great miracle that is eternal and eternal. Allah deeply regrets the attitude of those who reject the Qur'an just like that without a good reason and don't want to think about it even a little bit. In another verse, Allah also says: Actually, (the Qur'an) are clear verses in the hearts of those who have knowledge. Only those who are wrongdoers deny Our verses. And they (the disbelievers of Mecca) said, \"Why aren't miracles sent down from their Lord?\" Say (Muhammad), \"The miracles are up to Allah. I am only a clear warner.\" Is it not sufficient for them that We have sent down to you the Book (the Qur'an) which is recited to them? Indeed, in that (Qur'an) there is a great mercy and a lesson for those who believe. (al-'Ankabut\/29: 49-51)"
		   },
		   {
			"id": 2482,
			"surah": 20,
			"ayat": 134,
			"tafsir": "This verse explains that if Allah had destroyed them before sending the Prophet Muhammad to them, they would have said on the Day of Judgment that Allah had not sent them a messenger whose teachings would be followed so that they would become believers before meeting this day of reckoning. Therefore Allah did not destroy them like the former nations so that there would be no excuse for them when facing the Day of Judgment on the Day of Judgment. Because Allah has sent them messengers who will explain to them the verses of Allah. Then it is up to them whether they will follow Allah's instructions or they will remain in disbelief and always insult and make fun of Muhammad peace be upon him."
		   },
		   {
			"id": 2483,
			"surah": 20,
			"ayat": 135,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to speak to the Meccan infidels in response to their various excuses and ridicule against him. If they do not want to accept Allah's guidance and remain disobedient and disobedient, the Messenger of Allah will be with them waiting for Allah's decision on the Day of Judgment. Of course they will know who is on the right path and who is guided. They will know that they are the ones who are astray and will be thrown into the Hellfire. This is stated in the word of Allah: And later they will know when they see the doom, who is most astray in his ways. (al-Furqan\/25: 42) And His words: Later they will know who is really a liar (and) arrogant. (al-Qamar\/54: 26)"
		   }
	]
}
