{
	"tafseer": [
		{
			"id": 2484,
			"surah": 21,
			"ayat": 1,
			"tafsir": "In this verse Allah explains that the day of reckoning or reckoning of charity for humans is near. On the day of reckoning, all the deeds they have done while they lived in this world will be taken into account. In addition, all the blessings that Allah has bestowed on them are held accountable, both the blessings that are in themselves, such as reason, food and drink, as well as offspring and property. They will be asked, what have they done with all these blessings? Do they use God's gifts to do good in the context of obedience to Him, or are they used to do acts that prove their denial and disobedience to Him? Allah confirms that humans are actually heedless of what Allah will do with them on the Day of Judgment. It is this negligence that causes them not to think about the Day of Judgment, so they do not prepare themselves as well as they can to protect themselves from Allah's punishment. The people referred to in this verse are polytheists. They are those who do not believe in the existence of the Day of Judgment, and deny the existence of the day of resurrection and the day of reckoning. However, this verse warns them that the day of reckoning is near. This is to emphasize, that the Day of Judgment, including the day of resurrection and the day of reckoning, will definitely come, even if they don't believe in it; and the day of reckoning will be followed by days of retribution for good or bad deeds. The polytheists were negligent and did not want to think about the bad fate they would encounter later on the day of reckoning and the day of judgment. In fact, with common sense alone, one can believe that good deeds should be rewarded with good, and bad deeds should be rewarded with punishment and torture. However, because they do not want to think about the bad consequences they will receive in the afterlife, they always turn their backs and cover their ears, every time they are warned with verses from the Qur'an, which contain threats and so on."
		   },
		   {
			"id": 2485,
			"surah": 21,
			"ayat": 2,
			"tafsir": "In this verse Allah shows evidence of the negligence and indifference of the polytheists, such as when they heard the verses revealed by Allah, which were conveyed to them by the Messenger of Allah, they did not pay attention to them, they even made fun of them. Thus, this verse is a warning not only to the disbelievers but also a strong warning to anyone who does not want to take heed of the verses conveyed to them. The lessons, warnings and threats contained in these verses do not touch their conscience. They just hear about it, but don't pay attention to it or think about it."
		   },
		   {
			"id": 2486,
			"surah": 21,
			"ayat": 3,
			"tafsir": "In this verse Allah explains what they hid in their hearts, namely the conversation between them which was hidden from other people, about the Messenger of Allah, where they told each other, that Muhammad was an ordinary human being like them, and that what he conveyed to them was only sheer magic. This was one of their efforts to incite the people to pay no attention to the verses of the Qur'an that the Prophet conveyed to them. Because according to their opinion, Muhammad was an ordinary human being, like any other human being. He also eats, drinks and lives with a family, works and tries to make a living, while the verses he conveys are mere magic, therefore he does not deserve to be heard, cared for and obeyed. However, from their statement that the verses are magic, actually reflects an acknowledgment, that these verses are something that amazes them, and they feel unable to match it. It's just that, because they want to prevent other people from listening to these verses and taking lessons from them, they call it magic, so that other people stay away from it. The words of the polytheists above show that they reject the prophethood of Muhammad in two ways. First, by saying that the Messenger must be from among the angels, not from among humans, even though Muhammad is a human too, because he has the same characteristics and behavior as other humans. Second, by saying that the verses he delivered were a kind of magic, not revelations from Allah. They kept both types of accusations secret among themselves, in an effort to find the most appropriate way to undermine the religion of Islam. They keep this secret because it has become a tendency for humans, that they will not invite their enemies to negotiate in seeking ways to damage and destroy these enemies."
		   },
		   {
			"id": 2487,
			"surah": 21,
			"ayat": 4,
			"tafsir": "This verse explains that in response to the accusations and attacks of the polytheists, the Messenger of Allah emphasized that Allah knows all the words spoken by His creatures, both those in the heavens and those on earth, both words spoken openly and secret, because He is the All-Hearing, All-Knowing. Therefore, even though the polytheists keep their evil plans secret, Allah still knows and He will reward them in the form of doom and torment. Thus this verse contains a threat to the polytheists."
		   },
		   {
			"id": 2488,
			"surah": 21,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that the crime of the polytheists is not just saying that Muhammad is not a messenger and the Koran is magic, but they also say that the Koran is a messed up dreams. Others even say that the Koran is just something invented by Muhammad himself. Some even say that Muhammad was a poet. They also demanded Muhammad to bring miracles other than the Qur'an, as shown by the previous messengers. Even though the Qur'an is the greatest miracle of the Prophet Muhammad. Thus they do not know that the Qur'an is the revelation of Allah to Muhammad saw. And they do not admit that the Al-Qur'an is a miracle that Allah has bestowed upon him as proof of the truth of his prophethood and apostleship. Anyone who has an honest heart and has a high knowledge of the Arabic language and its literature will surely admit that the language and content of the verses of the Qur'an are amazing. However, the polytheists have distorted this fact."
		   },
		   {
			"id": 2489,
			"surah": 21,
			"ayat": 6,
			"tafsir": "This verse emphasizes that if their demands were granted, they would still not have faith. This fact has happened to the polytheists in previous times. They also did not believe even though their demands were granted. That is why Allah has destroyed them. Then what is the reason for granting the demands of the current polytheists? Allah already knew that they would not believe either. And sunnatullah will not change, who is unjust, will surely perish. So the polytheists of Quraysh who do not believe in Muhammad, and who act unjustly, will also surely perish."
		   },
		   {
			"id": 2490,
			"surah": 21,
			"ayat": 7,
			"tafsir": "In this verse Allah explains that Allah has never sent messengers except from among ordinary people who He gave revelations. If they really don't know that the apostles sent by God were human beings and not angels, they can ask people who know both Jews and Christians, because they know the matter, and never deny it. In another verse Allah told the Prophet Muhammad to tell the polytheists that he was human. Allah said: Say (Muhammad), \"Indeed, I am only a human being like you, who has received revelations, that your God is indeed God Almighty. So whoever hopes to meet his Lord, let him do good deeds and do not associate him with anything in the worship of his Lord.\" (al-Kahf\/18:110) So the Prophet Muhammad was not an exception from the previous apostles."
		   },
		   {
			"id": 2491,
			"surah": 21,
			"ayat": 8,
			"tafsir": "The polytheists attacked the Prophet, where they alluded to the human qualities seen in the Prophet himself. They say, why did the apostle eat food like other humans, and walk in the market (to trade), as mentioned in surahh al-Furqan, verse 7. So in this verse Allah explains that He made the apostles those who eat food, nor do they live eternally in the world, because they are humans too, who need food, drink, sleep and household life. It's just that Allah has chosen them to convey His message to mankind, and given revelations containing instructions and guidance, to bring mankind out of the darkness of disbelief to the bright light of faith. Apostles as guides are ordinary people who do not have supernatural qualities, but are only given revelations."
		   },
		   {
			"id": 2492,
			"surah": 21,
			"ayat": 9,
			"tafsir": "Allah promised every apostle that He sent, that He would save the apostle and his followers who had faith. In addition, Allah also promised to destroy the disbelievers and the rebellious among his people. This is as explained in surahh Hud, which contains stories about the prophets and apostles. So in this verse Allah confirms that He has kept His promise to the earlier messengers, so that He and their people have been saved from the tyranny of the infidels and polytheists who deny His religion, and belie His messengers. Such is the reward they deserve. He will also fulfill such a promise to the Prophet Muhammad and his loyal Muslims."
		   },
		   {
			"id": 2493,
			"surah": 21,
			"ayat": 10,
			"tafsir": "In this verse Allah directs His word to all mankind, that He has sent down this book of the Qur'an, which contains teachings and values that will bring glory to them both in this world and in the hereafter. Therefore, they should understand its contents and practice it in the best way possible."
		   },
		   {
			"id": 2494,
			"surah": 21,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains that many countries whose inhabitants were unjust have been destroyed, then the inhabitants of those countries have been replaced by people who believe and do good deeds. In connection with this, Allah has said in another verse as follows: And how many people after Noah We destroyed. (al-Isra'\/17: 17) And His word is in another verse: So how many countries have We destroyed because (the inhabitants) were in a state of injustice, so that their buildings collapsed¦ (al-Hajj\/22: 45 )"
		   },
		   {
			"id": 2495,
			"surah": 21,
			"ayat": 12,
			"tafsir": "In this verse, Allah explains how the condition of the disbelievers was at the time of the catastrophe, after they were sure that Allah's punishment would surely befall them as the prophets and apostles had warned them, they fled in a helter-skelter state, whereas before they were full of arrogance. said to their apostles, \"We will certainly expel you from our land, or you will return to our religion.\" Now instead they are forced to leave their homes and hometowns, fleeing the punishment of Allah."
		   },
		   {
			"id": 2496,
			"surah": 21,
			"ayat": 13,
			"tafsir": "In this verse Allah explains, that when they run to save themselves from the coming calamity, they are ordered to return to their original place, where they have felt Allah's favor, to then answer the questions that will be asked of them, as their responsibility to God."
		   },
		   {
			"id": 2497,
			"surah": 21,
			"ayat": 14,
			"tafsir": "In this verse Allah explains what the answer of the disbelievers was to the command above, only then did they regret and admit the injustice they had committed so far. They said, \"Oh, it's a shame indeed we are the wrongdoers.\" However, those confessions and regrets were no longer useful. God's punishment can not be avoided anymore. Regret income first, regret later useless."
		   },
		   {
			"id": 2498,
			"surah": 21,
			"ayat": 15,
			"tafsir": "This verse emphasizes that they always repeat such complaints, but Allah's punishment has befallen and destroyed them, so that they are like plants that have been reaped, destroyed, and cannot possibly live again."
		   },
		   {
			"id": 2499,
			"surah": 21,
			"ayat": 16,
			"tafsir": "This verse explains that Allah did not create the heavens and the earth and everything in between them, for a meaningless or playful purpose, but with the right purpose, which is in accordance with His wisdom and perfect attributes. This statement is a response to the attitudes and actions of the disbelievers who deny the prophethood of Muhammad, as well as the miracles of the Qur'an. Because of the accusations that were thrown at him namely, that the Qur'an was made by Muhammad, not revelations and miracles that Allah sent down to him. This attitude shows that they do not recognize God's creation, as if God created something just for fun, did not have a true and noble purpose. Whereas Allah created the heavens, the earth and everything in them, and what is in between them, was so that humans worship Him and try to know Him through His creation. However, this purpose can only be achieved perfectly if the creation of nature is followed by the revelation of the Book which contains instructions and by sending messengers to guide humans. Al-Qur'an apart from being a guide for humans, also serves as the greatest miracle for Muhammad saw, to prove the truth of his apostleship. Therefore, people who deny Muhammad's apostleship are also people who think that Allah created this world in vain, without any noble purpose and wisdom, without any benefits and uses. If man is willing to pay attention to everything that exists on this earth, both what appears on its surface and what is stored in the bowels of the earth, surely he will find many miracles that show God's power. If he believes that all of this was created by Allah for the benefit and advancement of human life, then he will feel grateful to Allah and believe that all of these were created by Allah based on a noble purpose because they all provide countless benefits. If a human comes to such a belief, it is certain that he will not deny the Qur'an and will not reject the Prophet Muhammad's mission. In line with the contents of this verse, Allah has said in other verses. And We did not create the heavens and the earth and what is between them in vain. That is the opinion of unbelievers, so woe to those who disbelieve because they will go to hell. (shad\/38: 27) And Allah said again: We did not create both of them except with the truth (true), but most of them do not know. (ad-Dukhan\/44: 39)"
		   },
		   {
			"id": 2500,
			"surah": 21,
			"ayat": 17,
			"tafsir": "In order to fully understand the assumptions of the disbelievers who are wrong, then in this verse Allah adds information that if Allah had created this world with the intention of playing games, surely Allah could have created games according to His wishes, such as actions kings who built magnificent palaces with thrones and soft beds. But God did not mean it that way, and would not do such a thing. Allah created the heavens and the earth for the happiness of human life, and to be used as a means of thinking for humans so that they believe in the majesty of His creator and obey Him. So God created the heavens and the earth with wisdom and a high purpose, according to the height of his dignity. Playfulness and easygoing is a creature trait, not God's. Humans are also among Allah's creations which He has created based on wisdom and noble purposes, and given advantages over His other creatures. Therefore man must be responsible for all his actions, and Allah will give him a reward or punishment, according to the good and bad of human actions. Some mufasirin interpret this verse to mean \"child\". So according to them, if Allah wants to take a child, He will certainly take it from a group of His creatures that are in accordance with His characteristics, namely from the angelic group, for example as Allah says in other verses: If Allah wanted to take a child, He would surely will choose what He wills from what He has created. (az-Zumar\/39: 4) While other commentators interpret lahwan to mean \"wife\". However, having children, wives and offspring is not God's character, but the characteristics of His creatures; while Allah is not the same as His creatures. Having a wife and children means that Allah needs other people while Allah does not need other than Him at all, so having a wife and children becomes something that is impossible for Him. So the assumption of some people that God has a child, is a misguided assumption."
		   },
		   {
			"id": 2501,
			"surah": 21,
			"ayat": 18,
			"tafsir": "In this verse Allah confirms that He destroys falsehood with truth, so that truth destroys falsehood, until it completely disappears. What is meant by sleaze here is useless and useless qualities and actions, including playfulness and ridicule. While what is meant by truth here, is the qualities and actions that are serious and useful. At the end of this verse Allah gives a stern warning to the disbelievers, that doom and calamity are prepared for them, because they have attributed bad qualities to Allah, namely traits that are not worthy of Him, for example playing games in creating creatures Him, Allah has children, wives, and others."
		   },
		   {
			"id": 2502,
			"surah": 21,
			"ayat": 19,
			"tafsir": "In this verse Allah reminds again about His absolute power, both in the heavens and on earth, namely that He is the one who creates, controls, regulates, manages, revives, kills, gives rewards and inflicts punishment on His creatures. None other than Allah has the authority and right to intervene in the matter. Likewise His dominion over His creatures who are at His side, namely the muqarrabin angels, whom He has given a noble position, obedient and obedient and worships Him without ceasing, and does not feel tired or tired in serving to her."
		   },
		   {
			"id": 2503,
			"surah": 21,
			"ayat": 20,
			"tafsir": "In this verse, Allah explains how the angels worship Him, namely by always glorifying day and night without interruption. In another verse Allah says about these angels: Those who are not disobedient to Allah in what He commands them and always do what they are ordered to do. (at-Tahrim\/66: 6)"
		   },
		   {
			"id": 2504,
			"surah": 21,
			"ayat": 21,
			"tafsir": "In this verse, Allah shows the misguidance and stupidity of the polytheists, because they do not adhere to the teachings of monotheism, and even worship \"gods that originate from the earth,\" namely statues which are inanimate objects, which are made by their own hands which come from earthly objects. -earth objects. It is certain, that inanimate objects will not be able to maintain and manage living things let alone revive those who are dead. While God has the power to do so. The images they worship are referred to in this verse as 'the gods of the earth. This shows how low the dignity of their gods is, because these gods they make from the ground, or from other objects found on this earth, and are only worshiped by humans. While the real God is worshiped by all creatures, both on earth and in the sky. In this way it is clear how misguided the beliefs and actions of the polytheists are, because they believe in what is not proper to believe in."
		   },
		   {
			"id": 2505,
			"surah": 21,
			"ayat": 22,
			"tafsir": "In this verse, Allah provides rational evidence based on the truth of the belief in monotheism and faith in Allah, the One and Only, that is, if there were two gods in the heavens and on earth, both of them would have been destroyed, and all creatures in between would have perished. Because, if there were two gods, then two possibilities would occur: First, that the two gods might not have the same opinion and desire in managing and controlling this nature, then their different wishes would all come true, where one wanted to create , while others don't want to create, so nature is in a state of flux between existence and non-existence. Or only the wish of one party is fulfilled, then the other god is of course idle and doing nothing. This kind of situation is not befitting of a god. Second, that these gods always agree in creating something, so that every creature is created by two creators. This shows the inability of each god to create his own creatures. This is also unbecoming of a god. Therefore, the true belief is to believe in pure monotheism in Allah, there is nothing associated with Him in creating and maintaining this nature. It is this belief that is most compatible with common sense. Thus, belief in Islam contradicts both the teachings of atheism and the teachings of polytheism. After presenting a rational argument, Allah confirms that He is pure from all the unworthy qualities attributed to Him by the polytheists, for example that He has children, or partners in creating, managing, managing and caring for His creatures."
		   },
		   {
			"id": 2506,
			"surah": 21,
			"ayat": 23,
			"tafsir": "In order to strengthen the statement that Allah is the Holy of Holies of qualities that are not worthy of God, then in this verse Allah mentions His absolute dominion over all His creatures, so that no one has the authority to ask, examine or hold Him responsible for any his deeds. In fact, it is emphasized that it is humans who will be held accountable for their actions. This is because Allah is the true Judge and Ruler. Allah always creates everything based on His high knowledge and wisdom, as well as His compassion and justice for His servants. In this connection, Allah has said in another verse: So by your Lord, We will definitely ask them all about what they did before. (al-Hijr\/15: 92-93) His word again: He protects, and nothing can be protected from (His punishment), if you know? (al-Mu'minun\/23: 88)"
		   },
		   {
			"id": 2507,
			"surah": 21,
			"ayat": 24,
			"tafsir": "In this verse, Allah reaffirms His rebuttal against the polytheists regarding their belief that Allah has partners, or that there is a god other than Allah. After they were given clear proofs and arguments about the oneness of Allah, they were then asked whether they still did not believe, and still took gods other than Allah? This shows their stupidity and abysmal denial. Because, if this were not the case, they would immediately embrace the belief in monotheism and discard the belief in shirk, after obtaining clear information and evidence. Furthermore, in this verse, Allah ordered the Prophet Muhammad to present a challenge to the polytheists, that if they still hold shirk beliefs and reject the teachings of monotheism, they should also present arguments and statements that prove the truth of their beliefs. However, they will never answer this challenge, either based on rational arguments, or evidence in the form of teachings found in the Bible, Torah, or the Psalms. This challenge implies that if polytheists believe that their belief is true, they should show evidence and evidence, because they have the Al-Qur'an which was revealed by Allah to Prophet Muhammad, and the Bible which was revealed to Prophet Isa, and the Torah which was revealed to Prophet Muhammad. He sent down to the Prophet Musa, and the Zabur which He sent down to the Prophet David. Indicate a verse contained in these holy books which justifies the belief in shirk. Of course, they will not be able to provide the intended evidence, because all these holy books only teach the belief in monotheism, and do not justify the belief in shirk. This proves that the religion of Islam and all religions conveyed by the apostles before Muhammad have the same basis, namely the belief in pure monotheism in Allah. It's just that, after the apostles died, some of their people left the belief in monotheism, and returned to the belief in shirk, because most of them did not know the truth, that's why they turned away from the truth of their holy book."
		   },
		   {
			"id": 2508,
			"surah": 21,
			"ayat": 25,
			"tafsir": "In this verse, Allah confirms that every messenger who was sent before Muhammad saw was a human being who had been given revelations whose job was to teach that there is no god but Allah. Therefore it becomes an obligation for humans to worship Allah alone. And there is not a single argument, whether the argument is based on reason, or the argument taken from the holy books conveyed by all of Allah's messengers, which justifies belief other than monotheistic belief in Allah."
		   },
		   {
			"id": 2509,
			"surah": 21,
			"ayat": 26,
			"tafsir": "In this verse Allah mentions the accusation of the polytheists who say that the angels are the children of Allah. Then Allah refutes the accusation by asserting that He is the Most Holy from the accusation, and the angels are His servants who are given glory. Having children is one of the natural phenomena or creatures that are \"new\" while Allah is \"Qid'm\" (former). And it is also a symptom of a desire for family life and procreation, which is also one of the characteristics that exist in creatures, while Allah is not similar to His creatures. In addition, children certainly have similarities with their fathers in one respect, and have differences in other aspects. Therefore, if it is true that an angel is a child of God, then he is also worshiped, even though God has confirmed that only God is worthy of worship and the angels always worship or worship God. In short, angels are not God's children, but His servants, it's just that they are God's servants who are given glory and a place close to God and are given superiority over all creatures, because of their obedience in worshiping Him. ¬ more than other creatures. But human beings who are faithful, obedient and pious are more noble than angels."
		   },
		   {
			"id": 2510,
			"surah": 21,
			"ayat": 27,
			"tafsir": "In this verse Allah mentions the accusation of the polytheists who say that the angels are the children of Allah. Then Allah refutes the accusation by asserting that He is the Most Holy from the accusation, and the angels are His servants who are given glory. Having children is one of the natural phenomena or creatures that are \"new\" while Allah is \"Qidam\" (former). And it is also a symptom of a desire for family life and procreation, which is also one of the characteristics that exist in creatures, while Allah is not similar to His creatures. In addition, children certainly have similarities with their fathers in one respect, and have differences in other aspects. Therefore, if it is true that an angel is a child of God, then he is also worshiped, even though God has confirmed that only God is worthy of worship and the angels always worship or worship God. In short, angels are not God's children, but His servants, it's just that they are God's servants who are given glory and a place close to God and are given superiority over all creatures, because of their obedience in worshiping Him more than other creatures. another creature. But human beings who are faithful, obedient and pious are more noble than angels."
		   },
		   {
			"id": 2511,
			"surah": 21,
			"ayat": 28,
			"tafsir": "In this verse, Allah explains why the angels are so obedient and obedient to Him, because the angels are sure that Allah always knows what they have and are doing, so that no one escapes His knowledge and supervision. Therefore they always worship and obey all His commands. Furthermore, in this verse Allah explains another characteristic of the angels is that they will not intercede for anyone, except for those whom Allah pleases. Therefore, do not expect someone to get intercession or help from angels in the Hereafter, if he does not first get the pleasure of Allah. In addition, the angels are always on guard, because they are afraid of Allah's wrath and His punishment. Therefore, they always abstain from disobeying Him or violating His commands and prohibitions."
		   },
		   {
			"id": 2512,
			"surah": 21,
			"ayat": 29,
			"tafsir": "In this verse Allah explains His provisions that apply to angels and anyone among His creatures who claim to be gods other than Allah. The stipulation is that whoever among them says, \"I am a god besides Allah,\" then he will be punished with the fires of Hell, because such a confession is a very big polytheism, because apart from associating partners with Allah, it also equates himself with God. This is how Allah repays the actions of the wrongdoers."
		   },
		   {
			"id": 2513,
			"surah": 21,
			"ayat": 30,
			"tafsir": "In this verse Allah reveals that the polytheists and infidels of Mecca did not pay attention to this natural condition, and did not pay attention to the events that occurred in this vast universe, even though from the various events that occurred in this natural world, evidence could be obtained about the existence of Allah and His power. His absolute. Heaven and earth that used to be a unified whole, then God separated the two. Before the earth became the place of life for various living things, it was a satellite, namely a celestial body that revolved around the sun. The earth's satellite, which was originally very hot, because it rotates continuously, gradually becomes cold and dewy. The old dew became lumps of water. This is the source of life for beings. According to science and technology scientists, there are three opinions related to life starting from water, namely: First, life started from water, in this case the sea. Modern theories about the origin of life were not firmly agreed upon until about two or three centuries ago. Prior to that, the theory that emerged about the origin of life was a concept called \"spontaneous generation\". In this concept it is agreed that living things exist spontaneously from non-existence. This theory was later challenged by several experts around the 1850s, including by Louis Pasteur. Starting with the research done by Huxley and up to the present research, other theories are offered as alternatives. This theory believes that life arose from a long and complex chain of chemical reactions. It is believed that this chemical chain started in seawater, because the atmosphere at that time had not yet developed into an area habitable for living things because the ultraviolet radiation was too strong. It is estimated that life moved towards land 425 million years ago when the ozone layer began to exist to protect the earth's surface from ultraviolet radiation. Second, the role of water for life can also be expressed in the form that all living things, especially animals, originate from sperm fluid. It is indicated that the diversity of animals \"comes\" from specific water (sperm) and produces something according to the characteristics of each animal that is exemplified. Third, the third understanding is that water is an important part so that creatures can live. In fact, most of the body parts of living things consist of water. For example, in humans, 70% of their body weight consists of water. Humans cannot survive long if only 20% of the water supply in their body is lost. Humans can survive for 60 days without food, but they will soon die within 3-10 days without drinking. It is also known that water is the main ingredient in the formation of blood, lymph fluid, urine, tears, milk fluids and all other organs in the human body. From the description above, it is very clear the role of water for life, from the existence of living things on earth (originating from the depths of the sea), for their survival (water is needed for the formation of organs and carrying out organ functions) and starting life (especially for groups of animals “ certain special water “ sperm). However, it should be noted here that the Qur'an does not provide any special opportunity to support the theory of evolution. Although all the above verses give an undoubted indication that Allah created all living things from water. Verses related to an-Nur\/24:25, al-Furqan\/25: 54. From this information it can be understood that the Qur'an is truly a great miracle. Its miracle lies not only in its beautiful language style and summary, but also in the content contained in its verses, which reveal various kinds of knowledge of high value, especially regarding nature, with various types and characteristics and benefits of each. Especially when one remembers that the Al-Qur'an has stated all of this in the sixth century after the death of Prophet Isa, when humans in this world were still filled with an atmosphere of ignorance and misguidance. Then where did the Prophet Muhammad get to know all of this, if not from the revelations that Allah revealed to him? The development of modern science in various fields confirms and reinforces what the Qur'an has revealed fifteen centuries ago. Thus, the progress of science should lead people to believe in what is taught by the Qur'an, especially faith in the existence of Allah and all of His perfect attributes. After presenting the science of natural events, namely the heavens and the earth, then in this verse Allah also teaches another scientific principle, namely regarding the importance of the function of water for the life of all creatures living in this nature, both humans, animals and plants. plant. So Allah said, \"... and from water We made every living thing.\" At this time, no one will deny the importance of water for humans, both for the various needs of human life itself, as well as for the needs of livestock, or for the benefit of crops and rice fields, so that people carry out various businesses. irrigation, to find water sources and storage and distribution. Many dams are made to collect and store water, which is then channeled to various places for various purposes. Even in countries where there are not many water sources, they try to process seawater into fresh water, to irrigate their fields and feed their livestock. In short, humans, animals and plants cannot live without water. Humans and animals can survive for days without food, as long as they get water. But he will not be able to live without getting a few days of drinking. Likewise with plants. If he does not get water, the roots and leaves will dry up, and eventually die completely. Besides that, humans and animals, besides needing water for their life, they also come from water, which is called \"nutfah\". Thus water is an element that is vital to human life and events. Therefore, if humans already believe in the importance of water for their lives, and also believe that water is one of Allah's blessings, then there is no reason for humans not to believe in Allah and to deny His blessings which are priceless. At the end of this verse, Allah reminds us all, is it with Allah's omnipotence that humans still don't want to believe? Humans who have reason and are willing to use their minds should be able to understand the contents of this nature and then become people of faith."
		   },
		   {
			"id": 2514,
			"surah": 21,
			"ayat": 31,
			"tafsir": "In this verse Allah directs human eyes to the mountains and roads and wide plains that exist on this earth. Allah explained that he created strong mountains so that the earth, in its fast rotation, would remain steady with the maintenance and care of humans and all creatures on this earth. The earth's surface, which covers 510 million square kilometers, consists of 29% land, which is 153 million square kilometers and 71%, which is 357 million square kilometers, is water. So mountains that are up to 3-5 km high from sea level can keep the inhabitants of the earth calm even though they rotate very quickly. At the end of this verse Allah explains that all creatures can calmly live life, various roads have been made so that day and night humans can walk through valleys and plateaus. It is hoped that humans will be able to obtain correct guidance, that is, be able to understand Allah's instructions, both those given through written revelations and Allah's instructions in the form of this vast expanse of nature."
		   },
		   {
			"id": 2515,
			"surah": 21,
			"ayat": 32,
			"tafsir": "In this verse, Allah directs human attention to the heavenly bodies, which He created in such a way that each one runs and circulates in an orderly manner, without falling or colliding with one another. All of that is maintained by a force called \"attraction\" between the heavenly bodies, including the sun and the earth. This is also a clear proof of Allah's existence and power. However, many people do not pay attention to this evidence. In fact, if we fly on an airplane above an altitude of 10,000 miles, we see the clouds below us, even the rain that falls below us, so that it is clear that the earth is covered with a very strong sky and the earth's atmosphere and the oxygen substance that humans and various creatures need to grow. -plants and animals are preserved bounded by the sky which is very strongly preserved. According to scientists, this verse confirms that the sky is a roof that is preserved. As befits a roof, the sky functions to protect everything under it, including humans. In contrast to the moon, because it has no shield, we get a very uneven surface of the moon, filled with craters due to meteor impacts. The Earth's atmosphere destroys all meteors that approach Earth and filters out harmful rays, which come from the fusion energy bursts in the sun. The atmosphere only lets in light, harmless radio waves. Ultra violet light for example. This light is only allowed to enter in certain levels which are needed by plants to carry out photosynthesis, and in turn provide benefits for humans. In the atmosphere, there is a shield called the \"Van Allen radiation belt\" which protects the earth from celestial bodies towards the earth. Thus, the sky has served as a protective roof for creatures on earth. This roof of heaven will continue to be maintained as long as this earth exists, because these protective layers are related to the structure of the earth's core. The Van Allen belts result from the interaction of the magnetic fields generated by the Earth's core. The earth's core contains many magnetic metals, such as iron and nickel. The nucleus itself consists of two parts, the inner core is solid and the outer core is liquid. These two layers each rotate with the rotation of the earth. This rotation causes a magnetic effect on the metals in the earth's structure which in turn forms a magnetic field. The Van Allen belts are an extension of this magnetic field that extends to the outer atmosphere. How God's knowledge and wisdom always protects His creatures. Why are these things not understood by many people, so they still turn away from the truth and power of God, even though the signs of God's power are so clear in this world."
		   },
		   {
			"id": 2516,
			"surah": 21,
			"ayat": 33,
			"tafsir": "In this verse Allah directs human attention to His power in creating the night and the day, and the sun that shines during the day, and the moon that shines at night. Each of them circulates in its orbit in a vast expanse of space that only Allah knows its limits. The existence of the time of day and night is caused by the rotation of the earth on its axis, in addition to its circulation around the sun. The part of the earth that gets sunlight experiences day, while the part that doesn't get sunlight experiences night. While moonlight is sunlight that is reflected by the moon to earth. In addition, the moon also revolves around the earth. This verse reaffirms what Allah has said in surahh Ibrahim\/14:33. It is widely known that the sun and moon have \"orbits\". But for \"each of the two (day and night) circulating in its orbit\", is something new to understand. Why do the day and night have to revolve in orbits (orbit-manzilah), and what is the shape of the orbits? After studying it, it turns out that what is meant by \"orbit\" is the location of places on earth that experience the change of day to night, or experience sunset (gurub). Along the equator this line shifts from East to West in the order of the places where the sun sets or the change of day to night. The setting time of the sun will also shift along with the apparent movement of the sun towards the earth from north to south and vice versa. This sunset time shift also shifts and forms its own position which can be said to be an annual path from day to night. On certain days (at the beginning of the month) when the sun sets it is also the beginning of the sighting of the hilal (early crescent of the month). This scythe is very thin and dim, so it is very difficult to observe. The time of rising of the hilal will shift from east to west, and just like the change of day to night, its orbit also varies from one place to another on the earth's surface. If it is mapped, the positions of the places where the new moon rises is the same as the time when the sun sets it will form a spiral that cuts the surface of the earth in two or even three. rational arguments and explanations contained in the previous holy books, regarding the existence and power of Allah, to strengthen what He has mentioned in His previous words, that \"if\" in the heavens and on this earth there are gods gods other than Allah would have been destroyed both of them."
		   },
		   {
			"id": 2517,
			"surah": 21,
			"ayat": 34,
			"tafsir": "This verse emphasizes that Muhammad as a human is the same as other humans, namely that he will not live in this world forever. Allah had never given anyone eternal worldly life before the birth of the Prophet Muhammad. Even though he is His Prophet and Messenger, he will surely leave this mortal world when his death comes. And they too, will not remain in this world forever. This is one aspect of Allah's justice towards all of His creatures, and is His Sunnah which is valid for all time. In another verse Allah says: And Muhammad is only a Messenger; previously several messengers had passed.... (Ali 'Imran\/3: 144) So this verse states more emphatically, that the Prophet Muhammad would leave this mortal world, just like the messengers who had existed before him. However, even though he dies one day, the Islamic religion that he has developed will still exist and continue to grow, because Allah has guaranteed his victory. Because it is very wrong, if the polytheists expect that with the death of the Prophet Muhammad, the Islamic religion will stop its development, and Islamic preaching will subside. Historical facts then show that after the death of the Prophet Muhammad, Islamic preaching continued so that Islam developed far beyond the boundaries of the Arabian Peninsula, both to the East, North, and West and South."
		   },
		   {
			"id": 2518,
			"surah": 21,
			"ayat": 35,
			"tafsir": "In this verse Allah states even more emphatically, that every living or animate creature of His will surely taste death. Nothing is eternal, except he himself, in this connection, Allah says in another verse: Everything must perish, except Allah. (al-Qashash\/28: 88) Furthermore, in this verse, Allah explains that the trials that Allah inflicts on humans are not only in the form of bad things, or unpleasant calamities, even these tests can also be good or lucky. If the test or trial is in the form of a disaster, then the aim is to test the attitude and faith of man, whether he is patient and trustful in accepting the ordeal. And if the ordeal is in the form of a kindness, then the goal is to test the mental attitude of man, whether he wants to be grateful for all the blessings that God has bestowed upon him. If someone is patient and trusting in accepting trials or calamities, and is grateful to Him in receiving good and fortune, then he is one of those who gain victory and strong faith and earn His pleasure. On the other hand, if he complains and his faith is damaged when he accepts God's trials, or he loses his mind when he receives His grace so that he is not grateful to Him, then that person is one of the people who are losers and far from pleasing Allah. This is what is meant in His word in another verse: Truly, humans are created to like to complain. When he is struck by trouble he complains, and when he gets good (wealth) he becomes stingy, except for those who pray. (al-Ma'arij\/70: 19-22) At the end of this verse Allah confirms that no matter how human behavior is in facing trials or in receiving His grace, in the end all problems return to Him as well. He is the one who gives reward, both reward and punishment, or gives forgiveness to whoever He wills."
		   },
		   {
			"id": 2519,
			"surah": 21,
			"ayat": 36,
			"tafsir": "In this verse Allah explains the attitude and behavior of the disbelievers towards the Prophet Muhammad, namely that every time they saw him, they made the Prophet the target of ridicule and ridicule them, saying to their neighbors, \"Is this the person who denounced your god? Yet they are the ones who deny the remembrance of Allah.\" Thus their mockery of the Prophet. And they do not realize that in fact they are the ones who deserve ridicule, because they worship statues and idols, which have no power to do anything for them, even their own hands make their gods so that they are the creators while the gods they become created beings. Thus, the situation turned upside down than it should have been, because God should be the creator, not the created one."
		   },
		   {
			"id": 2520,
			"surah": 21,
			"ayat": 37,
			"tafsir": "In this verse, God first explained that humans were created as creatures with a hasty and impetuous nature. Then Allah warned the disbelievers not to ask for the punishment that was threatened to be hastened, because Allah will surely show them signs of His punishment. Here we can see that God forbids humans to be in a hurry, asking for something to come immediately that has not yet come, and it will definitely come. In addition, Allah explained that even though He has made haste as one of the characteristics of humans, humans have been given the ability to restrain themselves and overcome this trait, by getting used to being calm, patient, and introspective. Haste and impetuousness always lead to unfavorable consequences and harm either oneself or others, which in the end will lead to endless feelings of regret. Conversely, a calm, patient, careful and introspective attitude can convey a person to what he is aiming for, and achieve resounding success in his life. That is why the Qur'an always praises people who are patient, and promises them that Allah will always protect, guide and help them. Meanwhile, those who are in a hurry, are quick to anger, are easily deceived by the devil's temptations that will plunge them into the abyss of destruction, and deviate from the truth will suffer losses. The request of the disbelievers that Allah's punishment be immediately brought upon them, clearly shows their disbelief in the existence of such punishment, as well as their denial that Allah has the power to inflict punishment on those who do wrong."
		   },
		   {
			"id": 2521,
			"surah": 21,
			"ayat": 38,
			"tafsir": "In this verse Allah shows how determined the infidels were, when they said to the Prophet Muhammad and the Muslims in a defiant manner, \"When will the promised punishment of the hereafter come? If the threat is true, try to show it right now!\" They asked for Allah's punishment to be brought to him immediately, these words showed that they actually did not believe at all about the existence of such punishment. By themselves, they also do not believe in the afterlife, as well as Allah's power to reckon with and repay human actions."
		   },
		   {
			"id": 2522,
			"surah": 21,
			"ayat": 39,
			"tafsir": "In this verse Allah shows how determined the infidels were, when they said to the Prophet Muhammad and the Muslims in a defiant manner, \"When will the promised punishment of the hereafter come? If the threat is true, try to show it right now!\" They asked for Allah's punishment to be brought to him immediately, these words showed that they actually did not believe at all about the existence of such punishment. By themselves, they also do not believe in the afterlife, as well as Allah's power to reckon with and repay human actions."
		   },
		   {
			"id": 2523,
			"surah": 21,
			"ayat": 40,
			"tafsir": "In this verse, Allah explains that if the disbelievers knew that one day they would be powerless to escape the punishment of the fires of hell which would attack them from all directions, they would not have said that. Therefore, their challenge so that the doom will be brought upon them immediately, is really arising from their ignorance and denial, because they close themselves to the true teachings, which were conveyed by the Messenger of Allah. There is doom and the Day of Judgment that comes suddenly so that it can be used as a warning for those who believe in Allah and to remain focused on the practice of religion, as Allah says: Therefore, turn your face to the straight religion (Islam) before comes from Allah one day (Resurrection) that cannot be rejected, on that day they will be separated. (ar-Rum\/30: 43)"
		   },
		   {
			"id": 2524,
			"surah": 21,
			"ayat": 41,
			"tafsir": "In this verse, Allah confirms that the punishment in the hereafter that is threatened to disbelievers will surely occur, and will even come to them suddenly and unexpectedly, causing them to panic and unable to save themselves. And they really will not be given a grace period and an opportunity to prepare to save themselves from it. At the end of this verse Allah provides entertainment to the Prophet Muhammad who always gets ridicule from the infidels, Allah confirms that he was not the only one who was ridiculed by the infidels. Even all the apostles who were sent by Allah before were also the targets of ridicule by their people. However, the doom that they used to make fun of finally came to overwhelm them. And no one can save them from the terrible punishment."
		   },
		   {
			"id": 2525,
			"surah": 21,
			"ayat": 42,
			"tafsir": "With this verse, Allah told the Prophet to answer the ridicule by asking them questions about who can protect and protect them from Allah's punishment, both at night and during the day? The question was intended to make them aware that no one has the power to protect them from the torment and punishment of Allah, because He is the Almighty to do what He wills. If they had always remembered about Allah's will and power, they would not have ridiculed or challenged that kind of thing. However, because they are people who have turned away from remembering Allah and His power, that is why they mock His Messenger and challenge with arrogance so that the punishment will befall them immediately."
		   },
		   {
			"id": 2526,
			"surah": 21,
			"ayat": 43,
			"tafsir": "This verse is a continuation of the previous verse, in which Allah ordered His Messenger to ask questions to the disbelievers, to make them aware of Allah's power. The contents of the question mentioned in this verse are, \"Do they have gods who can protect them from Allah's punishment? The gods they worship are definitely not able to help them, even they cannot help themselves. At the end of this verse Allah reiterates, that the gods they worship will not escape Allah's punishment. If this is the case, how will they be able to protect their worshipers? cause they are not worthy of being worshiped and worshiped. First, they are unable to help themselves. Second, that they are not immune from Allah's punishment. Thus, their condition is weaker than their worshipper. With these two facts, they should be able to conclude that the objects they worship do not have any ability to protect them from Allah's punishment."
		   },
		   {
			"id": 2527,
			"surah": 21,
			"ayat": 44,
			"tafsir": "This verse explains that Allah gives enjoyment of life and wealth to the disbelievers, so that they can live comfortably with longevity. However, the Muslims do not need to be jealous and feel dazzled by the pleasures of their life, because all the wealth and luxury that Allah has given them as a test, if the wealth will cause their hearts to become arrogant, and their characters become rough so that it leads them to bad deeds. - bad deeds. All of this resulted in their sins increasing, and the punishment they would receive was heavier. Thus it can be understood that Allah gave them the luxury and enjoyment of life not because Allah is powerless to inflict punishment on them, but instead that luxury is a test for them which can plunge them into physical and spiritual destruction, as well as a painful punishment. This verse also mentions another form of loss that Allah inflicted on them, namely the decrease in the number of their followers because many converted to Islam, and as a result their territory was also reduced because Islam had spread to areas that were originally included in their territory. . With the decrease in the number of followers and their territory, it means that their strength is also decreasing. After describing their condition which has become fragile because of luxury, and has become weak because of the reduced number of followers and their power, Allah at the end of the verse asks one question, namely in such circumstances who can gain victory, do they still have hope? Of course they will not win. Besides their fragile and weak condition, Allah's power is absolute over His servants, and Allah does what He wills. Nothing can beat Him"
		   },
		   {
			"id": 2528,
			"surah": 21,
			"ayat": 45,
			"tafsir": "In this verse, Allah orders the Prophet Muhammad to emphasize to the disbelievers and polytheists that his main duty as a Messenger is simply to convey Allah's warnings to them through revelation, namely the Qur'an, and explain to them the consequences of disbelief, by explaining stories - the story of the ancient people. As for the reckoning and retribution for their actions, it is the authority of Allah, not the authority of the Prophet. In this verse there is also an insinuation against the disbelievers, that they are like deaf people, do not listen and do not pay attention to the warnings given to them. Their hearts seemed to have been closed, and did not accept the truth and God's guidance conveyed to them by the Apostle. This is a sign of those who deny God, as Allah says: (They are) deaf, dumb and blind, so they do not understand. (al-Baqarah\/2: 171)"
		   },
		   {
			"id": 2529,
			"surah": 21,
			"ayat": 46,
			"tafsir": "Allah explains in this verse one of the characteristics of the disbelievers, that is, if they are struck by Allah's punishment, even if only a little, they complain and feel sorry for themselves, saying, \"Oh, woe to us, that we are the ones who wrong ourselves. .\" Before the punishment came, they did not believe it, they even challenged it to be brought to them immediately, because of their denial and arrogance. But after the doom came to them then they knew about Allah's power so that regret arose in their hearts."
		   },
		   {
			"id": 2530,
			"surah": 21,
			"ayat": 47,
			"tafsir": "Allah emphatically stated in this verse, that in judging the deeds of His servants later on the Day of Judgment. God will establish a perfectly just balance of justice, so that no one will be disadvantaged in that judgment. This means that the assessment will be carried out precisely, so that there will not be a servant whose good deeds will be reduced in the slightest, causing his reward to be reduced from what he should have received. On the other hand, there is no one among them whose crimes are exaggerated, so that it causes him to receive a more severe punishment than he should, even though Allah has the power to do so. As for giving a reward that is multiplied by the number of good deeds or inflicting a punishment that is lighter than the crime, it is up to Allah's will, and Allah is Most Gracious and Most Merciful. In God's justice, it is explained that all human virtues, no matter how small, are undoubtedly rewarded by Him, and all crimes, however small, are undoubtedly rewarded by His punishment or punishment. In this connection, Allah says in another verse: So whoever does an atom's weight of good, surely he will see (reply) it, and whoever does an atom's weight of evil, surely he will see (reply) it. (az-Zilzal\/ 99: 7-8) Current technological capabilities have been able to record all events carefully and store them for a long time, let alone God's ability. At the end of this verse Allah confirms that He is sufficient as a witness to make the most just calculation. This is a guarantee that the judgment that will be made on all the deeds of His servants will be carried out later on the Day of Judgment with the fairest possible judgment, so that no servant is harmed or abused when receiving the reward for his kindness or receiving the punishment for the evil that has been done. he did."
		   },
		   {
			"id": 2531,
			"surah": 21,
			"ayat": 48,
			"tafsir": "This verse explains that Allah has sent down the Torah to the Prophets Musa and Aaron. The Torah is an explanation and teaching for those who fear Allah. The Torah is also called al-Furqan, as is the case with the Qur'an, because the Torah also contains the Shari'a, namely laws and regulations that distinguish between right and wrong, between good and bad according to law, so that every behavior and deed human beings, good or bad, explained the legal consequences or sanctions. This is not the case with the Bible which was revealed to Prophet Isa as. He did not carry the Shari'a. At the end of the verse it is emphasized that the Torah, which functions as a carrier of the Shari'a, and as a light of guidance and warning, is only useful for those who are pious. This means that the Torah is for people who are not pious, that is, who are not willing to carry out God's commands and stay away from His prohibitions, the Torah is not a guide. For that they are provided with a terrible punishment, for disobeying Allah's guidance."
		   },
		   {
			"id": 2532,
			"surah": 21,
			"ayat": 49,
			"tafsir": "Furthermore, in this verse Allah explains the characteristics of pious people, namely First, they are always afraid of Allah's punishment, even though this punishment is one of the things that are unseen. Second, the pious people mentioned in this verse are those who are always afraid of the Doomsday, trying to prepare themselves for the things that will happen later on the Doomsday, including the Day of Judgment and Judgment. Because of their fear of Allah's punishment on the Day of Judgment that will befall people who are not pious, those who are pious always guard against things and actions that result in sin and punishment, so they always carry out Allah's commands, and stay away from everything his ban."
		   },
		   {
			"id": 2533,
			"surah": 21,
			"ayat": 50,
			"tafsir": "In this verse Allah turns attention to the Al-Qur'an which He revealed to His last Prophet and Messenger, Allah confirms that the Al-Qur'an is a very useful warning and lesson for people who are pious, so it is fitting commands and prohibitions are followed and used as a guide in pursuing the path of life. At the end of this verse Allah denounces the attitude of people who still deny the Qur'an, even though there is no single reason for them to deny it, in fact the Qur'an only provides useful lessons and guidance for those who want to follow it. After all, the goodness and benefits of the Qur'an have been explained to them."
		   },
		   {
			"id": 2534,
			"surah": 21,
			"ayat": 51,
			"tafsir": "In this verse it is explained that Allah has sent Prophet Ibrahim as, and He has bestowed guidance on him and made him the leader of his people in achieving the salvation of the world and the hereafter. With this guidance, he has been able to save himself and his people from misguided beliefs and from worshiping other than Allah, such as statues and idols. At the end of this verse it is emphasized that God really knew about Abraham, both before he was sent as an apostle, and afterward. It means; Allah knows the true personality, character and manners. Ibrahim is a person who adheres to the belief in monotheism in Allah, without being interfered with by the slightest polytheism, besides that he also has noble qualities and morals, so it is right that he is chosen and appointed as a prophet and apostle. Most of the commentators said that Allah had given instructions to the truth to Abraham before he was appointed as an Apostle, so that with these instructions he could pay attention to this nature so that he came to believe in the existence of Allah, the One and Only. Therefore, his struggle in eradicating polytheism in the form of worship of statues and idols among his people was carried out before he was appointed as an apostle. As an explanation, it is appropriate to explain here that according to history, the Prophet Abraham came from Ur al-Kaldaniyah (Ur Kaldea), the capital of the Kaldan Kingdom (Caldea) in Southern Mesopotamia. The Chaldean kingdom was ruled by a king named Namruz reigning in 2300 BC, before the reign of Hammurabi who ruled in 2000 BC. King Namruz is known as a king who is very cruel and claims to be a god. Apart from worshiping gods in the form of statues, the Kaldan people were also ordered to worship Namruz. King Namruz was the one who ordered to burn the Prophet Abraham. Finally Prophet Ibrahim with his wife named Sarah and his brother named Lut left the city of Ur, emigrated to Harran and then to Palestine. Once upon a time there was a famine in Palestine, so Ibrahim and his wife and Lut and his wife went to Egypt. In Egypt Abraham meets Pharaoh. Pharaoh gave them gifts, among the gifts was a woman named Hajar for Abraham's wife Sarah. After returning to Palestine, Lot separated and went to Sodom, a city near the Dead Sea in Jordan. Because Sarah and Ibrahim did not have sons, Hajar was presented by Sarah to Prophet Abraham to be his wife. With Hajar, Ibrahim had a son, namely Ismail. Then by Ibrahim Siti Hajar and Ismail were moved to Mecca. In Mecca Prophet Ibrahim rebuilt the Kaaba, and Ismail settled in Mecca. Prophet Ibrahim in his old age was blessed with another son from his first wife Sarah, namely Isaac. Prophet Abraham died and was buried in Hebron, the place where Sarah had been buried earlier. From the descendants of Abraham, there were many prophets, priests, pious people and leaders who called on the religion of Allah."
		   },
		   {
			"id": 2535,
			"surah": 21,
			"ayat": 52,
			"tafsir": "This verse explains that Allah has given instructions to Abraham, so he asked his father Azar who was gathering with his people, about the statues they made and worshiped diligently. This question implies that Azar and his people should use their minds to contemplate that these objects are not worthy of worship, because they do not have the characteristics of a God worthy of worship. They worship created things, not the creator, and cannot benefit themselves, let alone other people. They do not want to worship Allah even though Allah is the Creator, Sustainer, Educator, Protector, and Ruler of all creatures. If they had thought about it, they would not have done so. So they are actually people who do not want to use the mind that God has given them."
		   },
		   {
			"id": 2536,
			"surah": 21,
			"ayat": 53,
			"tafsir": "In this verse it is explained that Azar and his people answered Ibrahim's question with the statement that they worshiped the statue simply following the actions of their ancestors. The answer shows various weaknesses. First, they could not answer Ibrahim's question using reasonable reasons, which are based on truth. Second, their religious life is only based on a sense of ta'ashshub (fanatic) to ancestral traditions, not based on healthy beliefs and thoughts. Third, they close themselves to things that are different from their habits, even though the truth is real. It was as if their ears had been plugged, and their hearts had been sealed shut. The attitude of ta'ashshub (fanatic) and blind obedience are the characteristics of people who are unable to defend their principles with correct evidence and strong evidence, because the principles they adhere to are not true. They adhere to it just to maintain the traditions they inherited from their ancestors. This attitude greatly hinders human progress, and plunges them into denial of the truth, and even leads to disbelief towards Allah. Among the Muslims we find people who are blind to one school of thought, or to an Imam, so they don't want to accept the truth that comes from other people. Such an attitude is contrary to the teachings of Islam, which always recommends that humans use their minds in seeking the truth. Imams from various schools of Islamic jurisprudence forbade their followers to have blind faith in them, and recommended that they be open to accept other people's opinions, if it turns out that those opinions are more correct than the opinions they adhere to."
		   },
		   {
			"id": 2537,
			"surah": 21,
			"ayat": 54,
			"tafsir": "This verse explains that Abraham replied to their answer by showing the ugliness of their forefathers who worshiped other than Allah. Ibrahim told his father and also his people, that they were all in error, because they worshiped statues and idols. By doing that they have been far from the truth and deviated from the right path. They do not adhere to true religion and common sense. What they hold is only the desire of lust and the whispers of the devil."
		   },
		   {
			"id": 2538,
			"surah": 21,
			"ayat": 55,
			"tafsir": "In this verse, the answer of Azar and his people to Ibrahim is stated, namely, did Abraham come to them with the truth, or did he just want to make fun of them. From their words, we can conclude several questions about their attitudes. First, that after listening to Abraham's words that were demeaning to their gods, and declaring the error of their actions, their hearts began to stir, because such words had never been heard among them. Second, seeing Ibrahim's seriousness and severity in his words, their hearts began to doubt the truth and their own actions as idol worshippers. Third, they asked Ibrahim to provide evidence and reasons that showed the truth of Abraham's words to them. Fourth, if Ibrahim could not provide these proofs, then they thought Ibrahim was just making fun of them."
		   },
		   {
			"id": 2539,
			"surah": 21,
			"ayat": 56,
			"tafsir": "This verse explains that after Abraham understood the reality mentioned above, he replied to their answer with a statement that no longer exposed their error in worshiping statues and idols, but he instead turned to explaining the truth and mentioning God who is truly worthy of worship. So Abraham explained to them that he had come to bring the truth, not make fun of it, that their God is the God of Heaven and Earth. It is He who deserves to be worshiped, because He is the One who created the heavens and the earth and created themselves, and bestows His grace and protection on all His creatures, because He is Almighty and Most Compassionate. Thus they realize that worshiping God is the right thing to do, while worshiping statues and idols is a big mistake. At the end of this verse it is explained that in order to strengthen their belief in the belief in monotheism, Ibrahim reviewed his earlier words by emphasizing that he can and is fully responsible for providing evidence for the truth of what he conveyed to them. This statement is intended to dispel their prejudice that Abraham was only making fun of them with the statements mentioned above."
		   },
		   {
			"id": 2540,
			"surah": 21,
			"ayat": 57,
			"tafsir": "This verse explains what was contained in Ibrahim's heart which was spoken and heard by some of his people, namely he was determined to destroy the statues that were worshiped by his people, when they left the place."
		   },
		   {
			"id": 2541,
			"surah": 21,
			"ayat": 58,
			"tafsir": "In this verse it is stated that Abraham's determination to take advantage of the great celebration to destroy the statues was actually carried out, so that after the death of his people, the statues were damaged so that they were shattered to pieces, except for a large statue. He didn't destroy the statue, because he hoped that if they went back there and asked him who had damaged the other statues, he would have them ask the biggest statue, which of course could not answer their question."
		   },
		   {
			"id": 2542,
			"surah": 21,
			"ayat": 59,
			"tafsir": "This verse explains that what Ibrahim expected, actually happened. After hearing the news that their statues had been broken, they came back to that place and asked Ibrahim, who had done this evil deed against their gods? Indeed, he is truly one of the unjust.\" From this statement we can understand that until that time they still had not fully accepted what Abraham had told them, and they still worshiped and glorified those idols, and still called them gods. their god. This causes anger against those who destroy it."
		   },
		   {
			"id": 2543,
			"surah": 21,
			"ayat": 60,
			"tafsir": "Allah explained in this verse that the people who were near the worship of the idols answered the above question by saying that they heard that a young man named Abraham had destroyed the idols. From this we understand that at that time Ibrahim was still a young man (± 16 years old), and had not been sent by Allah to be His Prophet and Messenger. So his action in destroying the statues was not in the context of his duties as an Apostle, but arose from the encouragement of his belief in Allah, based on instructions to the truth that Allah had bestowed on him, before he was appointed as an Apostle."
		   },
		   {
			"id": 2544,
			"surah": 21,
			"ayat": 61,
			"tafsir": "This verse explains that after they received an answer that it was a young man named Ibrahim who damaged the statues, they ordered the young man to be brought before the crowd, hoping that someone else would witness the young man doing the damage, so testimony can be used as evidence. This gave an understanding that at that time a rule was already in effect among them, that they would not take direct action against someone who was accused before there was evidence, either in the form of a person's testimony or in the form of a confession from the accused party."
		   },
		   {
			"id": 2545,
			"surah": 21,
			"ayat": 62,
			"tafsir": "In this verse it is explained that after they presented Ibrahim to the crowd, they conducted an investigation and examination of him by asking the question whether it was he who had damaged the idols. They asked this question in the hope that Ibrahim would admit that he was the one who did the destruction. They will use this confession as an excuse to punish Ibrahim."
		   },
		   {
			"id": 2546,
			"surah": 21,
			"ayat": 63,
			"tafsir": "Described in this verse Abraham's answer to the accusation. Where Ibrahim's answer surprised them greatly, because it was not in accordance with their expectations, because Ibrahim did not admit that he was the one who damaged it, but he said that the one who damaged the statues was actually the largest statue that was still intact. Such an answer was intended by Ibrahim to achieve his goal, namely to make his people aware that the statues were not worthy of worship, because he could not do anything about it. Especially to defend himself. It was clear that his people would not believe that it was the largest statue that had damaged the other statues. This is because they realize that it is impossible for this to happen, because a statue cannot do anything, because it is an inanimate object. If they had realized this, they would have stopped worshiping images. At the end of this verse, Abraham's next words are mentioned to his people, who told them to ask the statues themselves, who had damaged them. This statement caused his people to be even more cornered, because if they asked the statues, surely they would not get an answer, because the statues did not hear and could not speak. If this is the case, should the images be worshipped? If there are still people who worship him, surely that person is not using a sound mind."
		   },
		   {
			"id": 2547,
			"surah": 21,
			"ayat": 64,
			"tafsir": "Described in this verse Abraham's answer to the accusation. Where Ibrahim's answer surprised them greatly, because it was not in accordance with their expectations, because Ibrahim did not admit that he was the one who damaged it, but he said that the one who damaged the statues was actually the largest statue that was still intact. Such an answer was intended by Ibrahim to achieve his goal, namely to make his people aware that the statues were not worthy of worship, because he could not do anything about it. Especially to defend himself. It was clear that his people would not believe that it was the largest statue that had damaged the other statues. This is because they realize that it is impossible for this to happen, because a statue cannot do anything, because it is an inanimate object. If they had realized this, they would have stopped worshiping images. At the end of this verse, Abraham's next words are mentioned to his people, who told them to ask the statues themselves, who had damaged them. This statement caused his people to be even more cornered, because if they asked the statues, surely they would not get an answer, because the statues did not hear and could not speak. If this is the case, should the images be worshipped? If there are still people who worship him, surely that person is not using a sound mind."
		   },
		   {
			"id": 2548,
			"surah": 21,
			"ayat": 65,
			"tafsir": "This verse explains their condition after regretting their mistakes and stupidity. Then they bowed their heads and remained silent. It was at that moment that the devil again tempted them, so that their consciousness which had begun to blossom and then disappeared and they returned to their original beliefs, and wanted to defend the statues that they believed in. Therefore they then said to Ibrahim, \"Why did Abraham tell them to ask these statues, when he already knew that the statues could not speak.\" This remark is their acknowledgment that they also know that the statues cannot hear, think and speak, but they still worship and deify them."
		   },
		   {
			"id": 2549,
			"surah": 21,
			"ayat": 66,
			"tafsir": "Allah explains in this verse, that after they acknowledged that the statues could not hear, think and speak, Abraham immediately answered by saying why they worship other than Allah something that cannot benefit them in the slightest, nor can it bring harm to them. , even he could not speak and defend himself."
		   },
		   {
			"id": 2550,
			"surah": 21,
			"ayat": 67,
			"tafsir": "In this verse, it is mentioned as a continuation of what Abraham said to them, that they would be doomed along with the statues they worship besides Allah. Do they not understand the ugliness and error of their actions? That remark had caused the worshipers of the statue to be utterly cornered, and inflamed their rage 66-67. Responding to this statement, He, Ibrahim, said in front of the dignitaries of the City of Ur, Chaldea, Babylon, Southern Mesopotamia, \"Why do you all worship gods other than Allah, worship something that cannot benefit in the slightest by worshiping it, nor does it bring harm to you by not worshiping him?\" Ibrahim then confirmed his response, \"Woe to you and what you worship besides Allah in this world and in the hereafter! Have you not thought about whether you are going to continue worshiping those idols or stop?”"
		   },
		   {
			"id": 2551,
			"surah": 21,
			"ayat": 68,
			"tafsir": "In this verse it is explained that after they ran out of reason and reason to answer Abraham's words, and their anger peaked, they agreed to burn Abraham, and defend their gods, if they really wanted revenge. Thus they decided to destroy Abraham, which they saw as the best way to defend the honor of their gods, and to remove obstacles that prevented them from worshiping the images. They chose the most cruel way to destroy Ibrahim, namely by burning him in a bonfire. In this way Abraham can be eliminated, so that they can achieve victory for their pride and their gods."
		   },
		   {
			"id": 2552,
			"surah": 21,
			"ayat": 69,
			"tafsir": "This verse describes God's action to protect and help Ibrahim from the cruelty of his people, namely to burn Abraham in a blazing fire. As it is known that Allah has given certain characteristics to each of His creatures. That trait still applies to him as the Sunnah of Allah in the world. Among other things is fire, which is hot and scorching, so that even very strong metals can be melted with fire, let alone the human body. So Allah protected Abraham from the heat of the fire by revoking the heat and burning properties of the burning fire so that Abraham did not feel hot when burned and did not burn in a blazing bonfire. Allah said, \"O fire, be thou cool, and give safety to Abraham.\" With Allah's command to the fire, its nature changed from hot to cold, and did not harm Abraham until the fire was extinguished. This adds to the evidence of Allah's power that disbelievers should be aware of. In a hadith narrated by al-Bukhari from Ibn 'Abbas it is stated that when the Prophet Abraham was thrown into the fire, he read: \"Allah is sufficient (to be a helper) for us and He is the best protector.\" (Al-Bukhari history) Such is the help and protection that Allah used to give to the prophets, saints and His pious servants. Even though at that time Abraham was not yet a prophet or apostle, he was still a pious servant of Allah. It should be remembered that the Prophet Muhammad also experienced plots from the Quraysh infidels who tried to destroy him, as happened before and after the migration. However, even though they had made a neat plan to achieve a certain purpose, the implementation did not bring the results they expected, because Allah has given His help and protection to His Messenger, as the implementation of His promise: And Allah keeps you from (disturbances) of humans. (al-Ma'idah\/5: 67)"
		   },
		   {
			"id": 2553,
			"surah": 21,
			"ayat": 70,
			"tafsir": "Allah confirms in this verse that the plot carried out by the polytheists against the prophets to destroy them had the opposite effect, namely causing them to become the people who were the most losers. With those words and deeds, they wanted to extinguish the light of truth conveyed by Ibrahim, by lighting a bonfire to destroy it. But in the end it was the fire they lit that went out without leaving any marks on Ibrahim as, thanks to the protection of Allah Almighty. This shows clearly the falsehood of their beliefs, and the evil of the means by which they achieve victory. On the other hand, Ibrahim was on the right side, because he conveyed Allah's instructions to eradicate evil and tyranny."
		   },
		   {
			"id": 2554,
			"surah": 21,
			"ayat": 71,
			"tafsir": "In this verse it is explained that Allah completed His mercy to Abraham. Allah has saved him from the flames. In history it is explained that Allah has saved him from the crimes of the inhabitants of the city of Ur in South Mesopotamia, namely his country of origin, then he migrated to the country of Harran, then to Palestine in the Sham area. In this verse it is stated that the land of Sham is a land that Allah has given many blessings to all people. So that the country is very fertile, lots of water and plants, thus providing many benefits for its inhabitants. Apart from that, this country is also the birthplace of the prophets who brought light of guidance to mankind. Baitul Makdis which is located in Palestine also includes the Sham area, and is the first Qibla for Muslims. In this verse it is explained that the Prophet Lut also emigrated together to the land of Syria. According to historical information, Prophet Lut was the son of Abraham's brother"
		   },
		   {
			"id": 2555,
			"surah": 21,
			"ayat": 72,
			"tafsir": "In this verse Allah mentions another of His blessings to Abraham as in addition to His past blessings, namely that Allah has bestowed a son, namely Isaac, while Jacob is the son of Isaac, so as the grandson of Abraham who gave birth to the children of the Children of Israel. Besides that, Ibrahim also had another son, namely Ismail, from Siti Hajar. Allah has made all of them, namely Abraham, Ishmael, Isaac and Jacob as prophets and pious people."
		   },
		   {
			"id": 2556,
			"surah": 21,
			"ayat": 73,
			"tafsir": "Allah mentions in this verse additional His gifts to Abraham, in addition to the gifts explained in the previous verse, namely that Abraham's descendants were not only pious people, but also became priests or leaders of the people who invited people to accept and carry out religion of Allah, and invites to good and useful deeds, based on Allah's commands and permission. Prophet Ibrahim who was given the title \"Khalilullah\" (God's lover) was also the father of several prophets because many of the prophets who came after him were from his descendants, up to the last Prophet and Messenger, namely Muhammad saw, including the grandchildren of Abraham as through the Prophet Ismail. They receive Allah's revelation which contains teachings and instructions towards various virtues, especially obeying Allah's commands and leaving His prohibitions. In addition, Allah also revealed to them to establish prayers and pay zakat. Allah specifically mentions these two types of worship, because prayer worship has the privilege of being a physical worship as well as a means of strengthening the servant's relationship with his Lord, while zakat has the privilege of being the most important property worship which strengthens relationships with fellow servants, especially when one remembers that property is very important position in human life. Although these two types of worship must be complemented by other forms of worship, they reflect the two main characteristics of human beings, namely obedience to God and compassion for fellow human beings. Finally, at the end of this verse, Allah explains that the descendants of the Prophet Abraham are those who worship Allah solely with great devotion and humility."
		   },
		   {
			"id": 2557,
			"surah": 21,
			"ayat": 74,
			"tafsir": "In this verse Allah explains three kinds of graces that were bestowed on Prophet Lut: First, Prophet Lut has been given wisdom and wisdom to give decisions or punishments, so that with that he can provide good resolutions and decisions in matters that occur among his people. . Second, he is also gifted with very useful knowledge, especially religious knowledge, so that he can know and properly carry out his obligations to Allah and to his fellow creatures. These two conditions are very important for people who will be sent by Allah as His Prophets and Messengers. Third, God saved him when the country where he lived, namely Sodom, was stricken by God's punishment because its inhabitants openly committed crimes and abominations. The heinous acts they carried out included having sex between men (homosex), disrupting commercial traffic by robbing trade goods, disobeying Lut and not heeding God's threats and so on. So the city of Sodom was destroyed by God. Prophet Lut and his family were saved by Allah except for his wife who also disobeyed Allah. At the end of this verse, Allah explains why the people of Lut did such evil and heinous acts, namely because they had become evil and wicked people, had not heeded Allah's laws, and liked to do forbidden things, so they wallowing in sinful acts and obscene remarks which they all do openly, without shame."
		   },
		   {
			"id": 2558,
			"surah": 21,
			"ayat": 75,
			"tafsir": "Allah describes in this verse His mercy to Prophet Lut (as), by including him in the environment of His mercy. The point is that the Prophet Lut was among those who were loved and loved by Allah, so that he became one of the inhabitants of His heaven. Allah said to heaven, \"You are My mercy, with you I will bless the people I want among My servants.\" (Al-Bukhari) Finally, at the end of this verse, Allah explains why he bestowed such great mercy on the Prophet Lut, namely because he was included in the group of pious servants of Allah who always obeyed Allah's orders and prohibitions."
		   },
		   {
			"id": 2559,
			"surah": 21,
			"ayat": 76,
			"tafsir": "With this verse, Allah reminds the Prophet and the Muslims to the story of Prophet Noah as, who is called the second father of mankind. Long before Prophet Muhammad, even before Prophet Abraham and Lut, Prophet Noah was sent by Allah as His Messenger. Because of the extreme disobedience of his people, so that they did not care about his appeal to Allah's religion, he finally prayed to God: And Noah said, \"O my Lord, do not let anyone among the disbelievers live on earth. (Noah\/ 71: 26) And his prayer again: \"Indeed I have been defeated, so help (me).\" (al-Qamar \/ 54: 10) However, these prayers were said after 950 years he carried out his da'wah, but his people still denied and ignores his appeal to Allah's religion. According to history, Prophet Noah as was sent by Allah to be His Messenger at that time he was 40 years old. After the occurrence of Allah's punishment in the form of a typhoon and a great flood Prophet Noah was still alive for 40 years. it is estimated that he is ± 1050 years old.In this verse Allah explains that after Noah as said these prayers, Allah granted him, namely by causing a very terrible flood, so that the sea water overflowed high and destroy the land with the unbelievers. As for Prophet Noah and his family except his wife and children who were disobedient, as well as his people who believed, Allah had saved him from this terrible catastrophe, namely by means of a large boat that was built by Prophet Noah before the flood occurred at the command and guidance of Allah."
		   },
		   {
			"id": 2560,
			"surah": 21,
			"ayat": 77,
			"tafsir": "This verse confirms that Allah has sent down help to Prophet Noah and his believing followers against the crimes of those who have denied His verses, and did not accept the evidence and information conveyed by His Messenger. At the end of this verse Allah explains the reasons why He helped Prophet Noah so that the disbelievers were destroyed by a terrible punishment because of the crimes of their people such as shirk, both their words and deeds. Disobeying Allah, and disobeying His commandments was the evil deed of his people from generation to generation. So they should receive a reward from Allah. The stories told in the Qur'an should be a lesson for mankind, after the Prophet Muhammad was sent to all mankind. Allah said: So take (the incident) as a lesson, O people who have views! (al-Hashr\/59: 2)"
		   },
		   {
			"id": 2561,
			"surah": 21,
			"ayat": 78,
			"tafsir": "In this verse Allah explains the situation of David and Solomon when they made a decision in a matter that happened among their people. In a history of Ibn Abbas quoted from the commentary of Ibn Kashir it is stated that a group of sheep damaged a farmer's crop at night, then a dispute arose between the owner of the plant and the owner of the sheep, and then they came to David as to ask for trial. After conducting an inspection, Daud as gave the decision that the sheep should be handed over to the owner of the plant, because it was judged that the price was the same as the value of the plant he destroyed. Sulaiman a.s., who also heard the verdict, had a different opinion, which was more correct and fairer. Then Prophet Sulayman said in the assembly that \"It is better if the sheep are handed over first to the owner of the plants so that he can benefit from the milk, oil and wool, while the garden is handed over to the owner of the sheep to cultivate himself. When the plants return to their state like before being damaged by the sheep, the garden is handed over to the owner, the sheep are also returned to the owner.\" Sulaiman's opinion is clearly more appropriate, because in the end each of the two parties to the litigation will get his property back in one piece. The difference in views between father and son in making a decision on the matter is that David (as) focused more on the value of the damage to the plants, which he saw as the value of the sheep that damaged it, and he decided that the sheep should be fully handed over to the owner of the plants. While Sulaiman (a.s.) focused his views on the benefits of the sheep and the benefits of the plant, so he made such a decision. However, each of them based their decision on ijtihad, not on revelation, so that two different decisions were born. Furthermore, the Prophet David also acknowledged that his son's opinion was more correct, so that was what he later determined as his decision, and canceled his original opinion. At the end of this verse Allah explains that He witnessed and knew what David and Solomon had done in examining and deciding the matter, so that nothing was hidden from Him."
		   },
		   {
			"id": 2562,
			"surah": 21,
			"ayat": 79,
			"tafsir": "At the beginning of this verse Allah confirms that He has bestowed upon Solomon a higher ability to understand various matters. This is indeed evident in the decision they gave to each party in a case that occurred between the owner of the sheep and the owner of the plant as mentioned above, where the decision given by Solomon was deemed more appropriate, and more fulfilling of justice. After mentioning this, Allah explained further the grace that He had bestowed upon them both, namely laws and knowledge, both regarding religion and worldly matters. Grace like that was also given by Allah to His other prophets, because it is a basic requirement to become a Prophet. Furthermore, in this verse, Allah explains the special favor He bestowed upon the Prophet David, namely: that Allah has made the mountains and birds subject to David, all of them glorify with him. At the end of this verse Allah confirms that He has the power to give gifts of this kind to His servants, because He is the Creator and Owner of all this world."
		   },
		   {
			"id": 2563,
			"surah": 21,
			"ayat": 80,
			"tafsir": "In this verse Allah mentions another gift, which he gave to David as, namely that David had been given knowledge and skills in the cleverness of making soft iron in his hands without being heated, because of this privilege David could make armor that was used by people at that time. It is self-protection in war. This intelligence was also used by people who came later for centuries. Thus the knowledge and skills bestowed by Allah on the Prophet Dawud have been widely disseminated and beneficial to people from other nations. In addition to being a miracle of the Prophet David. Therefore, at the end of this verse Allah asks the people of the Prophet Muhammad, are they also grateful for this gift? Of course, all people who believe in Him, are always grateful for all the gifts He has bestowed."
		   },
		   {
			"id": 2564,
			"surah": 21,
			"ayat": 81,
			"tafsir": "In this verse Allah begins to mention His special favor bestowed upon Prophet Sulaiman as, namely that He has subdued the wind for Sulaiman as, so that the wind obediently does what it is commanded. For example, the wind blows towards a certain country, blowing hard and fast or soft and slow, according to the will of Prophet Sulayman as. Allah said: Then We subjected him to a wind that blows well according to his orders wherever he wishes. (shad\/38: 36) In the opinion of other scholars, Sulaiman used the wind as a means of transportation that carried him from one city to another. Allah's Word: And We (submitted) the wind to Solomon, whose journey in the morning is the same as a month's journey and his journey in the evening is the same as a month's journey (as well). (Saba'\/34: 12) At the end of this verse Allah confirms that He always knows everything, so that nothing is hidden from Him."
		   },
		   {
			"id": 2565,
			"surah": 21,
			"ayat": 82,
			"tafsir": "This verse explains another mercy of Allah that He gave specifically to Prophet Sulaiman as, namely that Allah also subdued a group of devils who obediently did what Sulayman as ordered them, for example: dive into the sea to take everything they need, or doing things for Solomon's needs, such as working on buildings and so on. In this verse Allah also emphasizes that He always takes care of it so that the devil does not destroy it and does not play games in carrying out its duties."
		   },
		   {
			"id": 2566,
			"surah": 21,
			"ayat": 83,
			"tafsir": "With this verse Allah reminds His Messenger and Muslims to the story of the Prophet Ayyub as who was struck by a serious illness so he prayed for the help of his Lord to get rid of his illness, because he believed that Allah is very merciful. The opinion of other scholars says that the Prophet Ayyub in this verse only poured out his heart to Allah while glorifying the greatness of Allah, the Most Gracious and Merciful. Although different narrations were obtained about the Prophet Ayyub, both regarding his personality, his lifetime and the type of illness he suffered, there are things that can be ascertained about him, namely that he was a pious servant of Allah, had received trials from Allah, both about his possessions, family, and children, as well as the trials that befell him. And his illness is serious. Even so, he faced all these trials with patience and resignation and asked for help from Allah and did not diminish his faith and worship of Allah in the least."
		   },
		   {
			"id": 2567,
			"surah": 21,
			"ayat": 84,
			"tafsir": "Therefore, in this verse Allah answered his prayer and healed him of the disease, and gave him more grace than what he had lost from his hands, and then Allah made him a prophet. After the Prophet Ayyub recovered from his illness he lived with his family again, and his family also multiplied prolifically, so that their number doubled from their original number. All of this is Allah's mercy to him, for his faith, patience, piety and piety, the Qur'an reveals this story to be a warning and lesson for all those who believe and worship Allah, that: a. Allah gives mercy and help to His servants who are believers, pious, pious and patient. b. Believers are not spared from trials, heavy or light, as a test for them. c. A believer should not despair of the mercy of his Lord. The higher the position and responsibility of man, the more severe the trials he receives. In this connection the Messenger of Allah said: \"Sa'ad bin Abi Waqash asked the Messenger of Allah, \"Who is the person with the most severe trials, the Messenger of Allah replied, The person with the most severe trials are the prophets, people who resemble the prophets, then who resemble them.\" (History of Ibn Majah from Sa'ad bin Abi Waqash)"
		   },
		   {
			"id": 2568,
			"surah": 21,
			"ayat": 85,
			"tafsir": "Allah warned the Prophet and the Muslims to the story of the Prophet Ismail, Idris and Zulkifli, all of whom were also patient in facing the calamities that befell themselves. Thanks to their patience and piety, Allah bestows His mercy and grace upon them. Prophet Ismail as, the son of Prophet Ibrahim from his wife Siti Hajar, has proven his patience when he was about to be slaughtered by his father as a sacrifice at the behest of Allah. He was also patient and tenacious for living in a barren and arid region, after his father placed him with his mother in Mecca, in the middle of the arid Arabian peninsula. Then he also patiently carried out the tough task of building the Kaaba and Baitullah with his father. So Allah gave high honor and glory to the Prophet Ismail, namely by appointing one of his descendants to become the last Prophet and Messenger of Allah, namely Muhammad saw. As for Prophet Idris, he was also a pious and patient man. He was sent as an Apostle after Prophet Syis and Prophet Adam as. Many people say that Prophet Idris was originally good at sewing clothes, and at first wore sewn clothes, while people who previously only wore clothes made of animal skins and not sewn. In addition, he was also the first person to make and use firearms as equipment. The story of Prophet Idris is found in surahh Maryam. (Maryam\/19: 56-57) Regarding Zulkifli, in the opinion of most commentators, he was also a prophet, and the son of the Prophet Ayyub as Allah sent him to be a prophet after his father. He carried out his da'wah to unite Allah both in faith and in worship. During his life he lived in the land of Sham, and was a pious and patient prophet. And he is from among the Children of Israel. At the end of this verse, Allah confirms that the Prophet Ismail, Idris and Zulkifli He has included in the environment of His mercy, and placed Him in Jannatuna'im heaven, as a reward for their patience and piety."
		   },
		   {
			"id": 2569,
			"surah": 21,
			"ayat": 86,
			"tafsir": "Allah warned the Prophet and the Muslims to the story of the Prophet Ismail, Idris and Zulkifli, all of whom were also patient in facing the calamities that befell themselves. Thanks to their patience and piety, Allah bestows His mercy and grace upon them. Prophet Ismail as, the son of Prophet Ibrahim from his wife Siti Hajar, has proven his patience when he was about to be slaughtered by his father as a sacrifice at the behest of Allah. He was also patient and tenacious for living in a barren and arid region, after his father placed him with his mother in Mecca, in the middle of the arid Arabian peninsula. Then he also patiently carried out the tough task of building the Kaaba and Baitullah with his father. So Allah gave high honor and glory to the Prophet Ismail, namely by appointing one of his descendants to become the last Prophet and Messenger of Allah, namely Muhammad saw. As for Prophet Idris, he was also a pious and patient man. He was sent as an Apostle after Prophet Syis and Prophet Adam as. Many people say that Prophet Idris was originally good at sewing clothes, and at first wore sewn clothes, while people who previously only wore clothes made of animal skins and not sewn. In addition, he was also the first person to make and use firearms as equipment. The story of Prophet Idris is found in surahh Maryam. (Maryam\/19: 56-57) Regarding Zulkifli, in the opinion of most commentators, he was also a prophet, and the son of the Prophet Ayyub as Allah sent him to be a prophet after his father. He carried out his da'wah to unite Allah both in faith and in worship. During his life he lived in the land of Sham, and was a pious and patient prophet. And he is from among the Children of Israel. At the end of this verse, Allah confirms that the Prophet Ismail, Idris and Zulkifli He has included in the environment of His mercy, and placed Him in Jannatuna'im heaven, as a reward for their patience and piety."
		   },
		   {
			"id": 2570,
			"surah": 21,
			"ayat": 87,
			"tafsir": "In this verse Allah reminds His Messenger and all Muslims, to the story of the Prophet Jonah, who at the beginning of this verse is mentioned by the name \"dzun Nun\". dzu means \"one who has\", while an-Nun means \"big fish\". So dzu an-Nun means \"The owner of the big fish\". He was named so, because once upon a time he was dropped into the sea and swallowed by a big fish. Then, because of Allah's help, he was able to get out of the fish's stomach safely and in one piece. It should be remembered that the story of the Prophet Jonah in the Qur'an is found in two surahhs, namely surahh al-Anbiya' and surahh shad. If we compare the verses contained in the two surahhs which contain the story of the Prophet Yunus, there are several similarities, for example in the expressions which read: How many people before them We destroyed, then they asked for help even though (at that time) ) is not the time to run away. (shad\/38: 3) This expression is found in this surahh al-Anbiya', and is also found in the verse of surahh shad. Also pay attention to al-Anbiya'\/21:11 and Yunus\/10: 13. In this verse Allah says, reminding people of the story of the Prophet Jonah, when he left in a state of anger. What is meant is that at one time the Prophet Yunus was very angry with his people, because they did not also believe in Allah. He has been sent by Allah as His Messenger to deliver an appeal to his people, to invite them to Allah's religion. But only a few of them believe, while most of them are still disbelievers and disobedient. Such circumstances made him angry, then went to the seashore, distanced himself from his people. This story gives the impression that the Prophet Yunus could not be patient and patient in dealing with his people. But that's how it was, he was one of the narrow-chested prophets. Indeed, of the many Prophets and Apostles sent by Allah, only five people were called \"Ulul Azmi\", namely apostles who were very patient and tenacious. They are the Prophets Abraham, Moses, Jesus, Noah and Muhammad saw. On the other hand, even though they are ma'shum from grave sins and disgraceful qualities, at certain moments their chests are tight against people who deny and disobey Allah. However, even though the Prophet Yunus was once angry with his people, his anger was understandable, because he was very sincere towards them, and really wanted them to gain happiness in the world and the hereafter by practicing the religion of Allah that he conveyed to them. But it turns out that most of them are still rebellious and disobedient. This was what hurt him, and inflamed his anger. The Prophet Muhammad himself, even though he was included in the ulul 'azmi, but Allah warned him several times not to get angry and narrow-minded towards his people who disbelieved. Allah says in another verse: So be patient with you (Muhammad) against the decree of your Lord, and do not be like (Yunus) the one who is in the (stomach) of the fish. (al-Qalam\/68: 48) His words again to the Prophet Muhammad saw: Then perhaps you (Muhammad) want to leave some of what was revealed to you and your chest is tight because of it. (Hud\/11: 12) In short, the anger that was found in the Prophet Jonah did not arise from a bad character, but because of his resentment at the denial of his people, which he originally expected to accept and carry out the religion of Allah that he conveyed. Furthermore, in this verse Allah explains the mistake of the Prophet Yunus where his anger gave the impression that it was as if he thought that as a Prophet and Messenger Allah would never be allowed to face difficulties, so that the path he walked would always be beautiful without obstacles. But in reality this is not the case. In general, the apostles and prophets encountered many obstacles, even torture and ridicule from those who denied them. It's just that in a very serious situation, whether requested or not by the person concerned, Allah brings His help, so that His Messenger is saved and his people who deny it suffer destruction. According to a history quoted by Ibn Kashir, that when the Prophet Yunus was angry, he then distanced himself from his people and went to the beach. There he encountered a boat, then he joined the boat with a somber face. When the boat was about to set sail, a big wave came which caused the boat to be threatened with sinking if the load was not immediately reduced. So the captain of the boat said, \"Sinking someone is better than sinking us all.\" Then lots were drawn to determine which of them should be removed from the boat. After being drawn, it turned out that it was the Prophet Yunus who had to be expelled. However, the ship's passengers objected to removing him from the boat. Then the draw is done once again, but the result remains the same. Even the third draw was the same. Finally Jonah took off his clothes, then he plunged into the sea of his own accord. God sent a large fish that swam quickly and swallowed Jonah. In this verse further Allah explains that after the Prophet Jonah was in three levels of \"different darkness\", he prayed to Allah, \"There is no god but You, Glory be to You, indeed I am one of the wrongdoers.\" What is meant by three different darknesses here is that the Prophet Jonah was in the belly of a dark fish, in a deep and dark sea, and on a pitch black night too. Prophet Jonah's acknowledgment that he \"is among the unjust people\", means that he is aware of the mistakes he has made as a Prophet and Messenger, namely being impatient and not being tolerant of his people, he should be patient until he waits for Allah's decree to come for his people who disobey That. Because of that awareness, he begged Allah for forgiveness, and asked for His help to save himself from that calamity."
		   },
		   {
			"id": 2571,
			"surah": 21,
			"ayat": 88,
			"tafsir": "This verse explains that God granted the Prophet Jonah's prayer, then saved him from extreme sorrow. Grief because of guilt, sorrow because of the denial of his people, and sorrow because of the calamity that befell him. At the end of this verse, Allah confirms that in this way He saved them from worldly punishment and bestowed upon them the happiness of the hereafter. This is explained by Allah in His word in another verse: So why is there no (inhabitant) of a country who believes, then his faith is beneficial to him besides the people of Jonah? When they (Jonah's people) believed, We removed from them the humiliating punishment in the life of this world, and We gave them pleasure for a certain time. (Yunus\/10: 98) In accordance with the story of Jonah, the Prophet taught his people who were experiencing difficulties to pray like the prayer of the Prophet Jonah. Mus'ab bin Umair narrated from Rasulullah SAW saying: Whoever prays with the prayer of the Prophet Jonah, it will be granted. (History of at-Tirmidhi)"
		   },
		   {
			"id": 2572,
			"surah": 21,
			"ayat": 89,
			"tafsir": "In this verse Allah directs the attention of the Prophet Muhammad and his people to the story of the Prophet Zakaria. Because he had no children, he felt lonely and had no offspring to replace and continue his struggle when he died. Therefore he prayed to Allah that He would not let him live without offspring. At the end of this verse, the words of the Prophet Zakaria are mentioned after he said his prayer. Then he said, \"And you are the best heir?\" The point is that if Allah wills not to bestow offspring upon him, then he is also willing and not discouraged, because he believes that Allah will continue to protect his religion, and will not waste his religion and Allah will certainly choose the most appropriate person as a substitute for Zakaria. after his death. This story has been discussed more extensively in surahh Ali 'Imran and surahh Maryam."
		   },
		   {
			"id": 2573,
			"surah": 21,
			"ayat": 90,
			"tafsir": "This verse explains that God has accepted the prayer of the Prophet Zakaria, and bestowed upon him a son named Yahya. For this reason, Allah has bestowed good health on Zachariah's wife, making it possible for her to conceive, even though before that she was a barren woman. In the continuation of this verse, Allah explains what His reason is for granting Zachariah's request, that is because they all always hasten to do good, especially in caring for offspring as well as possible. Besides that, because you always pray to Allah with a heart that is anxious, hoping for God's forgiveness and worrying about God's wrath and punishment. And the third reason is because they are always humble and humble towards Him, and are never arrogant or arrogant and deny His gifts. So, it is these noble qualities that cause them to receive gifts from God."
		   },
		   {
			"id": 2574,
			"surah": 21,
			"ayat": 91,
			"tafsir": "In this verse Allah explains Maryam's story briefly, namely that she is a woman who maintains her honor, so one day Allah sent the angel Jibril to tell Maryam that Allah breathed a spirit into Maryam's body so that she became pregnant, then Maryam gave birth to Jesus as without a father . Because Isa was born without a father, Maryam and Isa then became one of the proofs for all of nature, about Allah's power and omnipotence. The birth of Isa contains evidence and a sign of Allah's power as was the case with Prophet Adam who was born into the world without a father and mother, while Isa was born without a father only. The thing that surprised me was that Maryam had never had any kind of relationship with men, either legally through marriage, let alone illegally. Allah mentions Maryam's words about herself as follows: No one (man) has ever touched me and I am not an adulterer!\" (Maryam\/19: 20) Allah's word in another verse; And Maryam the daughter of Imran who maintains her honor. ( at-Tahrim\/66: 12) Maryam's astonishment that was conveyed to the Angel Gabriel was answered by the word of Allah: He (Gabriel) said, \"Thus.\" Your Lord said, \"That is easy for Me. (Maryam\/19: 21) The signs of God's greatness and power that were shown to Maryam were that she was pregnant without having sex with anyone, and angels always prepared food for her. Regarding this matter, the Qur'an narrates Zakaria's question to Maryam and Maryam's answer to him: \"O Maryam! Where did you get this?\" She (Maryam) replied, \"It is from Allah.\" (Ali 'Imran\/3: 37) As for the signs of the greatness and omnipotence of Allah that were seen through Jesus as, they have been explained at length in surahh Ali 'Imran and surahh Maryam."
		   },
		   {
			"id": 2575,
			"surah": 21,
			"ayat": 92,
			"tafsir": "In this verse it is emphasized that the religion of monotheism is a religion for all human beings, and is one religion, namely the same in aqidah, even though it differs in sharia. The Prophet said, \"We prophets are like brothers and sisters, our religion is one.\" (History of al-Bukhari, Muslim, Abu Daud and Ahmad from Abu Hurairah.) Then at the end of this verse it is emphasized that Allah is God for all mankind. Therefore it is Him alone that they should worship."
		   },
		   {
			"id": 2576,
			"surah": 21,
			"ayat": 93,
			"tafsir": "In this verse Allah warns the Muslims against the divisions that have arisen among mankind. All mankind should adhere to the religion of monotheism, because the religion revealed by Allah is one, namely the religion of monotheism (the religion of Islam). However, they have been divided, so that their unity is divided into small compartments which are strictly separated by different views, both regarding non-principled issues in religion and purely worldly matters. These differences in understanding are generally accompanied by taklid towards the imam or leader so that one group closes itself to the other group. Thus they have neglected the teachings of religion, which ordered them to unite and maintain the unity of the people. But they did the opposite, namely split. At the end of this verse it is emphasized that humanity, which has been divided, will all return to Him as well. Then Allah will do the reckoning and reward them for their respective faith and deeds."
		   },
		   {
			"id": 2577,
			"surah": 21,
			"ayat": 94,
			"tafsir": "In this verse Allah guarantees that the good deeds done by someone who believes, no matter how small, Allah will reward them with good too. Good deeds will not be lost in vain, and will not be denied because Allah has written them for those who do them. Allah's guarantee to repay every virtue of His servant is contained in His word: And whoever desires the hereafter and strives towards it earnestly, while he believes, then those are the people whose efforts are well rewarded. (al-Isra'\/17: 19) His word again in another verse: Indeed, those who believe and do good deeds, We really will not waste the reward of those who do good deeds. (al-Kahf\/18: 30)"
		   },
		   {
			"id": 2578,
			"surah": 21,
			"ayat": 95,
			"tafsir": "In this verse it is explained that it is impossible for the inhabitants of a country that has been destroyed by His punishment, that they will not return to Him. That is, those people who disbelieve and disbelieve, even though they have been destroyed with a severe punishment in this world, they will definitely return to Allah in the hereafter, then all their deeds will be accounted for, and they will be rewarded accordingly."
		   },
		   {
			"id": 2579,
			"surah": 21,
			"ayat": 96,
			"tafsir": "In this verse Allah explains that the disbelievers have been destroyed with a severe punishment in this world, so that they will meet with destruction, they will not return to the world, they will remain in destruction until the Day of Resurrection. As one of the signs of the coming of the Day of Judgment is the opening of the walls of Gog and Magjuj, so that Gog and Magjuj arrive, gliding swiftly from every high place. They create confusion and destruction in the world."
		   },
		   {
			"id": 2580,
			"surah": 21,
			"ayat": 97,
			"tafsir": "In this verse it is emphasized that at the time when Gog and Magog came out, and when the time for the arrival of the true promise, namely the day of resurrection and reckoning, was approaching, the eyes of the disbelievers immediately widened in shock, while shouting with regret, \"Oh! Woe to us, we were completely negligent about the coming of the Day of Resurrection and Reckoning, so we did not prepare ourselves properly. In fact, we are those who are unjust to ourselves and to others, because we have been warned that the Day of Resurrection and the reckoning will really come, but we did not heed the warning, we even denied it. However, no matter how they regretted themselves at that time, the regret was no longer useful, because the time of resurrection and reckoning had really come, while they don't believe a bit."
		   },
		   {
			"id": 2581,
			"surah": 21,
			"ayat": 98,
			"tafsir": "This verse confirms to the Meccan polytheists that they and what they worship besides Allah, as long as they live in the world, such as statues, animals, inanimate objects, trees or sacred places and so on will be put into the Hellfire of Jahannam. This is God's promise to them, which He must keep. In this verse it is stated that the polytheists and their idols will be put into hell, even though those who sin and associate God in this matter are their worshippers. As for the offerings, they do not know what their worshippers are doing. The wisdom of including these idols and their worshipers is to show them that their belief in those gods while on earth was not true. They used to believe in the world that the statues and everything they worshiped would intercede for them on the Day of Resurrection, so they would be spared from Allah's punishment. With the intermediary of these offerings they will be entered into heaven. After the Day of Judgment comes and after they enter Hell together with the idols they worship, it turns out that the idols cannot do anything to them. Thus it was proven that their beliefs were wrong and the truth of the message that Muhammad had conveyed to them."
		   },
		   {
			"id": 2582,
			"surah": 21,
			"ayat": 99,
			"tafsir": "This verse explains that if the idols worshiped by the polytheists were true gods besides Allah as they believe, then the idols would surely be safe with them, because if he were a god he would surely be almighty and mighty, nothing can torture him. , even he himself will torture those who are disobedient to him. But what happens is that all of them, both the idol worshipers, as well as the idols that are worshiped, will eternally be in hell."
		   },
		   {
			"id": 2583,
			"surah": 21,
			"ayat": 100,
			"tafsir": "Then Allah explains the condition of the idol worshipers and their sacrifices in hell, namely: 1. They in hell groan and groan and their breath becomes short of breath bearing the unspeakable punishment. So as for those who are miserable, then (its place) is in hell, there they exhale and inhale with a groan. (Hud\/11:106) 2. The idol worshipers who are being punished cannot know the condition of their other friends who are also being punished, because they do not have time to think about it, each of them is busy facing the punishment that always befalls them."
		   },
		   {
			"id": 2584,
			"surah": 21,
			"ayat": 101,
			"tafsir": "This verse explains the condition of those who believe and do good deeds and those whom Allah has given the knowledge to obey Him, that they will not be put into hell, and they will not even be brought closer to it. It was narrated by al-Hakim from Ibn Abbas, that when verse 98 was revealed, the Quraysh polytheists felt devastated by it. They said, \"Muhammad has cursed our gods. Then they went to Ibn az-Ziba'ra and told him about the verse that was revealed, he replied, \"If I confront Muhammad, of course I can refute it.\" The people the polytheist of Quraysh said, \"What are you saying.\" He replied, \"I told him, \"Al-Masih is worshiped by the Christians, 'Uzair is worshiped by the Jews, will Al-Masih and 'Uzair be fuel for the fires of hell?\" ? The people of Quraysh were interested in hearing Ibn az-Ziba'ra's words and felt they had defeated Muhammad. So verses 99 to 101 of this surahh were revealed, which confirms verse 98 above. With the revelation of these verses Ibn az-Ziba'ra silence and doubt the hearts of polytheists. But because of their envy of the Prophet Muhammad and the Muslims, they are still in their polytheism."
		   },
		   {
			"id": 2585,
			"surah": 21,
			"ayat": 102,
			"tafsir": "Allah describes the condition of the inhabitants of heaven, namely: 1. They do not hear the sound of the hell fire caused by the turmoil of the fire and the sound of burning things that are being burned. 2. They were in unceasing pleasure and joy, enjoying whatever they wanted, hearing whatever pleased their heart and seeing what pleased their eyes. 3. They are not worried about the sound of the last trumpet, which is the sound of the trumpet which signifies the resurrection of humans from the graves to be given account, Allah says: And the trumpet is blown, then all (creatures) in the heavens and on earth die except those whom Allah wills. Then it is blown once again (the trumpet) so immediately they wake up (from their graves) waiting (God's decision). (az-Zumar\/39: 68) 4. They were greeted by the angels by conveying the good news of their victory. It was as if an angel was telling them, \"This is the day that Allah promised you, O you who believed while in the world before, at this time Allah bestows great rewards and eternal pleasure in return for your faith, obedience and purity of sinful acts by doing good deeds and by carrying out all of Allah's commandments and avoiding all that He has forbidden.\""
		   },
		   {
			"id": 2586,
			"surah": 21,
			"ayat": 103,
			"tafsir": "Allah describes the condition of the inhabitants of heaven, namely: 1. They do not hear the sound of the hell fire caused by the turmoil of the fire and the sound of burning things that are being burned. 2. They were in unceasing pleasure and joy, enjoying whatever they wanted, hearing whatever pleased their heart and seeing what pleased their eyes. 3. They are not worried about the sound of the last trumpet, which is the sound of the trumpet which signifies the resurrection of humans from the graves to be given account, Allah says: And the trumpet is blown, then all (creatures) in the heavens and on earth die except those whom Allah wills. Then it is blown once again (the trumpet) so immediately they wake up (from their graves) waiting (God's decision). (az-Zumar\/39: 68) 4. They were greeted by the angels by conveying the good news of their victory. It was as if an angel was telling them, \"This is the day that Allah promised you, O you who believed while in the world before, at this time Allah bestows great rewards and eternal pleasure in return for your faith, obedience and purity of sinful acts by doing good deeds and by carrying out all of Allah's commandments and avoiding all that He has forbidden.\""
		   },
		   {
			"id": 2587,
			"surah": 21,
			"ayat": 104,
			"tafsir": "Those who are welcomed by the angels are not afraid and surprised by the coming of the Day of Judgment, when the sky is folded and replaced with another sky, as if the old sky is folded to be kept and a new sky is developed. Allah says: And they do not exalt Allah as it should be even though the earth is entirely in His grip on the Day of Judgment and the heavens are rolled up with His right hand. Glory be to Him and Exalted is He from what they associate with. (az-Zumar\/39: 67) Thus Allah resurrects people after they die and are in the grave, to be collected in the desert of mahsyar, so that their deeds can be accounted for. Resurrecting humans after they die and crumble to the ground is easy for Allah. If Allah created man from nothing to exist, of course, repeating creating him again is easier than creating the first time. Resurrecting humans to be brought to account is a promise from God that He will definitely keep. Scientifically, as explained in verse 30 of this surah, the creation of the universe started from nothing (a singularity state: infinitely large mass, infinitely small volume) which then exploded violently and then formed a universe that continues to expand to this day. Evidence of an expanding universe can be found in observations with telescopes, which show that as time passes, the distances between the heavenly bodies are getting further away. Scientists say that the universe will continue to expand until it reaches the critical mass of the universe. If this critical mass has been reached, then the attractive force (gravity) between the masses of various celestial bodies will hold back the expansion process of the universe. It will even reach a state of contraction of the universe. The universe which was originally expanding will shrink (contract) and will one day be destroyed and return to its initial state (singularity); This situation is called the Day of Judgment. The Day of Judgment in this verse is described as the day when Allah will \"roll up the heavens\", like rolling up sheets of paper, just like the first beginning of creation. The term \"rolling up the sky\" is an appropriate expression, because in fact the universe is not round but flat consisting of trillions of galaxies that form a \"coil\"."
		   },
		   {
			"id": 2588,
			"surah": 21,
			"ayat": 105,
			"tafsir": "This verse explains that Allah has sent down books to the Apostles, such as the Torah, Zabur, Bible and Al-Qur'an. In the books it is explained that this earth belongs to Allah, it is inherited to whoever He wills. Allah has also stipulated in this verse, that the servants who inherit the earth are servants who are able to cultivate the earth and prosper it, as long as they follow Allah's instructions. If we pay attention to the history of the world and the history of mankind, the people whom God made as rulers on this earth are people who are able to regulate and lead society, cultivate this earth for the benefit of mankind, are able to defend themselves from outside attacks and can strengthen the unity of the people in the country. Allah's giving of power to these people does not mean that Allah has approved of their actions; because worldly life is different from ukhrawi life. There are people who are happy living in the afterlife alone, and there are also those who are happy living in the world only. Meanwhile, what a Muslim aspires to is a happy life in this world and in the hereafter. If Muslims want to live happily in this world and the hereafter, they must follow the Sunnatullah above, namely being obedient to worship Allah, being able to lead mankind well, being able to cultivate this earth for the benefit of mankind, fostering strong unity and oneness among them so that not easily broken by the enemy. The interpreters differed in interpreting the word \"earth\" in this verse, including: a. Some commentators interpret \"earth\" in this verse with \"heaven\". Because \"heaven\" is inherited by Allah to His servants who believe and do good deeds. Allah's Word: And they said, \"Praise be to Allah who has fulfilled His promise to us and has given us this place while we (are allowed) to occupy heaven wherever we want.\" Then (heaven is) the best reward for those who do good deeds. (az-Zumar\/39: 74) b. Some others interpret the word \"earth\" with the earth that is now occupied by mankind. God's Word: God has promised those among you who believe and do good, that He will indeed, make them rulers in the earth. (an-Nur\/24: 55) \"Indeed the earth (this) belongs to Allah; He inherits it to whomever He wills among His servants. And the (good) end is for those who are pious.\" (al-A'raf\/7: 128) c. Some other interpreters interpret \"earth\" with the holy land inherited by the pious, says Allah: And We have left to the oppressed people the eastern and western parts of the earth that We have blessed. (al-A'raf\/7: 137)"
		   },
		   {
			"id": 2589,
			"surah": 21,
			"ayat": 106,
			"tafsir": "Allah explains that all the stories described in this surah are lessons and warnings that are conveyed from the beginning to the end of this surahh, enough to be a lesson and a lot of wisdom contained in it, as a provision and material for people who want to achieve happiness in life in this world and in the hereafter . Even the verses in this surahh are a warning and a strong threat from Allah to those who deny the call of the messengers. They will be overtaken by great calamity, as it was upon the ancient peoples. Because of that, Muslims are obliged to take lessons and practice these verses so that they are not exposed to Allah's threats in the form of terrible doom and calamity."
		   },
		   {
			"id": 2590,
			"surah": 21,
			"ayat": 107,
			"tafsir": "Allah's purpose in sending the Prophet Muhammad who brought His religion, was none other than to give instructions and warnings so that they would be happy in this world and in the hereafter. Allah's mercy for all nature includes protection, peace, compassion and so on, which Allah gives to His creatures. Both believers and non-believers, including animals and plants. If you look at human and human history, then Islam is a religion that tries its best to abolish slavery and oppression by humans against other humans. If the doors of slavery were still open, it would only be to offset the actions of the disbelievers against the Muslims. Meanwhile, ways to abolish slavery were provided, either by giving large rewards to people who freed slaves or by associating expiation\/punishment with freeing slaves. Improvements regarding the position of women, who at that time were almost equal to animals, and recognition of the position of orphans, concern for the needy and poor, orders to carry out jihad to fight ignorance and poverty, were all taught by the Qur'an and Hadith. Thus all mankind obtains grace, either directly or indirectly from the religion brought by the Prophet Muhammad. But most people still deny it even though the grace they receive is God's mercy and grace."
		   },
		   {
			"id": 2591,
			"surah": 21,
			"ayat": 108,
			"tafsir": "Allah ordered Muhammad to convey to the disbelievers and to those who had appealed to him, that the essence of the revelation conveyed to him was that there is no god who has the right to be worshiped besides Allah. Therefore, humans should worship Him, never associate Him with anything, such as admitting that there are other gods besides Him, or believing that apart from Allah there is something else that has supernatural powers like the power of Allah. And submit yourself to Allah by purifying obedience and submission to Him alone, and follow all the revelations revealed to the Prophet Muhammad."
		   },
		   {
			"id": 2592,
			"surah": 21,
			"ayat": 109,
			"tafsir": "Then Allah reminded Muhammad of his duty as an Apostle, namely only to convey Allah's religion to humans. Because of that they also don't heed your call, don't follow the revelation conveyed to them, so don't grieve, and tell them that you have shown them the straight path, to perfect happiness. If they don't want to follow and take the path that has been laid out, it means they want to receive punishment from Allah. In another verse Allah says: And if they (still) belie you (Muhammad), then say, \"For me is my work and for you is yours. You are not responsible for what I do and I am not responsible for what you do.\" (Yunus\/10: 41) If the disbelievers ask you Muhammad about when the promised punishment will be meted out, then tell them that you do not know about the time, when the punishment will be meted out, because the full authority is in the hands of Allah , and no one knows about it."
		   },
		   {
			"id": 2593,
			"surah": 21,
			"ayat": 110,
			"tafsir": "Allah is All-Knowing of everything that is said by the disbelievers about the religion of Islam, whether said openly or in a whisper, and Allah knows about the hatred of the hearts of the disbelievers towards the Muslims. Therefore He will give the appropriate recompense to such people."
		   },
		   {
			"id": 2594,
			"surah": 21,
			"ayat": 111,
			"tafsir": "Allah also ordered Muhammad to inform the disbelievers that he did not know the slightest reason why the doom had been delayed. It may be that they enjoy all worldly pleasures until the time determined by Allah, then Allah will strike down the punishment suddenly without knowing where it came from."
		   },
		   {
			"id": 2595,
			"surah": 21,
			"ayat": 112,
			"tafsir": "Because the polytheists of Mecca were increasing their tyranny day by day, Muhammad prayed to God that He would soon inflict punishment on them. Muhammad's request was granted by Allah with the defeat of the polytheists in several battles that took place between the Muslims and the polytheists. Qatadah said, \"The prophets used to pray\": O our Lord, judge between us and our people with justice (just). You are the best decision maker.\" (al-A'raf \/ 7: 89) So the Messenger of Allah was commanded by Allah to say such a prayer."
		   }
	]
}
