{
	"tafseer": [
		{
			"id": 5552,
			"surah": 75,
			"ayat": 1,
			"tafsir": "In this verse, Allah swears by the Day of Judgment. The point is that Allah states emphatically that the Day of Judgment will surely come. Therefore, humans should be prepared to face it with faith and do good deeds, because the Day of Judgment is the day of retribution for charity."
		   },
		   {
			"id": 5553,
			"surah": 75,
			"ayat": 2,
			"tafsir": "Allah also swears by a soul that is very sorry for itself (an-nafs al-lawwamah) for its attitudes and behavior in the past which did not have time to be filled with good deeds. An-Nafs al-lawwamah also means a soul that regrets itself for committing a crime, why can't it be stopped? For goodness that is aware of its benefits, why not multiply it or just multiply it? That's what an-nafs al-lawwamah said and regretted himself. The feeling of regret is always there even though he has tried hard with all his efforts to do good deeds. After all, everything will be taken into account later. An-Nafs al-lawwamah also means a soul that cannot be controlled in times of joy or sorrow. When you are happy to be extravagant and extravagant, while in difficult times you regret your fate and stay away from religion. An-Nafs al-lawwamah is actually the soul of a believer who has not reached a more perfect level. Regret is the main stronghold of a soul like this because it has passed through life on earth with imperfect goodness. It is necessary to explain here the relationship between the Day of Judgment and an-nafs al-lawwamah, which both Allah used to swear at the beginning of this surahh. The Day of Judgment will later reveal about a person's soul, whether he gets happiness or an accident. So the soul or an-nafs al-lawwamah may be included in the happy group or included in the unfortunate group. From another point of view, Allah deliberately mentions this soul that regrets itself because of the magnitude of the soul's problems from the point of view of the Qur'an. The letter \"la\" contained in verses 1 and 2 above is \"la zaidah\" which reinforces the meaning of the following words, namely the Doomsday and an-nafs al-lawwamah. Allah himself answers His oath even though the text of the verse is not mentioned. So after swearing by the Day of Judgment and an-nafs al-lawwamah, Allah confirmed, \"Indeed you will be resurrected and you will be held accountable.\" This understanding is known from the next verse."
		   },
		   {
			"id": 5554,
			"surah": 75,
			"ayat": 3,
			"tafsir": "Does man think that Allah will not collect his bones again? Does man think that his bones which have been crushed in the grave, after being scattered in separate places, Allah cannot collect them again? This verse which is expressed in a questioning tone implies that humans should think seriously about the issue of death and the existence of the Day of Resurrection."
		   },
		   {
			"id": 5555,
			"surah": 75,
			"ayat": 4,
			"tafsir": "It was narrated that verses 3 and 4 were revealed because of the actions of two people named 'Adiyy bin Abi Rabi'ah with Akhnasy bin Syuraiq. 'Adiyy once met Rasulullah SAW by asking, \"O Muhammad, please tell me when the Day of Judgment will come and what will be the condition of humans at that time?\" Rasulullah saw told what it was. 'Adiyy also replied, \"By Allah, if I saw with my own eyes that day, I also would not justify your words and I also do not believe in you and the Day of Judgment. Is it possible, O Muhammad, Allah could collect the bones again?\" human bones?\" Then came the 4th verse above which confirms the power of Allah in response to the question 'Adiyy bin Abi Rabi'ah and those who behaved like him. To dispel this doubt, Allah confirms that in fact He has the power to rearrange human fingers perfectly. Even Allah is able to collect and rebuild the broken parts of the body, even if it is the smallest part, such as fingers with so many joints and books. If Allah did not have perfect knowledge and power, it would be impossible for Allah to rearrange them. In short, as the bones and fingers are perfectly arranged, then Allah is able to restore them to their original state."
		   },
		   {
			"id": 5556,
			"surah": 75,
			"ayat": 5,
			"tafsir": "In this verse it is emphasized that actually humans with the development of their minds realize that God is able to do so, but the will of lust affects their minds. Even humans want to commit immorality continuously. In fact, there is no human being who does not know the power of his Lord to revive and assemble the bones of the dead. However, they still want to wallow in various immoral acts, then delay repentance or avoid it. In fact, people like this, according to Sa'id bin Jubair, like to hasten to do what his heart desires and do whatever he wants. Lust always teases him, \"Later I will repent; later I will do good.\" Unfortunately he has not had time to repent and do good deeds, the angel of death had already taken his life. Even though at that time, he was engrossed in immoral acts. It is also possible that the meaning of this verse is that a person always daydreams about how good it will be if he gets this and that, gets a luxury car and house or a soft position, and so on, but forgets to remember death, forgets that the day of resurrection will come, the day when checked all work. The words liyafjura mean to tend to the wrong, or like to deviate from the truth. People like this want to live freely like animals. He does not want to be prevented from doing anything by reprimanding common sense or religious prohibitions that curb his desires."
		   },
		   {
			"id": 5557,
			"surah": 75,
			"ayat": 6,
			"tafsir": "Furthermore, Allah describes the attitude of stubborn people who ask, \"When is the Day of Judgment?\" This question appears as a sign of too far reaching Doomsday in the mind of the questioner and shows disbelief in its occurrence. This has something to do with the previous verse, namely: \"Why does he always want to do evil?\" Because they deny the existence of the day of resurrection, so they don't feel the need to think about all the consequences of the crimes they have committed. In another verse, Allah says: Far away! Far away (from the truth) what is threatened to you, (that life) is nothing but our life in this world, (there) we die and live and will not be resurrected (again). (al-Mu'minun\/23: 36-37) In conclusion, there are two reasons for human disbelief in the Last Day, namely: 1. Because of doubts about Allah's power. For example, the mind believes that it is possible that parts of the body that have been destroyed, scattered, and mixed with the ground, in the east or west, can it be put together and revived? How can such a human body return to its original state? As verses 3 and 4 say: Does man think that We will not collect (back) his bones? (In fact) We were able to rearrange his fingers perfectly. (al-Qiyamah\/75: 3-4) 1. Due to the constant desire to enjoy worldly pleasures, and the coming of the Last Hour (the day of gathering and reckoning) of course breaks all forms of pleasure, as mentioned in verse 5: But humans want to make immorality continuously. (al-Qiyamah\/75: 5)"
		   },
		   {
			"id": 5558,
			"surah": 75,
			"ayat": 7,
			"tafsir": "In these verses, Allah explains three signs of the coming of the Day of Judgment, namely: 1. When your eyes widen (because of fear). At that time, the eye could not see something very powerful. In another verse, the same meaning is stated, namely: They come in haste (to fulfill the call) by raising their heads, while their eyes do not blink and their hearts are empty. (Ibrahim\/14: 43) 1. When the moon has lost its light forever, it's not like the situation during a lunar eclipse which only lasts for a moment. 1. The sun and moon are gathered. This means that the sun and moon meet each other, both rise and set at the same place, causing the dark atmosphere of this universe. Even though this situation never happened, each of them was in a predetermined position. Allah says: It is impossible for the sun to chase after the moon and the night cannot precede the day. Each circulates in its orbit. (Yasin\/36: 40) It was at that moment that disbelieving humans realized how God's promise had come true. Everyone is trying to save themselves. According to scientific studies, there are various doomsday scenarios, some in the form of grand scenarios, some \"local\" scenarios even though the impact can be universal and affect the entire universe. In the Grand Scenario, the universe system undergoes a systemic change that gets worse, even drastically, so that the universe as a system collapses and doomsday comes. The second type of scenario is \"local\", meaning it only occurs in one of the galaxies or solar systems. It is highly probable that this incident took place in the Milky Way galaxy or even in our solar system, where humans are. One of the possible scenarios is the direction of a black hole (black hole) into our solar system. If a member of our solar system, including planet Earth, is hit by a black hole, which means it will be sucked in by a very strong gravity, then everything on the surface of the earth including humans will be lifted up and then the legs will be released and finally the human body will be scattered up to six twenty four parts. Meanwhile, at the same time, the sun will be sucked in, including its nuclear energy until it runs out, while the planets of all members of our solar system and the sun will also be sucked in together, so that they will unite because of a very strong gravitational pull. It is clear that the light of the moon and of course the light source, namely the sun, will disappear. Then our entire solar system will melt, disrupting the balance of our galaxy, and the universal consequence, the balance of the Milky Way will have an impact on the position and energy balance of the universe, so that the end of the world is only a matter of time."
		   },
		   {
			"id": 5559,
			"surah": 75,
			"ayat": 8,
			"tafsir": "In these verses, Allah explains three signs of the coming of the Day of Judgment, namely: 1. When your eyes widen (because of fear). At that time, the eye could not see something very powerful. In another verse, the same meaning is stated, namely: They come in haste (to fulfill the call) by raising their heads, while their eyes do not blink and their hearts are empty. (Ibrahim\/14: 43) 1. When the moon has lost its light forever, it's not like the situation during a lunar eclipse which only lasts for a moment. 1. The sun and moon are gathered. This means that the sun and moon meet each other, both rise and set at the same place, causing the dark atmosphere of this universe. Even though this situation never happened, each of them was in a predetermined position. Allah says: It is impossible for the sun to chase after the moon and the night cannot precede the day. Each circulates in its orbit. (Yasin\/36: 40) It was at that moment that disbelieving humans realized how God's promise had come true. Everyone is trying to save themselves. According to scientific studies, there are various doomsday scenarios, some in the form of grand scenarios, some \"local\" scenarios even though the impact can be universal and affect the entire universe. In the Grand Scenario, the universe system undergoes a systemic change that gets worse, even drastically, so that the universe as a system collapses and doomsday comes. The second type of scenario is \"local\", meaning it only occurs in one of the galaxies or solar systems. It is highly probable that this incident took place in the Milky Way galaxy or even in our solar system, where humans are. One of the possible scenarios is the direction of a black hole (black hole) into our solar system. If a member of our solar system, including planet Earth, is hit by a black hole, which means it will be sucked in by a very strong gravity, then everything on the surface of the earth including humans will be lifted up and then the legs will be released and finally the human body will be scattered up to six twenty four parts. Meanwhile, at the same time, the sun will be sucked in, including its nuclear energy until it runs out, while the planets of all members of our solar system and the sun will also be sucked in together, so that they will unite because of a very strong gravitational pull. It is clear that the light of the moon and of course the light source, namely the sun, will disappear. Then our entire solar system will melt, disrupting the balance of our galaxy, and the universal consequence, the balance of the Milky Way will have an impact on the position and energy balance of the universe, so that the end of the world is only a matter of time."
		   },
		   {
			"id": 5560,
			"surah": 75,
			"ayat": 9,
			"tafsir": "In these verses, Allah explains three signs of the coming of the Day of Judgment, namely: 1. When your eyes widen (because of fear). At that time, the eye could not see something very powerful. In another verse, the same meaning is stated, namely: They come in haste (to fulfill the call) by raising their heads, while their eyes do not blink and their hearts are empty. (Ibrahim\/14: 43) 1. When the moon has lost its light forever, it's not like the situation during a lunar eclipse which only lasts for a moment. 1. The sun and moon are gathered. This means that the sun and moon meet each other, both rise and set at the same place, causing the dark atmosphere of this universe. Even though this situation never happened, each of them was in a predetermined position. Allah says: It is impossible for the sun to chase after the moon and the night cannot precede the day. Each circulates in its orbit. (Yasin\/36: 40) It was at that moment that disbelieving humans realized how God's promise had come true. Everyone is trying to save themselves. According to scientific studies, there are various doomsday scenarios, some in the form of grand scenarios, some \"local\" scenarios even though the impact can be universal and affect the entire universe. In the Grand Scenario, the universe system undergoes a systemic change that gets worse, even drastically, so that the universe as a system collapses and doomsday comes. The second type of scenario is \"local\", meaning it only occurs in one of the galaxies or solar systems. It is highly probable that this incident took place in the Milky Way galaxy or even in our solar system, where humans are. One of the possible scenarios is the direction of a black hole (black hole) into our solar system. If a member of our solar system, including planet Earth, is hit by a black hole, which means it will be sucked in by a very strong gravity, then everything on the surface of the earth including humans will be lifted up and then the legs will be released and finally the human body will be scattered up to six twenty four parts. Meanwhile, at the same time, the sun will be sucked in, including its nuclear energy until it runs out, while the planets of all members of our solar system and the sun will also be sucked in together, so that they will unite because of a very strong gravitational pull. It is clear that the light of the moon and of course the light source, namely the sun, will disappear. Then our entire solar system will melt, disrupting the balance of our galaxy, and the universal consequence, the balance of the Milky Way will have an impact on the position and energy balance of the universe, so that the end of the world is only a matter of time."
		   },
		   {
			"id": 5561,
			"surah": 75,
			"ayat": 10,
			"tafsir": "Allah confirms that on the Day of Resurrection humans will say, \"Where to run?\" Everyone is trying to find a way to save themselves. Some interpret this verse as \"Where is the place to run away from the fire of hell?\" Of course, the people referred to are disbelievers, because at that time no believer doubted the coming of the Day of Judgment as mentioned in several hadiths of the Prophet. Can the disbelievers be able to save themselves? No!"
		   },
		   {
			"id": 5562,
			"surah": 75,
			"ayat": 11,
			"tafsir": "In this verse it is emphasized that there is absolutely no shelter. There is no single protection that might save them from the torment of Allah. There are no forts or hills or usable weapons. Thus in another verse Allah confirms: Obey the call of your Lord before it comes from Allah one day that cannot be rejected (by order from Allah). On that day you will not find shelter and will not (also) deny (your sins). (asy-Shura\/42: 47)"
		   },
		   {
			"id": 5563,
			"surah": 75,
			"ayat": 12,
			"tafsir": "Then in this verse the actual situation is explained and where people are going to be gathered. Only to Allah is the place for humans to return. In a place full of misery or in a place full of pleasure full of happiness. Everything depends on Allah's will. He was the Sole Lord of the day. All humans return to Allah without exception. That's where the destination of life's last journey. Allah said: And verily to your Lord is the end (of everything). (an-Najm\/53: 42)"
		   },
		   {
			"id": 5564,
			"surah": 75,
			"ayat": 13,
			"tafsir": "This verse explains that on that day people will be told what they have done and what they have neglected. It is told to humans when the time has come to reckon and weigh their deeds. Everything will be explained clearly, which good deeds have been done and which ones should have been done but have not had time to do them again. Similarly, what should be done first to avoid the punishment of Allah and achieve His reward. Nothing is left out of the news, small or large works, new or old. Ibn 'Abbas interprets this verse by explaining that what is told is not only the bad and good deeds of a person before he dies, but also all his works, thoughts and habits. Everyone will witness before him all his deeds, as mentioned in another verse: And put the book (record of charity), then you will see people who sin are afraid of what is (written) in it, and they say, \"How woe us, what book is this, nothing is left behind, the small and the large but everything is recorded,\" and they find (all) what they have done. And your Lord does not wrong anyone. (al-Kahf\/18: 49) In this regard, it is also mentioned in the hadith of Rasulullah SAW: Seven kinds of deeds of a servant whose reward continues to flow for people who have died: people who teach knowledge, people who make rivers flow, people who dig wells, people who plant date palms, people who build mosques, people who bequeath (spread) Mushaf (the holy Qur'an), and people who leave children (offspring) who ask forgiveness for him after he dies. (History of Abu Nu'aim and al-Baihaqi from Anas bin Malik)"
		   },
		   {
			"id": 5565,
			"surah": 75,
			"ayat": 14,
			"tafsir": "In this verse, Allah explains that man himself becomes a witness. No need for other people to tell him because all parts of his body bear witness to everything he has done, honestly without lying. Those who do evil are subject to torture and cannot be avoided. Hearing, sight, feet, hands, and all members of the body reveal all that he has done. On this day We shut their mouths; their hands will speak to Us and their feet will testify to what they used to do. (Yasin\/36: 65) Even though it has been explained in the Qur'an that the Day of Judgment will come and humans are accountable for their deeds, humans still want to put forward various reasons to argue against Allah's decision, because they follow their desires."
		   },
		   {
			"id": 5566,
			"surah": 75,
			"ayat": 15,
			"tafsir": "In this verse it is explained that even if humans try to come up with various reasons to cover up all their mistakes and hide all their bad deeds, all of that will be of no use because their limbs will be a witness against them. In another verse it is stated: Read your book, be sufficient for yourself today as your counter. (al-Isra'\/17: 14) On this day We shut their mouths; their hands will speak to Us and their feet will testify to what they used to do. (Yasin\/36: 65) From the verse above, we can also learn that the belief of polytheists associating partners with Allah and worshiping statues or idols, as well as their disbelief on the day of resurrection, is a wrong belief. Their own little hearts actually do not recognize this. Therefore, all the excuses they put forward for rejecting the truth are, in fact, false excuses. They say something contrary to the will of their own conscience."
		   },
		   {
			"id": 5567,
			"surah": 75,
			"ayat": 16,
			"tafsir": "In this verse, Allah forbade the Prophet Muhammad to move his tongue to read the Qur'an because he wanted to quickly master it. In another language, Allah forbade the Prophet Muhammad to move his tongue and lips to quickly catch Gabriel's reading for fear that the reading would escape his memory.\" he was calm in receiving the revelation, and there was no need to rush to catch it. In another verse there is the same meaning, namely: So Most High is Allah, the true King. And do not you (Muhammad) rush (read) the Qur'an 'an before it is revealed to you, and say, \"O my Lord, increase my knowledge to me.\" (thaha\/20: 114) Allah forbade the Prophet Muhammad to imitate Gabriel's reading sentence by sentence before finishing reading it, so that the Prophet Muhammad could memorize and understand verses well that was lowered."
		   },
		   {
			"id": 5568,
			"surah": 75,
			"ayat": 17,
			"tafsir": "Allah explained that the prohibition to follow Gabriel's recitation when he was reciting it was due to the fact that it was Allah's responsibility to gather the revelations in Muhammad's chest and made him good at reading them. It is Allah who is responsible for keeping the Al-Qur'an properly stored in Muhammad's chest or memory, and solidifying it in his heart. Allah also gave him guidance on how to read the verse perfectly and regularly, so that Muhammad memorized it and would not forget it forever. When Jibril has finished reciting the verses that must be revealed, Muhammad should read them again. Later he will find himself always remembering and memorizing those verses. Strictly speaking when Gabriel was reading, Muhammad should be silent and listen to his recitation. From another angle, this verse also means that when Muhammad has finished reading the verses of Allah, he should immediately practice the laws and Shari'a. Since this order came down, the Prophet always followed and listened with great attention to the revelations read by Gabriel. After Jibril left, then he read it and his reading remained in his memory. It is explained in the hadith narrated by al-Bukhari that Ibn 'Abbas said: After the order was sent down, the Messenger of Allah always listened and paid attention when Gabriel came, after Gabriel left he read it as Gabriel taught him. (History of al-Bukhari from Ibn 'Abbas)."
		   },
		   {
			"id": 5569,
			"surah": 75,
			"ayat": 18,
			"tafsir": "Allah explained that the prohibition to follow Gabriel's recitation when he was reciting it was due to the fact that it was Allah's responsibility to gather the revelations in Muhammad's chest and made him good at reading them. It is Allah who is responsible for keeping the Al-Qur'an properly stored in Muhammad's chest or memory, and solidifying it in his heart. Allah also gave him guidance on how to read the verse perfectly and regularly, so that Muhammad memorized it and would not forget it forever. When Jibril has finished reciting the verses that must be revealed, Muhammad should read them again. Later he will find himself always remembering and memorizing those verses. Strictly speaking when Gabriel was reading, Muhammad should be silent and listen to his recitation. From another angle, this verse also means that when Muhammad has finished reading the verses of Allah, he should immediately practice the laws and Shari'a. Since this order came down, the Prophet always followed and listened with great attention to the revelations read by Gabriel. After Jibril left, then he read it and his reading remained in his memory. It is explained in the hadith narrated by al-Bukhari that Ibn 'Abbas said: After the order was sent down, the Messenger of Allah always listened and paid attention when Gabriel came, after Gabriel left he read it as Gabriel taught him. (History of al-Bukhari from Ibn 'Abbas)."
		   },
		   {
			"id": 5570,
			"surah": 75,
			"ayat": 19,
			"tafsir": "This verse explains that there is a guarantee from Allah that it is actually on Allah's responsibility that is the explanation. That is, after Jibril finished reading the Qur'an to the Prophet Muhammad, Allah immediately gave an explanation to him through the inspirations that were instilled in the Prophet's chest, so that the understanding of this verse as perfect as Allah's will could be known to the Prophet. Allah also conveyed to the Prophet all the secrets, laws, and knowledge of the Qur'an perfectly. That way, there can be no doubt that the Qur'an is actually from Allah."
		   },
		   {
			"id": 5571,
			"surah": 75,
			"ayat": 20,
			"tafsir": "In this verse, Allah denounces the life of polytheists who really love the world. Allah calls out, \"Never do. Indeed, you (O people) love the life of this world and leave the life of the hereafter.\" With this verse there is a general conclusion that loving life is a whole human nature. Indeed, there are some who hope for happiness in the afterlife, but those who love worldly life and deny the existence of the Day of Resurrection are far greater in number."
		   },
		   {
			"id": 5572,
			"surah": 75,
			"ayat": 21,
			"tafsir": "Influenced by worldly life is usually accompanied by an attitude of lying to revelation, and forgetting the life of the afterlife and not even believing in its arrival."
		   },
		   {
			"id": 5573,
			"surah": 75,
			"ayat": 22,
			"tafsir": "This verse explains some of the human affairs on the day of resurrection when the faces of the believers at that time will be radiant. This happy and cheerful-faced group is the candidate for the inhabitants of heaven. It is they who are bright-faced who expect an encounter with their Lord. Everywhere they could see Him. This means that they look directly at Allah without a dividing wall (hijab). This is the conclusion of the opinion of sunnah scholars based on authentic hadiths which further explain the meaning of seeing God mentioned in this verse. It is said that the lucky believers see Allah with their own eyes in the Hereafter as they see the full moon shining brightly with no cloud under it. The hadith of al-Bukhari which mentions this reads: Verily you will see your Lord with your own eyes (brightly) as you see the moon (full moon), you are not jostling to see Him. If you can afford not to leave the prayer before sunrise and sunset then do so. (Al-Bukhari and Muslim narrations from Jarir bin 'Abdillah) Even though there is clear information from this verse 22 which is reinforced by several hadiths above which confirms that the believing man will see Allah's face for himself, some of the salaf scholars try to interpret (turn away) ) understanding of the verses and hadiths. Mujahid (a well-known tabiin) argues that the meaning of seeing Allah in heaven is \"to see the reward that is with Allah\". However, this is considered not based on good reasons, because the words \"nadhara\" (see) in Arabic really mean to see with your own eyes, not to see with your heart's eyes and so on. The problem is \"will humans see Allah on the Day of Judgment or not?\" has been a disputed issue (khilafiah) since long ago. Sunnah expert scholars maintain that believers must see Allah based on the verse above, plus information from various valid hadiths. On the other hand, the Mu'tazilah scholars emphasized that it is absolutely impossible for humans to see the face and substance of Allah based on the sound of verse 103 of surahh al-An'am: He cannot be reached by the sight of the eye, while He can see all of that vision. This verse, according to the Mu'tazilah, is limited in its meaning to seeing the favors, pleasure, and rewards provided by Allah. The issue of the hereafter is a supernatural issue, we cannot measure it in comparison with what is now. The short and safe way and not getting involved in protracted disputes is \"to have full faith in what the verse gives without discussing it again. What is the real understanding, we leave it to Allah alone. There are many other fields of ijtihad (thought) if someone wants to deepen the meaning of the holy verses of the Qur'an.\" In the following, we quote some hadiths about seeing Allah in the afterlife: People asked Rasulullah SAW, \"O Messenger of Allah, can we see our Lord on the Day of Judgment?\" He replied, \"Is it difficult for you to see the sun and moon that are not obscured by clouds?\" They replied, \"No.\" He said again, \"Similarly you see your Lord.\" (Al-Bukhari and Muslim from Abu Hurairah) It was narrated from suhaib from the Prophet that he said, \"When the inhabitants of heaven have entered paradise, Allah said, 'Do you want anything more that I want to add? They replied,' Don't you You have brightened our faces, haven't You put us into heaven. And have You rescued us from the fires of hell? Allah answered and then the hijab was removed, so there is nothing more rewarding for them than seeing their Lord.\" Then he read this verse (Yunus\/10: 26): lilladhina ahsanu al-husna wa ziyadah (Muslim History)"
		   },
		   {
			"id": 5574,
			"surah": 75,
			"ayat": 23,
			"tafsir": "This verse explains some of the human affairs on the day of resurrection when the faces of the believers at that time will be radiant. This happy and cheerful-faced group is the candidate for the inhabitants of heaven. It is they who are bright-faced who expect an encounter with their Lord. Everywhere they could see Him. This means that they look directly at Allah without a dividing wall (hijab). This is the conclusion of the opinion of sunnah scholars based on authentic hadiths which further explain the meaning of seeing God mentioned in this verse. It is said that the lucky believers see Allah with their own eyes in the Hereafter as they see the full moon shining brightly with no cloud under it. The hadith of al-Bukhari which mentions this reads: Verily you will see your Lord with your own eyes (brightly) as you see the moon (full moon), you are not jostling to see Him. If you can afford not to leave the prayer before sunrise and sunset then do so. (Al-Bukhari and Muslim narrations from Jarir bin 'Abdillah) Even though there is clear information from this verse 22 which is reinforced by several hadiths above which confirms that the believing man will see Allah's face for himself, some of the salaf scholars try to interpret (turn away) ) understanding of the verses and hadiths. Mujahid (a well-known tabiin) argues that the meaning of seeing Allah in heaven is \"to see the reward that is with Allah\". However, this is considered not based on good reasons, because the words \"nadhara\" (see) in Arabic really mean to see with your own eyes, not to see with your heart's eyes and so on. The problem is \"will humans see Allah on the Day of Judgment or not?\" has been a disputed issue (khilafiah) since long ago. Sunnah expert scholars maintain that believers must see Allah based on the verse above, plus information from various valid hadiths. On the other hand, the Mu'tazilah scholars emphasized that it is absolutely impossible for humans to see the face and substance of Allah based on the sound of verse 103 of surahh al-An'am: He cannot be reached by the sight of the eye, while He can see all of that vision. This verse, according to the Mu'tazilah, is limited in its meaning to seeing the favors, pleasure, and rewards provided by Allah. The issue of the hereafter is a supernatural issue, we cannot measure it in comparison with what is now. The short and safe way and not getting involved in protracted disputes is \"to have full faith in what the verse gives without discussing it again. What is the real understanding, we leave it to Allah alone. There are many other fields of ijtihad (thought) if someone wants to deepen the meaning of the holy verses of the Qur'an.\" In the following, we quote some hadiths about seeing Allah in the afterlife: People asked Rasulullah SAW, \"O Messenger of Allah, can we see our Lord on the Day of Judgment?\" He replied, \"Is it difficult for you to see the sun and moon that are not obscured by clouds?\" They replied, \"No.\" He said again, \"Similarly you see your Lord.\" (Al-Bukhari and Muslim from Abu Hurairah) It was narrated from suhaib from the Prophet that he said, \"When the inhabitants of heaven have entered paradise, Allah said, 'Do you want anything more that I want to add? They replied,' Don't you You have brightened our faces, haven't You put us into heaven. And have You rescued us from the fires of hell? Allah answered and then the hijab was removed, so there is nothing more rewarding for them than seeing their Lord.\" Then he read this verse (Yunus\/10: 26): lilladhina ahsanu al-husna wa ziyadah (Muslim History)"
		   },
		   {
			"id": 5575,
			"surah": 75,
			"ayat": 24,
			"tafsir": "The following verse explains that the faces of the disbelievers that day were gloomy. They are gloomy, with a sour face symbolizing extreme sadness and fear. They are sure that a terrible calamity will befall them, as Allah says: On that day some faces will be radiant white, and some faces will be black with gloom. As for those whose faces were black and somber (to them it was said), \"Why did you disbelieve after believing? Therefore feel the punishment for your disbelief.\" (Ali 'Imran\/3: 106) As for the faces of the believers, at that time their faces became white and radiant. They are in Allah's mercy (heaven) and will abide therein forever, as He says: On that day there will be faces that will be radiant, laughing and rejoicing, and on that day there will be faces covered with dust ( gloomy), covered by darkness (overwritten by humiliation and distress). They are the rebellious disbelievers. ('Abasa\/80: 38-42)"
		   },
		   {
			"id": 5576,
			"surah": 75,
			"ayat": 25,
			"tafsir": "The following verse explains that the faces of the disbelievers that day were gloomy. They are gloomy, with a sour face symbolizing extreme sadness and fear. They are sure that a terrible calamity will befall them, as Allah says: On that day some faces will be radiant white, and some faces will be black with gloom. As for those whose faces were black and somber (to them it was said), \"Why did you disbelieve after believing? Therefore feel the punishment for your disbelief.\" (Ali 'Imran\/3: 106) As for the faces of the believers, at that time their faces became white and radiant. They are in Allah's mercy (heaven) and will abide therein forever, as He says: On that day there will be faces that will be radiant, laughing and rejoicing, and on that day there will be faces covered with dust ( gloomy), covered by darkness (overwritten by humiliation and distress). They are the rebellious disbelievers. ('Abasa\/80: 38-42)"
		   },
		   {
			"id": 5577,
			"surah": 75,
			"ayat": 26,
			"tafsir": "In this verse, Allah calls on humans so that they never forget the hereafter. If someone's breath has reached the throat, repentance is no longer useful. Never be affected by worldly life and remember that in time, the human soul will be uprooted by the angel of death. When the soul is divorced from the body, then the human relationship with all that he has is cut off and he will face a new chapter of his eternal and everlasting life. In another verse, Allah says: So then why (do not prevent) when (the soul) has reached the throat, and you see at that time. (al-Waqi'ah\/56: 83-84)"
		   },
		   {
			"id": 5578,
			"surah": 75,
			"ayat": 27,
			"tafsir": "This verse describes the situation of a person who is dying when his family wonders, \"Who can heal?\" In general, when a person is dying, his family and relatives are overcome by anxiety, \"Who and which doctor can cure him of his illness?\" This means that medical efforts are still being carried out, but one must be sure that when one dies, no one can save him or her from this divine provision. Everything is indiscriminate, even all of this mortal will definitely be destroyed. Only God himself is not destroyed. According to Ibn 'Abbas, this verse means \"who is it that takes his life, is it the angel of doom or the angel of mercy\". The main thing is asking each other whether the corpse is happy or unlucky with his death. Humans do not know before the arrival of the angel of death whether he will be safe or wretched."
		   },
		   {
			"id": 5579,
			"surah": 75,
			"ayat": 28,
			"tafsir": "These verses describe that the person who is facing death believes that it is the time of separation from the world. In other languages, it can be said that when death comes, a person feels certain that the time has come to part forever with the world, wealth, family and relatives. Allah deliberately mentions the words dhanna (which actually means to think) because even when the soul is about to fly away, it still really wants to live again due to its excessive love for this mortal life. Man is not so sure of his own death. The statement of this verse which states \"his left calf is linked to his right calf\" implies that he is no longer able to move his two calves (legs). In fact, he is also no longer able to move his body because the organs and tissues have stopped working. The words iltaffa (linked) were interpreted by Ibn 'Abbas by linking him at the time of death between the weight of leaving this world and the extreme fear of facing the hereafter. Link reinforcements with reinforcements, and therein lies the agony of death that can only be felt by those concerned."
		   },
		   {
			"id": 5580,
			"surah": 75,
			"ayat": 29,
			"tafsir": "These verses describe that the person who is facing death believes that it is the time of separation from the world. In other languages, it can be said that when death comes, a person feels certain that the time has come to part forever with the world, wealth, family and relatives. Allah deliberately mentions the words dhanna (which actually means to think) because even when the soul is about to fly away, it still really wants to live again due to its excessive love for this mortal life. Man is not so sure of his own death. The statement of this verse which states \"his left calf is linked to his right calf\" implies that he is no longer able to move his two calves (legs). In fact, he is also no longer able to move his body because the organs and tissues have stopped working. The words iltaffa (linked) were interpreted by Ibn 'Abbas by linking him at the time of death between the weight of leaving this world and the extreme fear of facing the hereafter. Link reinforcements with reinforcements, and therein lies the agony of death that can only be felt by those concerned."
		   },
		   {
			"id": 5581,
			"surah": 75,
			"ayat": 30,
			"tafsir": "This verse emphasizes that on that day man is expelled to his Lord, that is, he is returned whether he will be placed in hell or in heaven. According to Ibn 'Abbas, this verse is a message about disbelievers who are not accepted by Allah, spirits who previously never wanted to believe and only did what they liked. The meaning of this verse is related to another verse: And He is the absolute Ruler over all His servants, and He sent guardian angels to you, so that when death comes to one of you, Our angels take his soul, and they do not neglect his job. Then they (servants of Allah) are returned to Allah, their real ruler. Know that all laws (on that day) are with Him. And He is the fastest calculating maker. (al-An'am\/6: 61-62)"
		   },
		   {
			"id": 5582,
			"surah": 75,
			"ayat": 31,
			"tafsir": "These verses explain that the disbeliever did not want to justify the messenger, and turned away from the truth and did not want to pray. He always denied the Messenger of Allah and the Qur'an, and did not want to unite Allah. He still associates partners with Him and believes that God is numberless. He also does not want to carry out the obligations assigned to him, and always opposes and turns away from God's commands, and is influenced by worldly pleasures."
		   },
		   {
			"id": 5583,
			"surah": 75,
			"ayat": 32,
			"tafsir": "These verses explain that the disbeliever did not want to justify the messenger, and turned away from the truth and did not want to pray. He always denied the Messenger of Allah and the Qur'an, and did not want to unite Allah. He still associates partners with Him and believes that God is numberless. He also does not want to carry out the obligations assigned to him, and always opposes and turns away from God's commands, and is influenced by worldly pleasures."
		   },
		   {
			"id": 5584,
			"surah": 75,
			"ayat": 33,
			"tafsir": "This verse further explains that the disbeliever not only challenges and does not want to obey Allah, he even goes to his family and relatives to tell all of his attitudes arrogantly and arrogantly. Those who deny Allah always have the attitude of denying Divine truth with their hearts, and act and act everyday with that attitude. More than that, he feels proud and proud of what he does. Not the slightest goodness in God's sight attached to that person, outwardly or inwardly."
		   },
		   {
			"id": 5585,
			"surah": 75,
			"ayat": 34,
			"tafsir": "This verse confirms that in a threatening tone, Allah warns the disbeliever of the coming of disaster for him. This utterance means a threat and a stern warning. They are the most deserving and deserving of torture. Arabs say that sentence to someone who does a disgraceful deed."
		   },
		   {
			"id": 5586,
			"surah": 75,
			"ayat": 35,
			"tafsir": "This threat was repeated once again to reinforce it, \"Woe to the disbeliever and woe to him.\" It was narrated by commentators from Qatadah that one day Rasulullah SAW held Abu Jahl's arm tightly while rebuking the enemy of Allah, \"Woe to you, O Abu Jahl, woe to you!\" Abu Jahal replied arrogantly, \"Muhammad, are you threatening me? By Allah, you cannot do anything to me, not even the God you worship! By Allah, I am more powerful than all those who walk between these hills, from all the inhabitants of Mecca .\" But on the day of the battle of Badr, Allah destroyed Abu Jahl with a terrible death. When the news of Abu Jahal's death was conveyed to the Prophet, he said, \"Verily, every ummah has a Pharaoh (there is a person who is the most arrogant), so the Pharaoh of this ummah is Abu Jahal.\" Sa'id bin Jubair asked Ibn 'Abbas about the words \"aula laka faula\", did something the Prophet said came from him or was it Allah who ordered it? Ibn 'Abbas replied, \"It is true that he said it, then Allah revealed the same revelation as he said it.\" This curse of Allah applies to people with a character like Abu Jahl who will appear at any time."
		   },
		   {
			"id": 5587,
			"surah": 75,
			"ayat": 36,
			"tafsir": "This verse presents the argument for the truth of the resurrection day by using a question sentence, namely whether humans were made for nothing (without accountability)? Are humans created and then allowed to live as they please, without any orders and prohibitions from Allah that they must obey? After he dies, does Allah not hold him accountable for his life, in the grave and in Padang Mahsyar later? Allah says: Indeed, the Day of Resurrection will come, I will keep it (the time) secret so that everyone will be rewarded according to what he has earned. (thaha\/20: 15) Another word of Allah: And We did not create the heavens and the earth and what is between them in vain. That is the opinion of unbelievers, so woe to those who disbelieve because they will go to hell. (sad\/38: 27) The argument behind the meaning of this verse is convincing people who doubt about the existence of the resurrection day, and rejecting or strongly refuting those who deny it, either because of carelessness, stubbornness, or just because they want to play with the verse -holy verses."
		   },
		   {
			"id": 5588,
			"surah": 75,
			"ayat": 37,
			"tafsir": "In these verses, Allah reminds us again about the origin of human creation, that is, he was created from a drop of semen that was shed (into the womb). Then the semen became a clot of blood, then Allah created and perfected it. Allah also made from him a pair of male and female. This verse reminds humans who deny how God created semen to become flesh with which humans were created perfectly through the process of pregnancy. It is also an easy thing for God to revive humans, then turn them off and bring them back to life. Male sperm and female egg cells mix together to create a perfect human being, complete with sight and hearing, both male and female. So, have humans never thought that the Creator of all the processes of events is also capable of destroying this world and then creating the Doomsday and humans who have died being raised back to life? This is an affirmation for humans who want to think if they still have doubts about God's power to bring back human beings who have died."
		   },
		   {
			"id": 5589,
			"surah": 75,
			"ayat": 38,
			"tafsir": "In these verses, Allah reminds us again about the origin of human creation, that is, he was created from a drop of semen that was shed (into the womb). Then the semen became a clot of blood, then Allah created and perfected it. Allah also made from him a pair of male and female. This verse reminds humans who deny how God created semen to become flesh with which humans were created perfectly through the process of pregnancy. It is also an easy thing for God to revive humans, then turn them off and bring them back to life. Male sperm and female egg cells mix together to create a perfect human being, complete with sight and hearing, both male and female. So, have humans never thought that the Creator of all the processes of events is also capable of destroying this world and then creating the Doomsday and humans who have died being raised back to life? This is an affirmation for humans who want to think if they still have doubts about God's power to bring back human beings who have died."
		   },
		   {
			"id": 5590,
			"surah": 75,
			"ayat": 39,
			"tafsir": "In these verses, Allah reminds us again about the origin of human creation, that is, he was created from a drop of semen that was shed (into the womb). Then the semen became a clot of blood, then Allah created and perfected it. Allah also made from him a pair of male and female. This verse reminds humans who deny how God created semen to become flesh with which humans were created perfectly through the process of pregnancy. It is also an easy thing for God to revive humans, then turn them off and bring them back to life. Male sperm and female egg cells mix together to create a perfect human being, complete with sight and hearing, both male and female. So, have humans never thought that the Creator of all the processes of events is also capable of destroying this world and then creating the Doomsday and humans who have died being raised back to life? This is an affirmation for humans who want to think if they still have doubts about God's power to bring back human beings who have died."
		   },
		   {
			"id": 5591,
			"surah": 75,
			"ayat": 40,
			"tafsir": "This verse is the answer to all of that, that isn't God who does this, also has the power to bring back those who have died? The meaning of this statement is whether the Substance that creates a perfect creature from a drop of semen is not able to bring back a person who has died? Precisely that way it is easier for Him. That's how Allah confirms in His word: And it is He who begins the creation, then repeats it again, and it is easier for Him. He has the nature of the Most High in the heavens and on earth. And He is the Most Mighty, the Most Wise. (ar-Rum\/30: 27) In several hadiths it is stated that when he finished reading this surah, Rasulullah saw prayed: After reading surahh al-Qiyamah, Rasulullah prayed, \"Subhanaka Allahumma wa bala (Glory to You O Allah and You are the Almighty ). (Yes, I testify to that). And whoever reads surahh al-Qiyamah to the end, let him pray, \"Bala\" (yes, You are the Almighty). And whoever reads surahh al-Mursalat to the end, let him pray, \"Amanna billahi (we believe in Allah). (History of Ahmad, Abu Dawud, at-Tirmidhi, ibn al-Mindhir, Ibn Mardawaih, al-Baihaqi, and authenticated by al-hakim from Abu Hurairah) The above prayers were recited by the Prophet after reading verses like this while outside of prayer, whereas when he was praying, he did not perform them and there is no explanation or evidence for this."
		   }
	]
}
