{
	"tafseer": [
		{
			"id": 4546,
			"surah": 47,
			"ayat": 1,
			"tafsir": "In this verse, Allah divides human beings into two groups: first, disbelievers, namely people who deny the power and oneness of Allah, worship gods other than Him, prevent people from worshiping Him, make up ways to worship Him According to his own opinion and desires, he denounces and hinders people from believing in Allah and in the Prophet Muhammad. All the actions of this group do not follow Allah's instructions contained in the Al-Qur'an and the traditions of His Messenger, but follow their own desires and follow the instructions of Satan. All actions based on the actions of satan are meaningless in the sight of Allah even though these actions are good for humans and humanity. The action is as if foam appears on the surface of the water, then disappears without the slightest trace. Therefore, all the deeds and deeds done by polytheists have no meaning and no reward with Allah in the hereafter. They only get rewards in this world that are obtained from humans, even though the forms of charity and actions are such as noble character, relating to other people (silaturrahim), feeding the poor, caring for orphans, making humanitarian efforts, maintaining and building mosques. . Jobs like this are jobs that have been done by Meccan polytheists, such as prospering the Grand Mosque, protecting people who need protection, helping people who do tawaf and so on. Allah says: And We will show them all the deeds they do, then We will make those deeds (like) flying dust. (al-Furqan\/25: 23) Second, the group of believers, namely those who acknowledge the oneness of Allah, obey only Him, worship according to Allah's instructions, not according to their own will and stay away from His prohibitions, believe in Al- The Qur'an that was brought by the Prophet Muhammad, and helps people to worship Him. This is the class that Allah pleases. The deeds and deeds of the believers are accepted by Allah, all sins are forgiven, they will be rewarded in this world while in the hereafter they will receive eternal happiness. According to Ibn 'Abbas, the first verse revealed relates to the people who fed the Meccan polytheists during the Battle of Badr. They were twelve people, namely Abu Jahl, al-harith bin Hisham, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisham, Zam'ah bin al-Aswad, Hakim bin Hazam, and al-Harith bin 'Amir bin Naufal. They all had good deeds during the Arab Jahiliyya era, such as providing refreshments for the pilgrims, feeding the guests who came to the Grand Mosque, protecting and safeguarding the rights of neighbors, and so on. All their deeds are rewarded by Allah, as if they had never done anything, because the basis for accepting a charity and action is faith in Allah and the Prophet Muhammad. While the second verse was revealed related to the Ansar in Medina. They believed in Allah and the Prophet Muhammad, helped the immigrants who had just come from Mecca to migrate with the Prophet Muhammad, and followed Allah's commands and avoided Allah's prohibitions."
		   },
		   {
			"id": 4547,
			"surah": 47,
			"ayat": 2,
			"tafsir": "In this verse, Allah divides human beings into two groups: first, disbelievers, namely people who deny the power and oneness of Allah, worship gods other than Him, prevent people from worshiping Him, make up ways to worship Him According to his own opinion and desires, he denounces and hinders people from believing in Allah and in the Prophet Muhammad. All the actions of this group do not follow Allah's instructions contained in the Al-Qur'an and the traditions of His Messenger, but follow their own desires and follow the instructions of Satan. All actions based on the actions of satan are meaningless in the sight of Allah even though these actions are good for humans and humanity. The action is as if foam appears on the surface of the water, then disappears without the slightest trace. Therefore, all the deeds and deeds done by polytheists have no meaning and no reward with Allah in the hereafter. They only get rewards in this world that are obtained from humans, even though the forms of charity and actions are such as noble character, relating to other people (silaturrahim), feeding the poor, caring for orphans, making humanitarian efforts, maintaining and building mosques. . Jobs like this are jobs that have been done by Meccan polytheists, such as prospering the Grand Mosque, protecting people who need protection, helping people who do tawaf and so on. Allah says: And We will show them all the deeds they do, then We will make those deeds (like) flying dust. (al-Furqan\/25: 23) Second, the group of believers, namely those who acknowledge the oneness of Allah, obey only Him, worship according to Allah's instructions, not according to their own will and stay away from His prohibitions, believe in Al- The Qur'an that was brought by the Prophet Muhammad, and helps people to worship Him. This is the class that Allah pleases. The deeds and deeds of the believers are accepted by Allah, all sins are forgiven, they will be rewarded in this world while in the hereafter they will receive eternal happiness. According to Ibn 'Abbas, the first verse revealed relates to the people who fed the Meccan polytheists during the Battle of Badr. They were twelve people, namely Abu Jahl, al-harith bin Hisham, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisham, Zam'ah bin al-Aswad, Hakim bin Hazam, and al-Harith bin 'Amir bin Naufal. They all had good deeds during the Arab Jahiliyya era, such as providing refreshments for the pilgrims, feeding the guests who came to the Grand Mosque, protecting and safeguarding the rights of neighbors, and so on. All their deeds are rewarded by Allah, as if they had never done anything, because the basis for accepting a charity and action is faith in Allah and the Prophet Muhammad. While the second verse was revealed related to the Ansar in Medina. They believed in Allah and the Prophet Muhammad, helped the immigrants who had just come from Mecca to migrate with the Prophet Muhammad, and followed Allah's commands and avoided Allah's prohibitions."
		   },
		   {
			"id": 4548,
			"surah": 47,
			"ayat": 3,
			"tafsir": "In this verse it is explained why the deeds and deeds of the disbelievers are removed and the reasons why the deeds and deeds of the believers are accepted and rewarded. Allah nullifies the reward of the deeds and deeds of the disbelievers because they prefer misguidance to the truth, follow Satan's temptations, follow their desires, and do not believe in Allah and His Messenger. The key to receiving a charity and action is faith in Allah and His Messenger. Believers submit and obey Allah, and all their deeds and actions are aimed solely at seeking the pleasure of Allah. Therefore, Allah calms their hearts and minds and guides them to follow the straight path. In addition to clearly explaining His attitude and actions towards disbelievers and believers, Allah makes parables, parables and comparisons for humans by presenting various characteristics, actions and beliefs of a person in life and his life as well as the consequences and rewards. from their deeds. In fact, those who want to understand and understand the wisdom behind parables, parables, and similar things, they certainly believe in Allah, but because the hearts, ears, and eyes of disbelievers have been closed and locked because of the crimes that have been committed, all the parable meant nothing to them. From this verse one conclusion can be drawn, namely that it has become a sunatullah (law of Allah) that cannot be denied by anyone, that the basis of all deeds and actions of a person that Allah pleases is faith in Him, in Muhammad as His messenger, in all those who brought by the apostle, do all His commands, and stay away from all His prohibitions. Those are actions that can bring rewards, while actions that are not based on faith, piety, and obedience to Him, have no reward from Allah, like foam that floats on the surface of water that appears and disappears without leaving a trace."
		   },
		   {
			"id": 4549,
			"surah": 47,
			"ayat": 4,
			"tafsir": "This verse explains to the Muslims how to deal with unbelievers in war. They must devote all their abilities and abilities to destroy the enemy. Should give priority to the victory that will be achieved on every battlefield and do not give priority to the capture of the enemy and the seizure of booty. The arrests were made after they were defeated, because the disbelievers wanted to kill and destroy the Muslims all the time and they could not be trusted. They pretend to want peace, but their hearts and beliefs still want to destroy the religion of Islam and its followers at every opportunity they may have. After the war ends with victory at the hands of the Muslims, they may choose one of two things, namely whether to free the prisoners who have been held captive or free them by paying a ransom by the enemy or by exchanging prisoners. In another verse it is explained that the limit for the Muslims to stop fighting the infidels of Mecca is until there is no more slander. Allah said: And fight them until there is no more slander, and religion is for Allah alone. If they stop, there will be no hostility (again), except against the wrongdoers. (al-Baqarah\/2: 193) Ibn 'Abbas said, \"When the number of the Muslims increased and their strength also increased, Allah revealed this verse, and the Messenger of Allah acted towards the captives in accordance with this verse, so did the caliphs who came after him. \" From the verse above and the words of Ibn 'Abbas, the following can be understood: 1. This verse was revealed after the Battle of Badr because at that time the Prophet Muhammad prioritized ransom, such as redeeming with wealth or by ordering prisoners to teach the Muslims to read and write , so that the Apostle received a rebuke from Allah. 2. This verse is a guide for the Prophet and his companions in solving problems related to war and prisoners of war. 3. The order to kill infidels in this verse is carried out in battle, not outside of war. Therefore, it is only natural that Allah ordered the Muslims to kill their enemies in the war that was raging because the enemies themselves acted in the same way towards them. If Allah had not ordered this, the Muslims would have hesitated to face an enemy who would kill them so that the enemy would have the opportunity to destroy them. 4. Allah did not order the Muslims to kill infidels wherever they found them, but Allah only ordered the Muslims to fight the infidels who intended to damage, slander and destroy Islam and the Muslims. Towards unbelievers who are kind towards Islam and Muslims, Muslims must also be kind towards them. Allah says: Allah does not forbid you to do good and do justice to those who do not fight you in matters of religion and do not expel you from your hometowns. Verily, Allah loves those who act justly. Indeed, Allah only forbids you to make them your friends, people who fight you in matters of religion and expel you from your hometowns and help (other people) to expel you. Whoever makes them friends, they are the wrongdoers. (al-Mumtahanah\/60: 8-9) 5. The head of state has a role in making decisions and policies in resolving wars and prisoners of war. He must base his decisions on the interests of religion, Muslims and humanity as well as the benefit in general. Forcing prisoners to convert to Islam is not permissible because this action is against the word of Allah which forbids Muslims from forcing others to embrace Islam. Allah says: There is no compulsion in (adhering to) religion (Islam), in fact there is a clear (difference) between the right way and the wrong way. Whoever disbelieves in Tagut and believes in Allah, then indeed, he has held on (firmly) to a very strong rope that will not break. Allah is All-Hearing, All-Knowing. (al-Baqarah\/2: 256) Killing captives for the Muslims certainly has a basis. The prisoners who were killed were not ordinary prisoners, but were war criminals who had committed many wrongdoings. If he lives, then his crimes in war will continue for a long time. Making captives as slaves is an act that is usually done by the nations of the world before the advent of Islam. After coming to Islam, the enemies of Islam turned the Muslims they captured into slaves. Basically slavery is prohibited by Islam, but as a reward for the actions of infidels and to protect the feelings of the Muslims, the Prophet allowed the Muslims to make the infidels he held captive as slaves. This means that if the infidels do not make the Muslims they hold captive into slaves, surely the Muslims cannot make the infidels they hold captive become slaves. Even though slavery occurred because there were prisoners of war, in Islam there are many legal provisions related to efforts to free slaves, which are called kaffarat. Islam is a religion of peace, not a religion that promotes war. If in the history of Islam there were wars between Muslims and infidels, then those wars occurred because of defending the religion of Islam which the infidels wanted to abolish, in addition to defending themselves from destruction. Since the Prophet Muhammad was appointed as an apostle, since then there has also been hostility from the polytheists of Mecca towards him and his followers. They have used various methods to destroy Islam and Muslims, from the softest way to the most violent. The culmination of the actions of the Meccan polytheists was to conspire to kill the Prophet Muhammad so that Allah ordered him to migrate to Medina. After the Messenger of Allah was in Medina the enmity intensified, so that the Muslims were forced to fight them to defend their religion and themselves. When the Prophet Muhammad arrived in Medina, a peace treaty with the residents of that city, who among others were Jews, was signed, but the peace treaty was violated by them. They even attempted to kill the Prophet Muhammad. Therefore, the Prophet was forced to fight the Jews in Medina. There are so many examples that can be put forward that prove that Islam was not spread through war, but through preaching full of wisdom and wisdom. Towards prisoners of war, the attitude of the Prophet was very good. In the hadith narrated by al-Bukhari explained his attitude. Abu Hurairah said, \"Rasulullah saw sent his cavalry to Nejed, so the cavalry captured a man from Bani Hanifah whose name was sumamah bin Utsal, he was tied to one of the pillars of the mosque. So Rasulullah saw came to him, then said, 'What what do you have, sumamah? sumamah replied, 'I have wealth, if you want to kill me, do it, and if you want to free me then I thank you, if you want wealth, then ask how much you want. The next day the Messenger of Allah said to him , 'What do you have, sumamah? He replied,' I have what I told you. The Messenger of Allah said, 'Untie the sumamah. , then stated, 'I admit that there is no god but Allah and that Muhammad is His Messenger. By Allah, in the past there was no person I hated the most in this world besides you, now be you the person I love the most. By Allah, before there was no religion that I hated more than your religion, so now your religion is the religion that I love the most. By Allah, before the land I hated the most was your country, now your country is the country I love the most. Indeed, cavalry have caught me, I was intending to perform Umrah, what do you think? So the Prophet gave him good news and told him to perform Umrah. When he arrived in Mecca, someone said to him, 'Do you miss? sumamah replied, 'No, but I have converted to Islam with Muhammad saw.\" From this hadith it can be understood that Rasulullah saw was gentle to sumamah, a prisoner of war. because of that he declared himself converted to Islam. If the Prophet had been rude to him, of course sumamah would not have said this statement in the hadith. He would have held a grudge against the Prophet peace be upon him and at every opportunity he would have tried to avenge him. Islam came to uphold the principle -principles that must exist in human life and life, both as individual beings and as social beings. Among these principles are monotheism, justice, humanity, and deliberation. By upholding these principles humans will succeed in their duties as caliphs God on earth. On the basis of all that all problems are resolved, ter involved in matters of war and prisoners of war. At the end of this verse, Allah explains what rewards will be received by those who believe and strive in the way of Allah by saying, \"For those who strive in the way of Allah to defend the religion of Islam, Allah will never reduce their reward. little bit, even he will reward him with multiple rewards.Regarding the reward of jihad in the way of Allah mentioned in a hadith as follows: تَا Narrated by al-Miqdam bin Ma'diyakrib, he said, \"I heard the Messenger of Allah say, 'Verily people the martyr gets nine or ten things, that is, he will be forgiven when his blood first flows, he will see his home in heaven, he will be adorned with the jewels of faith, he will be spared from the punishment of the grave, he will be married to an angel, he will receive security during the day of great fear ( Day of Resurrection), on his head is placed a crown of glory made of jewels that are better than the world and everything in it, is married to 92 wives ri from the group of angels, and was given the right of intercession for 70 of his relatives.\" (History of ath-thabrani)"
		   },
		   {
			"id": 4550,
			"surah": 47,
			"ayat": 5,
			"tafsir": "In this verse it is explained that Allah will guide those who believe in carrying out work that pleases Him so that the work is successful, and keeps them from committing immorality and sinful acts. Allah also provided for them a place to return to in heaven that they already knew because Allah showed them those places."
		   },
		   {
			"id": 4551,
			"surah": 47,
			"ayat": 6,
			"tafsir": "In this verse it is explained that Allah will guide those who believe in carrying out work that pleases Him so that the work is successful, and keeps them from committing immorality and sinful acts. Allah also provided for them a place to return to in heaven that they already knew because Allah showed them those places."
		   },
		   {
			"id": 4552,
			"surah": 47,
			"ayat": 7,
			"tafsir": "Allah calls on the believers, if they defend and help His religion by sacrificing wealth and life, He will surely help them from their enemies. Allah will strengthen their hearts and ranks in carrying out the obligation to defend the religion of Islam by fighting unbelievers who want to tear it down, so that Allah's religion can be firmly established."
		   },
		   {
			"id": 4553,
			"surah": 47,
			"ayat": 8,
			"tafsir": "It is further explained that those who do not believe in Allah, deny His oneness and power, then they will be doomed. Allah will erase all the rewards of their deeds and deeds. Their actions will not receive guidance and taufik from Allah. Allah will also frustrate all their plots to destroy the Muslims."
		   },
		   {
			"id": 4554,
			"surah": 47,
			"ayat": 9,
			"tafsir": "This verse explains that Allah does not reward the deeds and deeds of the disbelievers and does not give His guidance and taufik because they deny the instructions of the Al-Qur'an which were revealed to the Prophet Muhammad as His messenger."
		   },
		   {
			"id": 4555,
			"surah": 47,
			"ayat": 10,
			"tafsir": "The Meccan polytheists who denied Muhammad's prophethood and apostleship, and denied the truth of the Qur'an's instructions as a book that came from Allah Almighty, actually have various evidences to justify his prophethood and apostleship, because that country is in the vicinity of the people's land. - the previous people who had denied and denied the call of Allah's apostles. Don't they often go to Syria, in the north of their country, and Hadramaut, in the south. Didn't they also go to Persia in the east and to Ethiopia in the southwest of their country. Their departure to these countries with the aim of trading. On that journey, they passed the ruins of the land of the people of 'Ad, the people of Samud, the people of Shuaib, and so on that had been destroyed by Allah. They can still see the former land in the form of ruins, relics, and so on. They could see the ruins, because the country was a center of commerce at that time and was located on the trade routes that connected the western world with the east. They also knew that the ancient peoples had been destroyed by Allah because of disobedience to Him and His messenger. However, they don't want to pay attention and reflect that sunatullah applies to everyone who denies His religion. Therefore, the Meccan polytheists would suffer the same fate that the ancient peoples had experienced if they still did not heed the call of the Prophet Muhammad. As proof of the truth of Allah's promise, many Meccan polytheists were killed in the Battle of Badr and likewise in the wars that followed."
		   },
		   {
			"id": 4556,
			"surah": 47,
			"ayat": 11,
			"tafsir": "This verse explains the condition of the believers and unbelievers in the world and the calamity that afflicts polytheists. The polytheists do not have a single helper to ward off the punishment that befalls them, while the believers have a helper, namely Allah, the Almighty and the Most Helper."
		   },
		   {
			"id": 4557,
			"surah": 47,
			"ayat": 12,
			"tafsir": "This verse talks about the condition of believers and unbelievers in the hereafter. Those who believe and do good deeds are rewarded manifold in the form of heaven as a reward for their faith and obedience. Whereas those who deny the power and oneness of Allah and belie His Messenger, are affected by the pleasures of living in this world which are only temporary. They do not take lessons from the events that have befallen ancient peoples. They are likened to animals that eat in stables or in the pastures provided for them. The animals never think about whether the food available for them is still there to eat tomorrow or all is gone today, so there is no food to eat anymore. This verse gives an overview of the situation and what the polytheists think. They only think about what is delicious and can fulfill their lustful desires. They don't want to think about how long they can enjoy pleasures and sensual desires and what is the source of those pleasures and pleasures. Whether they can continue to enjoy it, they never think. They also don't think about the consequences they will experience if they are unable to experience that pleasure again. They feel the pleasure of eating something, but it never occurs to them that Allah has bestowed a tongue on them to taste the pleasure of something they eat. What would happen if God gave disease to their tongue, so they can't feel anything anymore? They don't think about the best attitude and action they should take towards that source of pleasure. The people described in the verse above are the place of return to Hell, because that is the most appropriate place to return for people who do not use their minds."
		   },
		   {
			"id": 4558,
			"surah": 47,
			"ayat": 13,
			"tafsir": "It was narrated by 'Abd bin Humaid, Abu Ya'la, Ibn Abi Hatim, and Ibn Mardawaih from Ibn 'Abbas, that when the Prophet Muhammad was about to leave Mecca, before moving to Medina, he looked back to see the land of Mecca and said, \"You ( Mecca) is the country of Allah that I love the most, and if the people don't drive me out, I certainly won't leave you.\" Then come down this verse. In this verse, Allah provides a comparison as a consolation for the Prophet Muhammad's heart which had been troubled by the attitudes and actions of the polytheists of Mecca. It was explained that how many countries whose inhabitants are stronger in body, have more knowledge, are more able to develop their country, have more soldiers so that they can conquer the lands around them compared to the polytheists of Mecca. All of that has been destroyed by Allah with various kinds of calamities that befell them. In the face of this calamity, they have no helper. All might, power, and valiant armies pale in the face of that catastrophe. The polytheists of Mecca would have suffered the same fate had they continued to deny the Prophet Muhammad's call. Therefore, the Prophet was advised to be patient and steadfast in dealing with their attitudes and actions and Allah will definitely help and win over obedient servants to Him."
		   },
		   {
			"id": 4559,
			"surah": 47,
			"ayat": 14,
			"tafsir": "This verse explains the comparison between those who believe and those who disbelieve by saying, \"Is it the same person who wants to think so that he has understanding, understanding, and belief in the religion of Allah and the Qur'an which was revealed to Muhammad SAW with those who who doesn't want to use his mind, so he doesn't believe that Allah will reward those who follow their lusts and the devil's temptations? Of course the two kinds of people are not the same, even the difference between the two is very big. : So is a person who knows that what God has revealed to you is the truth, the same as a person who is blind? Only people with understanding can learn a lesson. (ar-Ra'd\/13: 19) And Allah's word: Not the same as the inhabitants of hell with the residents of heaven; the residents of heaven are the ones who will win (al-hashr\/59: 20)"
		   },
		   {
			"id": 4560,
			"surah": 47,
			"ayat": 15,
			"tafsir": "The reward that will be received by a believer in the hereafter is not the same as the reward that will be obtained by an unbeliever. This verse describes the state of heaven and hell in a very interesting symbolic form. It begins with the word \"parable\" (matsalul jannati). The first is \"heaven\", and the second \"parable\", \"samakah\" (kaman) which is summarized in a questioning tone. Said az-Zamakhsyari (in al-Kasysyaf), this expression is in the form of affirmation, but in essence it is denial, a negation. The characteristics of heaven described in this verse include: first, many rivers flow in it and each river has water of various types and tastes and is pleasant for the inhabitants of heaven to drink. Among the types of water are: 1. There is water that is clear and clean, not polluted by anything. Therefore, the taste, color and smell will not change. 2. There is a river that flows good milk to drink. The milk is still good and delicious, the taste will not change because it is spoiled or rotten. 3. There is a river that flows khamar which is delicious to drink, healthy, and refreshes the body and feelings of the drinker. Not like khamar in the world. Even though the addict is good to drink, it can damage the body, mind and mind. Therefore, khamr in heaven is lawful to drink, while khamr in this world is unlawful. 4. There is a river that flows clean honey, like honey that has been filtered, delicious and healthy for the drinker's body. Narrated by Ahmad, at-Tirmidhi, and others from Mu'awiyah bin Haidah, he said: I heard the Messenger of Allah say, \"In heaven there are oceans of milk, oceans of water, seas of honey, and oceans of khamar, then rivers flow from the oceans.\" (History of Ahmad, at-Tirmidhi, and others from Mu'awiyah bin Haidah) Secondly, in heaven there are fruits of various kinds, different colors, shapes and tastes. All of them are delicious food for every inhabitant of heaven. Third, the inhabitants of heaven are clean people from all stains and sins, because they have been forgiven by Allah the Most Merciful Lord, their Protector. Then Allah explains the condition of those who live in hell. They drink water so hot that it destroys their intestines and the fires of hell burn their faces."
		   },
		   {
			"id": 4561,
			"surah": 47,
			"ayat": 16,
			"tafsir": "This verse explains that when the Prophet Muhammad recited the Qur'an, among those who heard it there were hypocrites, but they did not understand his recitation. After they left the Prophet, they asked the Prophet's knowledgeable companions and understood all his words, \"What did Muhammad say in the meeting earlier?\" This question is a pointless one. Their purpose in doing so is nothing but to make fun of the words of the Prophet. It was as if they understood what he was saying, so they asked and responded, saying that what the Prophet said had no meaning to them at all. It was narrated by Muqatil that the Prophet Muhammad gave a sermon and explained the bad manners of the hypocrites and among those who heard the sermon there were also hypocrites. After the khutbah was finished, the hypocrite came out and asked 'Abdullah bin Mas'ud with the intention of making fun of and humiliating the Messenger of Allah. Among them they said, \"What did Muhammad say earlier?\" Ibn 'Abbas said, \"I have never been asked a question like that.\" Then the verse explains why the hypocrites do this. Those whose characteristics have been explained are those who have been branded and locked in a dead heart, so that they can no longer accept the instructions and truths that have been conveyed to them."
		   },
		   {
			"id": 4562,
			"surah": 47,
			"ayat": 17,
			"tafsir": "In this verse, the condition of the person who is opposite to the hypocrite is explained. They are people who have received guidance, believe, hear, observe, and practice the verses of the Qur'an. Their chests are expanded by Allah, their hearts become peaceful when they listen to the verses of the Qur'an or when they read it, their knowledge of Allah's religion increases. Allah adds more instructions for them by way of inspiration and guides them to do good deeds and gives them the ability to increase their obedience and piety."
		   },
		   {
			"id": 4563,
			"surah": 47,
			"ayat": 18,
			"tafsir": "People who have been branded and locked in their hearts so that they can no longer accept the truth and guidance are people whose lives are no longer useful. They are just waiting for death and the sudden arrival of the Day of Judgment. When the Day of Judgment has come, and the signs have been seen, then there will be no point in reminding them, and Allah will not accept their repentance, and there will be no use for their faith and deeds. Allah says: And on that day Hell is shown; on that day man will be conscious, but that consciousness will no longer be of use to him. (al-Fajr\/89: 23)"
		   },
		   {
			"id": 4564,
			"surah": 47,
			"ayat": 19,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad, when he is sure and knows the rewards that will be obtained by believers, as well as the punishment that will be obtained by unbelievers in the hereafter, to hold fast to Allah's religion which can bring happiness in life. in this world and in the hereafter. He was also ordered to ask Allah to forgive his sins and the sins of the believers, always pray and remember Him, and never give Satan the opportunity to carry out his bad intentions towards him. An authentic hadith says, Rasulullah saw always prayed: O Allah, forgive my mistakes, my stupidity, and my excesses, and my sins which You know better than me. O Allah, forgive the sins of my words that are not serious and my words that are serious, my mistakes, my intentions, and everything that is with me.\" (Al-Bukhari history from Abu Musa al-Asy'ari) The Messenger of Allah often prayed at the end of his prayers, before saying greeting: O Allah, forgive my previous and later sins, hidden and visible, as well as my excessive deeds and my sins that You know better than me, You are my Lord, there is no god but You.\" (Narrated by al-Bukhari and Muslim from Ibn 'Abbas) O people, repent to your Lord, so I beg forgiveness of Allah and repent to Him every day more than seventy times. (Muslim history) Abu Bakr as-shiddiq said, \"You should read, \"La ilaha illallah and istighfar.\" Read both of them repeatedly, then actually Satan said, \"I destroy people with their sins, and they destroy me by reading La ilaha illallah and istighfar, so when I found out about this, I destroyed them with their desires, they thought they were being guided.\" (History of Abu Ya'la). always deceive them as long as their lives are contained in their bodies.\" Then Allah says, \"By My might and majesty, I always forgive their sins, as long as they still ask My forgiveness.\" Then Allah encourages people to carry out His commands, stay away from the prohibitions Him, and so that he always tries to seek sustenance and happiness in his life. Allah says, \"He knows all their efforts, behavior, and actions during the day i, so is where they are at night. Therefore, fear Allah and ask forgiveness from Him.\" In another verse, Allah says: And not a single creature moves (life) on earth except that all of them are guaranteed by Allah for their sustenance. He knows where he lives and where he is stored.) All (written) in a clear Book (Lauh Mahfudz). (Hud\/11: 6) And it is He who lulls you to sleep at night and He knows what you do during the day. Then He wakes you up during the day to perfect your predetermined age. Then to Him you will return, then He will inform you of what you have done (al-An'am\/6: 60)"
		   },
		   {
			"id": 4565,
			"surah": 47,
			"ayat": 20,
			"tafsir": "Those who sincerely believe in Allah and His Messenger are willing to sacrifice their wealth and lives in the cause of Allah. They are waiting for Allah's revelations to come down, especially revelations related to the command of jihad. However, the order of war was basically not to attack, but to defend oneself from enemy attacks, as happened with the Badr War, Uhud War, Khandak War, and others. They said, \"Why didn't Allah send down to us verses that were firm and clear in meaning in which it was stated that fighting in defense of Allah's religion is an obligatory commandment that must be carried out by every believer.\" On the other hand, hypocrites have a different attitude. When a verse is revealed with a clear and clear meaning which contains the command of jihad, look at the Prophet with a look of denial and fear. Their hearts trembled, their bodies trembled at the sound of it, and they fell silent, like people at death's door. In another verse, Allah says: Don't you pay attention to those who are told to them, \"Hold your hands (from fighting), pray and pay zakat!\" When they were obligated to fight, suddenly some of them (the hypocrites) were afraid of humans (enemies), as they feared Allah, even more afraid (than that). They said, \"O our Lord, why did you oblige us to fight? Why didn't you delay (the obligation to fight) for us a little longer?\" Say, \"There are only a few pleasures in this world and the hereafter is better for those who are pious (getting the reward of participating in the war) and you will not be wronged in the slightest.\" (an-Nisa'\/4: 77) From the answers and attitudes of the hypocrites, it is clear what is implied in their hearts. Such a person would rather die than live to restrain himself from religious orders. Someone lives to be a servant of Allah who is obedient to Him, wants to achieve happiness in life in this world and in the hereafter. The hypocrite does not carry out that obedience. They seem not to think about the happiness of life after death. Therefore, there is no meaning in life for them other than to multiply their sinful deeds which will cause them to be punished in the hereafter. If they die right then and there, their punishment will not increase in the hereafter."
		   },
		   {
			"id": 4566,
			"surah": 47,
			"ayat": 21,
			"tafsir": "This verse explains that the attitude that hypocrites should have is to obey Allah, speak good words, rather than be afraid, and be afraid of facing enemies. However, they are not. That's because the pleasures of living in the world have made them fascinated and forget themselves. They are afraid to lose the fun. Even if they know that the pleasures of life in this world are pseudo and temporary pleasures, while the pleasures of life in the hereafter are true pleasures, they will change their attitude. It was further explained that when the orders for war came to the hypocrites, hatred arose in their hearts so that they were reluctant to join the war. If they had strong faith in their bosoms, were truly obedient to Allah and followed the Messenger, they would have joined the war with the Apostle. That is better for them because then they are closer to Allah."
		   },
		   {
			"id": 4567,
			"surah": 47,
			"ayat": 22,
			"tafsir": "This verse denounces the attitude of the hypocrites who always pursue the pleasures of life in this world, saying, \"O hypocrites, because you are always pursuing the pleasures of life in this world and its luxuries, if you were in power, you would surely have selfish traits by showing power over the common people, likes to take and rape the rights of other people, and sever ties of silaturrahim which are highly recommended to be continued."
		   },
		   {
			"id": 4568,
			"surah": 47,
			"ayat": 23,
			"tafsir": "Hypocrites who behave as mentioned above have been kept away from Allah's grace. Therefore, Allah deprived them of hearing so that they could not benefit from what they could hear, and Allah blinded them so that they could not benefit from what they saw."
		   },
		   {
			"id": 4569,
			"surah": 47,
			"ayat": 24,
			"tafsir": "Do these hypocrites not pay attention to and understand the teachings of Allah contained in the Qur'an, nor do they ponder and think about it, so that they know the mistakes in their attitude and actions so far? Or have their hearts and eyes locked so that they can no longer understand its contents? The attitudes and actions taken by the hypocrites were not only carried out against believers, but also towards Jews. They expressed their willingness to cooperate with Bani Nadhir and Bani Quraidzah Jews. In fact, they were willing to follow some of the wishes of the Jews to attract them, but they did not fulfill all the promises and willingness. They sometimes don't hesitate to harm friends they conspire with, by striking friends along the way. Allah said: Have you not looked at the hypocrites who say to their disbelieving brothers among the People of the Book, \"Surely, if you are driven out, we will surely go out with you; and we will never obey anyone for your sake. , and if you are fought we will certainly help you.\" And Allah witnessed, that they really are liars. (al-hashr\/59: 11)"
		   },
		   {
			"id": 4570,
			"surah": 47,
			"ayat": 25,
			"tafsir": "In this verse it is explained that those who return to disbelief after it is clear to them the straight path that must be taken by doing sinful and misguided deeds are people who have been consumed and influenced by Satan's tricks. Satan makes the acts of sin and misguidance that they do as good deeds in their eyes, so that they live wallowing in sin and error. Besides, they are lulled by false dreams, according to the impulse of their lust. Thus, lust becomes a measure of the good or bad of an action. What their lusts think is good, that is what they think is good. These things bring out the hypocrisy in them."
		   },
		   {
			"id": 4571,
			"surah": 47,
			"ayat": 26,
			"tafsir": "The hypocrites returned to disbelief, even though before they appeared to have believed, because they sided with and allied with the Jews from Bani Nadhir and Bani Quraidzah to fight the believers. The hypocrites declared that they would fight on the side of Bani Nadhir and Bani Quraidzah against the Muslims if the Jewish tribe was expelled from Medina. The Jews once advised the hypocrites to openly display their disbelief. However, they disobeyed that recommendation, except in a few cases. Among those they disobeyed was the exhortation to openly declare their disbelief. They kept their disbelief a secret because they still hoped to benefit by hiding it. However, Allah knows their secret actions, for there is nothing that He does not know. In another verse, Allah explains how they arrange their schemes and deceptions. Allah says: And they (the hypocrites) say, \"(Our obligation is only) to obey.\" However, if they have left your side (Muhammad, some of them have made a strategy at night (made a decision) other than what they said earlier. Allah records the strategy they arranged at night, so turn away from them and put your trust in Allah .Sufficient is Allah who is the protector.(an-Nisa'\/4: 81)"
		   },
		   {
			"id": 4572,
			"surah": 47,
			"ayat": 27,
			"tafsir": "This verse still talks about the hypocrites, what will they do if they remain in that hypocrisy. They can only practice hypocrisy and deceit while they are alive, in power, and in good physical and spiritual health. What would they think if Allah took away their health in an instant, and old age also gradually approached their lives? How did they think when death approached them and the angel of death struck them on the face and back; what are they going to do? What will they think if they die suddenly, so that there is not the slightest chance for them to repent to Allah who determines everything in the hereafter? If they think about and meditate on all of this, they will certainly not commit acts of denial and sin. In this verse it is stated that when the angels will take their souls, the angels will expel their spirits violently and violently and beat their faces and backs. Arabs are very afraid of being hit in the face and back. Because they were afraid of being hit by the enemy in the face and back, they did not want to go to war. This verse shows the condition of the hypocrites in a state of misery and humiliation at the time of death. Allah says: And if you saw when the angels took the souls of those who disbelieved while hitting their faces and backs (al-Anfal\/8: 50)"
		   },
		   {
			"id": 4573,
			"surah": 47,
			"ayat": 28,
			"tafsir": "They experience this condition because they often do immoral things, always deny Allah, follow their lusts, and do not want to do the work that pleases Him. They worship Allah just because they are happy and want people to respect them. Therefore, all the charities they do, such as giving charity and helping people who are weak, poor and miserable, are of no use and benefit. Because, charity and good deeds that can be accepted if based on faith in Allah and His Messenger."
		   },
		   {
			"id": 4574,
			"surah": 47,
			"ayat": 29,
			"tafsir": "Do the hypocrites think that in their enmity, and the evil intentions towards believers that are hidden in their hearts will not be known? Do they think that Allah does not know about it so He does not tell His Messenger and those who believe? Allah, the All-Knowing of all things, will tell His believing servants about all their evil secrets. Regarding the secrets and evil plans of the hypocrites are explained at length in surahh at-Taubah. Among them is the word of Allah: Men and women hypocrites, one to another are (the same), they order (do) what is wrong and prevent (deeds) that are good and they clasp their hands ( miserly). They had forgotten Allah, so Allah forgot them (too). Indeed, the hypocrites are the wicked. (at-Taubah\/9: 67)"
		   },
		   {
			"id": 4575,
			"surah": 47,
			"ayat": 30,
			"tafsir": "In this verse, Allah said to Rasulullah SAW, \"O Muhammad, if We wished to introduce you to the hypocrites so that you would know them one by one based on their signs, it would not be difficult for Us to do so. However, , We did not do this, so that they would not persecute their families who believe in Us. Even so, you can recognize these hypocrites by paying attention to their expressions and the way they speak. They do not want to speak clearly and clearly, but always using hints and satire as well as allusions that were unclear in meaning, and they acted and acted not in accordance with what they said. During the time of the Prophet Muhammad, when speaking, hypocrites always used grandiose words and pleased their listeners, but in their hearts contained evil intentions. Al-Kalbi said, \"After this verse was revealed, the Messenger of Allah knew know the hypocrites when they talk to him. While Anas ra said, \"Allah informs the hypocrites to the Messenger of Allah by way of revelation or by the signs that are shown to him.\" Regarding the hypocrites, 'Uthman bin 'Affan said, \"There is no secret that is hidden in a person's heart, unless Allah reveals it in his facial expressions and outward speech.\" At the end of this verse, Allah states that the situation of a believer is not the same as that of a hypocrite. He will repay the deeds of the believers according to their respective intentions and intentions, because Allah knows their deeds."
		   },
		   {
			"id": 4576,
			"surah": 47,
			"ayat": 31,
			"tafsir": "With the provision of war and other heavy obligations, Allah tests the faith of the Muslims until it is known who is fighting jihad in His way and who is not, and who is patient and who is not. With these trials, the faith of those who are patient will grow stronger and the faith of those who doubt will decrease."
		   },
		   {
			"id": 4577,
			"surah": 47,
			"ayat": 32,
			"tafsir": "This verse explains that those who deny the oneness of Allah, prevent people from embracing His religion brought by the Prophet Muhammad, oppose and fight against it after having presented them with strong evidence, then all their actions will not cause harm to Allah. and to the development of His religion because Allah is Almighty and His will is sure to be done. He helps His Messenger in the world and punishes everyone who opposes Him. In the hereafter all their efforts will not succeed in the slightest. \"People who hinder people in the way of Allah\" mentioned in this verse mean people who prevent other people from entering Islam in various ways. It can also mean people who try to destroy Islam and the Muslims, either openly or secretly. It is narrated that this verse was revealed in connection with the Jews from Bani Quraidzah and Bani Nadhir. They prevent people from embracing God's religion after clear evidence has come to them in the Torah and the miracles reported by the Prophet. Their actions will not benefit in the slightest against Allah's plan and will, but instead will destroy themselves, with the failure of all their efforts, and the punishment they will receive in the Hereafter. This verse also relates to the Jews who hindered the Bani Sa'ad from embracing Islam, then they complained about this to the Prophet Muhammad. He answered the complaint with this verse, which stated that the actions of the Jews would not harm Allah, but would harm themselves."
		   },
		   {
			"id": 4578,
			"surah": 47,
			"ayat": 33,
			"tafsir": "In this verse, Allah asks believers to obey Him and His Messenger and not pay attention to the attitudes and actions of disbelievers. They should have faith, acknowledge the oneness and power of Allah who has perfect characteristics, obey His commands, carry out His teachings, and not violate His commands which will result in the loss of the charitable rewards they have done. According to Abu al-'Aliyah, \"Initially the Companions were of the opinion that no single sin could undermine a person's pledge that \"there is no god but Allah\", just as there was no benefit from a deed based on shirk until this verse was revealed. After the revelation of the verse this, the friends are worried, lest their deeds will be canceled because of a sinful act.\" Ibn 'Umar said, \"All of us, the companions of the Messenger of Allah, thought that good deeds would be accepted by Allah until the revelation of this verse. After this verse was revealed, we asked, 'What are the things that nullify the rewards of our deeds? So the Messenger of Allah replied, 'A big sin, evil deeds, and abominable deeds. After that when one of us commits the mentioned sin (adultery), we say, 'Verily, the reward of his deeds has been erased, until the verse comes down which means,' Verily Allah does not forgive the sins of those who associate partners with Him, but forgives other than that for whom He wills. After that we did not talk about it anymore.\" There are commentators who argue that what is meant by obedience to Allah is practicing the contents of the Qur'an. Meanwhile, what is meant by obeying the Apostle is following and carrying out all the orders and prohibitions contained in his hadiths."
		   },
		   {
			"id": 4579,
			"surah": 47,
			"ayat": 34,
			"tafsir": "This verse explains that the person who denies the power and oneness of Allah, denies the call of His Messenger, obstructs people from His path, then dies in a state of disbelief, Allah will never forgive his sins because the door is repentance and forgiveness. Allah only exists while still alive in the world. If someone has died, then everything is closed to him. Some commentators explain that this verse was revealed in connection with the disbelievers who died in the Battle of Badr who were buried in a well. Regardless of whether that opinion is true or not, this verse applies to everyone everywhere and at any time, that everyone who dies in a state of disbelief, Allah will not forgive his sins."
		   },
		   {
			"id": 4580,
			"surah": 47,
			"ayat": 35,
			"tafsir": "In this verse, Allah asks those who believe, when the order to carry out jihad has been issued and they know that Allah will definitely help those who believe, they must feel strong, not lose heart, and never invite the enemy to make peace. They are people who believe that Muslims will gain a high degree in the sight of Allah. Allah remains with them and will not reduce their reward in the least. Allah will not be with disbelievers, let alone help them, because they are actually Allah's creatures who lower their own rank."
		   },
		   {
			"id": 4581,
			"surah": 47,
			"ayat": 36,
			"tafsir": "Allah encourages those who believe to wage jihad and spend wealth in His way, to destroy the enemies of Allah and their enemies, namely the Meccan infidels. They should never be fascinated by worldly life which causes them to leave jihad because worldly life is only temporary, only as a game, and a joke. Everything in this world will disappear, except obedience and worship to Allah because obedience and worship are the cause for obtaining real life later in the hereafter. From this verse it can be understood that jihad in the way of Allah includes acts of worship that show obedience and obedience to Him. Therefore, do jihad as you do other acts of worship. Furthermore, Allah states that the actions that can be the real preparation in the hereafter are to believe in Allah, carry out all commands and keep away from all His prohibitions, and spend wealth in His way as taught by the Prophet Muhammad. What is required of the assets donated is only a small portion of the income, not all of it, and is given as zakat, alms, charity, and so on. If they do this, Allah will reward them with a multiplied reward in the form of serenity in this world and heaven in the hereafter."
		   },
		   {
			"id": 4582,
			"surah": 47,
			"ayat": 37,
			"tafsir": "In this verse, Allah explains that one of the despicable traits of a human being is miserliness and a great love and desire for wealth. Allah stated that He did not ask them to give their entire wealth to the weak Muslims. If He asked for everything like that, surely they would not give it because they are too greedy for wealth and will not give it to the poor. Allah knows such. The more often the request is repeated, the more hatred and envy they feel towards these poor people. The miserly nature has become human nature. It is a trait that is brought in later, as Allah says: And peace is better (for them) even though man is by nature miserly. (an-Nisa'\/4: 128) Allah SWT says: And whoever guards himself from miserliness, then they are the lucky ones. (al-hasyr\/59: 9) In another verse it is stated that if humans can eliminate or reduce their stinginess, then they will be lucky people to live in this world and in the hereafter."
		   },
		   {
			"id": 4583,
			"surah": 47,
			"ayat": 38,
			"tafsir": "This verse explains that Allah called them to get rid of miserliness. They are asked to spend their wealth in the way of Allah. It is explained that those who are miserly, do not want to spend their wealth in the way of Allah, then their stinginess will harm themselves because being stingy will disrupt relations in society and will erase their reward, distance themselves from Allah and heaven. When humans spend, it is not for Allah because He does not need their wealth, because He is All-Rich, does not need anything. This infaq is precisely for their benefit because Allah will reward them many times over, plus the reward for which is heaven. Then Allah threatened them by saying that if they turn away, that is, do not believe and do not want to fulfill His commands by spending, then Allah will destroy them, then replace them with other people who are not like them, namely people who want to spend, wage jihad, carry out His commands, and stay away from His prohibitions. Narrated by al-Baihaqi, at-Tirmidhi and others from Abu Hurairah said: The Messenger of Allah read this verse to the end, then the companions asked, \"O Messenger of Allah, who are those people who if we turn away they will replace us and they unlike us?\" So the Messenger of Allah tapped Salman on the shoulder, then said, \"This is the person and his people. By Allah, in whose hands I am, if religion were hanging on the sun, it would be reached by people from Persia.\""
		   }
	]
}
