{
	"tafseer": [
		{
			"id": 1474,
			"surah": 11,
			"ayat": 1,
			"tafsir": "Allah begins this surah with three letters Alif, Lam, Ra, as at the beginning of the previous surah Yunus, with the same intention of demanding real attention from the listener. After that Allah explained that the Qur'an is a book whose verses are neatly arranged and concise, and the meaning is clear. Because of the neatness and density of the arrangement of the verses, it is impossible to change the words, either the location or the letters. In addition, the verses are explained in detail according to the problem and scattered in the surah. There are verses related to faith, law, morals, stories, and some are related to science, such as the process of human occurrence. Thus the verses of the Qur'an are like a crystal ball which reflects various brilliant lights and has a high overall value. Indeed, the Al-Qur'an, with the harmony of the editorial composition of the verses and detailed explanations according to their contents, was sent down from Allah, the All-Wise, All-Knowing, Wisely, He sent down verses according to the needs of His servants, what is good for them. , because He is All-Knowing of all things."
		   },
		   {
			"id": 1475,
			"surah": 11,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that the Al-Qur'an was revealed with a neat arrangement and editorial of verses and with detailed descriptions so that people believe that the Al-Quran is from Allah, contains His instructions and prohibitions, especially the prohibition of worshiping other than Allah. . Therefore, this verse starts with the prohibition. The Messenger of Allah is only a bearer of a warning about Allah's punishment for those who associate partners with Allah, and a bearer of good news about the reward for those who are obedient and sincere in worshiping Allah. Calling people to worship God is the task of the apostles since ancient times. Allah's Word: And We did not send any messenger before you (Muhammad), but We revealed to him, that there is no god (who has the right to be worshiped) besides Me, so worship Me. (al-Anbiya\/21: 25)"
		   },
		   {
			"id": 1476,
			"surah": 11,
			"ayat": 3,
			"tafsir": "The Prophet Muhammad called on the polytheists to ask forgiveness from God for the sins of shirk, disbelief, and crimes that they had committed. After that they should return to Allah, obediently do His commands and worship Allah wholeheartedly and not worship other than Allah, such as statues and idols and so on. If they ever do that, let them ask forgiveness and repent steadfastly and continuously. Allah will surely forgive them and give them abundant sustenance, prosperity, health and well-being until the end of their lives. Thus, sincere faith in Allah and the Messenger of every individual, is the main factor that causes prosperity and happiness in life. Allah's Word: Whoever does good, both men and women in a state of faith, We will surely give him a good life and We will reward him with a better reward than what they have done. (an-Nahl\/16: 97) Apart from giving the enjoyment of life in the world to believers, Allah also gives to people who have virtue, such as people who have knowledge or great works, rewards in this world and rewards in the hereafter. But if people turn away from the faith and do not repent and even continue to engage in polytheism, disobedience, and moral decay, they will experience destruction or poverty to live according to the Sunnah of Allah on mankind and Allah's punishment in the Hereafter."
		   },
		   {
			"id": 1477,
			"surah": 11,
			"ayat": 4,
			"tafsir": "In this verse Allah confirms that all mankind, whether those who believe or those who disbelieve, who repent or who deny and immorality, will return to Allah after the end of their lives, no one will be left behind. It is before Allah that each human being will be brought to account and will be rewarded as fairly as possible. Glory to Allah, Almighty over all things, He gives good to those who love Him and He gives bad things to those who cover their existence."
		   },
		   {
			"id": 1478,
			"surah": 11,
			"ayat": 5,
			"tafsir": "In this verse Allah warns and demands human attention to learn the lessons and characteristics of those who reject the truth. They don't want to listen to preaching and religious teachings, so they lower their heads to hide their faces because they are ashamed. Their faces were not strong against the rays of truth (Qur'an) when it was read to them, but these rays penetrated their souls so that they hid their faces from the Messenger of Allah."
		   },
		   {
			"id": 1479,
			"surah": 11,
			"ayat": 6,
			"tafsir": "Creeping animals, which live on earth which includes animals that crawl, crawl, or even walk on two legs, are all guaranteed sustenance by Allah. These animals are given instincts and the ability to seek their sustenance according to the nature of events, everything is arranged by Allah with His wisdom and wisdom so that there is always harmony. If this is not regulated, it is possible that at one point in time there will be animals that reproduce too quickly, thus threatening the survival of other animals, or there will be too many that die, thus disturbing the balance of the environment. If some animals prey on other animals, it is in the framework of natural balance, so that a harmonious life can always be maintained. Allah knows where these animals live and where they hide, even when they are still in their mother's belly. In both places, Allah always guarantees his sustenance and all of this has been recorded and arranged as neatly as possible in Lauh Mahfudh, which contains all the planning and implementation of all of Allah's creations in a comprehensive and perfect manner."
		   },
		   {
			"id": 1480,
			"surah": 11,
			"ayat": 7,
			"tafsir": "Allah created the heavens and the earth in six times. In this verse it is mentioned \"sittati ayyam\", which means \"six days\". Astronomy scholars have determined that the days that have to do with the circulation of the stars are not the same as the levels of days that apply on this earth. Then Allah explained that His throne before the creation of the heavens and the earth, was on water. The Throne or Throne of Allah belongs to the unseen realm, which cannot be perceived with the five senses, and it is also impossible to imagine or imagine its shape and appearance, let alone how God resides on that throne. The verses that explain this are mutasyabihat verses, the truth of which we must believe by submitting their understanding to Allah. Umm Salamah, Rabi'ah and Malik narrated that the Companions in interpreting mutasyabihat verses like that always said, \"Istiwa (His residence) is known but the way is not known.\" This verse shows that what is under Allah's Throne is water which Allah made as the main ingredient in creating living things as He says: And did the disbelievers not know that the heavens and the earth were together, then We separated them? ; and We made every living thing out of water; then why do they not believe? (al-Anbiya'\/21: 30) Then Allah explained that the purpose of creating the heavens and the earth in six periods, and the existence of the 'Throne above the water, which is the basic element of all living things is to test which of the humans is better his deeds. Allah has provided all that is on this earth for human use, as His word says: It is He (Allah) who created all that is on earth for you. (al-Baqarah\/2: 29) All humans who are on the surface of the earth are ordered to try with all their might and abilities, to take advantage of the contents of nature, to explore the benefits of this universe, which is on earth, in the sea and in the air like minerals found in the bowels of the earth, at the bottom of the sea and so on, so that the maximum benefits can be extracted, to be used by all mankind, as a gift from Allah, the Lord of the worlds. Allah created the heavens and the earth as a test for humans, which of them has the strongest faith and the best deeds, the most meritorious for humanity, who has the most outstanding skills, who has the highest production results, who is the most honest and sincere in his business. etc. Of course Allah does not only test him, but also pays attention to the results of his tests, and gives a reward in proportion to his services. Allah's reward is given after the Day of Judgment. However, if the Prophet Muhammad told the polytheists in the city of Mecca that they would be raised after death to account for all their deeds while in the world, then they would answer, \"What you put forward from the Qur'an is just magic, to suppress us and to prevent us from the pleasures and delights of this world.\""
		   },
		   {
			"id": 1481,
			"surah": 11,
			"ayat": 8,
			"tafsir": "From the answers of these polytheists, it is clear that they only follow the existence of life in the world; while the life that is in the hereafter, they deny. If Allah delays the coming of the doom that His Messenger has threatened them with until the appointed time, they scoff and say, \"What is it that hinders the coming of the doom to us, if it is true that the doom will come.\" Allah threatens that the doom will surely come, at the time determined by Allah himself, and later when the doom comes, then no one will turn it away, and no one can hold back or reject it. They will be surrounded on all sides by punishment, which they always make fun of."
		   },
		   {
			"id": 1482,
			"surah": 11,
			"ayat": 9,
			"tafsir": "Allah explains that if Allah gives to humans a kind of favor, as His gift, such as generosity of sustenance, profits in trade, physical health, domestic security, and pious children, then Allah revokes these blessings, then humans immediately change their character. be desperate. They only show disobedience and no longer appreciate the blessings that still exist in them. Apart from being desperate for the loss of these blessings, they also deny the blessings that still exist in them. This is because he lacks the two main qualities of patience and gratitude."
		   },
		   {
			"id": 1483,
			"surah": 11,
			"ayat": 10,
			"tafsir": "If Allah prevents humans from the harm that has befallen them, and replaces it with some pleasures such as healing from illness, increasing energy and strength, regardless of difficulties, being safe from fear, then he says, \"I have lost misfortune and suffering that will not come back again.\" .\" Disasters and suffering are nothing but clouds in the dry season that will soon disappear. They spoke such words with arrogance and pride. They feel happier than everyone around them. Basically they do not accept God's favors with gratitude, instead they are arrogant and arrogant."
		   },
		   {
			"id": 1484,
			"surah": 11,
			"ayat": 11,
			"tafsir": "Then Allah excludes from people who are like the above, some patient people who always do good. They are patient when disaster strikes, believe in Allah, hope for His reward, and do good deeds when the misfortune has been replaced with pleasure, and are grateful for the blessing by practicing various good deeds to achieve Allah's pleasure, they will receive forgiveness from Allah and great reward in the hereafter, as stated in His words: By the time. Indeed, mankind is in loss, except for those who believe and do good and exhort one another to truth and exhort one another to patience. (al-Ashr\/103: 1- 3)"
		   },
		   {
			"id": 1485,
			"surah": 11,
			"ayat": 12,
			"tafsir": "In this verse, Allah swt reprimands the Prophet Muhammad saw whether he left some of the revelations revealed to him, or whether his chest became narrow because of the words of the polytheists who asked for proof of his apostleship. Their demand was that if he really was a prophet, why wasn't wealth (wealth) revealed to him or why didn't angels come to him to confirm his apostleship. Such remarks are also explained in another word of Allah: And they said, \"Why did this Apostle (Muhammad) eat food and walk in the markets? Why was not an angel sent down to him (so that the angel) gave warning with him, or (why not wealth is sent down to him or (why is there no) garden for him, so he can eat from (the yield) of it?\" (al-Furqan\/25: 7-8) Speeches of this kind which contained denial and ridicule which caused constriction of the chest in the people he faced were also experienced by the Prophet Muhammad himself. At first it was feared that he would be swayed by such utterances, that he would leave behind some of the revelations which had been revealed to him. However, the Prophet Muhammad was protected from such actions and he consistently carried out his treatise perfectly according to the word of Allah: And if We had not strengthened your (heart), you would have almost leaned a little towards them. (al-Isra\/17: 74) Likewise Allah's word: Then perhaps you (Muhammad) will harm yourself because of grief after they turn away, if they do not believe in this information (Al-Quran). (al-Kahf\/18: 6) Allah explains that the Prophet's position is only as a warner and his task is only to convey Allah's commands to his people. At the end of the verse Allah states that He always takes care of all the affairs of His servants."
		   },
		   {
			"id": 1486,
			"surah": 11,
			"ayat": 13,
			"tafsir": "The Meccan infidels accused Muhammad of having created the Koran. They accuse that the Koran is not a revelation from Allah, but solely made by Muhammad. So the Prophet Muhammad was ordered to challenge the Quraysh infidels, including those who doubted that the Koran was the word of God, to make ten surahhs the same as the Koran whose contents include social laws (shari'a), social wisdom, -wisdom, advice, unseen news about the former peoples and unseen news about events to come, with a very beautiful and subtle arrangement of words, difficult for anyone to imitate because of the high level of the language has a very deep influence on the souls of everyone who reads and hears it. After that it was explained that they already knew Muhammad. He had been hanging out among them for decades, and they never found him lying or breaking a promise to earn the title al-Amin. With a character that has been known for his honesty since before he was appointed as a prophet, it is not natural for him to suddenly turn into a fraud or a liar as they accuse him of, namely making up the Al-Quran and saying it is from Allah. A writer, no matter how clever and proficient he is in writing an essay, of course, can be imitated or matched by other writers. However, the polytheists were unable to create surahhs similar to the Koran, even though they, as leaders of the Quraysh, were poets, linguists, and accomplished writers, because their literary works in the form of poetry were often exhibited and even competed in musabaqah arenas. the beauty of language at the Ukadh market, dzul Majaz, and Majannah. If they individually prove unable to present surahhs that are the same as the Koran, then they are welcome to invite people who can help them if they are true people."
		   },
		   {
			"id": 1487,
			"surah": 11,
			"ayat": 14,
			"tafsir": "This verse explains that if polytheists are unable to meet the Prophet's challenge, even though they are accomplished linguists and literary experts, then know that the Al-Quran was not made by Muhammad, but solely sent down by Allah at His will, so that it was conveyed by Muhammad to all his people. Also know that there is no God who must be worshiped in truth except Him, because only Allah knows all things that are unseen, who has no counterpart or partner in carrying out His power. At the end of the verse, Allah commands them to surrender to Allah after they learn of this very strong evidence and that they accept Islam as a religion."
		   },
		   {
			"id": 1488,
			"surah": 11,
			"ayat": 15,
			"tafsir": "Whoever wants the pleasures of life in this world such as food, drink, jewelry, clothing, household furniture, livestock, and children without making preparations for life in the hereafter, such as doing good deeds, cleansing himself from various reprehensible qualities, then Allah will give them what they want according to the sunnatullah or Allah's provisions. He will not detract from the results of their efforts in the slightest, because to obtain such sustenance is related to one's efforts. The results of their efforts in this world depend on their efforts and the sunnatullah in life, while the deeds in the hereafter, the reward is determined by Allah Taala Himself without any intermediaries."
		   },
		   {
			"id": 1489,
			"surah": 11,
			"ayat": 16,
			"tafsir": "People whose deeds are only intended to achieve the happiness of living in this world and are not intended as preparation for the afterlife, will not get anything except hell. They strive in this world not because of the encouragement of faith in Allah and not to cleanse themselves from sin and evil nor to pursue virtue and piety, but solely to fulfill their desires as much as they want. That is why Allah makes what they have done in the world in vain. Allah says: Whoever desires the present (worldly) life, We will hasten for him in this (world) what We wish for those We wish. Then We prepared for him (in the Hereafter) the Hell of Hell; he will enter it in disgrace and banishment. And whoever desires the afterlife and strives towards it earnestly, while he believes, then those are the people whose efforts are well rewarded. (al-Isra\/17: 18-19) Allah says: Whoever wants profit in the Hereafter, We will increase it for him and whoever wants profit in the world, We will give him some of it (worldly profit), but he will not get a share in it. hereafter. (asy-Shura\/42: 20)"
		   },
		   {
			"id": 1490,
			"surah": 11,
			"ayat": 17,
			"tafsir": "Then Allah explained that the fate of the disbelievers who went astray was not the same as those who were under a bright light that came from Allah and were also guided by His instructions which proved the truth of their religion, namely the Al-Quran. This truth is also supported by other evidence that came before it, namely the Torah which was revealed to Moses as the foundation of faith which is a mercy for those who believe in it among the Children of Israel. People who have such characteristics are of course not the same as people who only pursue life in this mortal world, nor are they the same as people who prioritize spiritual life only to achieve happiness in the hereafter. Whoever pays attention to some of the virtues mentioned in this verse, they are people who believe, who compile between real evidence and arguments taken from other books. They believe that the Koran was not made by Muhammad but is merely a revelation and the word of God. Therefore, no one should doubt the truth of the Koran. The Koran does not contain falsehood, both its first verses and the last. He is the word of Allah, the Most Wise and Most Praised. But it is very unfortunate that most people do not believe in him. As for the polytheists, they do not want to believe because of the arrogance of their leaders and because of the blind obedience of their followers to the misguided teachings of their forefathers. Likewise the people of the book, because they like to change the religion of their prophets and carry out various kinds of heresy in religion."
		   },
		   {
			"id": 1491,
			"surah": 11,
			"ayat": 18,
			"tafsir": "Allah swt explains that the people who are most persecuted to themselves and to others are those who lie to Allah with words and deeds, namely those who deny Allah's law and His attributes or who appoint their leaders as helpers. who can intercede in the hereafter without Allah's permission, or those who think that Allah has children like the opinion of the Jahiliyyah Arabs that angels are the daughters of Allah and the opinion of the Christians that Prophet Isa as is the son of Allah, or those who belied Allah's messengers with the intention of hindering people from believing. On the Day of Judgment all their deeds will be brought before Allah to be judged. At that time, angels, prophets, and pious believers will appear as witnesses that they are the ones who tell lies against Allah. With that testimony, their falsehoods will be exposed, and they will be cursed by Allah as a recompense for their tyranny. Allah says: (That is) the day when apologies are of no use to the wrongdoers and they are cursed and have a bad place to live. (al-Mumin\/40: 52)"
		   },
		   {
			"id": 1492,
			"surah": 11,
			"ayat": 19,
			"tafsir": "Then Allah swt explained that in fact those who are unjust are those who hinder people from the path of Allah and turn them away from the true religion and the straight path. They try to mislead people by inviting them to a deviant religion so that they run away from the true religion. They deliberately do so, because basically they do not believe in the hereafter. Allah says: Those who disbelieve and hinder (people) from the path of Allah, We add to them torment after torment because they always do mischief. (an-Nahl\/16: 88)"
		   },
		   {
			"id": 1493,
			"surah": 11,
			"ayat": 20,
			"tafsir": "Allah swt explained that those who block people from going to the path of Allah, will not be able to escape Allah's punishment, even if they run to any corner of the earth. When the doom comes upon them, they will definitely be in the hands of the angels and no one can help or save them from that punishment, even Allah's punishment will be doubly inflicted; firstly because of his misguidance and secondly because of misleading others. And also because they do not want to listen to the call of the Koran and see the truth, because they have been overwhelmed by a heretical belief, polytheism, and tyranny, they even have a negative attitude towards the call of the Koran, as explained by Allah: And those who disbelieve say , \"Do not listen to (the recitation) of this Koran and make noise against it, so that you can defeat (them).\" (Fushshilat\/41: 26)"
		   },
		   {
			"id": 1494,
			"surah": 11,
			"ayat": 21,
			"tafsir": "After that Allah SWT explained that those who have such characteristics are people who harm themselves. They were removed from Allah's grace, because they fabricated lies, exchanged guidance for misguidance, and worshiped idols, which could not bring harm or benefit at all, so that what they had always hoped for disappeared. Allah says: And whoever Allah guides, he is the one who gets the guidance, and whoever He misleads, then you will find no helpers for them besides Him. And We will gather them on the Day of Resurrection with their faces downcast, blind, dumb and deaf. Their abode is Hell Hell. Every time the flames of Hell are extinguished, We add more flames for them. (al-Isra\/17: 97)"
		   },
		   {
			"id": 1495,
			"surah": 11,
			"ayat": 22,
			"tafsir": "The people whose characteristics were mentioned in the previous verse, are the ones who will lose the most in the hereafter, because they have exchanged the pleasures of heaven for a very hot hell fire, exchanged delicious drinks for burning drinks, and left a happy and happy life with live suffering in hell, which is full of unending punishment."
		   },
		   {
			"id": 1496,
			"surah": 11,
			"ayat": 23,
			"tafsir": "Very different from the fate of those who believe and do good deeds. They always surrender to Allah by obeying and obeying Him and His messengers, doing various good deeds in the world, carrying out obedience to Allah sincerely and leaving all that is wrong. They are residents of heaven who will never come out of it again, and they will not die, and will remain in it forever."
		   },
		   {
			"id": 1497,
			"surah": 11,
			"ayat": 24,
			"tafsir": "In this verse, Allah SWT explains that the parable of the two groups, namely the disbelievers and the believers, is like the blind and deaf with those who see and hear. A deaf person who has lost his sense of hearing certainly cannot grasp the knowledge that is the distinguishing element between humans and animals, and a person who is blind due to loss of sight cannot witness the truth that he sees. Likewise, a disbeliever who is likened to a blind and deaf person, of course, cannot be equated with a believer who can use his two senses perfectly. This deserves to be a lesson that has a deep impression on the human heart so that everyone will try to be able to make the most of their sight and hearing, both physically and mentally."
		   },
		   {
			"id": 1498,
			"surah": 11,
			"ayat": 25,
			"tafsir": "In this verse, Allah swt explains that He has sent the Prophet Nuh as to his people who were disobedient and disobedient to God by worshiping idols. Prophet Noah said to them, \"Indeed I am giving a warning from Allah, so that you leave shirk and have faith and obey Him.\" The name of Prophet Noah as is actually Abdul Gaffar bin Lamak bin Mutausyilkh bin Idris as and was sent as a prophet after Prophet Idris as. According to Ibn Abbas ra, Prophet Noah was sent at the beginning of his 40 years of age and continuously carried out da'wah to his people for 950 years. Prophet Noah, among others, said to his people, \"Innī nadzīrun mubīn\" (Indeed, I am a real warner for you). That is, Prophet Noah warned his people of the severity of Allah's punishment that would befall them because of their disbelief. So Prophet Noah ordered his people to believe and obey Him."
		   },
		   {
			"id": 1499,
			"surah": 11,
			"ayat": 26,
			"tafsir": "This warning is explained in the words, \"So that all of you do not worship except Allah, and do not associate anything with Him, and I am afraid that if you violate the foundations of that religion, you will be subject to a very painful punishment.\" In this verse, the Prophet Noah's warning was expressed to his people, when he said, \"All of you should not worship except Allah, and do not associate partners with Him. I am really worried because you all commit many violations of religious rules, so that you will be punished painful one.\" Noah's people were the first people to worship idols and practice polytheism. Prophet Noah himself was the first apostle to face polytheists, who were sent by Allah to his people. Prophet Noah's warning was based on his concern that if his people did not believe in God, and did not leave all forms of polytheism, they would suffer a very painful punishment. However, Noah's people opposed the call of his prophet with four contrived reasons as stated in the next verse (verse 27)."
		   },
		   {
			"id": 1500,
			"surah": 11,
			"ayat": 27,
			"tafsir": "First, the leaders said, \"We see you as an ordinary human being, equal to us. You have no advantages over us, so we don't need to follow you, let alone acknowledge you as a messenger of God.\" Second, \"We see that your followers are lowly people, ordinary people, such as farmers, laborers, and daily workers who do not have a high position in society. They are quick to believe and are simply influenced without any rational consideration.\" Third, \"We do not see that you and your followers have superior knowledge or wealth to be proud of, which compels us to follow your call.\" Fourth: \"We believe that your claim to be a messenger of Allah is simply a lie.\""
		   },
		   {
			"id": 1501,
			"surah": 11,
			"ayat": 28,
			"tafsir": "Prophet Nuh as asked, \"O my people, what do you think if I put forward a proof that the truth is very clear from my Lord, and not from myself, and not because of my own merits, as a special human being, but because I was given grace by my Lord, namely prophethood, which you cannot see because it is hindered by ignorance, arrogance, and pleasure for worldly rank and position, then shall I force you to accept it, while you hate it so much? We cannot force it. It's up to you to accept it? accept or reject it, because I am only a messenger of Allah who is in charge of conveying it.\" Prophet Nuh as explained what was implied in his answer, that is, even though they are both human beings, do not generalize all human beings in all matters regarding their circumstances. Everyone is not the same in character and character, intelligence and ability, and willingness to accept guidance and the truth, especially in areas that are entirely controlled by Allah, such as opening the heart and receiving grace, or receiving the rank of prophethood, all of which are very vague and even completely closed to unbelievers. Prophet Noah said, \"What I can do is convey God's commandments. I absolutely cannot force you to accept such facts. As God's messenger, I am only able to convey it, it's up to you to accept or reject it, as long as you fully understand all the consequences.\""
		   },
		   {
			"id": 1502,
			"surah": 11,
			"ayat": 29,
			"tafsir": "Prophet Noah said, \"O my people, I do not ask for any reward or reward for the advice and appeal to you. I invite you to monotheism and piety to Allah, purely sincere for Allah, so that you all will be happy in the hereafter. I absolutely I do not ask or expect material rewards from you. I know that wealth is very dear to you. I know that your evaluation of a person is always related to his wealth. Therefore, in order to purify my appeal and not offend, I do not ask anything, it is enough for me to hope for a reward from Allah alone, because Allah is the one who gave me the task and I only put my trust in Him.\" And sayings like that were also uttered by other apostles in order to convey their messages to the people. Noah's people proposed to Noah, \"O Nuh, if you want us to join you in believing, then expel your weak and despicable followers, because we do not deserve to sit with them in an assembly.\" Prophet Noah replied, \"I will not expel them, because they will truly meet their Lord, and they will only be asked about their deeds, not about their rank or lineage, and that is what you do not know.\" Prophet Noah's words are also explained in another verse, namely the word of Allah SWT: They said, \"Should we believe in you, even though your followers are despicable people?\" He (Noah) replied, \"I have no knowledge of what they are doing. Their (charity) account is none other than my Lord, if you realize. And I will not expel those who believe. I (this) is only a warner clear.\" (asy-Syuara\/26: 111-115)"
		   },
		   {
			"id": 1503,
			"surah": 11,
			"ayat": 30,
			"tafsir": "In this verse, Allah explains the firmness of Prophet Noah who called out to his people who wanted Prophet Noah to expel his believing followers, \"O my people, no one can resist Allah's punishment, if I expel those who have believed and follow my call, because it includes a very heavy tyranny, which will surely be rewarded with a severe punishment too. Are you not aware and take a lesson? They have a God who will surely help them, and those who expel them will surely perish.\" Requests for the expulsion of followers who had believed were not only received or experienced by Prophet Noah, but also by other prophets, including the Prophet Muhammad."
		   },
		   {
			"id": 1504,
			"surah": 11,
			"ayat": 31,
			"tafsir": "In this verse, Noah's answer to his people is explained about their disbelief in Noah's prophethood, even though he claimed to be a prophet. He also did not tell them that he had storehouses of sustenance and wealth from Allah, which are needed by each of His servants, which he can spend to cover the needs of himself and all of his followers. He is the same as other people, requires reasonable effort, because the matter of guaranteeing sustenance is not included in prophetic affairs. If this matter were made part of the apostleship, of course many people would follow the prophet because they wanted to guarantee sustenance and wealth. Even though the main idea of the apostolic task is to purify the human soul from material influences with worship and knowledge of Allah in preparation for entering heaven and obtaining His pleasure on the Day of Resurrection. Wealth and children are of no use anymore, and only those who are pure in heart face God. Furthermore, Prophet Noah said that he did not know the unseen. He does not exceed other people with magic, which can reveal hidden objects to increase wealth, or obtain benefits and reject harm, which can be conveyed to all his followers, so that they become rich people and so on. It is also mentioned in the word of Allah: Say (Muhammad), \"I have no power to bring benefit or reject harm to myself except what Allah wills. If I knew the unseen, I would have done as much good as possible and no harm would have happened to me. I am only a giver a warning, and a bearer of good tidings for those who believe.\" (al-Araf\/7: 188) Prophet Noah continued his statement by saying that he was not an angel sent to them, but a human being like them who was assigned to call people to monotheism. In Noah's words, there is an objection to the assumptions of unbelievers who say that an apostle should be an angel, not eating, not drinking, not going in and out of the market, must know all that is unseen, and has many advantages over humans. normal. He also does not say to the believers whom they humiliate, that Allah will not give them good in the hereafter. God's view is very different from human view. As explained in several authentic hadiths: \"God does not look at your appearance or your body, but God looks at your heart.\" (Muslim history from Abu Hurairah) Allah knows better what is in their hearts, how pure their faith is, and how sincere they are in carrying out their obedience to Allah and His Messenger, unlike the views of those who accuse the believers of having wrong views. petty who believes anything. In fact, if the Prophet had a different opinion from them, it was because the Prophet did not only look at what appeared from the outside, but looked at the faith and sincerity of his followers. If the Prophet judged like the assessment of the disbelievers, surely he would be among the wrongdoers."
		   },
		   {
			"id": 1505,
			"surah": 11,
			"ayat": 32,
			"tafsir": "These verses explain the challenge of Prophet Noah's people who rejected the truth of Noah as a messenger of God to guide them to the right path, for their safety and happiness in this world and in the hereafter. Their opposing remarks are essentially defiance, for they have run out of reasons. They can no longer provide rebuttals with reasonable reasons that can be accepted by common sense, except to say, \"O Noah, you have argued so much with us, there is no reason from us that you do not deny, so we feel tired and bored, and we have nothing more to say except one thing, that is, if all that you say is true, bring the punishment you warned about immediately in this world before the punishment in the hereafter.\" This challenge is in response to the words of Nuh as told them as explained at the beginning of this story, namely: And indeed, We have sent Noah to his people, (he said), \"Indeed, I am a clear warner to you, so that you do not worship other than Allah. I am really afraid that you will be punished (on) a very painful day.\" (Hud\/11:25-26)"
		   },
		   {
			"id": 1506,
			"surah": 11,
			"ayat": 33,
			"tafsir": "In this verse, Allah explains Prophet Noah's answer to the challenge of his disbelieving people, by explaining that the matter of bringing doom is not in his power, but in the power of Allah Almighty, who created this universe and does everything according to His will. . They shouldn't be in a hurry, and it's not even reasonable to ask to hasten the coming of Allah's punishment, because if the punishment comes as they ask for, surely they will not be able to resist and prevent it. On the other hand, their reasonable request is that Allah's punishment does not come. For that, let them believe in Allah and obey His commandments and leave His prohibitions, as conveyed to them."
		   },
		   {
			"id": 1507,
			"surah": 11,
			"ayat": 34,
			"tafsir": "In this verse, Allah explains the continuation of the answers and explanations of Prophet Noah as to his disobedient people, that whatever is conveyed to them in the form of advice in order to invite them to the right path and warn them to avoid Allah's punishment in this world and in the hereafter, is not it would be of use, if they were still led astray by the enticements of their lusts. That is the cause of their destruction in this world and eternal punishment in the hereafter. Furthermore, Prophet Noah as explained to them, that Allah is their Lord who owns and governs this world, so that everything happens according to His provisions, measurements, and will. Everything will return to Him in the Hereafter, to receive a good or bad reward, according to the deeds in this world."
		   },
		   {
			"id": 1508,
			"surah": 11,
			"ayat": 35,
			"tafsir": "In the opinion of Ibn Kathir, this verse is a continuation of the story of Nuh's people who explained that they accused Noah of giving advice and warnings that were not true and were just made up. So Allah taught Noah as to tell them that if he made up things he would surely be the one to bear the guilt, the accusation is completely untrue. According to the opinion of some other commentators, this verse is not a continuation of the story of Noah's people, but an additional sentence (the number of mutaridha). According to them, the meaning of this verse is that after the disbelievers of Mecca heard the story of Noah's people from Muhammad, they accused him of fabricating the story. Therefore, Allah taught Prophet Muhammad saw. in order to tell them that if he invented it, he himself would bear the burden of his sins. But what they accused was completely untrue, and he was free from the actions they accused him of."
		   },
		   {
			"id": 1509,
			"surah": 11,
			"ayat": 36,
			"tafsir": "In this verse, Allah tells that He has revealed to Prophet Noah to explain the following things: a. After Noah's people asked that Noah as immediately bring Allah's punishment as proof of the truth of his preaching and Prophet Noah as had prayed for them to be destroyed by Allah, then there were no more believers among them except for only a few, namely only those who had declared their faith. to him before that. b. Even though the Prophet Noah had lived with his people for hundreds of years, preaching to them, they were still disobedient. This did not make him grieve and grieve at the thought of the attitude and behavior of those who remained unfaithful, because Allah's punishment for retribution upon them in this world is near, and they will not be able to avoid and prevent it. (37) According to the history of Ibn Abbas, the length of the ship was one thousand two hundred cubits. In this verse it is explained that Allah ordered Noah as to build a ship that would be used to save Prophet Noah and his faithful followers from a typhoon (flood) that would strike and drown the surface of the earth as doom in this world to the disbelievers from his people who always rebellious and disobedient. Prophet Noah was ordered to make the rescue ship with instructions and supervision from Allah. Furthermore, in this verse, Allah warns Noah as not to talk to his people who are unjust (infidels) and no longer beg for their sins to be forgiven or to be spared from His punishment, because it is Allah's decree that they will be drowned. This same prohibition was also given to the Prophet Abraham when he asked Allah so that His punishment would not befall the people of Lut, as mentioned in His word: O Ibrahim! Leave this (discussion), indeed, the decree of your Lord has come, and they will be afflicted with a punishment that cannot be refused. (Hud\/11:76)"
		   },
		   {
			"id": 1510,
			"surah": 11,
			"ayat": 37,
			"tafsir": "According to the history of Ibn Abbas, the length of the ship was one thousand two hundred cubits. In this verse it is explained that Allah ordered Noah as to build a ship that would be used to save Prophet Noah and his faithful followers from a typhoon (flood) that would strike and drown the surface of the earth as doom in this world to the disbelievers from his people who always rebellious and disobedient. Prophet Noah was ordered to make the rescue ship with instructions and supervision from Allah. Furthermore, in this verse, Allah warns Noah as not to talk to his people who are unjust (infidels) and no longer beg for their sins to be forgiven or to be spared from His punishment, because it is Allah's decree that they will be drowned. This same prohibition was also given to the Prophet Abraham when he asked Allah so that His punishment would not befall the people of Lut, as mentioned in His word: O Ibrahim! Leave this (discussion), indeed, the decree of your Lord has come, and they will be afflicted with a punishment that cannot be refused. (Hud\/11:76)"
		   },
		   {
			"id": 1511,
			"surah": 11,
			"ayat": 38,
			"tafsir": "In this verse it is explained that Nuh as built the rescue ship in accordance with the orders and instructions revealed by Allah to him. Many narrations or opinions were quoted by the mufasir regarding matters related to the ship, such as what wood it was made of, where it was made, what shape it was, how long and how wide it was, and other details which have been partly explained, when explaining verse 37 before this. The best opinion in this matter in terms of trust is as explained by Syihabuddin Mahmud Al-Alusi in his commentary, Ruhul Maaniy, as follows: \"People who are careful in this matter will not be inclined to exaggerated details, only believe that Noah as had made the ship as told by Allah in His book, and did not find out about the length and height, what wood it was made of, how long it was made, and so on that was not explained by the book of Allah and the sunnah of His Messenger which valid.\" Furthermore, in this verse it is explained that every time Noah's people passed by and saw him building a ship, they mocked him with various questions that were mocking. The ridicule and ridicule arose because they were not all familiar with ships and how to use them, including Prophet Noah as himself. save us and our people, then we will mock you.\" Some commentators are of the opinion that what is meant by the mockery of reply from Noah as, is the doom of the world that will befall his people so that he will no longer care about them. So Noah himself did not reply to ridicule, because it was considered unnatural for a prophet. Others argue that there is nothing wrong if the mockery in return really came from Noah as in accordance with the word of Allah: Whoever attacks you, then attack him according to his attack on you. (al-Baqarah\/2: 194) And the word of Allah: And if you repay, then repay with (reply) the same as the punishment that was inflicted on you. (an-Nahl\/16: 126) And the word of Allah: And the recompense for an evil is a deserving crime. (asy-Shura\/42: 40) Al-Alusi argues that the two ridicule (the ridicule of Noah's people and the ridicule of Prophet Noah as in return) did occur."
		   },
		   {
			"id": 1512,
			"surah": 11,
			"ayat": 39,
			"tafsir": "This verse explains the continuation of the words of Prophet Noah as to his mocking people by saying that if they don't know what the ship he is building is for, they will surely find out later after the ship is finished, and they are drowned. Actually the words of Prophet Noah as were not just an answer to their ridicule, but as a threat of doom to them. Because if they are aware, surely they will be able to feel that the words of Prophet Noah as are no longer ordinary words that they always consider to be just a scare which will not be a reality. But this time it is in the preparation stage to save those who believe from the danger of doom which will destroy those people who are very disobedient to Allah and His messenger."
		   },
		   {
			"id": 1513,
			"surah": 11,
			"ayat": 40,
			"tafsir": "In this verse Allah swt explains that Prophet Noah as in carrying out the construction of the ship with all kinds of preparations was very serious and received a lot of ridicule and ridicule from his people. When Allah's decision came to destroy the disbelievers, the earth also emitted water that overflowed like boiling water overflowing from a cauldron in the kitchen where it was cooked, so that it drowned everything on its surface. While scholars understand that the flood is not universal but local. So Allah ordered Noah as to bring into the ship a pair (male and female) of each type of animal, so that their offspring could reproduce after the flood which was called the typhoon subsided. In addition, Allah ordered Noah (as) to take into the ship all his male and female relatives except those who did not believe. Likewise, Allah ordered Noah as to bring into the ship all the few believers. Some commentators say that what Noah brought on board from his family was his believing wife and his three sons from that believing wife, namely Syam, Ham and Yafis. As for the number of believers that Noah took on board, there is no information in the Quran or in the hadiths. In this verse it is only explained that their number is small. At the beginning of this verse and at the beginning of verse 42 which is to come part of the story of the typhoon is described, and in other verses it is described more as in the word of Allah: Then We opened the gates of heaven by (sending down) pouring water. And We made the earth spout springs of water, so the (waters) met so that (overflowing caused) a condition (disaster) that had been determined. And We carried him (Noah) on a (ship) made of planks and pegs, which sailed under Our care (supervision) as recompense for those who had been denied (his people). (al-Qamar\/54: 11-14)"
		   },
		   {
			"id": 1514,
			"surah": 11,
			"ayat": 41,
			"tafsir": "In this verse it is explained that Noah as ordered those who believe in his treatise to board the ship by saying the name of Allah when sailing and anchoring, because all power is in His hands. He can do as He pleases, arrange His sunnah according to His Iradah; while their safety at that very important moment is only under His power, under His protection. The Messenger of Allah said, \"My people will be safe (not drowning) if they board the ship, so they can read: Bismillahi malikirrahmanirrahim, bismillahi majreha wa mursaha innahu lagafururrahim.\" (History of Ath-thabrani from Ali) Furthermore, in this verse it is explained that Nuh as stated, \"Verily, my Lord is Most Forgiving, Most Merciful.\" Apart from being grateful, this speech shows that he and his faithful followers survived the danger of the typhoon thanks to God's vast mercy."
		   },
		   {
			"id": 1515,
			"surah": 11,
			"ayat": 42,
			"tafsir": "This verse explains that the ship sailed carrying Noah as and his followers, who believed, across the vast ocean and through the terrible waves, rolling towering like mountains. After Prophet Noah and his followers got into the ship, he saw his son named Kanan go towards the mountain, keeping away. Prophet Noah called for his son while inviting him to enter the ship, but his son refused, so that Prophet Noah felt sad and worried. Scholars differ on whether Prophet Noah as before the incident did not know the true condition of his son. Some argue that Noah did not know, because before that incident his son was hypocritical towards him. Another opinion says that he knew his son's disbelief, but after his son witnessed himself that a typhoon had started coming, Noah hoped for his son's awareness, so he invited him to get into the ship, but his efforts were in vain because his son still refused. ."
		   },
		   {
			"id": 1516,
			"surah": 11,
			"ayat": 43,
			"tafsir": "In this verse, Allah mentions Kanan's answer to the call and invitation of his father Noah as to get into the ship. He refused not to enter on the grounds that he could take refuge on the mountain to protect himself from the dangers of the threatening flood (typhoon). Hearing this, Prophet Noah explained to his disobedient son that on that day no one could protect him from the typhoon other than Allah and no one survived except those he loved, namely those who got into the ship. . Thus, God's will has ordained everything to go according to the process He has outlined. The waves that rolled high were so powerful that they blocked Noah as from his rebellious and rebellious son, so that the conversation between the two of them was cut off, and the child also drowned along with other unbelievers."
		   },
		   {
			"id": 1517,
			"surah": 11,
			"ayat": 44,
			"tafsir": "In this verse it is explained that floods (typhoons) hit the surface of the earth which emitted overflowing springs, coupled with abundant rainwater, and Noah's ship sailed across seas that were violently turbulent and it is not yet known when this happened. will expire. Then the time came, Allah ordered the earth to absorb the water that was emitted and ordered the heavens to stop the rain, so that the water receded and Allah's command was completed perfectly, and the disbelievers from Noah's people all drowned. Then the ship anchored on Judiy hill. Then at the end of this verse, Allah curses the disbelievers with His words, \"Perish the wrongdoers.\" Meaning: The hurricane is to destroy unjust people (infidels) who are far from Allah's mercy, because of their tyranny and do not want to repent and return to the right path. The great flood at the time of Prophet Noah certainly did not submerge the entire earth's surface, but occurred in a very large area in the Dead Sea and its surroundings which are indeed lower than sea level."
		   },
		   {
			"id": 1518,
			"surah": 11,
			"ayat": 45,
			"tafsir": "In this verse it is explained that Prophet Noah asked God to save his son Kanan or Yam from the typhoon, because his son was part of his family and Allah had promised that his family would be saved from the typhoon, and Allah's promise is true, has not changed, and He is the Most Wise Judge of all judges. Prophet Noah's prayer occurred before his son drowned, after he called and invited him to join in on the ship. Even though the Prophet Noah did not know that after being ordered by Allah to build a ship, he was still allowed to ask for prayers for the disbelievers, while his son was clearly rebellious and did not want to be invited to enter the ship, he was not yet sure that his son was one of the Muslims. infidels who must also be drowned, moreover he is driven by feelings of a father's affection for his child."
		   },
		   {
			"id": 1519,
			"surah": 11,
			"ayat": 46,
			"tafsir": "In this verse it is explained that God rejected Noah's request so that his son Kanan could escape the doom of the typhoon. Allah explained that Kanan, who was reluctant to enter the ship, was not part of his family, who was promised by Allah that he would be saved from the typhoon because the child had committed a bad deed. He did not want to get into the ship and did not want to receive true guidance, even though the instructions came from his own father, who had become an apostle of Allah. He remained stubborn and disobedient along with other unbelievers and had to be drowned in the typhoon. Allah does not discriminate among human beings except with piety, regardless of skin color, nationality and descent. Allah forbade Noah as asking Him about something he did not know whether he was sure that the request was reasonable or not. Furthermore, Allah warned Noah so that he would not be included in the class of ignorant people who asked Him for something according to their desires or for the benefit of their family and lover without knowing what was permissible and should be asked for. This verse contains several laws and instructions, including: a. It is not permissible to ask Allah for something that is not reasonable that is contrary to the sunnah of Allah or that it is not yet known whether the request is reasonable or not. b. Everyone who opposes the truth pointed out by Allah and His messenger will be punished in return."
		   },
		   {
			"id": 1520,
			"surah": 11,
			"ayat": 47,
			"tafsir": "This verse explains the opinion of Prophet Noah as regarding Allah's rebuke which contained a rejection of his request, so that his son Kanan would be saved from a typhoon. Thus, after Prophet Noah learned from Allah the nature of his son, he begged Him for forgiveness for his mistakes and mistakes in asking for something that was out of place. He takes refuge in Allah so that he can protect himself from submitting requests that are similar in nature to his mistakes. At the end of the request for forgiveness, earnestly and sincerely, he expressed his regret to Allah. If his mistakes are not forgiven by God, surely he is one of the losers, because his mistakes are only driven by a father's feeling of affection for his child and wanting his child to receive God's grace."
		   },
		   {
			"id": 1521,
			"surah": 11,
			"ayat": 48,
			"tafsir": "This verse explains that after the ship anchored on the Judiy hill for some unspecified length of time \"according to some commentators, it lasted one month\" and the flood waters had receded, Allah ordered Noah as to get off the ship together with his followers to build a new life in order to continue the generation of human beings who believe in monotheism and piety, after the disbelievers from their people were destroyed by the doom of a typhoon. Allah ordered that Noah as and his followers get off the ship accompanied by greetings of peace and blessings from Him. They will be blessed, according to Allah's promise, in taking the life of this world and the hereafter. After they go down to the mainland, they get the breadth of sustenance and necessities of life that they need for their benefit and for the next generation. Furthermore, Allah explained that not all of their generations who will reproduce in the future are the same as them. However, there are generations among those who reproduce to become people who can only enjoy the sustenance and pleasures of this world, but in the hereafter they will receive a very painful punishment. They were led astray by Satan so that they became polytheists and wallowed in tyranny and other crimes, so that they could not maintain security and well-being, and some even oppressed others. They were scattered and dissenting and deviated from the religious instructions brought by the apostles of Allah. According to Taqiyuddin al-Maqrizi's statement, none of Noah's followers had children except for his three children (Sham, Ham and Yafis). This opinion is based on the word of Allah: And We made his descendants those who continue the descent. (ash-saffat\/37: 77)"
		   },
		   {
			"id": 1522,
			"surah": 11,
			"ayat": 49,
			"tafsir": "In this verse, Allah swt explains to Prophet Muhammad saw, that the story of Noah as and the stories of other prophets is important news that is included in the occult matters that Allah revealed to him, which he had never known and had never known to his people before. that, so they could accuse him of getting the story from someone else. But it was Allah who revealed the story to Muhammad according to the actual incident as described in the books of the previous prophets. If any of his people had ever heard of it, their knowledge would only be global and vague. Therefore, even though they threw various accusations against Muhammad, but Allah ordered him to be patient with his people who hurt him a lot; just as Noah as was patient with his people who mocked and ridiculed him for hundreds of years. Such a thing has become the sunnah of Allah on His messengers. However, the outcome is victory and luck for those who are pious and patient. Instead, defeat and loss will befall those who rebel against the truth and those who do evil. This is in accordance with other verses such as the word of Allah: Verily We will help Our messengers and those who believe in the life of the world and on the day when the witnesses appear (the Day of Resurrection). (al-Mumin\/40: 51) In the Koran it is not explained exactly how old the Prophet Noah was, but only mentioned in His words as follows: And indeed, We have sent Noah to his people, so he lived with them for a thousand less than fifty years. Then they were hit by a great flood, while they were the wrongdoers. (al-Ankabut\/29: 14) What is clear is that the verse only states that Nuh lived among his people for nine hundred and fifty years. It is possible that the time span only refers to the period of time in conveying da'wah to his people. And it is also possible that that is the sum of all their ages including the period of preaching."
		   },
		   {
			"id": 1523,
			"surah": 11,
			"ayat": 50,
			"tafsir": "In this verse, it is explained that Allah has sent His messenger to the adversary who live to the north of Hadramaut in Yemen and to the west of Oman. Allah's Messenger is Hud as chosen by Allah from the nation itself, so that it is easier to convey and instill confidence in them. According to some narrations cited by some commentators it is said that the Prophet Hud as was the first person to speak Arabic and the first messenger of Allah from the Arab nation of Noah's descent. they are Hud,\" meaning, \"We have sent to the people of Adhud one of them.\" This kind of grammar is widely used in the Koran. Hud as Allah's apostle, began to call his people to worship Allah Almighty, there is no other god but Him. The Prophet Hud forbade them to worship statues and idols, because such acts are associating with God and holding false speech by saying that the statues and idols they worship are helpers who can provide benefits and reject harm ( danger). Though the statues were made by humans."
		   },
		   {
			"id": 1524,
			"surah": 11,
			"ayat": 51,
			"tafsir": "In this verse, Allah swt explains that Hud as in conveying da'wah to his people, did not ask for wages and payments at all, so that they could not accuse him of seeking profit for himself. He only hopes for reward from Allah Who has created him as a human being who is of sound mind and who can free himself from worshiping the statues made by Noah's people (as) They made these statues to perpetuate the merits of their pious ancestors. In fact, they fell into the abyss of shirk because they were toyed with by Satan's deception which was originally meant to honor and glorify, but in the end they became something to be worshiped. Then the Prophet Hud as encouraged his people to want to use common sense, so they can distinguish between what is beneficial and what is harmful to them. He also said that he advised them and showed them the right path only for their safety and happiness in this world and in the hereafter. But they don't want to follow him."
		   },
		   {
			"id": 1525,
			"surah": 11,
			"ayat": 52,
			"tafsir": "This verse explains that Hud as, after inviting his people to worship God Almighty and forbidding them to associate partners with Him by worshiping idols, ordered them to ask forgiveness from Allah who then repented sincerely. Then Hud as explained, if they did as they had been advised, surely Allah would send down heavy rain, which would be very beneficial for them as a nation that has many plants and gardens. God will also add the power and glory they dream of, in addition to what they already have. Therefore, the Prophet Hud as warned his people, so as not to turn away from the truth that has been advised to them and do not continue the big mistakes they are used to, namely worshiping idols, statues and fall into other evil deeds. The Hud as, who are called the ad nation or the ad tribe or the ad people, apart from being known as a nation that is rich in agriculture, they are also known as strong people who are stout-bodied, which causes them to grow arrogant and arrogant, as what explained by Allah in His word: So as for the ad people, they are arrogant on earth without (paying heed to) the truth and they say, \"Who has greater strength than us?\" Do they not see that it is Allah who created them. He is greater in strength than them? And they have denied Our signs. So We blew a very thunderous wind on them in a few fateful days, because We wanted them to feel humiliating torments in this worldly life. Meanwhile, the punishment in the hereafter will be more humiliating and they will not be given any help. (Fushshilat\/41: 15-16)"
		   },
		   {
			"id": 1526,
			"surah": 11,
			"ayat": 53,
			"tafsir": "In this verse Allah swt explains the challenge of the people of Hud as to the da'wah delivered by Hud as by disobeying and saying, that Hud as did not provide the slightest concrete evidence that showed his truth as Allah's apostle, who was assigned to deliver the da'wah to them. Therefore they would not forsake the worship of idols and images on hearing his unreasonable remarks, and declared that they would not believe in him. The challenge of this harsh Hud, was initially based on the lack of real evidence conveyed by the Prophet Hud to them about his truth as an apostle of Allah. However, if we pay attention to the method, style, and content of the challenges of their people, it can be concluded that they are essentially just rebelling, not because there is no real evidence or argument. With this challenge, they can no longer be expected to have faith."
		   },
		   {
			"id": 1527,
			"surah": 11,
			"ayat": 54,
			"tafsir": "In this verse, it is explained that the continuation of the challenge of Hud's people, namely by telling him that Hud's words are similar to the words of someone possessed by a demon. They could not accept those words at all, especially those that belittled and prevented them from worshiping idols. This challenge was followed by a tougher challenge than the previous one. They accused Hud as suffering from madness, so there was no need to listen to what he said let alone believe it. The madness, according to them, was caused by Hud being disobedient to their idols. That is why the Prophet Hud concluded that his preaching would no longer be of any use to them, so he answered their challenge by saying that he testified to Allah and ordered them to witness it, that in fact he was apart from what they had associates with. Hud's answer shows a firm attitude, full of faith in being accountable for the truth of his da'wah, which is conveyed to his people regardless of all kinds of obstacles and challenges he faces."
		   },
		   {
			"id": 1528,
			"surah": 11,
			"ayat": 55,
			"tafsir": "In this verse, Allah swt explains the continuation of Prophet Hud's answer to his people with a firmer and full courage to be responsible for the truth of his preaching. With a defiant tone Hud as ordered his people who were very rebellious, to unite all together with their gods in carrying out all kinds of tricks to destroy him immediately, without giving him the opportunity, to prepare in advance to defend themselves. This answer clearly shows that Hud (as) was not afraid of his people who disbelieved at all, let alone their gods who could do nothing about it. Prophet Nuh as said these words to his people, as explained in the word of Allah: Therefore make up your mind and gather your allies (to destroy me), and do not keep your decision secret. Then act upon me, and do not delay any longer. (Yunus\/10: 71)"
		   },
		   {
			"id": 1529,
			"surah": 11,
			"ayat": 56,
			"tafsir": "In this verse, Allah swt explains Hud's words in responding to the challenges of his people, that is, after he ordered them to join together with their gods in carrying out all kinds of tricks to destroy them, then he stated that he had put his full trust in Allah, his Lord, and also Their God who has created this universe. There is not a single animal that crawls over this universe that is not controlled by Him, and Allah is Most Just to guide His servants on the straight path, helping those who are righteous, and oppressing those who are unjust. Thus, Hud's answer to his people who dared to challenge it, was not driven by pride, arrogance and so on, but was driven by faith that had become steel in his heart to be accountable for the truth of his preaching delivered to his people. Hud as sure that the disbelievers from his people will not be able to do anything outside of the provisions and will of Allah. So trust arises in accordance with God's advice, as stated in His word:"
		   },
		   {
			"id": 1530,
			"surah": 11,
			"ayat": 57,
			"tafsir": "In this verse, Allah swt explains the concluding series of Hud's words to his people by warning that if they turn away from what he has conveyed, and continue to deny him as an apostle of Allah, then he can no longer do more than that, because he has carried out da'wah which Allah has entrusted to him. The mandate has been carried out sincerely, and his job is just to deliver. Therefore, if they still challenge and disobey, Allah's punishment will befall them and Allah will replace them with other people. Furthermore, Hud as emphasized that they would not be able to harm Allah in the slightest, due to turning away from the faith or for other reasons. Indeed, Allah is the Preserver of all things carefully, in accordance with His sunnah which is determined by His iradah, among others helping His messengers and inflicting doom on their enemies. Hud's assertion to his people that they will not be able to cause harm to Allah, due to their turning away from faith and remaining in disbelief, is not just a warning to frighten them, but that is the essence and reality, and this is in accordance with Allah's word: If you disbelieve (know) then surely Allah does not need you and He is not pleased with the disbelief of His servants. If you are grateful, He accepts your gratitude. (az-Zumar\/39: 7) And the word of Allah: So worship besides Him as you please! (O polytheists). Say, \"Verily, the losers are those who will harm themselves and their families on the Day of Resurrection.\" (az-Zumar\/39: 15)"
		   },
		   {
			"id": 1531,
			"surah": 11,
			"ayat": 58,
			"tafsir": "In this verse, Allah swt explains that when Allah's punishment came to the people of Hud as a result of their disobedience, the Prophet Hud and his believing followers had been saved by Allah from the terrible punishment of the world as a mercy and gift from Allah to them and will save them from the more severe punishment of Allah in the hereafter. While the Hud as who remained opposed and disobedient, all were destroyed and will receive a more severe punishment in the hereafter. As for the punishment of Allah that befell the people of Hud as, namely in the form of a very cold and strong wind, as mentioned in the word of Allah: As for the people of ad, they were destroyed by a very cold hurricane, Allah brought that wind on them for seven nights and eight days continuously -continuously; then you see the ad people at that time dead lying like the trunks of date palms that have been empty (rotted). So do you see anyone left among them? (al-Haqqah\/69: 6-8)"
		   },
		   {
			"id": 1532,
			"surah": 11,
			"ayat": 59,
			"tafsir": "In this verse, Allah swt explains that this is the story of a people ad who have denied the signs of Allah's power and disobeyed His messenger who was sent to guide them towards the right path, namely to agree with Him and obey His commands. But they only want to obey the orders of arbitrary rulers who do not want to follow the truth even with sufficiently convincing arguments and evidence. In this verse it is explained that the ad nation (Hud as) disobeyed Allah's messengers. Is that really the case? Or are they just disobeying a messenger of Allah, namely Hud as? The commentators explained that what they were denying was Hud as, but to deny or disobey an apostle of Allah means to deny or disobey all of His apostles. This is because all apostles carry out the same task, namely inviting them to believe in monotheism to Allah and obey His commands and stay away from His prohibitions."
		   },
		   {
			"id": 1533,
			"surah": 11,
			"ayat": 60,
			"tafsir": "In this verse, Allah swt explains that the believers who continue to disobey in disbelief, have been cursed by Allah in this world, so that they are all destroyed by a very strong violent wind and will be followed by a more painful and even more terrible punishment on the Day of Judgment. Doomsday. Furthermore, Allah warns all His servants to realize that this is the reward for those who disbelieve, who deny the oneness of Allah Almighty, who has created them. They also belied His apostles with arrogance and stubbornness, only because they pursued worldly gains that were not eternal. Then at the end of this verse, Allah clearly states that destruction will be for those who are far from Allah's mercy, they are Hud's people who do not believe in Hud's and the preaching he brings, so that they get curses in this world and in the hereafter."
		   },
		   {
			"id": 1534,
			"surah": 11,
			"ayat": 61,
			"tafsir": "In this verse, Allah explains that He has sent a messenger to the young people, his name is Saleh. He called on them to worship Allah and leave the worships that had led them to the wrong and misleading path. Allah is the one who created them from the ground. It was from that land that He created Adam as and from that land all human beings came from. After humans reproduced on the earth they were entrusted with the task of prospering it, as a gift and a gift from Allah. With this gift the Samud people have lived happily even they have also been able to make a house as a shelter as mentioned in the word of Allah: And they carve houses from the rock, (in which they live) with a sense of security. (al-Hijr\/15: 82) Such is the magnitude of God's grace and favor given to them. So they are obliged to be grateful for that favor by glorifying and glorifying Him and not worshiping other than Him. And they should repent to Him, because they have done wrong, worshiping gods besides Him. If they realized this and sincerely repented to Him, surely Allah, the Most Gracious, Most Accepting of repentance, would forgive them and include them among the pious. This is what the Prophet Saleh called for and recommended to his people."
		   },
		   {
			"id": 1535,
			"surah": 11,
			"ayat": 62,
			"tafsir": "Prophet Saleh's call, which was so good and accompanied by acceptable reasons and strengthened by the promise that they would receive forgiveness from Allah, the Most Gracious, was rejected by his people. They replied: \"O Saleh, you are the pillar of our hope, because you are a respected person, a wise man, a descendant of noble people among us and we believe that you will be able to lead us to the right path. But all hope you have disappointed us with your call. We are astonished, why did you forbid us from worshiping our gods who have been worshiped by us and our ancestors since time immemorial?"
		   },
		   {
			"id": 1536,
			"surah": 11,
			"ayat": 63,
			"tafsir": "Prophet Saleh answered the accusations and challenges of his people by stating that his call was the right call for their own good and happiness, if they would think and consider it. Prophet Saleh asked them to consider it as well as possible, if it turned out that he was right and could provide evidence from God for the truth of the call. Is it possible that he disobeyed Him and was reluctant to deliver this call to his people. Who can help if God destroys him because of that iniquity? He had to convey this truth and explain to them that those idols and idols could not help them one bit. Therefore, worship Allah who created them and gave them favors and gifts so that they can live happily on this earth."
		   },
		   {
			"id": 1537,
			"surah": 11,
			"ayat": 64,
			"tafsir": "Prophet Saleh said to his people who were in denial, that if they did not believe in this call, then Allah had sent a special camel as proof of the truth of his call. This camel is far different in character and behavior from ordinary camels, both in terms of eating and drinking, as well as character and character. They were forbidden to disturb him and allowed him to eat and drink where he liked. If they dare to disturb or persecute them, they will surely be punished by Allah's punishment."
		   },
		   {
			"id": 1538,
			"surah": 11,
			"ayat": 65,
			"tafsir": "But the Namud still did not believe it and continued to oppose and make fun of it and even killed the camel that God sent as a miracle. Prophet Saleh was very saddened by the actions of his people, because he believed that they would be destroyed by Allah because of their actions in killing the camel. Then Prophet Saleh said, \"You are given the opportunity by Allah to have fun living in this country for three days, and after that you will be destroyed because of your denial and iniquity. This is a promise from Allah, which will surely be fulfilled and you will see for yourself.\""
		   },
		   {
			"id": 1539,
			"surah": 11,
			"ayat": 66,
			"tafsir": "When the calamity that Allah threatened to the people of Samud came, as punishment and recompense for their disobedience, Allah swt saved Prophet Saleh as and those who believed with him, with His grace and mercy, from the doom and torment. On that day, those who were disobedient were all annihilated. They get a bad name in human history, which of course will be regarded as a black sheet that tarnishes the purity and dignity of human beings as caliphs on earth. It was a very heavy punishment that God inflicted on them, but that action was just and in accordance with the sins and mistakes they had committed. It is Allah who has the right to do it and it is He who can carry it out because He is the Almighty and the Almighty."
		   },
		   {
			"id": 1540,
			"surah": 11,
			"ayat": 67,
			"tafsir": "The Samud people were destroyed by Allah with a thunderous loud voice, shaking the hearts of every listener and causing a very powerful earthquake, so that the sinful and ungodly man fell down unconscious and was swallowed up by the earth which had cracked and cracked. Not one of them was able to escape the catastrophe."
		   },
		   {
			"id": 1541,
			"surah": 11,
			"ayat": 68,
			"tafsir": "It was such a terrible disaster that befell them, that in a moment they had all been destroyed, as if they had never existed on the face of the earth, as if their hometown had never been inhabited by humans, disappeared and was destroyed by the disaster. All of this was the result of their disobedience to Allah and their denial of the miracles and proofs that He sent down. It is fitting for them to receive terrible curses and torments."
		   },
		   {
			"id": 1542,
			"surah": 11,
			"ayat": 69,
			"tafsir": "Several angels came to visit Prophet Abraham at his house to convey the good news to him. It was narrated from Atha that the angels consisted of Jibril, Mikail, and Israfil as. There is also a history that says they consisted of Gabriel along with seven other angels. They were greeted by the Prophet Ibrahim with a very kind welcome because he was sure that his guests who were full of courtesy and greeted before entering his house were honored guests from good people. It was customary for Bedouin Arabs when guests arrived, they had to be served a special meal, according to the ability of the host. Prophet Ibrahim as also served his guests a delicious meal, namely a lamb baked on a heated stone and invited them to enjoy this special food. But the guests did not want to touch the food, because they were angels disguised as humans, while angels did not need food and drink."
		   },
		   {
			"id": 1543,
			"surah": 11,
			"ayat": 70,
			"tafsir": "Because the guests did not want to touch the delicious food that was served, the Prophet Abraham was suspicious of their good intentions. Among Arabs, if a guest does not eat the food served, it is a sign that the guest intends to harm him. Various kinds of feelings such as suspicion, fear, and so on arose from the hearts of Prophet Ibrahim and his wife, seeing the attitude of his guests. This was clearly seen in his face, which was radiant before turning pale. Finally the angels explained that they were angels sent by Allah to the people of Lut to destroy them because they were a cursed people who did not heed Allah's warnings so that they would leave their immoral and cursed actions and believe in Allah and in the message that the Prophet Lut had brought."
		   },
		   {
			"id": 1544,
			"surah": 11,
			"ayat": 71,
			"tafsir": "Prophet Ibrahim's wife named Sarah was happy and smiled because those who came were not bad people, but were angels sent by Allah, and of course they did not want to eat and drink. Then they said to Sarah that God had given her good news that she would give birth to a child named Isaac and that Isaac would also have children, including Jacob."
		   },
		   {
			"id": 1545,
			"surah": 11,
			"ayat": 72,
			"tafsir": "How shocked Sarah was when she heard the angel's words as if she did not believe that what she was facing were angels who never lie and will never lie forever. Because of that she spontaneously replied, \"It's amazing! How can I give birth to a child, when I am old and my husband is old too!\" It is narrated that Prophet Abraham was 100 years old and his wife was 90 years old. According to the custom of a woman when she is 50 years old she has no menstruation anymore and because of that she has no more hope of having children. Moreover, Sarah was also a barren woman as mentioned in God's word: Then his wife came screaming (astonished) and then patted herself on the face saying, \"(I am) an old barren woman.\" (az-Zariyat\/51: 29) Prophet Ibrahim was no less surprised to hear the news as it is in the word of Allah: He (Ibrahim) said, \"Is it true that you gave me good news even though I was advanced in age, then (by way of) how did you give me good news?\" (good news)?\" (al-hijr\/15: 54) Both (Prophet Ibrahim as and his wife Sarah) both doubted the good news, because usually it is not possible."
		   },
		   {
			"id": 1546,
			"surah": 11,
			"ayat": 73,
			"tafsir": "Finally the angels said, \"Should you be surprised at something that God has ordained?\" Allah, the Almighty, the Almighty, it will not be difficult for him if He wills to confer a child on anyone, even though according to custom and custom this is not possible. It is indeed very easy for Allah according to His word: Surely it is His business if He wants something He only says to him, \"Be it!\" Then be that something. (Yasin\/36: 82) Then the angel said, \"May Allah always bestow mercy on you, O family of Ibrahim as. He is the one who has the right to be praised and praised.\" Hearing the words of the angels, Prophet Ibrahim and his wife Sarah understood that they had overdone and were too presumptuous to say those words, even though the angels who brought the good news were the messengers of God. It is indescribable how happy and happy the Prophet Abraham was, especially since his other wife, Hajar, had given birth to a son named Ishmael. They gave thanks and praise to Allah, who had given them the gift they had long coveted and almost gave up on this because they were old."
		   },
		   {
			"id": 1547,
			"surah": 11,
			"ayat": 74,
			"tafsir": "After the Prophet Ibrahim learned that the one who came to him was an angel sent by Allah, he felt relieved and all the doubts in his heart disappeared. How happy the family of Prophet Ibrahim as was at that time, there was no joy and happiness that exceeded it because what he had long wanted and dreamed of, suddenly with the grace and mercy of Allah he would have a child who was also named Isaac. But Prophet Ibrahim as a benefactor and compassionate and compassionate towards mankind, when filled with joy, he did not forget and even recalled the words of the angels, that they were sent by Allah to destroy the people of Lut. It is reflected in his memory how bad the fate of Lut's people was, and how terrible the catastrophe that would befall them. The feeling of happiness and joy in an instant has been replaced by a feeling of anxiety and despair. He dared himself to argue with the angels, in the hope that the plan to destroy the people of Lut could be canceled. That is in the word of Allah: And when Our messengers (angels) came to Abraham with good news, they said, \"Indeed, we will destroy the inhabitants of this city (Sodom) because the inhabitants are really unjust people.\" (al-Ankabut\/29: 31)"
		   },
		   {
			"id": 1548,
			"surah": 11,
			"ayat": 75,
			"tafsir": "Such was the courtesy and compassion of a prophet towards mankind, especially Prophet Ibrahim as, who, when he was happy and happy, would get the wish and dream of his heart that he had long aspired to, namely a son named Ishak from his first wife. Under such circumstances, people usually forget everything, but they do not forget the fate of Lut's people. He heard that they would be destroyed and he asked his Lord to save them by stating reasons and hopes that his request would be granted. Indeed, the Prophet Abraham was indeed a forbearing man and put compassion (pity) on people who were struck by misfortune and always surrendered to his Lord."
		   },
		   {
			"id": 1549,
			"surah": 11,
			"ayat": 76,
			"tafsir": "Finally the angels firmly told Ibrahim while rejecting his earnest request. He should not talk about the fate of Lut's people and leave their affairs to the decision of his Lord. Allah has decreed against them that they will be subject to an irresistible punishment, because they are a people who disobey His commandments and have committed sins and immoralities that are very evil and disgusting. Their sins cannot be forgiven anymore, they have been given the opportunity to repent and return to the straight path, but they always refuse all good preaching and appeals, instead they welcome them with ridicule and ridicule. That is the decision of your God, the Most Just. They and their country will be annihilated by sinking it into the ground."
		   },
		   {
			"id": 1550,
			"surah": 11,
			"ayat": 77,
			"tafsir": "When God's angels came to Lut, in the form of a beautiful young man, he felt troubled because of the arrival of the guests. He was already worried that his people would bother them because the young men caught their attention, because they like men, not women. The Prophet Lut as felt his chest tight because of the arrival of the guests, so he said, \"This is the most difficult and most dangerous day.\""
		   },
		   {
			"id": 1551,
			"surah": 11,
			"ayat": 78,
			"tafsir": "The people of Lut came to him in haste like people driven by evil passions. They have since long ago carried out acts that were heinous and were highly reprehensible by normal human nature, especially by religious law. They like to have homosexuality, have sex with other men not with women, and they openly commit various evils in their meeting halls. Allah's Word: Is it appropriate for you to go to men, steal and do evil in your meeting places?\" (al-Ankabut \/ 29: 29) Prophet Lut as said, \"O my people these are my daughters, and the daughters of my people, please marry them. They are purer to you and you can associate lawfully and well with them than to satisfy your appetite by practicing homosexuality which is very heinous and damaging to morals and health. Fear Allah and avoid the punishment of Allah, and do not disgrace my name by raping my guests, because insulting a guest is the same as humiliating the host. Isn't there someone among you who has common sense and wisdom who can prevent you from committing abominations?\""
		   },
		   {
			"id": 1552,
			"surah": 11,
			"ayat": 79,
			"tafsir": "They replied, \"Indeed, you have known from a long time ago that we have absolutely no desire to marry your daughters and the daughters of your people. Therefore, do not try to distract us from the youths by offering children -your daughter, for you must have known what we really wanted.\""
		   },
		   {
			"id": 1553,
			"surah": 11,
			"ayat": 80,
			"tafsir": "The Prophet Lut as said when his people still wanted to carry out homosexual crimes against his guests, so he gave up hope of stopping them from doing this heinous act, \"I wish I had the strength and ability to prevent you or if I could meet a group of people who strong man who can help me from your crimes I will certainly do.\""
		   },
		   {
			"id": 1554,
			"surah": 11,
			"ayat": 81,
			"tafsir": "After the angels who were the guests of Prophet Lut as witnessed the concern for Prophet Lut as, they said, \"O Lut, in fact we are the messengers of your Lord who were deliberately sent to destroy them and save you from their crimes. They are sometimes will not be able to disturb you, so calm your heart. It turns out that the vision of Prophet Lut's people was darkened by Allah so that they could not see Prophet Lut as and to his guests as explained in the word of Allah: And indeed, they have persuaded him (to surrender ) guests (to them), then We blinded their eyes, so feel My punishment and My warning! (al-Qamar \/ 54: 37) Finally they returned to their homes each in a state of blindness, not knowing the way to his house , they shouted for help and said that we were bewitched by the guests who were at Lut's house. The angel said to Prophet Lut as, \"Come out and from this village, along with your family and people who believe at the end of this night and let none of you be left behind or look back except your wife. Indeed, the punishment that will befall them will also befall your wife because she is a woman who does not believe and has even betrayed her husband.\" As for why they don't look back, because as a result of witnessing the punishment, they will panic so that their feet will not be able to take another step. and finally befallen by the punishment that follows behind him. When the punishment comes to them is at dawn as explained in the word of Allah: So they were destroyed by a loud thundering sound, when the sun was about to rise.(al-Hijr\/15: 73) Then the angel confirming the certainty of doom with a question, \"Isn't dawn near? So hurry up and get ready to seek safety.\""
		   },
		   {
			"id": 1555,
			"surah": 11,
			"ayat": 82,
			"tafsir": "When Allah's decision came to punish the people of Lut, Allah caused their land to turn upside down, those above fell to the ground and those below rose to the top, and Allah showered them with stones from scorched earth that fell on them successively. Regarding the collapse of the ground, according to experts in science, it is caused by steam or gases coming out of the base, then because of the void under the layer of earth, the soil above it collapses and falls down."
		   },
		   {
			"id": 1556,
			"surah": 11,
			"ayat": 83,
			"tafsir": "Allah sent down the sijjil stones before the earth was turned upside down. According to Allah's word in surahh adz-dzariyat those stones are burnt clay so that they become stones marked by Allah Taala with the names of the people they will fall on. The stones were dropped in a place where the polytheists of Quraysh often passed when they traded in Syria so that it would serve as a warning to them not to be enemies with Muhammad, so that punishment would not befall the people of Prophet Lut as who disobeyed his prophet. The place was often passed by them when they traded in the summer in the land of Syria as explained in the word of Allah: And verily you (people of Mecca) will really pass their (traces of) in the morning, (ash-saffat\/37: 137)"
		   },
		   {
			"id": 1557,
			"surah": 11,
			"ayat": 84,
			"tafsir": "In this verse it is explained that Allah swt sent Shuaib as His messenger to the people of Madyan. Shuaib was chosen from his own people. Shuaib is a descendant of Madyan bin Ibrahim as Madyan who built an area for his people which is located in Hajar near the land of Syria, and is named after his name, so that the area and its inhabitants and tribes are said to be Madyan. As Allah's apostle, Syaib began his missionary work by inviting his people to worship Allah and forbid associating Him with idols, statues, and so on, because there is no God worthy of worship other than Allah, the One who created the entire universe. Then Shuaib as forbade his people to reduce the measure and weight, as they do in all kinds of trading and buying and selling, because this act is the same as taking people's rights with very evil and heinous cheating. This similar prohibition is also explained in the word of God: Woe to those who cheat (in measuring and weighing)! (That is) people who when they receive a measure from other people they ask for it to be fulfilled, and when they measure or weigh it (for other people), they reduce it. (al-Muthaffifin\/83: 1-3) Syuaib as explained to his people, that he saw that they were living well and richly, they did not need to cheat in measures and weights. Because, besides taking the rights of others in a cunning and heinous way, this act also means denying the grace of God who has given them a lot of wealth. They should be grateful to Him, not the other way around they increase their wealth by cheating and cunning which is very angry with Allah. Prophet Shuaib as warned his people, that if they were still disobedient in their disbelief and continued to do this despicable work, then he was worried that they would be overwritten by a doom that would destroy them."
		   },
		   {
			"id": 1558,
			"surah": 11,
			"ayat": 85,
			"tafsir": "Shuaib as explained to his people about what they should do in terms of measuring and weighing, after first forbidding them to reduce the measures and weights. The obligation is for his people to perfect the measure and weight fairly without being less or more than they should be. For sellers what is actually prohibited is reducing the measure and weight from what it should be, and there is nothing wrong with adding it accordingly, to ensure that the measure and weight are really sufficient. This method is commendable, but Syuaib as obliges them to do justice without more or less. This means that in carrying out measurements and weighing really carefully. After the Prophet Shuaib as forbade his people to reduce the measure and weight and obligated them to perfect it, then he forbade them from all kinds of actions that diminish the rights of others, the property rights of individuals or people, both types that are measured and those that are weighed as well as other types. other types as calculated or which have been limited by certain limits. Furthermore, the Prophet Shuaib as forbade his people to do anything that was destructive or disturbing security and peace on earth, both related to worldly affairs and those related to religion. This verse contains laws including: a. It is obligatory to perfect the scales and measurements as they should. b. It is illegal to take other people's rights, in any way and manner, whether those rights belong to individuals or to many people such as government and corporate property. c. It is forbidden to do anything that is destructive or disrupts security and peace on earth, such as pickpocketing, stealing, robbing, corruption, terrorizing, and so on."
		   },
		   {
			"id": 1559,
			"surah": 11,
			"ayat": 86,
			"tafsir": "In this verse, the Prophet Shuaib as explained to his people that the lawful profit they get after perfecting the measure and weight is better than the unlawful profit they get by reducing the measure and weight, if they believe. Because faith can truly cleanse the soul from greed and greed, and fill it with generosity. But if they don't believe, they won't be able to feel at all. Furthermore, the Prophet Shuaib as explained to his people, that he was not the person assigned to protect or protect them from committing crimes. He simply conveyed advice and instructions to them. This task has been carried out in earnest and accompanied by warnings about Allah's punishment for those who remain disobedient."
		   },
		   {
			"id": 1560,
			"surah": 11,
			"ayat": 87,
			"tafsir": "In this verse, Allah explains the reaction that the Prophet Shuaib as faced from his people as a rebuttal to the two kinds of contents of his da'wah, namely: first, so that they worship Allah Almighty and may not associate partners with Him by worshiping idols and so on; secondly, so that they perfect the measures and weights and may not reduce them. Regarding the contents of the first da'wah, they argued, \"Is it your prayer, which is caused by a disorder of erratic thoughts and crazy actions, that encourages and orders you to leave our worship of idols and statues worshiped by our grandmothers?\" our ancestors?\" They deliberately mentioned the Shuaib prayer because he was known to pray a lot so that it became a mockery for them, because they thought that what he did was an act of madness and a disorder of erratic thoughts. When his people see him praying, they wink at each other and laugh at him, then that prayer is one of the religious symbols that they laugh at. As for the content of the second da'wah, they argued, saying, \"Is it the prayer that commands you to prohibit and curb our freedom in utilizing our wealth according to intelligence and ingenuity with all kinds of deception according to our wishes and desires? Really you are people very kind and clever.\" According to Ibn Abbas, praising Shuaib as was a mockery of him, while what they meant was the opposite, namely the opposite of these two qualities. This opinion is in accordance with their previous conversation which was mockery in nature and purpose. Another opinion says that the praise remains according to its original meaning based on their original prejudices, that is, before Shuaib delivered his message to them. It's as if they were saying, \"You've always been very kind and clever, why do you want to trouble us now?\" This opinion is in line with the words of the Namud to Prophet Saleh as explained in the word of Allah: They (the Samud) said, \"O Saleh! Indeed, you were among us before and were expected, why did you forbid us to worship what worshiped by our ancestors? Indeed, we are really in doubt and anxiety about what (religion) that you call upon us.\" (Hud\/11:62)"
		   },
		   {
			"id": 1561,
			"surah": 11,
			"ayat": 88,
			"tafsir": "In this verse Allah swt explains Syuaib's answer to the objections of his people by saying, \"O my people, what do you think about this matter if I have real evidence from my Lord that the message that I convey to you is not my own opinion but a revelation from Allah. He has bestowed upon me various kinds of good sustenance. I obtained all of them in a lawful way, without reducing the measure and weight and other methods that reduce or harm the rights of others in an illegal way. What I'm telling you all is the result of my experiments and experience in a successful business that contains virtues and blessings, not just based on theory or the words of inexperienced people.\" Furthermore, the Prophet Shuaib as explained to his people by saying, \"In no way do I mean to forbid you to reduce measures and weights and other actions that reduce or harm the rights of others in a way that is not lawful, then I myself did it, but from the beginning I have acted honestly and did not practice deceit and fraud.\" Then the Prophet Shuaib said that he would not get taufik in every step he took, except with the guidance and help of Allah. Then he stated again that he had no power and strength, only in Allah did he put his trust in carrying out the da'wah delivered to his people. And it is to Him that he returns in all matters in this world, and it is He who will repay all his deeds in the Hereafter."
		   },
		   {
			"id": 1562,
			"surah": 11,
			"ayat": 89,
			"tafsir": "In this verse it is explained that the Prophet Shuaib as explained to his people advice and warnings by saying, \"O my people, do not fight between me and you, because you still maintain worshiping idols and statues, and persecute the rights of others by reducing the measure, weight and others, encouraging and causing you to become evil people so that you are overwritten by a doom that destroys in this world as the punishment of a typhoon that overwhelms Noah's people or the punishment of a strong wind that destroys the people of Hud or the punishment of a loud thunder that kills people Saleh.\" If the punishment that befalls these peoples due to their disobedience to Allah and His messengers, cannot be an example and teaching for you, because it is far from your time or place, then pay attention to the punishment of the hailstones that burn and destroy the people of Lut. . This event is not far from your time and place."
		   },
		   {
			"id": 1563,
			"surah": 11,
			"ayat": 90,
			"tafsir": "In this verse it is explained that the Prophet Shuaib as ordered his people to seek forgiveness from Allah Almighty by believing in Him and not associating partners with Him by worshiping idols and statues, and not reducing measures, weights and taking other people's property by illegal way. Then he ordered them to repent, that is, to return to the right path by obeying Allah and avoiding His prohibitions, because verily Allah is Most Merciful and Compassionate towards His servants who have repented and returned to the right path by giving forgiveness and freeing them from the punishment of the world and hereafter. The command to ask for forgiveness and repentance is mentioned side by side as found in other verses which have almost the same meaning. However, if the istighfar order is addressed to people who are still disbelievers, then the intention is not just to ask for forgiveness but to have faith in Allah. Repentance is regretting the mistakes made and returning to the right path. The mistakes in question are the mistakes made after believing, because the mistakes made in disbelief can be erased by having faith, and converting to Islam."
		   },
		   {
			"id": 1564,
			"surah": 11,
			"ayat": 91,
			"tafsir": "After the inhabitants of Madyan (the people of Shuaib as) felt bored and irritated with the Prophet Shuaib as because all the reasons they put forward to reject his call were answered by the Prophet Shuaib, they finally said, \"O Shuaib, we cannot understand what you are telling us about God. -the god we worship and the regulations that restrict our freedom to act and control our wealth, as well as about the punishment that will befall us, if we do not follow your will. It is as if you are the one who determines everything and in your hands are happiness and accidents us, even though all that is solely God's business. We see and believe that you are a weak and helpless person, it is impossible to bring us benefit or harm, and if we want to destroy you, you will not be able to defend yourself. If we had not felt sorry for your family and close relatives, we would have stoned you stoned to death.\" They continued their denial, \"You yourself are hopeless and of no value to us because you are not a brave and mighty person who can defend yourself from attacks by others. It is only out of pity for your family and close relatives that we have not killed you. because they are still on our side, in our group they don't want to leave our religion and the religion of our ancestors.\""
		   },
		   {
			"id": 1565,
			"surah": 11,
			"ayat": 92,
			"tafsir": "Hearing the words of his people who were very piercing to the heart and considered them to be despicable and helpless, the Prophet Shuaib said, \"It's really very sad your narrow-mindedness and your opinion is very surprising. Do you consider my kinsmen to be nobler and more powerful than Allah who created they created all of you, even created the heavens and the earth? Was it only because I came from them, that I did not dare to carry out your threat, not because I believe in Allah who will call you to worship and not associate partners with Him. Because He is the Almighty , Most Mighty, and Most Gracious who bestows upon Him and takes His power and mercy lightly. He is the one you should fear. what you do, nothing is hidden from Him repay according to your denial and disobedience.\""
		   },
		   {
			"id": 1566,
			"surah": 11,
			"ayat": 93,
			"tafsir": "Then the Prophet Shuaib as firmly opposed them and told them, \"Do as you please, do what you can do, and gather all the strength that is in you, I will stick to my creed, and I still believe in Him and I believe and have faith that He will protect me and protect me from all harm. You will know which of us will be doomed and doomed, which of us will lie and lie, wait for the fate that will befall you, I will be with you waiting.\" This is a bold challenge from someone who is helpless, has no helpers and defenders from among his people and has no strength to rely on, but full of faith and trust that Allah is always with him and will not neglect or neglect him. This is a challenge to people who are arrogant and arrogant, always proud of their material things but forget that above material power there is a supernatural power that can destroy them, namely the power and power of Allah SWT."
		   },
		   {
			"id": 1567,
			"surah": 11,
			"ayat": 94,
			"tafsir": "It was Allah's decree and sunnah for the ancient peoples that every people who disobeyed and rejected the call of His messenger would be afflicted and destroyed except for those who believed and obeyed and obeyed Allah. In the end, the torment and calamity was also inflicted on the people of Madyan and with the grace and mercy of Allah, the Prophet Shuaib as and those who believed were saved from the calamity in the form of a loud thundering sound that shook everyone's hearts and caused shocks and earthquakes that were so great that the inhabitants of that country disappeared in the twinkling of an eye, swallowed up by the earth, just like the catastrophe that befell the Namud, the people of Nabi Saleh as who were rebellious and rebellious too."
		   },
		   {
			"id": 1568,
			"surah": 11,
			"ayat": 95,
			"tafsir": "The country of Madyan after the catastrophe became desolate as if it had never been inhabited by humans. Their destiny is truly wretched and they are the farthest from Allah's mercy and compassion because of their denial and rebellion as well as the fate of the namud."
		   },
		   {
			"id": 1569,
			"surah": 11,
			"ayat": 96,
			"tafsir": "This verse explains that Allah has sent Musa (as) equipped with His signs and real miracles and all of this shows the oneness of Allah SWT, there is no God but Him. Scholars of tafsir agree that the signs of Allah's power which strengthened the prophethood of Prophet Musa are of nine kinds, namely sticks, white hands shining, hurricanes, locusts, fleas, blood, frogs, lack of fruit and lack of soul. The nine signs of Allah's power, have been included, among others, in His words: Then (Moses) threw down his staff, suddenly the stick became a real big snake. And he stretched out his hand, suddenly it became white (glow) for those who saw it. (al-Araf\/7: 107-108) And His words: So We sent them typhoons, locusts, fleas, frogs and blood (drinking water turned into blood) as clear proofs, but they still boasted and they are a sinful people. (al-Araf\/7: 133) And His word also: And indeed, We have punished Pharaoh and his people with (brought a drought) for many years and lack of fruit, so that they take lessons. (al-Araf\/7: 130) In addition to the completeness of the miracles given to the Prophet Musa as, Allah SWT has also given eloquence and intelligence to his younger brother named Harun, especially in dialogue with Pharaoh and the leaders of his people. This is what is meant by \"sulthanan mubina\" (a real miracle). Some scholars of Tafsir are of the opinion that what is meant by sultanan mubina in this verse, is the stick of the Prophet Musa as. Even though it is one of the nine signs of Allah's power as mentioned above, he is the most prominent compared to the signs of Allah's power. the other that was given to Musa as. With the miracle of that staff, Pharaoh's sorcerers turned around, then crowds of believers left Pharaoh and his misguided beliefs, as in the word of Allah SWT: And We revealed to Musa, \"Throw your staff!\" So suddenly he swallowed up all their falsehoods. So the truth was proven, and everything they did was in vain. So they were defeated in that place and they were the despicable ones. And the magicians immediately fell prostrate. They said, \"We believe in the Lord of the worlds, (namely) the God of Moses and Aaron.\" (al-Araf\/7: 117-122)"
		   },
		   {
			"id": 1570,
			"surah": 11,
			"ayat": 97,
			"tafsir": "In this verse, Allah swt explains that the Prophet Musa, who was equipped with signs of Allah's power and real miracles, was sent to Pharaoh and the leaders of his people, so that they would worship only Allah, the Lord of the worlds, because there is no God who actually but Him. Even though they had seen and witnessed for themselves the signs of Allah's power and the real miracles shown by Prophet Musa as, all of which showed the power of Allah, they did not want to realize, they even continued to obey Pharaoh's orders, even though Pharaoh was not right, and does not bring good even that is only destructive and misleading."
		   },
		   {
			"id": 1571,
			"surah": 11,
			"ayat": 98,
			"tafsir": "In this verse it is explained that Pharaoh has corrupted the earth and led his people astray in the world, in this verse Allah SWT explains that in the hereafter, he will lead his people to the place that has been prepared for them. He walked in front and his people who accompanied him from behind until they reached hell, then they were thrown into it together. What a disaster and loss for Pharaoh and his people, because hell is the worst place to visit, even since they left this world, every day, morning and evening hell is always shown to them as the word of Allah swt: So Allah protects him from the evil of their deceit , while Pharaoh and his people were surrounded by a very bad doom. They are shown hell, in the morning and evening, and on the day of the Last Hour. (Then the angels were commanded), \"Put Pharaoh and his people into a very severe punishment!\" (al-Mumin\/40: 45-46)"
		   },
		   {
			"id": 1572,
			"surah": 11,
			"ayat": 99,
			"tafsir": "In this verse, Allah swt explains that Pharaoh and his people since in the world have received curses from the people afterwards, continuously, until in the hereafter they will be cursed again by people who are in Padang Mahsyar, waiting for a decision from Qadhi Rabbul Jalil about where he is. will be placed later. The curse or curse they get is the worst thing. This verse is in line with the word of Allah SWT: And We pronounce anathema on them in this world; whereas on the Day of Resurrection they will be among those who are kept away (from Allah's mercy). (al-Qashash\/28: 42)"
		   },
		   {
			"id": 1573,
			"surah": 11,
			"ayat": 100,
			"tafsir": "In this verse, Allah swt explains that events that have occurred in the past and important events both in cities and in villages from the people of Prophet Noah as to the prophets after him, were deliberately included in the Al-Quran, so that the Prophet Muhammad can read to people and can also be read by people after his death to be used as a lesson and warning. Among the countries that have been destroyed, there are those whose traces are still visible, like plants that are still standing upright on the face of the earth, such as the land of the Prophet Saleh's people. the slightest trace like the land of Prophet Lut's people which had been turned upside down."
		   },
		   {
			"id": 1574,
			"surah": 11,
			"ayat": 101,
			"tafsir": "This verse explains that their destruction was not an act of persecution from God, but it was they who persecuted themselves that caused God to take such an action. They associate partners with Allah and wreak havoc on the earth continuously, so that the punishment cannot be delayed. If they were left in such a protracted state, surely they would have continued, even increased the persecution, crime, and destruction on earth, as the Prophet Noah said about his people, to Allah: Verily, if You let them stay, surely they will mislead your servants, and they will only give birth to evil and ungrateful children. (Nuh\/71: 27) The apostles who were sent to them were quite persistent in giving lessons and instructions, but they were still arrogant and disobedient. When threatened, they become even more rebellious and resistant because they believe too much that the gods they worship will save them from all the harm and doom that will befall them. Whereas if Allah swt has decided to bring down the punishment and destroy a people, then the offerings they call on other than Allah will not have the slightest benefit and will have no power at all to restrain and hinder Allah's decision. Their belief in their idols does nothing but add to their ruin and destruction. They believe that these idols will bring disaster to the prophet who was sent as told by Allah swt in His word; regarding the people of the Prophet Hud as: We only say that some of our gods have afflicted you with madness. (Hud\/11:54)"
		   },
		   {
			"id": 1575,
			"surah": 11,
			"ayat": 102,
			"tafsir": "In this verse, Allah SWT explains that the doom that was inflicted on the lands of the Noahs, the Ad's and the Namudites will also be inflicted on all countries whose inhabitants are still and always do damage on this earth. There is not a single people who will escape and be spared from it if Allah swt has willed it. The words of the Prophet Muhammad saw: Indeed, Allah swt has postponed the punishment for those who do wrong so that when He punishes them He will not spare them. (History of Ahmad, al-Bukhari, Muslim and at-Tirmidhi from Abu Musa al-Asyari) Indeed, Allah's punishment is very painful. The description above can be used as a lesson, especially for people who do wrong, so that they are aware and realize their evil deeds. There is no effort or power, no matter how great it is, that can prevent or stem the punishment of Allah that will befall a country or a people. Word of Allah swt: And don't they travel the earth and see how the end of those before them (who denied the apostle)? Those people are stronger than they (themselves) and they have cultivated the earth (land) and prosper it beyond what they have prospered. And their messengers came to them with clear evidences. So Allah is not at all unjust to them, but they are the ones who are unjust to themselves. (ar-Rum\/30:9)"
		   },
		   {
			"id": 1576,
			"surah": 11,
			"ayat": 103,
			"tafsir": "In this verse, Allah SWT explains that what has been told about the destruction of the ancient peoples as a result of the persecution they have carried out, is a lesson for people who want to be aware and fear the punishment in the hereafter. Allah who tortures them in this world, of course is also able to torture them in the hereafter and what covers them in this world, is a description and example of what he will encounter in the hereafter. Incidents such as typhoons, earthquakes, landslides, and so on, which destroy property and lives of not a few in number, are punishments and warnings from Allah SWT to humans to realize the mistakes, sins, persecutions they have committed. , and not just natural disasters that have nothing to do with the power of Allah SWT. Before these things happened, Allah's messengers had warned their people that something would happen, so that they would be careful. All of this shows that these events were not coincidental, but were closely related to Qadha and Qadar, one of the pillars of faith that must be believed and believed in, pay attention to the words of Allah SWT: And the wrongdoers will one day know where they will return to. . (asy-Syuara\/26: 227) People who do not want to be aware of God's warnings in this world, will be punished later in the hereafter, on the day when all creatures will gather to be accounted for all their deeds, then be rewarded as fairly as possible. This event was witnessed by all creatures, both humans, jinn, angels, and other creatures."
		   },
		   {
			"id": 1577,
			"surah": 11,
			"ayat": 104,
			"tafsir": "In this verse, Allah explains that the Day of Judgment is the day when all creatures will gather and witness all their deeds and each human being is asked to account for his deeds in the world, it will not be postponed and extended, but will end according to what Allah has determined."
		   },
		   {
			"id": 1578,
			"surah": 11,
			"ayat": 105,
			"tafsir": "In this verse, Allah SWT explains that when the appointed day comes, no one can say or do anything except with Allah's permission, as He says: This is the day when they cannot speak, and they are not allowed to give reasons they are forgiven. (al-Mursalat\/77: 35-36) And His words: On the day, when the spirit and the angels stand in rows, they do not speak, except those who have been given permission to him by God, the Most Merciful and he only tell the truth. (an-Naba\/78: 38) Among those gathered on the Day of Judgment, there are those who are wretched, they will receive a painful punishment as has been threatened to the disbelievers, and there are those who are happy, they will receive a reward and eternal pleasure according to what has been promised to those who are pious."
		   },
		   {
			"id": 1579,
			"surah": 11,
			"ayat": 106,
			"tafsir": "In this verse, Allah SWT explains that people who belong to the wretched group, because when they are in the world they have damaged their beliefs, follow people whose actions go astray, so that the light of faith fades and the light of faith from them fades away, wallowing in sins all the time. They will be put into hell and feel a painful punishment just like a himar who exhales and exhales his breath accompanied by very loud moans and screams."
		   },
		   {
			"id": 1580,
			"surah": 11,
			"ayat": 107,
			"tafsir": "They will remain in hell forever unless Allah wills something else, because He is the Executor of what He wills. Whatever He wills will be realized and what He does not will will not exist."
		   },
		   {
			"id": 1581,
			"surah": 11,
			"ayat": 108,
			"tafsir": "In this verse, Allah SWT explains that people who are happy because when they are in the world are always careful and avoid actions that are contrary to Allah's commands and stay away from temptations that will plunge them into the valley of immorality, they will be placed in heaven, and eternal in it forever, unless Allah wills something else. The rewards and favors that are bestowed on happy people are gifts solely from Allah SWT which are continuous without interruption, according to His word: They will receive rewards that are uninterrupted. (at-Tin\/95: 6)"
		   },
		   {
			"id": 1582,
			"surah": 11,
			"ayat": 109,
			"tafsir": "In this verse, Allah (swt) comforted Prophet Muhammad (s) and warned his enemies. And for polytheists who worship idols, Allah will surely punish them because what they worship is the same as what their ancestors worshiped. Just as their ancestors had been tortured for their actions against the prophets and worshiping idols, the same will be inflicted on them, not reduced in the slightest."
		   },
		   {
			"id": 1583,
			"surah": 11,
			"ayat": 110,
			"tafsir": "In this verse, Allah swt explained that He had given the Torah book to Musa as, then the Torah book was disputed by his people, was the Torah book really from Allah or not? Some of them believe that the Torah is really from God and some others deny it. Therefore, the Prophet Muhammad did not need to feel upset when he saw that the Meccan infidels doubted the Al-Quran, both its content and its truth. If there was no provision from Allah to delay those who do wrong and disobey until the appointed time, surely Allah would punish them as he punished and destroyed those who opposed the da'wah of the messenger before the Prophet Muhammad. In line with the contents of this verse, Allah says: And do not think that Allah is unaware of what the wrongdoers do. Verily Allah suspended them until the day when (their) eyes widened, (Ibrahim\/14: 42) At the end of this verse Allah explains that those who deny the book of Allah are really in deep doubt and doubt, as the word Allah: And they (the People of the Book) did not divide except after knowledge (the truth conveyed by the prophets) came to them out of envy among themselves. If it were not for a pre-existing decree from your Lord (to postpone the punishment) until the specified time limit, surely their punishment would have been carried out. And indeed those who inherited the Book (Torah and Gospel) after them (at the time of Muhammad), were really in deep doubt about that Book (Al-Quran). (asy-Shura\/42: 14)"
		   },
		   {
			"id": 1584,
			"surah": 11,
			"ayat": 111,
			"tafsir": "In this verse, Allah swt emphasizes that those who dispute about the truth of the Koran and doubt that it came from Allah, Allah will complete the reward for their actions both in this world and in the hereafter, because Allah knows best what they have done. Allah's Word: Thus it is caused by what your own hands have done, and verily Allah does not wrong His servants. (ali Imran\/3: 182) And His words: Whoever does good then (the reward) is for himself and whoever does evil then (his sin) becomes his own responsibility. And your Lord does not wrong (His) servants at all. (Fushshilat\/41: 46)"
		   },
		   {
			"id": 1585,
			"surah": 11,
			"ayat": 112,
			"tafsir": "This verse makes demands on the Prophet Muhammad for what he should have done when his people raised a challenge, and doubted the Al-Quran that he brought. He was ordered to remain in his stance, walk on the straight path, convey the law that was mandated to him, carry out his treatise and do not let it occur to his heart that he will leave some of what has been revealed to him, because of the cruelty of slander by his people, as Allah says: So it is permissible so you (Muhammad) want to leave some of what is revealed to you and your chest is tight because of it. (Hud\/11: 12) Likewise those who have realized and realized and repented from polytheism and disbelief and have believed with Muhammad saw so that they remain in their stance, maintain their monotheistic beliefs and never shift from the straight and true path that had believed and believed, because God saw and knew all that. In line with this verse, Allah says: Therefore call (they believe) and stay (believe and preach) as commanded to you (Muhammad) and do not follow their desires and say, \"I believe in the Book that was sent down by Allah and I was ordered to act fairly. among you. Allah is our Lord and your Lord. For us our deeds and for you your deeds. There is no (necessary) quarrel between us and you, Allah gathers between us and to Him (we) return.\" (asy-Shura\/42: 15)"
		   },
		   {
			"id": 1586,
			"surah": 11,
			"ayat": 113,
			"tafsir": "In this verse, Allah swt emphasizes that those who believe in the Prophet Muhammad and adhere to his religion, should never be inclined towards unjust people, namely the enemies of the Muslims who always hurt them and the polytheists who always try to return them. to polytheism. Never ask for help and assistance from them, as if they have been made leaders, because if it has reached such a degree, then the believers are included as they too will not receive guidance. Allah's Word: Whoever among you makes them a loyal friend, then surely he is one of them. Indeed, Allah does not guide the wrongdoers. (al-Maidah\/5: 51) The only one who can be made a leader and asked for help and help is only Allah. Whoever does anything other than that, then he is one of the wrongdoers who has no helper, as Allah says: And there is no helper for the wrongdoers. (al-Maidah\/5: 72)"
		   },
		   {
			"id": 1587,
			"surah": 11,
			"ayat": 114,
			"tafsir": "This verse instructs Muslims to offer prayers, complete with pillars and conditions, to be carried out five times a day and night according to predetermined times, namely the Fajr, Noon and Asr, Maghrib and Isha prayers. In line with this verse the word of Allah: So glorify Allah in the evening and in the morning (at dawn), and all praise be to Him in the heavens and on earth, at night and at midday. (ar-Rum\/30: 17-18) This verse also explains that good deeds, the outline of which is doing God's commands and avoiding his prohibitions, including praying, will erase minor sins and bad deeds. This is in line with the words of the Prophet Muhammad: Accompany the bad deeds with good deeds, then the good deeds will erase the (sins) of the bad deeds. (History of at-Tirmidhi from Abu dzar al-Gifari) And the word of Allah: If you avoid major sins among the sins that are forbidden to do, We will erase your mistakes and We will enter you into a glorious place (heaven). . (an-Nisa\/4: 31) The previous messages, such as the command to istiqamah, the prohibition of doing wrong and taking sides with wrongdoers and the command to establish prayer are lessons and warnings for people who are conscious and insyaf who always remember Allah."
		   },
		   {
			"id": 1588,
			"surah": 11,
			"ayat": 115,
			"tafsir": "In this verse, Allah swt commands to be patient. What is meant by patience in this verse is steadfastness and endurance in facing all difficulties in carrying out Allah's commands and avoiding His prohibitions. Patience and prayer are two twin charities that can be used as helpers to be able to overcome all difficulties encountered, so that they can easily reach what they aspire to. There are not a few verses that recommend that patience and prayer be used as helpers. Among other things, the word of Allah: O you who believe! Ask for help (to Allah) with patience and prayer. Indeed, Allah is with those who are patient. (al-Baqarah\/2: 153) And His words: So be patient with what they say, and glorify your Lord before the sun rises and before it sets; and glorify (also) at midnight and at the end of the day, so that you feel calm. (thaha\/20: 130) This verse ends with an affirmation that Allah will not waste the rewards of those who do good deeds such as patience, but Allah will perfect their rewards as His words: Only those who are patient will have their rewards perfected without limit. (az-Zumar\/39: 10)"
		   },
		   {
			"id": 1589,
			"surah": 11,
			"ayat": 116,
			"tafsir": "In this verse Allah swt expresses His reproach to smart people, clever people who do not forbid their fellow people from doing damage on earth, even though the common sense and intelligent thoughts they have are enough to be able to understand and understand the goodness that is called for. by the apostles. Only a few of them use their common sense, mind and intelligence to forbid doing what is wrong and order to do what is good. Those who are few are saved by God. The ancient people who were clever and tyrannical were more concerned with luxury and excessive pleasures which caused them to become arrogant, arrogant, and wicked. The apostle's invitation to goodness was opposed, even they did the opposite. Evil is widespread, none of them prohibits others from doing what is wrong. Because the sins they committed were too heavy, God destroyed them. Allah's Word: And if We want to destroy a country, then We order people who live in luxury in that country (to obey Allah), but if they commit disobedience in (the country), then it is appropriate that the words (Our punishment) apply to them, then We completely destroyed (the land). (al-Isra\/17: 16)"
		   },
		   {
			"id": 1590,
			"surah": 11,
			"ayat": 117,
			"tafsir": "In this verse, Allah swt explains that He will not destroy a country, if the inhabitants of that country still do good, do not do unjust things such as reducing the scales as was the case with the Prophet Shuaib as, did not commit liwath (homosexuality, sodomy) acts like the people of Prophet Lut. as, disobeying his ruler who was cruel and ruthless, like Pharaoh, and other crimes, because of that, is an injustice. God will not order to do that. Allah's Word: And your Lord does not wrong (His) servants at all. (Fushshilat\/41: 46) And His words: Indeed, Allah does not wrong people in the slightest. (Yunus\/10: 44)"
		   },
		   {
			"id": 1591,
			"surah": 11,
			"ayat": 118,
			"tafsir": "This verse explains that if Allah wills, then humans will become one people in religion according to the natural nature of their occurrence. Even though at first humans were one people there were no disputes between them, but after they multiplied, different needs and desires arose, so that endless differences and disputes arose, as Allah says: And humans were only one people, then they differ. (Yunus\/10: 19)"
		   },
		   {
			"id": 1592,
			"surah": 11,
			"ayat": 119,
			"tafsir": "Their disputes are not only about the religions adhered to by each people, such as Judaism, Christianity, Zoroastrianism, Islam, or shirk, but also adherents of one religion, except for those who receive mercy from Allah and are given taufik and guidance. They are united and always strive for unity so that humans obey God's rules and regulations, do what He commands and stay away from what He prohibits. Such is God's will regarding human diversity. There are those who receive grace, taufik, and guidance from Allah, they unite and promote unity, and they are included in the group of happy people who will become residents of heaven. There are also those who constantly argue and they are among the wretched people who become the inhabitants of hell. Malik bin Anas once said, \"Man was created partly in heaven and some others are in hell.\" Therefore Allah ends this verse with a firm statement that it has become His provision to fill Hell with jinns and humans who always do evil and sin on this earth."
		   },
		   {
			"id": 1593,
			"surah": 11,
			"ayat": 120,
			"tafsir": "This verse explains that the stories of the previous apostles and their people, such as the incidents of debate and enmity between them, the complaints of the prophets because their people belied and hurt and so on, all of this is useful to strengthen the heart of the Prophet so that he will not be swayed by anything to carry out his apostolic duties and broadcast his preaching. In addition, these stories also instill a solid and deep belief in what the apostles called for, such as the belief that Allah is One, repent and worship Him sincerely, leaving evil, both real and unreal. All of this is a useful lesson and warning for believers that the former ummah will be punished for them because they have done mischief and damage to the earth."
		   },
		   {
			"id": 1594,
			"surah": 11,
			"ayat": 121,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to say to the disbelievers, \"Act according to your position and ability to oppose preaching and hurt those who preach and their supporters. We will also act according to our position and ability to defend da'wah.\" and carry on the commands of Allah, and obey and obey Him.\" This is a threat to them about the punishment they will receive in return for their actions."
		   },
		   {
			"id": 1595,
			"surah": 11,
			"ayat": 122,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to tell the disbelievers who remained disobedient to the Apostle so that they would wait for what would happen with the Prophet's preaching, and what calamity befell the Apostle, which they really hoped for, as explained in His word. : In fact they say, \"He is a poet we were waiting for an accident to happen to him.\" (ath-thur\/52: 30) Then the Apostle was ordered to tell them that he was also waiting for what would happen to their fate, whether they would be punished by Allah, or would they be defeated by the believers, in the war that would take place between both sides, as the fate of the previous peoples, who disobeyed their prophets. Indeed, Allah guarantees victory for those who defend religion, and defeat and humiliation for those who do wrong. These verses are similar to the word of Allah: Later you will know, who will get the (best) place in the hereafter (later). Indeed, those who do wrong will not be successful. (al-Anam\/6: 135)"
		   },
		   {
			"id": 1596,
			"surah": 11,
			"ayat": 123,
			"tafsir": "This verse explains that Allah knows what is hidden and cannot be reached by anyone's knowledge, both in the heavens and on earth. He knows everything that will happen and the exact time it will happen. All matters will return to Him. What He wills will come to pass, and what He does not will will not exist. Therefore, He is the only one who deserves and must be worshiped, with all sincerity. It is in Him that we must put our trust in order to achieve something that is beyond our ability, because whoever puts his trust in Him will achieve his needs. Allah's Word: And whoever puts his trust in Allah, Allah will fulfill his (needs). Verily, Allah carries out His affairs. Indeed, Allah has made provision for everything. (ath-thalaq\/65: 3) At the end of this verse, Allah SWT explains that He will not be heedless of what His servants have done. He will complete every charity reward that is done in this world and there will be no reduction in the slightest. Allah's Word: And fear the day (when) you are all returned to Allah. Then everyone is given a perfect reward according to what he has done, and they are not wronged (harmed). (al-Baqarah\/2: 281)"
		   }
	]
}
