{
	"tafseer": [
		{
			"id": 5592,
			"surah": 76,
			"ayat": 1,
			"tafsir": "This first verse emphasizes the process of human occurrence from non-existence to existence, when humans had no form at all. It was stated that humans came from an unknown land and was not mentioned before. What and how the type of soil is not known at all. Then God breathed a spirit into him, so that he became a living being. The verse above can be interpreted as one part that tells about human evolution. A full description of this can be seen below. In the 19th century, Charles Darwin put forward the theory that human species existed on earth through a long process of evolution. They do not directly exist as stated in many scriptures. He stated that the time required for the evolutionary process, which led to the formation of humans, likely spanned millions of years. The second thing proposed by Darwin's theory is that humans evolved from animals. At the beginning of life, this theory stated, the existing life forms were lower animals. With the passage of time, higher level beasts and larger sizes appeared. By accident, one of the animals developed into a human. He proved this by the existence of a series of evidence from animal skulls that traceably lead to present-day human skulls. Other evidence was also put forward from the development of embryonic forms. During its development, the human embryo changes shape. Starting from the embryo-like shape of fish, rabbits, and other types of animals, and ending in the shape of a human. From this last finding, it was concluded that the long evolution of humans came from low-level stars. The second point of Darwin's theory is that humans and apes came from a common ancestor that is now extinct. This extinct ancestor is called a \"missing link\", the missing link. Haekel, a post-Darwinian researcher, argues that the animal that is the \"missing link\" is a so-called Lypotilu. If this animal or its remains can be found, then the puzzle of human evolution can be better explained. Thinkers who believe in this theory assume that gorillas and chimpanzees are on the path of human evolution. Another researcher named Huxley had a slightly different thought. He concluded that the human lineage could have occurred long before the appearance of the ape species. So, humans and apes are never related. More later research conducted by Prof. Jones and Prof. Osborne tends to conclude that even though humans have gone through an evolutionary process, the process has been separated from other animals in a more distant future. And from that moment on, humans evolved on their own line, without mixing with the evolution of other animals. In other words, humans are not a branch of other animals, say apes, as Darwin believed. Archaeologists and anthropologists find that human civilization occurred through clearly divided paths. In the stone age, humans first stepped into the area of culture and society. Since then, humans have evolved to maintain life as \"weak animals\". Lacking the strength, claws and strong fangs of other animals, humans used stones for self-defense and other uses. Then came the Bronze Age, when humans started using metal materials to make tools. This age was followed by the iron age. From various sites found by archaeologists, it was concluded that various eras of human life were carried out by cultural changes from one period to another. In the Qur'an, there is one verse that is closely related to the gradual creation of human beings, namely: Why do you not fear the greatness of Allah? And indeed, He has created you in several stages (events). Have you not seen how Allah has created the seven heavens in layers? And there He created the shining moon and made the sun a (brilliant) lamp? And Allah causes you to grow from the ground, grow (gradually), then He will return you to it (the land) and bring you out (on the Day of Resurrection) with certainty. And Allah made the earth for you as an expanse, so that you can go to and fro on broad roads. (Nuh\/71: 13-20) The verse above denounces humans who still doubt that creation was not carried out based on good planning. It shows how everything is done through phases or periods, which are orderly and based on wise planning. Creation is done not without purpose, and leads to perfection. It turns out that the laws of evolution developed by researchers in Europe had been explained in great detail by the Qur'an 1400 years earlier. The Qur'an explains that humans were not created suddenly and in the shape and form we are today. God did not make a model out of clay and \"breathe\" life into it to become the first human on earth. Humans reached the current stage after going through a process of several periods of change. The second thing that the Qur'an reveals in relation to the creation of man is from a state of nothingness. A subject that contradicts the previous explanation. And doesn't that man think that We created him before, even though (before) he had no form at all? (Maryam\/19: 67) The verse above refers to the first creation of the human kind. Very different from what is happening now. Human reproduction at this time occurred by means of seeds produced from both male and female organs. It should be noted carefully that in this verse, there is a statement that something comes from nothing. The verse states that before the stage where materials and other things become living things, there is another stage where there is no existence whatsoever. We can say that chairs are made of wood; or chains made of iron. Here we have materials that can be used as materials to make certain items. Those who do not believe in religion often refer to the above verse as just a myth. However, the verse above does not state such a thing. The meaning of the verse above clearly tells us that before creation, there was nothing in the universe. After the creation of the universe, other creations followed, including the creation of humans. The second stage of human development seems to occur when humans exist physically, but the brain is not yet well developed. Thus, his position is still the same or lower than animals. Hasn't it come upon humans one time from the past, while it was not yet something that could be mentioned (al-Insan\/76: 1). The third stage of human evolution was reached when reproduction between males and females began to occur. In the Qur'an, a period of human evolution is stated. At that time humans had the character of a high-level beast. This character is a difference based on sex, divided into males and females. At this time, reproduction is through sperm produced by male humans. This situation makes humans already have the same characteristics as higher level animals. The two verses below show this: It was He who created you from one soul (Adam) and from it He created his partner, so that he would be pleased with him. So after mixing with him, (his wife) conceived a light womb, and he continued to feel light (some time). Then when he feels heavy, both (husband and wife) pray to Allah, their Lord (saying), \"If You give us pious children, surely we will always be grateful.\" (al-A'raf\/7: 189) And the word of Allah: O people! Fear your Lord, who created you from one self (Adam), and (Allah) created his partner (Eve) from his (self); and from both of them God multiplied men and women…. (an-Nisa'\/4: 1) Furthermore, the Qur'an shows human development to a further level, namely using his reasoning, thus: Indeed, We have created man from a drop of mixed sperm that We want to test him (by order and prohibition), therefore We made him hear and see. (al-Insan\/76: 2) Starting from this period, because of its important role in the universe, humans began to study nature. To be able to manage properly, humans need extensive mastery of knowledge. This fourth stage is reached when the human brain has reached its perfection. Characterized by the rapid development of intelligence and concern for the environment. With the ability to hear and see, as can also be done by animals, humans then begin to train their intelligence to the level of being able to make discoveries that are useful for their lives. Here man has placed himself far above the animals. It becomes a type of animal that can survive through the ability to think and speak. This description of human evolution is not explicitly presented in the Qur'an. Why? Because this book is not intended as a scientific book. Al-Qur'an was created to reveal the truth, and left some gaps or gaps which will be filled by the progress of human knowledge."
		   },
		   {
			"id": 5593,
			"surah": 76,
			"ayat": 2,
			"tafsir": "This verse explains the elements of human creation, namely that humans were created from a mixed male sperm (nuthfah) and female ovum. The two elements originate from the male sulbi and the female breastbone and come out radiantly. Allah's Word: He was created from water (semen) that gushed out, which came out from between the backbone (sulbi) and the breastbone. (ath-thariq\/86: 6-7) The word amsyaj (mixed) contained in this verse means the mixing of male sperm which is whitish in color with female egg cells which are yellowish. It is this mixture that produces a clot of blood ('alaqah), then a lump of flesh (mudgah), then bones wrapped in flesh, and so on, so that after 9 months in the mother's womb a perfect baby is born. God's purpose in creating man was to test him with commands (taklif) and prohibitions, and to uphold the integrity of God's message on this earth. As a test, among them is whether they can be grateful when happy and happy, and patient and steadfast when facing enemies. Because human birth is ultimately aimed at upholding God's message, hearing and sight are bestowed upon him which enable him to hear and witness the greatness, power, and magnitude of God's grace. Humans are endowed with hearing and reason as proof of the power of Allah. The special mention of hearing and sight in this verse means that both of them are the senses which have the most function of observing Allah's creation to bring people to monotheism about Him. With the means of sight and hearing and also equipped with the mind (reason), there are two possibilities for humans. Does he tend to return to his original nature as an earthly creature so that he is the same as other creatures such as animals and plants, or does he tend to become a divine being, who thinks and pays attention to His greatness? After becoming a human whose senses are perfect so that it allows him to carry the burden (taklif) from Allah, then he is given two alternative ways of life as mentioned in the next verse."
		   },
		   {
			"id": 5594,
			"surah": 76,
			"ayat": 3,
			"tafsir": "This verse explains that Allah has actually shown mankind to the straight path. Some of them are grateful and some are disbelievers. With the guidance of His revelation conveyed through the Prophet Muhammad, humans have been shown the straight path and the wrong path. Allah showed him good and evil. From the sabil words contained in this verse, it is illustrated that God's desire for humans is to guide them to His guidance. The word sabil is more precisely interpreted as a guide than a way. The guidance is in the form of the arguments for the oneness of Allah and the prophethood mentioned in the holy book. Sabil (guidance) can be captured by hearing, sight, and thought. God wants to show people the proofs of His existence through seeing themselves and the universe, so that their minds are content to believe in Him. However, it is a fact that some people are grateful for God's gifts, but some are disbelievers (infidels). Strictly speaking there are those who become believers, and there are also those who are unbelievers. With that stability, humans are free to make their choices between the two available alternatives. In another verse it is stated: Who created death and life, to test you, which of you is better in deeds. And He is Mighty, Most Forgiving. (al-Mulk\/67: 2) Allah's Word: And truly, We will really test you so that We know those who really strive and are patient among you; and we will test you. (Muhammad\/47: 31) That humans were first created based on His nature and guidance, only then came the temptation to deny Allah, mentioned in a verse: ¦(according to) Allah's nature because He has created humans according to that (fitrah). (ar-Rum\/30: 30) In a hadith it is stated: No one leaves (the house), unless he has two flags in his hand: the flag (one) in the hand of the angel and the flag (the other) in the hand of the devil. If someone goes out hoping for what Allah loves or pleases, surely he will be followed by angels with their flags. He was always under the banner of angels until he returned to his home. And if someone goes out seeking what Allah disapproves of, Satan will surely follow him with his flag. He was always under Satan's banner until he returned to his home. (Ahmad's history from Abu Hurairah)"
		   },
		   {
			"id": 5595,
			"surah": 76,
			"ayat": 4,
			"tafsir": "This verse explains that in fact Allah has provided chains, shackles, and a burning hell for disbelievers, namely those who deny and even deny, the favors and gifts that have been bestowed upon them. Chains are used to bind their feet so they don't run away, while shackles are to chain their hands and necks which are bound to hell. The Sa'ir (flaming) hell as mentioned in the last surahh is a hell whose flames cannot be compared to any kind of fire in this world. The fire in the world is only one seventieth of the fire of hell. Another verse mentions: When shackles and chains were put on their necks, while they were dragged. (Gafir\/40: 71)"
		   },
		   {
			"id": 5596,
			"surah": 76,
			"ayat": 5,
			"tafsir": "This verse explains Allah's reward for those who do good, namely in the form of a drink from a glass filled with water whose mixture is kafr water, which is the name of a spring in heaven which is white in color, smells good, and tastes good."
		   },
		   {
			"id": 5597,
			"surah": 76,
			"ayat": 6,
			"tafsir": "The springs of water in heaven are a delicious drink for God's servants. They can also stream it at will. So kafr comes from a spring whose water is drunk by the servants of Allah who are muqarrabin (those who are close to Him). They can flow the river water according to their heart's desire without any obstruction. They are free to enjoy the water to their heart's content. The water will flow where they want, into the rooms, mahligai, or into the gardens they want."
		   },
		   {
			"id": 5598,
			"surah": 76,
			"ayat": 7,
			"tafsir": "This verse and the following verses mention some of the characteristics of abrar people (doing good), namely: they fulfill their vows and are afraid of a day when their punishment will be evenly distributed everywhere. Fulfilling a vow is fulfilling an obligation that comes from oneself in order to obey God. In contrast to syara (religious) obligations that come from God, vows are burdensome that arise because of one's own desires with the intention of being grateful for God's blessings. Both vows and syarak, both of which are obligatory to implement. In a hadith narrated by Imam Malik, al-Bukhari, and Muslim from 'Aisyah, the Messenger of Allah said: Whoever makes a vow to obey Allah, let him fulfill that vow, (but) do not fulfill it if the vow is to disobey Him. (History of al-Bukhari, Malik, Abu Dawud, at-Tirmidhi, an-Nasa'i and Ibn Majah from 'Aisyah) In several hadiths the provisions of vows are explained, including: 1. Hadith narrated by al-Bukhari from 'Aisyah in above explains that vows that intend to obey Allah must be fulfilled, while vows with the intention of disobeying Allah cannot be fulfilled. Likewise the hadiths narrated by at-Tirmidhi, Abu Dawud, and an Nasa'i. 2. The Messenger of Allah ordered Sa'ad bin Ubadah to pay the votive fast that his deceased mother had said. This hadith was narrated by al-Bukhari and Muslim from Sa'ad bin Ubadah. Apart from fulfilling the promise, the abrar person also wants to leave all prohibited actions (muharramat) for fear of the terrible punishment that must be received on the Day of Judgment as a result of doing it. Because on that day, all the evil and lawlessness that a person has ever done will be announced. Only God's beloved people survived this terrible situation."
		   },
		   {
			"id": 5599,
			"surah": 76,
			"ayat": 8,
			"tafsir": "It is stated that the background of the revelation of verse 8 relates to an Ansar man named Abu Dahdah who was fasting one day. When the time to break the fast comes, visit the house of a poor man, an orphan and a prisoner. The three of them were served by Abu Dahdah with three slices of bread. Finally, for his family and children, only a piece of bread was available even though he was about to break his fast. So Allah sent down this verse. Another history says that Ali bin Abi Talib got paid to work with a Jew in the form of a sack of wheat. A third of the wheat was cooked. When it was ready to be served, a poor man came to ask for it. Without thinking, Ali immediately gave it. Then cook it a third more. After it was ready to be eaten, an orphan came to ask for the wheat porridge. Ali also gave it. The third time the remaining wheat was all cooked, and coincidentally there came a prisoner who was still a polytheist and begged for mercy. Ali gave him the rest of the oats, so that he himself had nothing left. Thus, to appreciate social attitudes, Allah sent down this 8th verse. This verse explains that the abrar people provide the food they really need and like to the poor, orphans, and people who are taken prisoner. Providing food in this case can also mean providing assistance and support to people in need. Food is mentioned here because it is a staple of one's life. It is also possible that giving food means doing good to people who really need it in any way and form. It is also possible that what is meant by giving food also means doing good to beings who really need it in any way and form. Special mention is made of giving food because that is the highest form of ihsan (goodness). Another form of ihsan which is also of high value is mentioned in another verse, namely: He said, \"I have spent a lot of wealth.\" Did he think that no one saw him? Have We not made for him a pair of eyes, a tongue and a pair of lips? And We have shown him two paths (righteous and evil), but he did not take the way that is steep and difficult? (al-Balad\/90: 6-11) From this verse it can be concluded that giving assistance (help) is prioritized to people who are strong trying to make ends meet, but their income does not meet their daily needs. Poor also means a person who has no wealth at all and because of his physical condition it is not possible to try to make a living. As for people who are being held prisoner, apart from meaning prisoners of war, it can also mean people who are being imprisoned (for violating Islamic law provisions or making mistakes), or slaves who have not been able to free themselves and who need help. Thus, assistance in the form of food to people in need is not limited to Muslims, but also non-Muslims. What needs to be remembered by someone who wants to do social charity like that is sincerity in doing it selflessly."
		   },
		   {
			"id": 5600,
			"surah": 76,
			"ayat": 9,
			"tafsir": "This verse explains the sincerity of the Abrar people who stated that they gave food to the poor, orphans and captives only to hope for Allah's pleasure, not wanting anything in return nor expecting thanks. So, when you are about to start a social enterprise, let your heart and tongue be sincere for the sake of Allah, without being interfered with by other feelings that want to receive an appropriate reward or expect praise and flattery from others."
		   },
		   {
			"id": 5601,
			"surah": 76,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that abrar people are people who do all the good deeds as mentioned above because they are afraid of Allah's punishment that befalls them on a day full of difficulties. They do social work to help others, such as giving food and other things, with the hope that God will love and care for them with His love from the torment of the Doomsday when humans come to meet God with sour faces because of various difficulties and fears."
		   },
		   {
			"id": 5602,
			"surah": 76,
			"ayat": 11,
			"tafsir": "It was also explained that as a reward for the abrar people, Allah preserved them from the troubles of the day and gave them joy in their faces and joy in their hearts. Shown on their faces beaming joy as a sign of contentment because of the grace of God that they have received. In another verse, Allah says: On that day there will be faces beaming, laughing and rejoicing. ('Abasa\/80: 38-39)"
		   },
		   {
			"id": 5603,
			"surah": 76,
			"ayat": 12,
			"tafsir": "In this verse it is explained that Allah rewarded them for their patience with heaven and silk clothing. Because of their patience in doing good, fortitude in refraining from temptations of lust, and sometimes having to endure hunger and lack of clothing (because of doing social work in a state of poverty), Allah repays such things with the pleasures of heaven in another form in the form of clothes made from silk. This verse is the same as the meaning of Allah's word: (They will get) paradise 'Adn, they will enter it, in it they will be adorned with bracelets of gold and pearls, and their clothes inside will be silk. (Fathir\/35: 33)"
		   },
		   {
			"id": 5604,
			"surah": 76,
			"ayat": 13,
			"tafsir": "In this verse, Allah explains the condition of the people in heaven that they are sitting reclined on the couch. They do not feel the heat of the sun nor the cold air. It is said that the scorching sun never touched the couches in heaven, nor were they touched by cold air that pierced the bone marrow as in this world, but there was only one cool climate that never changed. Neither felt hot nor cold. The growth of a very shady and soothing tree protects the abrar people so that the pleasure they get increases. The same goes for fruits that taste delicious and are easy to pick. They enjoy lying down sitting or standing as they please."
		   },
		   {
			"id": 5605,
			"surah": 76,
			"ayat": 14,
			"tafsir": "(13-14) In this verse, Allah explains the condition of the people in heaven that they are sitting propped up on couches. They do not feel the heat of the sun nor the cold air. It is said that the scorching sun never touched the couches in heaven, nor were they touched by cold air that pierced the bone marrow as in this world, but there was only one cool climate that never changed. Neither felt hot nor cold. The growth of a very shady and soothing tree protects the abrar people so that the pleasure they get increases. The same goes for fruits that taste delicious and are easy to pick. They enjoy lying down sitting or standing as they please."
		   },
		   {
			"id": 5606,
			"surah": 76,
			"ayat": 15,
			"tafsir": "In the following verses, Allah also explains the food and drink served to them in various forms, vessels made of silver as well as a number of glasses that are very clear like sparkling glass. The vessels and glasses were very clear as if they were very beautiful and very valuable glass. The hadith narrated by Ibn Abi Hatim from Ibn 'Abbas explains as follows: There is nothing in heaven, but in this world Allah has bestowed upon you something similar to that, except bottles made of silver. (History of Ibn Abi Hatim from Ibn 'Abbas). In another verse it is also stated: They are passed around golden plates and cups, and in heaven there will be whatever the heart desires and all that is pleasing to the eye. And you stay in it. (az-Zukhruf\/43: 71)"
		   },
		   {
			"id": 5607,
			"surah": 76,
			"ayat": 16,
			"tafsir": "In the following verses, Allah also explains the food and drink served to them in various forms, vessels made of silver as well as a number of glasses that are very clear like sparkling glass. The vessels and glasses were very clear as if they were very beautiful and very valuable glass. The hadith narrated by Ibn Abi Hatim from Ibn 'Abbas explains as follows: There is nothing in heaven, but in this world Allah has bestowed upon you something similar to that, except bottles made of silver. (History of Ibn Abi Hatim from Ibn 'Abbas). In another verse it is also stated: They are passed around golden plates and cups, and in heaven there will be whatever the heart desires and all that is pleasing to the eye. And you stay in it. (az-Zukhruf\/43: 71)"
		   },
		   {
			"id": 5608,
			"surah": 76,
			"ayat": 17,
			"tafsir": "Then mentioned the types of drinks that will be served in heaven, namely they are given a glass (drink) mixed with ginger. This means that the inhabitants of heaven will be treated to a drink made from zanjabil, a type of plant that tastes delicious and grows in the Middle East long ago. Usually zanjabil is used for perfume and the Arabs like it. There are also those who say the name of Bait Ma'ruf. According to Ibn 'Abbas, there is no equal to any drink, food, springs, fruits, etc. in paradise mentioned in the Qur'an. The similarity is only in the name, while the taste is much more delicious."
		   },
		   {
			"id": 5609,
			"surah": 76,
			"ayat": 18,
			"tafsir": "In this verse, Allah explains that this drink comes from a heavenly spring called salsabil. They drink a zanjabil mixture that comes from a river called salsabil. This word itself in Arabic means 'delicious drink or food' and also means 'flowing spring'. However, commentator Ibn 'Arabi emphasized, \"I have not heard any words like this salsabil except in the Al-Qur'an alone.\" From the information above, we can only conclude that names such as salsabil, zanjabil, and so on are given information in such a way that has no comparison with any in the world. Regarding heaven, we are convinced that it is something good and full of favors that eyes have never seen, ears have never heard of. Therefore, we cannot be sure whether this is really the intended meaning of the verse above."
		   },
		   {
			"id": 5610,
			"surah": 76,
			"ayat": 19,
			"tafsir": "Then it was continued again that the inhabitants of heaven were surrounded by young heavenly servants forever. The servants come and go around to serve all needs according to the requests of the inhabitants of heaven. They remain young, bright, and radiant and never grow weary or tired of serving the hosts of heaven. So attractive was the maid's face, bright and happy, that those who looked at her saw it like scattered pearls."
		   },
		   {
			"id": 5611,
			"surah": 76,
			"ayat": 20,
			"tafsir": "If the inhabitants of heaven see the conditions in heaven, surely he will see various kinds of pleasures and great kingdoms. If one looks at heaven, according to the narrative of this verse, it is like a great kingdom that is incomparable, so that there are many different tafsirs of the meaning of this great kingdom. The most important thing for us is to have faith and believe in the existence of a heaven that cannot be described."
		   },
		   {
			"id": 5612,
			"surah": 76,
			"ayat": 21,
			"tafsir": "Then in this verse it is also explained that their clothes were made of fine green silk, decorated with bracelets made of silver and gold. God gave them a drink that is clean and tastes delicious. Silk and gold are given special mention here because they were highly prized by humans and considered valuable items and symbols of luxury. In another verse, Allah says: ¦They were decorated with gold bracelets and they wore green clothes made of fine silk and thick silk, while they sat leaning on beautiful couches. (That is) the best reward and a beautiful place to rest. (al-Kahf\/18: 31) Compared to the custom of the kings of this world who wear royal clothes inlaid with gold and diamonds, the pleasures enjoyed in heaven are far more perfect, great, and enjoyable, and eternal in nature. These are some descriptions of the happiness that will be obtained by the abrar group in heaven later."
		   },
		   {
			"id": 5613,
			"surah": 76,
			"ayat": 22,
			"tafsir": "This verse reaffirms that in fact the pleasure bestowed by Allah is a reward for abrar people, because their deeds in this world are grateful for, accepted and pleased by Allah. This is God's gift to them in return for what they have done in the world. In another verse, Allah says: (It is said to them), \"Eat and drink with pleasure because of the deeds you have done in the past days.\" (al-haqqah\/69: 24)"
		   },
		   {
			"id": 5614,
			"surah": 76,
			"ayat": 23,
			"tafsir": "In this verse it is explained that in fact Allah has revealed the Qur'an to the Prophet Muhammad gradually. Al-Qur'an was revealed for more than 22 years gradually little by little. The goal is to make it easy to understand, memorize, and teach friends. Sometimes verses are revealed with the intention of explaining an event that occurred that required guidance from Allah. In this gradual way, the Qur'an became firmly believed in and increased their piety. This verse at the same time refutes the opinion of some people that the Qur'an is magic or a devotional item that can be learned, or as the words of ordinary people."
		   },
		   {
			"id": 5615,
			"surah": 76,
			"ayat": 24,
			"tafsir": "In this verse, Allah advises His Messenger to patiently face the reproaches and hostility of the polytheists, and not follow them. This verse instructs the Prophet Muhammad and the believers to be patient and stand the test in the face of a thousand and one disturbances in upholding Allah's religion. They were ordered to be patient when help has not yet come in dealing with anti-Islam polytheists. Be patient when conveying God's truth in the face of challenges full of danger. Because challenges are a natural thing and being patient with them is a commendable attitude. Then Allah also ordered that Muslims not be carried away by following the way of thinking of people who have been drifting in the sea of sin, or people who have gone too far against religion. One such person is Abu Jahl. When the Prophet Muhammad was ordered to pray for the first time, Abu Jahl tried to prevent the Muslims from carrying out the order. He said, \"If I see Muhammad praying, I will definitely break his neck.\" Another example is 'Utbah bin Rabi'ah (a close friend of Abu Jahl). It was he who persuaded the Prophet to stop preaching. One time he and al-Walid came to see the Prophet while persuading, \"If you intend with da'wah activities to get a beautiful woman or a lot of wealth, stop and I promise to marry you with my own child and I will give it to you without a dowry.\" Meanwhile, al-Walid also called out, \"And I, O Muhammad, will give you as much treasure as possible until you are satisfied, as long as you stop doing this activity.\" Allah reminded the Prophet and his people not to be tempted by the persuasion and seduction, because the value of faith and struggle cannot be exchanged for the wealth of the world. In another sense, this verse forbids a believer, especially if he is the leader of the community, to be tempted by various worldly pleasures offered by people who are full of sin and immorality, with the aim of killing the da'wah movement. But the one who is truly one hundred percent free from persuasion and seduction is only the Prophet Muhammad, because he is guaranteed to be holy and infallible from sin. However, Muslims are encouraged to follow what he exemplified. Do not be too easy to follow the turmoil of lust, in order to be safe from destruction, and meet Allah on the Day of Judgment with a clean white sheet of deeds, free from reproach and disgrace."
		   },
		   {
			"id": 5616,
			"surah": 76,
			"ayat": 25,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to chant the name of God in the morning and evening. It means that Muslims should always remember Allah under any circumstances, wherever and whenever, both with the heart and with the tongue. Some say that the purpose of remembering Allah in the morning and evening is to pray at those times."
		   },
		   {
			"id": 5617,
			"surah": 76,
			"ayat": 26,
			"tafsir": "In this verse, Allah commands the Prophet to prostrate himself, pray at night, and glorify Him during long parts of the night. The command to pray part of the night, namely the Maghrib and Isha prayers, then the Tahajud prayer at night is also mentioned in another verse: And on part of the night, perform the Tahajud prayer (as an additional worship) for you: I hope your Lord will raise you to a place where commendable. (al-Isra'\/17: 79)"
		   },
		   {
			"id": 5618,
			"surah": 76,
			"ayat": 27,
			"tafsir": "In this verse, Allah denounces the attitude of disbelievers who are drunk on worldly pleasures by forgetting the hereafter because they like worldly life and they don't care about the hard day, the hereafter. Indeed, the character of the disbeliever actually loves the world and is afraid of death, forgets about the hereafter and does not believe in it at all. It is said that the Hereafter is a \"tough day\" because of the weight of human accountability before Allah."
		   },
		   {
			"id": 5619,
			"surah": 76,
			"ayat": 28,
			"tafsir": "In this verse, it is as if Allah is rebuking the negligent humans why they forget Allah, even though He is the One who created them, arranges and arranges their bodies so neatly that there is no blemish. After creating them in the best way possible, then Allah just let them do whatever they want? Therefore, Allah shows His absolute power to eliminate and replace them with another generation of humans at any time. In another verse it is stated: And to Allah belongs what is in the heavens and what is in the earth. Sufficient is Allah as a maintainer. (an-Nisa'\/4: 132) Thus the circumcision of Allah has been in effect in this universe for a long time. Allah destroys humans who disobey Him and then immediately replaces them with a new generation. This sunatullah will definitely apply because people who disbelieve in it will continue to appear all the time."
		   },
		   {
			"id": 5620,
			"surah": 76,
			"ayat": 29,
			"tafsir": "In this verse, Allah again reminds that everything mentioned above is a warning (tadhkirah) and teaching (mau'idhah) for those who want to hear it. All the warnings contained in this surahh al-Insan are material for reflection for those who like to study the facts that have happened. Whoever wants good for himself for the life of this world and the hereafter, let him make these verses as a warning. Let him draw closer to Allah by being obedient, following all commands, and staying away from all His prohibitions, so that he will be pleased by Allah, so that he will be safe from all the difficulties of life in the village of the hereafter."
		   },
		   {
			"id": 5621,
			"surah": 76,
			"ayat": 30,
			"tafsir": "In this verse, Allah explains that humans will not achieve salvation except by His will, and if He gives taufik to them. One's efforts alone without God's guidance will not achieve goodness and cannot resist evil. This verse closes with the certainty that Allah is All-Knowing, All-Wise. Allah knows best which of His servants has the right to receive this guidance, so that the way is made easy for him and causes are brought about to obtain that guidance. On the other hand, those who are often involved in acts of following their passions, Allah removes guidance from them. Allah is Wise and Most Just."
		   },
		   {
			"id": 5622,
			"surah": 76,
			"ayat": 31,
			"tafsir": "In this verse, Allah confirms that He includes whoever He wills into His grace, namely heaven. For the wrongdoers a painful punishment is provided. Allah shows the benefits of obedience to that person so that by doing that, he prepares himself to enter Allah's grace in the form of heaven. For those who harm themselves and die in disbelief, Allah has prepared for them the most severe punishment in the hereafter, namely hell."
		   }
	]
}
