{
	"tafseer": [
		{
			"id": 2674,
			"surah": 23,
			"ayat": 1,
			"tafsir": "Belief in Allah and the six pillars of faith. In this verse, Allah explains that the believers are truly happy and lucky, and on the other hand, the disbelievers who do not believe will suffer great losses, because even though according to calculations they do a lot of good deeds, all of their deeds will be in vain. in the hereafter, because it is not based on faith in Him."
		   },
		   {
			"id": 2675,
			"surah": 23,
			"ayat": 2,
			"tafsir": "Deep in prayer. In this verse, Allah explains the second characteristic, that is, a believer who is lucky, if he prays sincerely in his prayers, his mind always remembers Allah, and concentrates all his thoughts and five senses to pray to Him. He realizes and feels that the person who is praying is really facing his Lord, therefore his whole body and soul are filled with solemnity, solemnity and sincerity, filled with fear and filled with hope for his Lord. To be able to fulfill the requirements of solemnity in prayer, one must pay attention to three things, namely: a) Understanding what is read, so that what is spoken by the tongue can be understood and understood, in accordance with the verse: So do they not live the Qur'an or their hearts already locked? (Muhammad\/47: 24) b) Remember Allah, according to His word: And carry out the prayer to remember Me. (thaha\/20: 14) c) Prayer means munajat to Allah, the thoughts and feelings of those who pray must always be remembered and not be careless or negligent. The scholars argue that prayer that is not solemn is the same as a lifeless body. However, the absence of being absorbed in prayer does not invalidate the prayer, and it is not obligatory to repeat it."
		   },
		   {
			"id": 2676,
			"surah": 23,
			"ayat": 3,
			"tafsir": "Abstain from any useless actions or words. In this verse Allah explains the third characteristic, namely that a believer who is happy is one who always takes care of his time and life so that it is not wasted. Just as he is absorbed in his prayers, turning away from everything except God the creator, so he also turns away from all words that are of no use to himself or to others."
		   },
		   {
			"id": 2677,
			"surah": 23,
			"ayat": 4,
			"tafsir": "Pay the obligatory zakat and the recommended charity. In this verse, Allah explains that the fourth characteristic of the lucky believers is that they like to give zakat and give alms that are recommended, which they see as an attempt to cleanse their wealth and self from miserliness, greed, self-centeredness (selfishness). , and also to relieve the suffering of God's servants in need, according to His word: How fortunate is he who purifies it (the soul). (asy-Shams\/91: 9)"
		   },
		   {
			"id": 2678,
			"surah": 23,
			"ayat": 5,
			"tafsir": "Protecting the genitals from heinous acts. In this verse, Allah explains the fifth characteristic of a believer who is happy, namely that he likes to protect his genitals from every heinous act such as adultery, doing the deeds of Lut's people (homosexuals), masturbation, and so on. Intercourse that is permitted by religion is only with wives who are legally married or with their jariah (slave women) obtained from jihad fisabilillah, because in this case they are not reprehensible. However, whoever does beyond that, they are the ones who transgress. In this verse and in the previous verse, Allah explains that the happiness of a servant of Allah depends on protecting his genitals from various abuses so that they are not included in those who are disgraceful and transgress. Resisting the invitation of lust, far lighter than bearing the consequences of adultery. Allah has commanded His Prophet to deliver this order to his people, so that they restrain their eyes and guard their private parts with the words: Say to men who believe, so that they guard their eyes and guard their private parts; that is purer for them. Indeed, Allah is All-Knowing of what they do. (an-Nur\/24: 30)"
		   },
		   {
			"id": 2679,
			"surah": 23,
			"ayat": 6,
			"tafsir": "Protecting the genitals from heinous acts. In this verse, Allah explains the fifth characteristic of a believer who is happy, namely that he likes to protect his genitals from every heinous act such as adultery, doing the deeds of Lut's people (homosexuals), masturbation, and so on. Intercourse that is permitted by religion is only with wives who are legally married or with their jariah (slave women) obtained from jihad fisabilillah, because in this case they are not reprehensible. However, whoever does beyond that, they are the ones who transgress. In this verse and in the previous verse, Allah explains that the happiness of a servant of Allah depends on protecting his genitals from various abuses so that they are not included in those who are disgraceful and transgress. Resisting the invitation of lust, far lighter than bearing the consequences of adultery. Allah has commanded His Prophet to deliver this order to his people, so that they restrain their eyes and guard their private parts with the words: Say to men who believe, so that they guard their eyes and guard their private parts; that is purer for them. Indeed, Allah is All-Knowing of what they do. (an-Nur\/24: 30)"
		   },
		   {
			"id": 2680,
			"surah": 23,
			"ayat": 7,
			"tafsir": "Protecting the genitals from heinous acts. In this verse, Allah explains the fifth characteristic of a believer who is happy, namely that he likes to protect his genitals from every heinous act such as adultery, doing the deeds of Lut's people (homosexuals), masturbation, and so on. Intercourse that is permitted by religion is only with wives who are legally married or with their jariah (slave women) obtained from jihad fisabilillah, because in this case they are not reprehensible. However, whoever does beyond that, they are the ones who transgress. In this verse and in the previous verse, Allah explains that the happiness of a servant of Allah depends on protecting his genitals from various abuses so that they are not included in those who are disgraceful and transgress. Resisting the invitation of lust, far lighter than bearing the consequences of adultery. Allah has commanded His Prophet to deliver this order to his people, so that they restrain their eyes and guard their private parts with the words: Say to men who believe, so that they guard their eyes and guard their private parts; that is purer for them. Indeed, Allah is All-Knowing of what they do. (an-Nur\/24: 30)"
		   },
		   {
			"id": 2681,
			"surah": 23,
			"ayat": 8,
			"tafsir": "Maintaining the mandates he bears and keeping his promises. In this verse, Allah explains the sixth characteristic of the lucky believers, that is, they like to maintain the mandates they carry, either from Allah or from fellow human beings, that is, if goods or money are entrusted to them as a mandate that must be conveyed to other people, then they truly deliver the mandate as it should, and not commit treason. Likewise, when they make an agreement, they fulfill it perfectly. They distance themselves from such hypocrisy in a well-known hadith, which states that there are three signs of a hypocrite, namely when he speaks he likes to lie, when he promises something he breaks his promise and when he is given a mandate he likes to betray."
		   },
		   {
			"id": 2682,
			"surah": 23,
			"ayat": 9,
			"tafsir": "Maintaining the five daily prayers. In this verse, Allah explains the seventh characteristic, that is, the happy believer always maintains and pays attention to the five daily prayers perfectly, on time, and fulfills the requirements and pillars. This verse is not the same as the second verse above, because it says there that they are solemn in their prayers, while it is stated here that they always pray in an orderly and regular manner. This group of verses begins by mentioning prayer and ends by mentioning prayer, this gives a warning about the importance of prayer which has become the pillar of religion. The Messenger of Allah once said, \"Whoever establishes prayer has really founded a religion and whoever leaves prayer, he has really torn down religion.\" The following is an explanation of the hadith regarding the virtue of prayer: From Abdullah bin Mas'ud said, I asked the Messenger of Allah, what practice is the most beloved to Allah, the Prophet replied, pray on time, then what? The Prophet replied, birrul walidain (do good to both parents). Then what else? The Prophet said, jihad in the way of Allah. (History of ash-Syaikhan) It is also mentioned in a hadith of the Prophet saw: From Sauban, the Prophet said, \"Be steady and do not count. Know that your best deed is to pray, and no one keeps prayer except those who believe. (History of Ahmad, al-hakim and al-Baihaqi)"
		   },
		   {
			"id": 2683,
			"surah": 23,
			"ayat": 10,
			"tafsir": "Maintaining the five daily prayers. In this verse, Allah explains the seventh characteristic, that is, the happy believer always maintains and pays attention to the five daily prayers perfectly, on time, and fulfills the requirements and pillars. This verse is not the same as the second verse above, because it says there that they are solemn in their prayers, while it is stated here that they always pray in an orderly and regular manner. This group of verses begins by mentioning prayer and ends by mentioning prayer, this gives a warning about the importance of prayer which has become the pillar of religion. The Messenger of Allah once said, \"Whoever establishes prayer has really founded a religion and whoever leaves prayer, he has really torn down religion.\" The following is an explanation of the hadith regarding the virtue of prayer: From Abdullah bin Mas'ud said, I asked the Messenger of Allah, what practice is the most beloved to Allah, the Prophet replied, pray on time, then what? The Prophet replied, birrul walidain (do good to both parents). Then what else? The Prophet said, jihad in the way of Allah. (History of ash-Syaikhan) It is also mentioned in a hadith of the Prophet saw: From Sauban, the Prophet said, \"Be steady and do not count. Know that your best deed is to pray, and no one keeps prayer except those who believe. (History of Ahmad, al-hakim and al-Baihaqi)"
		   },
		   {
			"id": 2684,
			"surah": 23,
			"ayat": 11,
			"tafsir": "Those who have the seven noble qualities will inherit heaven, due to their good deeds while living in the world, namely the highest Paradise heaven, above which is the Throne of Allah, the Most Gracious, and they will abide therein forever. Umar narrated a hadith, in which the Messenger of Allah said: From Umar bin al-Khattab, the Messenger of Allah said, \"Ten verses have been revealed to me: Whoever upholds them will enter heaven, then he recites these ten verses from the beginning of surahh al-Mu'minun. (History of at-Tirmidhi)"
		   },
		   {
			"id": 2685,
			"surah": 23,
			"ayat": 12,
			"tafsir": "Verily, We (Allah) have created man from an essence (derived) from the ground. There is a group of commentators who say that what is meant by humans here is the descendants of Adam, including all of us, who came from semen. From the results of scientific research, actually the semen comes from the ground after going through several developmental processes. The food which is the product of the earth, which is eaten by man, and his digestive organs turn into a liquid mixed with blood which distributes the living substances and vitamins needed by the human body to all its members. If a human dies and is put in a grave in the ground, then his body will be destroyed and return to the ground again, according to the word of Allah: From it (soil) We created you and to it We will return you, and from there We will take you out at another time. (thaha\/20:55)"
		   },
		   {
			"id": 2686,
			"surah": 23,
			"ayat": 13,
			"tafsir": "Then We (Allah) place the essence of the semen in the rib of the husband who during intercourse with his wife is shed into his womb, a solid storage place for the fetus until the time of its birth."
		   },
		   {
			"id": 2687,
			"surah": 23,
			"ayat": 14,
			"tafsir": "Then We (Allah) developed the semen within a few weeks so that it became al-'alaq (which sticks to the uterine wall), from al-'alaq a lump of flesh was made, and a lump of flesh was made into bones, and some parts were made into meat, then the bones are covered with flesh, like clothes covering the body, then they are made into creatures that are (in) another form, after the Spirit breathes into them, so that they become perfect human beings, able to speak, see, hear, think, which were only inanimate objects. So Glory be to Allah, the Best Creator. According to scientists, the stages in human embryology are as follows: ¢Nutfah, or in Arabic 'nutfa, means' a little water, or 'a drop of water. This clearly describes the little water that is emitted by men during intercourse. This little water contains sperm. Sperm or spermatozoa are found in disgusting water and are in the form of long-tailed fish (this is one of the meanings of the word sulalah. In surahh As-Sajdah\/32 verse 8, semen is referred to as \"..... He made his offspring from the essence of water who are underestimated....\" surahh al-Insan\/76 verse 2 and as-Sajdh\/32 verse 8 deals with the content of semen. Modern science has found that semen consists of four different types of mucus produced by four different glands. different, namely the testicular glands, seminal duct glands, prostate gland, and urinary glands. ¢Sperm is formed inside the testicles. The testicles themselves are formed, as science has proven, by cells that are under the buds of the kidneys, in the back of the embryo. This group of cells then descends below the ribs, at a time a few weeks before the birth of the baby. It is estimated that the number of sperm in one ejaculation is 500 \" 600 million heads. However, from of these, only one can perform fertilization. After fertilization, there is a rapid change of the ovaries. It immediately produces a membrane that prevents other sperm from participating in fertilization. ¢After the egg is fertilized, and attaches itself to the uterine wall and obtains food from its mother, it will grow rapidly. Within two to three weeks later, when seen with the naked eye, it will change from the formation of 'leeches or 'alaqah to the formation of 'mudhgah' or 'chewed flesh'. This last pattern is actually formed by the presence of protrusions and indentations, which in time will become internal organs (heart, intestines) and outside (feet, hands). surahh al-hajj\/22: 5 adds one note from the embryo. In this verse, mudghah is described with the addition \"perfect in occurrence and imperfect in occurrence .....\" This describes what happens at the stage of 'differentiation', where many organs begin to develop at unequal times. So that it creates a situation between completion in other parts but not perfect in other parts. ¢The last two stages mentioned in surahh al-Muminun\/23: 14 tell about 'the formation of bones after the mudgah stage. In the end, the story ends by giving him \"clothes\", consisting of flesh and sinews. If we follow the growth of the embryo, then approximately at the age of four weeks a process of 'differentiation begins. In this process the groups of cells in the embryo will change shape and begin to form large organs. One of the first to develop is the skull bone. This process will be followed later by the formation of prospective muscles, ears, eyes, kidneys, heart and many more. Imam Ahmad narrated a hadith from Abdullah bin Masud, that the Messenger of Allah said: \"Verily, one of you collects his creation in his mother's stomach for forty days, then becomes an 'alaqah like that, then becomes a mudhgah (lump of flesh) like that. Then an angel is sent to him , then he blows the soul on him. And he was ordered to four sentences, sustenance, his death, his deeds, and whether he is a wretched person or happy. For the sake of One Who has no god but Him, surely someone among you does the deeds of the inhabitants of heaven, so that between him and heaven there is only one cubit left. But he has been recorded as a resident of hell, so he ends his deeds with the deeds of the people of hell, so he enters hell. only one cubit, but he has been recorded as a resident of heaven, so he ends his charity with ama and the inhabitants of heaven, until he enters heaven.\" (Ahmad's history) Anas bin Malik narrated that Umar bin Khattab said: My wish is in accordance with Allah's will in four cases. First: I proposed to Rasulullah saw that behind Maqam Ibrahim be made a place of prayer, the word of Allah descended: And make Maqam Ibrahim a place of prayer. (al-Baqarah\/2: 125) Second: I propose to Rasulullah SAW that his wives put up a veil (hijab) when male guests arrive, who are sometimes not all pious, then Allah's word descends: If you ask for something ( necessity) to them (the wives of the Prophet), then ask from behind the curtain. (al-Ahzab\/33: 53) Third: I told the Prophet's wives to stop causing trouble for him, because maybe Allah will replace them with better wives, then the word of Allah came down: If he (the Prophet) divorces you, maybe God will replace him with wives who are better than you. (at-Tahrim\/66: 5) Fourth: After verses 12, 13 and 14 of surahh al-Mu'minun were revealed, I said fatabarakallahu aá¸¥sanul Khaliqin, and Rasulullah saw said, \"That is according to what He sent down .\""
		   },
		   {
			"id": 2688,
			"surah": 23,
			"ayat": 15,
			"tafsir": "Then after your first creation, all of you will surely meet your appointed death. Allah says: Every soul shall taste death. We will test you with bad and good as a trial. And you will be returned only to Us. (al-Anbiya'\/21: 35)"
		   },
		   {
			"id": 2689,
			"surah": 23,
			"ayat": 16,
			"tafsir": "Then in fact all of you will be resurrected from your graves on the Day of Judgment, to be accounted for for all your deeds while in this world, the good will be rewarded, the bad will be punished."
		   },
		   {
			"id": 2690,
			"surah": 23,
			"ayat": 17,
			"tafsir": "This verse explains that Allah has created seven layers of heaven above mankind, some of which are above others which are the orbits of the stars, which have been known to people since ancient times, and several other stars have been discovered by astronomers at this time. Allah is by no means oblivious to all of this creation, both to the circulations and to the others, because the circulation of all the planets in outer space follows certain rules. If Allah had been negligent about it, the planets would have collided with each other, resulting in an unpredictable disaster. Indeed it will happen, but the time will come on the Day of Judgment, where everything has been planned in Lauh Mahfuz."
		   },
		   {
			"id": 2691,
			"surah": 23,
			"ayat": 18,
			"tafsir": "Then Allah sends down from the sky rainwater with the required level, not too heavy so that it causes flooding and not too little so that it is enough to irrigate the gardens that need it. There are also lands that need a lot of water, but cannot stand heavy rains, so the water needed is brought in from other countries through large rivers such as the Nile in Egypt which originates in the middle of the African continent. In addition to bringing the necessary water, also bringing mud which is very useful to increase fertility. Water can be stored as rivers, lakes and even partially stored in the earth as shallow groundwater or deep groundwater or often referred to as groundwater. Part of this water was made by God to settle in the earth to fill the wells and ditches that function in the field of irrigation, and because the water in the earth also comes into contact with layers of metal and other chemical substances, the water contains chemical elements which increase soil fertility, and when passing on the slopes of volcanoes can also become hot springs containing sulfur, and can be used as hot springs which are very useful for curing skin diseases and so on. All sources of water use, if utilized with gratitude for the presence of Allah, will undoubtedly be enjoyed, but if humans are greedy and damage it, then indeed Allah has the power to eliminate it, especially if those places are used for immoral acts."
		   },
		   {
			"id": 2692,
			"surah": 23,
			"ayat": 19,
			"tafsir": "Then, because of the rain, Allah caused people to grow gardens of dates and grapes and other edible fruits of various colors. There are also those plants that are a source of livelihood, such as those from pepper, nutmeg, cloves and so on. Also made for humans a type of wood that comes out of Mount Sinai, namely the olive tree that grows around the mountain, which produces a lot of oil and is often used to taste dishes and lately can also be used as cosmetic and medicinal ingredients because oil Olives do not contain cholesterol which is harmful to the body."
		   },
		   {
			"id": 2693,
			"surah": 23,
			"ayat": 20,
			"tafsir": "Then, because of the rain, Allah caused people to grow gardens of dates and grapes and other edible fruits of various colors. There are also those plants that are a source of livelihood, such as those from pepper, nutmeg, cloves and so on. Also made for humans a type of wood that comes out of Mount Sinai, namely the olive tree that grows around the mountain, which produces a lot of oil and is often used to taste dishes and lately can also be used as cosmetic and medicinal ingredients because oil Olives do not contain cholesterol which is harmful to the body."
		   },
		   {
			"id": 2694,
			"surah": 23,
			"ayat": 21,
			"tafsir": "In fact, in the creation of livestock there is a very important lesson for humans besides its great benefits as a gift from God. Livestock can be a source of learning and research material, for example how can a cow whose main food, after being chewed and entered into its stomach, its essence then mixes with blood can produce milk which is very beneficial for the body. Then from his stomach, Allah has the power to separate the milk from the mixture of the two dirty things, namely the blood and the dung of the cow that is in his stomach, as mentioned in Allah's word: And indeed, in these livestock there is indeed a lesson for you. We give you to drink from what is in his stomach (in the form of) pure milk between dirt and blood, which is easily swallowed for those who drink it (an-Nahl \/ 16: 66) Then Allah describes in another verse the happiness that the owner of the cow feels when releasing the cow- the cows go to pasture in the morning. He also felt the same happiness when the cattle returned to their pens in the afternoon. Allah's Word: And you find beauty in it, when you bring it back to the fold and when you release it (to the place of grazing). (an-Nahl\/16: 6) If detailed, there are many benefits that humans get from livestock: 1. Milk which is very delicious to drink and contains various elements that the body needs to stay healthy, can also be used as butter, cheese, and others. 2. Feathers or hair can be used as clothing and blankets which are very useful especially in winter. 3. The meat can be eaten immediately or preserved in cans. 4. Make a vehicle, especially to go to a place that is far away which is difficult to reach by other vehicles as mentioned in verse 21. And he carries your burdens to a land that you are not able to reach, except with great difficulty. (an-Nahl\/16: 7)"
		   },
		   {
			"id": 2695,
			"surah": 23,
			"ayat": 22,
			"tafsir": "On the backs of these livestock, especially camels, can be used as a means of transporting people or goods to very far places through the desert which are difficult for other vehicles to pass through, besides being able to use ships as vehicles at sea. And (He has created) horses, mules and donkeys, for you to ride and (to be) ornaments. Allah creates what you do not know. (an-Nahl\/16: 8)"
		   },
		   {
			"id": 2696,
			"surah": 23,
			"ayat": 23,
			"tafsir": "This verse explains that Allah sent Noah to his people to warn them about Allah's punishment, if they commit polytheism against Him and belie His Messenger, saying softly to them, \"O my people, worship Allah, the One, do not associate partners with Him, for there is no god for you but Him. So why do you not fear His punishment, and distance yourself from associating with Him?\""
		   },
		   {
			"id": 2697,
			"surah": 23,
			"ayat": 24,
			"tafsir": "Prophet Noah's gentle call was answered by the ridicule of his people, that Noah was nothing but an ordinary human being like them, did not have any advantages, both physical and mental so that he deserved to be a messenger of God and receive revelations. Noah was accused of only wanting to be someone who has a higher position than them, and wanted to be more powerful. To achieve this goal, he claims to be a messenger of God, when in fact he does not deserve it. Then they mentioned two reasons for not recognizing Noah as God's messenger. First, if Allah wanted to send an apostle who ordered the worship of Allah alone, He would have sent several angels, and not an ordinary human being. Second, they had never heard from their own ancestors what Noah put forward, about worshiping only Allah, the One God. The appeal to monotheism was not in the traditions of their ancestors, so they strongly opposed the preaching of Noah. This shows that they have been dragged into blind obedience and misguidance."
		   },
		   {
			"id": 2698,
			"surah": 23,
			"ayat": 25,
			"tafsir": "This verse explains the attitude of unbelievers due to their views that underestimate Noah's position as an apostle. They said that Noah was nothing but a man with a crooked mind, who spoke as he pleased, and what he said had no reason at all, so it didn't need to be served. Therefore, they asked their people to be patient until Noah at some point came to his senses and returned to his normal state and reverted to the religion of their ancestors. Their words showed their denial, even though they knew that Noah was the smartest person among them. Listening to the words of Prophet Noah's people, who rejected his position as an apostle, it can be said that each apostle should have advantages over his people in terms of morals and miracles. An apostle must have a higher position because then all his instructions will be followed. Besides that, an apostle must be authoritative, so that with his authority he can lead his people to the right path, and the apostle is infallible, namely protected from all sins including pride. Their words that the call to monotheism they have never received from their ancestors before. Even though their words were not enough to be used as a reason to reject Noah's treatise. Their accusation that Noah suffered from memory problems, contradicts the reality that they saw and experienced themselves."
		   },
		   {
			"id": 2699,
			"surah": 23,
			"ayat": 26,
			"tafsir": "After Noah saw the disbelief of his people who did not want to realize their error, even though Noah had carried out his missionary obligations for a long time, Allah revealed to him that his people would never believe. His followers, namely those who have believed, will not increase in number. Noah then prayed to God for help, while praying, \"O my Lord, help me, because they have denied me.\" Noah's prayer is mentioned in the word of God: So he (Noah) complained to his Lord, \"Verily I have been defeated, so help (me).\" (al-Qamar\/54: 10) And as in His word: And Noah said, \"O my Lord, do not let anyone among the disbelievers live on earth. (Nuh\/71: 26)"
		   },
		   {
			"id": 2700,
			"surah": 23,
			"ayat": 27,
			"tafsir": "After Noah's prayer was allowed, God revealed it to him, so that he would start making boats under the supervision and guidance of His revelation, so that the boat would be sturdy and not easily damaged and so that Noah would know the manufacturing technique, for making a big and strong boat. Of course it requires expertise. When Allah's order came to destroy his people with a big typhoon, and the signs had appeared, namely the furnace where the bread was baked underground had started emitting water, then Allah told Prophet Noah to put into the boat a male and a female pair from each every kind of animal. The boat is made up of levels. The lowest level is for beasts like lions, tigers, and so on. At the second level livestock such as: cows, goats, and so on. On the third level all kinds of birds are in pairs and on the top level once Prophet Noah and all his family survived, including his three sons: Sam, Ham and Jafis. As for his son named Kanan, he was among those who drowned because he did not want to go with his father. By including every kind of animal that existed at that time, Noah's ark was a complete zoo. All the animals that did not get into the boat and the disbelievers who did not follow Noah's invitation were drowned in the big typhoon, according to God's threat that they would be doomed. God previously forbade Noah not to tell God's plan and the purpose of building the boat to the unjust people, because they would all be drowned."
		   },
		   {
			"id": 2701,
			"surah": 23,
			"ayat": 28,
			"tafsir": "Allah ordered Noah, if he was with the believers already in the boat, then he must praise Allah as a gratitude for the safety of all of them who were in the boat, \"Praise be to Allah who has saved us from the - an unjust person.\" This verse gives an indication that we should not be happy with the punishment of other people or groups, unless it contains safety for the believers, avoiding them from the danger of destruction, and wiping out the world from all forms of polytheism and disobedience. According to the testimony of Ibn 'Abbas ra, that besides all the animals that were in Noah's boat, there were 80 people, namely Noah and his three sons and his wives and 72 believers of Noah's followers who were loyal to him."
		   },
		   {
			"id": 2702,
			"surah": 23,
			"ayat": 29,
			"tafsir": "Noah was also told to pray, \"O my Lord, put me down, when the typhoon is over, to a blessed place and only You can give the best place, who knows the places that are suitable and suitable for us.\" Qatadah said, Allah taught us to read this prayer when boarding the ship: And he said, \"All of you get into it (the ship) by (mentioning) the name of Allah when sailing and anchoring it. (Hud\/11: 41) And when it is on the vehicle read: Glory be to (Allah) who has subjected all this to us when we were not previously able to master it, and verily we will return to our Lord.\" (az-Zukhruf\/43: 13-14)"
		   },
		   {
			"id": 2703,
			"surah": 23,
			"ayat": 30,
			"tafsir": "In fact, in the event of the big typhoon that destroyed Noah's people who belied His Messenger, by denying the oneness of Allah and worshiping idols, there is a lesson for the Quraysh who denied Muhammad's apostleship, that the incident that befell Noah's people could also befall the Quraysh who dared belied the Messenger of Allah and enmity him. In that incident, there really were several very great punishments for Noah's people, so that those who came later would take lessons from them, according to the word of Allah: And indeed, We have made this ship a sign (lesson). Then is there anyone willing to take lessons? (al-Qamar\/54: 15)"
		   },
		   {
			"id": 2704,
			"surah": 23,
			"ayat": 31,
			"tafsir": "This verse explains that Allah created other people after Noah's people, namely 'Ad, the people of Prophet Hud, the Samud people, the people of Prophet Saleh, and the Madyan people, namely the people of Prophet Shuaib. Of these three people, the strongest opinion that is in accordance with this verse is the 'Ad people because in the history of the prophets after Prophet Noah who was sent later was Prophet Hud. So, what is meant by qarnan akharin are the people of 'Ad, samud and Madyan."
		   },
		   {
			"id": 2705,
			"surah": 23,
			"ayat": 32,
			"tafsir": "This verse explains that Allah sent to the 'Ad people an apostle from among themselves, namely Prophet Hud who carried out da'wah to them while calling out, \"O my people, worship Allah and leave all your idols, because there is truly no God who has the right to be worshiped but Him. Why do you not fear Him?\""
		   },
		   {
			"id": 2706,
			"surah": 23,
			"ayat": 33,
			"tafsir": "The leaders of their people who disbelieve deny monotheism in Allah, and the existence of resurrection and reckoning on the Day of Judgment because they love too much the luxuries of life in this world. They answered Prophet Hud's call by saying, \"This person (Hud) is nothing but an ordinary human being like you, has no advantages, eats and drinks normally like us. Therefore his call should not be ignored at all.\""
		   },
		   {
			"id": 2707,
			"surah": 23,
			"ayat": 34,
			"tafsir": "The leader of the disbelievers continued his words, \"If you all obey ordinary humans like you, and just follow Hud's call without prior research, surely you will become a human being who loses and is deceived.\" They don't want the apostle to be just an ordinary human. They want the apostle to be from an angel so that it looks great and extraordinary. Yet if the apostles were angels they would not be able to follow them, because the character of angels is not the same as that of humans. It is impossible for humans to follow the way of worship and the way of life of angels who have no passions so that their lives are always and only for worship. Meanwhile, humans are weak, have lust and are easily tempted by demons and devils."
		   },
		   {
			"id": 2708,
			"surah": 23,
			"ayat": 35,
			"tafsir": "Then they added the reasons for their disbelief to the apostle sent by Allah, namely Prophet Hud by saying how could Prophet Hud promise his followers that if a human being dies, and his body has been destroyed in the grave and only bones remain, he will be resurrected again in one piece. from his grave to be brought to account on the Day of Judgment. They don't believe it because they only follow their shallow thoughts, even though in surahh Yasin Allah has said: Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 79) )"
		   },
		   {
			"id": 2709,
			"surah": 23,
			"ayat": 36,
			"tafsir": "This verse explains that what Prophet Hud said about the resurrection, according to them, is impossible. They do not want to move from their simple minds to see the fact that there is God's power beyond human power. Allah has created the universe and all human beings."
		   },
		   {
			"id": 2710,
			"surah": 23,
			"ayat": 37,
			"tafsir": "Then they emphasized their denial by saying, \"The real life is only the life of this world. Some of us live and then die, followed by others successively, generation after generation, just like plants, there are those who cultivate crops. and there is a harvest there. None of us will be resurrected after we die.\" Disbelievers only view human life as that of plants and animals which from time to time only experience a change of generations, and there is no development of thought and culture, and no responsibility in their daily actions."
		   },
		   {
			"id": 2711,
			"surah": 23,
			"ayat": 38,
			"tafsir": "They not only denied the resurrection after death, but also accused Hud of lying to Allah. They said, \"That man has indeed perpetrated a lie against Allah and we will never believe in him.\""
		   },
		   {
			"id": 2712,
			"surah": 23,
			"ayat": 39,
			"tafsir": "When Hud heard the words of his people, that they would not believe in him at all, he prayed to Allah, \"O my Lord, help me because they deny me, even though I have made every effort to guide them, but they have closed all doors of guidance, so that I feel hopeless from their faith.\""
		   },
		   {
			"id": 2713,
			"surah": 23,
			"ayat": 40,
			"tafsir": "Allah said, \"Wait, soon those who belied you will all become regretful people. My punishment will befall them and at that time all regrets will be useless.\""
		   },
		   {
			"id": 2714,
			"surah": 23,
			"ayat": 41,
			"tafsir": "So they were annihilated with an incomparable doom, which was destroyed by water and a thunderous sound. They were used as garbage from the great flood which was of no use at all, so those who were unjust were to perish."
		   },
		   {
			"id": 2715,
			"surah": 23,
			"ayat": 42,
			"tafsir": "After the destruction of the 'Ad people, in this verse it is explained about the Samud people, the people of Madyan and Aikah, and the land of Sodom. Allah sent Nabi Saleh to the Samud people, but the Samud people refused, even killing Prophet Saleh's camel which was their miracle. As for the people of Madyan and Aikah, Allah sent the Prophet Shuaib. They are also rebellious and reject the Prophet Shuaib, and they like to reduce the scales. The people of Sodom also denied the Prophet Lut and many were homosexuals."
		   },
		   {
			"id": 2716,
			"surah": 23,
			"ayat": 43,
			"tafsir": "In this verse Allah confirms that no single people can hasten their death or destruction, nor can they delay it. All of this applies in accordance with the provisions of Allah Almighty, who regulates this nature and everything in it in an orderly, orderly and smooth manner. Therefore, those people who have perished cannot precede their predetermined death nor can they postpone or postpone it, because each community has a prior decision in the Lawh Mahfuz, how long they will experience life in the world."
		   },
		   {
			"id": 2717,
			"surah": 23,
			"ayat": 44,
			"tafsir": "Then Allah sent to these people His messengers successively at different times. In each period there is a messenger of Allah whose function is to convey His message. Thus they came one after another until they came to the seal of the prophet, namely the Prophet Muhammad, every time an apostle was sent to his people, the people belied him. Because each of these people belied His messenger, Allah destroyed them successively and Allah made their story the fruit of human speech that came later. Their stories are often mentioned, both in their daily conversations and in history lessons of people who have denied His prophets."
		   },
		   {
			"id": 2718,
			"surah": 23,
			"ayat": 45,
			"tafsir": "Allah sent Musa and his brother Harun (as his assistant) to Pharaoh and his people by bringing nine kinds of miracles as mentioned in surahh al-A'raf and a clear proof of his apostleship, so that they only worship Allah and leave polytheism to Him, and so that they would not torture the Children of Israel who were in Egypt, and allow them to be brought back by Moses and Aaron back to the land of the Prophet Jacob in Palestine. Musa and Harun came to Pharaoh with a gentle call as in His word: So speak to him (Pharaoh) in gentle words, hopefully he is aware or afraid. (thaha\/20: 44)"
		   },
		   {
			"id": 2719,
			"surah": 23,
			"ayat": 46,
			"tafsir": "Musa and Harun came to Pharaoh and the dignitaries of his people accompanied by strong reasons and proofs, but they were not aware of it, they even behaved arrogantly as was their custom."
		   },
		   {
			"id": 2720,
			"surah": 23,
			"ayat": 47,
			"tafsir": "They said, \"Do we deserve to believe in two human beings like us too? Should we submit to them, even though they are a class of servants and helpers who submit to us as masters and masters?\" They equate the mission of conveying the task of the message from Allah which is based on sincerity, trust and honesty, as a worldly position which originates from rank and wealth. Their views were also held by the unbelievers of Quraysh, as explained in this verse: And they (also) said, \"Why was this Qur'an not revealed to the great (rich and influential) people from one of these two countries (Mecca and Taif)?\" (az-Zukhruf\/43: 31) They denied the revelations and prophethood of Muhammad, because according to their way of thinking, the person who was appointed as an apostle should be someone who was rich and influential. They do not know that God's choice for apostolate is not based on wealth or rank, but solely on God's grace, which has been established in nature, and its relation to nobility of character, holiness and honesty and affection for his people. The prophets because of their inner purity were not affected by the material world. They receive revelations by means of angels, and serve all the interests of their people. They stay in touch with their God. If the disbelievers feel strange and question why Allah sent His messengers from among humans themselves, it is even more strange and miraculous if they are asked why they made wood and stone, which were made and carved by their own hands, as God. It is true what is said in the verse: Actually it is not the eyes that are blind, but what is blind is the heart that is in the breast. (al-hajj\/22: 46)"
		   },
		   {
			"id": 2721,
			"surah": 23,
			"ayat": 48,
			"tafsir": "Pharaoh and the princes of his people still denied Musa and Harun. Thus, they are among those who were destroyed by being drowned in the Red Sea."
		   },
		   {
			"id": 2722,
			"surah": 23,
			"ayat": 49,
			"tafsir": "Then after the enemies of Musa and Harun were drowned (annihilated), Allah explained His gift bestowed on His messengers, that He had sent down the Al-Kitab (Torah) to Moses, which contains the Shari'a laws, some commandments and prohibitions, with the hope that the Children of Israel will be guided to the path that will lead to happiness in the world and the hereafter."
		   },
		   {
			"id": 2723,
			"surah": 23,
			"ayat": 50,
			"tafsir": "This verse explains that Allah has made Jesus the son of Maryam as a sign of Allah's power who can create a human being only from a mother without a father, and gives the ability to a baby to speak before its time, and gives miracles to him, can heal people blind from birth, revive people who have died from their graves, make birds out of clay that can fly, and so on. Isa's birth from a mother, namely Maryam, was used as proof of God's power, because she was pregnant without being touched by humans. Maryam and her son became a sign of Allah's power for all mankind as in His words: And (remember the story of Maryam) who kept her honor, then We breathed (spirit) from Us into her (body); We made him and his son a sign (of Allah's greatness) for the whole world. (al-Anbiya'\/21: 91) Allah explained that Jesus and his mother were given a place to live and protected on a high plateau in the Palestinian area which had meadows and clear flowing water sources. The Prophet Isa and Maryam never left Palestine or Syria during their lifetime. Some say that the Prophet Isa went to Rabwah near Lahore in Pakistan and died there, but this opinion has no basis at all."
		   },
		   {
			"id": 2724,
			"surah": 23,
			"ayat": 51,
			"tafsir": "Allah ordered the prophets to eat lawful and good sustenance that Allah bestowed on them and never to eat unclean wealth, always do good deeds, and stay away from evil and evil deeds. The prophets were the first to obey Allah's commandments, because they would be role models for the people where they were sent to deliver the message of their Lord. Even though this command was only shown to the prophets, it also applies to their people without exception, because the prophets were role models for their people except in certain matters specifically for the prophets, because it would not be appropriate if they were also obliged to their people. Abu Hurairah narrated that the Messenger of Allah said: O people, indeed Allah Ta'ala is good, He does not accept anything but good. Indeed, Allah Ta'ala commands those who believe what He commands His Messengers. So the Messenger of Allah read this verse (ya ayyuhar-rusulu kulu minath-thayyibati wa'malu saliha inni bima ta'malu 'alim, \"O apostles! Eat from (food) that is good, and do good deeds. Indeed, I am Great Know what you are doing.). Then the Messenger of Allah read again the verse ya ayyuhalladzina amanu kulu min thayyibati ma razaqnakum¦Then the Prophet explained the condition of someone who had traveled long (long), his hair was messy and full of dust, and his food was from unclean, his drink is from that which is unlawful and his clothes are from that which is unlawful too. The man said while raising his hands to the sky, \"O my Lord! Oh, my God! How is it possible that his prayer will be answered?\" (History of Muslim and at-Tirmidhi) In this verse Allah prioritizes the commandment to eat halal and good food and then do good deeds. This means that good deeds will not be accepted by Allah unless the person doing them eats treasures that are lawful and good and stay away from treasures that are unlawful. According to a history received from the Prophet, he once said: Verily, Allah does not accept the worship of a person in whose stomach there is a mouthful of unclean food. And it is also authentically narrated that the Prophet said, \"Every meat that grows from unclean food, then hell has more right to burn it.\" (History of Muslim and at-Tirmizi) to the Prophet when he was about to break his fast. The milk was refused by the Prophet and he ordered the milk carrier it came back and asked him where he got the milk from. Ummi Abdillah replied, \"That's milk from my own goat.\" Then the milk was rejected again and Ummi Abdillah's messenger was again ordered to ask where the goat was obtained. Ummi Abdillah replied, 'I bought the goat with my own money.\" Then the Prophet accepted the milk. The next day Ummi Abdillah came to the Prophet and asked, \"O Messenger of Allah, why do you always refuse the milk?\" Rasulullah replied, \"The apostles were ordered so that you do not eat except what is good and do not do anything except what is good too.\" (History of Ibn Abi Hatim and Ibn Mardawaih) Such is Allah's command to His Messengers which must be obeyed by mankind because Allah is All-Knowing of human deeds , nothing is hidden from Him."
		   },
		   {
			"id": 2725,
			"surah": 23,
			"ayat": 52,
			"tafsir": "In this verse Allah explains that the religion of the apostles is one religion, namely the religion of monotheism which worships the One God and has no partner for Him. Not a single apostle deviated from this principle. If in a religion there is even the slightest deviation from this principle, then that religion is not the religion brought by an apostle, meaning that religion has been changed by its followers and is no longer original. It is impossible for God Almighty to choose and appoint an apostle by bringing a religion that is contrary to the truth and purity of His oneness. Although the Shari'a and regulations brought by the prophets and messengers varied according to the time and place where they were sent, there is not the slightest difference regarding the basis of monotheism between them. Therefore Allah confirms again in this verse that He is the Lord of the Worlds, all human beings should worship and fear only Him and never associate Him with anyone or anything. Rasulullah saw said, \"We the prophets are (like) brothers and sisters, our religion is one.\" (History of al-Bukhari, Muslim and Dawud)"
		   },
		   {
			"id": 2726,
			"surah": 23,
			"ayat": 53,
			"tafsir": "In this verse Allah explains that the people of the apostles had deviated from the teachings of their apostles so that they were divided into several factions. Each group thinks that it is their group that is right, while the other groups are wrong. Such is the history of heavenly religions brought by the prophets and apostles. In the beginning these religions remained pure and pure, not in the least bit influenced by the foundations of shirk, but gradually little by little the pure monotheism understanding was penetrated by other ideas which smelled of shirk or deviated completely from the basis of monotheism. . As a result, humans fell into error, and some even worshiped humans, animals, and objects such as statues and idols. However, we can know the purity and purity of a religion if we still adhere to the ideology of monotheism. If in that religion there is not the slightest deviation from the basis of monotheism, then that religion must be a genuine and pure religion. However, if there is an understanding in it that deviates from that basis, then that religion is no longer pure and has been invaded by misguided notions. These misguided notions have been embraced by the polytheists of Mecca even though they preached that they were followers of the Prophet Abraham. They have strayed far from the teachings of the Prophet Abraham, but they are still proud that their religion is the right one, even though what they worship are inanimate objects that are not of the slightest benefit and are powerless to resist harm. They strongly opposed the teachings of monotheism brought by the Prophet Muhammad and threatened to take firm action against anyone who opposed them."
		   },
		   {
			"id": 2727,
			"surah": 23,
			"ayat": 54,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to let stubborn people who do not want to accept the truth until the time comes when Allah will torture them both in this world and in the hereafter, where they will witness for themselves how great and terrible the torments provided are. for them. As for the torment in this world, is the calamity that befell them during the Battle of Badr where they suffered great defeat and destruction. Commands like this are also found in other verses, as Allah says: Therefore give respite to the disbelievers. Give them a chance for a while. (ath-thariq\/86: 17) And His words: Let them (in this world) eat and have fun and be neglected by their (empty) wishful thinking, one day they will know (the result of their actions). (al-hijr\/15: 3)"
		   },
		   {
			"id": 2728,
			"surah": 23,
			"ayat": 55,
			"tafsir": "In this verse Allah explains that the disbelievers have been deceived and deceived by their wealth and children even though the wealth and many children are not a sign that Allah is pleased with them. They were proud of their possessions and wealth against the Muslims who at that time were in a state of complete deprivation, as stated in the word of Allah: And they said, \"We have more wealth and children (than you) and we will not be punished. \" (Saba\/34: 35) In fact, Allah gives the disbelievers abundant sustenance only to plunge them into the valley of disobedience and lawlessness because of their very arrogant and arrogant attitude towards the teachings that the Prophet Muhammad brought. With a lot of wealth and children they will become oblivious as if they were the right and powerful. Whatever they do is their right even though by doing that they trample the rights of others and abuse the weak. But at some point Allah will surely punish them, because it is sunnatullah that tyranny and persecution will not last forever, they will even be destroyed and destroyed. This is emphasized by Allah in His word: So do not let their wealth and their children amaze you. Indeed, Allah's intention with that is to torture them in the life of this world and one day they will die in a state of disbelief. (at-Taubah\/9: 55) And His words: And let not those who disbelieve think that the grace period We have given them is better for them. Indeed, the grace period that We have given them is only so that their sins will increase; and they will have a humiliating punishment. (Ali 'Imran\/3: 178) Qatadah, a mufassir has commented on this verse as follows, \"Allah has deceived the disbelievers with their wealth and their children. O children of Adam, do not consider someone honorable because of wealth. his wealth and children, but honor him for his faith and good works.\" It was narrated from Ibn Mas'ud that the Messenger of Allah said: Verily Allah has divided the morals among you as He has distributed the sustenance among you. Indeed, Allah gives the pleasures of the world to those who are pleased with Him and to those who are not pleased with Him. And He does not give firmness to religion except to that which He pleases. And whoever God gives him firmness in religion, it means God approves of him. By God, in whose hand Muhammad's soul is in His hand, a slave is not Muslim unless he is also Muslim in his heart and tongue, he does not believe unless his neighbors feel safe from his crimes. The Companions asked, \"What is the crime, O Messenger of Allah?\" Rasulullah replied, \"Deception and tyranny.\" (Ahmad's history)"
		   },
		   {
			"id": 2729,
			"surah": 23,
			"ayat": 56,
			"tafsir": "In this verse Allah explains that the disbelievers have been deceived and deceived by their wealth and children even though the wealth and many children are not a sign that Allah is pleased with them. They were proud of their possessions and wealth against the Muslims who at that time were in a state of complete deprivation, as stated in the word of Allah: And they said, \"We have more wealth and children (than you) and we will not be punished. \" (Saba\/34: 35) In fact, Allah gives the disbelievers abundant sustenance only to plunge them into the valley of disobedience and lawlessness because of their very arrogant and arrogant attitude towards the teachings that the Prophet Muhammad brought. With a lot of wealth and children they will become oblivious as if they were the right and powerful. Whatever they do is their right even though by doing that they trample the rights of others and abuse the weak. But at some point Allah will surely punish them, because it is sunnatullah that tyranny and persecution will not last forever, they will even be destroyed and destroyed. This is emphasized by Allah in His word: So do not let their wealth and their children amaze you. Indeed, Allah's intention with that is to torture them in the life of this world and one day they will die in a state of disbelief. (at-Taubah\/9: 55) And His words: And let not those who disbelieve think that the grace period We have given them is better for them. Indeed, the grace period that We have given them is only so that their sins will increase; and they will have a humiliating punishment. (Ali 'Imran\/3: 178) Qatadah, a mufassir has commented on this verse as follows, \"Allah has deceived the disbelievers with their wealth and their children. O children of Adam, do not consider someone honorable because of wealth. his wealth and children, but honor him for his faith and good works.\" It was narrated from Ibn Mas'ud that the Messenger of Allah said: Verily Allah has divided the morals among you as He has distributed the sustenance among you. Indeed, Allah gives the pleasures of the world to those who are pleased with Him and to those who are not pleased with Him. And He does not give firmness to religion except to that which He pleases. And whoever God gives him firmness in religion, it means God approves of him. By God, in whose hand Muhammad's soul is in His hand, a slave is not Muslim unless he is also Muslim in his heart and tongue, he does not believe unless his neighbors feel safe from his crimes. The Companions asked, \"What is the crime, O Messenger of Allah?\" Rasulullah replied, \"Deception and tyranny.\" (Ahmad's history)"
		   },
		   {
			"id": 2730,
			"surah": 23,
			"ayat": 57,
			"tafsir": "One of the characteristics of a person who truly believes first is the fear of God. Therefore they always seek His pleasure by earnestly doing all His commands and staying away from all His prohibitions. What guides their lives are religious teachings because those teachings are their principles. Anything that is contrary to these principles they reject regardless of the consequences. Their faith cannot be shaken by any persuasion or threats."
		   },
		   {
			"id": 2731,
			"surah": 23,
			"ayat": 58,
			"tafsir": "The second characteristic is to fully believe in the proofs of the Oneness and power of Allah which extends widely in the universe as Allah says: Verily, in the creation of the heavens and the earth, and the alternation of night and day there are signs (of Allah's greatness) for people of understanding, (namely) those who remember Allah while standing, sitting or lying down, and they think about the creation of the heavens and the earth (saying), \"O our Lord, You have not created all this in vain; Glory to You, protect us from the torments of hell (Ali 'Imran\/3: 190-191) They also fully believe in all the verses revealed to His Messenger. What is said in these verses is the absolute truth that cannot be negotiable."
		   },
		   {
			"id": 2732,
			"surah": 23,
			"ayat": 59,
			"tafsir": "The third characteristic is maintaining the purity of monotheism by truly worshiping Allah alone without associating Him with other gods. People who believe will not want to worship idols or ask for help from them, even though idols are considered by polytheists as a tool to get closer to Allah, as stated in His word: Even though they are only ordered to worship Allah sincerely obey Him solely because of (carrying out) religion, and also in order to perform prayers and pay zakat; and that is the straight (true) religion. (al-Bayyinah\/98: 5) They will not ask for help from graves because they are fully convinced that this act is tantamount to asking for help from idols and that is an act of shirk which is very angry with Allah. Nor will they ask for help from the spirits, jinns and demons, because that is also shirk. Thus all actions that lead to associating partners with Allah they avoid as far as possible, so that their belief is truly pure, not polluted in the slightest by things that smell of shirk."
		   },
		   {
			"id": 2733,
			"surah": 23,
			"ayat": 60,
			"tafsir": "The fourth characteristic is fear of Allah, because they believe they will return to Him on the day of reckoning where all human deeds will be taken into account. Even though they have carried out all God's commands and avoided all His prohibitions and spent their wealth in the way of Allah, they are afraid that their good deeds will not be accepted, because there may be elements of riya' or other elements in it that cause the charity to be rejected. . Therefore they are always motivated to continue to do good because if the previous charity is not accepted, maybe the charity after that becomes a valid deed that will be given a double reward. In a hadith narrated by Ibn Abi Hatim from 'Aisyah once asked the Prophet: Siti Aisyah once asked the Messenger of Allah about this verse (alladzina yu'tuna ma ataw waqulubuhum wajilah), what is meant by this verse is someone who commits adultery and drinks khamr or steals, and because of that he fears God and His torment? This question was answered by the Prophet, \"That is not the point, O daughter of Abu Bakr as-shiddiq. What is meant in this verse is people who perform prayers, fast and spend their wealth, but they are afraid that their deeds will be included in acts that are not good.\" accepted (mardud).(Ahmad and at-Tirmidhi)"
		   },
		   {
			"id": 2734,
			"surah": 23,
			"ayat": 61,
			"tafsir": "This verse emphasizes that people who have these qualities, always hasten to do good when there is an opportunity for it and always try to increase their good deeds. Just when he finished doing a good deed he wanted to be able to do another deed immediately and so on. Such a person will be rewarded by Allah for his good deeds in this world and in the hereafter, as was given to the Prophet Abraham, which was mentioned in His words: And We give him goodness in this world, and indeed in the hereafter he is one of the pious. (an-Nahl\/16: 122) And His words: So Allah will give them a reward in this world and a good reward in the hereafter. And Allah loves those who do good. (Ali 'Imran\/3: 148)"
		   },
		   {
			"id": 2735,
			"surah": 23,
			"ayat": 62,
			"tafsir": "With this verse Allah explains that it has become His sunnah and decree, He will not burden someone with an obligation or command unless the order is capable of being carried out and within the limits of his ability. There is no Shari'a that is obligatory for His servant to carry out with difficulty and beyond the limits of his ability, only humans view it as heavy because of their reluctance or he is preoccupied with world affairs or the task prevents him from carrying out his desires. Even though the order, for example, to pray is very light and easy for people who are used to doing it, even that prayer can lighten the burden and pressure of life that he suffers if he really does it diligently and solemnly. Muqatil said, \"Whoever is unable to pray standing can do so while sitting, and even if he is unable to sit, then a sign is sufficient.\" Therefore there is no reason at all for a believer to free himself from the obligation to pray, as well as other obligations, because all of these obligations are within the limits of his ability. It is only human passions and desires that make these obligations heavy for him. So a person like this has wronged himself and will receive a fitting reward from God for his denial and reluctance. Every violation of Allah's commands will be recorded in his charity record book, likewise good deeds, small and large are all recorded in that book as stated in His word: (Allah said), \"This is the Book (record) We told you with truth. Verily, We have ordered to record what you have done.\" (al-Jatsiyah\/45: 29) And His words: And put the book (charity record), then you will see the sinners fear what is (written) in it, and they say, \"How woeful for us, the book what is this, nothing is left behind, the small and the large but everything is recorded,\" and they find (all) what they have done (written). And your Lord does not wrong anyone. (al-Kahf\/18: 49) They will be rewarded according to what they have done in the notebook and they will not be harmed in the slightest."
		   },
		   {
			"id": 2736,
			"surah": 23,
			"ayat": 63,
			"tafsir": "In this verse Allah explains that the hearts of the polytheists have turned away and neglected to pay attention to the instructions that the Qur'an brings. They don't want to take advantage of it. Even though those instructions can lead them to happiness in life in this world and in the hereafter. If they were willing to read and pay attention to the Al-Qur'an, their hearts would surely be opened and see that the teachings of the Al-Qur'an are indeed very useful and everything contained in them is true. They will admit that all human actions will be accounted for before Allah without exception. This is their first mistake that drags them into other mistakes and causes them to ignore the noble moral norms anymore, to do as they please without regard for the rights of others. Whatever they want they seize even by depriving and mistreating the weak. Because of that, they have sunk into polytheism and their eyes are blind, they can no longer distinguish between what is right and what is wrong, their ears are deaf, they can no longer hear religious teachings. The hadith narrated by Ibn Masud, the Prophet said: ....By the One Who has no god but Him, in fact someone among you does the deeds of the inhabitants of heaven, so that between him and heaven there is only one cubit. But he has been recorded as a resident of hell, so he ends his deeds with the deeds of the people of hell, so he goes to hell. And verily one of you does the deeds of the inhabitants of Hell, so that between him and Hell there is only one cubit. But he has been recorded as a resident of heaven, so he ends his deeds with the deeds of the inhabitants of heaven, so he enters heaven.\" (Ahmad's history) They think that only what they inherited from their ancestors is correct. According to them, the Qur'an is only the tales of the ancients brought by madmen or just the composition of a poet or the teachings that Muhammad received from people of the book. If given to them clear information about the indisputable truth of the Qur'an so that they say, we can not accept it because it is contrary to what our forefathers adhered to and believed in, as stated in the verse: In fact they said, \"Indeed we found our ancestors adhering to a religion, and we were guided to follow in their footsteps.\" (az-Zukhruf\/43: 22 )"
		   },
		   {
			"id": 2737,
			"surah": 23,
			"ayat": 64,
			"tafsir": "In this verse Allah explains that the polytheists and all those who disobey and disobey will be tortured with painful torments. When they were surrounded by terrible and terrible doom as a recompense for their denial and iniquity, they screamed for help and deeply regretted their bad fate, especially their leaders and rich people who had lived in this world with happy and full of enjoyment. But nothing could help them at that time, because all matters and decisions were in the hands of Allah. Their regrets are of no use anymore because like the saying \"rice has turned to mush,\" their mistakes and iniquity are unforgivable. Allah's Word: How many people before them whom We destroyed, then they asked for help even though (at that time) it was not the time to run away. (shad\/38:3)"
		   },
		   {
			"id": 2738,
			"surah": 23,
			"ayat": 65,
			"tafsir": "Allah told them not to scream for help on that day, because there was no point. That day is the day of retribution for what they did in the world before. This is a definite decree from Allah that they must accept, nothing can help or free them from punishment and they cannot escape it."
		   },
		   {
			"id": 2739,
			"surah": 23,
			"ayat": 66,
			"tafsir": "The next verse explains that when in the world the verses of Allah were read to them by an apostle sent to them, but they belied him, made fun of and insulted him because of arrogance and arrogance, even though the instructions and teachings he brought were true and very useful. for them if they would pay attention and listen to it. Allah's Word: That is because you actually deny when called upon to worship Allah alone. And if Allah is associated, you believe. So the decision (now) is with Allah, the Most High, the Most Great. (al-Mumin\/40: 12)"
		   },
		   {
			"id": 2740,
			"surah": 23,
			"ayat": 67,
			"tafsir": "This verse explains that they reject all the teachings that the Prophet Muhammad brought and consider themselves to be more noble than him because they are the rulers, defenders, and guardians of the Baitullah. No one in this world is more noble than them. They gossiped and denounced the Holy Prophet during their leisure time at night. They accused the Prophet of being a sorcerer, poet, sorcerer, and so on. Their actions were not right, because Muhammad was an apostle and Allah would expel the disbelievers from the forbidden land because of their crimes against the Prophet."
		   },
		   {
			"id": 2741,
			"surah": 23,
			"ayat": 68,
			"tafsir": "In this verse Allah rebukes their immodest and unreasonable actions and words. Do they not pay attention to the verses of the Qur'an how beautiful and lofty the wording is, even though they have ample opportunity to pay attention to it. There is nothing in the Qur'an that has weaknesses, contradictions or anything that diminishes its literary value or undermines the understanding contained therein. Even the Al-Qur'an contains proofs and proofs that are real that cannot be refuted, both related to the principles of noble morality, as well as with the Shari'a and regulations that can bring them to the highest degree if they are willing to practice it. and stick with it. Or did they consider the arrival of Muhammad as a messenger an impossible thing that had never happened to earlier peoples, even though they knew about the existence of these earlier messengers and what was the fate of those people who denied them, even they saw the traces of destruction themselves. left behind by the disobedient people."
		   },
		   {
			"id": 2742,
			"surah": 23,
			"ayat": 69,
			"tafsir": "This verse questions whether they don't know who Muhammad, their messenger is, so they deny it. In fact, they knew Muhammad since childhood, as a person of good character, the most trusted among them, and a descendant of the Bani Hasyim whom they respected and respected, so that they themselves gave him the nickname al-Amin (the most trusted person). Abu Sufyan as the head of their delegation to the Roman Emperor, when asked about the characteristics of Muhammad, he replied Muhammad came from a noble family lineage, famous for the truth of his words and his trustworthiness."
		   },
		   {
			"id": 2743,
			"surah": 23,
			"ayat": 70,
			"tafsir": "Later explanations say that they regarded Muhammad as a madman who was not aware of everything he said. In fact, they knew perfectly well that Muhammad was not mad, and acknowledged that he was the most intelligent of them, a wise scholar. They themselves once appointed him as a judge who decided cases between them, when they disputed over who would put the Black Stone in its original place after the Kaaba building was overhauled and repaired. In this verse Allah confirms that Muhammad is the bearer of truth from his Lord, not as they accuse him. He invited them to leave various idols and worship and return to the pure monotheistic religion, the religion of their ancestor Prophet Abraham. He is the bearer of a religion that has laws and regulations for human happiness in this world and in the hereafter. But most of them hate the truth that he proclaims, because their hearts have been closed by shirk, sin, and iniquity. Because of this, they turn away from the true path, always take the wrong path, and can no longer understand the truth, and they even hate it. Indeed, there are those among them who are aware and converted, admit in their hearts that the religion that Muhammad brought is the true and good religion, but for fear of being ridiculed by their infidel people they do not want to believe like the Prophet's own uncle, Abu Talib. He once said, \"Were it not for fear of being reviled by our clan leaders, we would have really become his followers in every way.\""
		   },
		   {
			"id": 2744,
			"surah": 23,
			"ayat": 71,
			"tafsir": "Then Allah explained that if the Qur'an followed the wishes of those who belied Allah and His Messenger, who associated partners with Allah and said that He had children, and justified all sinful and evil deeds, surely this world would be destroyed as it was. mentioned in His word: If in both of them (in the heavens and on earth) there were gods besides Allah, both of them would have perished. Glory be to Allah who has the 'Arsy, from what they characterize. (al-Anbiya'\/21: 22) If the Qur'an allows unjust acts, persecution, and abandoning justice, there will certainly be great chaos and shock in society. If the Qur'an allowed rights violations and confiscation of wealth so that the weak become easy food for the strong, surely this world would not be safe and secure forever. This has proven itself. Nearly the Arab community during the Jahiliyyah era was destroyed, because they did not have noble moral norms, there were no sharia and regulations that they obeyed. They only boast of wealth and power so that to fight over it they fall into the abyss of endless strife and war. Allah again explained that He had bestowed upon them something that should be a source of pride for them, namely the Qur'an. Why did they turn away from him, reject him, despise him, and make fun of him. If they are aware and aware of course they will not do something like that. Even though it was later proven that the Qur'an had made them a noble nation and they were proud because the Qur'an had come down for the first time to them and used their language, according to the word of Allah: And indeed, the Qur'an is truly indeed a warning for you and for your people, and later you will be held accountable. (az-Zukhruf\/43: 44)"
		   },
		   {
			"id": 2745,
			"surah": 23,
			"ayat": 72,
			"tafsir": "In this verse Allah asks why they do not want to accept the teachings of the Qur'an even though the Prophet Muhammad never asked them for compensation for conveying the teachings of the Qur'an. The Prophet Muhammad realized that the delivery of the treatise was an obligation that had to be carried out as well as possible at the behest of his Lord. If there is something that he hopes for, then that hope is nothing but the pleasure of Allah who with His pleasure he will be happy and with Allah's pleasure he will receive a bounty that will not be broken as stated in His word: Say (Muhammad), \" Whatever reward I ask of you, it shall be for you. My reward is only from Allah, and He is All-Knower of all things.\" (Saba'\/34: 47)"
		   },
		   {
			"id": 2746,
			"surah": 23,
			"ayat": 73,
			"tafsir": "Then in this verse Allah assures the Prophet Muhammad that he is truly a messenger who calls his people to the straight path that will lead them to the happiness of the world and the hereafter. Allah advised Muhammad not to be swayed by the words of those disbelievers who insulted and ridiculed him. All of their words were lies that came out of their mouths because of envy and hurt."
		   },
		   {
			"id": 2747,
			"surah": 23,
			"ayat": 74,
			"tafsir": "Allah confirms in this verse that those people who do not want to believe and do not believe in the Hereafter, have really strayed from the right path. They have been given reasons and clear parables. If they would listen and think about it, they would surely come to their senses and return to the truth. But their hearts and minds have been covered by the pride, iniquity and sin that they always do. They have no right at all to God's mercy and compassion because all good deeds are of no use at all for people who are like that."
		   },
		   {
			"id": 2748,
			"surah": 23,
			"ayat": 75,
			"tafsir": "This verse says that even though Allah gives mercy to them and gets rid of the dangers that threaten them, they still will not be grateful for that grace, they will even become more rebellious and will continue to commit immorality and injustice. Nothing good can be expected from them. In fact, as explained in the Qur'an, in the afterlife after seeing the enormity of the torment that will be inflicted on them, then their request to be returned to the world will be granted to correct their mistakes, but they will still commit immorality and will also remain human. - people who deny and disobedience. Allah says in another verse: And if you (Muhammad) see when they are brought to hell, they say, \"If we were returned (to the world) we would certainly not deny the verses of our Lord, and be people of faith.\" But (actually) for them the evil that they hid before was revealed. If they were returned to the world, of course they would repeat what they had been forbidden to do. They are real liars. (al-An'am\/6: 27-28)"
		   },
		   {
			"id": 2749,
			"surah": 23,
			"ayat": 76,
			"tafsir": "Allah has punished them in the Battle of Badr so that many of their leaders and officials have been killed but they have never submitted to Allah and have never obediently followed His teachings and orders. They never wanted to be humble to Him, they even remained arrogant and arrogant and never stopped committing tyranny and sin. They grew misguided and became more active in fighting Allah's religion so that they prepared more and bigger armies and weapons of war to fight the Prophet. Allah says: But why did they not plead (to Allah) with humility when Our punishment came upon them? Even their hearts have become hardened and Satan makes it seem beautiful to them what they always do. (al-Anam\/6:43)"
		   },
		   {
			"id": 2750,
			"surah": 23,
			"ayat": 77,
			"tafsir": "In fact, those who have strayed far from the true path will not be conscious and aware unless the Day of Judgment comes, and the door of severe torment is opened for them. Only then will they regret and hope for forgiveness from Allah, but that is not the time to repent. Their regrets are useless and their repentance will not be accepted. They must be plunged into hell as a reward for their denial and disobedience in the world as stated in the word of Allah: This is because you rejoice on earth (without) heeding the truth and because you always rejoice (in disobedience). (It was said to them), \"Enter the gates of Hell, and you will remain therein. So that is the worst place for arrogant people.\" (al-Mu'min\/40: 75-76)"
		   },
		   {
			"id": 2751,
			"surah": 23,
			"ayat": 78,
			"tafsir": "This verse explains that God has bestowed upon man hearing, sight and conscience. If humans would pay attention and think about this gift of God, surely he would recognize how great God's amazing grace is, how thorough and refined His creation is. Ears that appear very simple in shape can perceive a variety of different sounds. Sounds of animals, birds, sounds that occur in the surrounding environment such as the sound of the wind that roars, the sound of thunder that thunders and various sounds generated by human civilization such as the sound of vehicles and machines, the sound of music playing, and melodious sounds. The ear can distinguish the sounds one by one so that humans can determine their attitude towards what they hear. The eye can perceive light and the shape of things, can distinguish different colors, can see the beauty of nature, can investigate what is beneficial and what is harmful. Then the heart that can feel and experience various kinds of feelings, examines every event, and draws conclusions from it to determine attitudes towards it. If humans really make the best use of these three blessings, of course he will get a lot of benefits and finally they come to the conclusion that the giver of the favors and gifts is the Most Extensive of His knowledge. Almighty over all things, He should be praised and thanked for all His gifts. But it turns out that very few humans reach that degree. As Allah says: And indeed, We have strengthened their positions (with prosperity and strength) that We have not given you and We have given them hearing, sight and hearts; but their hearing, sight and heart are of no use to them in the slightest, because they (always) deny the verses of Allah and (the threat of) punishment that they used to make fun of has surrounded them. (al-Ahqaf\/46: 26) Allah explained to the Prophet Muhammad the attitude of most people who do not want to thank Him, as stated in His words: And most people will not believe even if you really want to. (Yusuf\/12:103)"
		   },
		   {
			"id": 2752,
			"surah": 23,
			"ayat": 79,
			"tafsir": "Among God's gifts to humans is to create humans perfectly, equipped with hearing, sight and eyes of the heart and other potentials so that he can take advantage of all that God created on earth and in the sky which was created by God for humans as stated in His word: It is He (Allah) Who created all that is on earth for you. (al-Baqarah\/2: 29) And His words: Do you not see that Allah has subjected what is in the heavens and what is in the earth to your (interest) and perfected His favors for you physically and mentally. (Luqman\/31: 20) He created man complete with senses, potential and inclinations as well as a conscience so that he could truly become caliph on earth. There is no creature on this earth whose creation is more perfect than humans as mentioned in His words: Indeed, We have created humans in the best form, (at-Tin\/95: 4) With this privilege, humans must be grateful to their Creator by take advantage of that gift as well as possible, charity and work for the benefit of the world and the hereafter. Because later Allah will gather all mankind in Padang Mahsyar to receive an account of their deeds while living in the world."
		   },
		   {
			"id": 2753,
			"surah": 23,
			"ayat": 80,
			"tafsir": "Among God's gifts are life and death, man cannot enjoy worldly life if God does not give him the spirit. With the presence of a spirit in his body, then humans can try, endeavor and think to achieve what they want and aspire to. No one knows the secret of this life and death except Allah. For centuries, even thousands of years, humans have tried to find out the secret of this spirit so that he can live forever, but until now no scientist has been able to unravel this secret. Because the matter of the spirit is an unseen secret that is not known except by Allah as stated in His word: And they ask you (Muhammad) about the spirit. Say, \"The Spirit is in the business of my Lord, while you were given only a little knowledge.\" (al-Isra'\/17: 85) Furthermore, it is He who makes the change between night and day. The night is used as a time to rest and the day is used as a time to try and work. You can imagine how this world would be if there was only day, and vice versa. Maybe this world and all the creatures that are on it will burn to death because it is always hit by the hot sun or maybe this world will die and everything in it if there is only night all the time, because there is no sun which is the source of energy and causes life of beings in this world. Allah rebukes the attitudes and actions of humans who do not want to remember how great His gift is to them. Why don't they think about and pay attention to it, so that they are grateful and grateful to Him for all His blessings and gifts?"
		   },
		   {
			"id": 2754,
			"surah": 23,
			"ayat": 81,
			"tafsir": "In this verse Allah explains the disbelief of the disbelievers of Mecca so that they repeat what was said by the disbelievers before as if their eyes were blind, their ears were deaf and their hearts were locked to pay attention and think about the arguments that the Prophet Muhammad put forward, which they can no longer deny. They say that the day of resurrection is just nonsense that was always invented by the Prophet Muhammad and the previous apostles. Since time immemorial there have been prophets and messengers who uttered the words spoken by Muhammad, but in fact until now such a long period of doomsday has passed and the day of resurrection has not yet come. Allah describes the words of their ancestors about the day of resurrection with His words: Indeed, this has been promised to us and to our ancestors before, this is just the tales of the ancients!\" (al-Mu'minun\/23: 83"
		   },
		   {
			"id": 2755,
			"surah": 23,
			"ayat": 82,
			"tafsir": "In this verse Allah explains how they repeated the words of their forefathers. If they died and their bones crumbled into the ground, would they be resurrected? According to them, this is an impossible and impossible thing to happen, because until now none of their ancestors who have died and become the land can come back to life. What they say is very wrong."
		   },
		   {
			"id": 2756,
			"surah": 23,
			"ayat": 83,
			"tafsir": "This verse explains how the disbelievers insulted and ridiculed Muhammad by saying that they had been given promises that had no truth at all as their ancestors had been promised like Muhammad's promises, but none of these promises the promise of the earlier apostles that has been proven. How are they going to believe and accept Muhammad's utterances that have gone mad which have no proof at all and maybe his words are just the tales of the ancients. In other verses there is an explanation of their utterances along with rebuttals and rejection of these utterances as Allah says: (The disbelievers) said, \"Are we really going to be returned to our former life? Will (will be resurrected) also) when we have become broken bones?” They said, \"Then it is a loss return.\" Then the return is only with one blow. So instantly they came back to life on the (new) earth. (an-Nazi'at\/79: 10-14) And His words: And he made a parable for Us and forgot the origin of its occurrence; he said, \"Who can give life to the bones, which are shattered?\" Say (Muhammad), \"The one who will bring it to life is (Allah) who created it first. And He is All-Knowing of all creatures. (Yasin\/36: 78-79) And His words: Has he promised you that when you have die and become dust and bones, will you be expelled (from your grave)? Far away! Far away (from the truth) what is threatened to you, (that life) is nothing but our life in this world, (there) we die and lives and will not be resurrected (again), He is nothing but a man who invents a lie against Allah, and we will not believe him (al-Mu'minun\/23: 35-38)"
		   },
		   {
			"id": 2757,
			"surah": 23,
			"ayat": 84,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to ask the disbelievers who said that it is impossible for Allah to have the power to revive people who have died while their bones have been crushed to the ground and it is impossible for Him to gather them in the Mahsyar field later. Who owns the earth and all that is on it? The disbelievers were asked to answer this question. Basically they will answer that the owner and the ruler over it is Allah, because that is the belief of their ancestors. It's just that they have strayed far from the pure monotheistic religion and their beliefs have been tainted with beliefs that are not true and misleading. Therefore, Allah poses this question to them as if they did not know it at all or had forgotten it."
		   },
		   {
			"id": 2758,
			"surah": 23,
			"ayat": 85,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to ask the disbelievers who said that it is impossible for Allah to have the power to revive people who have died while their bones have been crushed to the ground and it is impossible for Him to gather them in the Mahsyar field later. Who owns the earth and all that is on it? The disbelievers were asked to answer this question. Basically they will answer that the owner and the ruler over it is Allah, because that is the belief of their ancestors. It's just that they have strayed far from the pure monotheistic religion and their beliefs have been tainted with beliefs that are not true and misleading. Therefore, Allah poses this question to them as if they did not know it at all or had forgotten it."
		   },
		   {
			"id": 2759,
			"surah": 23,
			"ayat": 86,
			"tafsir": "Then Allah also ordered the Prophet Muhammad to ask them again, that who created the seven heavens and who created the vast 'Arsh covering the heavens and the earth as mentioned in His word: \"His chair covers the heavens and the earth.\" (al-Baqarah\/2: 255) Who arranges and manages it so that everything goes according to rules that are so thorough and good. Allah directly determines the answer to this question because surely the answer of these disbelievers is the same, that is, the Creator of all of them is Allah Who owns and controls them. There will be no answer for them other than that because that is basically their belief. It's just that besides acknowledging the power of Allah, they also worship idols such as idols and so on. Then Allah ordered the Prophet Muhammad to say to them, \"If it is true that Allah created the seven heavens and created the great Throne, and Allah is the one who arranges and takes care of it, why do you not fear Him and do not want to follow the teachings and orders of Allah?\" Him? Why do you keep on worshiping idols, while the worship of other than Allah is greatly angered by Him?\""
		   },
		   {
			"id": 2760,
			"surah": 23,
			"ayat": 87,
			"tafsir": "Then Allah also ordered the Prophet Muhammad to ask them again, that who created the seven heavens and who created the vast 'Arsh covering the heavens and the earth as mentioned in His word: \"His chair covers the heavens and the earth.\" (al-Baqarah\/2: 255) Who arranges and manages it so that everything goes according to rules that are so thorough and good. Allah directly determines the answer to this question because surely the answer of these disbelievers is the same, that is, the Creator of all of them is Allah Who owns and controls them. There will be no answer for them other than that because that is basically their belief. It's just that besides acknowledging the power of Allah, they also worship idols such as idols and so on. Then Allah ordered the Prophet Muhammad to say to them, \"If it is true that Allah created the seven heavens and created the great Throne, and Allah is the one who arranges and takes care of it, why do you not fear Him and do not want to follow the teachings and orders of Allah?\" Him? Why do you keep on worshiping idols, while the worship of other than Allah is greatly angered by Him?\""
		   },
		   {
			"id": 2761,
			"surah": 23,
			"ayat": 88,
			"tafsir": "Then Allah ordered the Prophet Muhammad to ask them also, who controls everything and regulates it. In His hand lies absolute power. When Allah protects a person, no power can wreak havoc on him or destroy him. On the other hand, if He wants to inflict danger on someone, there is no power that can protect that person. Who has this quality, the Almighty, the Almighty? The Apostle asked the disbelievers to answer these questions if they really knew."
		   },
		   {
			"id": 2762,
			"surah": 23,
			"ayat": 89,
			"tafsir": "They will surely answer that such is the nature of God alone. Therefore, Allah made sure that they would answer like that and ordered the Prophet to ask them again. If they know that Allah is Almighty and Mighty, why are they deceived and turned away from the monotheistic religion and always oppose Allah and are disobedient to Him? By worshiping idols or something else, it is as if they have been enchanted and their minds can no longer trust them, so their beliefs become chaotic, mixing the right with the wrong, so they associate partners with Allah with others. Even though Allah will not justify their actions, they are even very angry."
		   },
		   {
			"id": 2763,
			"surah": 23,
			"ayat": 90,
			"tafsir": "In this verse Allah confirms to the disbelievers that, because all the questions raised to them regarding Allah as the Creator, Owner and Ruler of everything, they answer with correct and positive answers, that the Qur'an was revealed to the Prophet Muhammad to correcting and rectifying their aqidah that has gone astray, is true and the accusations that they put forward against Muhammad and the Al-Qur'an he brought are wrong and a lie. The Qur'an is not the stories of the ancients, but is truly a revelation and guidance from Allah, the Creator, Almighty and Who rules over all things, both on earth and in the heavens, with His wisdom and wisdom."
		   },
		   {
			"id": 2764,
			"surah": 23,
			"ayat": 91,
			"tafsir": "This verse rejects the accusations of the polytheists that the angels are the daughters of Allah by explaining that Allah never has children, because He is Almighty, Almighty and Everlasting, does not need offspring like humans. Humans really need a lot of children who will continue their offspring, and when he is old and helpless, it is his children who will help and help him. And when he dies, it is also his children who will continue his business and profession and raise his name among the people. Almighty, Almighty and Most Eternal God does not need any of these. Allah will not be struck by fatigue because He is All-Powerful, death will not be overwritten because He is Everlasting, He will not be overwritten by poverty because He is All-Rich, to Him belongs all that is in the heavens and on earth. How stupid are the polytheists who equate Allah with humans who are very weak and poor, or if they are not stupid then they are big liars because what they say completely contradicts the thoughts of people of understanding. Really very weak minded people who say that Allah has a son or has partners. Glory be to Allah from all these preposterous assumptions and accusations."
		   },
		   {
			"id": 2765,
			"surah": 23,
			"ayat": 92,
			"tafsir": "This verse explains that Allah, the All-Knowing of everything unseen that cannot be seen and felt with the five senses, is All-Knowing of everything that is visible and real and can be seen and felt. Whatever happens in this world, whether in the heavens or the earth, everything happens with His knowledge, nothing is big or small except in His vast knowledge, as stated in His words: And are you not (Muhammad) in an affair, and do not read a verse of the Qur'an and nor do you do any work, but We are witnesses over you when you do it. Do not be careless in the least from the knowledge of your Lord, even if it is as small as a particle, whether on earth or in the sky. There is nothing smaller or greater than that, but everything is recorded in a real Book (Lauh Mahfuz). (Yunus\/10: 61) Thus wide and encompassing is the knowledge of Allah. Glory be to Allah from all the accusations of the disbelievers who say that He has children and partners."
		   },
		   {
			"id": 2766,
			"surah": 23,
			"ayat": 93,
			"tafsir": "In this verse Allah commands the Prophet Muhammad to pray for Him to be kept away from those infidels who persecute them if He wants to punish them, not to be destroyed with them, so that they are saved from His torment and wrath, and make them a group of people who are pleased . The command to pray like this is taught by God because of the calamities and calamities that God brings to disobedient and persecuted people sometimes also happen to innocent people, because they live together in a society or a country. This is in accordance with the word of Allah: And protect yourself from the torment that does not only affect the wrongdoers among you. Know that Allah is severe in punishment. (al-Anfal\/8: 25) According to the narrations of Imam Ahmad and at-Tirmidhi the prayer of the Prophet Muhammad in this case reads: Allah) if you want to inflict torment on people (who are persecuted), then let me die in a state that I am not being tortured. (Ahmad and at-Tirmid's narrations"
		   },
		   {
			"id": 2767,
			"surah": 23,
			"ayat": 94,
			"tafsir": "In this verse Allah commands the Prophet Muhammad to pray for Him to be kept away from those infidels who persecute them if He wants to punish them, not to be destroyed with them, so that they are saved from His torment and wrath, and make them a group of people who are pleased . The command to pray like this is taught by God because of the calamities and calamities that God brings to disobedient and persecuted people sometimes also happen to innocent people, because they live together in a society or a country. This is in accordance with the word of Allah: And protect yourself from the torment that does not only affect the wrongdoers among you. Know that Allah is severe in punishment. (al-Anfal\/8: 25) According to the narrations of Imam Ahmad and at-Tirmidhi the prayer of the Prophet Muhammad in this case reads: Allah) if you want to inflict torment on people (who are persecuted), then let me die in a state that I am not being tortured. (Ahmad and at-Tirmid's narrations"
		   },
		   {
			"id": 2768,
			"surah": 23,
			"ayat": 95,
			"tafsir": "Allah explained to the Prophet Muhammad, that He had the power to show him the torment that would be inflicted on the unbelievers so that the Prophet Muhammad could see for himself how terrible and great the punishment of Allah was. But because of His mercy and compassion for the people of Muhammad, Allah did not impose the punishment immediately (in this world), but it has become His decree that the torment will befall them in the hereafter, because maybe one day there will be one among them or their descendants. who will be conscious and believe in Allah and His Messenger. Therefore, the Prophet Muhammad did not grieve too much for the actions and treatment of the disbelievers towards him and the Muslims who were indeed in a weak and helpless state."
		   },
		   {
			"id": 2769,
			"surah": 23,
			"ayat": 96,
			"tafsir": "Then Allah gave guidance to the Prophet Muhammad on how best to deal with the attitude of the polytheists. Among other things, the Prophet must remain gentle towards them and never repay evil for evil, violence for violence because it was not the time to act like that. If they ridiculed and insulted the Prophet, the Prophet should forgive their inappropriate remarks, because these words were not on target, but they should be rewarded with words that contain instructions and teachings by presenting reasonable arguments and reasons. If they are about to commit acts of persecution, avoid them and avoid as much as possible opportunities that lead to such acts and should be faced with patience and fortitude. The Prophet was also ordered to show them that he was indeed a warrior who had no intention of harming them. With that gentle attitude and wisdom, they will not be rampant against the Muslims. Gradually those who are as hard as a rock will become soft and realize for themselves the mistakes they have made. Prophets were also asked to believe in their hearts that Allah knows all their words and actions. Allah knows better what they do and what is hidden in their breasts. In accordance with this guidance Allah says in another verse: And good is not equal to evil. Reject (the evil) in a better way, so that the person with whom you have enmity will be like a loyal friend. (Fussilat\/41: 34) Anas bin Malik said commenting on this verse, \"A man says things against his brother that are not.\" So he replied, \"If what you say is a lie then I ask Allah to forgive your lie. If what you say is true then I ask Allah to forgive me.\""
		   },
		   {
			"id": 2770,
			"surah": 23,
			"ayat": 97,
			"tafsir": "In this verse Allah commands the Prophet Muhammad to always take refuge in Him from the whispers of Satan and from his temptations, and so that Satan is always far away from him and cannot enter his heart to deceive him. That should be the attitude of every fighter to uphold the truth. They must really take care that they are not even influenced by their lust and are encouraged to commit acts that are not right and dishonest. Satan is very easy to plunge people into the abyss of error, humiliation and evil when he can enter human passions. Therefore let us always take refuge in Allah from the deception of Satan. Indeed, if a person truly surrenders to his Lord in all his actions and always seeks His protection from Satan's deceptions and temptations, he will become clean and his conscience will be tapped to always do good and avoid evil. The Messenger of Allah always took refuge in his Lord so that Satan would keep him away from interference in all his actions, especially in praying when reading the Qur'an and when he was about to die. Narrated by Ahmad, Abu Daud and at-Tirmidhi and judged valid by al-Baihaqi from 'Amr bin Syu'aib and his father from his grandfather he said, \"The Messenger of Allah taught In the name of Allah, I seek refuge with Allah's perfect words from the wrath of Allah Him, from His punishment. From the evil of His servants, from the whispers of satan and from the presence of satan on me. (History of Ahmad, Abu Daud and at-Tirmidhi)"
		   },
		   {
			"id": 2771,
			"surah": 23,
			"ayat": 98,
			"tafsir": "In this verse Allah commands the Prophet Muhammad to always take refuge in Him from the whispers of Satan and from his temptations, and so that Satan is always far away from him and cannot enter his heart to deceive him. That should be the attitude of every fighter to uphold the truth. They must really take care that they are not even influenced by their lust and are encouraged to commit acts that are not right and dishonest. Satan is very easy to plunge people into the abyss of error, humiliation and evil when he can enter human passions. Therefore let us always take refuge in Allah from the deception of Satan. Indeed, if a person truly surrenders to his Lord in all his actions and always seeks His protection from Satan's deceptions and temptations, he will become clean and his conscience will be tapped to always do good and avoid evil. The Messenger of Allah always took refuge in his Lord so that Satan would keep him away from interference in all his actions, especially in praying when reading the Qur'an and when he was about to die. Narrated by Ahmad, Abu Daud and at-Tirmidhi and judged valid by al-Baihaqi from 'Amr bin Syu'aib and his father from his grandfather he said, \"The Messenger of Allah taught In the name of Allah, I seek refuge with Allah's perfect words from the wrath of Allah Him, from His punishment. From the evil of His servants, from the whispers of satan and from the presence of satan on me. (History of Ahmad, Abu Daud and at-Tirmidhi)"
		   },
		   {
			"id": 2772,
			"surah": 23,
			"ayat": 99,
			"tafsir": "In this verse Allah informs about the words spoken by disbelievers when facing death, even though those words could not be heard by those present at that time. The disbeliever asked Allah not to be killed first and allowed to live as before so that he could repent of his mistakes and iniquity and be able to believe and do good deeds that he had not done during his life. Such is the condition of those disbelievers when they are still healthy and have the ability to believe and do good deeds, they are reluctant to accept the truth, are arrogant and arrogant towards those who believe, are always disobedient to Allah and even do actions that are contrary to the commandments. Allah and speak unrighteous words against Him. However, when in a state of death, they are reminded of the sins and mistakes they have committed. At that time they also became aware and realized and asked with all their heart to Allah to be given a long life to do good to cover up all the iniquities and crimes they had committed. However, the moment of death is not the time to ask for forgiveness and repent as stated in His word: And repentance is not accepted by Allah from those who do evil (which) until when death comes to one of them, (then) he said: \"Surely I repent now.\" And not (repentance is also accepted) those who die while they are in a state of disbelief. For these people We have prepared a painful torment. (an-Nisa'\/4: 17-18) Then Allah confirmed that the requests of the disbelievers were only words that came out of their mouths and would not be granted. Even if they are truly given a long life, they will not return to faith and will not want to do good deeds as confirmed by Allah in His word: And if you (Muhammad) see when they are brought to hell, they say, \"If only we were returned ( to the world) of course we will not deny the verses of our Lord, and become people of faith.\" But (actually) for them the evil that they hid before was revealed. If they were returned to the world, of course they would repeat what they had been forbidden to do. They are real liars. (al-An'am\/6: 27-28) Those are the words they utter as consolation for their own hearts, a speech that has no value at all because it is impossible for them to live again because their death has come. In front of them lay a wall that prevented them from returning to the world until the Day of Judgment. Conclusion"
		   },
		   {
			"id": 2773,
			"surah": 23,
			"ayat": 100,
			"tafsir": "In this verse Allah informs about the words spoken by disbelievers when facing death, even though those words could not be heard by those present at that time. The disbeliever asked Allah not to be killed first and allowed to live as before so that he could repent of his mistakes and iniquity and be able to believe and do good deeds that he had not done during his life. Such is the condition of those disbelievers when they are still healthy and have the ability to believe and do good deeds, they are reluctant to accept the truth, are arrogant and arrogant towards those who believe, are always disobedient to Allah and even do actions that are contrary to the commandments. Allah and speak unrighteous words against Him. However, when in a state of death, they are reminded of the sins and mistakes they have committed. At that time they also became aware and realized and asked with all their heart to Allah to be given a long life to do good to cover up all the iniquities and crimes they had committed. However, the moment of death is not the time to ask for forgiveness and repent as stated in His word: And repentance is not accepted by Allah from those who do evil (which) until when death comes to one of them, (then) he said: \"Surely I repent now.\" And not (repentance is also accepted) those who die while they are in a state of disbelief. For these people We have prepared a painful torment. (an-Nisa'\/4: 17-18) Then Allah confirmed that the requests of the disbelievers were only words that came out of their mouths and would not be granted. Even if they are truly given a long life, they will not return to faith and will not want to do good deeds as confirmed by Allah in His word: And if you (Muhammad) see when they are brought to hell, they say, \"If only we were returned ( to the world) of course we will not deny the verses of our Lord, and become people of faith.\" But (actually) for them the evil that they hid before was revealed. If they were returned to the world, of course they would repeat what they had been forbidden to do. They are real liars. (al-An'am\/6: 27-28) Those are the words they utter as consolation for their own hearts, a speech that has no value at all because it is impossible for them to live again because their death has come. In front of them lay a wall that prevented them from returning to the world until the Day of Judgment. Conclusion"
		   },
		   {
			"id": 2774,
			"surah": 23,
			"ayat": 101,
			"tafsir": "In this verse Allah explains that if the trumpet is blown a second time and the souls are returned to their respective bodies on the resurrection day, then at that time there will be no benefit of lineage ties. A person can no longer be proud of his lineage, that he comes from a noble lineage as was the case when he was still in the world. There is no difference between a person and another, all are affected by the atmosphere that surrounds them. They were confused and filled with fear because of the awesomeness of that day, so that their love and affection disappeared. Each one thinks of himself and does not want to know about others, as described in God's word: Then when there comes a deafening sound (the second trumpet blast), on that day man flees from his brother, and from his mother and father, and from his wife and children. Every one of them that day had some business to occupy him with. ('Abasa\/80: 33-37) They no longer scold and ask each other. None of them asked about their family and descendants, as is the case in the world. It was as if they didn't know each other anymore. Allah's Word: And no one's intimate friend asks his friend. (al- Ma'arij\/70: 10) They are confused like people who are drunk, even though they are not drunk. Allah's Word: (Remember) on the day when you see it (the shaking), all women who breastfeed their children will be negligent towards the child they suckle, and every woman who is pregnant will have a miscarriage, and you will see people in a drunken state, even though they are not drunk , but the punishment of Allah is very severe. (al-hajj\/22: 2)"
		   },
		   {
			"id": 2775,
			"surah": 23,
			"ayat": 102,
			"tafsir": "This verse explains that people whose scales of good deeds are heavy, namely people who believe and do good deeds in the world, are lucky and happy people. On the Day of Resurrection, before a person's fate is determined, whether he is put into heaven or hell, he will first be brought to court which will give the fairest decision. There will be no cheating in the judicial process because God himself will be the judge. Unlike the case with courts in this world, people who are guilty are sometimes found not guilty, because they are clever in crossing their tongues, twisting the situation or because of the cunning of their defenders, so that the judge becomes fooled. And vice versa, it is possible for an innocent person to be found guilty because he is unable to pay for an intelligent lawyer and so on. Every decision in the world that is unfair will be countered again and will be decided once more in the afterlife as fairly as possible. All related matters that have not been completed in this world will be resolved later in the afterlife as fairly as possible. After going through the court process and each related matter has been resolved, to find out the level of goodness and evil of each, a scale is held, as explained in the word of Allah: And We will set the right scale on the Day of Resurrection, so no one will be harmed even a little . (al-Anbiya'\/21: 47) Whoever is heavy in the balance of his good deeds, he is happy. In line with verse 102 this is the word of Allah: So as for someone whose scales (goodness) are heavy, then he is in a satisfying (happy) life. (al-Qari'ah\/101: 6-7)"
		   },
		   {
			"id": 2776,
			"surah": 23,
			"ayat": 103,
			"tafsir": "In this verse Allah explains the loss of people whose scales of goodness are light. When they were still in the world, they did a lot of immorality according to the will of their lusts. They deny Allah's verses which render their deeds worthless in the hereafter, as Allah says: They are those who deny their Lord's verses and (do not believe) in meeting Him. So their deeds are in vain, and We will not weigh them (charity) on the Day of Resurrection. (al-Kahf\/18: 105) They will eternally be in Hell. In line with verse 103, Allah says: And as for those whose scales (goodness) are light, then the place of their return is the Hawiyah hell. (al-Qari'ah\/101: 8-9) Not so! Whoever does bad, and his sin has drowned him, then they are residents of hell. They live in it. (al-Baqarah\/2: 81)"
		   },
		   {
			"id": 2777,
			"surah": 23,
			"ayat": 104,
			"tafsir": "In this verse Allah explains that those who are put into hell will be burned with fire so that their faces look very ugly and disfigured. His flesh crumbled, melting down to his feet. They complain about the punishment that befell them, and are aware of what they did while still in the world, as Allah says: And if they were to befall even a little of your Lord's punishment, they would surely say, \"Woe to us! Indeed, we are of those who always wrong (themselves).\" (al-Anbiya'\/21: 46) If the disbelievers knew, when they were unable to avoid the fires of hell from their faces and backs, while they did not receive help (certainly they did not ask for haste). (al-Anbiya'\/21: 39)"
		   },
		   {
			"id": 2778,
			"surah": 23,
			"ayat": 105,
			"tafsir": "In this verse Allah explains that various mocking questions are asked to the inhabitants of hell. This reminded them again that the apostles had been sent to guide them, and heavenly books were sent down to be their guide, so that there would be no more reason for them to disobey and obey the teachings brought by the apostles, as God said. : So that there is no reason for humans to argue against God after the messengers were sent. (an-Nisa'\/4: 165) And His words: But We will not punish before We send an apostle. (al- Isra'\/17: 15) But they denied the verses of Allah and did not believe in them in the slightest, even the apostles who were sent to them were tortured and abused. In line with verse 105 of this verse, the word of God: Almost exploded with anger. Every time a group (unbelievers) are thrown into it, the guards (of hell) ask them, \"Has no one ever come to warn you (in the world)?\" They replied, \"Yes, indeed, a warner has come to us, but we deny (it) and we say, \"Allah did not send down anything, you are actually in great error.\" (al-Mulk\/67: 8 -9)"
		   },
		   {
			"id": 2779,
			"surah": 23,
			"ayat": 106,
			"tafsir": "In this verse Allah explains the recognition of the inhabitants of hell for their error, even though messengers have been sent to them to guide them, and divine books have been sent down to be their guide. However, they have been defeated by their evil, and controlled by their passions, so there is no way for them to do good and avoid going astray. In line with this verse the word of God: Then we confess our sins. So is there a way (for us) to get out (of hell)? (al-Mu'min\/40: 11)"
		   },
		   {
			"id": 2780,
			"surah": 23,
			"ayat": 107,
			"tafsir": "This verse explains the plea of the inhabitants of hell to Allah, namely that they be removed from hell and returned to the world. They promised that if their request was granted, they would change their disbelief to faith and obey everything that Allah commanded them. If they still continue to commit immorality as before, then they are truly persecuted people and they deserve a very painful punishment and torment."
		   },
		   {
			"id": 2781,
			"surah": 23,
			"ayat": 108,
			"tafsir": "This verse explains God's answer to the request of the inhabitants of hell to be returned to the world to atone for the mistakes and sins they have committed. Allah confirms to them that they will remain in hell, huddled in a lowly state and have no self-esteem at all. They must be silent and not continue their conversation with Allah and not repeat their actions because it is impossible for them to be returned to the world."
		   },
		   {
			"id": 2782,
			"surah": 23,
			"ayat": 109,
			"tafsir": "In this verse, Allah explains the reasons why they were tortured and punished, as well as the humiliating answer to their request to return to the world. This insult arose because they insulted God's faithful servants, such as Bilal, Khabbab, shuhaib and other weak believers, always drawing closer to Allah, confirming their pledge and acknowledgment of their faith in Him, justifying the apostles whom He has sent, always ask forgiveness and ask Him for mercy because He is the best giver of mercy. The disbelievers face the believers with ridicule, ridicule and contempt. This verse also explains that the activities of the disbelievers mock and laugh at the believers, making them forget to remember Allah. In line with this verse, Allah says: Indeed, those who sin, are those who used to laugh at those who believe. And when they (the believers) pass in front of them, they wink at each other, and when they return to their people, they return with joy. And when they see (the believers), they say, \"Surely they are truly astray,\" even though (the sinners), they were not sent as guardians (the believers). (al-Muthaffifin\/83: 29-33)"
		   },
		   {
			"id": 2783,
			"surah": 23,
			"ayat": 110,
			"tafsir": "In this verse, Allah explains the reasons why they were tortured and punished, as well as the humiliating answer to their request to return to the world. This insult arose because they insulted God's faithful servants, such as Bilal, Khabbab, shuhaib and other weak believers, always drawing closer to Allah, confirming their pledge and acknowledgment of their faith in Him, justifying the apostles whom He has sent, always ask forgiveness and ask Him for mercy because He is the best giver of mercy. The disbelievers face the believers with ridicule, ridicule and contempt. This verse also explains that the activities of the disbelievers mock and laugh at the believers, making them forget to remember Allah. In line with this verse, Allah says: Indeed, those who sin, are those who used to laugh at those who believe. And when they (the believers) pass in front of them, they wink at each other, and when they return to their people, they return with joy. And when they see (the believers), they say, \"Surely they are truly astray,\" even though (the sinners), they were not sent as guardians (the believers). (al-Muthaffifin\/83: 29-33)"
		   },
		   {
			"id": 2784,
			"surah": 23,
			"ayat": 111,
			"tafsir": "This verse emphasizes that Allah will reward the believers on the Day of Judgment, for their patience and fortitude in facing the ridicule and laughter of the disbelievers, as well as their obedience and obedience to His commands. Truly the believers, those are the victorious and lucky ones. In the afterlife, they will sit on the couches looking relaxed, laughing at the disbelievers who laughed at them before in this world. This is the reward for those who disbelieve for what they have done in the world, as Allah says: So today, those who believe who laugh at the disbelievers, they (sit) on couches looking away. Are the disbelievers given a reward (punishment) for what they have done? (al-Muthaffifin\/83: 34-36)"
		   },
		   {
			"id": 2785,
			"surah": 23,
			"ayat": 112,
			"tafsir": "After the request of the inhabitants of hell to be returned to the world was rejected by Allah with the affirmation that they would still curl up in hell and so that they would not beg Him, they were asked again how long they had lived on earth, from the time they were born until they left this mortal world for the afterlife."
		   },
		   {
			"id": 2786,
			"surah": 23,
			"ayat": 113,
			"tafsir": "Because of the magnitude of the impact of the disaster that befell the inhabitants of hell and the severity of the torment and doom they suffer, those poor people can no longer remember how long they have lived in this world. They feel very briefly, they even think that they only live in this world for one day or less than one day compared to the afterlife. In this verse Allah encourages them to ask how long they have lived in this world."
		   },
		   {
			"id": 2787,
			"surah": 23,
			"ayat": 114,
			"tafsir": "This verse explains that they did stay in the world only for a short time. If they realized this when they lived in the world, while the life they will face in the hereafter is a life that has no limits, they would certainly do things that are beneficial and in accordance with what Allah has commanded. However, they neglect to realize it, so they deserve punishment from Allah. The Prophet said: When Ibn Abi Hatim narrated from Aiqa' bin Abd al-Kalai, the Prophet said that when the inhabitants of heaven have entered heaven and the inhabitants of hell have gone to hell; Allah said, \"O inhabitants of heaven! How long did you live in this world?\" They replied, \"We live in the world for only a day or not for a day.\" Allah said, \"It would be nice if you all invested that day, or not until that one day. You all obtained My mercy, My pleasure and My heaven. All of you will stay in heaven forever.\" After that Allah said, \"O inhabitants of hell! How long will you live in this world?\" They replied, \"We live in the world for only a day or not for a day.\" Allah said, \"How bad it is for you to invest a day's time or not until that one day. You accept My wrath and enter My hell. Stay in hell forever.\""
		   },
		   {
			"id": 2788,
			"surah": 23,
			"ayat": 115,
			"tafsir": "This verse explains that the denial of the inhabitants of hell about the existence of the resurrection day is related to their belief that life ends with death, so Allah needs to remind them with the question, \"Did they think that We created them playing games, left like animals, not rewarded and not punished? Or do they think that they will not be returned to Us?\" No, again not. They were created as servants of Allah and given obligations. Those who fulfill their obligations will be rewarded, and those who neglect their obligations will be punished and returned to Allah to account for all their actions in the world, according to Allah's word: Does man think that he will be left alone? (Without accountability?) (al-Qiyamah\/75: 36)"
		   },
		   {
			"id": 2789,
			"surah": 23,
			"ayat": 116,
			"tafsir": "This verse explains that Allah is Most Holy from what the polytheists accuse Him of, as well as the notion that He created humans in vain, because He is the true God. There is no god but Him, God who has a 'noble Throne. He is the one who rules this universe, both above and below, as well as all of His creatures. Allah's Word: And We did not play in creating the heavens and the earth and what is between them. We did not create both except with the truth, but most of them do not know. (ad-Dukhan\/44:38-39)"
		   },
		   {
			"id": 2790,
			"surah": 23,
			"ayat": 117,
			"tafsir": "This verse explains that those who worship Allah and associate partners with Him with other gods, even though there is none worthy of worship except Allah, in essence there is no reason at all that can justify their actions. They will be presented before God, to account for and account for all their actions. Allah will complete the reward for their deeds. Indeed, those who disbelieve will not prosper forever, and will not escape the punishment that torments them."
		   },
		   {
			"id": 2791,
			"surah": 23,
			"ayat": 118,
			"tafsir": "This verse explains that after explaining the condition of the disbelievers, their ignorance in this world and the punishment that will be provided for them in the hereafter, Allah ordered His Messenger to ask Him to be forgiven for all the mistakes he has made, to be given mercy by accepting his repentance, and to be set free. from punishment for negligence and mistakes that have been done, because He is the Giver of the best mercy. Allah's command to His Messenger as mentioned above, is to be a good example for his people. Every time they make a mistake, so that they repent, and every time they commit an immorality, so that they quickly repent, do not let those mistakes and immoralities pile up, because that will become a heavy burden in the Hereafter."
		   }
	]
}
