{
	"tafseer": [
		{
			"id": 4736,
			"surah": 52,
			"ayat": 1,
			"tafsir": "This verse states that Allah swt swears by the ath-thurs who are high in position because on these ath-thurs Allah has spoken with the Prophet Musa and sent down the book of the Torah to him which contains laws, wisdom, and manners and is easy for humans to read. Ath-thur means hill, namely Thursina Hill, which is a hill in Madyan where the Prophet Musa listened to the words of Allah SWT. Ath-thur in Syriac also means a hill with lots of trees, the place where God spoke directly to the Prophet Musa and where he was appointed as an apostle. It is called ath-thur because there are many trees, if there are no trees, then it is not called ath-thur, but Jabal (mountain). God uses mountains as His oath of course because of the importance of mountains in the occurrence of life on this earth. Regarding mountains and their roles, this can be seen in the discussion of the following verses, Luqman\/31: 10 and an-Naml\/27: 88. Further discussion can also be seen in an-Naba'\/78: 6-7 and an-Nazi' at\/79: 30-32."
		   },
		   {
			"id": 4737,
			"surah": 52,
			"ayat": 2,
			"tafsir": "Then Allah swt swears by a written book (beautifully written) with a neat arrangement of letters. There are those who think that the meaning is the Lawh Mahfudz, and there are also those who think that the meaning of a book that is written beautifully is that which was revealed and read to people openly."
		   },
		   {
			"id": 4738,
			"surah": 52,
			"ayat": 3,
			"tafsir": "Furthermore, Allah SWT explains in this verse that the books are easy for everyone to learn their contents. The books contain wisdom, law, culture and character (akhlak); for they were written on open pages which could be read. ("
		   },
		   {
			"id": 4739,
			"surah": 52,
			"ayat": 4,
			"tafsir": "In this verse, Allah swt swears by al-Baitul-Ma'mur, which is a house in the seventh heaven that 70 thousand angels enter every day for tawaf or prayer. They have gone in there not coming back for ever. This is confirmed in the Isra' hadith, namely: \"It is found in Sahih al-Bukhari and Sahih Muslim that the Messenger of Allah said in a hadith about Isra' after passing the seventh heaven, then I was appointed to Baitulma'mur, suddenly there I saw 70,000 angels entering every day and they will not come back after that (Al-Bukhari and Muslim) The meaning of the hadith above is that the angels worship and perform tawaf there (Baitulma'mur) just like humans on earth, perform tawaf in the Kaaba Mecca. That's the state of the angels. Then Qatadah, Rabi 'bin Anas and as-Suddi said, that the Messenger of Allah said one day to his companions: \"Do you know what Baitulma'mur is? They replied, \"Allah and His Messenger know better.\" The Prophet said, \"Baitulma'mur is a mosque in the sky that is in the direction of the Kaaba and if (someone from there) falls, it will fall on the Kaaba, there 70,000 angels pray every day; when they leave there, they will not come back.\" (History of Ibn Jarir)"
		   },
		   {
			"id": 4740,
			"surah": 52,
			"ayat": 5,
			"tafsir": "In this verse, Allah swt swears by a raised roof (sky), namely a high realm that has several suns, several months, fixed stars, and rotating stars. There also lies the Throne and His chair; so are His angels (who never refuse Allah's commands and always obey what Allah commands them). There are also innumerable natural objects that only Allah swt knows about, and Allah's armies whose essence we also do not know except He who created them. In the word of Allah swt explained: And no one knows the army of your Lord except He alone. (al-Muddatstsir\/74: 31) Sufyan ats-sauri, Syu'bah and Abdul Ahwas narrated from Simak from Harb from Khalid bin Ar'arah from 'Ali that As-Saqful Marfu' means 'sky. Sufyan recited Allah's word as follows: And We made the sky a sheltered roof. (alAnbiya'\/21: 32) The meaning is that the sky is a roof and what is meant by \"being looked after\" is that everything in the sky is guarded by Allah SWT with rules and laws that cause everything to run in an orderly and orderly manner, according to the system and the law."
		   },
		   {
			"id": 4741,
			"surah": 52,
			"ayat": 6,
			"tafsir": "In this verse Allah swears, By al-Bahrul-Masjur (the sea in which there is fire), namely the sea that is restrained from flooding because if the sea is released, it will drown everything on the earth so that all animals and plants will be gone. destroyed. Then the rules of nature are broken and there is no natural wisdom to be made. Some scholars are of the opinion and stipulate that the entire layer of the earth is like a watermelon, and the skin is like a watermelon skin, which means that the ratio of the skin of the earth and the fire that is in the skin is like the skin of a watermelon with its contents, which is eaten. That's why now we are actually on a great fire, that is, on the sea which is full of fire underneath and the sea is covered with the skin of the earth from all sides. From time to time the fire rises above the sea which is seen in earthquakes and when volcanoes erupt; like the volcano Visofius which erupted in Italy in 1909 AD which swallowed the city of Mozaina, and this earthquake which occurred in Japan in 1952 AD which destroyed its cities at once. According to Jumhur, what is meant in this verse is the earth's sea. However, they differ in opinion that the word \"masjur\" is of the opinion that it means: lit a fire on the Day of Judgment as in the Qur'an: And when the seas are overflowed. (al-Infithar\/82: 3) His other words: And when the oceans are heated. (at-Takwir\/81: 6)"
		   },
		   {
			"id": 4742,
			"surah": 52,
			"ayat": 7,
			"tafsir": "Then Allah swt mentioned the contents of the oath that the doomsday of the Day of Judgment is intended for all those who deny the apostles. The doom will definitely happen, without the slightest doubt. Affirmation about the certainty of the coming of doom is very important to dispel doubts among people who doubt the event of the doom."
		   },
		   {
			"id": 4743,
			"surah": 52,
			"ayat": 8,
			"tafsir": "Allah explained that no one can resist this punishment. And there is also no way to get out of this doom which is a reward for those who have tarnished themselves with acts of shirk and sin, and who have stained their souls with lies against the apostles and the day of resurrection. Then it is also explained in this verse that the punishment that cannot be avoided will occur one day when the sky shakes in its place."
		   },
		   {
			"id": 4744,
			"surah": 52,
			"ayat": 9,
			"tafsir": "Allah explained that no one can resist this punishment. And there is also no way to get out of this doom which is a reward for those who have tarnished themselves with acts of shirk and sin, and who have stained their souls with lies against the apostles and the day of resurrection. Then it is also explained in this verse that the punishment that cannot be avoided will occur one day when the sky shakes in its place."
		   },
		   {
			"id": 4745,
			"surah": 52,
			"ayat": 10,
			"tafsir": "In this verse, Allah adds his explanation that on the Day of Resurrection, mountains will move from their places, travel like clouds, and fly into the air and then fall to the earth in pieces, then crumble into dust like feathers that the wind blows. The shaking of the heavens and the flying of the mountains is a notification and a warning to humans that they will not be able to return to this world, because it has been destroyed and a new world has emerged, namely the hereafter. The verse above relates to the description of the time of the end of the world, which is also mentioned in many other verses. Mountains that express the land or the earth's crust are described as changing places or in other words the mountains are moving. The movement of these mountains is a manifestation of the movement of the earth's plates (see an-Naml\/27: 88) and can cause earthquakes. In surahh az-Zalzalah\/99: 1-4 the events of the apocalypse are described by the arrival of a terrible earthquake. This powerful earthquake can cause long and deep cracks which are not impossible to trigger volcanic eruptions. For example, when the Nias earthquake occurred in 2005 with a magnitude of Mw=8.7, after the 2004 Aceh earthquake, several volcanoes on the island of Sumatra showed increased activity. Scientific facts do show that the mountains move. Global Positioning Systems (GPS) data record these movements in millimeters. An example is the outermost islands to the west of Sumatra which move northeast by 50-60 mm\/year."
		   },
		   {
			"id": 4746,
			"surah": 52,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains to whom the punishment will be meted out after the heavens shake and the mountains fly, that is, liars who wallow in falsehood and always reject the truth and do not remember the day of reckoning and are never afraid of God's punishment."
		   },
		   {
			"id": 4747,
			"surah": 52,
			"ayat": 12,
			"tafsir": "In this verse, Allah explains to whom the punishment will be meted out after the heavens shake and the mountains fly, that is, liars who wallow in falsehood and always reject the truth and do not remember the day of reckoning and are never afraid of God's punishment."
		   },
		   {
			"id": 4748,
			"surah": 52,
			"ayat": 13,
			"tafsir": "In this verse Allah explains that those who committed these crimes, on that day they were rebuked and pushed by force into the Hellfire, whose fire always burns and burns. ("
		   },
		   {
			"id": 4749,
			"surah": 52,
			"ayat": 14,
			"tafsir": "After they were close to hell, the guards confirmed with ridicule, \"This is the hell, which you denied on earth.\" Their lying about hell means their lying against the messenger who has brought news about hell, with the revelation that has been sent down to him."
		   },
		   {
			"id": 4750,
			"surah": 52,
			"ayat": 15,
			"tafsir": "Because of that in this verse Allah mocks them, namely the polytheists who when in the world considered Muhammad a sorcerer who bewitched their minds and closed their eyes. Allah swt mocks them when they are punished in the hereafter. \"Is what they see with their eyes now, like the doom that was announced to them in that world, or are they still lulled by magic as they used to think that Muhammad saw bewitched them in this world, or do their eyes see nothing?\" Indeed, the doom has come true, their eyes are not touched by magic nor are they covered. Is it clear that there is doubt in their vision or is their eye sore? No, neither of them, what they saw was the true reality."
		   },
		   {
			"id": 4751,
			"surah": 52,
			"ayat": 16,
			"tafsir": "When they cannot deny the fact and admit that it is not magic and is not the result of a wrong view, Allah swt orders them to enter the fires of hell to feel the heat of the fires of hell. Then Allah swt explained that being patient or not, the situation is similar for them. Because someone is impatient with something, he tries to reject it either by staying away from it or by overcoming it. However, the day of resurrection is different, because the punishment in the hereafter is not the same as the punishment in the world because the person who is punished in the world, if he is patient, he will benefit from his patience, both the benefits in the form of rewards in the hereafter and praise in this world regarding patience and his fortitude. And if he is impatient with the understanding of complaining, he will be reproached and considered childish. However, patience in the hereafter is of no use because the hereafter is not a place to do charity but to get rewards and retribution. At the end of this verse, Allah swt confirms that humans will receive vengeance from Allah. If their deeds in this world are good, they will receive good rewards in the hereafter. And if their deeds in the world are evil, they will receive a reward in the hereafter according to their crimes. Allah says: And your Lord does not wrong anyone. (al-Kahf\/18: 49) Strictly speaking Allah will reward everyone according to his deeds. The reply will be accepted whether you are patient or not, it will definitely be done."
		   },
		   {
			"id": 4752,
			"surah": 52,
			"ayat": 17,
			"tafsir": "In this verse Allah explains that those who are afraid of the wrath of their Lord, they carry out worship of Him either openly or not, fulfill their obligations to God, and carry out religious regulations, do not carry out an act of immorality, that is, do not stain themselves with sin and do not stained his soul with hypocrisy. To them God rewarded heaven, in which they had fun. They got what they had never seen, they had never heard of, and no human had ever explained. All of that in return for their good deeds while living in the world. They stay away from worldly luxuries that make them negligent in worship and are patient with the trials that befall them in the hope of gaining the pleasure of Allah. ("
		   },
		   {
			"id": 4753,
			"surah": 52,
			"ayat": 18,
			"tafsir": "In this verse it is described that they feel full of joy and happiness because of the grace and gifts bestowed upon them by Allah. They are never bothered by all kinds of anxieties or overcome by feelings of tiredness. They were truly in great pleasure and enjoyment and delicacy, their faces beaming, cheerful and joyful. They have been saved by their Lord from punishment. They now feel all the pleasures and far from misery. That is true pleasure and eternal pleasure."
		   },
		   {
			"id": 4754,
			"surah": 52,
			"ayat": 19,
			"tafsir": "In this verse Allah allows them to eat and drink what is available in the form of all delicious food and drink. They no longer worry about the dangers that will befall them like what they see in the world about the dangers of food and drink. All of that in return for all their good deeds and in return for their sincerity in the world in serving Allah swt. They really feel good in the hereafter. It is narrated that Rabi' bin Hisham prayed all night. Then someone asked him why he was tiring himself like that. Then the answer is that he needs rest in the afterlife. In the same verse, Allah says: (It is said to them), \"Eat and drink with pleasure because of the deeds you have done in the past days.\" (al-hujurat\/49: 17) The word hani'an in this verse means the enjoyment of food and drink and the avoidance of anything harmful. People who eat in this world sometimes bring illness and other things, so they are less calm and less comfortable eating. Or he is afraid that the food will run out soon so he has to look for it again. Or because it runs out, then you have to cook it again until it's cooked and can be eaten. Such things will not be found in heaven. The words \"bima kuntum ta'malun\" in this verse mean in return for what you have done in the world, this is a sign that Allah has fulfilled what He has promised in the world, because there are no favors in the world that can be obtained without difficulty. formerly. Unlike the case with favors in the afterlife. Favors in the hereafter as a reward for faith and good deeds in the world as explained by Allah in His word: They feel they have served you with their Islam. Say, \"Do not feel you have merited me with your Islam, in fact Allah is the one who bestows favors on you by showing you to faith, if you are a righteous person.\" (al-hujurat\/49: 17)"
		   },
		   {
			"id": 4755,
			"surah": 52,
			"ayat": 20,
			"tafsir": "Then Allah mentions what they enjoy, for example their mattresses (couches). They sat on the sofas lined up casually without anything weighing on their hearts. There was not a single problem that they had to face at that time, because anyone who sits while he is facing a problem or is burdened by a problem means that his mind and heart are not at peace. In this verse, the words yajlis (sit down) are used, not the words yattaki'u (sit down). With the intention to describe the sitting state of a person who is filled with contentment and peace. So the situation in heaven shows a state of calm, without trouble, without burden and without problems. In the same verse the meaning says: Sitting face to face on the couches. (al-hijr\/15: 47) Sitting relaxed is just an expression as an example of true freedom in heaven as said by the Prophet Muhammad: \"A person in heaven sits relaxed for 40 (forty) years without moving and not being bored.\" , come to him (without trying) what is desired by him and pleasing to his eyes.\" (History of Ibn Abi Hatim) Then it was explained that they were there enjoying their spouses. Allah has given them beautiful wives who have sharp eyes."
		   },
		   {
			"id": 4756,
			"surah": 52,
			"ayat": 21,
			"tafsir": "In this verse, Allah SWT explains that those who believe who are followed by their children and grandchildren in faith, Allah will meet in the same level and position as a gift from Allah to them even though the descendants have not yet reached that degree in their deeds. So that their parents are happy, then their joy is complete because they can all gather together. When reading verse 21 of this, Ibn 'Abbas said that the descendants of the descendants of the believers will be elevated by Allah swt in rank if it turns out that their level is lower than that of their parents. Then Allah swt gives a description of the situation in heaven full of pleasures such as the availability of their food in heaven. Any fruit or food they want they will get according to their taste. Then described how they live happily there. They were fighting over each other's drinks, drinking in moderation, talking about funny things, where they were served by very friendly and beautiful waitresses. They also talked about their affairs in the world before they were in the pleasures and luxuries of heaven. It was narrated that the Messenger of Allah said: When a person enters paradise, asks his parents, his wife and their children, then he will be told: \"They have not reached your degrees and deeds.\" So he said: \"O my Lord, I have done good for me and for them\". So (God granted his request) they (parents, wife, children) were ordered to join him.\" (History of Ibn Mardawaih and ath-Thabrani from Ibn 'Abbas) their father because you also get the grace of Allah swt with the blessing of their children and grandchildren as the words of the Prophet Muhammad saw: Verily Allah swt undoubtedly raises the rank of a servant, then he asked, \"O my Lord, how did I get this degree?\" Allah replied, \"You got it because of your child's prayer.\" (Ahmad and al-Baihaqi's history from Abu Hurairah) From Abu Hurairah that the Messenger of Allah said, \"When a child of Adam dies, then his deeds will be cut off except for three: charity jariah, or knowledge that is beneficial or a pious child who prays for him .\"(Muslim history from Abu Hurairah) Then in this verse Allah explains again that the reward of the good deeds of pious fathers is not reduced even though the position of the child and their believing wives are elevated to their rank to be equal to their husbands\/fathers as a gift from Allah swt. At the end of this verse, Allah confirms that everyone is only responsible for their own deeds and actions. The sins of the wife or child are not the responsibility of the father\/husband, nor are the sins committed so that they are not borne by the child or wife. It needs to be emphasized that it is a basic principle. But Allah gives many gifts to parents who believe and do good deeds by increasing the happiness of the parents to fulfill the parents' wish to gather in heaven with their children, wives and grandchildren, as long as they believe, even though their rank is lower, Allah raises them to be the same as the father who was a believer and pious earlier. If the child is happy to go to heaven and longs to be with his parents, then Allah bestows His gifts on him, lifting up his believing parents to find happiness with their children in heaven. Such God's gift does not change the principle that everyone is only responsible for their own actions, although there are still other exceptions, such as the word of Allah SWT: Everyone is responsible for what he has done, except for the right group. (al-Muddatstsir\/74: 38-39) Everyone will be held accountable for their actions before Allah swt. That responsibility will not be separated from them except for the right group, namely people who do good. They are the ones who will be released from responsibility because of their obedience to worship Allah SWT."
		   },
		   {
			"id": 4757,
			"surah": 52,
			"ayat": 22,
			"tafsir": "Furthermore, in this verse Allah mentions that He adds to the pleasures of the inhabitants of heaven from time to time with what they want, such as providing various kinds of delicious fruits and meat, even if they don't ask for it. Why did Allah swt mention fruits and meat, did not mention various other types of food because fruits and meat are foods that are liked and contain the nutrients needed for the body and are very popular in the world. So God gives everything that is human pleasure"
		   },
		   {
			"id": 4758,
			"surah": 52,
			"ayat": 23,
			"tafsir": "In this verse, Allah swt describes their joy in heaven, that is, they each take their glass of drink. They sat toasting their friends, joking around as it happens in a group of friends, to show how much fun they had. Alcohol in the hereafter does not intoxicate like alcohol in this world, nor does it cause people to ramble or get drunk like drinkers in this world. Allah swt has explained in another verse, namely about khamr in the hereafter and the delicious taste of food, namely the verse that reads in His word: (the color is) white and clean, the taste is delicious for those who drink. There is nothing in it (element) that intoxicates and they are not intoxicated by it. (as-shaffat\/37: 46-47) And His words: They are not dizzy because of it and are not drunk. (alWaqi'ah\/56: 19)"
		   },
		   {
			"id": 4759,
			"surah": 52,
			"ayat": 24,
			"tafsir": "This verse explains that the inhabitants of heaven are surrounded by young servants who bring drinks. The servants were always ready to be ordered. They are handsome and beautiful like pearls that glitter beautifully and are hidden in hidden places. In the same verse Allah explains: They are surrounded by young people who are still young, carrying glasses, kettles and shot glasses (goblets) filled with drinks taken from running water. (al-Waqi'ah\/56: 17-18) Related to this verse Qatadah said, \"I heard that the Messenger of Allah was asked about the servants of heaven who are like pearls, so what about those who are served?\" The Messenger of Allah said: \"By Allah that the difference in strength between them, is like the advantage of the full moon night over all the stars.\" (History of Ibn Jarir and Ibn Mundhir) It is narrated that the lowest rank in heaven is a person who, when he calls his servant, a thousand servants come to stand at his door, answering. Labbaik, labbaik (yes . . . yes . . . ).\""
		   },
		   {
			"id": 4760,
			"surah": 52,
			"ayat": 25,
			"tafsir": "In this verse, Allah swt explains that the inhabitants of heaven come to each other, both fathers, mothers and their families who believe in the world and also with other residents of heaven, asking about their condition in the world before, which includes worship or about various efforts to nahi munkar because they are afraid of the punishment of Allah swt while living in the world. Then they praise Allah SWT who has removed their sadness, grief, sorrow and anxiety. They in heaven will no longer feel the hardships and difficulties of earning a living or seeking sustenance and all things related to life. They just live to enjoy various pleasures. It was narrated that Anas said as follows: The Messenger of Allah said, \"When the inhabitants of heaven have entered paradise and they miss their friends, then someone's sofa comes closer until it faces another sofa, both of them sit relaxed while chatting and discussing their deeds in the world before. So one of them said, \"Hey so and so, do you know on what day God forgives us? On the day in place, where we pray to Allah then we are forgiven by Him.\" (History of al-Bazzar)"
		   },
		   {
			"id": 4761,
			"surah": 52,
			"ayat": 26,
			"tafsir": "Then in this verse Allah swt details questions and answers about the various pleasures they enjoy. They said that in fact they were in the world, at that time in the midst of their families there was fear of Allah's punishment and its torment. Then Allah eliminates that fear by bestowing His blessings on them, namely they are preserved from the fires of hell which are called as-samum. Their feelings of fear in this world about Allah's punishment pushed them to do all of Allah's commands and stay away from all of His prohibitions even though they were in the midst of their family, they found peace. It was narrated that Aisyah said, \"If Allah opened hell on this earth with just the tip of a finger, then the earth and all its contents would burn up.\""
		   },
		   {
			"id": 4762,
			"surah": 52,
			"ayat": 27,
			"tafsir": "Then in this verse Allah swt details questions and answers about the various pleasures they enjoy. They said that in fact they were in the world, at that time in the midst of their families there was fear of Allah's punishment and its torment. Then Allah eliminates that fear by bestowing His blessings on them, namely they are preserved from the fires of hell which are called as-samum. Their feelings of fear in this world about Allah's punishment pushed them to do all of Allah's commands and stay away from all of His prohibitions even though they were in the midst of their family, they found peace. It was narrated that Aisyah said, \"If Allah opened hell on this earth with just the tip of a finger, then the earth and all its contents would burn up.\""
		   },
		   {
			"id": 4763,
			"surah": 52,
			"ayat": 28,
			"tafsir": "In this verse, Allah SWT explains that the residents of heaven have fulfilled the requirements of Allah and His Messenger so that they will receive this glory. They say that they used to worship Allah and supplicate Him. So Allah allows and grants their request and accepts their worship, because Allah is the bestower of goodness, and the giver of gifts, the Most Merciful. Every believer and every disbeliever will never forget what they have done in this world. The enjoyment of those who believe will increase when they see that they have moved from the prison of this world to the pleasures of the hereafter, and from narrowness to spaciousness. . Conversely, the torment of an infidel increases when he sees that he has moved from the luxuries of this world to the realm of suffering and the misery of hell in the hereafter."
		   },
		   {
			"id": 4764,
			"surah": 52,
			"ayat": 29,
			"tafsir": "In verse 29 Allah swt ordered the Prophet Muhammad to continue to give warnings to his people, by teaching them the verses of Allah regardless of their actions which do not contain the truth. Allah confirms that His servant named Muhammad is not a soothsayer and not a madman. Meanwhile, the disbelievers accused the Prophet Muhammad of being a sorcerer because he gave many occult news about the past. The people for whom the previous prophets fought also gave news of things to come such as the Day of Judgment, the day of resurrection and the day of judgment (yaumulhisab) and about heaven and hell. These occult messages are a truth received from Allah. So it is clear that the Prophet was not a soothsayer who conveyed things that were not true. The disbelievers also accused the Prophet of being mad because he stated and taught that there is only one God, while they think that their God, who is four in number, has many world problems that are not resolved. If there is only one God then the world can no longer be maintained, they say. Some Western orientalists claim that the Prophet had epilepsy (epileptic seizures), such as when he received a revelation, he suddenly became silent and did not pay attention to his surroundings, like someone who has had an epileptic seizure. But in this verse 29 Allah confirms that Muhammad saw was not crazy as alleged by the infidels. The Prophet Muhammad was a servant of Allah who was appointed as an apostle, had a sound mind, high ideals, noble character and behavior. Whereas in verse 30 the disbelievers still accuse the Prophet of being a poet because the verses of the Al-Qur'an are very beautiful in language, the arrangement of sentences and the choice of words are extraordinary. Ordinary poets possessed an exquisite capacity for language and used to construct sentences and choose their words unlike ordinary humans. According to them poets often met death by accident. Therefore they are always waiting for the accident that will befall Muhammad. In this verse Allah swt confirms that the Prophet was not a poet. The beautiful language, the arrangement of sentences and the extraordinary choice of language in the verses of the Qur'an because these verses are the words of Allah revealed to the Prophet Muhammad and Allah will always protect His Prophet. Allah's Word: O Messenger! Convey what your Lord has revealed to you. If you don't do (what was ordered) it means you are not conveying His message. And Allah keeps you from (disturbing) humans. Indeed, Allah does not guide the disbelievers. (al-Ma'idah\/5: 67)"
		   },
		   {
			"id": 4765,
			"surah": 52,
			"ayat": 30,
			"tafsir": "In verse 29 Allah swt ordered the Prophet Muhammad to continue to give warnings to his people, by teaching them the verses of Allah regardless of their actions which do not contain the truth. Allah confirms that His servant named Muhammad is not a soothsayer and not a madman. Meanwhile, the disbelievers accused the Prophet Muhammad of being a sorcerer because he gave many occult news about the past. The people for whom the previous prophets fought also gave news of things to come such as the Day of Judgment, the day of resurrection and the day of judgment (yaumulhisab) and about heaven and hell. These occult messages are a truth received from Allah. So it is clear that the Prophet was not a soothsayer who conveyed things that were not true. The disbelievers also accused the Prophet of being mad because he stated and taught that there is only one God, while they think that their God, who is four in number, has many world problems that are not resolved. If there is only one God then the world can no longer be maintained, they say. Some Western orientalists claim that the Prophet had epilepsy (epileptic seizures), such as when he received a revelation, he suddenly became silent and did not pay attention to his surroundings, like someone who has had an epileptic seizure. But in this verse 29 Allah confirms that Muhammad saw was not crazy as alleged by the infidels. The Prophet Muhammad was a servant of Allah who was appointed as an apostle, had a sound mind, high ideals, noble character and behavior. Whereas in verse 30 the disbelievers still accuse the Prophet of being a poet because the verses of the Al-Qur'an are very beautiful in language, the arrangement of sentences and the choice of words are extraordinary. Ordinary poets possessed an exquisite capacity for language and used to construct sentences and choose their words unlike ordinary humans. According to them poets often met death by accident. Therefore they are always waiting for the accident that will befall Muhammad. In this verse Allah swt confirms that the Prophet was not a poet. The beautiful language, the arrangement of sentences and the extraordinary choice of language in the verses of the Qur'an because these verses are the words of Allah revealed to the Prophet Muhammad and Allah will always protect His Prophet. Allah's Word: O Messenger! Convey what your Lord has revealed to you. If you don't do (what was ordered) it means you are not conveying His message. And Allah keeps you from (disturbing) humans. Indeed, Allah does not guide the disbelievers. (al-Ma'idah\/5: 67)"
		   },
		   {
			"id": 4766,
			"surah": 52,
			"ayat": 31,
			"tafsir": "In this verse Allah swt confirms to Muhammad saw that he threatens them by inviting them to wait for the day of their destruction. Muhammad saw also stated that he was also waiting like them regarding the coming of a provision from God so that they would know who ended in goodness and who also won the victory in this world and in the hereafter. The arrogant attitude of unbelievers sometimes needs to be faced firmly. What's more, their accusations have indeed gone too far by declaring the Prophet to be a soothsayer, as a madman and so on, even though their opinions are only based on baseless prejudices. So it needs to be emphasized that the message of the Prophet is from Allah Almighty, therefore the Prophet does not need to be afraid to prove everything until the hereafter. ("
		   },
		   {
			"id": 4767,
			"surah": 52,
			"ayat": 32,
			"tafsir": "Then in this verse Allah swt questions whether the disbelievers use their common sense or only risk their lust and wishful thinking in throwing their strange and baseless accusations. The Prophet was not a poet, nor a sorcerer nor a madman. Their accusations are based solely on excessive hatred, so that they do not pay any attention to common sense."
		   },
		   {
			"id": 4768,
			"surah": 52,
			"ayat": 33,
			"tafsir": "In this verse, by using the question form, Allah explains the accusations of the disbelievers that the Prophet was considered to be making up things, stating something that the Prophet Muhammad himself had made up. The form of this question is an encouragement so that they think to find answers using common sense. The verses of the Al-Qur'an really fascinated them, both in terms of language and content, so that they said Muhammad was a poet or a soothsayer and they even considered him a madman, in fact they were amazed at the verses of the Al-Qur'an, but because they do not believe, they reject and deny the words of Allah and the prophethood of the Prophet Muhammad, so they just accuse them. Indeed, they face a dilemma with the greatness of the Qur'an but they also hate the Prophet Muhammad. So if someone does not get guidance from Allah SWT, suffers mentally in the world, and suffers physically and mentally in the hereafter."
		   },
		   {
			"id": 4769,
			"surah": 52,
			"ayat": 34,
			"tafsir": "Then in this verse Allah responds to their share of accusations against the Prophet Muhammad peace be upon him with a challenge to try to make up for what the Prophet said. If Muhammad saw was accused of being a poet, then among them there were many eloquent poets. If the Prophet was accused of being a sorcerer, weren't there also many skilled sorcerers among them? Or if he is accused of making things up, aren't there also many skilled orators among them who speak fluently with the beauty of their speech, and so on. So why are they, unable to make an expression like the Qur'an when they are indeed the ones who are right in their accusations. They even have expert figures who have great ability in speeches, poetry, and have a lot of experience working using poetry or prose language styles. They really know the history of the Arab nation more than Muhammad's knowledge? Even so, in fact they are still unable to make a surah like the Al-Qur'an even though they all work together as a group."
		   },
		   {
			"id": 4770,
			"surah": 52,
			"ayat": 35,
			"tafsir": "In this verse Allah confirms whether the disbelievers deny Allah as the Creator who made the universe, or they think that they were created that way without a creator. However, reason determines that everything that exists comes from nothing. This shows a proof that there is something that creates it, there must be someone who creates it. Or do they think that they themselves created them. Their opinion like this is certainly contrary to common sense, because every thing must have something that causes it to exist and that brings it about."
		   },
		   {
			"id": 4771,
			"surah": 52,
			"ayat": 36,
			"tafsir": "Then in this verse Allah also confirms by stating that they created themselves, do they also dare to say that they created this universe (the heavens and the earth), while in both of them there are all the causes of their life? They certainly cannot convince themselves and are not consistent with what they say, because if asked who made it and who made the heavens and the earth, they would surely say, \"It was Allah who made it.\" Indeed, if they believe, they will not deny the oneness of Allah."
		   },
		   {
			"id": 4772,
			"surah": 52,
			"ayat": 37,
			"tafsir": "Furthermore, it is stated in this verse in the form of a question, whether they act as rulers and in their hands is God's treasury. Then they bestowed the office of prophethood upon whom they wished and chose those they liked? Or are they people in power so they manage the affairs of the universe, then they make things according to their will and wishes? This is not the case. But Allah is the Almighty, who arranges and makes everything He wills. Narrated by Imam al-Bukhari from az-Zuhri, from Muhammad bin Jubair bin Mut'im his father said, \"I heard the Prophet Muhammad reciting surahh ath-thur during the Maghrib prayer. When it came to verses 35-37, my heart almost felt flying. And Jubair bin Muth'im had come to the Prophet Muhammad saw after the Battle of Badr in custody. At that time he was still a polytheist. Then he listened to this verse which finally he converted to Islam.\""
		   },
		   {
			"id": 4773,
			"surah": 52,
			"ayat": 38,
			"tafsir": "In this verse, Allah swt states with a questioning tone, do they have a ladder to go up to the sky, then they can listen to the words of the angels about the unseen matters revealed by Allah. Actually they only hold on to lust alone. They admit that, so they try to put forward a real proof, which explains the truth of their claim that rejects treatises like the proof that Muhammad brought from his Lord."
		   },
		   {
			"id": 4774,
			"surah": 52,
			"ayat": 39,
			"tafsir": "In this verse Allah swt asks them by saying whether they think God has daughters called angels, while they have sons, even though they know boys are more desirable than girls. In this verse Allah says: That is certainly an unfair division. (anNajm\/53: 2) This is a complete explanation that whoever thinks like that, it is clear that he is not one of those who have a sound mind."
		   },
		   {
			"id": 4775,
			"surah": 52,
			"ayat": 40,
			"tafsir": "In this verse, Allah swt asks them, is it necessary for Muhammad saw to ask for wages from polytheists, while Allah sent him to them to invite, confirm God and obey Him? If so, wouldn't the wages that Muhammad asked for be so burdensome for them that they could not fulfill Muhammad's call? This question broke their accusations, especially if the Prophet Muhammad asked them for a reward."
		   },
		   {
			"id": 4776,
			"surah": 52,
			"ayat": 41,
			"tafsir": "Furthermore, in this verse, Allah asks them whether they have magical knowledge that is unknown to humans, which they write for human needs? Then they tell it to humans all they want? It is not possible for them to have occult knowledge because no one knows the occult of the heavens and the earth except Allah. Qatadah said, this verse is a response to their words that they are waiting for the turn of the times (Muhammad's death before them). So Allah confirmed, whether they have knowledge about the unseen so that they know that Muhammad will die before them"
		   },
		   {
			"id": 4777,
			"surah": 52,
			"ayat": 42,
			"tafsir": "Then in this verse Allah swt said to them do they (the polytheists) want to deceive people and the Messenger with their words about the apostle and religion? If this is what they want, then their deceit will return to them."
		   },
		   {
			"id": 4778,
			"surah": 52,
			"ayat": 43,
			"tafsir": "Furthermore, in this verse Allah says to them, do they have a god other than Allah who helps them and keeps them from the torment of Allah swt. Glory be to Allah from what they associate with and from what they worship besides Him. These questions are offensive to disbelievers to find correct answers based on common sense. This is a strong condemnation of the polytheists, of their worship of idols as partners with Allah."
		   },
		   {
			"id": 4779,
			"surah": 52,
			"ayat": 44,
			"tafsir": "In this verse it is described that the polytheists are people who are arrogant and stubborn. Even though they were shown the signs of the doom that would befall them with the coming of a cloud that would bring disaster to them. But they took it lightly and only looked at it as a cloud that was playing and piled on top of each other. This is because their hearts are already closed and being dismissive of important matters has blinded their views. They still deny what they saw with their own eyes. In the same verse meaning Allah says: And if We open to them one of the doors of heaven, then they continue to climb on it, they will surely say, \"Indeed it is our sight that is obscured, even we are people affected by magic.\" (al-hijr\/15: 14-15)"
		   },
		   {
			"id": 4780,
			"surah": 52,
			"ayat": 45,
			"tafsir": "Then Allah ordered His Messenger to leave them in such a stubborn state, and not ignore them until a day came when they would be rewarded with destruction caused by their crimes, namely the Battle of Badr as said by al-Biqa'i according to dzahir verse this, or until the day of human resurrection in the hereafter comes, as Allah says: And the trumpet is blown, then all (creations) in the heavens and on earth die except those whom Allah wills. Then it is blown once again (the trumpet) so immediately they wake up (from their graves) waiting (God's decision). (azZumar\/39: 68)"
		   },
		   {
			"id": 4781,
			"surah": 52,
			"ayat": 46,
			"tafsir": "In this verse Allah explains that on that day it will not be of any use to them the tricks they have orchestrated against Muhammad (peace be upon him) to stir up the flames of enmity towards him. And they will not get help or assistance that can prevent Allah's punishment that befalls them"
		   },
		   {
			"id": 4782,
			"surah": 52,
			"ayat": 47,
			"tafsir": "Allah swt explains that disbelievers who wrong themselves with their disbelief and disobedience will get a painful punishment in the hereafter. In addition, even in this world they will receive punishment in the form of hunger for seven years before the Battle of Badr, and a major defeat in that war. However, most of them do not know that Allah will inflict His punishment on them both in this world and in the hereafter. In the same verse, Allah says: And surely We will inflict upon them some of the near punishment (in this world) before a greater punishment (in the hereafter); so that they return (to the right path). (as-Sajdah\/32: 21)"
		   },
		   {
			"id": 4783,
			"surah": 52,
			"ayat": 48,
			"tafsir": "After explaining various major situations, the apostle's heart grieved, due to the rebellious and stubborn actions of the disbelievers and polytheists who refused to believe in Allah and His messenger. So in this case, Allah ordered Muhammad to be patient with the disturbances of his people and no longer pay attention to them, and continue to deliver His orders and warn of His prohibitions, and convey what has been revealed to him, because Allah always sees him and pays attention to his work and keeps and protect it from the disturbances and hindrances of its enemies. Regarding glorifying and praising God when getting up and standing, includes three situations, namely: 1. When getting up from sleep 2. When getting up from sitting 3. When getting up to pray This contains wisdom so that the believer always glorifies at all times, in circumstances and conditions however, mainly changes from one state to another. Atha', Sa'id, Sufyan ats-sauri, and Abul Ahwas said: that the Prophet Muhammad glorified when he got up from his seat. Part of the hadith: From Abu Barzah al-Aslami said, Rasulullah saw at the end of his life, when he got up from his seat he said, \"Subhanaka Allahumma wabihamdika asyahadu an la ilaha illa anta astagfiruka wa atubu ilaika! You say a word that you have never said earlier. Rasulullah SAW said, \"This speech erases sins from mistakes that may occur at the majlis.\" sitting in one majlis namely: \"Glory to you, O Allah, by praising You, I testify that there is no God but You, I beg Your forgiveness and I repent to You.\" (History of Abu Dawud and an-Nasa'i)"
		   },
		   {
			"id": 4784,
			"surah": 52,
			"ayat": 49,
			"tafsir": "Then Allah in this verse ordered Muhammad peace be upon him to glorify Allah by praying at night. Because worship at that time was hard to carry out, and far from fun, and so he prayed when the stars set at dawn. In the same verse, Allah says: And part of the night, perform additional Tahajud prayers (as a form of worship): hopefully your Lord will raise you to a commendable place. (al-Isra'\/17: 79) The meaning of reading tasbih in this verse can mean reading tasbih as in the hadith above, it can also be interpreted as carrying out prayers, both Isha prayers, evening prayers and Subuh prayers."
		   }
	]
}
