{
	"tafseer": [
		{
			"id": 3607,
			"surah": 34,
			"ayat": 1,
			"tafsir": "This verse emphasizes that it is Allah who has the right to receive all praise because He is the One who created everything in the heavens and on earth. He is the real owner, no one partners with Allah in creating and owning it. Allah also arranges and manages it and bestows His gifts so that everything runs in an orderly and orderly manner. Therefore, there is nothing worthy of praise except Allah, nothing worthy of worship and prayer except to Allah. As for those who worship and adore statues or anything else, they are people who do not use reason. There is a lot of evidence that shows the existence and oneness of Allah in the earth and in the sky. If humans are willing to pay attention, they will certainly come to the conclusion that the Creator of all these worlds is Allah, the One, Almighty, and Supreme Creator. Only Allah has the right to be worshiped and praised, even though He Himself does not need praise from His servants and creatures. Only His creatures have to worship and praise Him, because so great and many blessings were bestowed upon him. If no one worshiped and praised Him or all of His creatures disbelieved and denied His favors and bounties, then this would not harm Him in the least as stated in His word: \"If you and those on earth all deny (the favors of Allah), then verily Allah is Rich, Most Praised.\" (Ibrahim\/14: 8) To make people aware that they want to use their minds, Allah explains that all His creatures in the heavens and on earth glorify Him, including the birds that fly in the air. Allah said: Don't you (Muhammad) know that to Allah glorifies what is in the heavens and on earth, and also the birds that spread their wings. Each one really, already knows (how to) pray and glorify. Allah is All-Knowing of what they do. (an-Nur\/24: 41) The next verse emphasizes that it is Allah who has the right to be praised in the hereafter, because He is the one who has power there, and acts justly and wisely in calculating and repaying the deeds of His servants. No one is harmed in the calculation of his deeds, the good are rewarded with good, and the evil are rewarded with the punishment they deserve, even with His mercy and grace one good deed is rewarded with multiples. In another verse it is explained how great is the praise of His believing servants for the blessings bestowed upon them in return for their deeds while living in the world with His words: And they said, \"Praise be to Allah who has fulfilled His promise to us and has given us this place while we (are allowed) to occupy paradise wherever we want.\" Then (heaven is) the best reward for those who do good deeds. (az-Zumar\/39: 74) And His words: And they said, \"Praise be to Allah who has removed sorrow from us. Indeed, our Lord is truly Forgiving, Most Grateful, Who by His grace placed us in an eternal place (heaven); in it we will not feel tired nor lethargic.\" (Fathir\/35: 34-35) Then Allah confirms that He is the All-Wise, acts and acts, and regulates and controls the affairs of the world and the hereafter and nature as a whole. He is the All-Knower of everything and all matters. He knows everything with His vast knowledge."
		   },
		   {
			"id": 3608,
			"surah": 34,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains how broad and deep His knowledge is. He knows everything that enters the earth, everything that comes out of it, everything that descends from heaven and everything that ascends upon it. With these succinct and short words, Allah describes how extensive His knowledge is. If all the inhabitants of this earth spent their time knowing what was happening in the heavens and the earth in one moment, surely they would not be able to record it to make statistics. How many seeds and plant seeds enter and hide in the ground. How many small animals such as caterpillars, worms, and various types of insects in the bowels of this vast earth. How many mining materials are always processing and developing in the bowels of the earth such as gold, silver, oil, gas, and so on. How many also come out of the earth such as plants that have sprung up, gushing springs, rising gases, animals and insects that want to enjoy the sunlight and free air and so on. How many are falling from the sky like rain that cannot be estimated how many are blessings from Allah for His servants, the light that shines with heat like the light of the sun, and the light that shines quietly like the light of the moon. Then how many also rise up into the sky like vapor from rivers and seas, gas molecules from plants, humans and animals and the earth itself. How many human spirits have died and angels who have ascended to the sky obediently carry out the commands of their Lord. All of this will not be recorded by humans let alone to find out one by one. However, Allah, the All-Knowing, nothing is hidden from Him, everything has been covered in His knowledge. What Allah says is true: Whereas you were given only a little knowledge. (al-Isra'\/17: 85) Such is the breadth of Allah's knowledge and mercy and His gifts to His servants, because He created everything on earth and in the heavens for the benefit of mankind. In addition, Allah, the Most Merciful, bestows unlimited gifts, and is Most Forgiving to those who are guilty when they are aware and repent of their mistakes."
		   },
		   {
			"id": 3609,
			"surah": 34,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains how the disbelievers go astray who deny the Day of Judgment and say that this life is only limited to this world. They say that the afterlife that Muhammad preached about is sheer nonsense, something that is impossible to happen because the human body after entering the grave will be destroyed without a trace especially after going through a long period of time. Allah ordered the Prophet Muhammad to strongly reject the assumptions of those misguided disbelievers. Allah ordered the Prophet to swear by the name of Allah that the Day of Judgment would definitely come. This verse is one of the three verses which instruct the Prophet Muhammad to swear by the name of Allah in refutation of the disbelief of the disbelievers, as confirmed by Allah in His word: And they ask you (Muhammad), \"Is it true (the promised doom) That?\" Say, \"Yes, by my Lord, indeed (the punishment) is definitely true and you can never avoid it.\" (Yunus\/10: 53) The second in surahh at-Tagabun: Those who disbelieve think that they will not be resurrected. Say (Muhammad), \"Not so, by my Lord, you will surely be resurrected, then all that you have done will be announced.\" And that is easy for Allah. (at-Tagabun\/64: 7) Such was the severity of the rebuttal that had to be uttered by the Prophet Muhammad against the disbelief of the disbelievers about the day of resurrection, because it is a wisdom and wisdom of Allah towards His servants. A wisdom and wisdom that unbelievers do not understand or they do not want to understand. The wisdom and wisdom is that Allah will not justify His servants to do as they please. Allah has made it clear through the intercession of His messengers that whoever commits evil or tyranny will be rewarded with an appropriate reward both in this world and in the hereafter. If a servant has not received a reply in the world for his crime because of his position or intelligence in hiding the crime, then the reward will surely be received in the hereafter. The same is true for God's servants who do good. This is the wisdom and wisdom of Allah, the Most Just, All-Knowing of all the deeds of His servants. On the Resurrection Day, all human actions will receive a fair reward even though they have been tormented in this world, especially for God's servants who have not received their reward. Denying the Day of Judgment and the Day of Judgment means denying the wisdom of Allah, the Just and Almighty. Then Allah explained that He knows everything that exists and happens in the heavens and on earth, nothing is hidden from Him, even as big as an atom (zarrah) because all of that has been written in the Lawh Mahfudh. Let not a servant think that his very small deeds or those that have been tightly covered up and hidden escape Allah's knowledge. He must know it and will repay the deed, both in this world and the hereafter, according to His wisdom and justice."
		   },
		   {
			"id": 3610,
			"surah": 34,
			"ayat": 4,
			"tafsir": "As for those who have faith, believe in the Day of Resurrection and prove their faith by doing good deeds and avoiding actions that Allah has forbidden. They will receive forgiveness from Allah, the Most Forgiving. Allah will forgive their faults and blot out their sins according to His word: Those good works erase sins. That is a warning for those who always remember (Allah). (Hud\/11:114)"
		   },
		   {
			"id": 3611,
			"surah": 34,
			"ayat": 5,
			"tafsir": "On the other hand, those who deny Allah's verses, try to prevent others from believing in Allah and His Messenger, and deny the Day of Resurrection and make fun of those who believe in it, thinking that they will escape Allah's punishment. Because of their pride and disobedience, they will receive a very painful punishment and will be thrown into the Hellfire of Jahim. Thus the wisdom and justice of Allah provides the day of resurrection so that humans receive a reward according to their deeds. It is impossible for Allah to equate His servants who do good with His servants who do evil. Allah says in the verse below: Should We treat those who believe and do good the same as those who do mischief on earth? Or is it appropriate for We to consider those who are pious to be the same as those who are evil? (shad\/38: 28) And His word: The inhabitants of hell are not the same as the inhabitants of heaven; the inhabitants of heaven are the ones who gain the victory. (al-hashr\/59: 20)"
		   },
		   {
			"id": 3612,
			"surah": 34,
			"ayat": 6,
			"tafsir": "Allah explained that unlike the disbelievers who do not want to use their minds and minds and a priori reject what is reported in the Qur'an, some People of the Book, such as 'Abdullah bin Salam, Ka'ab, and others, admit that what is reported in Al-Qur'an about the coming of the Day of Judgment is true and can not be doubted. They also admit that the Qur'an is a guide from Allah to the straight path that must be guided by humans to achieve happiness in this world and the hereafter. In the Al-Qur'an there are laws, regulations and laws that are in accordance with human nature and their environment and will definitely bring happiness."
		   },
		   {
			"id": 3613,
			"surah": 34,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains the disbelief of the disbelievers against the Day of Resurrection and how great their ridicule and mockery of the Prophet Muhammad who announced it. They asked each other about a man who said that when they had died and were buried, their bodies and bones had been destroyed, after that they would come back to life to account for their actions. The person who said that was Muhammad who preached that he received revelations from his Lord. They considered that this was a great opportunity for them to influence public opinion and discredit the Prophet and say that he was mad or fabricated a big lie against Allah by saying that the news was a revelation revealed to him. Maybe most ordinary people will be affected by the ridicule and ridicule so that they look down on and contempt the Prophet. Therefore, Allah confirms in this verse that those who do not believe in the existence of the hereafter will be tormented and will be in a clear error. They will be tormented both in this world and in the hereafter. In the world they will become lost people in the middle of their life's journey, not knowing the direction to go, and always in anxiety and doubt. People who have no creed and do not believe in Allah's justice and the hereafter will always be tossed about in confusion. He has no hope of getting Allah's justice because what he meets and sees in this world is full of lameness and tyranny. Weak people fall prey to the strong. Meanwhile, those who have faith who fully believe in the justice of Allah and the reckoning of human actions in the hereafter, will of course have full confidence that if he is wronged, Allah will reward those who wronged him with the appropriate recompense. If not in this world, in the hereafter surely the revenge will be carried out. Even in the hereafter Allah will reward you multiplied for your patience and trust. Belief in the existence of the hereafter is a blessing for a servant of Allah."
		   },
		   {
			"id": 3614,
			"surah": 34,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains the disbelief of the disbelievers against the Day of Resurrection and how great their ridicule and mockery of the Prophet Muhammad who announced it. They asked each other about a man who said that when they had died and were buried, their bodies and bones had been destroyed, after that they would come back to life to account for their actions. The person who said that was Muhammad who preached that he received revelations from his Lord. They considered that this was a great opportunity for them to influence public opinion and discredit the Prophet and say that he was mad or fabricated a big lie against Allah by saying that the news was a revelation revealed to him. Maybe most ordinary people will be affected by the ridicule and ridicule so that they look down on and contempt the Prophet. Therefore, Allah confirms in this verse that those who do not believe in the existence of the hereafter will be tormented and will be in a clear error. They will be tormented both in this world and in the hereafter. In the world they will become lost people in the middle of their life's journey, not knowing the direction to go, and always in anxiety and doubt. People who have no creed and do not believe in Allah's justice and the hereafter will always be tossed about in confusion. He has no hope of getting Allah's justice because what he meets and sees in this world is full of lameness and tyranny. Weak people fall prey to the strong. Meanwhile, those who have faith who fully believe in the justice of Allah and the reckoning of human actions in the hereafter, will of course have full confidence that if he is wronged, Allah will reward those who wronged him with the appropriate recompense. If not in this world, in the hereafter surely the revenge will be carried out. Even in the hereafter Allah will reward you multiplied for your patience and trust. Belief in the existence of the hereafter is a blessing for a servant of Allah."
		   },
		   {
			"id": 3615,
			"surah": 34,
			"ayat": 9,
			"tafsir": "In this verse, Allah gives a warning to those who do not believe in the occurrence of the Day of Judgment and instructs them to pay attention to natural events that they have witnessed themselves. How many natural disasters have occurred in several countries such as the great earthquake that destroyed buildings, caused loss of life and priceless property, the great flood that washed away houses, people, animals and plants. According to scientific studies, because the sky is in the shape of a ball, wherever humans step on the earth, the sky will always be in front of and behind it, as well as above and below it. This verse also shows that the shape of the earth is round. Clumps from the sky can be interpreted as the fragments of celestial bodies (planets, stars, comets, etc.) after experiencing collisions with each other. These fragments are known as asteroids, meteorites, and so on. Every day the earth's surface is bombarded by fragmented rock bombs, which can cause damage to the earth and its inhabitants. Because Allah is Most Gracious and Merciful, He protects the earth with a protective layer of air called the atmosphere. The air layer is like a brake that dampens the movement of these bombs by the friction that occurs when they come into contact with an asteroid or meteorite. It can even destroy it immediately because asteroids or meteorites are destroyed or burnt out due to the heat generated by friction with the earth's atmosphere. Another protective shield is the ozone layer, the Earth's magnetic field which brakes charged fragments. If the ozone layer is torn apart due to air pollution, the celestial body fragments will fall to the earth, and could fall on humans or bury them on the earth's surface. History records how Allah destroyed several ancient peoples, and their remains can still be seen today. Does all this not remind them that if Allah wills, He can submerge their country into the ground, and can also send celestial bodies such as meteors or planets, to hit the earth, and thus a catastrophe that cannot be imagined how terrible will occur. Don't they take lessons from these natural events or from events written in history and the remnants that they can still see for themselves? For those whose hearts are illuminated by the light of faith, these various incidents add to their faith and make them believe that Allah is the Almighty, and that in essence they will return to Allah, the Owner and Ruler of the heavens and the earth, the Most Wise and Most Just."
		   },
		   {
			"id": 3616,
			"surah": 34,
			"ayat": 10,
			"tafsir": "Among the gifts God bestowed upon the Prophet David was his very melodious voice. It is narrated that the Prophet David was a composer or creator of religious songs. When David glorified in a melodious voice, moreover the songs also described the greatness, glory, and majesty of God, then the natural surroundings resounded as if they were also glorifying to the rhythm of his voice. We do not know how the surrounding nature glorified and sang with David as God had commanded him. It is indeed not known by humans as mentioned in His words: The seven heavens, the earth and all that is in them glorify Allah. And there is nothing but glorify Him by praising Him, but you do not understand their tasbih. Indeed, He is Most Forbearing, Most Forgiving. (al-Isra'\/17: 44) Regarding the beauty and melodiousness of David's voice, it is narrated in an authentic hadith: From 'Aisha, she said: The Messenger of Allah heard Abu Musa's reading. al-Asy'ari, then he said, \"Surely this person has been blessed by Allah with a sweet voice like the family of David.\" (An-Nasa'i History) Another blessing that Allah bestowed on David was that he could make hard iron soft like wax so that it could be formed into tools, especially war tools. With a miracle that God gave, David did it without being heated by fire as people can do."
		   },
		   {
			"id": 3617,
			"surah": 34,
			"ayat": 11,
			"tafsir": "Then God ordered the Prophet David to make special armor from soft iron, not like the clothes that were known at that time. Usually armor at that time was made of thin pieces of iron arranged like a shirt, but the armor was very annoying for the wearer apart from generating heat in the body and restricting movement. However, the armor that David made, because the iron had softened, was much different from ordinary armor. The armor was made like neatly arranged coils of chain so that the armor followed the movement of the body. Thus, the wearer can move freely without feeling any disturbance. With this soft armor, David was able to make new weapons to defend his kingdom from enemy attacks. Then to be grateful for the gifts He gave, Allah also ordered that David and his people always do good deeds and use all the blessings that Allah has given to achieve His pleasure. He always sees and knows what His servants are doing."
		   },
		   {
			"id": 3618,
			"surah": 34,
			"ayat": 12,
			"tafsir": "In this verse it is explained that Allah subdued the winds for Prophet Sulaiman so that he could bring him to the places he wanted very quickly. In just half a day the wind can carry him to a place a month's journey away, whether the journey is from morning to noon or during the afternoon from noon to sunset. Qatadah in interpreting this verse states, \"The wind can carry Solomon from morning to the decline of the sun as far as a month's journey and from the decline of the sun to its sunset as far as a month's journey as well. In this case, al-hasan al-Bashri said, \"Sulaiman once set off riding the wind , from Damascus to Istakhr and he got off there for lunch, then he left again for Kabul to spend the night there. Even though the distance between Damascus and Istakhr is a month's journey for someone who walks quickly and the distance between Istakhr and Kabul is a month's journey as well. Another gift given by God to Solomon is to soften copper like wax so that it is easy to shape according to the wishes of those who process it. This is the same as the gift given to the Prophet David, namely softening iron. Among these gifts is subduing the jinn to work to make whatever Solomon wants. The genies are always obedient and obey his orders, because they are threatened by Allah with a painful punishment if they do not fulfill Solomon's orders."
		   },
		   {
			"id": 3619,
			"surah": 34,
			"ayat": 13,
			"tafsir": "Therefore, they were very active in carrying out what Solomon ordered, such as building places of worship, beautiful statues made of wood, copper, glass, and marble, as well as large pots to cook enough food for them. tens of people. Because of their size and breadth, the vessels looked like pools of water. They also made a large pot for Sulaiman which, because of its size, could not be lifted and moved. Because the jinn have tremendous power, they easily make everything Solomon wants, such as building magnificent and luxurious palaces, and digging ditches for irrigation so that Solomon's kingdom becomes famous as a large and most prosperous kingdom, there was not even a kingdom at that time. that can match it. This is the realization of his prayer which God answered as stated in His word. He said, \"O my Lord, forgive me and grant me a kingdom that no one after me will have. Truly, You are the Giver.\" Then We subjected him to the wind that blows well according to his orders wherever he wishes, and (We also subjected him to) the devils, all builders and divers. (shad\/38: 35-37) Then Allah ordered Solomon as the family of David to be grateful for the blessings that Allah bestowed upon him. Being grateful for God's favors is not just saying, but must be accompanied by good deeds and using these blessings for things that are pleasing to Him. It was narrated by at-Tirmidhi that the Prophet Muhammad climbed onto the pulpit and recited this verse. Then he said, \"There are three characteristics if possessed by someone it means he has been given a gift like the gift given to the family of David.\" We asked him, \"What are those qualities?\" The Messenger of Allah replied, \"First: Be fair, both in a state of anger and in a state of joy. Second: Always live a simple life both when you are poor and when you are rich. Third: Always fear Allah both when you are alone and in front of many people. Allah follows the commandments.\" So that Sulaiman was grateful for the blessings he received by explaining that very few of His servants were truly grateful to Him. How a servant is grateful to his Lord can be seen from the way the Prophet gave thanks to Allah. From 'aisyah that the Messenger of Allah praying at night until the soles of her feet were swollen, so I ('Aisyah), said to her, \"Why do you do this when Allah has forgiven your present and future sins?\" Rasulullah replied, \"Am I not a servant who grateful?\" (Muslim history)"
		   },
		   {
			"id": 3620,
			"surah": 34,
			"ayat": 14,
			"tafsir": "This verse explains that when his death was near, Prophet Sulaiman sat on his throne leaning on his staff. It was at that time that Solomon died and no one knew that he had died, neither his bodyguards, palace occupants, nor the genies who always worked hard to carry out his orders. He fell down because his staff was eaten by termites, so he couldn't support his body weight. Only then did people realize that Solomon had died, and so did the jinn who were still working hard to carry out his orders. It was then that they admitted their weakness, because they could not know that Solomon had died. If they knew that Solomon had died, of course they would not continue to work hard, because they were only commanded by Allah to obey Prophet Solomon, not to the dignitaries in his palace. Allah does not explain in this verse how long Solomon leaned on his staff until he fell down. Some commentators say that Prophet Sulayman leaned on his staff until he died for one year. They said that the Prophet David had started building Baitul Makdis but was unable to complete the construction. When he was near his death, he made a will to Prophet Sulayman to complete the construction. Prophet Sulayman ordered the genies that were under his control to complete the building. When Solomon felt that his death was near, he wanted to hide his death from the jinns who worked hard to complete their work. Then Prophet Sulaiman leaned on his stick so that when he died, people would think he was still alive because he was still sitting on his stick. Finally his stick was eaten by termites and broke. At that time, it was discovered that Prophet Sulaiman had died. They wanted to know how long Solomon leaned on the stick after he died, by taking what was left. After they calculated, it turned out that the termites in a day and a night only ate a small part of the stick, so it took one year to destroy it. Some commentators argue that Solomon leaned on his cane until he died. Indeed, the stick had long been eaten by termites without Solomon knowing. By the time Solomon reclined on the stick when he died, the stick was rotten too. It is impossible for a king to be left alone by his family and bodyguards without eating and drinking, without asking him important matters for his opinion. We cannot know which one is right between these two opinions. In the stories of the prophets there are many things that cannot be reached by the human mind because they were given miracles by God. If Prophet Sulaiman had only been stretched for a moment and then collapsed down, surely the genies would not have regretted it so much because they had already worked on completing Baitul Makdis."
		   },
		   {
			"id": 3621,
			"surah": 34,
			"ayat": 15,
			"tafsir": "In the south of Yemen lived a people named Saba'. They occupy a very fertile area so that they live in prosperity and have reached a high culture. They can control the rainwater that falls heavily in certain seasons by building a giant dam that can store water for the dry season. The dam can be said to be a natural dam because it is located between two hills and at the end a tall structure is erected to prevent water from flowing into the desert in vain. They make floodgates that when opened can drain water to the area they want. This dam is known as the Ma'rib Dam or al-'Arim Dam. Many historians and researchers in the West have doubts about the existence of the Ma'rib Dam. Finally a researcher from France came alone to the south of Yemen to investigate the remains of the dam in 1843. He was able to prove the existence of the dam by finding the remains, then photographing and sending the pictures to a magazine in France. Other researchers also found some slate among the ruins of the dam. Thus, they are increasingly convinced that long ago in the south of Yemen stood a kingdom that was advanced, prosperous, and high in culture. In this verse, Allah explains a little about the Sabaean people who inhabit the area south of Yemen. They occupy a broad and fertile valley thanks to regular irrigation from the Ma'rib Dam. To the left and right of their land stretched vast and fertile gardens which produced an abundance of food and fruit. The Sabaean people initially worshiped the sun, but after the royal leadership was held by Queen Balqis, they became believers by following the teachings of Prophet Sulaiman. This is narrated in the Qur'an as follows: So not long after (hud-hud came), then he said, \"I already know something that you do not know. I come to you from the land of Saba' bringing a convincing news. Indeed, I found a woman who ruled over them, and she was gifted with everything and had a great throne. I (the Hud bird) found her and her people worshiping the sun, not to Allah; and satan had made their (bad) deeds beautiful. ). Almighty and Most Gracious. Allah, through the intercession of His Messenger, ordered them to thank Him for all the blessings and gifts bestowed on them. Their land became fertile and prosperous thanks to the gifts Allah, Most Forgiving, protects them from all kinds of harm and calamity."
		   },
		   {
			"id": 3622,
			"surah": 34,
			"ayat": 16,
			"tafsir": "They reject and turn away from Allah's call, even blocking people who are converted from believing in Him. Allah then inflicted torment on them by breaking the Ma'rib Dam and there was a great disaster. Their land was hit by a torrential flood, and carried away everything that stood in its way. The gardens on either side of the land were destroyed, and all their livestock was washed away. The human victims were countless, so that only a few people were still alive. Only a small group of them survived this terrible catastrophe. Even these survivors could not live happily in their original place. Some of them then migrated to other places that were fertile because there were no more gardens that they could plant properly and not many livestock that they would raise. The once fertile lands have become barren as all the water stored in the dams has spilled over into the desert which can swallow any amount of water. What grows in their former gardens are only plants that are not of much use, and their fruit is bitter. If they want to grow crops, all they expect is rainwater that falls from the sky."
		   },
		   {
			"id": 3623,
			"surah": 34,
			"ayat": 17,
			"tafsir": "Thus the sunatullah has applied to the Sabaean people, as it has been to people who were arrogant and rebellious before, did not want to accept the truth, and always rejected and disobeyed the teachings of Allah brought by His messengers. Thus Allah inflicts doom and calamity on the disbelievers who deny and are not grateful for the blessings bestowed upon them."
		   },
		   {
			"id": 3624,
			"surah": 34,
			"ayat": 18,
			"tafsir": "The Sabaean people who still live in their country, although experiencing difficulties in life because their country has become desolate and barren, travel to trade from one country to another, especially to rather large countries, such as Mecca and Syria in the north and Northwest. These countries at that time included prosperous countries which became trading centers. Travel between countries is easy and safe because there are villages where travelers stop over when they run out of provisions or feel tired. They can survive and can also cultivate crops moderately during the rainy season. They also kept livestock when there was still a lot of pasture. This is a blessing from Allah to them, although it is not as big as the favor He bestowed when the Ma'rib Dam had not been destroyed and destroyed. Allah ordered them to make the best use of this blessing and to walk with merchandise between countries safely, even though the distance they traveled was sometimes very long. They can stop at the villages around the big cities when they feel tired. If they are too late they can stop at the nearest village and so on."
		   },
		   {
			"id": 3625,
			"surah": 34,
			"ayat": 19,
			"tafsir": "Therefore, they ask Allah so that along the journey between one country and another there is no place to stop to rest, so that the journey must be continued even though it will suffer various kinds of difficulties. This is their character and the disposition of arrogant people. They have received convenience, but they want hardship and suffering. It's just like the Children of Israel who were given good food by Allah, namely Manna and Salwa, then they asked for ordinary food, as stated in His word: And (remember), when you said, \"O Musa! We can't just (eat) only one kind of food, so ask your Lord for us, that He may give us what the earth grows, such as: vegetables, cucumbers, garlic, fennel nuts and shallots.\" He (Moses) replied, \"Are you asking for something bad in exchange for something good? Go to a city, surely you will get what you ask for.\" Then they were overwritten by humiliation and poverty, and they (again) got the wrath of Allah. (al-Baqarah\/2: 61) In fact, with this request, the Sabaean people had wronged themselves and were dissatisfied with the gifts bestowed upon them by Allah. They have forgotten that Allah destroys their fertile and prosperous country because they do not want to believe in and be grateful for Allah's grace. Therefore, Allah fulfilled their request by eliminating a place to stop on their way, so that they had difficulty trading, and their life became difficult. They had to emigrate to another country leaving their country and scattering to and fro. The tribe of Jafnah bin Amr was forced to live in Syria, Aus and Khazraj in Medina, and Azad (Uman) lived in Oman. So did the other tribes. Gone is their form as a people who were once very famous as a noble people who had high civilization and culture. All that remains are the stories passed down by word of mouth and their fame as mere entertainment, spoken of during their vigils at night. In fact, what the Saba people experienced should be a lesson for everyone who is patient and knows how to be grateful for every blessing he has received from Allah. Every servant must be grateful to Allah for all His blessings and be patient in accepting His trials. In fact, he must be grateful to Allah even though he gets trials from Him. It was narrated by Sa'ad bin Abi Waqqash that the Messenger of Allah said: I admire Allah's decree for a believer. When he gets good he praises and thanks Him. When he is struck by a calamity he praises and gives thanks to Him. The believer gets rewarded in every way, even if it's just a mouthful of food that he gives to his wife. (Ahmad's history)"
		   },
		   {
			"id": 3626,
			"surah": 34,
			"ayat": 20,
			"tafsir": "In this verse, Allah explains that the Devil thought that the people of Saba' who had been destroyed by Allah and their country had followed him and obediently carried out his deception. He thought they had disobeyed Allah and were ungrateful for all the blessings bestowed upon them, except for some people who believed who remained faithful and did not accept the deception. Thus, Satan thinks that he can control people and lead them astray, as he has promised before Allah. This is stated in His word: (The Devil) replied, \"By Your glory, I will definitely mislead them all, except Your servants who are chosen from among them.\" (shad\/38: 82-83)"
		   },
		   {
			"id": 3627,
			"surah": 34,
			"ayat": 21,
			"tafsir": "God rejected and canceled Satan's notion that is not right. Allah confirms that Satan does not have the slightest power over people to lead them astray, so that they disobey Him. Satan's deception is only a test from Allah to His servants, do they want to be deceived by Satan's enticements or do they reject it altogether so that it does not affect their faith and piety in the least. Al-Hasan al-Bashri argues that Satan never beats people with a stick and never forces them to do anything. Satan's actions are just deception, persuading with empty dreams, then humans accept it. Satan's tricks are just like that, not unlike the bacteria that attack humans during the season of epidemics. Whoever does not have strong resistance in his body to withstand the attack of the disease, he becomes a victim. However, the disease cannot overtake a person in whose body there are strong elements of resistance. He will remain in good health even though many people have fallen ill or died from it. If someone falls into Satan's trap, don't regret other people, the one who is wrong and weak in this case is himself. Therefore, every human being must fortify himself with a strong faith with piety and always do good deeds. God's Word: I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I can't help you, and you can't help me either. In fact, I do not justify what you did associating me (with Allah) a long time ago.\" Indeed, the wrongdoer will receive a painful punishment. (Ibrahim\/14: 22) Allah then confirmed to the Prophet Muhammad that He records all human actions, nothing is hidden for Him as big as an atom, He will account for human actions as fairly as possible and no one will be harmed in this case, He will even repay good deeds with multiple rewards."
		   },
		   {
			"id": 3628,
			"surah": 34,
			"ayat": 22,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to challenge the polytheists of Mecca, if their idols and worship really have even a little power, try to prove this by giving examples of what they have created or possessed. Whether the idol can provide help to them or repel the danger that threatens them. Of course they could not provide such proofs, because it is unlikely that the inanimate objects they made with their own hands would be able to make something or be able to help and prevent harm from them. Therefore, Allah emphasized that these idols do not have the slightest power (even as big as an atom) over the heavens, the earth, and what is in them, and there is no ability at all to help them. How can they worship him if they use their minds. In another verse, Allah also confirms this with His words: And those whom you call (worship) besides Allah have nothing even if it is a thin skin. (Fathir\/35: 13) They do not own anything individually or in association with others and there is nothing that they cooperate with in creating or owning anything. This is a fact that we see in the world."
		   },
		   {
			"id": 3629,
			"surah": 34,
			"ayat": 23,
			"tafsir": "In the afterlife those idols cannot help them out of trouble. It is also impossible to intercede because on that day no one can intercede except with Allah's permission. Is it possible that Allah will allow idols which are the reason for the misguidance of His servants to intercede? Intercession will not be given by Allah except to the prophets, angels and His servants who are considered entitled to be given intercession. Allah's Word: No one can intercede at His side without His permission. (al-Baqarah\/2: 255) And how many angels are in the sky, their intercession (help) is of no use except when Allah has permitted (and only) for whom He wills and is pleased with. (an-Najm\/53: 36) On that day, God's servants waited anxiously and impatiently, which of them He would allow to intercede and who would receive intercession. At that time, they were all silent because the fear had disappeared from their hearts and Allah would give His decree. They waited expectantly and wondered among themselves what the Lord had said. All answered, \"What Allah says are true words, that is, His intercession will be given to whomever He pleases, because He is the Most High and the Most Great.\" At that time, the disbelievers realized that they would not be interceded and they knew what fate they would have to suffer."
		   },
		   {
			"id": 3630,
			"surah": 34,
			"ayat": 24,
			"tafsir": "In this verse, Allah, through the Prophet Muhammad, asks the polytheists, who gives them sustenance from the heavens and the earth by sending down rain, and with that rain the earth becomes fertile and grows various kinds of plants to become food for them and their livestock. Of course they couldn't answer that. Even though they want to say Allah, an answer that is in accordance with their conscience, they answer it idols, an answer that actually contradicts their conscience which justifies the call of the Prophet Muhammad. Therefore, they fell silent, unable to give any answer. Thus Allah commanded Muhammad that the only one who provides sustenance from the heavens and the earth is Allah. This kind of question is also mentioned in another verse, namely: Say (Muhammad), \"Who is the Lord of the heavens and the earth?\" Say, \"God.\" Say, \"Should it be right for you to take protectors other than Allah, even though they have no power to bring benefits or prevent harm to themselves?\" (ar-Ra'd\/13: 16) Allah then ordered the Prophet Muhammad to say to them after not being able to answer the question above, \"We or you must be in guidance or in a clear error.\" This is a way of discussion that is very subtle and sharp. The Prophet did not say that it was the polytheists who went astray and he was the right one, but he said that one of the two must have followed the right path and someone had gone astray. This utterance must have attracted the opponent to think about who actually got the clue and who went astray, and avoided harsh methods because it would also bring out a harsh answer. If the Prophet said emphatically that they were the ones who were astray, of course they would have answered emphatically that it was the Prophet who was astray."
		   },
		   {
			"id": 3631,
			"surah": 34,
			"ayat": 25,
			"tafsir": "In this verse, the Prophet Muhammad is told to tell them that each one is fully responsible for all his actions. The polytheists are not responsible for the wrong actions of the Muslims, and vice versa, the Muslims are not responsible for all the actions of the polytheists. Some commentators say that polytheists once accused the Prophet and the believers that they had committed a grave sin by apostasy and betraying the religion of their forefathers. In response to this accusation, it was argued that Muslims are indeed responsible for all their sins and mistakes. Likewise, the polytheists are also fully responsible for all their good or evil deeds. In another verse, Allah told the Prophet to say words that match this, as He said: And if they (still) lie to you (Muhammad), then say, \"For me is my work and for you is your work. You are not responsible for what I do.\" do it and I'm not responsible for what you do.\" (Yunus\/10: 41)"
		   },
		   {
			"id": 3632,
			"surah": 34,
			"ayat": 26,
			"tafsir": "Then the Prophet was ordered to say to the polytheists, \"Allah will gather us all on the Day of Judgment and there He will judge us and our actions in the fairest way possible. There it will be clear who among us is going astray and who is following the straight path, which of us is wrong and who is right.\" All the deeds of His servants will be weighed against the scales of justice. Bad deeds will be rewarded with the appropriate reward and good deeds will be rewarded with multiple rewards. This is also clearly mentioned in another verse, namely: And on the day (when) the Doomsday occurs, on that day humans will be divided (into groups). So as for those who believe and do good deeds, then they will be happy in the Garden (Paradise). And as for those who disbelieve and deny Our verses and (deny) the meeting of the Hereafter, they will still be in the punishment (hell). (ar-Rum\/30: 14-16) It is there that Allah will give a decision, no one can dispute it because all decisions are based on real facts that cannot be denied anymore. Allah is All-Knowing when the verdict will be rendered by Him, no servant can know, because He is the Most Decision-giver and All-Knowing."
		   },
		   {
			"id": 3633,
			"surah": 34,
			"ayat": 27,
			"tafsir": "Allah then ordered the Prophet Muhammad to ask the polytheists, who and what exactly were the idols that they associated with Allah. They were asked to explain to him who the idols were, what their characteristics were, their value and quality, and their position. Why are they worshiped, does he really deserve to be worshipped? The questions posed to them were a challenge and a statement that they did not use their minds because they worshiped something that had no value, an inanimate object that they had made with their own hands. It is absolutely impossible and unreasonable to associate inanimate objects with Almighty and All-Knowing Allah."
		   },
		   {
			"id": 3634,
			"surah": 34,
			"ayat": 28,
			"tafsir": "In this verse, Allah explains that the Prophet Muhammad was sent to all mankind. He served as a bearer of good news for people who believe and practice the treatise he brought and at the same time a warning to those who deny or reject his teachings. Prophet Muhammad is the closing prophet, there are no more prophets and messengers sent by Allah after him. Thus, surely the message he brought applies to all humans until the end of time. As the last treatise, it contains proper and good regulations and laws to be implemented in every place and time. The treatise brought by the Prophet Muhammad comes from Allah, the All-Wise and All-Knowing. God who created the heavens and the earth and all that is in them. He is the one who arranges everything that is in both of them. He is the one who arranges everything with very precise rules so that everything goes well and harmoniously. Allah, who is so great in power, would not have possibly sent down a treatise covering all humanity if the rules and Shari'a did not cover all human interests at all times. Thus, surely his treatise is a good treatise to be applied to anyone and any people in this world. Many verses in the Qur'an confirm that Muhammad was sent to all mankind. Glory be to Allah who has sent down the al-Furqan (Al-Qur'an) to His servant (Muhammad), so that he becomes a warner to all nature (jinns and humans). (al-Furqan\/25: 1) And His words: Say (Muhammad), \"O people! Truly I am Allah's Messenger to all of you, Who has the kingdom of the heavens and the earth; there is no god (who has the right to be worshiped) but Him, That gives life and death, then believe in Allah and His Messenger, (namely) the Ummi Prophet who believes in Allah and in His sentences (His books). Follow him, so that you may be guided.\"( al-A 'raf\/7: 158) This is not known by everyone even most people reject and challenge it. Among the challengers were Muhammad's own people, the Meccan infidels. And most people will not believe even if you really wanted to. (Yusuf\/12: 103)"
		   },
		   {
			"id": 3635,
			"surah": 34,
			"ayat": 29,
			"tafsir": "In this verse, Allah explains that the polytheists opposed the Prophet Muhammad as a bearer of good news for the believers and a warner for the disbelievers. Muhammad explained to them that God's justice does not only apply in this world, but includes justice in the hereafter. All human actions will be rewarded with the appropriate reward. They made fun of the words of the Holy Prophet and said that the Day of Judgment could not happen and would never happen. They said to him mockingly, \"If it is true that the doomsday promised by your Lord is really going to happen, then tell us when it will happen.\" In fact, in another verse it is explained that they challenged the Prophet Muhammad so that the arrival of the doomsday would be hastened, as mentioned in the word of Allah: People who do not believe in the existence of the doomsday ask for that day to happen soon, and those who believe are afraid of it and they believe that the doomsday is true (will happen). Know that in fact those who argue about the occurrence of the apocalypse really have gone astray. (asy-Syura\/42: 18) Their ridicule and challenges showed their ignorance of the Prophet Muhammad's duties as an apostle, and they did not know the limits of his duties. The messenger is only a human being assigned by Allah to convey the message. He is not a powerful and knowledgeable person like his God. His knowledge and power are limited to what Allah has given him. If asked about things that are unseen, he certainly will not be able to explain it unless Allah has told him. If asked to him to lower the punishment or hasten the arrival of the Day of Judgment, then that is beyond his ability."
		   },
		   {
			"id": 3636,
			"surah": 34,
			"ayat": 30,
			"tafsir": "As an answer to the denial and challenge of the polytheists, Allah ordered the Prophet Muhammad to confirm to them that the Day of Judgment must occur at the time determined by Allah. When the time has come, the apocalypse cannot be postponed or advanced even for a moment. Therefore, they must be careful, always on guard, and prepare with faith and good deeds. If the time of doomsday has come, there will be no more opportunities for someone to repent and he will regret it later when he sees the punishment provided for those who disbelieve."
		   },
		   {
			"id": 3637,
			"surah": 34,
			"ayat": 31,
			"tafsir": "In this verse, Allah explains how deep the polytheists' rejection of the religion brought by the Prophet Muhammad and other heavenly religions brought by the previous apostles. They declared that they would not believe in the Al-Qur'an and the books that Allah revealed to His messengers. For people who are determined like this there is no argument or evidence that they can accept, even though the evidence is strong, real, and can be accepted by common sense or a clear mind. Their hearts have been filled with such ardent fanaticism that anything that goes against their beliefs is wrong, heretical, and utterly unacceptable. Once the polytheists of Mecca asked the People of the Book about the characteristics and characteristics of Muhammad and whether this was mentioned in their book. Some of the People of the Book explain the characteristics and characteristics of Muhammad saw. They also said that maybe Muhammad was indeed a messenger of God. For those whose hearts are clean and not defiled by pride and blind fanaticism, this answer will convict them and make them think. However, that answer made them angry and rejected the testimony of the People of the Book and did not want to believe it. Indeed, their minds have been closed to accept the truth as mentioned in God's word: God has locked their hearts and ears, their eyesight has been closed, and they will receive a severe punishment. (al-Baqarah\/2: 7) Since there is no evidence that can convict them, and what should be presented to them is a strong threat, then in these verses it is told how the condition of those disbelievers and their leaders in the hereafter later when standing before God. At that time, the disbelievers realized that they had gone astray. They turned to their leader and said, \"If it were not for what you have done to us in this world, surely we would not have experienced something like this. We would have believed in Muhammad peace be upon him and are among the servants of Allah whom He pleases.\""
		   },
		   {
			"id": 3638,
			"surah": 34,
			"ayat": 32,
			"tafsir": "These remarks and accusations were answered by the leaders who had plunged them into wanting to escape responsibility. The leaders said, \"Have we ever prevented you from following instructions? We have never forced you to follow our will and follow the path we are taking. We have never prevented you from following the teachings brought by Allah's Apostle. Only you are alone with your own will. also those who reject the teaching, and also deny it. If you have gone astray because of your actions, don't be held accountable for your actions. You are actually one of those heretics.\" If the answers of the leaders had been uttered while they were still on earth, their followers would have been silent, because of the great effect they had on them. However, it is different in the afterlife. Everyone's position before God is the same, there are no subordinates and leaders, and there are no feudal lords or commoners."
		   },
		   {
			"id": 3639,
			"surah": 34,
			"ayat": 33,
			"tafsir": "Therefore, the followers were not satisfied with the answers of their leaders and continued to charge that the leaders always cajoled and deceived them day and night, and ordered them to deny Allah and associate Him with others. However, it was all too late and there was no time to return to the truth or to repent. All of them, both the leaders and their followers, knew that they would get the appropriate recompense for their denial and disobedience. They felt very sorry when they saw the doom that was about to befall them, but that regret was useless. They are put into hell in a state of shackles. Indeed, it is the torment that deserves to be inflicted because of their attitudes and actions while in the world."
		   },
		   {
			"id": 3640,
			"surah": 34,
			"ayat": 34,
			"tafsir": "In this verse it is emphasized that there was not a single prophet sent by Allah to a country that did not encounter resistance from the leaders of his people. They are usually the elite who dominate the country's political and economic life. They are well-established and live in luxury, and dissipate. With the arrival of the prophets, they felt the stability of their lives was disturbed by the teachings that the prophets brought. Religion does not justify those in power tyrannizing the weak, while their stability is maintained by suppressing the weak. Religion asks people to pay attention to halal and haram in seeking sustenance and utilizing wealth, while their wealth is obtained in any way, legally or illegally, and they use this wealth for extravagance. Religion does not allow violating religious rules, while their lives do not heed these norms. Therefore, they opposed the prophets and loudly declared, \"We are against what you teach!\" This statement also confirms their arrogance, and further encourages them to act arbitrarily (fusuq) on this earth. If humans have done anything arbitrary, then that is an excuse for Allah to show His power, namely to destroy them. Allah's Word: And if We want to destroy a country, then We order people who live in luxury in that country (to obey Allah), but if they commit disobedience in (the country), then it is appropriate that the words (Our punishment) apply to them, then We completely destroyed (the land). (al-Isra'\/17:16)"
		   },
		   {
			"id": 3641,
			"surah": 34,
			"ayat": 35,
			"tafsir": "The ruling class who are tyrannical, arrogant and arbitrary are proud of their wealth and offspring. They said, \"We are rich and our descendants are many, we will not be punished (touched by the law).\" With wealth, they feel they can buy anything. With offspring and supporters, they think that their power over the weak can be maintained from generation to generation. They also feel loved by Allah so that in the hereafter they will not be punished for their sins. The benchmark they use is the pleasure of living in the world. The pleasures of life, they saw, indicated that they were loved, while the misery of life indicated that they were hated by God. All of their assumptions are not true. The giving of abundant wealth and successful children to the disbelievers is not an indication that Allah loves them, but on the contrary, as stated in the following verse: Did they think that We gave them wealth and children (meaning that), We immediately give them good things? (No), but they don't realize it. (al-Mu'minun\/23: 55-56) Even so, punishment is not immediately imposed on the disbelievers in this world because Allah still gives them a reprieve. This is intended to give them an opportunity to repent, as stated in the word of Allah: And if Allah punishes humans for their tyranny, surely He will not leave anything (on earth) even from creatures that crawl, but Allah suspends them until a certain time. already determined. So when their death comes, they cannot ask for a moment's delay or acceleration. (an-Nahl\/16: 61) In another verse it is explained that wealth and children are a test for humans, whether they remain faithful and grateful or deny. Allah says: Verily your wealth and your children are only a trial (for you), and with Allah a great reward. (at-Tagabun\/64: 15) Indeed, wealth for disbelievers will not be able to make them immortal in the world, but instead will cause them to be thrown into hell, as Allah says: He (man) thinks that his wealth can make him eternal. (al-Humazah\/104: 3)"
		   },
		   {
			"id": 3642,
			"surah": 34,
			"ayat": 36,
			"tafsir": "In this verse, Allah asked the Prophet Muhammad to confirm to the Meccan pagan leaders that the one who widens one's sustenance and limits one's sustenance is Allah. This is to reject the view of the disbelievers above that luck in life is a sign of Allah's favor and misery is a sign of His hatred. Allah expands or limits one's sustenance according to His wisdom. Allah expands a person's sustenance perhaps because he is trusted so that he is able to spend some of his wealth for those who are lacking, as stated in the verse: Indeed, humans were created to like to complain. When he is struck by trouble he complains, and when he gets good (wealth) he becomes stingy, except for those who pray, those who remain faithful to perform their prayers, and those whose wealth is prepared a certain portion, for people (poor) those who ask and those who do not ask, (al-Ma'arij\/70: 19-25) For those who disbelieve, abundant wealth and many and successful offspring are precisely what Allah uses as an excuse to punish them. The reason is because the method of obtaining and using wealth and the education of offspring is not in accordance with Allah's provisions, as stated in the verse: So do not let their wealth and their children amaze you. Indeed, Allah's intention with that is to torture them in the life of this world and one day they will die in a state of disbelief. (at-Taubah\/9: 55) On the other hand, it is Allah who limits one's sustenance. For those who believe the loss of possessions, family members and food is to test their patience. If they are patient, Allah will make them happy in this world and in the hereafter, as He says: And We will definitely test you with a little fear, hunger, lack of wealth, souls and fruits. And give good tidings to those who are patient. (al-Baqarah\/2: 155) For those who do not have strong faith, the tribulations of life keep them from regretting their fate, and eventually lead them to disbelief: Humans do not tire of asking for good, and if disaster befalls them, they despair and lose hope. (Fushshilat\/41: 49) It is clear that both the joys and sorrows of life are tests from Allah. The pleasure of life is not a measure that God loves, and the narrowness of life is not a measure that God hates. It could mean the opposite, that the pleasures of life are given by God as a test so that that person is increasingly mired in denial. The narrowness of life is the way to get happiness in the afterlife if that person endures it. It was this provision that was not known or understood by many people, including the leaders of the Meccan infidels."
		   },
		   {
			"id": 3643,
			"surah": 34,
			"ayat": 37,
			"tafsir": "In this verse it is emphasized to the Meccan pagan leaders that it is not possessions and offspring that can draw people closer to Allah and obtain His love, but faith and good deeds. Wealth and offspring are only beneficial if they strengthen faith and increase charity. Therefore, property must be obtained properly and used properly. Offspring must be educated properly so that they become good offspring too. Thus, the means to draw near to Allah and obtain His affection are assets that are acquired and used properly, and well-educated offspring who will preserve and continue one's faith and good deeds. In another verse, Allah indeed asks believers to find a way to draw closer to Him, and the way is through good deeds: O you who believe! Fear Allah and seek wasilah (way) to get closer to Him, and strive (fight) in His way, so that you will be lucky. (al-Ma'idah.\/5: 35) Only those who believe and have many good deeds will be rewarded with multiple rewards by Allah. In other verses it is stated that the multiplication is at least ten times (al-An'am\/6: 160), and some are seven hundred times (al-Baqarah\/2: 261). Those who are given heaven feel safe, that is, they are free from the threat of hell. More than that, they are satisfied and happy because Allah loves them and they love Him too. Allah said: Allah said, \"This is when the righteous will benefit from their righteousness. They will have gardens beneath which rivers flow, they will abide therein forever. Allah is pleased with them and they are pleased with Him. That is victory. great.\" (al-Ma'idah.\/5: 119)"
		   },
		   {
			"id": 3644,
			"surah": 34,
			"ayat": 38,
			"tafsir": "Next Allah explains about those who do not believe. They are trying to weaken the verses of Allah. What is meant is that they are always trying to thwart the mission of Islam so that people do not know, believe in, and carry out Islamic teachings properly. They will be put into hell and severely punished, as stated in another verse: (namely) those who hinder Allah's way and want the way to be crooked. And they are the people who do not believe in the hereafter. They are not able to hinder (God's torment) on earth, and there will be no helper for them besides Allah. The punishment was multiplied on them. They cannot hear (the truth) and cannot see (it). (Hud\/11:19-20)"
		   },
		   {
			"id": 3645,
			"surah": 34,
			"ayat": 39,
			"tafsir": "In this verse it is emphasized once again that it is Allah who expands sustenance or limits it. In contrast to verse 36, in this verse it is emphasized that what He expands or limits His sustenance is the sustenance of His servants. Means that a servant of Allah will receive the provisions of his sustenance whether expanded or limited by Allah. Thus this verse argues once again that the spaciousness of sustenance is a sign of God's love and its limitations indicate God hates it. A servant of Allah will be patient if his sustenance is limited. A servant of Allah, if his sustenance is more, he will pay attention to other people who are lacking. He will not be included as a liar of religion or the next day, as stated in the following verse: Do you know (a person) who denies religion? So that's the person who rebukes the orphan, and does not encourage feeding the poor. (al-Ma'un\/107: 1-3) Helping others, based on this verse, will actually perpetuate the wealth, not spend it. Helping other people will not make us poor, on the contrary, because that assistance means empowering many people. Empowerment of many people will produce prosperity, on the other hand exploitation of the community will make the community impoverished. The Messenger of Allah informed that people who help others are prayed for by angels for increased sustenance, and people who are miserly prayed for by angels for losing their possessions: Every morning there are two angels who come down to the servant of Allah, one prays, \"O Allah, give compensation to those who spend.\" And the other one also prayed, \"O Allah, destroy the wealth of people who do not want to spend.\" (History of al-Bukhari and Muslim from Abu Hurairah)"
		   },
		   {
			"id": 3646,
			"surah": 34,
			"ayat": 40,
			"tafsir": "In this verse, Allah explains that on the Day of Judgment all humans will be gathered before Allah to be accountable for their actions. At that time, disbelievers who worship other than Allah will be reunited with their gods in the world. To those who are worshiped, Allah asks if they have ever asked humans to worship them. Among those asked were angels, because when in the world there were humans who worshiped them. There are people who see the angels as the daughters of God, who because of their mother nature, will always love their children even if they are guilty. That's why they worship him. Allah says: And they make the angels of the Most Merciful servants (Allah) as women. Did they witness the creation (of the angels)? Later their testimonies will be written down and they will be held accountable. And they said, \"If (Allah) the Most Merciful had willed, we would not have worshiped them (angels).\" They have no knowledge whatsoever about it. They are nothing but conjecture. (az-Zukhruf\/43: 19-20) The angels and their worshipers are brought together not because Allah does not know the true events, but to show the worshipers themselves that they are wrong."
		   },
		   {
			"id": 3647,
			"surah": 34,
			"ayat": 41,
			"tafsir": "The angels replied that they had never asked for that, in fact they purified Allah from the existence of gods other than Him. They themselves deify Allah and seek protection from Him, so how can they ask people to worship Him. They explain that what always misleads people is the jinn or the devil. Thus, humans are actually mistaken when they think that they worship angels, because what they worship are jinns or demons. Most people who worship jinn or demons really believe that it is jinn or demons that determine human life so that they deify it. In another verse it is explained that among those asked by Allah whether he ever asked people to worship him was Prophet Isa as. He also denied it while asserting that he asked them to worship Allah, as revealed in the following verse: O Isa son of Maryam! Was it you who told the people, take me and my mother as two gods besides Allah?\" (Isa) replied, \"Glory to You, it is not right for me to say what is not right for me. If I had said it, surely You would have known it. You know what is in me and I do not know what is in You. Indeed, You are the Most High. Knows all that is unseen.\" I never said to them except what You commanded me (namely), \"Worship Allah, my Lord and your Lord,\" and I was a witness against them, as long as I was in their midst. So after You passed me away, You were the one who watched over them. And You are the Witness of all things. (al-Ma'idah.\/5: 116-117)"
		   },
		   {
			"id": 3648,
			"surah": 34,
			"ayat": 42,
			"tafsir": "On that Mahsyar day, Allah stated that neither those who worship other than Allah nor those who are worshiped will be able to do anything, whether it is beneficial or detrimental to others. Those who worship other than Allah will not get help from those they worship, because those who are worshiped are unable to do anything. Those who worship them also cannot blame those who are being worshiped, because those who are being worshiped have never asked them to worship them. In the Qur'an it is stated that no one will be able to help anyone, including family or close friends, as Allah says: On that day a man will flee from his brother, and from his mother and father, and from his wife and children. Every one of them that day had some business to occupy him with. ('Abasa\/80: 34-37) Also His words: And no close friend even asks his friend. (al-Ma'arij\/70: 10) They will be dragged and thrown into hell and humiliated even more with the words, \"Taste the punishment of hell that you didn't believe in before!\" Those words meant that they were blamed for not believing in a hell at a time on earth, which would make them suffer even more. Those words also mean that the punishment of hell is terrible. Such is the reward for those who do not heed the Prophet's invitation. The purpose of conveying this event in the Qur'an is so that the leaders of the Meccan infidels, and anyone after them, have faith so that this incident does not happen to them later."
		   },
		   {
			"id": 3649,
			"surah": 34,
			"ayat": 43,
			"tafsir": "This verse describes two further accusations against Islam by Meccan infidel leaders. First, accusing the Prophet Muhammad of being just an ordinary human being who conveyed verses of the Qur'an to them with the intention of preventing them from practicing the shirk religion inherited from their ancestors. That is, the Prophet Muhammad was only an ordinary human being, not an angel, and did not have any privileges in the form of wealth, and so on. Prophet Muhammad's goal was simply to distance them from the religion of their forefathers. Thus, they view the religion of their ancestors as better than the religion brought by the Prophet Muhammad. Second, they accuse the Qur'an of being a fabricated lie. The Al-Qur'an is only made by Muhammad, not a revelation from Allah, and its contents are not true. On the other hand, they see the fact that many people are interested in the Qur'an. They themselves even when reading or recited the verses of the Qur'an also feel interested. When they saw the contents of the Qur'an, they were sure that it could not have been made by Muhammad because he did not learn from anyone and could not write or read either. They become aware that their accusations against the Qur'an are wrong. That fact forced them to look for other reasons. Finally, they accuse the Qur'an of being witchcraft, and because of its extraordinary influence, they consider its magic to be extraordinarily great. Such is the nature of disbelievers, when they are no longer able to refute the truth of the Qur'an, they scorn it and find other reasons that make no sense, as Allah says: And when they see a sign (greatness) of Allah, they make fun of . And they said, \"This is nothing but real magic. (ash-shaffat\/37: 14-15) His words also: And if they (the polytheists) see a sign (miracle), they turn and say, \"(It is) continual magic.\" (al-Qamar\/54:2)"
		   },
		   {
			"id": 3650,
			"surah": 34,
			"ayat": 44,
			"tafsir": "Allah refutes the accusations of the infidel Meccans for two reasons. First, the shirk religion of their ancestors was not based on a holy book from Allah; and secondly, that religion was not taught by His prophet. The true religion must have holy books as the basis of its teachings, because the human mind is not guaranteed to be true. Allah said: Or did We give them a book before, then they held on (to the book)? (az-Zukhruf\/43: 21) Besides the holy book, religion must have a prophet sent by Allah to receive and teach the contents of the holy book. Allah says: Or have We ever sent down to them a statement explaining (justifying) what they (always) associate with God? (ar-Rum\/30: 35) The polytheistic religion of the ancestors of the Meccan infidels had no basis in the scriptures and was not taught by a prophet from Allah. Therefore, that religion is wrong, and they shouldn't follow that wrong religion. The true religion is Islam because it is based on revelation from Allah, namely the Qur'an and was conveyed by a prophet, namely Muhammad saw. They should accept the religion brought by the Prophet Muhammad."
		   },
		   {
			"id": 3651,
			"surah": 34,
			"ayat": 45,
			"tafsir": "In this verse, Allah explains that the previous peoples, such as the people of Prophet Noah, the people of 'Ad, the people of Samud, and others who because of their disbelief were destroyed by Allah and left only ruins or names. They belied Allah's verses and considered His messengers to be liars, even though they were more powerful and had greater abilities and culture. The Meccan infidels are not even one-tenth of the ummah in strength, so will they be rebellious and arrogant too? Aren't they afraid of God's wrath, remembering that earlier people who were more powerful had been annihilated by God? They should take lessons from past history, because they know very well the areas of the former peoples, because they passed them day or night on their trade trips in summer or winter, as Allah says: And verily you (the inhabitants of Mecca) will really pass through their (traces) in the morning, and at night. Then why don't you understand? (ash-shaffat\/37: 137-138)"
		   },
		   {
			"id": 3652,
			"surah": 34,
			"ayat": 46,
			"tafsir": "In this verse, Allah asked the Prophet Muhammad to invite unbelievers to do only one thing, namely to really try to get closer to Allah to seek the truth. Getting closer to seeking the truth can be done individually or together with other people in order to exchange ideas. After that, they are asked to meditate on the truth of the teachings in the Qur'an, calmly, objectively, and sincerely without being influenced by lust or envy. After they contemplate it objectively, are they still going to accuse that the one who conveyed the truth, namely the Prophet Muhammad, was not true? Isn't the teaching of the Qur'an very true? If true, the bearer of the teaching is also true. They should have come to the conclusion that he was actually a sincere person. He only wants to remind and warn people not to go astray in this world and lose money later in the hereafter. He only wants people to have faith and be good human beings, so that they will be happy in the world and avoid hell in the hereafter. Therefore, they should be grateful to him, and not accuse him of nonsense. His function as a warner is also conveyed by him in a hadith: Indeed, I am a warner for all of you before facing a harsh punishment. (Al-Bukhari history from Ibn 'Abbas)"
		   },
		   {
			"id": 3653,
			"surah": 34,
			"ayat": 47,
			"tafsir": "The Prophet Muhammad was then asked by Allah to emphasize to the disbelievers that he did not expect anything in return from his work of preaching. Even if there are strings attached, then his only wish is for them to believe. By having faith, the profit will return to them too, not to him. He himself only expects a reward from Allah for his work, not worldly benefits. He hopes to receive the reward later in the hereafter, not in this world today. Then what else is the reason they do not accept his call? If they don't also want to believe, then they need to know that Allah witnesses everything so that nothing escapes His knowledge, whether real, such as evil deeds, or the unseen, such as disbelief. Therefore, those who believe and do good will be rewarded with heaven, and those who disbelieve and do evil will be rewarded with hell."
		   },
		   {
			"id": 3654,
			"surah": 34,
			"ayat": 48,
			"tafsir": "Furthermore, the Prophet Muhammad was asked by Allah to emphasize to the disbelievers that Allah always casts the truth, namely instilling His revelations, into the hearts of His apostles. That is also what He says in another verse: (He is) the Most High in His rank, who owns the Throne, who sends down revelation by His command to whom He wills among His servants, to warn (humans) about meeting day (Doomsday). (al-Mu'min\/40: 15) The apostles were the people chosen by Allah. He knows best who deserves to be chosen by Him. Thus, humans are not authorized to question it, as He said: And when a verse came to them, they said, \"We will not believe (have faith) until it is given to us like what was given to Allah's messengers.\" God knows best where He places His apostolic task. Those who sin, will later be overwritten by Allah's humiliation and harsh punishment because of the deceit they have done. (al-An'am\/6: 124) Since the revelation was from Allah and those who received it were the chosen ones, the apostles must also be true. Likewise the teachings that he conveyed, so that humans should not argue with them."
		   },
		   {
			"id": 3655,
			"surah": 34,
			"ayat": 49,
			"tafsir": "Allah then asked the Prophet Muhammad to confirm to the disbelievers that the truth had come and falsehood would not return. The meaning of truth here is Islam, while falsehood is disbelief. When the truth comes, it will destroy the falsehood until it is pure, as Allah says: Actually, We cast the right (truth) on the false (unrighteous) then the right destroys it, then immediately (the false) disappears. And woe to you because you characterize (Allah with traits that are not worthy of Him) (al-Anbiya'\/21: 18) Thus falsehood will vanish when truth comes, and truth will prevail Word of God: And say, \" The truth has come and the falsehood has disappeared.\" Truly, the vanity must have disappeared. (al-Isra'\/17: 81) The victory of truth will make evil not appear again, either in a new form or in its original form. Back in a new form, namely the death of the old evil is replaced by another evil. Back in its original form, that is, its life returns to the dead sleaze. An example of the victory of truth is the mastery of the city of Mecca where the Prophet Muhammad entered the Grand Mosque and destroyed the idols that the infidels of Mecca placed around and inside the Kaaba. A hadith informs that: When the Prophet entered the Grand Mosque on the day of the conquest of Mecca and found many idols piled up around the Kaaba, he pierced one of the idols with the tip of his arrow and recited, \"The true has come and the false has disappeared, in fact what is vanity is something that will definitely disappear,\" and so on reading this verse 49. (History of al-Bukhari and Muslim) After the Islamization of the city of Mecca, the tribes throughout the Arabian Peninsula declared their Islam one by one. Then Islam continues to expand throughout the world, and will continue to triumph until the Day of Judgment. Thus, the victory of truth and the destruction of falsehood is only realized by struggle, as the Prophet Muhammad, his companions and leaders after them fought. In the hereafter, Islam must be true and disbelief must be wrong."
		   },
		   {
			"id": 3656,
			"surah": 34,
			"ayat": 50,
			"tafsir": "Lastly, Allah ordered the Prophet to convey to the disbelievers that if he was wrong, then the fault would be his own. But if he is right, then the truth is obtained from God. This verse shows the great responsibility of the Prophet Muhammad. He is responsible for all the contents of the da'wah that he conveys. If he is wrong in the teachings he conveys, then he will be responsible for the mistake himself, will not involve his people. But it is impossible that what he conveyed was wrong, because everything is from Allah, there is nothing that he added or subtracted. Therefore, his responsibility is to show that what he conveys is very true. Thus, those disbelievers need not doubt it and should have faith. When people believe, God hears them. When they worship Him, He knows and will accept it. When His servant prays, then His prayer will be granted. This is because He is All-Hearing, He is also very close to humans. How close is Allah to man so that He hears the whispers of his heart in the form of faith or disbelief and answers the prayers of those who pray, is described in the following verse: And indeed, We have created man and know what his heart whispers, and We are closer to him than his jugular vein. (Qaf\/50: 16) In another verse Allah says: And when My servants ask you (Muhammad) about Me, then verily I am near. I grant the request of the person who prays when he prays to Me. Let them fulfill My (commandments) and believe in Me, so that they may receive the truth. (al-Baqarah\/2:186)"
		   },
		   {
			"id": 3657,
			"surah": 34,
			"ayat": 51,
			"tafsir": "In this verse it is explained that if the Messenger of Allah saw how the disbelievers would fear Allah, then he would witness a tremendous event. At that time, the disbelievers were faced with the punishment of Allah. There is no place of escape, nor is there any possibility of help, or a place to take shelter. Therefore, they were shaken in great fear. It was at that time that they were caught easily without moving because they were already cornered in the stifling Padang Mahsyar."
		   },
		   {
			"id": 3658,
			"surah": 34,
			"ayat": 52,
			"tafsir": "It was at that time that they repented by professing their faith in Allah, His messengers, and the Qur'an. They professed such sincere faith because all the evidence they had doubted about was real and proven. Such a pledge of faith is described in another verse: And (what a horror), if you see those who have sinned bowing their heads before their Lord, (they say), \"Our Lord, we have seen and heard, then return us (to the world), surely we will do good. Indeed, we are people who believe.\" (as-Sajdah\/32: 12) Promising faith to repent at that time was no longer possible to achieve the expected purpose, because they were already in a very far place, namely the hereafter. In such a faraway place it was no longer possible to seek safety. The place to seek salvation by faith and good deeds is in the world, but that time has passed and it is no longer possible for them to return there. Therefore, their repentance and their pledge of faith is useless and impossible to accept."
		   },
		   {
			"id": 3659,
			"surah": 34,
			"ayat": 53,
			"tafsir": "It was further explained that it was no longer possible for them to look for safety in that faraway place because while living in the world they had denied themselves once. They don't want to believe in Allah, His messengers, the Qur'an, and the Last Day. The reason they don't want to believe is because they make unfounded assumptions. They think that anything else from Allah is God, accusing the Prophet Muhammad. poets, sorcerers, magicians, madmen, and so on, claim the Qur'an is fairy tales, dreams, or magic, and think it is a lie that there is an afterlife with heaven and hell. All that they stated without any basis of knowledge, but only based on conjecture. This suspicion is likened to a person throwing something unclear at random from a far place. He did not know whether the throw hit the target or not. In al-Kahf\/18: 22 this action is described by the expression: rajman bil-supernatural, namely aiming at something that is not clear haphazardly or guessing something without any basis at all."
		   },
		   {
			"id": 3660,
			"surah": 34,
			"ayat": 54,
			"tafsir": "In this verse it is explained that between the person and his hope to repent and be free from torment is completely blocked, it is impossible at all, as if a huge thick wall had been built between the two of them. The dream is the same as what the people before them hoped for. Since the beginning, these people have always been disobedient and only have faith when disaster as punishment is in sight. Of course, repentance and faith when forced to do so are not accepted, as stated in another verse: .\" So their faith when they see Our punishment is of no use to them. That is the provision of Allah that has applied to His servants. And at that time the disbelievers lost. (al-Mu'min\/40: 84-85) They do not believe in this world because they always doubt the truth of the Qur'an and hesitate to accept its truth. In fact, the Qur'an does not need to be doubted by humans, because it is a revelation from Allah, conveyed by Gabriel, received by the Prophet Muhammad, and its contents are true. Doubt will only produce disbelief, and disbelief will only result in misery in the hereafter."
		   }
	]
}
