{
	"tafseer": [
		{
			"id": 494,
			"surah": 4,
			"ayat": 1,
			"tafsir": "In this verse, Allah commands humans to fear Allah, who takes care of humans and bestows His blessings. He is the One who created man from a single person, namely Adam. Thus, according to jumhur mufasir, Adam was the first human created by God. Then, from that one self, Allah also created his partner, who is usually called Eve. From Adam and Eve, humans were born. In the Qur'an the creation of Adam is mentioned from clay (al-Anam\/6:2; as-Sajdah\/32:7; Shad\/38:71 and in several other verses). In an-Nisa\/4:1 it is stated \"... and (Allah) created his partner (Eve) from himself; ...\" The words in the first verse of surahh an-Nisa often cause misunderstanding among the laity, especially in among women, because there is an assumption that women were created from Adam's rib, which is often questioned by feminist circles. The verse only mentions ... wa khalaqa minha zaujaha, which is translated as creating his partner from himself; then there are those who say that the woman was created from Adam's rib, and the statements contained in some of these hadiths are thought to be from the Al-Qur'an. In the Qur'an the name Eve does not even exist, there is only the name Adam. The name Eve (Eve) is in the Bible (\"Man gave the name Eve to his wife, because she is the mother of all living things.\" (Genesis iii. 20), (Hawwa from the Hebrew word heva, read: hawwah, which means life ). The statement that woman was created from a man's rib is found in the Old Testament, Book of Genesis ii. 21 and 22: \"Then the Lord God caused the man to fall into a deep sleep; while he was sleeping, the Lord God took one of his ribs and closed up the place with the flesh. And from the rib that the Lord God took from the man, He built a woman, then brought it to the man. \" Then once again God commands people to fear Him and often use His name in prayer to get what they need. According to the custom of the Jahiliah Arabs, when they ask something or ask someone for something, they say the name of Allah. Allah also commands that humans always maintain silaturra hmi between families by making goodness and virtue which is one of the means of bonding friendship. Human Biology provides information to us that humans with male genitalia have XY sex chromosomes, while humans with female genitalia have XX sex chromosomes. The verse above explains that \"man was created from one self and from it Allah created his wife\". This verse explains to us that 'the one self is of course male, because the next sentence states, 'the wife was created from him. From the point of view of Human Biology this is very appropriate, because the sex-chromosome XY (male) can degrade XY or XX chromosomes; while the XX (female) chromosome is unlikely to form XY, because where did the Y chromosome come from? So it is clear that men are essentially the determinants of the sex of their offspring. That one self is none other than Adam."
		   },
		   {
			"id": 495,
			"surah": 4,
			"ayat": 2,
			"tafsir": "This verse is addressed to the recipients of the mandate to look after orphans and their assets. An orphan is any child whose father has died, and is still young (has not yet reached adulthood). People who are entrusted with the mandate to look after the assets of orphans must maintain these assets in a good way. It is not permissible for him to mix the orphan's assets with his own, so that it cannot be distinguished which is the orphan's property and which is his own. It is also not justified for him to eat the treasure for himself if he is able. If this is done too, it means that he has eaten the orphan's property in an incorrect way. In this state he will get a big sin. If the orphan has reached the age of maturity and is capable of managing and using his property wisely, the property should be handed over to him immediately, as explained in verse 5 of this surah. The interpreters in interpreting the words \"orphans\" in this verse have two opinions. The first opinion interprets that what is meant by \"orphans\" here are those who are not yet mature, as a precursor to verse 5 of this surah, in line with the tafsir stated above. The second opinion interprets that what is meant by \"orphans\" here are those who are mature, in line with the reason for the revelation of this verse, the narration of Ibn Abi Â¦atim from Said bin Jubair that a man from the Banu Gatafan tribe kept a large amount of property belonging to children orphan, that is, the child of his sibling. When the boy was old, he asked for his treasure, but his uncle refused to give it to him. This was complained to the Prophet Muhammad, then this verse was revealed. As-salabi narrated from Ibn Muqatil and al-Kalbi that the boy's uncle when he heard this verse said, \"We obey Allah and His Messenger, we seek refuge in Allah from great sins.\""
		   },
		   {
			"id": 496,
			"surah": 4,
			"ayat": 3,
			"tafsir": "Allah explains that if you are unable to act fairly or cannot refrain from eating the orphan's property, if you marry him, then do not marry him with the aim of spending his wealth, but marry him to someone else. And you choose another woman that you like one, two, three, or four, with the consequence that you treat your wives fairly in the distribution of overnight time (turns), maintenance, housing and other material things. Islam allows polygamy with certain conditions. But basically one wife is better, as the verse continues. Before this verse was revealed, polygamy already existed, and was also carried out by prophets before the Prophet Muhammad. This verse limits polygamy to four people. If you can't do all of that fairly, then it's enough for you to marry only one person, or treat him as the wife of a slave that you have without a marriage contract under forced circumstances. It is enough for them if you fulfill a living for their life. This is a good effort so that you do not fall into acts of persecution. Servants and slavery in the sense of this verse no longer exist because Islam has tried to eradicate them in various ways. When Islam was born, slavery in the West and East world was very fertile and became a legal institution, as we can see in ancient history, and it is also described in several passages in the Bible: Free people can become slaves only because: they cannot pay their debts, they steal, they are very father (so forced to sell himself), Jewish and non-Jewish slaves (Gentile) status is different and so on. The Prophet Muhammad was sent at the beginning of the 7th century A.D. When he started preaching, slavery around him and on the Arabian Peninsula was very prolific and commonplace. His attitude towards slavery, as described in the Qur'an, was very different from that of society in general. He taught that slavery must be abolished and deal with it wisely. Without having to condemn slavery, he taught that slaves should be treated in a humane way and that their abolition must be gradual, not all at once and in a radical way as in eradicating shirk and paganism. And the ultimate goal is to abolish slavery altogether. This can be seen in several provisions of Islamic law, one can erase one's sins by freeing a slave, which is also the provision of a pious and pious person. The Messenger of Allah has set a clear example by freeing a slave (Zaid) and placing him as a member of his family, appointed as his adopted son and has the same status as the Quraysh family. It is true, a good and harmonious household can be realized by a monogamous marriage. The existence of polygamy in the household can cause many things that can disturb the peace of the household. Humans with their nature of events need things that can deviate from monogamy. This is not because of sex drive alone, but rather to achieve their own benefit, for which Allah allows (according to the fuqaha) or provides leniency (rukhsah according to the commentators) for men to practice polygamy (to have more than one wife). The reasons that make a person polygamous are as follows: a. If a household does not yet have a child, and according to a doctor's examination, the wife is infertile, even though from marriage it is hoped that she will be able to have children, then polygamy is the best solution. b. For women, the period of stopping menstruation (monopouse) comes more quickly, on the other hand for a man even though he has reached old age, and his physical condition is healthy he still needs to fulfill his sexual desires. In this situation is it permissible for a man to commit adultery? So this is where the wisdom of permissibility of polygamy is felt. c. As a result of war, for example, the number of women is more than men. This atmosphere is easier to cause negative things for people's lives if the door to polygamy is not opened. In fact, the tendency for the number of women to outnumber men has now become a reality, even though there was no war."
		   },
		   {
			"id": 497,
			"surah": 4,
			"ayat": 4,
			"tafsir": "Husbands are to give a dowry in the form of something they have promised their wife at the time of the marriage ceremony that is famous for (mahar musamma) or an amount of dowry that is usually received by the family of a wife who is famous for (mahar missile) because there is no stipulation regarding that amount beforehand. The giving of this dowry is a sign of affection and is proof of the bond between a man and a woman to build a household. However, if the wife is willing and sincere, then in this case there is nothing wrong with the husband taking advantage of the dowry. This verse shows that the dowry is prescribed by religion. During the Jahiliyyah, they married without a dowry."
		   },
		   {
			"id": 498,
			"surah": 4,
			"ayat": 5,
			"tafsir": "Guardians and executors of wills (wasi) who care for orphans are to hand over the orphan's assets under their control when the orphans are adults and are able to look after their assets. If you can't afford it, keep the treasure as well as possible because wealth is the capital of life. All the needs of orphans such as clothing, food, education, treatment and so on can be taken from the profits of the property if the property is invested (invested). To them should speak gently full of affection and treat them like their own children."
		   },
		   {
			"id": 499,
			"surah": 4,
			"ayat": 6,
			"tafsir": "Before the assets are handed over to the orphans, if they are of age and are able to use the assets, they are first given a test. Is it true that he has been able to maintain and use his wealth properly, as understood by the Syafii School. The Hanafi school of thought requires the guardian to hand over assets at the age of maturity on condition that he is intelligent, capable and at the age of 25 even if he is not intelligent. Don't let the guardians take part in taking or consuming the orphan's property excessively. If the guardian is a person who can afford it, he should refrain from consuming the orphan's property. But if the wali is indeed a person who is in a state of deprivation, then he may eat it properly and not exceed the limit. When the said submission period has arrived, the surrender should be made in the presence of two witnesses to avoid disputes in the future. God always witnesses and oversees what is done by humans. Nothing is hidden from Him either on earth or in the sky."
		   },
		   {
			"id": 500,
			"surah": 4,
			"ayat": 7,
			"tafsir": "If orphans receive inheritance from both parents or other relatives, they have the same rights and shares. Each of them will get the portion that has been determined by God. No one can take away or reduce their rights."
		   },
		   {
			"id": 501,
			"surah": 4,
			"ayat": 8,
			"tafsir": "And if at the time the distribution of the inheritance is held, relatives who are not entitled to inheritance, as well as the poor or orphans, are also present, then they should also be given a small share as a gift according to the sincerity of the heirs so that they don't just witness the inheritance. heir gets a share. And to them while giving the gift said words that pleased them. This is very useful for maintaining friendship and brotherhood so that it is not broken by jealousy and envy. In addition, for the heirs this shows gratitude to Allah."
		   },
		   {
			"id": 502,
			"surah": 4,
			"ayat": 9,
			"tafsir": "People who are nearing the end of their lives are warned to think, do not leave children or weak families, especially about the welfare of their lives in the future. For that always fear and draw closer to Allah. Always speak softly, especially to the orphans they are responsible for. Treat them like you would treat your own biological child."
		   },
		   {
			"id": 503,
			"surah": 4,
			"ayat": 10,
			"tafsir": "Once again this warning is given to people who are unfair and unjust to the orphans in their care. Whoever eats the property of orphans unjustly, that is, does not heed the rules that have been set by Allah, it is as if they have filled their stomachs with fire."
		   },
		   {
			"id": 504,
			"surah": 4,
			"ayat": 11,
			"tafsir": "As for the reason for this verse being revealed, according to a hadith narrated by Ahmad, Abu Daud and Tirmizi from Jabir's friend, which means: The wife of Saad bin Rabi came to the Messenger of Allah and said, \"O Messenger of Allah! These are the two daughters of Saad bin Rabi. She has died in the Battle of Uhud, all their wealth was taken by their uncle and nothing was left for them while they could not get married if they had no wealth.\" The Messenger of Allah said, \"Allah will give the law,\" then the inheritance verse came down. Then the Messenger of Allah went to the uncle of the two children and said, \"Give two-thirds of Saad's property to the child and to the mother give one-eighth, while the rest take it for you.\" In this verse, Allah conveys a will that obliges Muslim converts to complete the inheritance for children left by their parents, whether they are male or female. If the heir consists of sons and daughters, then give the male two shares and the female one share. As for the wisdom for boys, they get two parts, because men need wealth to meet their own needs and support his wife and children, while women only need to pay for themselves. As for when she is married then the obligation of maintenance is borne by her husband. Because it is natural if he is given one part. What is meant by children or other heirs in this ayat is in general. Unless there are obstacles that prevent children or other heirs from receiving inheritance rights. As for what can prevent a person from receiving his inheritance rights are: 1. Different religions, as the Prophet Muhammad said: \"There is no mutual inheritance between people of different religions.\" (History of Ibn Majah). 2.Killing the heir. This is based on hadith and ijma. 3. If the heir becomes a slave. 4. The inheritance of the prophets may not be divided up as inheritance. Furthermore, it is determined by Allah if someone dies only having more than two daughters and no sons, then they will receive two-thirds of the total assets, then divided equally between each of them. But if the one left behind is a daughter alone, she will receive half of the inheritance. The remaining one-third (if only two daughters) or half (if only one daughter) remains is distributed to the other heirs according to their respective provisions. It should be added here that according to the verse, girls get 2\/3 if there are more than two or in other words, starting from 3 and up. It is not stated how many shares if there are only two girls. In the opinion of the majority of scholars, those who are included in the number three and above receive 2\/3 of the inheritance. From the details above, it is known that girls never spend all their assets. At most only get 1\/2 of the amount of treasure. Unlike a son, if there are no other heirs and he is alone, then he takes all of the inheritance. And if there are more than one son, it will be divided equally among them. About wisdom and this difference has been explained above. Also explained about the rights of both parents. If someone dies and he leaves children, both boys and girls, then each parent, namely the mother and father, gets 1\/6 of the total assets. Conversely, if he does not leave children, the mother gets 1\/3 of the total assets and the rest is given to the father. If the deceased, apart from leaving the mother and father, were also other siblings, male or female two and above, according to jumhur, the mother gets 1\/6 and the father gets the rest. After explaining the amount of the distribution for children, mother and father, it was explained again that the distribution was only carried out after the will and debt matters had been settled. Even though the verse prioritizes the mention of a will from debt, in its implementation, according to the Prophet's Sunnah, the payment of debt should take precedence. Between parents and children, you don't know which one is closer or more beneficial to you. Therefore, do not divide the inheritance as done by ignorant people who give inheritance rights only to people who are considered capable of joining the war, will defend their families and do not give inheritance rights at all to young children and women. Follow what Allah has determined because He knows better what is beneficial for you both in this world and in the hereafter. The law of inheritance is a provision from Allah that must be carried out by Muslims. Know that Allah knows everything and what He determines must contain benefits for the benefit of humans."
		   },
		   {
			"id": 505,
			"surah": 4,
			"ayat": 12,
			"tafsir": "This verse explains the details of the division of inheritance rights for husbands or wives who have died. A husband who is abandoned by his wife if there are no children then he gets Â½ of the property, but if there are children, he gets Â¼ of the inheritance. This is also only given after the deceased's will or debt has been completed first. As for the wife who was abandoned by her husband and left no children, she gets ¼ of the property, but if there are children, the wife gets 1\/8. Then they are reminded that this right will only be given after completing the will and debt matters. If a person dies while he does not leave a father or children, but only leaves a brother or sister who is a mother, then each of the brothers and sisters, if they are alone, their share is 1\/6 of the inheritance and if there are more than one, they will receive 1\/3 and then divided equally between them. In this case there is no difference between men and women. Allah also explained that this was carried out after completing matters related to the will and debts of the deceased. Allah warns that the will should not harm the heirs. For example, someone makes a will solely so that his inheritance is reduced or bequeaths more than 1\/3 of his wealth. This is all detrimental to the heirs."
		   },
		   {
			"id": 506,
			"surah": 4,
			"ayat": 13,
			"tafsir": "All of this is a provision from Allah that must be carried out by those who fear Him. Allah is All-Knowing of what is more beneficial to mankind and Most Forbearing. He does not immediately punish His disobedient servant so that there is an opportunity for him to repent and return to the path that pleases Him. Whoever obeys to do what is prescribed by Him and stay away from what He has forbidden, they will be given the happiness of life in the hereafter."
		   },
		   {
			"id": 507,
			"surah": 4,
			"ayat": 14,
			"tafsir": "On the other hand, whoever is disobedient and does not comply with what Allah and His Messenger have commanded, Allah will give a warning that he will enter that person into a hell full of torment and suffering."
		   },
		   {
			"id": 508,
			"surah": 4,
			"ayat": 15,
			"tafsir": "Regarding the law relating to people who commit heinous acts (adultery). Whereas if there are Muslim women who have ever had a husband (muhsanah) who have committed heinous acts, then before being sentenced to them they must first be examined by four fair male witnesses. If their testimony can be accepted, then the woman must be locked up or imprisoned in her house and cannot leave until she meets her death. According to commentators, the way out given by Allah and His Messenger is to come with a clearer punishment for adultery, namely by the revelation of the 2nd verse of surahh an-Nur, which the Prophet then details again with his hadith, that is, if the adulterer has been married before, then the punishment was stoning, namely being stoned to death and if a virgin\/boyfriend was flogged a hundred times, according to a history."
		   },
		   {
			"id": 509,
			"surah": 4,
			"ayat": 16,
			"tafsir": "As for people who have never been married, men or women who have committed adultery, if the witnesses as referred to in ayat 15 above are complete, then their punishment will be left to the Muslim community at that time, what punishment is considered appropriate\/according to their actions. This punishment is temporary before the revelation of the 2nd verse of surahh an-Nur with the details of the Prophet's hadith as mentioned above. This punishment is carried out as long as both of them have not repented and regretted their actions. If they repent, they should be accepted and their punishment should stop. Indeed, Allah is Most Gracious and Merciful to His servants. Such was the punishment for adultery at the beginning of Islam before the revelation of verses regarding the punishment of adultery (stoning or flogging)."
		   },
		   {
			"id": 510,
			"surah": 4,
			"ayat": 17,
			"tafsir": "person's repentance can be accepted if he commits an immoral act, namely disobedience to Allah either intentionally or not, or is done because of a lack of knowledge, or because of a lack of patience or because he really does not know that the act is forbidden, then comes his awareness, then he regrets his actions and he immediately repented asking for forgiveness for all his mistakes and promised with all his heart not to repeat these actions again. Such people whose repentance is accepted by Allah, because Allah is All-Knowing of the weaknesses of His servants and also knows the conditions of His servants who are in a weak state, cannot be separated from doing wrong intentionally or not."
		   },
		   {
			"id": 511,
			"surah": 4,
			"ayat": 18,
			"tafsir": "But repentance will not be accepted by God if it comes from a person who is always wallowing in sin until his death comes before he repents. Such a person's whole life is full of stains and sins, there is not even the slightest good deed in him. Repenting when someone is near death is actually not regret for sins and mistakes, but because he has given up on enjoying the next life. So his repentance is just a lie. Likewise Allah will not accept repentance from a person who dies in a state of disbelief, disbelief of Allah's religion. To these people, namely people who just repent after death is in front of them or people who die in their denial, Allah threatens to give a painful punishment later on the day of reckoning according to what they have done during their life on earth. The levels of people who repent who have been warned are detailed by the Sufis as follows: 1. There are people who have a soul that is basically (his nature) perfect and always in goodness. Such a person, if one day accidentally makes even the slightest mistake, he will feel it as a very big thing. He was very sorry for the incident and immediately he corrected his mistake and distanced himself from the act. Such lust is called nafs mutmainnah. 2. There are times when a person has a soul that is basically unstable, unsteady, so that all his actions are driven by his lust and lust alone. The nature that is so deep in him and has been ingrained. After all this time he wallowed in sin by following the will of his lust, finally Allah's guidance and taufik came to him so that he realized and struggled to correct his wrong actions and he returned to the guidance given by Allah. This kind of thing is indeed rare and those who get it are truly people who are guided by Allah. Lust like the above is called nafs anger. 3. There are also people who have a soul where to do big sins he can be introspective, so he never does them, but regarding small sins he often commits, with earnest struggle, sometimes his lust and lust can be subdued and guidance wins sometimes it even happens the other way around. Such lust is called musawwilah nafs. 4. Finally there are people who have lawwamah nafs. This person is completely unable to avoid committing sins, both big and small. When he commits a sin, his consciousness comes and he repents and asks for forgiveness. But one day the urge for his lust came again to commit a sin and he did it again and then repented again after his awareness came, and so on. Repentance like that is repentance of the lowest degree, however, people like this are still encouraged to always hope for forgiveness from Allah."
		   },
		   {
			"id": 512,
			"surah": 4,
			"ayat": 19,
			"tafsir": "This verse does not mean that inheriting a woman is not permissible by force. According to some ignorant Arab customs, when a person dies, his eldest son or other family members inherit the widow. The widow may marry herself or be married to another person whose dowry is taken by the heir or may not remarry. Muslims are prohibited from continuing the ignorant Arab custom of inheriting and controlling women by force. This is very torturing and demeaning to the dignity of women. It is also not permissible to carry out actions that cause trouble and harm to women, such as requiring them to return the dowry they received from their husband during their previous marriage to the heirs of the deceased husband as a ransom for themselves, so that they may remarry with another man. The verse above explains the prohibition by prohibiting marriage with them and Muslims are not allowed to take anything that has been given to the wife or wife of one of the heirs, except when they do real heinous work, such as disobedience, adultery, stealing and so on. The accidents he does are also sometimes caused by these treasures. Husbands to get along with wives well. Don't be stingy in giving a living, don't scold them with excessive anger or beat them or always put a gloomy face on them. If a husband hates his wife because the wife has defects in her body or has traits she doesn't like or serious hatred for his wife arises because his heart is attached to another woman, then the husband should be patient, don't be in a hurry to divorce them. Hopefully what the husband hates is precisely what will bring goodness and happiness to them."
		   },
		   {
			"id": 513,
			"surah": 4,
			"ayat": 20,
			"tafsir": "If a husband wants to replace his wife with another wife, because he can no longer endure his displeasure with his wife, and the wife has not committed a crime, then the husband should not take the goods or property that has been given to him. In fact, the husband is obliged to give consolation gifts to him because the separation was not at fault or at the request of the wife, but solely because the husband seeks benefit for himself. Allah warns: do husbands want to be sinners by still asking for their property back with the reasons they are looking for? Because it is not uncommon for a husband to make bad accusations against his wife so that there is a reason for him to divorce and ask for the property he has given back."
		   },
		   {
			"id": 514,
			"surah": 4,
			"ayat": 21,
			"tafsir": "How is it possible that the husband will take back the property because the separation is solely to follow his own desires, not to follow the rules outlined by Allah, whereas between the husband and wife a strong bond has been established, they have been getting along as husband and wife for so long and there is no also mistakes made by the wife. Besides that, the wife has also carried out her duties and given her husband's rights well and she has accompanied her husband with all his ups and downs for a long time. So there is no reason for the husband to demand nonsense from the property that has been given to his wife."
		   },
		   {
			"id": 515,
			"surah": 4,
			"ayat": 22,
			"tafsir": "It is unlawful to marry women who have been married to by the father except for past actions before the revelation of this verse, then this is forgiven by Allah. Allah forbids this act because it is very heinous, contrary to common sense, very bad because God's wrath and evil ways according to civilized human customs."
		   },
		   {
			"id": 516,
			"surah": 4,
			"ayat": 23,
			"tafsir": "Other women who are also forbidden to marry consist of: 1. In terms of lineage (hereditary), a. Mother, including grandmother and so on. b. Children, including grandchildren and so on down. c. Sisters, either siblings, father or mother only. d. Sister from the father and from the mother. c. The niece of either a brother or a sister. 2. In terms of breastfeeding: a. Mothers who breastfeed (breastfeeding mothers). b. Breastfeeding sisters. c. And then women who are forbidden to marry because of the same lineage are also forbidden to marry because of breastfeeding. This is based on the words of the Prophet Muhammad: \"Forbidden because of what milk is forbidden because of lineage.\" (Hadith Muttafaq 'alaih). It can be added here that the issue of how many times to breastfeed which can make marriage illegal, there are several opinions: a. Ali bin Abi Talib, Ibn Abbas, Hasan, az-Zuhri, Qatadah, Abu Hanifah and Malik are of the opinion that there is no certain size for making marriage forbidden. A lot or a little as long as it is clear that the child is suckling, then it is enough to make him a suckling child. They take this opinion based on the zahir verse which does not mention the limitation of breastfeeding. b. It is narrated that Imam Ahmad is of the opinion that the limit of breastfeeding is a minimum of three times to breastfeed before becoming a suckling child. This is based on a history which means: \"Breastfeeding once or twice is not forbidden.\" c. Abdullah bin Masud, Abdullah bin Zubair, Syafii and Hambali are of the opinion that the size is at least five times breastfeeding. Likewise regarding what is the age limit for a child who is breastfeeding, in this case the scholars have the opinion: a. The age of the child must not be more than two years. This opinion is taken based on the word of Allah: And mothers should breastfeed their children for two full years, for those who want to breastfeed perfectly¦ (al-Baqarah\/2: 233). Also the words of the Messenger of Allah which means, \"Not considered a relative except at the age of two years\" (History of Ibn Abbas). This opinion was held by Umar, Ibn Masud, Ibn Abbas, Syafii, Ahmad, Abu Yusuf and Muhammad. b. The age limit is before weaning comes (stops breastfeeding). If the child has been weaned even though he is not yet old enough to be two years old, he is no longer considered a suckling child. Conversely, if he is more than two years old but has not been weaned, then if he is breastfed, the law of breastfeeding still applies. This opinion is held by az-Zuhri, Hasan, Qatadah and one of the narrations of Ibn Abbas. 3. In terms of marriage: a. The mother of the wife (in-law) and so on and up. b. Children of the wife (stepchildren) whose mother has interfered, and so on down. c. Children's wives (son-in-law) and so on down like grandchildren's wives. It should be noted that in forbidding marrying stepchildren, mentioning \"those in your care,\" does not mean that those outside of their care may be married. This is called only because according to custom, that is, a woman who remarries while she has a child who is still under her care, usually the new husband is the one who is responsible for the child and takes care of it. Then it was added that if the mother has not been interfered with and then divorced, then it is permissible to marry the stepdaughter. 4. It is also forbidden to marry women because of a reason with the understanding that if the cause is lost, then the prohibition is also lost, which is like bringing together (blending) two brothers. Similarly, pairing someone with his aunt. The latter is based on the hadith of the Prophet Muhammad. It was narrated from Abu Hurairah that the Messenger of Allah said, \"It is not permissible to combine a woman with her aunt (father's sister) and between a woman and her aunt (mother's sister).\" (Al-Bukhari) Based on the verses and hadith above, fiqh scholars make one rule, namely, it is forbidden to gather (between) between two women who have a kinship relationship (kinship and breastfeeding), if one of them is a man, then marriage is forbidden between the two, like gathering between a woman and her grandson. Thus it is permissible to reconcile (blend) between a woman and her stepdaughter, because the relationship between the two is not a kinship or breastfeeding relationship, but only a sexual relationship. This law applies since this verse was revealed and what has been done before the revelation of this provision can be forgiven. Then the verse closes the provisions it gives by explaining the characteristics of Allah, who is the Most Merciful and the Most Forgiving. He gives forgiveness for the wrong deeds that His servants have done in the days before the advent of Islamic law, and also gives forgiveness to His servants who immediately repent when they do something wrong. The verse above states about propriety and things that are biologically not good to do in choosing a partner in marriage. In terms of propriety, it is clearly stated that it is not proper for a man to marry a sibling, wet nurse, mother-in-law, step-daughter or two siblings at the same time. Meanwhile, marriage between families (inbreeds - for example, sisters, aunts and nephews) is also prohibited because it will give rise to bad offspring. Regarding these two things, the explanation is like this. Allah determines who can be married and who cannot be married as stated in surahh an-Nisa\/4: 22. Brothers and sisters (as well as half brothers and sisters, etc.) are prohibited by it is legal to marry between them because their children are at an unacceptably high risk of being disabled. The closer the parents are related, the more likely the offspring will be disabled. An incestuous relationship (incest) is a loving relationship of a sexual nature committed by a couple who have close family ties or kinship, usually between a father and daughter, mother and son, or between siblings or half-siblings. The meaning of this term is more socioanthropological than biological (compare deep-relative for the biological sense) although part of the explanation is biological. Discordant relationships are known to have a high potential to produce offspring that are biologically weak, both physically and mentally (disabled), or even lethal (deadly). This phenomenon is also commonly known in the animal and plant world because of the increased coefficient of kinship in its offspring. The accumulation of genes carrying the weak traits of both \"parents\" in one individual (child) is expressed because the genotype is in a homozygous condition. There is a strong genetic reason for these laws which is easy to understand. Everyone has two sets of genes, there are about 130,000 pairs that determine how a person forms and functions. Each person inherits one gene from each pair belonging to each parent. Unfortunately, today's genes contain many errors, and these errors come in many forms. For example, some people let their hair grow over their ears to hide the fact that one ear is lower than the other -- or maybe someone's nose is not quite in the middle of their face, or someone's jaw is a bit out of shape -- and so on. The more distant the parents are, the more likely they are to have different faults in their genes. Children, inheriting one set of genes from each parent, are likely to end up with a gene pair containing a maximum of one bad gene in each pair. Good genes tend to overrule bad ones so that a disorder (a serious one, of course) doesn't occur. However, the more closely related two people are, the more likely they are to have the same faults (weaknesses) in their genes, because they are inherited from the same parents. Therefore, a brother and a sister are more likely to have the same fault in their genes. A child resulting from such a fusion of siblings may inherit the same bad gene in the same gene pair from both of them, resulting in two bad copies of the gene and serious damage. Socially, discordant relationships can be caused, among other things, by rooms in the house that do not allow parents, children or siblings to separate rooms. Discordant relationships between parents and children can also occur due to unhealthy psychosocial conditions in the individuals involved. Some cultures tolerate incestuous relationships for certain interests, such as politics or racial purity. As a result of these things, discordant relationships are unwanted in almost all peoples of the world. All major world religions prohibit incestuous relations. In Islamic religious rules (fiqh), for example, the concept of mahram is known which regulates social relations among individuals who are still related. It is not permissible for a person to have romantic or marital relations with parents, grandparents, siblings, half-siblings (non-adopted siblings), parents' siblings, nephews, and grandchildren."
		   },
		   {
			"id": 517,
			"surah": 4,
			"ayat": 24,
			"tafsir": "The word al-muhshanat in the Qur'an has four meanings, namely: 1. A married woman, that is what is meant in this verse. ¦When they are married¦ (an-Nisa\/4:25). 2. Free women, as stated in the word of Allah: And whoever among you does not have the means to marry a free believing woman, then (it is permissible to marry a woman) who is a believer from your slaves.¦(an-Nisa\/ 4:25). 3. Women who maintain their morals, as in the word of God: Women who take care of themselves, are not adulterers (an-Nisa\/4:25). 4. Muslim women. Thus it is permissible for a Muslim to marry a woman who has become a prisoner of war who has become his slave, even though she is still married, because her previous marriage relationship with her husband was broken, because she was taken prisoner without her husband and her husband was in enemy territory, provided that the woman has menstruated once. to prove the emptiness of her uterus. Some scholars require that her husband not be captured with her. If he is held captive with the woman, then no one else may marry him. This provision is no longer valid today. (See Tafsir an-Nisa\/4: 3) It is lawful for Muslims to seek women with their wealth to marry, with the intention of establishing a happy household, caring for new offspring and not for adultery. So for the wives you have interfered with, give them their perfect dowries as an obligation with the intention of maintaining honor and never intending to commit adultery. The dowry given is not merely a reward from the man or the woman's willingness to be his wife, but also as a sign of love and sincerity. Therefore in another verse (an-Nisa\/4:4) it is mentioned that the dowry is a gift. If there is a discrepancy between the amount of dowry promised and what is given, there is nothing wrong with the wife giving up part of the dowry. Allah knows the good intentions contained in each heart. So give their agreed dowry voluntarily. The dowry must be paid before the marriage contract or before mixing, even according to the Hanafi school of thought it must be paid as long as the two of them have secluded themselves in a closed place. Some scholars use this verse as the basis for establishing the law of mut'ah marriage, namely marrying a woman for a certain time limit such as a day, a week, a month or more with the aim of having fun. At the beginning of Islam it was permissible or given leeway by the Prophet to do so. At first, he gave concessions to his friends who went to war in the way of Allah to marry within a certain time limit, because he was afraid they would fall into adultery, because they had been separated from their families for so long. The leniency includes: \"Doing the lesser harm between the two harms.\" Then Mut'ah marriage is forbidden, based on authentic hadiths which explain that Mut'ah marriage is forbidden until the Day of Resurrection. Caliph Umar even mentioned the prohibition of mutah in his speech on the pulpit, and none of his friends disputed this."
		   },
		   {
			"id": 518,
			"surah": 4,
			"ayat": 25,
			"tafsir": "From the beginning of surahh an-Nisa to verse 25, a picture of the life of the transition from the Jahiliyah period to the beginning of Islam is shown. First, the issue of ownership of orphaned assets by relatives from the father's side, second, men who can marry women an unlimited number of wives are limited to four wives, and third, family issues and slavery, especially female slaves. At that time, slavery, which had been institutionalized throughout the world, was no exception in the Arabian Peninsula during the Jahiliyya era, which was indeed very fertile. Gradually all these ills of society have to be changed, and this is what started at the beginning of Islam, as we can see in the above verses. The Qur'an has recorded the events that took place at that time, and this is necessary, because Islamic teachings in this matter abolish slavery in any form (2: 177, 9: 60), exemplified by the Prophet who freed slaves who owned him, by Abu Bakr as-Siddiq who had bought 7 slaves from his master and then released them as free people, including Bilal (see Tafsir 92: 17-18). In zakat, the 5th asnaf of receiving zakat can be used to free slaves. Marrying an independent woman demands conditions and obligations that must be fulfilled by the husband, such as giving a dowry, maintenance and so on. So if someone does not have enough money and means to marry an independent woman who believes, then he is allowed to marry a slave who believes. People who marry slaves usually get unfavorable treatment in society, they often even get ridicule and ridicule. If a person married to a slave treats well and patiently endures ridicule and ridicule, as long as he sails the ark of his household, Allah is Forgiving and Most Merciful. All of these provisions, as a continuation of the previous ayat, are inseparable from the events of the war that took place at that time with all its consequences so that prisoners of war could in certain cases be made into slaves and slaves, as had been the provisions of the world at that time. What has been recorded in the Qur'an shows us how bad the condition of that society, the ignorant society, is. In addition to slaves who have been institutionalized so deeply in society, coupled with the stipulation, that every prisoner of war must become a new slave. Gradually such social problems that are considered normal in society must be changed. In this case the change certainly can not be done all at once, but gradually. One way is by redeeming or buying the slaves and then being freed, and believers must strive for that, as has been stipulated in the Al-Qur'an mentioned above. Thus all kinds of social class, especially slavery must be abolished, and human dignity must be returned to its nature. Humans are seen only from their piety (49: 13). In Muslim society there should not be slavery, including colonialism."
		   },
		   {
			"id": 519,
			"surah": 4,
			"ayat": 26,
			"tafsir": "This verse explains to the Muslims what is not clear to them and gives directions to the path followed by the previous prophets and salihin, namely the law mentioned in verses 19, 20 and 21 of which concerns domestic relations between husband and wife, such as get along with the wife in the best way possible and the divorced wife's dowry cannot be taken back because the dowry is the full right of the divorced wife. If they follow Allah's instructions, by carrying out His commands and doing good deeds, those deeds will erase their sins."
		   },
		   {
			"id": 520,
			"surah": 4,
			"ayat": 27,
			"tafsir": "Allah forgives them by carrying out His commandments and avoiding His prohibitions, so that they purify and purify themselves physically and spiritually, even though those who follow their desires and desires always turn away from the straight path, and attracting believers to fall with them into the valley of error, because by carrying out Allah's commands and obeying them, what He wants will be achieved for their good and happiness. Allah forbids marrying the women mentioned in verses 22, 23 and 24 because marrying these women will cause damage to society and disrupt kinship and family relationships, while family is the backbone of people's happiness. Women other than them may be married to maintain the continuity of offspring, prevent society from chaos and mired in adultery and so on."
		   },
		   {
			"id": 521,
			"surah": 4,
			"ayat": 28,
			"tafsir": "Allah wants leniency for the Muslims, because that allows those who are less able to afford to pay for free women to marry a slave. God also informs that man was created in a weak state, especially in the face of the temptations of his lust. Therefore, Muslims should guard themselves so that they do not commit transgressions, such as adultery and so on. This is all in order to fortify humans from the influence of Satan and lust that can lead him down. Humans must be aware of their own weaknesses, therefore they need to fortify themselves with strong faith and need to know God's guidance and ways to overcome the temptations of their lusts."
		   },
		   {
			"id": 522,
			"surah": 4,
			"ayat": 29,
			"tafsir": "This verse prohibits taking other people's property in a vanity (not right) way, except by trade that applies on the basis of mutual consent. According to tafsir scholars, the prohibition on consuming other people's property in this verse contains a broad and deep meaning, including: a. Islam recognizes the existence of private property rights that are entitled to protection and cannot be contested. b. Private property rights, if they meet the nisab, are obliged to pay zakat and other obligations for the benefit of religion, the state and so on. c. Even if a person has a lot of assets and there are many people who need it from groups entitled to receive zakat, that person's assets cannot be taken for granted without the permission of the owner or without following a valid procedure. Seeking property is permissible by way of trading or buying and selling on the basis of the willingness of both parties without any coercion. Because buying and selling that is carried out by force is not legal even though there is payment or compensation. In an effort to get wealth there should be no element of injustice to other people, both individuals and society. Acts of acquiring wealth in vanity, for example stealing, usury, gambling, corruption, cheating, cheating, reducing the scales, bribing, and so on. Furthermore, Allah forbids suicide. According to the verse, what is prohibited in this verse is killing oneself, but what is meant is killing oneself and killing others. Killing other people means killing yourself, because everyone who kills will be killed, according to kisas law. Suicide is prohibited because it is an act of despair, and the person who commits it is a person who does not believe in God's mercy and help. Then verse 29 ends with an explanation that Allah forbids believers from consuming property in a vanity way and killing other people, or committing suicide. It is because of Allah's love for His servants for the happiness of their lives in this world and in the hereafter."
		   },
		   {
			"id": 523,
			"surah": 4,
			"ayat": 30,
			"tafsir": "This verse gives a warning to people who violate the rights of others and abuse them, by putting them into the fires of hell, which is very easy for Allah, because there is nothing that can refute, hinder or hinder Him."
		   },
		   {
			"id": 524,
			"surah": 4,
			"ayat": 31,
			"tafsir": "The commandment in this verse requests that believers stay away from and leave all work that results in grave sins. Leaving all major sins is not just to avoid His punishment, but also a good deed that can erase small sins that have been committed. The act of leaving a grave sin is not a light and simple matter. Someone who is able to refrain from committing a major sin when the opportunity arises means that he has a firm level of faith, as well as solid patience. Such a person is promised by God to enter heaven. Regarding what is considered a major sin, the scholars have different opinions because of several hadiths, among which the Messenger of Allah said: \"Avoid the seven kinds of actions that are harmful. The companions asked, \"What is that, O Messenger of Allah?\" The Prophet replied, \"Associating partners Allah, killing someone who is forbidden by Allah to kill him except with the right reasons, sorcery, consuming the property of orphans, eating usury, fleeing from the battlefield during battle and accusing respectable believing women of adultery.\" (Al-Bukhari and Muslim) Muslim from Abu Hurairah) \"Shall I tell you about the greatest sins?\" We replied, \"Yes, O Messenger of Allah.\" Then the Messenger of Allah said, \"Associating partners with Allah, disobedience to both parents.\" then he sat down and said \"Know, also telling lies, and false witnesses.\" He always repeated his words until we i said, \"May the Messenger of Allah be silent.\" (History of al-Bukhari and Muslim from Abu Bahrah) Ibn Abbas when asked, \"Are there only 7 kinds of major sins?\" He answered succinctly, \"Almost seventy of them . If small sins are continuously done, they will become big sins and big sins will be erased if those who commit them repent and ask for forgiveness. According to al-Barizi's statement quoted by al-Alusi, he said, \"That major sin is every sin that is accompanied by the threat of had punishment (torture punishment in the world) or accompanied by curses which are clearly stated in the Al-Qur'an or hadith. That is the understanding of major sins and their kinds. Apart from that are minor sins. Then in this verse Allah promises that one day he will provide a glorious place, namely heaven, for those who stay away from (abandon) major sins That."
		   },
		   {
			"id": 525,
			"surah": 4,
			"ayat": 32,
			"tafsir": "Believers should not be jealous of those who receive more gifts from Allah, because Allah has arranged this world in such a way that it is intertwined with neat relationships. Humans are not the same type of ability, so that each has privileges and advantages. Not only between men and women, but also between men and women. Furthermore, this verse explains that men have a share of what they earn, so women have a share of what they earn, according to their respective efforts and abilities. Therefore, one should not be jealous of those who receive more gifts from Allah. However, he should ask Allah accompanied by earnest effort so that Allah will bestow more of His gifts without being jealous of others. Allah is All-Knowing of everything, both regarding the requests made to Him, as well as about what is more appropriate to be given to His servants. Anyone who is displeased with a gift that God has bestowed on someone, or he wants that gift to be lost or transferred from the hands of the person who received it, then that is jealousy which is prohibited in this verse. But if someone wants to have something like other people have, or wants to be rich like other people's wealth according to the popular opinion, this does not include forbidden envy."
		   },
		   {
			"id": 526,
			"surah": 4,
			"ayat": 33,
			"tafsir": "In general, this verse explains that all heirs, both parents and close relatives and people who are bound by an oath of allegiance, must receive a share of the inheritance according to their respective portions. There are several things that must be mentioned here, including: 1. The word mawalia which is translated as \"heirs\" is the plural form of maula which has many meanings, including: a. The master who liberates slaves (slaves). b. A liberated slave. c. Asabah heirs or not. 2. Ashabah are heirs who are entitled to receive the remainder of the inheritance after it has been distributed to other heirs who have a certain share or are entitled to receive all of the inheritance if there are no other heirs. The most appropriate meaning of the word mawalia in this verse is \"asabah heirs\" in accordance with the words of the Prophet Muhammad: \"Give the inheritance to each who is entitled. As for the rest, give it to the close male relative.\" (Al-Bukhari and Muslim from Ibn 'Abbas). These are the two daughters of Sa'ad bin Rabi' who were martyred during the battle of Uhud together with you. And actually the uncle of these two children has taken all of their father's inheritance, so that nothing remains. These two children will not be able to marry, unless they have wealth.\" Rasulullah replied, \"Allah will give a legal explanation on this matter.\" Give 2\/3 to Sa'ad's two daughters, an eighth for their mother, and what remains is for you.\" (History of Abu Dawud, at-Tirmidhi, Ibn Majah and Ahmad). The laws that have been determined in this verse should be carried out as well as possible. Whoever does not carry it out or deviates from these laws, then he has violated Allah's provisions and will be rewarded for that violation. Surely Allah is All-Knowing of all the deeds of His servants. According to the strongest opinion, that oath of allegiance that ever occurred during the time of the Prophet (beginning of Islam) which resulted in an inheritance relationship between those who made the oath of allegiance, then it was disakh hu the kum."
		   },
		   {
			"id": 527,
			"surah": 4,
			"ayat": 34,
			"tafsir": "Men are leaders, caretakers, defenders and providers, fully responsible for women who become wives and who become their families. Therefore, it is obligatory for every wife to obey her husband as long as the husband is not disobedient to Allah. If the husband does not fulfill his obligations and responsibilities, then the wife has the right to complain about it to the judge who has the authority to resolve the problem. According to the history of Hasan al-Bashri: \"A woman complained to Rasulullah SAW, that her husband had beaten her. Rasulullah SAW said, \"He will be subject to kisas law. So Allah sent down the verse Ar-Rijalu qawwamuna 'ala an-nisa¦\" (History of al-Hasan al-Bashri from Muqatil). It was also narrated that the woman returned to her house and her husband did not receive a kisas punishment in return for his actions, because this verse allows beating a wife who is disobedient to her husband, with the aim of educating and reminding her. What is meant by a pious wife in this verse is a wife who is characterized in the words of the Prophet Muhammad: \"The best woman is a woman who, when you see her, pleases you, and if you told him to follow your orders, and when you are not by his side he takes care of your property and takes care of himself.\" (History of Ibn Jarir and al-Baihaqi from Abu Hurairah). , such as leaving the house without the husband's permission for things that are not important, is called a wife who is nusyuz (who does not t aat). How should a husband treat a wife who is disobedient to him (nusyuz), namely advising her well. If that advice doesn't work, then the husband tries to separate beds from his wife, and if that doesn't change either, then hit her with a light punch that doesn't hit her face and doesn't leave a mark. After that, the husbands were given a warning, if the wife is obedient to her again, the husband should no longer look for ways to trouble his wife, such as uncovering past mistakes, but open a new, intimate chapter of life and forget the things that were past. past. Act kindly and wisely. because Allah is All-Knowing and Most Great."
		   },
		   {
			"id": 528,
			"surah": 4,
			"ayat": 35,
			"tafsir": "If you are worried that syiqaq (dispute) will occur between husband and wife, after carrying out the efforts mentioned above, then send a hakam (intermediary, referee, peacemaker) from the male family and a hakam from the female family. The two judges were sent by the authorities or by the husband and wife, or by the husband and wife's family. The two judges should preferably be one from the husband's family and one from the wife's family, and may be from other people. The judge's task is to find out the problems of disputes that occur and their causes, then try to reconcile the two. Such a task is fit to be carried out by a wise person even if not from the husband and wife's family who may know more about the secret of the dispute and it will be easier for both of them to resolve it. This is done to avoid divorce. If the efforts of the two judges to seek reconciliation between the husband and wife who are in dispute at the first stage are not successful, then another attempt is made to appoint two judges who are representatives of the husband and wife who are in dispute within the limits of the powers given to them. Even if this is not successful, then for the third time two judges are sought who will make a decision, and the decision is binding."
		   },
		   {
			"id": 529,
			"surah": 4,
			"ayat": 36,
			"tafsir": "Serving and worshiping God is called worship. Worshiping with sincerity, acknowledging His oneness and not associating Him with anything, is one's obligation to Allah. In other words, worship and the oneness of Allah are Allah's rights which are the obligation of humans to fulfill them. Doing worship to Allah is seen in deeds every day, such as doing what has been determined by the Messenger of Allah and has been exemplified by him, such as praying, fasting, zakat, pilgrimage and others, is called special worship. Then public worship, namely all good works done in order to obey and obey Allah alone, not because of anything else, such as helping the poor, helping and caring for orphans, teaching people, showing the way to people who go astray on their way, getting rid of things -things that can annoy people in the middle of the street and so on. Worship must be done sincerely, purifying obedience to Him and not associating Him with others. There are various kinds of human work that causes him to become polytheists, including worshiping idols as intermediaries so that his requests are conveyed to Allah. They worshiped before idols to convey their desires and intentions. Such human actions are often mentioned by Allah in the Qur'an. Allah said: And they worship besides Allah, something that cannot bring disaster to them and does not (also) benefit, and they say, \"They are our intercessors before Allah.\" Say, \"Are you going to tell Allah something that He does not know what is in the heavens and not (also) what is on earth?\" Glory be to Allah and Most High of what they associate with. (Yunus\/10:18). There are also other groups who are polytheists, as mentioned by Allah in the Qur'an, namely Christians who deify the Prophet Isa, the son of Maryam. Besides they worship Allah, they also acknowledge Jesus as their Lord. Allah says: They have made the pious (Jews) and their monks (Christians) as gods besides Allah and (also) Al-Masih son of Maryam; even though they were only ordered to worship God Almighty; there is no god but Him. Glory be to Him from what they associate. (at-Taubah\/9:31). There are many polytheists like this today, namely people who beg and ask for intercession through people who are considered holy and sacred, whether those people who are considered holy are still alive or dead. They went to his grave, where they made their wishes and prayers, they even spent the night there. They are wary of him and by being wary of it, his intention will be successful and his prayer will be fulfilled. It is not uncommon for humans to pray to stones, wooden trees, ancestral spirits, jinns, ghosts and so on. All of these are classified as acts of shirk. One's obligation to Allah is to worship Him and not associate Him with others. The Messenger of Allah said: \"From Mu'az bin Jabal, the Messenger of Allah said, \"Ya Muaz, do you know what rights Allah has over His servants, and what are the rights of servants over Allah?\" I replied, \"Allah and His Messenger are more know.” The Prophet said, “The right of Allah upon His servants is that His servants worship Him and do not associate anything with Him. The right of a servant to Allah is that Allah will not punish His servant who does not associate anything with Him.\" (Al-Bukhari and Muslim). In this verse Allah regulates obligations towards fellow human beings. After Allah commands to worship and worship By not associating Him with others, then Allah commands to do good to parents. Doing good to parents is an obligation that must be fulfilled by every human being. The command to serve Allah is accompanied by orders to do good to parents. a warning that the services of parents are truly great and cannot be valued by anything. Apart from this verse there are several other verses in the Al-Qur'an which command to do good to parents as Allah says: And We command mankind ( to do good) to his parents. His mother had conceived him in a state of increasing weakness, and weaned him at the age of two. a year. Be thankful to Me and to your parents. Only to Me will you return. (Luqman\/31:14). And your Lord has commanded you not to worship other than Him and to do good to your parents. If one of them or both of them reaches an old age under your care, then never say \"ah\" to both of them and don't yell at both of them, and say good words to both of them. (al-Isra'\/17:23). Doing good to parents includes everything, both in words and in deeds that can please both of them. Be gentle and polite to both of them, including doing good to him. Following his advice, as long as it does not conflict with God's teachings, also includes doing good. If both of them order something that is contrary to the teachings of Allah, the order may not be obeyed, but good relations are maintained between the two of them. Allah says: \"And if both of them force you to associate Me with something that you have no knowledge of, then do not obey them both, and associate well with both of them in this world, and follow the path of those who return to Me. Then only to Me where you return, then I will tell you what you have done.\" (Luqman\/31:15). This includes doing good, praying for both of them so that Allah will forgive their sins, because both of them have contributed a lot, educating, nurturing and nurturing since childhood. The order is to always do good to your parents as long as you are still in your body, because your parents are the most meritorious human beings, you are also ordered to do good to your close relatives. Relatives are people who are most closely related to someone after their parents, either because they are related by blood or because of something else. If someone has been able to fulfill his obligations to Allah as well as possible, then automatically that person's faith will become stronger and his deeds will improve. Then if he has fulfilled his obligations to his parents sincerely and faithfully, a safe and peaceful household will be created and the whole household will be happy. A safe and peaceful household will have the power to do good to close relatives and relatives. Then a great power will be gathered in society. From a society like this it will be easy to manifest the nature of helping and helping, doing good to orphans and the poor. Doing good to orphans and the poor, is not only driven by blood and family relations, but solely because of a humanitarian impulse that is grown by a sense of faith in God. It is faith in Allah that fosters compassion to provide for orphans and the poor, because there are many commands from Allah in the Qur'an which tell us to do good to the orphans and the poor. Whose hand can they rely on to help him, apart from someone whose chest is full of compassion, namely a believer who has a sense of humanity. The orphan child does not have a father who takes care of and pays for it and the poor man does not have the power to pay for his daily life. Perhaps due to weakness of body or because of not enough income from day to day. In order for them to remain good members of society and not fall into the valley of humiliation and humiliation, every human being who has a sense of humanity and has compassion must be willing to step in to help and help them, so that gradually their standard of living can be improved. Allah also commands to do good to neighbors who are close and neighbors who are far away, to colleagues, Ibnussabil and slaves. Close and distant neighbors are people who live near their house, meet frequently every day, socialize every day, and are seen every day going in and out of their house. But there are also those who interpret it by family relations, and there are also those who interpret it between Muslims and non-Muslims. Doing good to neighbors is important. because in essence it is neighbors who become brothers and family. If something happens, it is the neighbors who are the first to come to help, both day and night. Relatives and relatives who live far apart cannot be expected to quickly provide assistance when needed, like neighbors. Therefore, good relations with neighbors must be maintained, so that disputes and fights do not occur, even if the neighbors have a different religion. Prophet Muhammad SAW once mourned the child of his Jewish neighbor. Ibn Umar once slaughtered a goat, then he said to his maid, \"Have you given gifts to our Jewish neighbors?\" I heard the Messenger of Allah say: \"The angel Gabriel never stopped advising me (to do good) to my neighbors, so I thought that Jibril would give my neighbors inheritance rights.\" (Al-Bukhari history from Ibn Umar). Many hadiths that explain the obligation of neighbors well include: \"Whoever believes in Allah and the Last Day, let him do good to his neighbors\" (History of al-Bukhari and Muslim from Abu Hurairah). From Jabir bin Abdullah he said, Rasulullah SAW said, \"There are three kinds of neighbors, neighbors who have only one right, and he is the neighbor who has the lightest rights. There are neighbors who have two rights and there are neighbors who have three rights, this is the neighbor is the most important right. As for a neighbor who has only one right, that is a polytheist neighbor, he is not related by blood, he has the right to be a neighbor. As for a neighbor who has two rights, he is a Muslim neighbor, for him there are rights as a Muslim and rights as a neighbor. \"Neighbors who have three rights are Muslim neighbors who are related by blood. For them, there are rights as neighbours, rights as Muslims and rights as family.\" (History of Abu Bakr al-Bazzar). \"By Allah, do not believe, by Allah do not believe, by Allah, do not believe.\" The Prophet was asked by people, \"Who is the Messenger of Allah?\" Rasulullah replied, \"He is a person whose crime does not make his neighbor safe.\" (History of al-Bukhari and Muslim from Abu Hurairah). Rasulullah saw said: \"O Abu Zar, if you make maraq (soup) add more broth, then give it to your neighbors.\" (Muslim history from Abu dzarr). What is meant by doing good to colleagues, is a friend on a trip, or in study, or in a job where his help can be expected and needs help, so that the relationship of friendship and friendship is maintained. Setia-kawan is a symbol of ukhuwah Islamiyah, a symbol of brotherhood in Islam. Doing good to Ibn Sabil, is helping people who are on their way not for immoral purposes, or in overseas who are far from relatives and need help, when he wants to return to his country. Including Ibn Sabil, children who were found whose parents were not known. A believer is obliged to help the child, take care of him or find his parents or relatives, so that the child does not lose his life which will result in a child who is damaged spiritually and physically. Doing good to slaves, is by freeing slaves. Was it the master himself who set him free or someone else bought him from his master, then set him free. In this day and age there are no more slaves, because slavery is contrary to human rights. Islam also does not want slavery. Because of that all the slaves who were met before Islam came, were gradually freed from their masters, so that finally the slavery was over. What is meant by a person who is arrogant and proud of himself in this verse, is a person who is arrogant in his movements showing his greatness, as well as in his speech it appears that his arrogance exceeds that of other people, he is the high and noble, others are lowly and despicable. People who are arrogant and proud of themselves are not favored by Allah. Because people like that include humans who don't know themselves, forget their land and will eventually regret it. Arrogance is God's right, not human rights. Who has the nature of pride and arrogance means challenging Allah. Usually people who are arrogant and arrogant are rude and rotten in heart. He cannot fulfill his obligations properly and sincerely, both obligations to Allah and obligations to fellow human beings. There are many hadiths that denounce arrogant and arrogant people, among them, the Messenger of Allah said: \"It will not enter paradise if there is even a little pride in their heart.\" Said a friend, \"A person wants to wear nice clothes and nice sandals.\" The Prophet said, \"Indeed, Allah is beautiful and loves beauty. The arrogant nature is rejecting what is right and looking down on others.\" (History of Abu Dawud, Tirmidhi from Ibn Mas'ud). What will man be proud of, when all that he has belongs to God who has been entrusted to him for a while. Gradually, God will take everything back, along with his life and rough body, and everything will be accounted for before God later."
		   },
		   {
			"id": 530,
			"surah": 4,
			"ayat": 37,
			"tafsir": "Who is this arrogant and arrogant person and how does he act? They are people who are miserly, do not want to do good as God has commanded. They do not want to provide assistance with wealth, energy and thoughts for the benefit of fellow human beings. Besides being miserly, they influence other people to be miserly, so that other people do not spend their wealth to help people who need help. In their hearts stored greed and greed for property. Let other people live in poverty and misery, as long as they can live happily and boastfully. They hid the gift that God had given him. They pretend like people who are always in narrowness and lack. Those who are like that include humans who are not grateful to Allah, they are disbelievers for Allah's favors. For disbelievers, Allah provides a humiliating punishment, both in this world and in the hereafter."
		   },
		   {
			"id": 531,
			"surah": 4,
			"ayat": 38,
			"tafsir": "This verse describes the nature and actions of people who are arrogant and arrogant, that is, they spend their wealth out of joy. They want to help someone with their wealth, because they want people to see them, to raise them up and to be praised by people. Not because you want to pay obligations to fellow human beings. In essence, they are the same as people who are miserly, only the difference is that people who are miserly do not want to spend their wealth at all to do good to fellow human beings, instead they are always greedy and greedy to collect wealth and sometimes do not care where the wealth is obtained, whether from the street lawful or from an unlawful way. Meanwhile, happy people sometimes want to do good to fellow human beings by spending their wealth, as long as they get praise and flattery. Even for the bad ones he wants to spend his wealth, as long as he gets praise from humans. So a happy person spends his wealth not because he is grateful to Allah for His many gifts and not because he is aware of paying his fellow human beings obligations, but simply because he wants to be praised. Such actions are the actions of people who do not believe in Allah and do not believe in the Hereafter. People who believe in Allah, want to spend their wealth sincerely, not to seek praise, but only expect a reward from Allah later. What prompted the person to do this was none other than because, according to Satan's teachings, they did not want to follow God's instructions. Satan's teachings always lead humans to heinous and forbidden acts. So automatically a human being like that has become a friend and follower of satan, while satan is a bad friend. So it will be woe in the end when humans have made friends with Satan. He will be furthest from the right path that will lead to happiness in this world and safety in the hereafter. Friends have a big influence in human life. How many good people can be corrupted by being friends with bad people, and how many people become good because they are friends with good people. Be careful making friends, don't be friends with just anyone. Just as during the time of the Prophet Muhammad, the Ansar were told to be careful making friends with Jews, because it turns out that the Jews always influence the believers so they don't want to spend their wealth to help someone, with the reason that later they could fall into poverty, or it could result in misery on the day of their death. front."
		   },
		   {
			"id": 532,
			"surah": 4,
			"ayat": 39,
			"tafsir": "This verse is a question that contains a warning to humans who have the characteristics and actions as mentioned in the verse above. It is clear, they will be lucky and happy and prosperous in this world and in the hereafter if they believe in Allah and the Last Day and are willing to give some of the sustenance that Allah has given them for the benefit of fellow human beings. The nature of people who are arrogant and arrogant and those who are miserly, it is clear that it will bring harm and harm to them, and they will be punished later in the hereafter. But why don't they want to be aware and converted, and don't want to follow the teachings of Allah and the Messenger. Is it because of their stupidity or maybe because their hearts are closed to accept the truth. Expecting praise and reward from humans will bring a lot of disappointment and despair. Especially when disaster strikes, turmoil and anxiety arise in the mind and soul which results in despair and loss of hope. How many victims have fallen due to despair and loss of hope where humans dare to commit suicide because of it. If they were people of faith, surely there would be no feeling of despair and loss of hope in them. They will certainly be patient and surrender to Allah. If they receive gifts and favors, they thank Allah and use these gifts to do good deeds that are pleasing to Him. But on the contrary, if he gets a disaster, he is patient and trusts in Allah. He even considered the disaster as a test from God to strengthen his faith. Strong faith and steely belief are powerful weapons to influence lives of various shades and shapes. Sometimes it makes the heart happy and sometimes sad and sorrowful. Sometimes making someone laugh and sometimes crying tears. But in the heart of a believer there is still a belief that God knows every human action. Allah knows which people are sincere in doing good deeds and which people are doing good deeds because they expect human praise. Allah will reward a person according to his intention."
		   },
		   {
			"id": 533,
			"surah": 4,
			"ayat": 40,
			"tafsir": "This verse commands that people like to do good. Every good that someone does will not be reduced by Allah in reward, because reducing it means to persecute. It is impossible for Allah to be cruel to His servants, because Allah is perfect and Most Gracious. Every good that a person does, as long as he does it for God's sake, will be rewarded, even the reward is multiplied, up to ten times or more. Allah says: Whoever does good will be rewarded tenfold for his deeds. And whoever commits a crime will be rewarded in proportion to his crime. They are not the least bit disadvantaged (tortured). (al-An'am\/6:160). That is a sign that Allah is Most Gracious and His gifts are very wide and many. He rewards everyone who does good multiplied which is mentioned in this verse with a great reward."
		   },
		   {
			"id": 534,
			"surah": 4,
			"ayat": 41,
			"tafsir": "It also describes how the human condition in the afterlife. Allah, the Most Merciful, will not harm His servant who does good even a little, but will be rewarded multiplied for his kindness. It is also described, how the human condition will be if they face their witnesses, with their prophets. Each community will be confronted with their witnesses, such as Jews, Christians and Muslims, each community will be confronted with witnesses, namely their respective prophets. It was at that time that it could be known who was actually a follower of the prophet and who only claimed to follow the prophet, but their deeds disobeyed the prophet. So whoever has been witnessed by his prophet that he really has followed the teachings of the apostle, then that person is one of the lucky ones. If the prophet separates from them, because his deeds and beliefs are not in accordance with what the apostle taught, then they are among the losers. Prophet Muhammad saw will be a witness for Muslims later and for all human beings. Allah says: And similarly We have made you (Muslims) \"middle people\" so that you may be witnesses of human (actions) and that the Messenger (Muhammad) may be witnesses of your (actions). (al-Baqarah\/2:143). In a history, the Prophet Muhammad had tears in his eyes, while listening to this verse recited by a friend to him, thinking of how great the atmosphere in the Hereafter would be, he would clearly see his loyal and true followers and those who pretended and fake, as explained in the hadith of the Prophet: From Ibn Masud he said, Rasulullah saw said to me, \"Please, read to me the Qur'an.\" Then I replied, \"O Messenger of Allah, am I the one who will read to you, even though he was sent down to you?\" Rasulullah said, \"Yes, but I want to hear it read by someone else.\" So I read surahh An-Nisa. When I got to reading this verse (verse 41), he said, \"Now that's enough,\" and suddenly his tears started flowing.\" (Narrated by al-Bukhari and Muslim from Ibn Mas'ud)."
		   },
		   {
			"id": 535,
			"surah": 4,
			"ayat": 42,
			"tafsir": "This verse describes the regret of the disbelievers and those who disobey the Messenger of Allah on the Day of Resurrection, after seeing the severity of the punishment they will suffer. All their wrong actions, moreover their deeds of denying Allah and not obeying the teachings of the Apostle, on that day will get a proper reward. Moreover, on that day the Apostle was deliberately brought in to be a witness for their actions. How ashamed they are and regret for their actions while living in the world. To the extent that they want, they better be equated with the ground. There are even those who want to just become soil, don't become a human who will get severe punishment from God. Allah says: ¦ And the disbelievers say, \"I wish I were dirt.\" (an-Naba'\/78:40). That's how great they regret that day, regret first income, regret later useless. At that time the disbelievers could not hide in the slightest what they had done. Their disobedience to Allah and the Messenger, their arrogance and arrogance, and their mischief and joy. In short they cannot hide all their ugliness and faults. On that day no one help could help them. What they used to turn to for help and intercession, aside from Allah, all of them broke away, were unable to help and deliver them from that great torment. Allah said: (22) And (remember), on the day when We gathered them all together, We said to those who partnered with Allah, \"Where are your idols that you used to think (Our partners)?\"(23) Then there is no answer to their lies, except to say, \"By Allah, O our Lord, we do not associate partners with Allah.\" (24) See how they lie to themselves. And the god that they invented before will disappear from them. (al-An'am\/6:22, 23 and 24)."
		   },
		   {
			"id": 536,
			"surah": 4,
			"ayat": 43,
			"tafsir": "Believers are prohibited from praying when they are drunk. They are not allowed to pray until they are aware of what is read and what is done in prayer. When the drunken state makes it impossible to worship solemnly. This verse does not explicitly prohibit khamr, but it warns Muslims of the dangers of drinking khamr before it is completely forbidden. As for the reason for the revelation of the verse relating to tayammum, it is as follows: On one of the journeys of the Prophet Muhammad, Siti Aisyah lost her necklace, so she and her companions searched for the necklace. There was no water in that place and they ran out of water (while the prayer time had come), so this verse was revealed, then they prayed with tayammum only. In this verse, a believer is prohibited from praying when he has a large head. This prohibition will end after he takes a bath in the janabah, because bathing will cleanse both the body and the mind. Among the wisdom of taking a bath, if a person is sluggish, tired and weak, he will usually feel refreshed after he takes a bath. Usually, although prayers can be performed anywhere, they should be performed in the mosque. So people who are junub are prohibited from praying, also prohibited from being in the mosque except just passing by because there is a need. In this case there is a history which explains that a friend of the Prophet from the Ansar group, the door of his house was on the edge of the mosque. At the time of junub, he could not leave the house except to pass through the mosque, so the Prophet allowed him to pass through and did not order the door of his house which was on the edge of the mosque to be closed. It is understandable that a person who prays must be purified from minor hadas, namely those that arise due to, for example, urinating or being purified from major hadas after intercourse. Cleaning hadas is by wudu or bathing. For ablution or bathing, sometimes people do not get water, or they cannot be exposed to water due to certain illnesses, so in such circumstances it is permissible for him to perform tayammum, namely wiping his face and hands with the dust of holy earth. What is meant by au lamastum an-nisaa is touching a woman (who is not a mahram). So touching a woman results in a minor hadas which can be removed by ablution or tayammum. If a person urinates or defecates, then both of these things cause small impurities that can be removed by ablution. Everyone who urinates or defecates is required to purify himself by cleaning the unclean place (istinja'). This can be done using water or clean sacred objects such as stones, rough paper and so on. Some of the scholars are of the opinion that what is meant by \"touching a woman\" in this verse is sexual intercourse, while having intercourse results in a large hadas which can be removed by bathing in the janabah. The laws mentioned above show that Allah does not burden His servants beyond the limits of his ability, because He is Most Forgiving and Most Forgiving."
		   },
		   {
			"id": 537,
			"surah": 4,
			"ayat": 44,
			"tafsir": "The Muslims must know that the People of the Book who received the book from Allah through His messenger, they only took part of the contents of the book according to their wishes and desires, they even changed it a lot and added to it. With the arrival of the Prophet Muhammad peace be upon them, they should have become believers, but instead they became unbelievers. Their intent and purpose in doing so is to mislead many people including the Muslims themselves from the right path. They do not hesitate to hold various kinds of tricks and pretend to be sympathetic towards the Muslims even though they are enemies in disguise."
		   },
		   {
			"id": 538,
			"surah": 4,
			"ayat": 45,
			"tafsir": "Allah knows who is the enemy of Muslims. Muslims sometimes think that these enemies are their friends, but they are not. The kindness that they give birth to the Muslims is a mere deception, while their real goal is to entice the Muslims to deviate as they deviate from the true path. It is Allah who guides the Muslims to safety, happiness and goodness. He is the one who helps them in dealing with the enemies of religion."
		   },
		   {
			"id": 539,
			"surah": 4,
			"ayat": 46,
			"tafsir": "Among the People of the Book mentioned above there are also those who change the sentences in their books and move them from their original place to another place, so that the book becomes chaotic and can no longer be used as a guide. They interpreted that the arrival of Prophet Isa and Prophet Muhammad SAW was not true and they were still waiting for the arrival of Isa and Muhammad who were sent from among them. The Jews said to Prophet Muhammad peace be upon him, \"Sami'na wa 'ashaina (we hear your words but we will not obey your orders).\" They also said to the Prophet Muhammad peace be upon him, \"Isma' gaira musma'in (listen to Muhammad I hope you are deaf).\" Likewise they said to the Prophet Muhammad, \"Ra'ina (may you pay attention to us).\" When the Companions confronted this word to the Prophet, the Jews also used this word against the Prophet. Even though what they mean by ra'ina is \"extreme stupidity\" as a reproach to Rasulullah saw. (See the commentary on verse 104 of al-Baqarah, and ra'ina's vocabulary). All the use of words that are not true is intended to distort calls and to denounce religion. Also including twisting their tongues against the Prophet Muhammad, when they met the Prophet, they said, \"As-sam (hopefully you die).\" The words were answered by the Prophet, \"Alaikum (hopefully you are the one who died).\" If the Jews did not say such ugly words, but instead replaced what they said to Muhammad with \"Sami'na wa ata'na wa isma' wa undhurna (we listen to your words and obey all your commands, listen to our words and pay attention to us), \" then surely those words will bring very good results for them. But because of their disbelief, they are cursed by Allah and they have no faith except a very thin faith which cannot bring them true happiness."
		   },
		   {
			"id": 540,
			"surah": 4,
			"ayat": 47,
			"tafsir": "Jews who have received the Torah and Christians who have received the Bible, in this verse are commanded that they believe in the Al-Qur'an which was revealed to the Prophet Muhammad, which justifies the contents of their two books. Among the main points of the contents of the Qur'an are about the oneness of Allah, avoiding polytheism and strengthening faith by increasing good deeds and leaving abominable deeds, both physically and mentally. The three main questions are the pillars of religion that Allah commands His servants to carry out. The command to believe in the Qur'an must be received positively by them so that Allah does not change their faces, turn their faces backwards and curse them as their ancestors were cursed for catching fish on the forbidden day, the Sabbath. Allah's provisions, whether in the form of creating something or in the form of carrying out laws or threats, all will surely be carried out as He wills. Some interpreters understand that the meaning of Allah's punishment in the form of their elimination is to turn their faces from facing the straight path to the wrong path. After this verse was revealed, many of the People of the Book converted to Islam because they were afraid of the threat of torture. Among them is: Ka'ab Al-Ahbar. Allah who is Almighty will not face the slightest difficulty in carrying out His special powers, including carrying out His threats in this verse."
		   },
		   {
			"id": 541,
			"surah": 4,
			"ayat": 48,
			"tafsir": "Allah will never forgive the shirk committed by His servants, unless they repent before they die. Shirk is the greatest sin, because polytheists have faith and believe that Allah has equal partners and rivals. In the Qur'an, this sin of shirk is mentioned repeatedly. As for sins other than shirk, if desired, Allah will forgive them. This is adjusted to the wisdom of His wisdom and according to the procedures of His sunnah that apply. For example, the sinner really has repented of his sins and accompanied the repentance with good deeds. Allah says: \"Surely Allah will not forgive (sins) for associating partners with Him (shirk), and He forgives what (sins) other than (shirk) is for whom He wills. Whoever associates partners with Allah, then indeed, he has done great sin.\" (an-Nisa\/4:48). \"¦Indeed, whoever associates (something with) Allah, then indeed, Allah has forbidden paradise for him, and his place is hell. And there is no helper for those wrongdoers\". (al-Maidah\/5:72)."
		   },
		   {
			"id": 542,
			"surah": 4,
			"ayat": 49,
			"tafsir": "Narrated by Ibn Jarir from Hasan, that this verse was revealed regarding Jews and Christians who praise themselves by saying that they are children of Allah and His favorite, will not enter heaven other than Jews or Christians and they will not go to hell except for a few days. Allah warned the Prophet Muhammad to be careful of the actions of Jews and Christians who considered and acknowledged themselves as saints. This acknowledgment is as stated in the reason for the revelation of the verse above that their words are not true because they are still in disbelief and continue to do things that are forbidden by Allah. In fact, they have no right to clean themselves with words and confessions that are not grounded. Cleaning oneself must be with deeds that can make a person clean and free from shirk and immorality. It is useless for someone to talk about personal cleanliness because personal cleanliness is in the hands of Allah Almighty, and Allah will never mistreat His servants."
		   },
		   {
			"id": 543,
			"surah": 4,
			"ayat": 50,
			"tafsir": "This verse emphasizes the strangeness of the actions of the Jews and Christians. The Prophet Muhammad was ordered to pay attention to how dare the Jews and Christians lie to Allah by claiming that they are holy and that they are loved by Allah in particular, unlike other peoples. It is quite clear that what the Jews and Christians did was a grave sin."
		   },
		   {
			"id": 544,
			"surah": 4,
			"ayat": 51,
			"tafsir": "This verse recounts the deeds of the Jewish people who had been given the book, had understood and studied the contents of the book which basically ordered them to worship and worship only Allah alone, but they still wanted to prostrate themselves and worship idols and associate partners with Allah, fulfilling people's invitations. Quraysh who do not have a book. One thing that is strange and surprising, they think that they are righteous people, who follow and take a better path than the path of the believers who follow the Prophet Muhammad. The Israelites have a long history of worshiping idols by their ancestors down to the following generations. \"They left God their Lord who had brought them out of the land of Egypt, and followed other gods, from among the gods of the nations around them, and bowed down and worshiped him, so that they offended God\" (Book of Judges. 2.12) and so many more stories of idol worship by them. How wrong they were, and what a loss they had. As mentioned in the word of Allah: Say (Muhammad), \"Do we need to tell you about the person whose deeds have the most to lose?\" (That is) people whose deeds are in vain 'in the life of the world, while they think they have done their best. (al-Kahf\/18:103-104)."
		   },
		   {
			"id": 545,
			"surah": 4,
			"ayat": 52,
			"tafsir": "The Jews and those who are like them are cursed by Allah, deprived of His mercy. Ar-Razi said, \"Jews and people like them deserve to be cursed because they are arrogant and arrogant; they see that idol worshipers are more noble than believers who are followers of Muhammad. Is it acceptable common sense that polytheists, people who worships anything and anyone besides Allah is better and more righteous than one who worships only Allah?\" Whoever has received a curse from Allah, surely he will not find a helper and defender who will free him from torment and punishment in the hereafter, no one will intercede for him and no one will help him."
		   },
		   {
			"id": 546,
			"surah": 4,
			"ayat": 53,
			"tafsir": "The Jews will not get the kingdom and power they aspire to as before Islam came, because they have done a lot of persecution, gone astray, and no longer practice the contents of the Torah in general. If at one time they build a kingdom and have power, that means only a shadow that is temporary, and at that time they will not give the slightest benevolence to people."
		   },
		   {
			"id": 547,
			"surah": 4,
			"ayat": 54,
			"tafsir": "If the previous verses explained the bad qualities of the Jews, such as the suspicion that they were better and took a more correct path than the believers, then this verse explains their jealousy towards Muhammad saw, because the prophethood fell on him, not on the Jews. , and they are jealous of the followers of the Prophet Muhammad, because they believed and believed in him, especially after they saw the progress and victories achieved by Muhammad and his companions, growing stronger day by day and more and more supporters and followers. The envy of the Jews towards Muhammad and his followers was a big mistake for them and it is very surprising, because what Muhammad and his companions had achieved was nothing new. Because God has also given the book, royal wisdom to the family of the descendants of the Prophet Abraham; as was once given to Prophet Yusuf, Prophet David and Prophet Sulaiman. Jealousy is not only a feeling of displeasure when someone else gets God's favor, but instead wants the favor to disappear from the owner. This trait is not only bad but will also eliminate the good rewards that have been done. The Prophet said: \"Avoid envy because envy actually eats (rewards) of goodness, like fire eats firewood\" (Narrated by Abu Dawud from Abu Hurairah)."
		   },
		   {
			"id": 548,
			"surah": 4,
			"ayat": 55,
			"tafsir": "The gift of prophethood and power to his previous prophets such as Prophet Abraham and his family divided his people into two. Some of them believe in His prophet and some others remain in their disbelief, preventing others from believing. Likewise, there are people who believe, and there are also those who deny. Know, even though those who disobey in this world seem safe and secure, in the hereafter they will feel the pain of a blazing fire, because they prioritize actions that are false and misguided and do not follow what is right and true brought by His prophet."
		   },
		   {
			"id": 549,
			"surah": 4,
			"ayat": 56,
			"tafsir": "Allah will not spare the disbelievers and those who deny the verses of Allah which were revealed to His prophet, but the fire of hell has been prepared for them. Each time their skin was scorched until it felt nothing anymore, it was replaced with new skin that could feel the pain of the burning fire. Thus the torture continues so that they will always suffer and feel pain."
		   },
		   {
			"id": 550,
			"surah": 4,
			"ayat": 57,
			"tafsir": "Lucky and happy are those who are not among those who deny and wallow in sin and immorality, and they are among those who believe, they always believe in what the Prophet Muhammad brought, which is marked by good deeds, always obedient and obedient to God's commands, stay away from His prohibitions, even though at one point he had to risk his soul. Such people will be rewarded with all kinds of favors and pleasures that are in heaven, they will remain there forever."
		   },
		   {
			"id": 551,
			"surah": 4,
			"ayat": 58,
			"tafsir": "This verse orders to convey the \"mandate\" to those who are entitled. The meaning of \"mandate\" in this verse, is something that is entrusted to someone to be carried out as well as possible. The word \"mandate\" with this meaning is very broad, covering God's \"mandate\" to His servants, one's mandate to others and to oneself. Allah's mandate for His servants that must be carried out includes: carrying out what He commands and staying away from His prohibitions. All of God's blessings in whatever form we should take advantage of to taqarrub (draw closer) to Him. One's mandate to others that must be carried out includes: returning the deposit to the owner with nothing lacking, not deceiving him, keeping secrets and so on, and this also includes: a. The just nature of the ruler towards the people in any field by not discriminating between one and another in the implementation of the law, even towards their own family and children, as emphasized by Allah in this verse. ¦ And when you determine the law among people you should determine it fairly.... (an-Nisa'\/4:58). In this case, the Prophet Muhammad is sufficient as an example. In one statement he said: \"If Fatimah bint Muhammad stole, I would have cut off her hand\" (History of ash-Syaikhan from 'Â'ishah). b. The fair nature of the clergy (i.e. knowledgeable people) towards ordinary people, such as instilling into their hearts the correct creed, guiding them to deeds that are beneficial to them in this world and in the hereafter, providing good education, advocating lawful businesses, giving advice -advice that strengthens his faith, saves from sins and immoral acts, awakens enthusiasm to do good and do good, issues useful and beneficial fatwas in carrying out Shari'a and Allah's provisions. c. The just nature of a husband towards his wife, and vice versa, such as carrying out each other's obligations, not disclosing the secrets of the other party, especially special secrets between the two that are not good for other people to know. One's mandate to himself; like doing something that is profitable and useful for him in matters of the world and his religion. Do not make things that harm him in this world and the hereafter, and so on. This very good teaching, namely carrying out mandates and laws as fairly as possible, should never be ignored, but should be heeded, cared for and applied in our lives and lives, in order to achieve happiness in the world and the hereafter."
		   },
		   {
			"id": 552,
			"surah": 4,
			"ayat": 59,
			"tafsir": "This verse commands that Muslims obey and obey Him, His messengers and those who hold power among them in order to create public benefit. For the best and fairest implementation of the mandate and law, Muslims should: a. Obey and comply with God's commands by practicing the contents of the Holy Qur'an, carrying out the laws that have been established by Him, even if they feel heavy, not in accordance with personal wishes and desires. Actually, everything that Allah commands contains benefits and what He prohibits contains harm. b. Carry out the teachings brought by the Messenger of Allah, the messenger of God to be carried out by all of His servants. He was assigned to explain to mankind the contents of the Qur'an. Allah said: \"... And We sent down Adz-dhikr (Al-Qur'an) to you, so that you would explain to people what has been revealed to them ¦.\" (an-Nahl\/16:44). c. Comply with the provisions set by ulil amri, namely those who hold power among themselves. If they have agreed on a matter, then the Muslims are obliged to implement it on the condition that their decision does not conflict with the Book of Al-Qur'an and hadith. If this is not the case, then we are not obligated to carry it out, in fact it is obligatory to oppose it, because it is not justified for someone to obey and obey something that is a sin and is immoral to Allah. The Prophet Muhammad said: \"It is not (justified) to obey creatures in things that are immoral to the Creator (Allah swt).\" (Ahmad's history). d. If there is something that is disputed and no agreement is reached, then it must be returned to the Al-Qur'an and hadith. If it is not found in it, it must be adapted to (represented by) things that have similarities and agreements in the Al-Qur'an and the Sunnah of the Prophet Muhammad. Of course, those who can carry out allegiances as referred to above are people who are knowledgeable, know and understand the contents of the Qur'an and the Sunnah of the Prophet. This should be done by those who truly believe in Allah and the Hereafter."
		   },
		   {
			"id": 553,
			"surah": 4,
			"ayat": 60,
			"tafsir": "In this verse, Allah orders His Messenger, Muhammad saw, to pay attention to the attitudes and behavior of those who have claimed to believe in the Al-Qur'an which was revealed to the Messenger of Allah and to other holy books which were revealed to the prophets and messengers. previously. These professed believers have done something contrary to their professed faith. If they really believed in Muhammad as spoken with their mouths, they would certainly be willing to judge him to resolve the disputes that occurred between them, and would not want to judge Tagut, a person who had a lot of evil and error. What is meant by Tagut here is Ka'ab bin al-Asyraf, a Jew who was always hostile to the Prophet Muhammad and the Muslims. Some say that what Tagut means here is Abu Barzah al-Aslami, a soothsayer during the time of the Prophet. Also included are idols and everyone who makes and establishes laws unrighteously. Thus they have been led astray by satan with a very far deception."
		   },
		   {
			"id": 554,
			"surah": 4,
			"ayat": 61,
			"tafsir": "This verse explains the attitude and behavior of those who claim to have faith in their mouths and are rebellious in their hearts. If invited to do good deeds or carry out what Allah revealed in the Qur'an and received a law from the Prophet. They keep turning away and prevent people from accepting the law with all kinds of ways and excuses, even though the law of Allah and the Messenger is the true and just law. What drives them to do so is simply to indulge their lusts."
		   },
		   {
			"id": 555,
			"surah": 4,
			"ayat": 62,
			"tafsir": "This verse explains the cunning of the hypocrites, when a disaster strikes them because their secret has been revealed and is known by the Messenger of Allah and the believers, they come to the Prophet while swearing, \"By Allah, our actions were not with malicious intent and on purpose. disobeying the orders of Allah and His Messenger, but solely because they want to reach a good settlement and perfect peace,\" even though their oath was only a mere cunning trick."
		   },
		   {
			"id": 556,
			"surah": 4,
			"ayat": 63,
			"tafsir": "Such is the cunning of the hypocrites, but this verse states emphatically that they are people who have known what is stored in their hearts, namely jealousy and a desire to carry out tricks that are detrimental to Muslims. Therefore Allah ordered the Messenger of Allah and the Muslims not to believe them and not to be deceived by their tricks. Besides that, they should be given warnings and lessons with words that can bring them back to awareness and conviction so that they are free from hypocrisy, and truly become people of faith."
		   },
		   {
			"id": 557,
			"surah": 4,
			"ayat": 64,
			"tafsir": "The first part of this verse explains that every messenger sent by Allah to this world from the past to the Prophet Muhammad must be obeyed with Allah's permission (command), because the task of their message is the same, namely to guide humanity to the right path and happiness. their life in this world and in the hereafter. In this verse, obedience is associated with Allah's permission, meaning that no creature may be obeyed except with Allah's permission or in accordance with His commands, such as obeying the apostles, ulil amri, parents and so on, as long as they do not order them to commit immorality. in accordance with the hadith narrated by Ali bin Abi Talib which reads: \"It is not permissible to obey humans who order them to violate Allah's commands\" (History of al-Bukhari and Muslim from Ali bin Abi Talib). \"In fact, only orders to do good are obeyed, (History of Ahmad, Muslim, Abu Dawud and an-Nasa'i). The second part to the end of this verse explains: If a person who wrongs himself is a person who judges taagut as mentioned in the verse 60, came to the Prophet Muhammad at that time, then they asked Allah for forgiveness, and the Apostle also asked for their forgiveness, Allah will surely forgive them, because Allah is the Acceptor of repentance, the Most Merciful. to the thagut are people who wrong themselves, because they make big mistakes and disobedience don't want to realize. Some of the conditions that must be fulfilled by a person who repents so that his repentance is accepted by God, include: a. Repentance is done immediately, meaning immediately after making a mistake b.Let the repentance be a repentance nasuha, meaning truly sorry for the mistakes that have been made t and will not repeat again. c. If another person's rights are violated, that person's rights must be resolved first by apologizing and returning\/compensating for the loss. Because the revelation of this verse is related to the following events as narrated by al-Bukhari, Muslim and other narrators. They narrated that Zubair bin 'Awwam complained about a man from the Ansar to Rasulullah saw in a dispute about the distribution of water for the date palm garden. Rasulullah gave the verdict while saying to Zubair, \"Water your garden first then flow the water to your neighbor's garden\". So the man said, \"Is it because he is your aunt's son, O Messenger of Allah?\" So the face of the Prophet changed because he heard the accusation about it. Rasulullah said again (to strengthen his decision) \"Water, O Zubair, your garden so that the water is evenly distributed, then flow it to your neighbor's garden\". Then come down this verse."
		   },
		   {
			"id": 558,
			"surah": 4,
			"ayat": 65,
			"tafsir": "This verse explains with an oath that even though there are people who claim to have faith, in essence they do not believe as long as they do not want to judge the Messenger. Rasulullah SAW never made a decision in a dispute that occurred between them, as happened to the hypocrites. Or they judge the Messenger but if the decision is not in accordance with their wishes then they object and are not happy with the decision, like the Prophet's decision for az-Zubair bin Awwam when a man from the Ansar mentioned above came and judged the Messenger of Allah. So people who truly believe must be willing to judge the Messenger of Allah and accept his decision wholeheartedly without feeling suspicious or objectionable. Indeed, a judge's decision, whether he is an apostle or not, must be based on facts and sufficient evidence."
		   },
		   {
			"id": 559,
			"surah": 4,
			"ayat": 66,
			"tafsir": "This verse explains various human attitudes in general in obeying Allah's commandments. Most of them when ordered heavy things, they are reluctant to even refuse to carry it out like the hypocrites and those who are weak in faith. As for those who truly believe, they always obey everything that Allah commands, no matter how hard the order is, even if the order requires sacrifice of life, property or leaving their hometown. This was evident from the attitude of the Muslims when they were ordered to migrate to Medina and when they were ordered to fight against a very strong enemy, multiplied in number and equipped with weapons. This is described by the Prophet Muhammad in his words mentioned above. In fact, if humans do what God commands and leave what He forbids, that is better for them, because then their faith will grow stronger and will develop praiseworthy qualities in them."
		   },
		   {
			"id": 560,
			"surah": 4,
			"ayat": 67,
			"tafsir": "Then it was explained that if they do good and obey all of Allah's commandments and leave all His prohibitions and do good deeds sincerely, Allah will surely give them a great reward and will lead them to the straight path that can bring happiness in this world and the hereafter."
		   },
		   {
			"id": 561,
			"surah": 4,
			"ayat": 68,
			"tafsir": "Then it was explained that if they do good and obey all of Allah's commandments and leave all His prohibitions and do good deeds sincerely, Allah will surely give them a great reward and will lead them to the straight path that can bring happiness in this world and the hereafter."
		   },
		   {
			"id": 562,
			"surah": 4,
			"ayat": 69,
			"tafsir": "This verse invites and encourages everyone to obey Allah and His Messenger. Allah promised to repay obedience with a very great reward, which is not just going to heaven, but will be placed together with people who have the highest rank in the sight of God, namely the prophets, the shiddiqin, the martyrs (those who martyrdom) and pious people. Based on this verse, commentators broadly divide those who receive God's greatest grace in heaven into four types, namely: 1. Apostles and prophets, namely those who receive revelations from God. 2. The shiddiqin, namely people who have firm faith in the truth of the prophets and apostles. 3. The martyrs have the following criteria: a. A believer who fights in the way of Allah and dies a martyr in the war against the disbelievers b. The person who spends his life fighting in the way of Allah with wealth and in all kinds of ways that he can carry out. c. A believer who dies in a sudden disaster or is mistreated, such as giving birth, drowning, or being killed in maltreatment. Part (a) is called the martyrdom of the world and the hereafter which has a higher reward than parts (b) and (c) both of which are only called martyrdom of the hereafter. There is one more section called the world martyrs, namely people who died fighting against infidels, only to seek worldly benefits, such as to gain booty, to seek fame and so on. This kind of martyrdom is not included in the division of martyrdom above, because this world martyrdom is not meant at all in these two verses. 4. Pious people, namely people who always do good deeds that are beneficial to the public, including himself and his family both for the happiness of worldly life and for the happiness of the spiritual life in accordance with God's teachings. People who truly obey Allah and His Messenger as mentioned in this verse will enter heaven and be placed together with all the four groups."
		   },
		   {
			"id": 563,
			"surah": 4,
			"ayat": 70,
			"tafsir": "The reward promised by Allah to those who obey Him and His Messenger is a gift that is incomparable and incomparable for those who want to achieve it. Allah is the All-Knowing who is truly obedient to Him, so that he is entitled to this great reward."
		   },
		   {
			"id": 564,
			"surah": 4,
			"ayat": 71,
			"tafsir": "In this verse it is ordered to make all kinds of preparations to face the enemy, this verse is in tune with verse 60 of surah al-Anfal. According to Sayyid Qutub, these verses were revealed immediately after the Battle of Uhud and before the Battle of Khandak. But he did not mention the reason for his decline. Believers must always be prepared in every way, to face disbelievers in war, where they must go to the battlefield, both in groups and simultaneously, according to the tactics of war strategy, and according to well-arranged commands. This has been practiced by the Prophet Muhammad saw in the face of several wars that took place between the Muslims and the infidels. Before liberating the city of Mecca, he had known the strength of the enemy and their strategy in dealing with the Muslims and also knew in depth how the spirit and strength of faith possessed by his followers. In general, the Prophet in carrying out wars had known in advance the state of the enemy and the loyalty of his followers."
		   },
		   {
			"id": 565,
			"surah": 4,
			"ayat": 72,
			"tafsir": "Among the Muslims there were those who were reluctant and did not immediately get ready to go to the battlefield with various reasons so that they would not join the fight. These are people who are weak in faith and hypocrites who are always present in every war and struggle of all time. Furthermore, this verse explains how the attitude of the hypocrites and people who do not join the war. When the Muslims are struck by misfortune or defeat on the battlefield, they feel happy and consider that they are not participating in the war as a gift from Allah because they are not killed or injured."
		   },
		   {
			"id": 566,
			"surah": 4,
			"ayat": 73,
			"tafsir": "This verse adds an explanation about the attitude of hypocrites and people who are weak in faith. If the Muslims gain victory in the war against the disbelievers, they say, \"If I had joined them in the war, I would have benefited greatly by obtaining a lot of booty.\" Speeches like this describe as if they are other people who do not have the slightest relationship with the Muslims, even though they have joined the Muslims and have lived with them in a safe and good atmosphere, but in their hearts there is hatred and envy. depth."
		   },
		   {
			"id": 567,
			"surah": 4,
			"ayat": 74,
			"tafsir": "Fighting in the way of Allah is a noble work. Those who fight in the way of Allah will certainly benefit greatly. People who truly believe and are sincere in carrying out the demands of their religion and are willing to sacrifice their worldly interests to achieve excellence in the hereafter should fight in the cause of Allah. Whoever fights in the way of Allah, then he will get one of the two virtues, being martyred in the way of Allah or winning in battle, each of the two virtues will be rewarded by God with a great reward, because the martyr has by sincerely sacrificing his body and soul in obeying God's commands, while those who win and are still alive will also be able to continue the struggle to uphold justice and defend the truth in God's way."
		   },
		   {
			"id": 568,
			"surah": 4,
			"ayat": 75,
			"tafsir": "In this verse there is a strong encouragement for Muslims to fight in the way of Allah to defend their brothers who are oppressed and who are in the grip of the enemy, because they are weak and helpless both men, women and children. Their safety is threatened. They are unable to free themselves from the grip of the enemy, they are oppressed and persecuted by the unjust rulers, they do nothing but pray for help and protection from Allah. Allah encourages to fight in a deeper way, knocking on the door of the conscience of everyone who still has good feelings and desires, by mentioning the benefits and the pure purpose of fighting according to Islam. The aim of war in Islam is to elevate the word of Allah, to defend the rights of brothers and sisters in religion, to defend human rights and to uphold high moral norms and to defend oneself; not to enslave or colonize or to control the nation or state or the rights of others. Based on the purpose of fighting above, it is an obligation for Muslims to release every Muslim who is captured by the enemy by fighting or redeeming him with wealth. According to Abu Abdillah al-Qurtubi, there is no difference in understanding among the scholars in this law, they all agree. The assets for redemption are taken from the baitul mal or must be borne by all Muslims if funds are not available."
		   },
		   {
			"id": 569,
			"surah": 4,
			"ayat": 76,
			"tafsir": "Believers fight to uphold justice and defend themselves, while polytheists fight because they follow lust controlled by Satan and develop anger in the world, so that if believers leave or neglect the duty of fighting in the way of Allah, surely the damage caused by various acts of lust will run rampant. Because the purpose of fighting in Islam is so holy and pure, namely to defend themselves and eradicate tyranny and anger, then Muslims should attack the enemies of Islam who are friends of satan, and let it be believed that satan's tricks are weak, will not be able to defeat people who truly believe."
		   },
		   {
			"id": 570,
			"surah": 4,
			"ayat": 77,
			"tafsir": "This verse describes the condition of society during the Jahiliyyah period. They like to fight even for small reasons. After converting to Islam, they were ordered to stop fighting, pray and pay zakat. Some of them hoped for an order to go to war because of worldly interests as was their custom during the time of ignorance. This verse instructs some Muslims who are reluctant to fight so that they remain calm and refrain from waging war against unbelievers and they are only ordered to pray and pay zakat. But when they were ordered to fight to defend themselves, it turned out that some of them were not eager to fight because they were afraid of the enemy, even though they should only fear Allah. Instead they said, \"Why are we obliged to fight at this time, let us die as usual.\" Allah ordered His Messenger to tell some Muslims that their attitude is the attitude of a coward, out of fear of death and love of the world's treasures, while the pleasures of this world are very few compared to the delights of the hereafter which are eternal and unlimited, which will only be obtained by people who fear Allah, namely people who are clean from shirk and low morals. At the end of this verse it is emphasized that Allah will not mistreat and harm humans. Each will be rewarded according to his deeds, even if they are as big as zarrah."
		   },
		   {
			"id": 571,
			"surah": 4,
			"ayat": 78,
			"tafsir": "Death (death) is something that is sure to come. No one can escape from him wherever he is even if he takes refuge in a strong fortress. Because of that it is not natural for humans to be afraid of death even though they are in the battlefield. If he died, he would surely die, even if he lived a luxurious life in a palace or survived in a strong fortress. This verse is Allah's condemnation of a group of Muslims who do not have the fighting spirit to defend the truth, they do not want to fight because they are afraid of death. Their cowardice and hypocrisy are nothing but the result of their weakness of faith and shortsightedness of mind. Next is described the shortsightedness of those who do not want to go to war because they are afraid of death. Their cowardice was considered a gift from Allah, while the calamity that befell them was due to the coming of Muhammad to Medina, so that the dry season that hit the city of Medina, they considered it a disaster caused by the arrival of the Prophet Muhammad and his bad luck. As for the believer, he maintains that good and bad come from God. It was this stance that Allah commanded Muhammad to convey to them. If they cannot understand it, they will remain forever in darkness. If they could understand it, of course they would not say that a bad thing was due to someone's fault, but they would know that good and bad are closely related to causes that have become the sunnah of Allah."
		   },
		   {
			"id": 572,
			"surah": 4,
			"ayat": 79,
			"tafsir": "In terms of decency that something good that someone gets should be said to come from God. Catastrophe that befalls a person should be said to have come from himself, perhaps also due to his negligence or the negligence of another person whether he is a relative, friend or neighbour."
		   },
		   {
			"id": 573,
			"surah": 4,
			"ayat": 80,
			"tafsir": "The Prophet's orders and prohibitions which did not involve religious affairs, for example those related to the world, such as agricultural and defense matters, the Apostle himself was willing to accept the opinion of his friends who knew more about the problem. According to history, in maintaining politeness towards the Apostle the companions asked first whether it came from God or the opinion of the Apostle himself. If it was emphasized by the Prophet that this was from Allah then they obeyed without hesitation and if it was said that this was Muhammad's opinion then the Companions also expressed their opinion. This incident once happened when a friend faced the Apostle's order in choosing a place close to a spring for the benefit of a defense strategy during the Badr war. When explaining the reason for the revelation of this verse Muqatil narrates that when the Prophet said: \"Whoever loves me truly loves Allah. And whoever obeys me truly obeys Allah. The hypocrites said, \"Didn't you hear what this man (Muhammad) said ? Indeed, he has approached shirk. In fact, he forbids us to worship other than Allah and he wants us to make him god just as the Christians made Jesus god. So Allah sent down this verse.\" (Muqatil History). Obeying the Messenger cannot be said to be an act of shirk, because the Messenger conveys Allah's commands. Thus obeying the Messenger is obeying Allah, not associating him with Allah. In Tafsir al-Maragi it is explained that shirk consists of two kinds. First, shirk uluhiyah, namely believing in the existence of something other than Allah who has supernatural powers and can benefit and cause harm. Second, shirk rububiyah, believing that there is something other than Allah who has the right to establish haram and halal laws, just like Christians see that this right belongs to their priests. True believers are of the opinion: Submission is only to Allah as the Creator and there are no creatures that have supernatural powers that can benefit and harm, and none of the creatures has the right to establish haram and halal laws, because all creatures submit to His will. Allah willed that His Messenger (Muhammad) did not take violent or coercive action against those who disobeyed him, because he was sent only to deliver good news and strong warnings. Human faith in his apostleship is not dependent on coercion, but on awareness after using the mind."
		   },
		   {
			"id": 574,
			"surah": 4,
			"ayat": 81,
			"tafsir": "The group that is afraid of war as described in verse 77 said before the Prophet Muhammad that they obey his orders, but after they were separated, some made a strategy contrary to what they said. Actually, their obedient words were just to save themselves and save their property from the actions of the Apostle. This verse reveals to the Prophet what is contained in the hearts of the hypocrites and Allah ordered Muhammad to let their nature be like that by surrendering everything to Allah, because Allah still protects His Messenger from the crimes of the hypocrites."
		   },
		   {
			"id": 575,
			"surah": 4,
			"ayat": 82,
			"tafsir": "The disbelievers and hypocrites were criticized because they did not understand Muhammad's apostleship and did not want to understand the Qur'an which explains Muhammad's apostleship. If they want to understand and pay attention, they will know that Muhammad's message and the Qur'an are actually from God. Allah's promises to believers and His threats to unbelievers and hypocrites as conveyed by Muhammad are certain things as the verses conveyed by Muhammad are certain to be true about the contents of the hearts of hypocrites and unbelievers. Likewise, the truth of the verses that Muhammad brought about their bad luck in the hereafter, because if the Qur'an were made by Muhammad, they did not come from God who sent them, they would undoubtedly find verses in the Qur'an that contradict each other. one another. According to al-Maragi, the following things are proof that the Qur'an was not created by Muhammad, but a revelation from Allah: 1. No creature can describe the essence of something as described in the Qur'an without there is conflict with one another. 2. The Qur'an narrates past events that Muhammad never witnessed and some of which are not found in history. The Al-Qur'an also tells about things that will come and turns out to be in accordance with reality, it also tells what has happened and is hidden in the hearts of some people, as the Al-Qur'an tells about a strategy arranged by a group of people who opposed the Prophet (s). see verse 77 which relates to verse 81 in the last verse). 3. No one can compete with the Al-Qur'an in explaining the principles of creed, sharia rules, tribal and class strategies without any conflict with one another. 4. No one can match the Al-Qur'an in presenting social laws or values of prosperity for each religion and its adherents by presenting concrete reasons along with examples and comparisons. One story that is mentioned repeatedly in different expressions, impressively and convincingly without being separated from the form of advice and teaching. Everything is explained without any conflict between one another. 5. No one can match the Al-Qur'an in talking about this natural event by describing something that is contained by the earth and sky such as animals, wind, sea, plants and the wisdom of each in high literary language even though it is stated repeatedly but not boring. In fact, each verse reinforces one another's understanding and impresses. 6. The Qur'an preaches about the unseen, the next day, and everything related to the existence of a reckoning for human actions and appropriate retribution. This kind of preaching is contained in verses that have different descriptions but have the same purpose. So, paying attention to the features of the Al-Qur'an is the way to obtain guidance, that indeed the Al-Qur'an came from Allah and must be followed. Everything it contains is acceptable to reason, in accordance with nature, in line with benefit and only in the Qur'an is there a path to human happiness in this world and the hereafter."
		   },
		   {
			"id": 576,
			"surah": 4,
			"ayat": 83,
			"tafsir": "People who are weak in faith and hypocrites like to broadcast news that they know, especially in times of war, namely news that has been leaked from the army headquarters, about war secrets, domestic or foreign, that it is not normal for the general public to know. Their intention in broadcasting the news was to destabilize the situation. But if they mean well and they return the news to the Apostle as the highest leader or they return it to ulil amri, namely the leader and government people, they will certainly know the real issue of the news; they will receive information from leaders and government people. Thus public security was never disturbed. People will be affected by people who broadcast news provocatively, except for people who have strong faith who survive the provocative news. With Allah's mercy and grace, the Muslims are protected from such traps because they obey Allah and the Messenger, and return all matters to a trusted leader."
		   },
		   {
			"id": 577,
			"surah": 4,
			"ayat": 84,
			"tafsir": "The war order to withstand the attack of the disbelievers was addressed directly by Allah to His Prophet and Allah wanted the implementation of this war order on the basis of obedience and surrender to Him without relying on the hypocrites, namely by hoping for the help of the hypocrites. Allah ordered His Prophet to encourage the believers to join the fight against the disbelievers. History proves in the Battle of Uhud how steadfast the Prophet was in carrying out God's commands even though the Muslim army was in a state of chaos. In this verse, Allah promises to weaken the strength of the disbelievers, therefore it is only natural for the Muslims not to worry, they should even be more obedient to the Messenger of Allah by fulfilling his advice to participate in fighting the disbelievers with the belief that Allah is Almighty and fulfills His promises, giving victory to the Prophet and the believers."
		   },
		   {
			"id": 578,
			"surah": 4,
			"ayat": 85,
			"tafsir": "Intercession is someone's help to another person in something. Intercession takes the form of two kinds: first, in the form of virtue, which is seen as good by religion, and second, in the form of evil, namely what is seen as bad by religion. People who do intercession in the form of benevolence, for example, help or encourage others to do good deeds, such as building madrasas, mosques and so on, people who make suggestions will receive rewards from the actions of people who follow their advice as if he had done it himself. Likewise, people who do intercession in the form of evil, for example, help people who do evil works such as gambling, adultery and running away from civil war. He will share the reward of the deed as if he had joined in the work. An act can not be separated from the form of cause and effect. So the person who is the cause of the manifestation of goodness or the cause of the manifestation of evil will not escape receiving God's reward. Allah is able to determine all things. Therefore, those who do good will not be rewarded less, because Allah also rewards those who advocate it, because Allah is Most Just, Allah rewards people in the form of punishment for those who cause other people to go astray."
		   },
		   {
			"id": 579,
			"surah": 4,
			"ayat": 86,
			"tafsir": "An order to apply good manners in association, so that brotherly relations are maintained by holding the order that is carried out when meeting someone. A person must repay the respect given to him in the form of a greeting that he receives in an appropriate way or in a better way. An appropriate or better reply can be in the form of pleasant speech or with a gentle voice or with attractive gestures, paying attention to life in upholding courtesy that strengthens brotherly relations between their fellows. God pays attention to everything, including paying attention to human life in upholding good manners that can strengthen the brotherly relationship between them. In line with this verse, there are hadiths as follows From Abu Hurairah said, Rasulullah SAW said, \"Let people who drive greet people who walk, and people who walk greet people who are sitting, groups of people who greet a little to a large group, the young group greets the old group.\" (History of al-Bukhari and Muslim). From Abdullah bin 'Amr, he said, \"that someone asked the Messenger of Allah, which is the best Islamic teaching? The Messenger of Allah replied, \"(namely) feed (the poor) and greet people you know and people you don't know.\" know. (History of al-Bukhari and Muslim)."
		   },
		   {
			"id": 580,
			"surah": 4,
			"ayat": 87,
			"tafsir": "The Muslims will receive a reward in the form of a reward from Allah Almighty in the days to come. He is God Almighty who has the right to be worshiped, therefore Muslims should not neglect to serve Him and obey His commands and stay away from His prohibitions. The happiness and serenity of the soul as well as the purity of the human mind lies in its freedom from material shackles. Apart from Allah, there is no one who has the right to be worshiped because only Allah is able to resurrect and gather people on the next day, the day that will surely come. Therefore let man believe in the word of God, because nothing can be trusted more than the word of God. As for those that do not come from Allah, the truth is uncertain, because messages from humans contain the possibility of being true and the possibility of being wrong."
		   },
		   {
			"id": 581,
			"surah": 4,
			"ayat": 88,
			"tafsir": "This verse reveals a fact that occurred at the time of the Prophet Muhammad, that there was a group of hypocrites who were always two-faced towards the Prophet and the Muslims in the face of war. They pretended to help and support the Prophet Muhammad and the Muslims, when in fact they were reluctant to provide assistance, they even secretly helped the enemies of the Muslims. In dealing with these hypocrites, it turns out that the Muslims are divided into two groups. The first group argues that the hypocrites must be dealt with and exterminated; while the second group wants to defend them, because they are considered the helpers of the Muslims. The attitude of the Muslims is corrected, why are they divided and not united against the hypocrites. It is stated that the hypocrites are \"those who have been turned back to disbelief\" because of their own actions, and as \"those who have been led astray\" with the meaning: they have gone astray because of denial and no longer heed the instructions. God's guidance. In a questioning tone, this verse prohibits Muslims from trying to guide those who have been led astray by Him. Allah said, \"Are you trying to guide people whom Allah has led astray?\" At the end of this verse it is emphasized that there is no way for Muslims and for anyone else, to provide guidance to people who have been led astray by Allah, because of their denial and wickedness. From this verse it can be concluded that Muslims should not hesitate in dealing with hypocrites. Allah's commands to fight and defend religion must be carried out, and all obstacles must be removed. The Muslims must unite in their attitudes and actions to face the hypocrites and other enemies of Islam."
		   },
		   {
			"id": 582,
			"surah": 4,
			"ayat": 89,
			"tafsir": "It is narrated that some Arabs came to the Messenger of Allah. in Medina, then they converted to Islam, then they were struck by a fever, which caused them to return to disbelief and then they left Medina. Then they met with the Prophet's companions, the companions asked why they left Medina. They explained that they were stricken with heat illness. The companions said, \"Why don't you take a good example from the Messenger of Allah?\" In responding to these people, the Companions were divided into two groups. Some argue that they have become hypocrites, while others argue that they are still Muslims. Then this verse came down which denounced the attitude of the Muslims, because they were divided into two groups, and ordered that the Arabs be taken prisoner and killed, if they did not emigrate to Medina, because they were equated with other polytheists. This verse describes the characteristics of the hypocrites, whom some Muslims defended at that time and wanted to be guided, and it was hoped that their help would strengthen the Muslims. The nature of the hypocrites is very different from the disbelievers, who are happy with their disbelief and do not bother other people. As for the hypocrites, they are not only two-faced towards the Muslims, but also want to return the Muslims to disbelief, and after that they will wipe out the religion of Islam from the face of this earth. Because of the bad intentions and actions of these hypocrites, the Muslims are once again reminded not to ever trust them and not to make them friends and helpers, unless they truly embrace Islam and are in accordance with their actions. with words, and have united with the Muslims in faith, attitudes and deeds, not just submitting because they are in a weak state. If they had truly believed, surely they would not have left the Prophet and the Muslims in the face of various difficulties. They will certainly always be with the Prophet and the Muslims, because that is a strong encouragement of faith in one's heart. So reluctance to follow the Prophet is a sign of weak faith and lack of sincerity to defend Islam. Therefore, the command in this verse, if it turns out that they do not want to believe and strive in the way of Allah, then the Muslims should take them prisoner and kill them, and not make them their protectors and helpers. From this verse it can be understood that the main reason for the order to arrest and kill them was their dishonest nature towards the Muslims and their actions which were carried out in secret to destroy Islam and the Muslims. Action against them is seen as a necessity that needs to be done for the safety of Islam and the Muslims. This action must be stopped if it turns out that they have also stopped their attitudes and actions that are hostile to Islam and the Muslims."
		   },
		   {
			"id": 583,
			"surah": 4,
			"ayat": 90,
			"tafsir": "It was ordered to the Muslims that the action of \"capturing and killing\" was not carried out on people like the following: First: The disbelievers who left their original groups that were hostile to Islam and the Muslims, then they went to seek protection from the groups of infidels others who have entered into peace agreements with the Muslims. In this case the Muslims are not allowed to capture or kill them because they have been equated with the infidels where they take shelter who have entered into a peace treaty with the Muslims. The Muslims must respect the peace agreement that has been made, even with unbelievers as long as they do not violate it. Second: Unbelievers who come to the Muslims to make peace. They don't want to fight the Muslims; because of their desire to make peace. They are also not willing to help the Muslims to fight other infidels, because it is possible that these infidels are still their relatives, or some of their families still live with these infidels. People like this also should not be captured and killed by Muslims. From this provision it can be seen how fair the laws of the Qur'an are. Muslims must respect the agreements or agreements that have been made with unbelievers as long as they continue to respect and fulfill the contents of the agreement. It may be difficult for some Muslims to refrain from fighting these two groups, for example because they see the fact that they are still in an infidel society, or because they are not willing to help Muslims in fighting other infidels who are hostile to them. Therefore this verse reminds the Muslims of His mercy that He has eliminated the danger that these people might pose to the Muslims. If Allah had willed, He would have given those infidels the strength to fight against the Muslims, for example by showing them the weaknesses of the Muslims, which would enable the infidels to fight and defeat the Muslims. But Allah, the Most Merciful, has bestowed His mercy, so that these various dangers do not occur. In return, the Muslims must exercise restraint against them. At the end of this verse, His prohibition is reiterated for Muslims to capture and kill infidels from the two groups mentioned above, if they are truly not hostile to Islam and Muslims and always maintain peace. If the Muslims fight them, maybe it will move them to organize forces to face the Muslims. This verse is the basis of \"political asylum law\" in Islam."
		   },
		   {
			"id": 584,
			"surah": 4,
			"ayat": 91,
			"tafsir": "Apart from these two groups of disbelievers, Muslims will find another group with different characteristics and intentions. They are hypocritical disbelievers, namely hypocrites in matters of belief. When they meet Muslims they claim to be Muslims, and when they are with unbelievers, they say they still share their religion and continue to worship their god. They do this because they protect the security of themselves, their families and their property against disturbances from Muslims and disturbances from their own group. And when they meet people who believe, they say, \"We have believed.\" But when they return to their demons (leaders), they say, \"Surely we are with you, we are only making fun.\" (al-Baqarah\/2:14). It was narrated by Ibn Jarir that the verse was revealed regarding one people from among the inhabitants of the city of Mecca. They once came to the Prophet said that they converted to Islam. But in essence they do so only pretend. After that they returned to Quraysh who were still infidels, then they worshiped the statue with the person. They do this with the intention that they are safe against the Muslims and also safe against the infidels. This verse explains how the attitude of the Muslims should be in dealing with these hypocrites, that is, as long as they do not stop their harassment of the Muslims, and do not put forward their request for a peace treaty, then the Muslims must fight, arrest and kill them, where they were found. Allah swt has given real authority and reason to the Muslims to capture and kill them. From this verse it can be understood that if the hypocrites have stopped their harassment of the Muslims or they have proposed peace, then the Muslims are prohibited from fighting, capturing and killing them. In another verse, Allah says: Allah does not forbid you to do good and be fair to those who do not fight you in matters of religion and do not expel you from your hometown. Verily, Allah loves those who act justly. (al-Mumtahanah\/60:8). Thus, Allah's command to Muslims to fight against disbelievers, is specifically regarding those who fight or are hostile to Islam and Muslims. And fight in the way of Allah those who fight you, but do not transgress. Indeed, Allah does not like those who transgress. (al-Baqarah\/2:190)."
		   },
		   {
			"id": 585,
			"surah": 4,
			"ayat": 92,
			"tafsir": "This verse explains that it is not proper for a believer to kill another believer on purpose. Then explained the law of killing fellow believers that occur by accident. This may happen in various cases, judging by the condition of the killed believers and from which group they came from. In this case there are 3 cases: First: The believer who was accidentally killed came from a believing family. So the punishment is that the murderer must release the believing servant, in addition to paying the diat (fine) to the family of the murdered, unless they give up and release the killer from paying the diat. Second: The believer who was killed came from a non-believer or family, but his family was hostile to Muslims. So in this case the punishment that applies to those who kill is that they have to release a believing slave without paying him a debt. Third: The believer who was killed accidentally came from a non-believer family, but they had made a peace agreement with the Muslims, so the punishment was that the murderer must pay the death penalty handed over to the family of the killed party. In addition, he must also release a slave who believer. So the sentence is the same as the first case. Regarding the obligation to release the \"believing slave\" referred to in this verse: it is possible that the murderer could not carry it out, because he did not get a slave who fulfilled the conditions stated; or because it is completely impossible to get a slave, for example in this day and age; or a faithful servant, but the killers do not have the ability to buy and set them free. In this case, the obligation to free the slave can be replaced by another obligation, namely that the killer must fast for two consecutive months, so that his repentance is acceptable to Allah. Thus he is free from the obligation to free his faithful slave. Regarding the \"accident\" in the murder referred to in this verse, it is an accident caused by carelessness that can actually be avoided by normal humans. For example, if someone is going to shoot or throw something that could hit or harm someone, then he should first check whether or not there is someone who might be the target of the bullet accidentally. It was carelessness and carelessness that caused the murderer to be punished, even though he killed accidentally, so that he and other people are always careful in doing things especially those related to the safety of other human souls. As for the diat (diyat) or fine imposed on the murderer, it can be paid with several kinds of compensation items, namely with one hundred camels, or two hundred cows, or two thousand goats, or two hundred pieces of clothing or one thousand dinars or two twelve thousand dirhams. In a hadith narrated by Abu Dawud from Jabir, from the Messenger of Allah it is stated as follows: \"That the Messenger of Allah has made it obligatory for a hundred camels to be given to those who have camels, and two hundred cows to those who have cows and two thousand goats. to those who have goats, and two hundred jewels to those who have jewels\" (History of Abu Dawud). The obligation to free slaves who believe or fast for two consecutive months is an obligation imposed on the killer and his 'aqilah (family), who are also called his \"asabah\". In the book of hadith al-Muwatta \"Kitab al-Uqud\" from Imam Malik it is stated that Umar bin al-Khattab once set a diat for villagers, as much as a thousand dinars for those who had gold coins and twelve thousand dirhams for those who had silver coins, and diat this is only obligatory on the 'aqilah of the killer."
		   },
		   {
			"id": 586,
			"surah": 4,
			"ayat": 93,
			"tafsir": "How great is the sin of a believer who kills another believer on purpose. In the beginning of the last verse it was mentioned as an act that is inappropriate for a believer because his faith should prevent him from doing that. So this verse mentions the punishment that will be meted out to a believer who kills another believer on purpose, the same as the punishment provided by Allah SWT for an unbeliever, so that it is as if the killer is equated with an unbeliever because of the crime he has committed at all. unworthy of a believer. According to this verse, the punishment that will be applied to him is the eternal punishment of hell in it and the wrath and curse of Allah. Hell Hell is the most severe punishment. The eternity of a person in hell shows that Allah does not accept his repentance. While the curse of Allah means being kept away from His mercy forever. Allah's wrath against someone will keep him away from His pleasure, besides that there is also a great punishment that is not explained in this verse. It should be noted that the various punishments mentioned in this verse are threatened for the killer of a believer, who kills another believer on purpose, is a ukhrawi punishment, namely a punishment that will be received in the afterlife. While in this world, worldly punishments are applied by the authorities. According to the rules that have been determined in religion, namely: if in a court session someone has been proven guilty, then the kisas law is imposed against him, namely retribution in proportion, life for life. However, if the heir of the murdered person apologizes and does not want the execution of kikas punishment against the killer, then the killer is required to pay the death penalty, which must be carried out in a good manner. Meaning: must be paid by the person concerned at the time and with the amount determined by the court without delaying time. On the other hand, the receiving party must be patient until the appointed time comes and not be urgent (see al-Baqarah\/2:178). Regarding the repentance of the killer, according to Zahir, this verse is indeed not accepted by Allah SWT, because in this verse it is stated that he will remain in hell, while those whose repentance is accepted by God will not remain in hell. Regarding this issue, there are two opinions: First: The opinion of some friends, including Ibn Abbas, said that a believer who kills another believer on purpose is not accepted by Allah SWT. It is different with a polytheist who, even though during his polytheistic times he killed, but he did so before he received guidance and did not know Allah's laws, then the act of killing is forgiven by Allah as long as the act is not repeated after converting to Islam. But when he has received guidance and has known the laws and prohibitions of religion, then his actions mean that he despise God's law that he already knows well, and it is as if he has abandoned his faith. So it is natural that Allah does not accept his repentance, instead Allah gives him eternal punishment in Hellfire and His wrath and curse. Second: The opinion of some scholars, the killer even though he kills another believer on purpose, but if he repents then his repentance is still accepted by Allah, because Allah has explained that it is only the sin of shirk that He does not forgive. As for sins other than shirk, they can still be forgiven for those whom He wills. Allah says: Surely Allah will not forgive (sins) for associating partners with Him (shirk), and He forgives what (sins) other than (shirk) is for whom He wills. Whoever associates partners with Allah, then indeed, he has committed a great sin. (an-Nisa\/4:48). If Allah can accept the repentance of a person who used to be a polytheist who committed murder and adultery, then he converts to Islam and repents and always does good deeds and avoids evil deeds, why is it that the repentance of a believer who commits only one murder is not acceptable to Allah? Is it not possible that after carrying out the murder which may have been caused by an overwhelming emotional impulse, he is aware of his mistake and knows how great his sin is and how severe the punishment he will receive, then he repents to Allah and stays away from all kinds of evil, and does good deeds. -good deeds diligently? As for those who claim to be believers, but he always wallows in sin and kills other believers who he considers to be his enemies, or because he wants to control property, then such people are not accepted by Allah for their repentance and they deserve to receive the punishment of hell and eternal in it and be overwritten by the wrath and curse of Allah if they do not repent before their death."
		   },
		   {
			"id": 587,
			"surah": 4,
			"ayat": 94,
			"tafsir": "When a believer goes to enemy territory to fight, they should be careful and careful with the people they meet, and do not rush to accuse him of being an \"unbeliever\" and then kill him. Especially if the person met has said Assalamu'alaikum, or has said La ilaha illallah, which is an Islamic greeting, then that person cannot be accused of being \"infidel\", as the reason for killing him because his greeting shows that he has submitted to Islam. , according to his zahir. Allah commands believers to conduct research before killing someone they consider an enemy, so as not to kill someone who has embraced Islam. Especially if the murder was committed simply because of the desire to own his property. Allah warns that believers should not do this, because He has provided many graces for those who believe in Him and comply with His provisions. Furthermore, Allah reminds the believers that at first they embraced Islam, they hid their faith, but they still say Assalamu'alaikum greetings when they meet fellow believers who have already embraced Islam. They did this to let them know that they had embraced Islam. Thus, they expect security for themselves, their families and their property from Muslims who have converted to Islam first. If they have done this before, and Allah has given them the security they desire, then it is only natural for them to respect those who do such things to them, and not rush to accuse someone of being an enemy of Islam, then kill him, and confiscate his property. Allah always knows all the deeds of His servant, and He will reward him accordingly, good or bad."
		   },
		   {
			"id": 588,
			"surah": 4,
			"ayat": 95,
			"tafsir": "Believers who struggle to defend Allah's religion with full faith and sincerity are not on the same level as those who are reluctant to do so. This verse emphasizes that the degree difference between the two groups is so great that those who strive for jihad have a very high degree. If people who do not strive for jihad realize their loss in this regard, then they will be moved and try to reach a high degree by participating in jihad with other believers. It is for this reason that this verse points out the difference between the two groups. Thus the intention contained in this verse is the same as the intention contained in the word of Allah in another verse which explains the difference in degrees between the believers who have knowledge and those who have no knowledge. ¦.Say, \"Are those who know and those who do not know the same?\" ¦ (az-Zumar\/39:9). Knowledgeable people are much higher degrees than people who are not knowledgeable. If people who are not knowledgeable know that they are deficient in degrees, may their hearts be moved to seek knowledge diligently, so that they can increase their degrees. This verse was revealed during the Battle of Badr. Among the Muslims there are those who remain at home, and are not willing to go to war. Then this verse was sent down to remind them that with such an attitude, they are at a lower level, compared to the degree of those who wage jihad with full faith and awareness. While there are Muslims who really want to join in jihad, they cannot carry out their intentions and wishes because they are old, for example: because they are blind, lame, sick and so on, or they don't have anything to donate. Such people cannot be equated with people who are reluctant to do jihad, but are equated with people who are fighting jihad with their material possessions and their bodies and souls. This verse also explains that those who really do jihad with their material possessions and their body and soul gain a higher dignity one degree than those who do not do jihad because of old age. But that group will get a reward from Allah, because of their sincere faith and intentions. Allah will give a far greater reward to those who strive, than those who do not strive without any excuse. Fighting or jihad \"with property\" is: using one's own property for the purposes of jihad, or for the needs of other people who participate in jihad, for example: supplies in the form of food, vehicles, weapons and so on. Struggling with \"body and soul\" means: he is willing to sacrifice his most valuable possession for him, namely his energy and even his soul, even though he receives supplies from other people, because he does not have them."
		   },
		   {
			"id": 589,
			"surah": 4,
			"ayat": 96,
			"tafsir": "This verse is a continuation and explanation of the previous verse, because at the end of the last verse it is stated that Allah will give a greater reward to those who strive, but it has not yet been explained what this great reward will be. So this verse explains that the greatest reward is: the superiority of their dignity by several degrees with Allah, the Most Forgiving and His forgiveness and mercy."
		   },
		   {
			"id": 590,
			"surah": 4,
			"ayat": 97,
			"tafsir": "There is a group of Muslims who remain in Mecca. They hid their Islam from the people of Mecca and they did not emigrate to Medina, even though they had the ability to make the migration. They feel happy living in Mecca, even though they do not have the freedom to carry out religious teachings and foster them. God declared them to be self-deceivers. When the Battle of Badr took place, they were forced to join the war by polytheists against the Prophet Muhammad. In this war some of them were killed. ) After they died angels reproached them, because they did nothing in matters of their religion (Islam), such as not being able to carry out religious teachings. They replied by proposing that they did not carry out religious teachings, due to pressure from the polytheists of Mecca, so that they abandoned many religious obligations. The angels rejected their reason. If they really wanted to carry out religious teachings, of course they would leave Mecca and migrate to Medina. Isn't God's earth wide? Why are they happy to stay in Mecca, not wanting to emigrate? Even though they have the ability and opportunity to migrate? They do not move to a new place where they will gain freedom in carrying out religious teachings and obtain peace and independence. Therefore they had bad luck. They are thrown into hell Hell which is the worst place. In general, every Muslim is obliged to emigrate from a land of infidels if in that country there is no guarantee of freedom to carry out religious obligations and maintain religion. But if there is a guarantee of freedom of religion in that country and the freedom to foster religious education for himself and his family, then he is not required to emigrate."
		   },
		   {
			"id": 591,
			"surah": 4,
			"ayat": 98,
			"tafsir": "Then in this verse Allah swt excludes groups of people who are oppressed, both men and women, such as' Iyasy bin Abi Rabi'ah and Salamah bin Hisham, Ummul Fadli and Umm Abdillah bin Abbas, and children like Abdullah bin Abbas and others -other. They are not seen as self-defeating and are not seen as sinful because they abandoned the obligation to emigrate. These were the people who were truly oppressed because they did not have the ability to get out of Mecca. They do not have the effort, provisions and living to emigrate. They do not know the way out of the predicament. The factors of aging, illness, poverty and also not knowing the way to Medina are among the acceptable reasons."
		   },
		   {
			"id": 592,
			"surah": 4,
			"ayat": 99,
			"tafsir": "Allah will forgive them because they are truly unable to perform hijrah. But if the ability and opportunity is there, immediately emigrate. Because migrating from the mushrik land of Mecca is a necessity. Verily, Allah is Most Forgiving of all kinds of sins of His servants which were committed due to forced circumstances and the right reasons. Allah will not pass judgment on them. Allah is Forgiving of their mistakes and will not reveal those mistakes in the future."
		   },
		   {
			"id": 593,
			"surah": 4,
			"ayat": 100,
			"tafsir": "Then Allah promised those who migrated to leave their hometowns because they obeyed Allah's commands and hoped for His approval, they would get a more prosperous, more peaceful and secure place to live and more easily fulfill their religious obligations in a new area, namely Medina. . Such a promise is very influential for those who emigrate. This is because in general the Muslims in Mecca who did not participate in the migration thought that the migration was full of suffering and that the area they were going to did not provide them with an easy way of life. Allah will provide easy living in this world and will give a perfect reward in the hereafter to those who migrated and died before they could reach Medina. It is very clear that Allah's promise to those who emigrated is compared to the promise to those who did not emigrate due to old age, because for this last group Allah's forgiveness is not clearly stated. Allah's forgiveness and mercy are very great for the immigrants who willingly leave their hometowns to uphold Allah's sentence. Narrated by Ibn Abi Hatim and Abu Ya'la with a good sanad from Ibn Abbas he said, \"Damrah bin Jundub left his house \"Take me and take me out of the earth of these polytheists (Mecca) to meet the Messenger of Allah.\" So he went, on the way he died before meeting the Prophet Muhammad saw and then this verse was revealed. The reasons Islam prescribed hijrah in the early days: 1. To escape the pressure and oppression of the infidels of Mecca against Muslims, so that they have freedom in carrying out orders religion and uphold its teachings 2.To accept religious teachings from the Prophet Muhammad, then spread them throughout the world 3.To build a strong Islamic state that can spread Islam, enforce its laws, protect the people from enemies and protect the da'wah of Islamiyah. because this is what makes migration from Mecca an obligation for Muslims.After Muslims liberated Mecca t there is no longer any obligation to emigrate, because these three causes no longer exist. It was narrated from Ibn Abbas that the Prophet said: \"There is no migration after the liberation of Mecca, but what is there is jihad and intention. If you are ordered to fight, then fulfill that order\" (Narrated by al-Bukhari and Muslim from Ibn 'Abbas)."
		   },
		   {
			"id": 594,
			"surah": 4,
			"ayat": 101,
			"tafsir": "In this verse it is explained that it is permissible for Muslims to perform the obligatory qasar prayer (qashar) when he is on a journey, either in a state of security or under threat from enemies. Praying while on a safe journey is called the Safar prayer. During the safar prayer, the prayer which consists of four cycles: noon, asr, and isya is divided into two cycles. Maghrib and dawn are not measured. The requirement for menqasar safar prayer is a journey whose distance is measured by walking for three days and three nights. According to Imam Syafii, the trip is two days or 89 km. According to the calculations of the Hanafi school, 3 farsakh (18 km). Meanwhile, according to another opinion, the ability to rough the prayer is not bound by the provisions of long distances, but as long as it can be called safar, it is permissible to rough it. Praying on a journey that is in danger is called khauf prayer, as it is said in the verse: \"If you are afraid of being attacked by unbelievers.\" How to pray this khauf is explained in the following verse. (102) In this verse, it is explained how to pray khauf, that is, when the Prophet was in the ranks of the Muslims and he wanted to pray with his troops, he first divided his troops into two groups. The first group prayed with the Apostle while the second group remained in place facing the enemy while protecting the group that was praying. The group that is praying is required to carry weapons during prayer to guard against the possibility of the enemy attacking and to keep them alert. When this first group has completed the first cycle, they should go to replace the second group, and the Prophet waited in prayer. This second group also had to carry weapons and even had to be more alert. The Prophet prayed with this second group in the second cycle. After this second rak'ah he recited the greeting, then each group completed one more cycle in turn. From Ibn Umar ra he said: \"The Prophet saw did the khauf prayer with one of the two groups of one cycle, while the other group faced the enemy. Then the first group moved to occupy their group of friends while facing the enemy, then came the second group and prayed in behind the Prophet one rak'ah, then the Prophet recited the greeting. Then each group finished praying one more cycle.\" (History of al-Bukhari and Muslim from Ibn 'Umar). This verse forms the basis of the khauf prayer. In this verse, Allah SWT explains the reason for the Muslims praying with their weapons in the khauf prayer, that is, if the enemy who is not far from them is always lurking when the Islamic troops lose their vigilance and leave their weapons and equipment behind, then that is when the infidel troops have the opportunity to strike. they. Then Allah explained that if the troops were having trouble due to rain or illness or other difficulties, it was permissible to carry weapons during the khauf prayer even if they were not wearing them. Indeed, Allah has prepared a humiliating punishment for the disbelievers, namely their defeat."
		   },
		   {
			"id": 595,
			"surah": 4,
			"ayat": 102,
			"tafsir": "This verse explains how to pray khauf, that is, when the Prophet was in the ranks of the Muslims and he wanted to pray with his troops, he first divided his troops into two groups. The first group prayed with the Apostle while the second group remained in place facing the enemy while protecting the group that was praying. The group that is praying is required to carry weapons during prayer to guard against the possibility of the enemy attacking and to keep them alert. When this first group has completed the first cycle, they should go to replace the second group, and the Prophet waited in prayer. This second group also had to carry weapons and even had to be more alert. The Prophet prayed with this second group in the second cycle. After this second rak'ah he recited the greeting, then each group completed one more cycle in turn. From Ibn Umar ra he said: \"The Prophet saw performed the khauf prayer with one of the two groups of one cycle, while the other group faced the enemy. Then the first group moved to occupy their group of friends while facing the enemy, then came the second group and prayed behind the Prophet one rak'ah as well then the Prophet read greetings. Then each group finishes the prayer one cycle more.\" (History of al-Bukhari and Muslim from Ibn 'Umar). This verse forms the basis of the khauf prayer. In this verse, Allah SWT explains the reason for the Muslims praying with their weapons in the khauf prayer, that is, if the enemy who is not far from them is always lurking when the Islamic troops lose their vigilance and leave their weapons and equipment behind, then that is when the infidel troops have the opportunity to strike. they. Then Allah explained that if the troops were having trouble due to rain or illness or other difficulties, it was permissible to carry weapons during the khauf prayer even if they were not wearing them. Indeed, Allah has prepared a humiliating punishment for the disbelievers, namely their defeat."
		   },
		   {
			"id": 596,
			"surah": 4,
			"ayat": 103,
			"tafsir": "Furthermore, it was ordered that when the khauf prayer is completed in the manner described above, then the Islamic forces should remember Allah constantly in all circumstances. Moreover, they must mention the name of Allah when they are under threat from the enemy. Allah will help them as long as they help Allah's religion. Let them say tahmid and takbir while standing on the battlefield, or while sitting shooting at the enemy or when lying down because of an injury. All physical and mental suffering will disappear, if the soul is filled with remembrance of Allah, therefore Muslims must continue to remember and remember Allah whether in a state of war or peace. Believers are always in the struggle. At one moment he is fighting with the enemy, at another moment he is fighting against his passions. Thus remembrance of Allah is ordered at all times because it educates the soul, cleanses the spirit and instills the greatness of Allah into the heart. When the war is over, fear is gone and the heart is at ease, let the prayers be performed in accordance with the terms and conditions. Because prayer is an obligation for believers and they are obliged to maintain the time that has been set. At least five times a day and night Muslims pray so that they always remember Allah, thereby eliminating the possibility of falling into evil and error. For people who want to get closer to Allah, five times is considered a bit, so he adds more sunnah prayers at times determined in religion."
		   },
		   {
			"id": 597,
			"surah": 4,
			"ayat": 104,
			"tafsir": "Then it was explained that after the Islamic forces finished performing the prayer services, they must be ready to return to face the enemy. Do not be the least bit afraid in the face of the enemy. In war, if you don't attack, you will definitely be attacked. In this verse there is actually an order to stand firm against the enemy, because a higher fighting spirit will determine success. Allah ordered that the Islamic forces always be on alert with trust in Allah. The end of a war is suffering, and suffering is not only for the aggressor but also for the attacked. \"If you (in the Battle of Uhud) get injured, then they also (in the Battle of Badr) get a similar wound. ¦.\" (Â'li' Imran\/3:140). If the enemy can endure suffering, why are the Muslims impatient? Islamic troops should be more patient and more steadfast than non-believers, because they have hope from Allah that non-believers do not have. Allah promised the Islamic mujahid at least one of two fortunes. Namely they gain victory in battle or heaven for the martyrs. This promise of Allah encourages every Islamic fighter to fight more persistently, patiently and bravely. Allah is All-Knowing of all that is beneficial to religion and to the Muslims. He will not carry a burden beyond their means, for He is All-Wise. In accordance with His knowledge and wisdom, the gain is certain for the right side and the destruction is certain for the wrong side."
		   },
		   {
			"id": 598,
			"surah": 4,
			"ayat": 105,
			"tafsir": "The Qur'an was revealed to the Prophet Muhammad to judge cases that occurred between humans based on the laws taught by Allah. Based on the book, the Prophet Muhammad decided a case fairly. He is forbidden to be the opponent of the right or the friend of the wrong. This verse reprimanded the Apostle because he blindly believed the report of the Bani Â¨afar and he immediately released thu'mah. As if he became a defender for people who are not necessarily right."
		   },
		   {
			"id": 599,
			"surah": 4,
			"ayat": 106,
			"tafsir": "Then Allah ordered the Messenger of Allah to ask forgiveness from Him for his attitude that was quick to believe in the report of one party in a dispute because indeed Allah is the Greatest of His forgiveness and Most Compassionate and Merciful to His servants who ask for forgiveness. His actions were not a mistake. He decided with ijtihad, and the accusations against Tu'mah were not supported by any evidence, so he believed the statement of the defense of Tu'mah's family. It was narrated from Sahih Bukhari and Sahih Muslim as follows: \"From Umm Salamah that the Messenger of Allah heard the commotion of people arguing at the door of his house, then he came to them. He said, \"Know that in fact I am only a human being. I decide a matter according to what I hear. Maybe one of you is better at coming up with reasons than the others, so I make a decision for him. So whoever I assign to him the rights of a Muslim, then that right is actually a piece of the fire of hell. So let him carry it or throw it away.\" (Narrated by al-Bukhari-Muslim)."
		   },
		   {
			"id": 600,
			"surah": 4,
			"ayat": 107,
			"tafsir": "The Prophet Muhammad was forbidden to defend those who betrayed themselves, such as thu'mah with his relatives who tried to cover up their mistakes. They are said to have betrayed themselves while those who are betrayed are actually other people because the consequences of that betrayal will befall themselves. Truly Allah does not like those who are treacherous, sinful and pollute their souls with evil deeds such as thu'mah which turns out that after the cover of his crime was exposed he apostatized and fled to Mecca to join the polytheists."
		   },
		   {
			"id": 601,
			"surah": 4,
			"ayat": 108,
			"tafsir": "The traitor hides from humans when he commits a crime, perhaps out of shame or fear of reprisal. But they did not hide from Allah nor were they ashamed of Him by doing this evil deed. If they had strong faith they would not have done it. A believer will not fall into betrayal unless he forgets or is not aware of it. A person who realizes that Allah always sees him wherever he is, surely he has not sinned or cheated, because he is ashamed of God and fears Him. Allah witnessed when Bani Ubairik held meetings at night and made a secret decision, namely to cast the evil they had committed on other innocent people. Allah will pass judgment on them, because He knows all their deeds. Nothing in the heavens or on earth is hidden from God, no matter how small."
		   },
		   {
			"id": 602,
			"surah": 4,
			"ayat": 109,
			"tafsir": "This verse is addressed to those who want to defend those who cheat, namely the Banu Â¨afar and try to clear themselves of all accusations of stealing. If their defense is successful, then who will be able to defend them before Allah on the Day of Judgment? Wasn't it Allah who was the All-Knowing of all human deeds at that time who was the judge to adjudicate all disputes? No one can be a defender of the guilty in this world and protect them on the Day of Judgment. (That is) the day (when) someone is completely helpless (helping) others. And all matters on that day are in the power of Allah. (al-Infitar\/82:19). Muslims must realize that the fortune he earns fraudulently through court in this world will be a torment for him in the hereafter."
		   },
		   {
			"id": 603,
			"surah": 4,
			"ayat": 110,
			"tafsir": "This verse gives encouragement to those who make mistakes to realize themselves and return to the right path, repenting to Allah. Their actions wrong themselves by committing immorality, such as false oaths that Allah will forgive them if they truly ask Him for forgiveness. In this verse, it is explained how to get out of sin after being mired in it and after a warning has been sent down to the enemies of truth, namely by repenting and asking for forgiveness. Those who ask for forgiveness will find Allah Most Forgiving and Most Merciful. He will feel the result of Allah's forgiveness on him, namely hatred for disobedience and its causes. He will also feel God's love for him with the growing desire in his heart to do good."
		   },
		   {
			"id": 604,
			"surah": 4,
			"ayat": 111,
			"tafsir": "Then this verse warns of the disaster of sinful acts, that is, whoever commits a sin and thinks that the work will be beneficial to himself will surely experience the opposite. His work will result in disaster and suffering for him, without the slightest benefit. Rotten deeds are slowly or quickly smelled by society. The court will reveal his ugliness in public and sentence him. This is humiliation of himself and the suffering of the world. In the afterlife he will again experience Allah's punishment. Allah, with His vast knowledge, has determined which actions are forbidden, and with His wisdom has determined the punishment for violations of those actions. It is man who destroys himself when he violates the boundaries set by God."
		   },
		   {
			"id": 605,
			"surah": 4,
			"ayat": 112,
			"tafsir": "The person who commits a sin unintentionally or intentionally, then they blame it on others and accuse others of doing it, while he knows the other person is innocent, then he has actually made a big lie and will bear his sin as was done the Banu Ubairiq family who blamed Tu'mah's crime on Zaid bin Saleh. People like Tu'mah and his family still commit two kinds of crimes. Evil commits sinful acts itself and evil hurling unjust accusations at others."
		   },
		   {
			"id": 606,
			"surah": 4,
			"ayat": 113,
			"tafsir": "In this verse, it is explained that Allah's grace and blessings were given to the Prophet Muhammad. It was explained that without His gifts and favors to the Prophet, surely those groups who desire to lead him astray will succeed. Among the gifts and graces of Allah is His notification to the Prophet regarding the actions of Tu'mah and his relatives. Thanks to Allah's notification and guidance, the plan of the Banu Â¨afar and their supporters failed. If the group's plan had been implemented, the Prophet would have had to provide the time and energy to deal with it. Even though in front of him there are many more important matters and tasks that require energy and thought. But Allah does not allow His Messenger to be mocked by people who are corrupt in morals. They actually feel sorry for themselves because they are getting further away from the path that Allah shows. They could not make things difficult for the Prophet in the slightest, because in making decisions he did not follow his desires. He acts according to the facts. It did not cross his mind that the actual situation contradicted the reports he had received. By Allah's mercy and grace, the Prophet was protected from making wrong decisions. Furthermore, it was explained that Allah had bestowed His grace on His Prophet by sending down the Al-Qur'an and al-Hikmah to be used in making a decision. He taught him what he did not know before. Allah's gift to the Prophet Muhammad is very great, because he was sent to all mankind for all time."
		   },
		   {
			"id": 607,
			"surah": 4,
			"ayat": 114,
			"tafsir": "Keeping secret conversations and abominable deeds, as was done by Thu'mah and his friends, is a forbidden act, it has no benefit, except for those whispers to order charity, do good and make peace between people. Whispering and hiding conversations are usually done to keep forbidden actions, evil deeds and to eliminate goodness, rarely done for good and commendable deeds. Humans by their nature like to express and tell other people or to many people about the good deeds they have done or will do. While evil deeds or sinful acts that have been or will be committed, are always hidden and kept secret. He was afraid that other people would find out, in accordance with the words of the Prophet Muhammad: \"Virtue is good character, and sin is what feels bad in your heart, and you don't like others knowing about it\" (History of Muslim). Because of that, it is commanded that believers stay away from these actions, especially whispering or holding secret talks to commit acts of sin, enmity, belie the Prophet and so on. Another verse confirms Allah's prohibition and states that whispering and making secret agreements to commit sinful acts, including those of Satan. Allah said: (9) O you who believe! When you hold secret talks, do not talk about sin, enmity and disobedience to the Apostle. But talk about good deeds and piety. And fear Allah to whom you will be gathered again. (10) In fact, the secret conversation includes (the actions of) Satan, so that the believers grieve, while (the talk) does not cause them the slightest disaster, except by Allah's permission. And in Allah should those who believe put their trust. (al-Mujilah\/58:9-10). Allah has excluded three types of actions that are permissible and even commanded to convey them in whispers or in secret, namely giving charity, doing good and making peace between people. Charity is one of the good deeds that Allah highly recommends. But mentioning it or telling it in front of many people can sometimes cause displeasure in the hearts of those who receive it. Sometimes it is even felt as an insult to him, even though the alms giver has stated that he gives alms with a sincere heart and to seek the pleasure of Allah SWT. \"If you show your alms, then that is good. And if you hide it and give it to poor people, then it is better for you\" (al-Baqarah\/2:271). Makruf actions are the opposite of wrongdoing, the opposite of all actions that are prohibited by Allah, the Omniscient, and actions that follow desires. Advising someone to act in a way that is correct in front of a crowd may cause discomfort to the person being advised, if the person being given the advice is a peer or someone with a higher degree than the person giving the advice. Usually the person giving the advice has a higher degree, rank or position than the person being advised. Because of that Allah commands to advise someone to do good by whispering and not being heard by others. If other people hear it, the person being advised may feel humiliated and hurt, so that the advice is not accepted. Muslims are ordered to always guard and try to make peace between people who are in dispute, especially to make peace between believing brothers, according to the word of Allah: Verily, the believers are brothers, so make peace between your two brothers (who are in dispute) and be pious. to Allah that you may receive mercy. (al-hujurat\/49:10). \"¦ So fear Allah and improve relations among yourselves, ¦\" (al-Anfal\/8:1). Efforts to make peace between disputing believers are commendable and commanded by Allah. But mentioning this effort to other people or being heard by many people might lead to harm or other crimes, so that the intention of reconciliation will turn into slander that can deepen the gap between the people who will be reconciled. There are people who are reluctant to be reconciled when they know that it is someone else who will reconcile. There are also people who are reluctant to accept peace if the peace process is known by many people, because they are worried that the effort will become the subject of many people's discussions. In addition, there may also be third parties who do not want peace to occur. For this reason, Allah commands believers to keep secrets and efforts related to making peace between people. Those who carry out the three kinds of commandments of Allah, namely giving charity, doing good and seeking peace between people by submitting and obeying Him and seeking His approval, will be rewarded manifold by Allah. Allah's pleasure can only be achieved by doing good and useful deeds, accompanied by sincerity according to what He commands."
		   },
		   {
			"id": 608,
			"surah": 4,
			"ayat": 115,
			"tafsir": "Someone who opposes the Messenger of Allah after it is clear to him the truth of the message he has brought, and follows the path of people who deviate from the path of truth, then Allah allows them to follow the misguided path he has chosen. Then He will put them into hell, the worst place to return. This verse is closely related to the actions of the Tu'mah and his followers, and the actions of those who act as the Tu'mah did. From this verse it is understood that Allah has bestowed upon man the will and freedom of choice. In other verses of the Qur'an it is also explained that Allah has bestowed reason, thoughts and feelings and equipped them with the instructions brought by the apostles. If man makes good use of all of God's gifts, surely he can follow the right path. But most humans are selfish, follow their desires so they do not use reason, thoughts, feelings, and God's instructions in determining and choosing the actions that should be done. Because of this, there are people who challenge and oppose the apostles, after the truth has become clear to them, and there are also people who like to do evil works, even though their hearts admit that their actions were wrong. Allah judges human actions, then He rewards them accordingly, good deeds are rewarded with multiple rewards, while bad deeds are rewarded accordingly."
		   },
		   {
			"id": 609,
			"surah": 4,
			"ayat": 116,
			"tafsir": "Allah will not forgive the sins of those who acknowledge the existence of gods other than Allah or worship other than Allah, but He forgives other sins. From this verse it is understood that there are two kinds of sins, namely: 1. Sins that Allah does not forgive, the sin of shirk. 2. Sins that Allah can forgive, sins other than shirk sins. If someone shares Allah, it means that in his heart there is no acknowledgment of the oneness of Allah. Because of this his relationship with Allah Almighty, the Most Helpful, the Most Compassionate, the Most Merciful has been severed: This means that he no longer has a helper, protector, caretaker, as if he had been separated from God Almighty. He has gone astray and deviated far from the straight path that Allah approves of, so it is impossible for him to draw closer to Allah. If a person's heart and soul has grown shirk, it means that his heart and soul have been seized by the most severe disease; no medicine can cure it. All kinds of truth and goodness that exist in that person will not be able to compensate, let alone eradicate the evil and damage caused by that shirk. The heart of a polytheist is no longer related to Allah, but is attached to lust, greed and greed for property which will not help him in the slightest. That is why Allah confirms that the sin of shirk is very great and He will not forgive it. If a person's heart and soul are clean from shirk, or there is a light of faith in them, then even though he has done sin, his heart will grow faith and guidance will come to him, then he will repent, because the light of faith that is in his heart can shine again. That's why Allah will forgive his sin because it is not a sin of shirk. An-Nisa' 48 has explained that Allah will not forgive the sin of shirk, but will forgive sins other than that sin. The repetition of this statement is to emphasize to believers that they stay away from shirk. Let them cultivate monotheism in their hearts, because monotheism is the foundation of religion."
		   },
		   {
			"id": 610,
			"surah": 4,
			"ayat": 117,
			"tafsir": "It was customary for the ignorant Arabs to call, worship and ask for help from the statues they made themselves. They believed them to be gods other than Allah, and they named them with female names (inatsan), such as al-Lata, al-'Uzza and Manat. The idols or statues they decorated and dressed like women. Each tribe or tribe has its own idol which they name with the names of women. Some commentators interpret inatsan as \"a person who has died\", because a person who has died is weak and helpless. The ignorant Arabs revered and worshiped their dead ancestors. They believe that the dead person can be used as an intermediary to convey wishes or wishes to supernatural powers that they do not know about the circumstances and form. Such a belief is unconsciously shared by many of the People of the Book and some Muslims today. Belief in worshiping idols, worshiping objects, revering and worshiping dead people is a belief that arises because of following lust and following the deceit of the rebellious satan who always tries to mislead Adam's children and grandchildren from the straight path, as they had previously promised."
		   },
		   {
			"id": 611,
			"surah": 4,
			"ayat": 118,
			"tafsir": "Besides having the trait of disobedience, Satan has also received curses and wrath from Allah. They have grown far from His mercy and grace, because they are always trying to persuade people to do evil and to carry out its prohibitions, by whispering things and making people look good at those forbidden actions. Satan reveals to God that he will influence some people, so that they will follow his will, and become lawless servants like him. He will carry out this statement in all kinds of ways and efforts and with all the intelligence he has. It is also understood from this verse that there are humans who are obedient to Allah and cannot be tempted by Satan and there are also those who are disobedient to Allah and can be tempted by him. This is in accordance with God's word which states that humans have a willingness to do good and a willingness to do evil. Allah says: And We have shown him two ways (righteous and evil). (al-Balad\/90:10). Satan tries to take advantage of the potential for evil that exists in humans to carry out his statement to God. In some humans the potential to do evil cannot be exploited by Satan, because the potential for doing so has been hampered by the potential for good that has developed and grown in them."
		   },
		   {
			"id": 612,
			"surah": 4,
			"ayat": 119,
			"tafsir": "In this verse, Satan's actions and efforts are explained in using the evil potential that exists in humans, so that his goal of harming humans can be achieved, namely by: 1. Trying to turn people away from true beliefs by obscuring God's guidance to the right path, so that they get lost and take the path the devil wants. 2. Trying to deceive the human mind with dreams that are impossible to happen and with empty dreams, so that they look favorably on all prohibited actions, and instill in their hearts and minds that the pleasures of living in this world are pleasures that must be achieved while pleasures and happiness in the hereafter is a pleasure that is doubtful. 3. Trying to mislead people by making them see that something that is lawful is unlawful, on the contrary to see what is lawful as something that is unlawful, as was the case among the ignorant Arabs. According to ignorant Arab beliefs, some animals that will be sacrificed to idols are cut or have their ears cut open. If the animal has its ears cut off or its ears split, it means that it has become the property of an idol, therefore it is no longer allowed to be ridden or used for any other purpose; the animal is left free and not to be disturbed by anyone. 4. Changing God's creation, according to some commentators, is changing the conditions that God has created, such as castrating a man so that he can be made a guard for the wives or slaves of a prince, as is often done in other countries. Arabia and other ancient lands. According to some commentators, what is meant by God's creation is God's religion, because God's religion has become a nature for humans. Allah says: So set your face straight towards the religion (Islam); (according to) Allah's fitrah because He has created humans according to that (fitrah). There is no change in Allah's creation. (That is) the straight religion, but most people do not know. (ar-Rum\/30:30). Humans were created by God to have the nature of monotheistic religion, to acknowledge the oneness of God, not to have anything to do with anything, only God has the right to be worshiped. If there are humans who do not recognize the oneness of Allah, it means that the influence of the surrounding natural environment has overcome their nature. Including what influences humans is the devil's attempt to eliminate that instinct, as mentioned in the hadith: From ' Iyad bin hammad, the Messenger of Allah said, said Allah 'Azza wajalla, \"Verily I have created My servants inclined towards (My religion) ), then the devil came to them, then the devil turned them away from their religion and he made forbidden what I had made lawful for them.\" (Muslim history). Allah warns His servants with a statement that whoever follows the promptings, tricks and desires of satan means that he has been far from His mercy and grace and has lost in this world (and in the hereafter), because satan always tries to use all human weaknesses to carry out his promise to Allah."
		   },
		   {
			"id": 613,
			"surah": 4,
			"ayat": 120,
			"tafsir": "Satan always makes grandiose promises and creates empty dreams and creates fantasies in the hearts and minds of people. If someone wants to spend his wealth in the way of Allah, he whispers to that person that spending it results in poverty, and he is promised pleasure and glory if humans are stingy. The gambler is lured with joy and wealth without effort, the intoxicant is whispered with joy and pleasure when someone is drunk and so on. Included in Satan's promises are promises and enticements that are instilled in those who want to violate God's prohibitions for their own interests. such as rank, honor and so on. Satan's promises are nothing but deceit, he will not be able to keep anything and no results can be expected, such as promises and dreams that are instilled in gamblers, alcoholics, adulterers, people who are crazy about rank and crazy about respect. They fantasize about the pleasure and happiness of the results of their actions, but they never enjoy those results."
		   },
		   {
			"id": 614,
			"surah": 4,
			"ayat": 121,
			"tafsir": "Because those who follow and fulfill Satan's desires have gone astray, their book of deeds has been filled with acts of sin and immorality. Therefore, their place is hell, they cannot get out of it, because there is no goodness that can free and save them from the punishment of hell."
		   },
		   {
			"id": 615,
			"surah": 4,
			"ayat": 122,
			"tafsir": "People who believe and do good deeds, they are not deceived by Satan's temptations, they don't want to become Satan's helpers, they follow Allah's instructions, carry out commands and leave His prohibitions. They are rewarded with a paradise full of favors, underneath which rivers flow. They are eternal in heaven, because nothing can take them out of a place full of pleasure and happiness. That is God's promise to His faithful servants, not a false promise, nor empty wishful thinking that has no results that the devil whispers, but a promise that is sure to be kept, because the one who promises it is the Almighty, the Mighty, the Most Rich, the Owner. whole nature. Satan's promise is impossible to keep, because he himself does not have the ability to fulfill it. Allah said: And satan said when the matter (hisab) had been settled, \"Indeed Allah has promised you a true promise, and I also promised you but I violated it. I have no power over you, except (only) I call you and you obey my cry, therefore do not revile me, but blame yourselves. I cannot help you, nor can you help me. Verily, I do not justify what you did associating me (with Allah) long ago.\" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14:22)."
		   },
		   {
			"id": 616,
			"surah": 4,
			"ayat": 123,
			"tafsir": "There is no privilege for a person, except with his good deeds and it is impossible for him to escape Allah's punishment and it is impossible for him to enter heaven simply by saying that the religion he adheres to is the best and perfect religion, as well as the prophets and messengers they follow is the highest rank in the sight of Allah, just as the People of the Book said. Let those who believe do good deeds, carry out Allah's commandments and leave His prohibitions because the reward is given by Allah based on deeds that are done sincerely, not based on empty words and wishful thinking. God brought religion not to boast and be proud of that religion, but religion was brought in to be practiced and implemented. Among the reasons that give rise to such misunderstandings and delusions are due to human errors in understanding religion or they deliberately do so so that they are considered higher than other peoples or nations, because Allah appointed prophets or messengers from other nations. their nation. With the glory and infallibility (preserved from sin) of the prophets and apostles, they felt they had gained glory and were also protected from Allah's punishment. Therefore according to their opinion, they will enter heaven and be released from the torment of hell, without carrying out Allah's commands and stopping His prohibitions. Such suspicions and empty dreams have also spread among Muslims, as mentioned in this verse. This attitude has also been expressed by the People of the Book, as stated in another verse: The Jews and Christians say, \"We are children of Allah and His lovers.\" ¦ (al-Maidah\/5:18). And they said, \"Hell will not touch us, except for a few days.\" ¦ (al-Baqarah\/2:80). Every evil that humans commit, God will repay, because all kinds of good or bad deeds that are done by someone, the responsibility is borne by the person who did it, not borne by other people. Therefore, people who truly believe should research and take into account every work that will be done, so that it is in accordance with Allah's instructions. It was narrated by Ahmad and Ibn Zuhair, that when this verse was revealed Abu Bakr was very concerned about it and was worried. So he asked the Messenger of Allah, \"Who is safe from this, O Messenger of Allah?\" The Messenger of Allah replied, \"Have you never been in trouble, have you never been sick, and have calamities never befall you?\" Abu Bakr replied, \"Once O Messenger of Allah.\" The Messenger of Allah said, \"That is he (retribution for your mistakes).\" It was also narrated by Muslim from Abu Hurairah, he said, \"When this verse was revealed, the Muslims felt it was hard and it came to them what Allah wanted,\" so they complained to the Messenger of Allah. The Messenger of Allah replied, \"Take your place and draw closer to each other, in fact every calamity that befalls a human being is a ransom (for his actions) to the thorns that pierce him and the calamity that befalls him.\" From this hadith, it can be understood that all the calamities that befall humans, whether small or large, a little or a lot, are the result of their negligence, mistakes and bad deeds, because they no longer follow the sunatullah. Allah says: And whatever calamity befalls you is because of what your own hands have done, and Allah forgives many (of your faults). (asy-Shura\/42:30). Some commentators are of the opinion that the calamities that befall people in this world cannot erase the punishment in the hereafter, except if those afflicted with the calamity try to erase their mistakes and bad actions with good deeds, by strengthening their faith, by leaving evil deeds and repenting during their life in this world. . Verily Allah is Most Forgiving, Most Forgiving. Those who do evil must receive punishment from Allah and he has no helper and protector besides Allah to avoid this punishment, and Satan who promises protection and help is unable to fulfill his promise."
		   },
		   {
			"id": 617,
			"surah": 4,
			"ayat": 124,
			"tafsir": "People who do good deeds and purify themselves according to their abilities, improve their character, improve their relationships with other people in their association in society and people who do not want to follow Satan's tricks, Allah promises to repay their kindness with a perfect reward by providing heaven for them, and Allah will not reduce the reward of their deeds even in the slightest. This verse is a warning and a lesson for Muslims that humans cannot depend on their hopes and aspirations solely on wishful thinking and imagination, but should be based on effort and action. People who are proud of their ancestry and nation are people who go astray, will not achieve what they aspire to."
		   },
		   {
			"id": 618,
			"surah": 4,
			"ayat": 125,
			"tafsir": "There is no one who is better in religion than someone who obeys and submits to Allah, he does good and follows the religion of Abraham. From this verse it can be understood that there are three kinds of measurements that can be used as a basis for determining the height of a religion and the condition of its adherents, namely: 1. Surrendering oneself only to Allah, 2. Doing good, and 3. Following the hanif Abrahamic religion. A person is said to surrender himself to Allah, if he surrenders his whole soul and body and his whole life only to Allah, the Most Gracious, the Most Merciful. Therefore he only prays, begs, asks for help and feels himself bound only to Allah alone. He is in direct contact with God without anything blocking him. To achieve this, one must know and study the traditions of the Prophet and the sunatullah that apply in this world, then put them into practice for the sole purpose of seeking the pleasure of Allah. If someone truly submits himself to Allah, then he will see and feel something when carrying out his worship, as described by the Messenger of Allah: Gabriel asked O Messenger of Allah, \"What is ihsan?\" Rasulullah saw replied, \"You worship Allah as if you see Him, if you do not see Him, then surely He sees you.\" (Al-Bukhari's history from Abu Hurairah). Doing good is a manifestation of surrendering to Allah. The more perfect a person's surrender, the better and more perfect the deeds he does. In addition to doing what is required, one should complete it with what is sunnah perfectly, according to one's ability. Following the hanif Abrahamic religion is following the straight Abrahamic religion which believes in the oneness of Allah, namely the true and straight belief. Allah said: (26) And (remember) when Abraham said to his father and his people, \"Indeed, I am apart from what you worship, (27) except (you worship) Allah who created me; for indeed, He will guide me. \" (28) And (Ibrahim) made (the sentence of monotheism) an eternal sentence for his descendants so that they would return (to the sentence of monotheism). (az-Zukhruf\/43:26-28) Even though there is an order to follow the religion of Abraham, it does not mean that Abraham was the first to bring the belief in monotheism, and the religion brought by the previous prophets was not based on monotheism. The purpose of the order to follow the religion of Prophet Abraham was to attract the attention of the Arabs, as the first nation to accept the call of Islam. Ibrahim as and Ishmael are the ancestors of the Arabs. The Arabs at that time were very happy to hear words explaining that they were followers of the religion of the Prophet Abraham, even though they had become idol worshippers. By linking the religion brought by the Prophet Muhammad with the religion brought by the Prophet Abraham, it will attract the hearts and awaken the Arabs who have been following a misguided path. He (Allah) has made known to you the religion which He has passed on to Noah and what We have revealed to you (Muhammad) and what We have left to Abraham, Musa and Isa ¦ (asy-Syura\/42:13). The religion brought by the Prophet Muhammad is not only in accordance with the religion brought by the Prophet Abraham, but is also related to and is in line with the religion brought by the Prophet Musa and Prophet Isa who were sent after the Prophet Abraham. Likewise, the religion of Islam is related and in line with the religion brought by the previous prophets of Allah. The order to follow the religion brought by Prophet Ibrahim here is because the lives of Abraham and his son Ismail can be used as good examples and reminds of the sacrifices they have made in spreading Allah's religion. This can also be used as an example by Muslims in dealing with infidels who always try to destroy Islam and Muslims. Abraham has become God's favorite, because of the strength of his faith, the height of his character and his sincerity and sacrifice in upholding God's religion. It's as if Allah stated that people who follow in the footsteps and steps of the Prophet Abraham and this can be seen in their behavior and character, have the right to call themselves followers of Abraham. Not like the Jews, Christians and Meccan polytheists who claimed to be followers of the Prophet Abraham, but they did not follow the religion he brought and also did not follow the example of his manners."
		   },
		   {
			"id": 619,
			"surah": 4,
			"ayat": 126,
			"tafsir": "This verse emphasizes Allah's power over the universe, as Creator, Owner, Sustainer, nothing escapes His knowledge. This verse is the conclusion of the previous verses, and contains several lessons: 1. To remind that Allah is the Almighty, the owner of all nature, therefore He must certainly fulfill his promise in the previous verses. 2. To explain that only to Him all creatures surrender, ask for help, put forward hope, not to others, because anything other than Allah belongs to Him and is under His control. 3. To explain the meaning of the words Ibrahim Khalilullah (God's favorite Abraham), with this verse it is clear that Abraham was not God's friend, as some People of the Book thought, but His favorite servant, because he was submissive and surrendered to God, always sacrificed and doing good. Abraham belongs to Allah, like other creatures, is not a person who associates with Allah in owning this world."
		   },
		   {
			"id": 620,
			"surah": 4,
			"ayat": 127,
			"tafsir": "History has described that the ignorant Arabs at the time this verse was revealed looked down on the position of women, the weak and orphans, as if they were meaningless creatures, unable to own anything, even they themselves could be owned and traded. as owning and trading goods. The revelation of the first verses up to verse 36 of surahh An-Nisa' which instructs people to protect the rights of the person, shocked the Arabs, because the order was inappropriate, even contrary to their customs. Because of this, various questions arose in their minds, and they wanted Allah to immediately send down verses of the Qur'an to answer these questions. Because of this verses 127 to 130 were revealed to further explain the rights of women, the weak and orphans which were explained at the beginning of this surahh so that the questions that arose in the minds of the ignorant Arabs answered. The friends asked the Prophet for a fatwa about women, namely about their rights both related to property, their rights as human beings, as well as their rights in the household. So this verse explains to them about these women and explains the laws mentioned in the verses that were revealed before this. According to the ignorant Arab custom, a wali has authority over an orphan under his care and care, and also has authority over his property, as if it had become his own. If the orphan is beautiful, he marries her, so that in this way he can control the orphan's property, and fulfill his desires. On the other hand, if the orphan is not beautiful and he does not want to marry her, he will prevent her from marrying another man, so that the orphan's property does not leave his hands. Likewise, a weak person has a share of an inheritance that is under someone's guardianship. According to the customs of the ignorant Arabs, only men who have grown up and are able to go to war are entitled to a share of the inheritance. As for immature children and people who are weak, both men and women have no rights even if the deceased is their biological father. The person entitled to the inheritance is the guardian. Even if a woman dies of her husband and her husband has an adult son, then the widowed woman is included in the inheritance that her husband's son gets. Therefore the widow can be interfered with or made a wife by her stepson. Allah warned the Muslims to stay away from the ignorant Arab custom, to always treat women, orphans and the weak in a fair manner. Give them their wealth and rights, such as the right to choose a mate as long as the one they choose is in accordance with religious provisions and can make them happy in this world and the hereafter, and get along with them well, both as a wife and as a member of society. Allah commands to do good to orphans. Every good that is done to them must be known by Allah, and will surely be rewarded with multiple rewards. On the other hand, Allah also knows every crime committed against orphans and Allah will reward them with a painful punishment. In addition to giving wealth and rights to orphans and weak people, Muslims should do good to orphans. Besides giving them their rights and property, also give them other gifts and take good care of them like raising their own children."
		   },
		   {
			"id": 621,
			"surah": 4,
			"ayat": 128,
			"tafsir": "This verse explains the attitude a wife should take when she sees her husband's nusyuz attitude, such as not carrying out his obligations towards himself properly, not providing a living, not having good intercourse, diminishing his love and affection and so on. This may be caused by both parties or caused by only one party. If this is the case, then the wife should hold deliberations with her husband, make an approach, make peace besides trying to restore her husband's love and affection which has begun to fade. In this case, it is not sinful if the wife gives in to her husband, such as being willing to reduce some of her rights and so on. The effort to make peace by the wife does not mean that the wife must be willing to give up some of her rights which are not fulfilled by her husband, but to show her husband the sincerity of his heart, so that the husband remembers to return to the obligations that have been determined by Allah. Allah says: ... And they (women) have equal rights with their obligations according to the proper way. But husbands have an advantage over them. ¦ (al-Baqarah\/2:228). Peace in family life is the goal of religion in ordaining marriage. Therefore, Muslims should keep away from all kinds of possibilities that can eliminate the atmosphere of peace in the family. The loss of a peaceful atmosphere in the family opens up the possibility of divorce which God hates. Miserly including human nature. Stinginess arises because humans are selfish, pay little attention to other people, even if the other person is his own wife or husband. Therefore beware of miserliness. Let each party, both husband and wife, be willing to reduce some of their rights to create a peaceful atmosphere in the family. If the husband does good by having intercourse with his wife well again, cultivating love and affection, carrying out his obligations towards his wife. So Allah knows it and gives a double reward."
		   },
		   {
			"id": 622,
			"surah": 4,
			"ayat": 129,
			"tafsir": "Aisha ra said: The Messenger of Allah divided the turns between his wives, he was fair, and prayed, 'O Allah, this is my turn according to my ability, so don't blame me for what You are good at, but I am not good at it. (Ahmad's history and the compilers of the Sunan Books). Based on the reason for the revelation of this verse, what is meant by being fair in this verse is to be fair in terms of allocating time for each of his wives, the Messenger of Allah has tried his best so that he can be fair between them. Then the shift of the day is determined, the provision of maintenance and equal treatment between his wives. Despite this, he felt that he could not distribute his time and affection fairly among his wives. He loved 'Aisha ra more than his other wives. But 'Aisyah did have advantages over the other wives of the Prophet, among others, was her intelligence, so that she was trusted by the Prophet to teach religious laws to women. This was done until the Prophet died and many friends, especially women, often asked 'Aisyah about the law or hadith. Even so, he felt guilty and asked forgiveness from Allah, the Most Forgiving. With the revelation of this verse, the Prophet's heart became peaceful, because he was not burdened with obligations that he was unable to carry out. From the explanation above, it is understood that humans cannot control their own hearts, only God can control them. Therefore, even though man has determined to treat his wives fairly, he cannot share his time and love equally between his wives. The justice that is required of a husband towards his wives is the justice he can do, such as being fair in determining the day and turn between his wives, being fair in giving a living, being fair in socializing and so on. Allah warns husbands, because they cannot share their love fairly among their wives, do not be too inclined towards one wife, so that the other wife lives in limbo, lives in misery, lives in a state between being bound in marriage and not being bound anymore. , etc. If husbands always try to reconcile and reassure their wives and maintain the rights of their wives, Allah forgives and forgives their sins which are caused by their being too inclined to one of their wives, Allah is Most Compassionate to His servants. This verse is a lesson for people who marry solely to give vent to their lusts and people who have more than one wife."
		   },
		   {
			"id": 623,
			"surah": 4,
			"ayat": 130,
			"tafsir": "If a husband and wife divorce because both of them or one of them cannot carry out God's laws, such as not being able to be fair to his wives even though he has tried, their life has become bland and there is no sense of love and affection anymore, their marriage has been seized by a serious illness. for those who have no cure, then Allah allows them to find a way out of these difficulties, in a good way and if they fail, they may also take final action, namely divorce. However, even though divorce is a lawful act, God still hates it. Divorce may open a new page in life for them, for example by getting a new partner who is more suitable and harmonious and is blessed with an abundance of God's grace. Truly Allah is Most Gracious and Most Wise."
		   },
		   {
			"id": 624,
			"surah": 4,
			"ayat": 131,
			"tafsir": "Whatever is in the heavens and on earth belongs to Allah. It is He who creates and He also takes care of it. In administering His creatures, Allah creates absolute laws, and all are subject to those laws. People who really understand God's laws that apply in general to the earth, the sky and all in them and also understand the laws that govern the lives of His creatures, will know how great the abundance of His grace and gifts to all His creatures. That is why every servant is commanded to fear Him, as has been ordered to previous peoples, who have been given the Bible like the Jews and Christians. As well as to those who carry out piety by submitting and obeying Him and carrying out His Shari'a. By submitting and obeying Him and by enforcing His Shari'a, humans will have a clean soul and can achieve prosperity in this world and happiness in the hereafter. If they deny Allah's infinite blessings, then their denial and disobedience will not in the least reduce Allah's power over everything in the heavens and on earth. On the other hand, if they are grateful, then their gratitude will not increase His power in the slightest. The command to be pious is solely for their own interests, not for the sake of Allah. Allah is Rich, does not require anything from His creatures and is Most Praised, does not require anyone's praise to add to His perfection. Allah says: ¦And there is nothing but glorify by praising Him, but you do not understand their tasbih ¦ (al-Isra'\/17:44)."
		   },
		   {
			"id": 625,
			"surah": 4,
			"ayat": 132,
			"tafsir": "Then in this verse it is emphasized that to Allah belongs whatever is in the heavens and whatever is in the earth. He has the power to rule absolutely and has the power to create or annihilate, the power to give life and death according to His will. Therefore, it is sufficient for Allah to be the caretaker and He is the one who manages and determines the affairs of His servants."
		   },
		   {
			"id": 626,
			"surah": 4,
			"ayat": 133,
			"tafsir": "If Allah wishes to eliminate all humans and the whole of this nature, after that creates other creatures and nature as a substitute to carry out His commands, then Allah has the power to carry out His will; for all that is in the heavens and on earth is subject to His dominion. If there are some people who deny Allah's favor and disobey His commands, then they are allowed to continue to live in this world until their death comes, this shows that Allah really does not need their obedience. If they are not rewarded directly, it is not because Allah does not have the power to destroy them, but solely because there is wisdom and benefit that is useful for pious humans. Allah says: (19) Do you not see that Allah has created the heavens and the earth with (true) rights? If He had willed, He would have destroyed you and brought in a new creature (to replace you), (20) and that would not be difficult for Allah. (Ibrahim\/14:19-20). ¦ And if you turn away (from the right path) He will replace (you) with another people, and they will not be (disobedient) like you (these). (Muhammad\/47:38). This verse contains a threat to the polytheists who always tortured the thoughts and feelings of the Prophet and opposed his calls, as well as to warn people to pay attention to the circumcision of Allah that controls their life and death."
		   },
		   {
			"id": 627,
			"surah": 4,
			"ayat": 134,
			"tafsir": "This verse gives a warning to people who have forgotten the true purpose of life, so that they realize that the goal of life alone is to seek worldly happiness is an incorrect goal and the results to be obtained are very low, because life in this world will not last forever. Such a person is a hypocrite who, when he meets a believer, pretends to confess faith, with the intention of gaining personal gain. The reward received from Allah is higher, because it includes the reward of this world and the reward of the Hereafter. Because of that, Muslims should strive to achieve both rewards in a balanced way, not only interested in worldly interests, which are temporary in nature. Trying to get the reward of this world and the reward of the hereafter, is actually a goal that is easy to do, not a goal that is beyond human ability; and this goal is reflected in the word of God which is the prayer of the believer. \"... O our Lord, give us good in this world and good in the hereafter, and protect us from the punishment of hell.\" (al-Baqarah\/2:201). Islam guides its adherents to achieve happiness in the world and the hereafter, both of which are an abundance of God's grace and grace that must be achieved. Allah is All-Hearing to the whispers of the hearts of His servants and All-Knowing of all their affairs. Therefore, Muslims should try to get closer to Allah, either by word of mouth or by deed. Thus they will have a clean soul and can limit themselves in every effort and struggle in order to achieve the pleasure of Allah and live happily in this world and the hereafter."
		   },
		   {
			"id": 628,
			"surah": 4,
			"ayat": 135,
			"tafsir": "Believers are commanded to be people who truly uphold justice in society. Therefore Allah commands them to act fairly in all matters, such as fairness in allocating time, upholding prayers regularly and on time. In giving testimony, Allah commands that witness be given as it is, not distorting reality. In weighing goods to be fair, weigh properly, do not add and do not reduce (al-Mutaffifin \/ 83: 1-4). All these orders if carried out properly, will undoubtedly make a habit that sinks into his soul. Justice must be carried out thoroughly in the midst of community relations, whether those who undergo it are ordinary people or heads of state, farmers or traders, members or heads of households. If you become a witness, be an honest witness, solely for the sake of hoping for Allah's pleasure, not distorting reality, not being one-sided, even if it concerns himself or his family. The testimony should be given in accordance with the facts whether it benefits himself or benefits others, because basically the testimony is one way of proving to find the truth. Therefore, testimony must be given honestly. If someone gives false testimony, with the intention of wanting to benefit himself or his family, then this kind of method is not considered a good thing, because giving false testimony with the intention of helping someone is not justified by Islamic law and is not a virtue, but in essence it is an act that thus including aiding crime and trampling on human rights. Allah calls for justice and witness to be carried out evenly without discrimination, whether those who are witnessed are their own families or other people, whether rich or poor. Let people know that it is Allah's pleasure and the guidance of His Shari'a that must take precedence: it is not permissible for rich people to be liked or defended because of their wealth or poor people to be pitied because of their poverty, because if wealth and poverty are the basis for consideration in giving testimony, then this consideration is not a consideration that can lead to the right decision. Right consideration is based on the truth and pleasure of Allah alone. Upholding justice and giving true testimony is very important, both for the people who become witnesses and for the people who are given testimony. That is why, upholding justice or giving true testimony is stipulated and included in the series of Allah's laws that must be carried out. After that, Allah forbade the Muslims to follow their desires, so that they do not deviate from the truth, because people who are used to following their desires, are easily influenced by the impulse of their desires to commit acts that are unfair and dishonest, so they slip from the truth. If they twist the facts in giving testimony, so that what is witnessed is not in accordance with reality, or they are reluctant to give testimony because of pressures that affect their souls, then they must remember that Allah knows what is in their hearts."
		   },
		   {
			"id": 629,
			"surah": 4,
			"ayat": 136,
			"tafsir": "This verse calls on Muslims to continue to believe in Allah, in His Messenger Muhammad saw, in the Al-Qur'an which was revealed to him, and in the books which were revealed to the previous messengers. Then this verse warns those who deny His call. Whoever denies Allah, His angels, His books, and the Hereafter, has strayed from the true path, the path that will save them from a painful punishment and lead them to eternal happiness. Belief in Allah's books and in His messengers is a series that cannot be separated. It is not permissible to believe in only some of the apostles and books, but deny other parts as the Jews and Christians do. This kind of faith is not seen as true, because it is influenced by lust or only follows opinions and leaders. If there are people who deny some of the books, or some of the apostles, then this shows that he has not absorbed the essence of faith, because of that his faith cannot be said to be true faith, even a misguidance that is far from the guidance of Allah's guidance."
		   },
		   {
			"id": 630,
			"surah": 4,
			"ayat": 137,
			"tafsir": "There is a group of people who have declared themselves as believers, then turned to be disbelievers. After that they believed again, then turned again to become disbelievers and finally they increased their disbelief until the moment of their death came. Such people will not be forgiven by Allah in the slightest, and will not be guided to obtain guidance. They are always in a state of indecision and doubt, their stance fluctuates from faith to infidel, from infidel to faith, they have lost their grip. Therefore they can no longer understand the essence of truth and the primacy of faith. That's why according to God's provision, people whose hearts are confused and doubtful will not be guided to the right path. So it is appropriate that they are far from God's grace, let alone to receive His forgiveness, because their souls have been covered with the stains of disbelief, so they can no longer see the light of truth. In fact, nothing can prevent Allah's forgiveness and guidance from being given to His creatures. It's just that Allah's will cannot be separated from human efforts that arise because of his knowledge and practice, which will leave an imprint on his soul. So if someone continues to follow an opinion without any investigation, surely his mind will not get a clue. Likewise, if a person's soul has been polluted with ungodliness and immorality, then he will not find a way to obtain forgiveness, without repenting. \"And indeed, I am Most Forgiving to those who repent, believe and do good, then remain in guidance.\" (Thaha\/20:82). God's forgiveness can erase the stains of sin in the soul. If a person repents and does good deeds, then all the filth of his soul and sins will be eroded away. Those good deeds wipe out the faults. That is a warning for those who always remember (Allah). (Hud\/11:114)."
		   },
		   {
			"id": 631,
			"surah": 4,
			"ayat": 138,
			"tafsir": "Hypocrites are highly reprehensible because their attitudes are always changing, and their words do not match their actions. When they gather with the believers, they show their faith and hide their disbelief. On the other hand, when they meet disbelievers, they show their disbelief and hide their faith. They will truly be subjected to painful torments."
		   },
		   {
			"id": 632,
			"surah": 4,
			"ayat": 139,
			"tafsir": "Then explained the characteristics of those who deserve to be blamed, namely the nature of the hypocrites, who actually conspired with the disbelievers. They are hostile to the believers, even in important moments, they help the disbelievers, because they believe that victory will be obtained by the disbelievers. Their attitude is criticized, because they hope to get strength from unbelievers, but they will not get that power, because power and protection are essentially in the hands of Allah. God who gives strength and protection, according to His will to those who truly believe and obey all His instructions. God's guidance is conveyed through the apostles and it is they who explain the path to be taken in order to obtain guidance. Then the strength and protection of Allah, will be owned by believers, if they stick to the Book of Allah and are always guided by His guidance. But the hypocrites do not see the supernatural power and protection, they are only deceived by the external power and protection which is not permanent. They will not get what they expect either. In this regard, Allah says: \"Whoever wants glory, then (know) that all glory belongs to Allah. ¦\" (Fajir\/35:10). \"¦Even though the power is only for Allah, for His Messenger and for the believers, but the hypocrites do not know.\" (al-Munafiqun\/63:8)."
		   },
		   {
			"id": 633,
			"surah": 4,
			"ayat": 140,
			"tafsir": "Believers are prohibited from gathering or being in an assembly with hypocrites who insult religion and its laws, because when the hypocrites hear the verses of Allah, they deny and make fun of them. \"When you (Muhammad) see people making fun of Our verses, then leave them until they move on to other talks. ¦\" (al-An'am\/6:68). Some Muslims sit around with polytheists talking about disbelief, denouncing Islam, and insulting the Qur'an, while those Muslims are unable to refute the talk of polytheists, because they are in a weak state. So Allah ordered the Muslims to turn away from the polytheists and forbade them to sit with them. Likewise the Jews act like the polytheists, namely discussing disbelief and denouncing Islam with the polytheists. Believers are prohibited from sitting with Jews and engaging in conversations that insult Allah's religion. They were told to stay away, and enter into other discussions that did not contain insults to religion. If the Muslims join with the hypocrites and do not want to leave them, then Allah considers them to be in collusion with the disbelievers. That is why Allah forbids Muslims from associating with Jews. If the prohibition that has been conveyed to them is still carried out, surely they will be considered the same as disbelievers. Whoever justifies an act that is wrong, and remains silent about it, then he can be equated with a person who commits a sin. Denying evil means preventing the spread of that action in the midst of society. After that Allah confirmed His threat to those who did not heed His prohibitions. He will torment them with the fires of hell together with the disbelievers."
		   },
		   {
			"id": 634,
			"surah": 4,
			"ayat": 141,
			"tafsir": "The hypocrites are always waiting for good opportunities in their favor. They are looking for opportunities when events happen to Muslims. Their hope is the destruction of the power of Islam and the victory of the disbelievers. It's just that they don't want to show a firm attitude because they are influenced by the doubts that surround their souls. That is why when the victory is won by the Muslims, they admit that they are helping the Muslims, so that they have the opportunity to enjoy that victory. On the other hand, if the victory is on the side of the disbelievers, they also say that they are trying hard to help them in facing the attacks of the Muslims, with the intention that they can get a share of the victory. It is clear that the actions of the hypocrites were solely for profit, but they did not want to take the risk. Thus they want to gain without making any effort, and want to save themselves without making any effort. So this verse emphasizes that Allah will determine on the Day of Judgment which of them truly believes and carries out Allah's commands sincerely, and who is a hypocrite and pretends to believe but in his heart is hidden nifaq disease. Allah will reward those who are entitled to receive it, and will also provide punishment to those who are entitled to receive it. As long as the Muslims stick to religion, carry out what they are ordered and stay away from what is forbidden, and try to prepare what is needed for the sake of religion, surely Allah will guarantee their victory, even though Allah will not give way to disbelievers to gain victory. over the believers. \"Indeed, We will help Our messengers and those who believe in the life of the world and on the day the witnesses appear (the Day of Resurrection),\" (al-Mu'min\/40:51)."
		   },
		   {
			"id": 635,
			"surah": 4,
			"ayat": 142,
			"tafsir": "Then Allah explains the attitude of the hypocrites who always help deception to hinder the development of Islam. They also deceived the Prophet by showing faith and hiding disbelief. The hypocrites have deceived Allah by deceiving His Messenger, because deceiving the Messenger is equated with deceiving Allah. Their act of deceiving Allah and His Messenger is an act of misguidance. Allah knows best what is in their hearts. Therefore Allah replied to their deceit as explained in His word: And they (the disbelievers) plotted, so Allah replied to their deception. And Allah is the best avenger of deceit. (ali 'Imran\/3:54). Their parable is like those who light a fire, after illuminating their surroundings, Allah removes their light and leaves them in darkness, unable to see. (al-Baqarah\/2:17). Their deception will not succeed and they will not benefit from the guidance that comes from Allah because of the hypocrisy that has blossomed in their bosoms. When they offer prayers, they are lazy because they have no desire to do so, they don't believe in any reward in the hereafter and they don't feel afraid of Allah's threats in the next day. This is because his heart is empty of true faith. They join in the prayers just to be called Muslim. Whereas if they are no longer in the environment of the Muslims, they will no longer do it. It is appropriate if they act like that because they are actually having fun, wanting them to be considered believers. They do not pray except at certain times, namely when they are in the presence of Muslims."
		   },
		   {
			"id": 636,
			"surah": 4,
			"ayat": 143,
			"tafsir": "The hypocrites are sometimes on the side of the believers and sometimes on the side of the disbelievers. Their attitude of taking sides is not done sincerely, because they only want worldly provisions and escape from the pressures that will be encountered from both parties. Whoever is led astray from Allah's guidance, then no one can help and no one can guide him to the right path that will save them from going astray."
		   },
		   {
			"id": 637,
			"surah": 4,
			"ayat": 144,
			"tafsir": "In this verse there is a prohibition, so that believers do not ask for help from infidels who are hostile to Muslims, either by asking for their opinion or being close friends with them, and may not trust them or divulge secrets to them. This similar prohibition is also contained in the word of Allah: \"Let the believers not make disbelievers as leaders, but believers. Whoever does so, surely he will not get anything from Allah, except for (the strategy) to keep himself from something you fear from them. And Allah warns you of (torture) from Him, ¦.\" (Ali 'Imran\/3:28). \"O you who believe! Do not make Jews and Christians as loyal friends (you); they protect one another from each other. ¦\" (al-Maidah\/5:51). The Muslims are warned to be careful in asking for help from infidels who are hostile to Islam either with intentions, ideas or actions, because the help received from those infidels might harm the Muslims themselves. Allah asks the believers, will they do things that cause them to deserve punishment, that is, if they use unbelievers as their helpers?"
		   },
		   {
			"id": 638,
			"surah": 4,
			"ayat": 145,
			"tafsir": "The hypocrites are warned, that they will be tormented in hell at the lowest level, because their actions are considered the most evil deeds, within them springs disbelief and hypocrisy. They deceive the Prophet and the believers. So the most appropriate punishment for them is hell which is at the lowest level. They will not get a helper who can save or relieve the torment they will receive."
		   },
		   {
			"id": 639,
			"surah": 4,
			"ayat": 146,
			"tafsir": "Hypocrites are still given the opportunity to repent as long as their death has not yet come, as long as they truly regret their actions on the basis of an awareness that comes out of their conscience, and correct their actions by doing good deeds and holding fast to Divine guidance. In other words, God's very harsh threat will not befall them, if they repent and regret their actions, then do the following actions: 1. They really try to do good deeds that can remove the stains of their hypocrisy by always being honest , both in word and in deed, trustworthy, fulfilling promises, sincere to Allah and His Messenger, and continuing to pray fervently and diligently, both in front of people and in private. 2. Adhere to the teachings of Allah, namely intending repentance and good deeds to please Allah and holding fast to the Al-Qur'an, having noble character and good behavior in accordance with the teachings of the Al-Qur'an, following all commands and avoiding all prohibitions of Allah. 3. Let yourself be sincere to Allah, that is, ask for help only from Him, whether in times of pleasure or in difficult circumstances. If they comply with these provisions, then Allah promises to include them in the ranks of the believers on the Day of Resurrection, because they have believed, and do good deeds like the believers, they will even be rewarded according to the reward received by those who - believers."
		   },
		   {
			"id": 640,
			"surah": 4,
			"ayat": 147,
			"tafsir": "Allah will not torture someone arbitrarily. Allah torments the hypocrites, only because of their own deeds. They have been given reason, five senses and feelings but they don't use them properly so they don't want to accept God's instructions, and their souls become dirty and the disease of hypocrisy blossoms within them. If Allah rewards them, after they repent it is because of the awareness and sincerity that comes from their own hearts, and have done good deeds based on true faith. Then Allah confirms that He is the Most Merciful to His servants who are grateful and All-Knowing of every deed he does, by giving unlimited rewards. Allah said: \"And (remember) when your Lord announced, \"Indeed, if you are grateful, I will surely increase (favors) to you, but if you deny (My favors), then surely My punishment will be very severe.\" (Ibrahim\/14 :7)."
		   },
		   {
			"id": 641,
			"surah": 4,
			"ayat": 148,
			"tafsir": "Allah does not like His servant who throws bad words at anyone. Bad words can lead to enmity and hatred among members of society and if they drag on can lead to denial of rights and bloodshed, and can also influence people who hear them to imitate those actions, especially if those actions are committed by leaders. Allah does not like something, meaning Allah does not like it and does not reward him. In this case the person who was abused is excluded. If someone is abused, he is allowed to complain about the person who abused him to the judge or to other people who can provide assistance in eliminating injustice. If someone is being abused and then he makes a complaint, of course the complaint mentions the vices of the person who is abusing him. So in this case there are two possibilities. First, the person who is being abused hurls bad remarks at someone who is abusing him. This can lead to enmity and hatred between the two parties. Second, if the person being persecuted just keeps quiet, then injustice will escalate and justice will disappear. Therefore, Allah allows in this verse for people who are being persecuted to make remarks and accusations about the badness of the actions taken by people who persecute even though it will result in hatred, because allowing persecution is worse, in accordance with the rule: \"Doing what is less harmful is between two misfortunes.\" The person who is being abused is obliged to convey his complaint to the judge or others. Someone who is unjust if no firm action is taken against him, his tyranny will expand. But if there is no intention to eradicate tyranny, one is strictly prohibited from uttering bad remarks. In this verse it is warned that Allah is All-Hearing and All-Knowing of every utterance uttered by people who are unjust and those who are being persecuted, especially if they transgress the limit to make false complaints or are inflammatory and pit against each other."
		   },
		   {
			"id": 642,
			"surah": 4,
			"ayat": 149,
			"tafsir": "In this verse it is explained that declaring a good deed by disclosing it is indeed good, if the person who commits the deed can keep himself from being cheerful and his heart is full of sincerity and faith, so that he becomes an example for others. While doing good in secret will further maintain the honor of the poor. Forgiveness that a person makes to those who have done wrong to him is an act that will receive reward and reward from Allah, because Allah is Forgiving, Almighty."
		   },
		   {
			"id": 643,
			"surah": 4,
			"ayat": 150,
			"tafsir": "Among humans there are those who believe in Allah and some of His messengers such as Jews and Christians. The Jews said, \"We believe only in Moses, not in Muhammad.\" And the Christians said, \"We believe in Musa and Jesus, but we don't believe in Muhammad.\" Such a belief means to mix up faith and disbelief, even though in fact faith and disbelief are two very contradictory things. If the Jews truly believe in the Prophet Musa, they must also believe in the Prophet Muhammad, so do the Christians, if they truly believe in the Prophet Isa, they will surely believe in the Prophet Muhammad, because the coming of the Prophet Muhammad is called -mentioned also in the Torah and the Bible, and the Prophet Muhammad also confirmed the original Torah and the Bible which became their belief. The reasons that show the truth of Muhammad's prophethood are perfect, because the Prophet Muhammad was an Ummi (not good at reading and writing), grew up in an ignorant society, to him the perfect Al-Qur'an was revealed, which explains everything that is true. The two groups who discriminated against the beliefs of some of the apostles were declared by Allah as infidels. Against them Allah provides a humiliating torment, a punishment that contains humiliation and suffering."
		   },
		   {
			"id": 644,
			"surah": 4,
			"ayat": 151,
			"tafsir": "Among humans there are those who believe in Allah and some of His messengers such as Jews and Christians. The Jews said, \"We believe only in Moses, not in Muhammad.\" And the Christians said, \"We believe in Musa and Jesus, but we don't believe in Muhammad.\" Such a belief means to mix up faith and disbelief, even though in fact faith and disbelief are two very contradictory things. If the Jews truly believe in the Prophet Musa, they must also believe in the Prophet Muhammad, so do the Christians, if they truly believe in the Prophet Isa, they will surely believe in the Prophet Muhammad, because the coming of the Prophet Muhammad is called -mentioned also in the Torah and the Bible, and the Prophet Muhammad also confirmed the original Torah and the Bible which became their belief. The reasons that show the truth of Muhammad's prophethood are perfect, because the Prophet Muhammad was an Ummi (not good at reading and writing), grew up in an ignorant society, to him the perfect Al-Qur'an was revealed, which explains everything that is true. The two groups who discriminated against the beliefs of some of the apostles were declared by Allah as infidels. Against them Allah provides a humiliating torment, a punishment that contains humiliation and suffering."
		   },
		   {
			"id": 645,
			"surah": 4,
			"ayat": 152,
			"tafsir": "This verse explains the matter of faith in Allah and His messengers without discriminating between the messengers, especially the last Prophet, Muhammad saw. Allah has sent several messengers long ago with the right instructions and closed the series of apostles with the arrival of Muhammad who brought the book of the Qur'an as the last religious rule that must be obeyed by all mankind. For those who believe in their apostleship, a great reward will be provided in accordance with their faith accompanied by good deeds. Allah is Most Forgiving of the mistakes of those who truly believe and is Most Merciful to all His servants by giving guidance to the straight path through the intercession of His messengers."
		   },
		   {
			"id": 646,
			"surah": 4,
			"ayat": 153,
			"tafsir": "It was narrated by Ibn Jarir and Ibn Juraij that the Jews said to the Prophet Muhammad, \"We will not justify your invitation, unless you can bring us a book from Allah to Fulan that you are the messenger of Allah, and so Fulan others stated that thou art the messenger of God,\" and so they went on naming certain people and Jewish priests. They did so nothing but solely to disobey the Prophet Muhammad. The Jews asked the Prophet Muhammad peace be upon him to send down a book from the sky which stated that Muhammad was the messenger of Allah. In dealing with this problem, Allah told the Prophet Muhammad to be patient, don't be surprised, because the Jews once asked Moses for something bigger than that. They asked Moses to show God to them clearly. Such a request shows stupidity, because they think that God has a body that can be seen clearly. Their character who likes to deny miracles and does not distinguish between the miracles of a prophet and the strangeness of a sorcerer who is only for show, is to show their desire and stupidity, and whatever the circumstances, their requests are not worthy of being served, because they still will not believe , as Allah says: And if We send down to you (Muhammad) writing on paper, so that they can hold it with their own hands, surely those who disbelieve will say, \"This is nothing but real magic.\" (al-An'am\/6:7). The Jews who wanted to see God were struck by lightning to death by his presumptuous request, then they were brought back to life. They should have been careful not to fall into a disastrous error, but they made an idol in the shape of a calf which they worshiped together. Even though clear evidence had come to them, such as the staff of the Prophet Musa that could split the sea, if the stick was struck against a rock, the rock would emit water as a source of drinking water. Many other miracles prove the oneness of Allah. Allah still forgives them when they sincerely repent. Then Allah gave power to Musa as to be able to seat them and return them to the right path."
		   },
		   {
			"id": 647,
			"surah": 4,
			"ayat": 154,
			"tafsir": "This verse reveals the ugliness of the actions of the Jewish people, that is, when they broke their agreement with God to obey the Torah, God raised Mount Sinai above them so that it looked like a black cloud that was about to fall on them. At first they were reluctant to accept the agreement wholeheartedly. Then Allah also ordered them to enter the Baitulmakdis gate, while bowing their heads and humbled themselves in gratitude for God's grace, and asking forgiveness for all their mistakes in the past. Then God also ordered them not to violate the regulations regarding the Sabbath day such as the prohibition of fishing and so on. They violated this prohibition, so on the Sabbath they went fishing together and did not want to enter Baitulmakdis. As a result of their bad deeds, God sent down torment on them as in the word of God: And indeed, you have known those who commit transgression among you on the Sabbath, so We said to them, \"Be you despised monkeys!\" (al-Baqarah\/2:65). They tricked into setting traps on Friday, and took them on Sunday. Allah has taken an agreement from them, namely that he will practice the contents of the Torah seriously and uphold Allah's laws and will not violate them in the slightest, and will not hide the news about the arrival of Prophet Isa and Prophet Muhammad SAW. If after that they still break their promise, Allah will send down on them even more severe punishment."
		   },
		   {
			"id": 648,
			"surah": 4,
			"ayat": 155,
			"tafsir": "This verse explains that the causes of Allah's curse and wrath fell on the Jews because they violated the agreement they had made, made lawful what was unlawful, and prohibited what was lawful. They deny the verses of Allah which explain the truth of the prophethood of the prophets and they have killed several prophets who have been sent to lead them, without a good reason like Prophet Zakaria and Prophet Yahya, also because of their words that say, we will not accept the truth because our hearts are closed Actually not only closed, but Allah has locked their hearts to death, because of their disbelief and their bad deeds. Finally they are not among the believers, except for a few people like Abdullah bin Salam and his friends."
		   },
		   {
			"id": 649,
			"surah": 4,
			"ayat": 156,
			"tafsir": "This verse explains that among the reasons the Jews received Allah's curse and wrath, because of their disbelief against the Prophet Isa and Prophet Muhammad, because of their accusations against Maryam, it is a big lie that Maryam committed adultery with a man named Yusuf an-Najjar, thus giving birth to Isa. son of Maryam. The accusation is completely untrue as Allah says: Indeed, the parable (creation) of Isa is to Allah, like (the creation of) Adam. He created him from dust, then He said to him, \"Be!\" Then be that something. (Ali 'Imran\/3:59). Thus Allah had the power to create Jesus from a mother without a father, Allah proved His power to create humans in four ways: 1. Created Adam without a father and mother. 2.Created Eve from the same element as Adam. 3. Creating Isa from a mother without a father. 4. Creating others through father and mother. It turns out that what the Jews said to Maryam that Maryam committed adultery was a very big lie. \"... The big lie that Maryam gave birth to an illegitimate child. The Bible refutes the accusation: \"... and according to people, he was Joseph, the son of Eli...\" (Luke 3. 23), because according to Matthew 1. 1 -25, that the birth of Jesus Christ when Mary was engaged to Joseph, it turned out that she was pregnant from the Holy Spirit, before they lived as husband and wife. Joseph was a sincere husband, and did not want to disgrace his wife's name, he intended to divorce her secretly. in his dream the angel of the Lord appeared to him, and said, do not be afraid \"... take Mary as your wife, because the child in her womb is the Holy Spirit. She will give birth to a son and you will name him Jesus...\" (Matthew 1.18-21)"
		   },
		   {
			"id": 650,
			"surah": 4,
			"ayat": 157,
			"tafsir": "This verse explains that one of the reasons why the Jews received Allah's curse and wrath was because of their words, that they had killed Al-Masih son of Mary, Allah's Apostle, even though they did not actually kill him nor crucify him, but the one who was crucified and who was killed was a person likened to Jesus Christ named Judas Iscariot, one of his 12 disciples."
		   },
		   {
			"id": 651,
			"surah": 4,
			"ayat": 158,
			"tafsir": "In this verse, Allah explains that Jesus was appointed by Allah's command with his body and spirit and will be sent down again at the end of time as a defender of the Islamic community and successor to the Shari'a of the Prophet Muhammad at a time when Muslims were in a weak state after the arrival of the Dajjal. This incident shows the power of Allah to save His Prophet, according to His wisdom contained in the word of Allah: (Remember), when Allah said, \"O Isa! I took you and raised you to Me, and purify you from those who disbelieve , and make those who follow you above those who disbelieve” (Ali 'Imran\/3:55). Regarding the lifting of Prophet Isa to the sky, there are differences of opinion. According to the majority of interpreters, he was raised physically and spiritually, alive as a miracle. So Isa as who was lifted up to the sky physically and spiritually, from the time he was lifted up until he descended back to earth, was completely in the hands of Allah. If an ordinary human being, like Ashhabul Kahfi, could live in a cave without eating or drinking for 309 years, then it shouldn't be considered strange for a prophet like Prophet Isa to stay in the sky for so long, because he was given a miracle by God. Another opinion says that Prophet Isa was raised to the sky after he died earlier."
		   },
		   {
			"id": 652,
			"surah": 4,
			"ayat": 159,
			"tafsir": "No one from the People of the Book, both Jews and Christians, but will believe in Prophet Isa with true faith before they die, that is when they face the agony of death. The Jews will believe that the Prophet Isa is the messenger of Allah and the spirit that is blown to Maryam and as a creature created by Allah. Christians will also believe that Prophet Isa is a servant of Allah and His sentence, not Allah and not the son of Allah. Their faith like that is no longer useful, because it is revealed after their spirit reaches their throats, after they see signs in the afterlife. It is written in the word of God: ¦On the day when some of the signs from your Lord will no longer be useful for the faith of someone who has not believed before then¦ (al-An'Am\/6:158). There are also some scholars who interpret this verse in this way: no one from the People of the Book, but will believe in Prophet Isa with true faith before Prophet Isa died. He will be sent down again to the world from the sky at the end of time to improve the fate of Muslims after being damaged by the Dajjal. Based on several authentic hadiths narrated by al-Bukhari and Muslim and others: Prophet Isa will descend to the world, later at the end of time. He will break the cross symbol of Christianity, will destroy pigs and all abominations. After that the world will experience fertility, security and prosperity that is just and equitable. At that time the People of the Book from Jews and Christians would all believe in Prophet Isa before he died, and after his death he was buried beside the tomb of Prophet Muhammad in Medina. His descent into this world was to uphold the Shari'a of Muhammad so that the Prophet Muhammad would remain a witness to the faith or disbelief of the People of the Book, as explained in the word of Allah: And what (the condition of the disbelievers will be), if We bring a witness (Rasul) from every nation and We have brought you (Muhammad) as a witness against them. (an-Nisa\/4:41)"
		   },
		   {
			"id": 653,
			"surah": 4,
			"ayat": 160,
			"tafsir": "If the Jews commit serious sins or transgressions such as worshiping a calf statue, then they repent, then even though their repentance is accepted, but as a result of that transgression, Allah forbids them some good food that was previously lawful for them. They do not admit that these good foods are haraam as a result of their sins, they even say that these foods have been haraam before, namely since the Prophet Noah, Prophet Abraham and the prophets who came later; Allah refutes their claim with His word: All food is lawful for the Children of Israel, except for food that Israel (Jacob) has made unlawful for him before the Torah was revealed... (Ali 'Imran\/3:93). And to the Jews, We have forbidden all (animals) with hoofs¦ (al-An'am\/6:146) Forbidden good food to the Children of Israel (Imamat vii.23; xi 4-6) because they prevent people from from the way of Allah, and because they advocate evil and evil and forbid doing good and hide the qualities of the Prophet Muhammad that are contained in their books."
		   },
		   {
			"id": 654,
			"surah": 4,
			"ayat": 161,
			"tafsir": "The prohibition of some good food for the Jews is also due to their actions of eating usury money which Allah has clearly forbidden and also due to their wrongful actions such as obtaining wealth through bribes, fraud, plundering and so on. Against these evil deeds, Allah provides a painful punishment in the hereafter."
		   },
		   {
			"id": 655,
			"surah": 4,
			"ayat": 162,
			"tafsir": "Not all People of the Book do these evils. There are also people among them who are deep in their knowledge, and people who really believe in the Al-Qur'an which was revealed to the Prophet Muhammad, and which was revealed to the previous messengers. Among them there are also those who faithfully follow the teachings of Islam sincerely. It was narrated from Abdullah bin Abbas that this verse was revealed in relation to Jews who with full awareness converted to Islam such as Abdullah bin Salam and his friends. They diligently pray five times a day and pay zakat, believe in Allah and His messengers without distinguishing between one messenger and another. They have reached a high level of faith and Islam and Allah has promised them a great reward in the hereafter."
		   },
		   {
			"id": 656,
			"surah": 4,
			"ayat": 163,
			"tafsir": "Verily, Allah has given revelations to Muhammad like giving revelations to Noah and the prophets who were sent later. Revelation given to the prophets is different from the understanding of revelation that has ever been given to other creatures, because revelation has four meanings: 1. Signal, as in the Word of Allah: So he came out of the mihrab to his people, then he made a sign to them; glorify yourselves in the morning and in the evening. (Maryam\/19:11). 2. Inspiration, as in the word of Allah: And We inspired the mother of Musa, \"Breastfeed him (Musa), (al-Qashash\/28:7). 3. Instinct (instinct) as in the word of Allah: And your Lord inspired the bees, \"Build nests in the mountains, in the woods, and in places made by humans. (an-Nahl\/16:68). 4. Soft whispers, as in the word of Allah: And thus for every prophet We made enemies consisting of devils, humans and jinns, some of them whispered to others beautiful words as a deception. (al-An'am\/6:112). The revelation referred to in this verse is revelation in the sense that is known in religious terms, namely subtle whispers and understanding of marifat that a prophet finds in his heart with full confidence that this understanding comes from God, either directly or through intercession. Allah has revealed this Qur'an to Muhammad as Allah has revealed it to Noah and the prophets who came after. Allah never sent down a book from the sky that was openly witnessed by the senses as requested by the Jews to Muhammad, because the revelation was a kind of notification that came quickly and was hidden. Among the prophets who received the first revelation for their people was Noah, because he was the oldest prophet after Adam, and because he was seen as the second Adam, who sent down mankind after the great flood (typhoon). Allah also revealed to Ibrahim who was given the nickname Abul-Anbiya (father of the prophets from the side of monotheism) and Ismail as the ancestor of the Arabs and Isaac and Jacob as the ancestors of the Children of Israel (Jews). What is meant by Asbath is the son of the Prophet Jacob, numbering 12 people. The use of the word Asbath among the Children of Israel is the same as the use of the word \"tribe\" among the Arabs descended from Ishmael. Allah has also revealed it to Isa, Ayyub, Yunus, Harun and Solomon and has given the Psalms to David. According to Imam Qurtubi, the Zabur contains 150 surahhs which do not contain laws, only contain advice, wisdom, praise and praise to Allah."
		   },
		   {
			"id": 657,
			"surah": 4,
			"ayat": 164,
			"tafsir": "There are a number of apostles that Allah has previously narrated to Muhammad saw, and there are also several apostles that have been deliberately not narrated to him, because their people are not well known. Several messengers have been narrated in the Qur'an as Allah says: (84) And We have bestowed upon him Isaac and Jacob. To each of them We have given instructions; and before that We have guided Noah, and to some of his descendants (Ibrahim), namely Dawud, Solomon, Ayyub, Yusuf, Musa, and Aaron. And thus We reward those who do good, (85) and Zakaria, Yahya, Isa and Ilyas. All of them including the righteous, (86) And Ishmael, Alyasa, Yunus and Lut. Each of us exalted (his degree) above other people (at his time), (al-An'am \/ 6: 84, 85 and 86). Most of the stories of the prophets are found in surahh Hud\/11 and surahh asy-Syu'ara\/26. The Arabs did not know the prophets who were not narrated and they were not well known to the People of the Book who lived side by side with them. The wisdom of narrating these prophets is to take inspiration and lessons, to increase courage when facing challenges and enmity and to strengthen the prophethood of Muhammad, as Allah says: And all the stories of the apostles, We tell you (Muhammad), so that with that story We strengthen your heart; and in it you have been given (all) truth, advice and warning for those who believe. (Hud\/11: 120). The Jews thought that those who were given revelation and the rank of prophecy were only from their group, even though several verses indicate that Allah has sent several messengers for each people as the realization of Allah's mercy which is widespread throughout the world. Allah's Word: And indeed, We have sent a messenger for every nation (to call), \"Worship Allah, and stay away from Tagut\" ¦ (an-Nahl\/16: 36). ¦And there was not a single people but there had come a warner. (Fathir\/35: 24). Allah had spoken directly to Moses even though Allah did not reveal His form to the Prophet Musa when lowering the revelation to him as explained by Allah in His word: And it is not proper for a human being that Allah will speak to him except by means of revelation or from behind a veil or by sent messengers (angels) then revealed to him with His permission what He wills. ¦ (asy-Shura\/42: 51). God's talk to Moses was included behind the curtain, because he only heard the Divine words and could not see Him."
		   },
		   {
			"id": 658,
			"surah": 4,
			"ayat": 165,
			"tafsir": "And Allah has sent messengers, some of which have been narrated and some not, so that they may convey good tidings to those who believe and do good deeds, that they will receive a great reward in the hereafter and warn those who disbelieve and disobey, that they will be punished in the fire of hell. If Allah had not sent messengers to mankind, surely the disbelievers on the Day of Resurrection would have provided excuses or excuses so that they would not be blamed or prosecuted because an apostle had never come to warn them. This is explained in the word of Allah: And if We had destroyed them with a torment before (the Qur'an was revealed), they would have said, \"O our Lord, why did You not send a messenger to us, so that we follow the verses You before us became despicable and lowly?\" (thaha\/20:134). So it is very clear that the wisdom behind sending the messengers is to nullify the arguments or excuses of the disbelievers on the Day of Judgment. Say (Muhammad), \"A strong reason is only in Allah. So if He had willed, you would all have been guided.\" (al-An'am\/6:149). Allah Almighty, invincible in all matters that He wills, more Wise in all his deeds. According to His wisdom there is no need to serve the request of the Jewish Gentiles to bring down a book from the sky, because there has been an experience with Moses. They once asked Moses for strange things, and after their request was fulfilled, they increasingly showed their denial and greed."
		   },
		   {
			"id": 659,
			"surah": 4,
			"ayat": 166,
			"tafsir": "Even though the Jews denied Muhammad's prophethood and did not want to be a witness to his truth, Allah was the witness to the truth of the Qur'an which was revealed to Muhammad. Allah strengthens His testimony again by stating that Allah has sent down the Qur'an with His knowledge, which the Prophet Muhammad and the believers had never known, with a beautiful series and arrangement of words, not prose, not poetry, contains dense knowledge and wisdom, impossible to imitate by anyone, capable of facing the challenges of the times, anytime and anywhere, containing aspects of knowledge needed by society, in accordance with the word of Allah: ...There is nothing We omitted in the Book¦. (al-An'am\/6:38). This means that in the Al-Qur'an there are basic religious teachings, norms, wisdom and guidance for human happiness in this world and in the hereafter and the happiness of creatures in general. The Qur'an contains unseen messages about the past, present and future. Whoever diligently studies the Qur'an will be sure of its truth and will also be able to become a witness. Even the angels, especially Jibril, who was the intermediary in the revelation of the Qur'an, also witnessed its truth. Actually enough with the testimony of God, because there is nothing more true and reliable than the testimony of God."
		   },
		   {
			"id": 660,
			"surah": 4,
			"ayat": 167,
			"tafsir": "Indeed, those who are still in disbelief after the guidance brought by the Prophet Muhammad came and always prevent people from believing in him and in the Qur'an that was revealed to him as was always practiced by the Jews of Medina and the infidels of Mecca, it has been declared by Allah that they are astray from the right path and it is difficult for them to return to the truth. It is true what Allah explained about the Jews, because they should have believed in the call of the Prophet Muhammad, moreover they had known him in their own book, but they still denied and always made lies and false accusations against him and against him. The Qur'an that he brought so that people do not believe. Among the accusations they put forward was \"If it is true that Muhammad was an apostle why wasn't a complete book revealed to him at the same time as the book of the Torah which was revealed to Moses?\" They lied and said, \"God has mentioned in the Torah that the Shari'a of the Prophet Musa will not be replaced and will not be erased until the Day of Judgment.\" They put forward a thousand and one reasons to reject the truth of Muhammad's prophethood and the Qur'an, but all of these reasons are just fabricated and cannot be proven true. Therefore it is very appropriate if they are labeled by Allah as people who are very far from the straight path."
		   },
		   {
			"id": 661,
			"surah": 4,
			"ayat": 168,
			"tafsir": "In addition to being branded as infidels, they are also branded as wrongdoers. That's how it is with the disbelievers. They are unjust to themselves, unjust to the truth and unjust to others. Unjust to themselves because they still do not want to accept the truth, even though the evidence has clearly shown their error. And because they indulge their lust and desire to maintain their position and control their wealth, in the end they are the ones who lose. Unjust to the truth because they always try to cover it up and hide it so that it doesn't spread among people, and so that they alone are true and revered. Unjust to other people (society) because with their actions, people who should be able to enjoy the truth remain in error and are prevented from feeling the pleasure, they try to prevent people who want to broadcast it to people who want to understand and adhere to a religion that brings the truth. People who are of such a nature and are such a great danger to society, naturally deserve the wrath of Allah, and it is also natural that Allah will not forgive them and will not show them, except for the way to Hell Hell where they will remain in it forever. Such is God's justice and it is very easy for Him to carry out that justice."
		   },
		   {
			"id": 662,
			"surah": 4,
			"ayat": 169,
			"tafsir": "In addition to being branded as infidels, they are also branded as wrongdoers. That's how it is with the disbelievers. They are unjust to themselves, unjust to the truth and unjust to others. Unjust to themselves because they still do not want to accept the truth, even though the evidence has clearly shown their error. And because they indulge their lust and desire to maintain their position and control their wealth, in the end they are the ones who lose. Unjust to the truth because they always try to cover it up and hide it so that it doesn't spread among people, and so that they alone are true and revered. Unjust to other people (society) because with their actions, people who should be able to enjoy the truth remain in error and are prevented from feeling the pleasure, they try to prevent people who want to broadcast it to people who want to understand and adhere to a religion that brings the truth. People who are of such a nature and are such a great danger to society, naturally deserve the wrath of Allah, and it is also natural that Allah will not forgive them and will not show them, except for the way to Hell Hell where they will remain in it forever. Such is God's justice and it is very easy for Him to carry out that justice."
		   },
		   {
			"id": 663,
			"surah": 4,
			"ayat": 170,
			"tafsir": "In this verse Allah reveals His words to mankind in general after explaining in the past verses the truth of the da'wah brought by the Prophet Muhammad, and the wrongness of the Ahl al-Kitab establishment. After rejecting all the arguments and excuses of those who vilify the Prophet and the Qur'an he brought, the time has come to justify what was brought by His Prophet Muhammad, whose apostleship was not only strengthened by miracles, but also confirmed by the People of the Book, for it is in their own books that there will come an Apostle who will confirm the previous Apostles. Allah commands that people believe in Him because that is what is good for them. It is the teachings he brings that will bring people to safety and happiness in this world and the hereafter as stated in His words: And We did not send you (Muhammad) but to (become) a mercy to the whole world. (al-Anbiya\/21:107). Whoever obeys this order and becomes a true believer, surely he will be pleased by Allah and will be blessed with His mercy and surely he will be a lucky person in this world and in the hereafter. In the world he will live happily because his chest cavity has been filled with faith, piety and trust in Allah; he will be able to taste how sweet faith is. In the afterlife he will be put into Jannatun Na'im heaven, he will remain there forever. But if they do not obey this call and remain in disbelief, then they themselves will suffer losses, unable to feel peace and happiness, always swayed in storms of error and doubt, because they have no grip in wading through the ocean of life where they do not know where the end and the beginning. For Allah Himself, one's disbelief does not harm Him and does not reduce His majesty and glory, because He is the owner of the heavens and the earth, He is the Almighty to torment those who disbelieve, to give mercy and favors to His servants. He is All-Knowing of all the actions of His servants and all that is in their hearts. He is Wise in all His actions, Most Just in all His vengeance. It is only up to His servant, whether he will choose faith which leads to eternal happiness or will choose disbelief which will lead to eternal suffering and torment as well."
		   },
		   {
			"id": 664,
			"surah": 4,
			"ayat": 171,
			"tafsir": "The Christians have exceeded the limit in religion by adding things that are not from religion, such as worshiping and glorifying their prophet, to the point of exceeding the limits set by Allah by inventing lies against Him and by saying that Isa it is the son of God. (al-Ma'idah\/5: 77) This is also what brings Christians to the notion that God is one of the three Gods or God consists of three persons. As a rejection of this erroneous understanding, Allah stated that Isa, the son of Maryam, was only Allah's messenger to His servants, not the God who is worshiped as what Christians consider. Isa himself called on them to unite Allah, no one is worshiped but Allah, and Prophet Isa had also forbidden his people to associate anything with Allah. In addition to this affirmation, Allah says again that Jesus was created with a sentence in the form of the words \"be\" (kun), without any man (father) marrying his mother, and without semen entering his mother's womb, as the creation of ordinary people. When Allah sent the angel Jibril to Maryam and informed her that he was a messenger of Allah who was ordered to deliver the good news to her, namely that she would have a son, Maryam was surprised and strongly objected, because she was still a virgin and had never been married or touched. by a man. Then Jibril read to him the words of Allah: ¦\"Thus Allah creates what He wills. When He wants to determine something, He only says to him, \"Be!\" \"kun\" was created by Jesus in his mother's womb. This is an evidence of Allah's power. If He wants to create something, it is enough to say \"kun\". Allah is like (the creation of) Adam. He created him from the ground, then Allah said to him: \"Be\" (a human being) and he was (Ali 'Imran\/3:59). Then the spirit of Allah's creation was blown into his mother's womb and he grew until the time for giving birth came. As the Christians suspected that what was blown into his mother's womb was part of God's spirit and on this basis they assumed that Jesus was the son of God, because he is a part of His spirit, (Matthew 1.18). The excessive attitude of the People of the Book in understanding their religion is not only among Christians, but also of course among Jews. Their attitude that goes beyond the boundaries in understanding the provisions of their religion so that they often behave and act so strictly by adding their own provisions, or conversely often violating the provisions of the Torah in the law of Moses, as we can read here and there in the Qur'an, to the point that until they said \"Uzair son of Allah\" (at-Taubah\/9: 30). They became a nation that was racist, exclusive, very fanatical, rejected all the prophets and messengers of Allah who were not Jewish (Gentile), they killed the prophets and accused Jesus and his mother Maryam of heinous accusations. They split into several sects. What stood out at that time were the conservative Sadducee group who only recognized the five books of Moses (Pentateuch), or the Pharisee group who were very strict in carrying out written law, but were willing to accept Jewish oral law and customary law. Likewise the attitude of Christians who have crossed the line by elevating and placing the Prophet Isa as Jesus who is equated with God or attributing him as the son of God. They have touched the main faith (aqeedah) to give birth to the doctrine of the Trinity. This doctrine has developed and became the basis for the debate of their priests in the past, from the 2nd century to the 6th century AD, such as Marcionism, Jacobites and Nestori (Nestorian) who still survive in Syria or Maronites who are widely adhered to in Lebanon, Paulicianism. and others. They debated about the nature of Christ: God, son of God or one of the three persons of the Holy Spirit, even involving his mother Mary as a cult. Muslims really need to realize that even in another form, do not fall into an excessive attitude in accepting Islamic teachings, which generally revolve around matters of fiqh, on the one hand they want to be too strict or on the other hand, on the contrary, they want to be too loose. Some of the commentators told about this assumption that a Christian physician who treated Caliph Harun ar-Rashid had a discussion with an Islamic scholar, namely Ali bin Husein al-Waqidi al-Marwazi. The Christian physician told al-Waqidi that in the Book (Al-Qur'an) there are verses which justify the Christian opinion and belief that Jesus, is part of God, then he recited the first part of this verse 171. In response to the physician's words, al-Waqidi recited the verse: And He has subjected everything in the heavens and what is on the earth to you, all (as mercy) from Him. (al-Jasiyah\/45:13). Then al-Waqidi said \"If it is true what you said that the word \"min-hu\" in the verse you are reading means \"a part of Him\", so you say that Isa as is a part of Allah as well. This means that what whatever is in the heavens and on this earth is part of Allah.\" With this answer the Christian physician was silent and then he converted to Islam. It is Him who always calls on the belief in monotheism and let them not say that there are three Gods namely the Father, the Son and the Holy Spirit (Rohulkudus), or say that Allah consists of three persons, each of whom is the perfect God, and the collection of these three persons The One God. They were ordered to leave the misguided and misleading teachings, because leaving the misguided teachings is what is good for them. They will become adherents of the monotheistic religion brought by Prophet Abraham and the prophets before and after him. They will be righteous people and will not be among the disbelievers. In another verse, Allah says: Indeed, those who say, \"That Allah is one of the three, but there is no god (who has the right to be worshiped) other than God Almighty. (al-Maidah\/5:73). If they do not stop from what they say, surely those who disbelieve among them will be afflicted with a painful punishment. Then it is emphasized again to them that Allah alone is God Almighty, God is clean from the nature of being multiplied or divided into several parts or composed of three persons or united with other creatures. Glory be to Allah from these things and it is impossible for Him to have children as they think or Jesus is God as said by other groups among them. Allah is Almighty and there is no one resembles Him and does not have a wife like humans. He is the owner of the heavens and the earth and all that is in them including Isa as. Allah said: \"There is no one in the sky and on earth, but will come to (Allah) the Most Merciful as a servant\" (Maryam \/ 19:93). All creatures without exception will face the presence of the Lord Allah as a servant, regardless of rank and degree, whether he is an angel, a prophet, someone he created without a father and mother like the Prophet Adam or he created without a father just like Jesus as or someone else. created by intermediary father and mother; all of them are His servants who hope for His grace and mercy, it is Allah who has full authority over them and Allah who cares for them and in Him they must worship, pray and put their trust. This belief in monotheism was brought and conveyed by the prophets and apostles to their people, including Prophet Isa, and this understanding was adhered to by his followers in accordance with his da'wah and teachings. However, the followers who came later, especially the followers who had previously embraced various religions, could not rid themselves of this misguided old understanding, so they tried and tried with all their might so that the Christian religion they professed had the same style as their religion. -the religion of their ancestors. The notion of the Trinity (considering that God is three) has flourished in Egypt, since approximately 4,000 years before Christ. Among them there are those who think that the god is the god Osiris, Isis and Horus. Likewise in India, the teachings of Hinduism say that God is a triune consisting of Brahma, Vishnu and Shiva. Some adherents of Buddhism also say that Buddha is a God consisting of three persons. Also in Persia, there is Mazdaism (Zoroastrianism) which has a dualism pattern: good and evil, light and dark with the supreme god Ahura Mazda (Ormuzd) and other gods, opposing Ahriman. In the end, they were swept away by the teachings of the trinity, which had various patterns and they became lost from the monotheism brought by Prophet Isa and it was very difficult for them to leave it. These intellectuals from adherents of the Christian religion do feel and know that this taslis (trinity) understanding is unacceptable to reason, but they are still looking for reasons to justify this understanding. Among their priests there are those who say, \"In this case we have to leave this matter to unseen things that are not yet known by humans and cannot be known, unless the hijab has said for that and it is clear at that time everything in heavens and on earth.\" Rev. Bother, the author of the book al-Usul wal-Furu' and one of the spokesmen for Christianity, said about this: \"We have tried to understand it more clearly, that is, when the secret veil has been opened for us of all that is in the heavens and on earth.\" It can be concluded that the Christian religion is really based on pure monotheism, but the priests mixed it up and turned it into a trinity religion which cannot be understood by reason, because it was influenced by the taslis ideas of the Greeks and Romans which they took from Egyptian religious teachings. lama and Brahma."
		   },
		   {
			"id": 665,
			"surah": 4,
			"ayat": 172,
			"tafsir": "Then as a rejection of the notion that Jesus was God, Allah explained that Jesus was Himself, and so the angels did not feel reluctant to be called a servant of Allah and never boasted, thus saying I am God, because Jesus and the angels -- the angel realizes and knows with full confidence that Allah is the Greatest, Almighty and Most Rich. He is the one who deserves to be worshipped, deserves to be glorified and deserves to be asked for His mercy and grace. Whereas angels who are high in rank and very close to God and among them are those sent by Allah to blow the spirit of His creation into the body of Maryam, the mother of Isa as, Isa as, whom He glorified and appointed as an apostle, of course it is impossible for this to happen. said I am God who must be worshiped, adored, and glorified. People who are reluctant to worship Allah and boast about themselves, including people who do not acknowledge the existence of God, are ungodly people, people who do not know themselves and do not use their minds. Allah will gather them in the desert of Mahsyar together with the believers and all other creatures of Allah and they will receive painful punishments because of their misguidance and iniquity."
		   },
		   {
			"id": 666,
			"surah": 4,
			"ayat": 173,
			"tafsir": "As for those who believe and do good deeds, they will receive the reward for their deeds multiplied and will be admitted to heaven, always overflowing with Divine mercy and grace. But those who are reluctant to be called servants of Allah and who are always arrogant and those who deny the existence of Allah, they will receive a very painful punishment according to their sins and denial. They will be put into hell, no one will defend them, and no one will help them get out of hell, because all matters at that time are in the hands of Allah as stated in His word:"
		   },
		   {
			"id": 667,
			"surah": 4,
			"ayat": 174,
			"tafsir": "This verse calls on all people in the world and states that various clear statements have come to them from God, supported by real and correct arguments and reasons, brought by a prophet and His messenger, who is \"ummi\" who are not good at reading. The state of illiteracy alone is strong evidence for his prophethood and apostleship for the truth of the religion he carries which has rules and laws to regulate human life in the world and provides guidance in the form of worship and good deeds to achieve happiness in the hereafter. who never attended school let alone read books, and never in childhood and in his youth followed in the footsteps and customs of the children and youths of his time, never attended evenings of fun, their usual long evenings telling stories and chatting about customs, ancestral history, and important events among them, such as wars, hostilities and so on, can tell something valuable and of high value? How can an Ummi in such a situation be able to bring a book (Al-Qur'an) in which there are noble and very high value Shari'a, delivered in a style of language of very high quality which throughout the ages cannot be imitated and matched (al- Baqarah\/2:23, Yunus\/10:38, Hud\/11:13 and al-Isra\/17:88) by poets no matter how big. This is a sign and proof of the truth of the religion he carries, no one can even argue that the Qur'an is an eternal miracle that can always strengthen and justify the religion it carries. So Allah named the Qur'an a bright light that guides people, brings them out of the darkness of polytheism to the light of faith (al-Baqarah\/2:257) and upholds the foundations of monotheism which had been the task of the apostles before Muhammad saw. The apostles had previously called their people seriously to the religion of monotheism and had many of their followers. But it turns out that after they died, the followers had damaged the foundations of monotheism by mixing it with various forms of polytheism such as worshiping idols, worshiping the stars and the sun and even worshiping spirits by worshiping them and praying to them. Finally, humans fall into the valley of shirk and are carried away by various kinds of misguided and misleading notions so that they lose their way of thinking and no longer know what is good and what is bad, what is right and what is wrong. It was in this pitch-darkness like this that the Qur'an was revealed as a light that enlightens them so that people can think again and realize that the path they have taken so far is the wrong path that leads to destruction and collapse. In another verse Allah says: \"It is He who sent down clear verses (the Qur'an) to His servant to bring you out of darkness to light. And indeed Allah is Most Forgiving, Most Merciful\" (al-hadid\/57:9 ). Thus it is clear that the Prophet Muhammad, who is the messenger of the perfect law for the happiness of the world and the hereafter, could not possibly not be a prophet and messenger of Allah. And it is also clear that the Qur'an that was revealed to him was not his creation, but was truly a revelation from the Lord of the worlds."
		   },
		   {
			"id": 668,
			"surah": 4,
			"ayat": 175,
			"tafsir": "This verse gives firmness to mankind after declaring that Muhammad is Allah's messenger and the Qur'an is the light and guidance that He sent down. Anyone who believes in Allah and holds fast to the teachings of the Qur'an, will be entered into His grace, namely heaven and will always be under the protection of His grace, a grace and gift that humans cannot imagine how great and glorious it is. . Ibn Abbas said that what is meant by His grace here is heaven and what is meant by His grace is a gift that will be enjoyed by its inhabitants that eyes have never seen and ears have never heard of and can't imagine in the mind how happy and pleased the person who is. can enjoy it. Apart from that, Allah will give him guidance and guidance and His taufik so that he is always on the straight path, the right path that will convey to His great and straight mercy."
		   },
		   {
			"id": 669,
			"surah": 4,
			"ayat": 176,
			"tafsir": "At the end of verse 12 of this surahh, there is also a law of inheritance of the kalalah, so al-Khattabi says about these two verses of the kalalah: Allah has sent down two verses of the kalalah at the beginning of surahh an-Nisa' but these verses are still general in nature and not clear, when viewed from the Just read that verse, then Allah sent down another verse of Kalalah in the summer, which is the last verse of surahh an-Nisa'. In this verse there is additional information regarding what has not been explained in the first verse, therefore when Umar bin al-Khattab was asked about the first verse of the verse that was revealed, he ordered the questioner to pay attention to the second verse of the verse. Allah ordered the Prophet Muhammad to answer questions that people asked him about the heirloom of the kalalah, such as Jabir bin Abdullah who no longer has fathers and children, while he has sisters who are not half-sisters. Because a sister who is not a mother has not yet been assigned a certain share in the inheritance, while a mother's brother is assigned a share, namely one sixth if there is only one sister, one third if there are more than one. The one-third inheritance is divided equally between the sisters by the mother, no matter how many they are, because the inheritance is an inheritance that belongs to their mother if her mother is still alive. The answer that Allah commanded His Prophet regarding this matter is that if a person dies, while he has no children but has a mother's sister or only a father, then that sister gets half of the property she left behind, if there is only one brother. If his sister dies first, and he does not have a father who veils (obstructs him) he has the right to inherit the property he left behind. He has the right to inherit all of his sister's inheritance if there is no person entitled to the inheritance whose share has been determined (ashabul furudh). But if there is a person who has the right whose share has been determined like a husband, then the husband's rights are given first and the rest becomes his full rights. If there are two sisters, then the two brothers get two-thirds. And if there are more than two female siblings, then the two-thirds is divided equally (equally) between the siblings. If what he left behind consisted of brothers (one mother and father) consisting of brothers and sisters, then the inheritance left behind is divided between them with the condition that the male portion is twice that of the female, except if it is the mother's brothers who are left behind, then the mother's brothers and sisters get only one-sixth, because that right is originally the right of their mother. If not for that, surely they have no rights at all because they are not the heirs who have the right to inherit all the inheritance. This is what Allah has stipulated regarding the heirloom of the kalalah, so it is obligatory for Muslims to carry out these provisions carefully, so that they do not go astray and do not violate the laws that have been ordained by Allah. The laws ordained by Allah are for the benefit of His servants, and His knowledge is very broad covering everything in this world."
		   }
	]
}
