{
	"tafseer": [
		{
			"id": 3253,
			"surah": 28,
			"ayat": 1,
			"tafsir": "tha Sin Mim, see commentary on hijaiyah letters at the beginning of surahh al-Baqarah."
		   },
		   {
			"id": 3254,
			"surah": 28,
			"ayat": 2,
			"tafsir": "In this verse, Allah confirms that the verses revealed to the Prophet Muhammad are verses from the Qur'an that are clear and easy to understand. These verses provide information about matters related to religious affairs and reveal the stories of earlier people whose truths were not known to humans at that time. This shows that the Qur'an was not made by Muhammad as alleged by polytheists, because Muhammad was an Ummi who did not know how to write and read. He also never studied with clever people let alone from the priests of the People of the Book. Where did the Prophet Muhammad get to know the stories of people who lived centuries ago if not from the revelations that Allah had revealed to him. Therefore, there can be no doubt that the verses of the Qur'an which contain laws and matters related to religion as well as stories about ancient peoples, are truly revelations from Allah."
		   },
		   {
			"id": 3255,
			"surah": 28,
			"ayat": 3,
			"tafsir": "In this verse it is explained that Allah recited to the Prophet Muhammad through Jibril the verses related to the story of the Prophet Musa and Pharaoh to be a lesson for believers. By observing the story, in which they know that the fate of the disobedient people is punished and the believers are freed from the oppression of the wrongdoers, they are increasingly convinced that the Qur'an is indeed a revelation sent down by Allah to Muhammad saw. In this verse it is stated that the story of Prophet Musa was told specifically for the believers, even though the Qur'an was revealed for all mankind, both believers and non-believers. The aim is to explain that only believers can benefit from the telling of the stories of the former Ummah because they have clear minds and pure hearts, and are not influenced by things that pollute the soul and mind. As for those who disbelieve and are still in disbelief, it will not be possible for them to benefit from it, because they have fallen deep into polytheism. Their hearts have been controlled by feelings of envy, pride, and arrogance, and love to follow lust, so it is difficult for them to accept the truth that goes against their wishes and wishes. No matter how clear the verses and evidence presented, they will still deny and reject them with various reasons that are sought after, such as saying that Muhammad was crazy or the miracles revealed to him were just magic."
		   },
		   {
			"id": 3256,
			"surah": 28,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains the story of Pharaoh who had absolute power in the land of Egypt. There is no one power that is higher than his power. Whatever he likes and wants must be done. All the people bowed and obeyed under his orders until he made himself a god. With such absolute power, he can commit tyranny and persecution arbitrarily. His government is not based on justice and noble morals, but based on mere will and desire. The politics he runs is to divide his people into several factions. Then he planted the seeds of discord and enmity in those factions so that he would remain in power over them. Any movement that is felt to oppose his rule must be stamped out and completely eradicated. If there is news or an issue that says that a person or group is trying to overthrow their power or may be the reason for their downfall, then that person or group must be destroyed. Those who are considered loyal and always support and strengthen their throne will be glorified. They are also given various kinds of facilities and privileges in order to become strong and victorious. Pharaoh had oppressed the Children of Israel because they were considered a dangerous group, if left unchecked it would surely undermine his government. He treats this group arbitrarily, is despised and humiliated, and is considered a class of slaves who have no rights whatsoever. This group was even forced to build pyramids and do other rough and heavy jobs. Especially after he heard from his sorcerers that it would be the Children of Israel who would overthrow his power. Since then Pharaoh was determined to eradicate this group. In addition to weakening and enslaving the Children of Israel, Pharaoh also decided that every male child born among the Children of Israel must be killed, without mercy. He doesn't care about the wailing of a mother who lost the child she was carrying with difficulty for nine months and became the foundation of her hope. With this action, Pharaoh thought that the Children of Israel would become extinct by themselves because no more sons would be born and develop. As for the girls, they were allowed to live because apart from being considered weak and unable to fight back, they were also used to satisfy their lust. Therefore, God branded Pharaoh as a person who did destruction on earth. In fact, there are many other ways that are not contrary to humanity that Pharaoh could do to prevent what he feared from happening. However, because his heart was hardened with stone and his mind was dark, there was no other way that he could see except to eradicate all the sons of the Children of Israel. Pharaoh then spread spies throughout Egypt to investigate all women. If any of them become pregnant, they will immediately record it and wait for the delivery period. If a girl is born, they will be left alone, but if a boy is born, they are immediately taken to be killed. Is it with this action that Pharaoh can maintain his power? Definitely not! Because behind that power, there is a far more powerful power, namely the power of Allah that cannot be defeated by anyone. He is the Creator, Almighty, and Almighty. As-Suddi narrated that Pharaoh dreamed of seeing fire coming to his country from Baitul Makdis. The fire burned the houses of the Pharaohs and left the houses of the Children of Israel. Pharaoh asked the wise men and sorcerers. They replied that the tafsir of the dream was that a son would be born (from the Children of Israel) who would overthrow his power in Egypt. It was this takwil that prompted Pharaoh to commit this cruel and ferocious act."
		   },
		   {
			"id": 3257,
			"surah": 28,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that He will bestow His mercy and grace upon the oppressed and weak Children of Israel by giving them worldly and religious strength and power. So, thanks to the struggle of the Children of Israel, a large and powerful kingdom was established in the land of Sham and finally they had great power in Egypt, which had once oppressed and enslaved them. This is emphasized by Allah in His word: And We have left to the oppressed people the eastern and western parts of the earth that We have blessed. And the word of your good Lord was perfected (as a promise) to the Children of Israel because of their patience. And We destroyed what Pharaoh and his people had made and what they had built. (al-A'raf\/7: 137) Thus, if Allah wills something, it must be done. No matter how strong Pharaoh was with his army and wealth, and no matter how weak the Children of Israel were, they did not have the slightest power, and they were always oppressed, persecuted and despised, but because Allah wanted to glorify them, there were always ways and opportunities for them to rise and move. Thanks to tenacity and patience, they succeeded in mastering the land of Egypt that once enslaved them. Allah showed Pharaoh what he, also Haman (his minister) and his army, had always feared, namely the collapse of their kingdom with the birth of a baby, namely Musa. This baby escaped Pharaoh's supervision, even raised and educated in his palace, and pampered and raised with great affection. In fact, it is the baby that will later overthrow his power, destroy his army and conquer his country. How painful was the wound in Pharaoh's heart when he saw the child he loved and pampered, challenged and fought against his power. Pharaoh's arrogance, arrogance, and arrogance were of no use when dealing with Allah's power and might. All his actions are rewarded with appropriate actions. Among the actions taken by Pharaoh who transgressed were: 1. Considering himself to have absolute power so that he was arrogant and arrogant and even claimed himself to be a god. 2. To ensure the continuity of his power, he divided his nation, exterminated groups that opposed him, killed all the male babies of the Children of Israel, and allowed their daughters to live to be employed and made as concubines and royal maids. 3. Act arbitrarily and do damage on earth. Pharaoh's actions were rewarded by Allah with several other actions, namely: 1. Allah freed the Children of Israel from the grip of Pharaoh and his people and made them leaders and leaders in the world. 2. Allah bequeathed to them the land of Syria by making them rule there and giving them a place on earth. 3. Allah showed Pharaoh, Haman, and his army how their power fell. Thus Allah shows His power. One thing that seems impossible, can happen, namely the fall of a great power by people who are weak, oppressed and persecuted. Indeed Allah has given power to whoever He wills, makes and removes power from whom He wills as mentioned in His words: Say (Muhammad), \"O Lord of power, You give power to whomever You will, and You deprive whoever You want of power. You glorify whomever You wish and You humiliate whoever You wish. In Your hands are all virtues. Truly, You are Almighty over all things. (ali 'Imran\/3: 26)"
		   },
		   {
			"id": 3258,
			"surah": 28,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that He will bestow His mercy and grace upon the oppressed and weak Children of Israel by giving them worldly and religious strength and power. So, thanks to the struggle of the Children of Israel, a large and powerful kingdom was established in the land of Sham and finally they had great power in Egypt, which had once oppressed and enslaved them. This is emphasized by Allah in His word: And We have left to the oppressed people the eastern and western parts of the earth that We have blessed. And the word of your good Lord was perfected (as a promise) to the Children of Israel because of their patience. And We destroyed what Pharaoh and his people had made and what they had built. (al-A'raf\/7: 137) Thus, if Allah wills something, it must be done. No matter how strong Pharaoh was with his army and wealth, and no matter how weak the Children of Israel were, they did not have the slightest power, and they were always oppressed, persecuted and despised, but because Allah wanted to glorify them, there were always ways and opportunities for them to rise and move. Thanks to tenacity and patience, they succeeded in mastering the land of Egypt that once enslaved them. Allah showed Pharaoh what he, also Haman (his minister) and his army, had always feared, namely the collapse of their kingdom with the birth of a baby, namely Musa. This baby escaped Pharaoh's supervision, even raised and educated in his palace, and pampered and raised with great affection. In fact, it is the baby that will later overthrow his power, destroy his army and conquer his country. How painful was the wound in Pharaoh's heart when he saw the child he loved and pampered, challenged and fought against his power. Pharaoh's arrogance, arrogance, and arrogance were of no use when dealing with Allah's power and might. All his actions are rewarded with appropriate actions. Among the actions taken by Pharaoh who transgressed were: 1. Considering himself to have absolute power so that he was arrogant and arrogant and even claimed himself to be a god. 2. To ensure the continuity of his power, he divided his nation, exterminated groups that opposed him, killed all the male babies of the Children of Israel, and allowed their daughters to live to be employed and made as concubines and royal maids. 3. Act arbitrarily and do damage on earth. Pharaoh's actions were rewarded by Allah with several other actions, namely: 1. Allah freed the Children of Israel from the grip of Pharaoh and his people and made them leaders and leaders in the world. 2. Allah bequeathed to them the land of Syria by making them rule there and giving them a place on earth. 3. Allah showed Pharaoh, Haman, and his army how their power fell. Thus Allah shows His power. One thing that seems impossible, can happen, namely the fall of a great power by people who are weak, oppressed and persecuted. Indeed Allah has given power to whoever He wills, makes and removes power from whom He wills as mentioned in His words: Say (Muhammad), \"O Lord of power, You give power to whomever You will, and You deprive whoever You want of power. You glorify whomever You wish and You humiliate whoever You wish. In Your hands are all virtues. Truly, You are Almighty over all things. (ali 'Imran\/3: 26)"
		   },
		   {
			"id": 3259,
			"surah": 28,
			"ayat": 7,
			"tafsir": "This verse describes a very worried situation for Musa's mother who was about to give birth to her child. He knew that the child would be snatched from his lap and killed without pity or mercy. Even though Musa's birth could be hidden, in time it would have been discovered by Pharaoh's spies who were widely scattered throughout the country, so that the fate of his baby would be the same as that of other children of the Children of Israel. After giving birth to Musa, his mother always felt restless and worried about the fate of the child she had carried with great difficulty for nine months, who became the foundation of her hopes after the baby grew up. Therefore, he always asked Allah to save his child from the danger of death that always threatens him. In that state of anxiety and anxiety, God inspired Musa's mother that she did not need to worry and worry. Let him continue to breastfeed and take care of it as well as possible. If he feels afraid because there are signs that his child will be known by Pharaoh, then he should throw the child into the Nile. Musa's mother was commanded by God not to feel doubt and worry, because He would protect and return Moses to her lap. Later the child will become the apostle of Allah who will deliver da'wah to Pharaoh."
		   },
		   {
			"id": 3260,
			"surah": 28,
			"ayat": 8,
			"tafsir": "In this verse it is explained how Musa's mother carried out the inspiration she received because she was sure that what God had promised her would definitely happen. After the baby Moses was wrapped in his body and put in a coffin, Moses was washed away into the Nile and the river currents carried him towards the Pharaoh's palace which was built on the bank of the river. One of Pharaoh's family saw the coffin floating in the river current and immediately picked it up and brought it to Pharaoh's wife. After opening, he was very surprised to see that the contents of the chest was a baby. At that moment Pharaoh's wife arose affection for the baby. He quickly brought the baby to Pharaoh. Without hesitation Pharaoh ordered that the baby be killed for fear that he was a descendant of the Children of Israel. However, Pharaoh's wife persuaded him not to kill the baby, and adopted him as a child in the hope that one day the child would serve Pharaoh and his kingdom. Finally Pharaoh allowed the child to be raised and cared for by his wife, not realizing that Allah willed this incident. Allah willed that when the child grows up, he will become Pharaoh's greatest enemy and will overthrow his power, not become a child who will serve and serve him. Thus Allah ordained the fall of Pharaoh's power, in return for his arrogance, tyranny, and cruelty towards the Children of Israel. In fact Pharaoh, Haman, and his army had made a big mistake by committing this atrocity. It was natural for Allah to destroy Pharaoh's power by means of a descendant of the Children of Israel whom he despised."
		   },
		   {
			"id": 3261,
			"surah": 28,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains the answer of Pharaoh's wife to defend the baby from being killed, because Pharaoh was worried that the baby was the child of a Bani Israil who feared it would destroy his power. Pharaoh's wife, who already loved the child because she was attracted to his beautiful face, said, \"Don't kill this child because I love and am very attracted to him. Let me raise and educate him. He will comfort my heart and your heart in times of trouble. know that in the future he will be of service to us. Or it would be better if we take him as our adopted son, because until now we have not been blessed with any children.\" Due to the persistence of Pharaoh's wife and the logical reasons she put forward, Pharaoh finally let the child live and was raised by his wife. Such is the destiny of Allah. He had made Pharaoh's wife love the child and made Pharaoh's heart soften because of his wife's seduction so that the child would not be killed. In fact, it was that child who would later oppose Pharaoh and would become his main enemy without him even realizing it."
		   },
		   {
			"id": 3262,
			"surah": 28,
			"ayat": 10,
			"tafsir": "In this verse, God explains how Moses' mother was after she threw her child into the Nile to carry out the inspiration she received from God. Even though his actions were based on inspiration from God with the promise that his child would be returned to him, he was still anxious and never felt at ease thinking about the fate of his son who had been washed away into the Nile. Various kinds of questions crossed the mind of Musa's mother. Sometimes he regretted that he had done the deed. How to find his son back? Would she scream and admit that she had thrown her child into the river, then ask the crowd to look for her? Completely empty heart and mind. He had lost his mind and consciousness so that he could not think anymore. However, Allah strengthened his heart and reassured his mind so that he realized and believed that Allah had promised to return his child to his lap and would later make him an apostle."
		   },
		   {
			"id": 3263,
			"surah": 28,
			"ayat": 11,
			"tafsir": "Even though Musa's mother had done what God had inspired her, her heart was not at peace. Therefore, he sent his daughter (Moses sister) to look for news about Moses. Then Musa's brother went to follow the chest containing Musa. Finally he saw from a distance that the coffin had entered the Pharaoh's area and was saved by his family. Even though this event was witnessed by many people, they were not aware of Moses' presence among them. In the palace, people were busy looking for someone who could breastfeed the child, because he refused every woman who wanted to breastfeed him. After Musa's brother learned about this, he dared to come forward and say that he knew a woman who was healthy and had lots of milk. Maybe the child wants to be breastfed by the woman. The woman was from a good family and the child would surely be cared for with care and affection. It was narrated from Ibn 'Abbas that after Musa's brother said these words, then Musa's mother was brought to the palace, they looked at her with suspicion and asked, \"How do you know that this woman will take good care of him and will shed affection for him?\" ?\" Musa's brother replied, \"Of course he will do so because he hopes for the pleasure of the king of Pharaoh and expects a lot of gifts from him.\" With this answer their suspicions were removed. Musa was then brought back to his mother's house. Arriving home, his mother put Musa on her lap to be nursed. Immediately Musa's mouth caught his mother's nipple. Those present were very happy to see this and the king's consort sent messengers to tell it. The Empress summoned Musa's mother and gave her many gifts and gifts and asked her to be willing to stay in the palace to care for and care for Musa. Musa's mother refused the offer politely and told the empress that she had a husband and children and did not have the heart to leave them. He begged the empress to let him take Musa to her house. The Empress did not object to this suggestion and allowed Musa to be brought to her mother's house. The Empress gave him ample fare. Besides that, the empress also gave him gifts in the form of money, clothes, and so on. Finally, Musa's mother returned home bringing her biological child with a happy and happy heart. Allah has removed all the worries and worries of Musa's mother and replaced them with peace, glory and abundant sustenance and returned Musa to live with his mother."
		   },
		   {
			"id": 3264,
			"surah": 28,
			"ayat": 12,
			"tafsir": "Even though Musa's mother had done what God had inspired her, her heart was not at peace. Therefore, he sent his daughter (Moses sister) to look for news about Moses. Then Musa's brother went to follow the chest containing Musa. Finally he saw from a distance that the coffin had entered the Pharaoh's area and was saved by his family. Even though this event was witnessed by many people, they were not aware of Moses' presence among them. In the palace, people were busy looking for someone who could breastfeed the child, because he refused every woman who wanted to breastfeed him. After Musa's brother learned about this, he dared to come forward and say that he knew a woman who was healthy and had lots of milk. Maybe the child wants to be breastfed by the woman. The woman was from a good family and the child would surely be cared for with care and affection. It was narrated from Ibn 'Abbas that after Musa's brother said these words, then Musa's mother was brought to the palace, they looked at her with suspicion and asked, \"How do you know that this woman will take good care of him and will shed affection for him?\" ?\" Musa's brother replied, \"Of course he will do so because he hopes for the pleasure of the king of Pharaoh and expects a lot of gifts from him.\" With this answer their suspicions were removed. Musa was then brought back to his mother's house. Arriving home, his mother put Musa on her lap to be nursed. Immediately Musa's mouth caught his mother's nipple. Those present were very happy to see this and the king's consort sent messengers to tell it. The Empress summoned Musa's mother and gave her many gifts and gifts and asked her to be willing to stay in the palace to care for and care for Musa. Musa's mother refused the offer politely and told the empress that she had a husband and children and did not have the heart to leave them. He begged the empress to let him take Musa to her house. The Empress did not object to this suggestion and allowed Musa to be brought to her mother's house. The Empress gave him ample fare. Besides that, the empress also gave him gifts in the form of money, clothes, and so on. Finally, Musa's mother returned home bringing her biological child with a happy and happy heart. Allah has removed all the worries and worries of Musa's mother and replaced them with peace, glory and abundant sustenance and returned Musa to live with his mother."
		   },
		   {
			"id": 3265,
			"surah": 28,
			"ayat": 13,
			"tafsir": "This verse explains that God's promise to Moses' mother has been fulfilled, namely to return Moses to her so that her heart will be at peace and no longer feel sad. Similarly, God has kept His promise to appoint Moses as an apostle, but most people do not know about it. Who would have thought that a child who had been targeted by death because he was a child of the Children of Israel was then cared for and raised in the palace with great love and affection in the hope that he would be meritorious when he grew up. However, it turns out that the child will become an apostle and oppose Pharaoh's power, even undermine the kingdom itself."
		   },
		   {
			"id": 3266,
			"surah": 28,
			"ayat": 14,
			"tafsir": "In these verses it is explained that as an adult, Allah bestowed upon Musa knowledge and wisdom because of his obedience and obedience to God and his patience in facing various trials. It was only natural that Musa would know from his mother how he came to live in the palace of the Pharaoh's royal family, even though he was just an ordinary child from the Children of Israel who was always humiliated and enslaved by Pharaoh and his people. This would arouse Musa's sympathy for the Children of Israel even though Pharaoh had contributed to educating and nurturing him from childhood to becoming an adult male who was in good health, both physically and mentally. Sympathy for his relatives and people is an instinct that cannot be separated from a person's soul, especially for Musa, who saw the Children of Israel being oppressed and persecuted by the Qibthi people who lived in Egypt every day. However, thanks to the patience he has, as a gift from Allah, he can hold his heart until Allah provides a way for him to lift his people from the valley of humiliation and suffering. Because of his patience, kindness and behavior, as well as his obedience to carrying out religious teachings, Allah gave Moses knowledge and wisdom as a preparation to be appointed as an apostle. He was sent to convey the message of Allah to his people and Pharaoh who was very arrogant, arrogant, and raised himself as a god."
		   },
		   {
			"id": 3267,
			"surah": 28,
			"ayat": 15,
			"tafsir": "One day, Musa sneaked into the city unnoticed by the crowd, when people were sleeping after noon. There he saw two people fighting, one from the Children of Israel and the other from the natives of Egypt who he considered as an enemy because he always insulted and looked down on the Children of Israel. People from the Children of Israel screamed for help to escape from the cruelty of their opponents. Driven by fanaticism towards his people, Moses quickly hunted down the Egyptian. Out of anger and without thinking about the consequences of his actions, Moses beat the Egyptian with all his might. As a result of the blow, the Egyptian collapsed instantly and died. Actually Musa did not intend to kill him at all, but in fact the man died with just one blow. Musa was very sorry for his negligence and considered his actions to be wrong, acts of haste. He said to himself that his actions were the actions of the devil who always deceives people into committing injustice and immorality. Indeed, he has fallen into the trap of Satan who is the enemy of mankind and always tries to lead him astray."
		   },
		   {
			"id": 3268,
			"surah": 28,
			"ayat": 16,
			"tafsir": "In this verse it is explained that when he realized his mistake, Musa begged God for forgiveness, saying, \"Indeed, I have wronged myself by killing people who should not be killed. So forgive my sins and do not torture me because of my accidental actions. .\" Allah, Most Forgiving and Most Merciful to His servants, forgives the mistakes of Musa. With that forgiveness, Musa's heart became peaceful and free from worries and troubles thinking about his fate because he committed a sinful act. Truly forgiveness is a mercy and a gift from Allah. Among Allah's gifts to Moses are mentioned in His words: And you once killed someone, then We saved you from (great) difficulties and We tried you with several (severe) trials. (thaha\/20: 40) Musa promised not to make that mistake again and would not be a helper for people who made mistakes. Moreover, the help will cause persecution or murder and self-harm."
		   },
		   {
			"id": 3269,
			"surah": 28,
			"ayat": 17,
			"tafsir": "In this verse it is explained that when he realized his mistake, Musa begged God for forgiveness, saying, \"Indeed, I have wronged myself by killing people who should not be killed. So forgive my sins and do not torture me because of my accidental actions. .\" Allah, Most Forgiving and Most Merciful to His servants, forgives the mistakes of Musa. With that forgiveness, Musa's heart became peaceful and free from worries and troubles thinking about his fate because he committed a sinful act. Truly forgiveness is a mercy and a gift from Allah. Among Allah's gifts to Moses are mentioned in His words: And you once killed someone, then We saved you from (great) difficulties and We tried you with several (severe) trials. (thaha\/20: 40) Musa promised not to make that mistake again and would not be a helper for people who made mistakes. Moreover, the help will cause persecution or murder and self-harm."
		   },
		   {
			"id": 3270,
			"surah": 28,
			"ayat": 18,
			"tafsir": "God's forgiveness has made his heart relieved and spacious, but what about the native Egyptians where he lives among them? Would they just let it go if they found out about the murder? This is what really disturbs Musa's peace of mind and is always a burden on his mind. Therefore, Moses secretly sought information whether people knew about what he had done, and if they knew about it, what would their attitude be? What action will they take against him? As he walked through the city, he saw the man who had been helped earlier and shouted again for help so that he would help him one more time against the other Egyptians. Apparently the man he helped earlier was again involved in a fight with other Egyptians. Perhaps the man asked him to kill the Egyptian as he had killed before. Pictured in his brain how he had sinned with the murder, but God with His mercy and compassion, has forgiven his mistakes. Is he going to make a mistake again, moreover he has promised his God that he will not repeat that deed again. Therefore, Moses said to the Israelites that he was a lost person. However, he also pictured in his mind how the fate of his people were humiliated and always mistreated by the Egyptians, so his anger also rose and he almost attacked the Egyptians. But before he attacked, the Egyptian shouted at him saying was he going to kill him like he killed his friend yesterday? Apparently the man had recognized Musa's face because people in town were talking about the murder and the perpetrators. Then the Egyptian snapped at him and said, \"Truly you have acted arbitrarily on earth. You are not of those who do good.\" With that shout, Musa realized and remembered his promise that he would not repeat his mistake again so he would not hit that person. In the opinion of some commentators who said these words to Moses were not Egyptians but Israelites whom he had helped, because Moses accused him of being a misguided person and wanted to beat him."
		   },
		   {
			"id": 3271,
			"surah": 28,
			"ayat": 19,
			"tafsir": "God's forgiveness has made his heart relieved and spacious, but what about the native Egyptians where he lives among them? Would they just let it go if they found out about the murder? This is what really disturbs Musa's peace of mind and is always a burden on his mind. Therefore, Moses secretly sought information whether people knew about what he had done, and if they knew about it, what would their attitude be? What action will they take against him? As he walked through the city, he saw the man who had been helped earlier and shouted again for help so that he would help him one more time against the other Egyptians. Apparently the man he helped earlier was again involved in a fight with other Egyptians. Perhaps the man asked him to kill the Egyptian as he had killed before. Pictured in his brain how he had sinned with the murder, but God with His mercy and compassion, has forgiven his mistakes. Is he going to make a mistake again, moreover he has promised his God that he will not repeat that deed again. Therefore, Moses said to the Israelites that he was a lost person. However, he also pictured in his mind how the fate of his people were humiliated and always mistreated by the Egyptians, so his anger also rose and he almost attacked the Egyptians. But before he attacked, the Egyptian shouted at him saying was he going to kill him like he killed his friend yesterday? Apparently the man had recognized Musa's face because people in town were talking about the murder and the perpetrators. Then the Egyptian snapped at him and said, \"Truly you have acted arbitrarily on earth. You are not of those who do good.\" With that shout, Musa realized and remembered his promise that he would not repeat his mistake again so he would not hit that person. In the opinion of some commentators who said these words to Moses were not Egyptians but Israelites whom he had helped, because Moses accused him of being a misguided person and wanted to beat him."
		   },
		   {
			"id": 3272,
			"surah": 28,
			"ayat": 20,
			"tafsir": "In this verse, Allah explains that a man from the Pharaoh's family, who sympathized with Musa, attended the meetings held by Pharaoh and his superiors. In deliberation it was decided that Musa should be killed. The man who took part in the deliberation came to meet Musa to tell him about the evil plan, because he had great sympathy and respect for him. He asked Moses to leave Egypt immediately. Otherwise, maybe he would be caught and killed because they were preparing a secret army to surround and arrest him. He told Moses that everything he said was true and he advised Moses to run quickly. The advice really came from a sincere heart for the sake of Moses' own safety."
		   },
		   {
			"id": 3273,
			"surah": 28,
			"ayat": 21,
			"tafsir": "Hearing the advice put forward by the man and seeing his attitude that showed honesty and sincerity, Musa immediately left in a state of constant vigilance, because behind him some of Pharaoh's soldiers were getting ready to surround and arrest him. How much pressure Musa was under. Even so, he still tried to save himself and prayed to Allah, “O my God, the Almighty, the Most Gracious, the Most Merciful, deliver me from the clutches of the persecuting Pharaoh's people. Allah granted his prayer and showed him the way to Madyan. According to history, Pharaoh ordered his soldiers to chase Musa down to the small roads and forbade them to go through the main roads because he believed that Musa would not be able to take that road."
		   },
		   {
			"id": 3274,
			"surah": 28,
			"ayat": 22,
			"tafsir": "After Musa learned that the path he was taking was the usual way for people to go to Midian, he was sure that he would not get lost through the vast desert. Moreover, he had prayed to his God to always be shown the straight path. However, even though the road he took was a highway that people used to travel, the distance he had to travel was very long, while he did not bring provisions because he was in a hurry to leave the city of Egypt. It is reported that Musa walked for eight days and eight nights, without food and with bare feet. There is nothing to eat except the leaves of the wood. However, his heart remained steadfast and his spirit remained steel because he escaped from Pharaoh's pursuit. He had survived Pharaoh's trap when he was small, even though many baby boys from the Children of Israel were killed, and now he is free from Pharaoh's pursuit when he is an adult. All of that is because of God's grace and protection. Therefore, he was sure that during this long and difficult journey, he would still be under His protection."
		   },
		   {
			"id": 3275,
			"surah": 28,
			"ayat": 23,
			"tafsir": "In this verse it is explained that in the end Moses came to a spring in the city of Madyan. He saw that there were people jostling to fetch water and water their livestock. In a rather low place, he saw two girls holding and holding the rope of his goat which always wanted to go towards the people who were fetching water because they were very thirsty. Seeing this, a feeling of pity arose in Musa's heart, so he approached the two girls to ask why they didn't join the crowds to fetch water and give their goats a drink. The two of them replied, \"We cannot fetch water unless all of these people have finished fetching it, because we are not strong enough to fight and jostle with the crowds. Our father is very old, so he cannot come here to fetch water. That is why we have to wait for the people to leave and we can only fetch water, if there is any water left by them.\""
		   },
		   {
			"id": 3276,
			"surah": 28,
			"ayat": 24,
			"tafsir": "Musa quickly fetched water for the two girls to water their goats. Because of exhaustion, he took shelter under a tree while feeling hungry and thirsty because he had not eaten for several days except for leaves. Moses prayed to Allah because he desperately needed His grace and mercy, to remove the suffering he was experiencing."
		   },
		   {
			"id": 3277,
			"surah": 28,
			"ayat": 25,
			"tafsir": "In this verse, it is explained how the end of the suffering that Moses experienced when his prayer was answered by God. Unexpectedly, one of the two girls came a bit shy and said to Musa that his father had invited Musa to come to his house just to repay Musa's kindness for helping them get drinking water and giving their livestock water to drink. Musa could understand that the two girls came from good people's families, because of their polite demeanor and when he came to him and heard that it was not him who invited him to come to his house but his father. If the girl had invited herself, an unfavorable impression might be created on her. The commentators differed on whether the girl's father was Prophet Shuaib or not. Some scholars believe that the father of the two girls was a religious leader who was pious and aged. As for the opinion that the woman's father was Prophet Shuaib, it cannot be accepted because Prophet Shuaib lived long before Prophet Musa. Finally, Musa went with the girl to their parents' house. Upon arriving, Musa told the girl's parents the story of her life with Pharaoh, how arrogant and contemptuous of the Children of Israel, up to the decision and order to kill her, so she fled from Egypt for fear of being killed. The old man listened attentively to Musa's story. After Musa finished telling his story, the old man said to him, \"You don't need to be afraid and worried because you have been released from the power of the unjust people. They will not be able to catch you, because you are outside the boundaries of their kingdom.\" Thus, Musa's heart felt at ease because he had received protection in the house of a religious leader who had a great influence in the area."
		   },
		   {
			"id": 3278,
			"surah": 28,
			"ayat": 26,
			"tafsir": "Apparently the parents did not have a son and also did not have a maid. Therefore, it was only the two daughters who took care of all the family affairs, until both of them had to herd their goats, besides taking care of the household. It occurred to one of the daughters to ask for help from Musa who seemed to have a very good attitude and manners and had a strong power to be a helper in this house. The daughter suggested to her father to appoint Musa as their assistant to herd the goats, fetch water, and so on because he was an honest, trustworthy, and strong man. This suggestion pleased his father, he didn't even just want to appoint him as a servant, he even wanted to marry one of his daughters to Moses."
		   },
		   {
			"id": 3279,
			"surah": 28,
			"ayat": 27,
			"tafsir": "Immediately the old man invited Musa to talk. He frankly said his desire to marry Moses with one of his daughters. As a dowry for this marriage, Musa had to work herding goats for eight years, if Musa agreed to work for ten years, that would be even better. This was a very sympathetic offer and a great relief to Musa's heart, as a fugitive who wants to escape death, a person who is not sure about his future, whether he will be stranded in other people's lands, because he is not sure of the direction he will go. What else is more valuable and happier than that offer? Without hesitation Musa has set in his heart to accept the offer. The scholars take the argument with this verse that a father may ask a man to be his daughter's husband. This happened a lot at the time of the Prophet Muhammad, even among women who offered themselves to be married by the Prophet Muhammad or so that he would marry them to whoever he wanted. Umar once offered his daughter Hafsah (who was a widow) to Abu Bakr but Abu Bakr was silent. It was then offered to 'Uthman, but 'Uthman apologized for objecting. This was told by Abu Bakr to the Prophet. He also reassured her by saying, \"May Allah give Hafsah a better person than Abu Bakr and 'Uthman.\" Then Hafsah was married by the Prophet."
		   },
		   {
			"id": 3280,
			"surah": 28,
			"ayat": 28,
			"tafsir": "Musa accepted the offer and promised the girls' parents that he would fulfill the agreed terms and would fulfill one of the two terms offered, namely eight or ten years. After that there are no more obligations that must be imposed on him. Moses also stated that God is the witness for the truth of what has been promised together."
		   },
		   {
			"id": 3281,
			"surah": 28,
			"ayat": 29,
			"tafsir": "This verse explains that after doing his duty for ten years to the best of his ability, he said goodbye to his parents-in-law to return to Egypt, which was his hometown, with his wife. Of course there was no reason for his parents-in-law to hold him because all the conditions that had been set for marrying his daughter had been fulfilled by Musa. It's just that as a parent, he won't have the heart to just let his son-in-law go, without providing some provisions on the road. His parents-in-law provided enough and gave him some goats. Then Moses set out with his wife following the path he had traveled before when he fled from Egypt. On the way, he stopped somewhere to unwind. Because night had come and it was pitch dark, he tried to start a fire with a rock. However, the tinder wouldn't light up so he almost gave up because he couldn't do anything in the pitch darkness. The air was so cold that he and his family would not be able to survive long, without a fire to burn. Under these circumstances, from afar he saw flames of fire to the right of Mount Tur. He then told his wife to wait at his place because he was going to the place of the fire. Hopefully the people there can guide him about the journey or he can bring a piece of firewood so they can warm themselves from the unbearable cold."
		   },
		   {
			"id": 3282,
			"surah": 28,
			"ayat": 30,
			"tafsir": "Moses walked towards the fire he saw. When he was near the fire, he was called out by a voice in the valley to his right. He heard a cry which told him that it was the cry of Allah, Lord of the worlds. Moses heard the call of his Lord in the silence of the night, in the valley alone, and no one accompanied him. How could Moses hear Divine Words directly from his Lord? Because it is something unseen, no one knows about it except Allah. He had inspired in Moses the belief that it was the Lord of the worlds who spoke to him. The valley where Moses stood was made a place full of blessings because it was there that Moses heard the word of his Lord and was made an apostle."
		   },
		   {
			"id": 3283,
			"surah": 28,
			"ayat": 31,
			"tafsir": "Then God ordered Moses to throw down his stick. Musa obediently threw down his staff, but it turned into a huge snake that moved swiftly and nimbly. Musa was very surprised and was horrified and afraid to see the snake. Immediately, he ran without looking back. There was nothing for him to think about except saving himself from the bite of the terrible snake. At that time God called out again for Moses to return to his original place and not be afraid of the snake. The snake was just his stick turning into a snake and wouldn't bother him. Nothing could disturb his peace. This is the miracle that Allah gave to Musa to face the arrogant and arrogant Pharaoh. Musa's heart felt safe and secure after hearing that God guaranteed his safety."
		   },
		   {
			"id": 3284,
			"surah": 28,
			"ayat": 32,
			"tafsir": "Then God commanded Moses to put his hands into his clothes. This command was carried out by Moses obediently and obediently. When she took her hand from the neck of her shirt, she saw that her hand had turned bright white and shining not because of a hairpiece or anything else. Musa was shocked, surprised, and felt afraid. However, immediately after that God's command came down to get rid of the shock and fear that had overtaken him so that he would clasp his hands to his chest. Then Allah confirmed to Moses that the two miracles given to him were to show His power. Musa was ordered to show these two miracles to the arrogant and wicked Pharaoh when Musa called on him to believe in Allah and leave his heresy. At that time, Musa understood that the treatise had been placed on his shoulders which had to be conveyed to Pharaoh and his people, as well as to the Children of Israel themselves. This means that he has become an apostle. Thus, what God promised to Moses' mother that his son would be returned to his day, was fulfilled when Moses was still a child. Now God's second promise is also fulfilled that He appointed Moses to be an apostle. Prior to this, what had driven Musa to leave Midian for Egypt was a feeling of homesickness and longing for his homeland and relatives. He dared to do this because he hoped that the Egyptians had forgotten the past murders he had committed so that he could enter Egypt secretly. However, he must now return there openly and oppose the power of the mighty Pharaoh. That way, Pharaoh and his people would definitely kill him. She started to feel worried for herself if she went out alone. The thing that he was more worried about was that if he was killed by Pharaoh, surely his message from God would not reach his people (the Children of Israel)."
		   },
		   {
			"id": 3285,
			"surah": 28,
			"ayat": 33,
			"tafsir": "Musa complained to his Lord that he once killed a young boy. It had become widely known among the Egyptians, and Pharaoh had decided to kill him. It was very worried about Musa, who knows when he got there, Pharaoh and his people were getting ready to kill him. Thus the treatise that has been assigned to him becomes neglected. Musa also complained that he had a brother named Aaron who was more eloquent in speech than he was, better at debating and giving information. With his eloquence, Harun will be able to defend him, when Pharaoh and his people make accusations that might incriminate him."
		   },
		   {
			"id": 3286,
			"surah": 28,
			"ayat": 34,
			"tafsir": "Musa complained to his Lord that he once killed a young boy. It had become widely known among the Egyptians, and Pharaoh had decided to kill him. It was very worried about Musa, who knows when he got there, Pharaoh and his people were getting ready to kill him. Thus the treatise that has been assigned to him becomes neglected. Musa also complained that he had a brother named Aaron who was more eloquent in speech than he was, better at debating and giving information. With his eloquence, Harun will be able to defend him, when Pharaoh and his people make accusations that might incriminate him."
		   },
		   {
			"id": 3287,
			"surah": 28,
			"ayat": 35,
			"tafsir": "Allah granted Musa's request and promised to appoint Aaron to be his apostle and companion (vizier). Allah also reassures his heart which is always filled with worries because of the heavy burden that is carried on him. Allah promised that He would give Musa and his brother a power that could not be defeated by any power in the world let alone the very limited power of Pharaoh. With a safe and secure heart, Musa returned to where his wife left him. He told him all the events that had happened to him, namely that he had been appointed by Allah to be an apostle. Hearing Musa's story, his wife's heart became peaceful. Musa then left with his family for Egypt driven by a sacred dream, namely conveying Allah's message to Pharaoh and the Children of Israel. In Egypt, Aaron was getting ready to take up the tract and help his brother."
		   },
		   {
			"id": 3288,
			"surah": 28,
			"ayat": 36,
			"tafsir": "Musa then came to Pharaoh and his people to call them to the religion of monotheism by providing clear evidence and strong and clear explanations. Thus, there is no reason for them to reject the truth he put forward. However, they immediately rejected what Moses said. When they were cornered and could no longer refute the truth they brought, they then accused all that it was just magic and they never heard what Moses said from their ancestors. Such is the attitude of the disbelievers towards the apostles who call to the true religion as stated in His word: Thus whenever an apostle comes to those before them, they (his people) must say, \"He is a sorcerer or crazy person.\" (adz-dzariyat\/51: 52)."
		   },
		   {
			"id": 3289,
			"surah": 28,
			"ayat": 37,
			"tafsir": "The accusation of Pharaoh and his people that the evidence presented by Musa was mere magic was answered calmly and not out of the manners and manners of debating, without accusing his opponents that they had gone astray. Musa told them that his Lord knows better who actually brought guidance from Allah and who is actually the lucky one who will get happiness in the hereafter. Behind that, in his heart he fully believes he is the right one, he is a lucky person and anyone who opposes the truth he brings will surely lose and regret it. This answer is the same as the answer given by the Prophet Muhammad to the polytheists who opposed him, as stated in the word of Allah: Say (Muhammad), \"Who gives you sustenance from the sky and from the earth?\" Say, \"Allah,\" and indeed we or you (the polytheists), must be in the truth or in a manifest error. (Saba'\/34: 24) Even so, Musa insisted that the wrongdoers would not win. This was a signal to Pharaoh and his people that they would not win. They will surely lose and be destroyed because they are arrogant and persecuted people."
		   },
		   {
			"id": 3290,
			"surah": 28,
			"ayat": 38,
			"tafsir": "This verse explains that after running out of reasons and arguments to refute Musa's statements and the evidence he put forward, Pharaoh ordered his people not to believe in the lies that Moses put forward. So far, no one has dared to claim that there is a God besides him. Since ancient times, as long as Egypt was ruled by Pharaohs, one after another, no one denied that the Pharaohs were gods who ruled over the earth. The eyes of the people's hearts were deceived by fairy tales and superstitions which stated that humans must submit to the power of Pharaoh. He always carried out cruel and ruthless acts against people who dared to deny his power as a god by torturing and imprisoning and even killing him. This is mentioned in the word of Allah: Then he gathered (his princes) and called (calling his people). (While) said, \"I am your most high god.\" (an-Nazi'at\/79: 23-24) God's Word: He (Pharaoh) said, \"Indeed, if you worship God besides me, I will surely put you in prison.\" (asy-Syu'ara'\/26: 29) Imam Fakhruddin ar-Razi is of the opinion that Pharaoh claimed himself as a god, meaning that he did not create the heavens, the earth, the seas, the mountains, and all human beings because it would not be able to accepted by reason. The point is that people are slaves to him. He simply denied the existence of a god who must be obeyed and worshiped besides him. Then Pharaoh ordered his vizier, Haman, to light a big fire to make lots of bricks and build a tall building so that he could go up to the sky to see the God that Moses preached. Pharaoh then emphasized that Musa was a big liar. In line with this, Allah said: And Pharaoh said, \"O Haman! Make me a tall building so that I can reach the doors, (ie) the gates of heaven, so that I can see the Lord of Moses, but I still look at him a liar.\" And thus it made Pharaoh feel beautiful for his bad deeds, and he was closed from the (right) way; and Pharaoh's deception was nothing but harm. (al-Mu'min\/40: 36-37)"
		   },
		   {
			"id": 3291,
			"surah": 28,
			"ayat": 39,
			"tafsir": "In this verse, Allah confirms that Pharaoh and his army were very arrogant and arrogant. Pharaoh considered and confessed that he was the only absolute ruler on earth. Anyone who challenges him is considered wrong and disobedient. When he was told that there was a God greater than his power, Pharaoh became frenzied and could no longer control himself, such as ordering the impossible to be done immediately, such as constructing a building as high as the sky so that he could face God Almighty and Almighty. Pharaoh and his people thought that they would not be resurrected, that they would not be taken into account for what they had done while living in the world, and that no one would torture them if they committed tyranny and cruelty. This is what they believe because of the influence of their pride and arrogance. They made a large pyramid for their graves filled with complete and luxurious furniture and beautiful clothes and jewelry, to be enjoyed after death. Because of that arrogance and arrogance, Allah will punish them in this world and the hereafter. In this world, Pharaoh and his soldiers drowned in the ocean, and in the afterlife they will be tormented in hell. Such is the destiny that Allah has ordained for those who are arrogant and arrogant, commit injustice and abuse against Allah and their fellowmen. Actually the continuation of the story of Pharaoh can be found in other surahhs in the Qur'an such as surahh al-A'raf, Yunus, thaha, and so on. However, Allah wants to emphasize here what is the fate of disobedient people who no longer use their minds and minds so that their hearts are closed to accept the truth from wherever it comes, so they become arrogant and arrogant. It deserves attention and a lesson for all human beings."
		   },
		   {
			"id": 3292,
			"surah": 28,
			"ayat": 40,
			"tafsir": "In this verse, Allah confirms that Pharaoh and his army were very arrogant and arrogant. Pharaoh considered and confessed that he was the only absolute ruler on earth. Anyone who challenges him is considered wrong and disobedient. When he was told that there was a God greater than his power, Pharaoh became frenzied and could no longer control himself, such as ordering the impossible to be done immediately, such as constructing a building as high as the sky so that he could face God Almighty and Almighty. Pharaoh and his people thought that they would not be resurrected, that they would not be taken into account for what they had done while living in the world, and that no one would torture them if they committed tyranny and cruelty. This is what they believe because of the influence of their pride and arrogance. They made a large pyramid for their graves filled with complete and luxurious furniture and beautiful clothes and jewelry, to be enjoyed after death. Because of that arrogance and arrogance, Allah will punish them in this world and the hereafter. In this world, Pharaoh and his soldiers drowned in the ocean, and in the afterlife they will be tormented in hell. Such is the destiny that Allah has ordained for those who are arrogant and arrogant, commit injustice and abuse against Allah and their fellowmen. Actually the continuation of the story of Pharaoh can be found in other surahhs in the Qur'an such as surahh al-A'raf, Yunus, thaha, and so on. However, Allah wants to emphasize here what is the fate of disobedient people who no longer use their minds and minds so that their hearts are closed to accept the truth from wherever it comes, so they become arrogant and arrogant. It deserves attention and a lesson for all human beings."
		   },
		   {
			"id": 3293,
			"surah": 28,
			"ayat": 41,
			"tafsir": "This verse gives the nickname Pharaoh and his rebellious people that they are the leaders who bring people to hell because they have led people astray and forced everyone to disbelieve in their Lord. They feel free to commit tyranny at will, without any sense of justice and compassion. Actually these people have committed two wrongs, a mistake for themselves and a mistake for misleading others. So it is appropriate if they receive double torture, torture for their own misguidance and torture for misleading others. Therefore, there will be no helper for them in the hereafter and no one will free them from Allah's punishment."
		   },
		   {
			"id": 3294,
			"surah": 28,
			"ayat": 42,
			"tafsir": "This verse gives the nickname Pharaoh and his rebellious people that they are the leaders who bring people to hell because they have led people astray and forced everyone to disbelieve in their Lord. They feel free to commit tyranny at will, without any sense of justice and compassion. Actually these people have committed two wrongs, a mistake for themselves and a mistake for misleading others. So it is appropriate if they receive double torture, torture for their own misguidance and torture for misleading others. Therefore, there will be no helper for them in the hereafter and no one will free them from Allah's punishment."
		   },
		   {
			"id": 3295,
			"surah": 28,
			"ayat": 43,
			"tafsir": "This verse explains that Allah has sent down to Moses the Torah as a mercy for him and for his people, who had long been oppressed and persecuted under the rule of Pharaoh. In it there are wisdom and laws that guide humans to the happiness of the world and the hereafter. Here is a big and real difference in God's treatment of leaders and people who are disobedient, arrogant and arrogant with his treatment of leaders who are pious and sincere and obedient to Him. To the first group, such as Pharaoh and his people, calamity and torment were sent down so that he was drowned with his army into the sea. To the second group, such as Musa, Aaron and their people, the Book was revealed which would be a guide for them in living life, both in this world and in the hereafter. Such is the sunatullah that has been in effect since ancient times. How many previous peoples have He destroyed in various ways like what happened to the people of Prophet Noah, Prophet Saleh, Prophet Hud, and others. From Abu Sa'id al-Khudri sourced from the Prophet, he said, \"After the revelation of the Torah on earth, Allah will no longer destroy a people with punishment from heaven or earth except for the inhabitants of the land who are turned into monkeys, they are the Children of Israel after the death of The Prophet Musa, then the Prophet saw read this verse (al-Qasas\/28: 43) (History of al-hakim)"
		   },
		   {
			"id": 3296,
			"surah": 28,
			"ayat": 44,
			"tafsir": "This verse explains that Muhammad saw was never on the west side of the Thuwa Sacred Valley, where Allah revealed the pages of the Torah to Moses. At that time, Allah burdened prophetic matters to him. Because he was not one of the group of 70 people who had been chosen to listen in detail to the things that Allah revealed to Moses, it was impossible for Muhammad to explain all of this except by way of revelation from Allah. Muhammad saw could convey unseen things that had happened a long time ago and were not witnessed and seen at all, even though he was an 'ummi unable to read and write, was in the midst of people who were 'ummi too, and did not know anything about this. -that matter. This is clear proof that Muhammad is truly a prophet and messenger of Allah. All of that was conveyed and narrated through the intercession of revelations from God. Allah's Word: And they said, \"Why did he not bring us a sign (proof) from his Lord?\" Hasn't the (real) evidence come to them as mentioned in the previous books? (thaha\/20: 133)"
		   },
		   {
			"id": 3297,
			"surah": 28,
			"ayat": 45,
			"tafsir": "This verse explains that Allah has created generations after the Prophet Musa to the Prophet Muhammad for a long period of time and was a period of emptiness, so that their knowledge is reduced, their morals are declining and have led to destruction and moral decadence. At that time it was felt rightly necessary to send an apostle to guide and instruct them to the right path. So the Prophet Muhammad was sent and he was informed by Allah about the circumstances and circumstances of the previous prophets, as well as the circumstances and circumstances of Prophet Musa. Allah also explains in this verse that Muhammad did not stay with the people of Madyan to inquire and learn the story of Prophet Musa from people who witnessed the story themselves. All of this was known to the Prophet Muhammad through the revelations revealed to him."
		   },
		   {
			"id": 3298,
			"surah": 28,
			"ayat": 46,
			"tafsir": "This verse explains that the Prophet Muhammad was not near Mount Tur when Allah called the Prophet Musa and when the munajat took place between the two of them. This event was known to Muhammad through the holy book Al-Qur'an which was revealed to him as a mercy from Allah in which the story was explained. There are also things that will bring benefit and happiness to them in this world and in the hereafter, so that Muhammad will give a warning to the Quraysh who have never received a warning before. In addition to this verse as a clear argument for Muhammad's apostleship, it is also an argument for the miracles of the Qur'an, because it narrates events that have taken place hundreds of years ago. Even though the Messenger of Allah did not witness the event let alone be present in their midst."
		   },
		   {
			"id": 3299,
			"surah": 28,
			"ayat": 47,
			"tafsir": "This verse explains that one of the wisdoms of sending Muhammad to them was to reject their excuses, when later they will receive a painful punishment for their disbelief against Allah and the sins they have committed. If Muhammad had not been sent while punishment befell them, of course they would have given reasons and excuses. They will say, “O our Lord! You sent down to the apostle, so that we believe in Your divinity and justify the apostle that You sent?\" Therefore, long before they were wrathful and punished by Allah, Muhammad was sent to them to give warnings and threats with wrath and punishment that would be meted out if they persisted in the religion of their ancestors, worshiped idols, and associated partners with Allah. Thus, there is no way for them to present reasons and arguments. That is the sunatullah that applies to every people. This is confirmed in another verse in the Qur'an as Allah says: The messengers were as heralds of glad tidings and warners, so that there would be no reason for humans to disobey Allah after the messengers were sent. Allah is Mighty, Most Wise. (an-Nisa'\/4: 165) And His words: Whoever does according to (God's) instructions, then indeed it is for his own (safety); and whoever goes astray, then the (loss) is for himself. And a sinner cannot bear another's sins, but We will not torment him until We send an apostle. (al-Isra'\/17: 15) One of the wisdoms of sending the apostles was to stem and reject the reasons that would be put forward by them. The wisdom of the revelation of the holy Qur'an is also to reject the excuses of those who would say that they do not believe because the divine book was only revealed to two groups, namely Jews and Christians, as the word of Allah swt: (We sent down the Al-Qur'an) so that you (not) say, \"The book was only revealed to two groups before us (Jews and Christians) and indeed, we do not pay attention to what they read.\" (al-An'am\/6: 156)"
		   },
		   {
			"id": 3300,
			"surah": 28,
			"ayat": 48,
			"tafsir": "This verse explains that when Muhammad was sent to the Quraysh who had never been visited by an apostle equipped with the holy Qur'an, they were arrogant, opposed, and showed heresy. They said, \"Why didn't he have miracles like the Prophet Musa who was given miracles, such as a stick becoming a snake, the sea was split open with the blow of his stick, his hands became white, shaded by clouds, and so on. Allah's Word: Then it may be you (Muhammad) ) want to leave some of what is revealed to you and your chest is narrow because of it, because they will say, \"Why did wealth (wealth) not be sent down to him or come with angels?\" Indeed, you are only a warner and Allah is the caretaker of all things. (Hud\/ 11: 12) The words of the Quraysh were answered that the rebellious and arrogant people at the time of Prophet Musa had denied the miracles given to Moses before. They even accused Musa and Harun of being two magicians who helped each other. Are the disbelievers Mecca will follow what the people of Prophet Musa did? Will they deny what Muhammad brought, and say that Moses and Muhammad were magicians? Would they not also believe in their treatises and miracles? Regarding the accusation that the two of them were magicians in this verse, Said bin Jubair, Mujahid, and Ibn Zaid argue that what is meant by \"the two of them were magicians\" were Musa and Harun. These were the words of the Jews at the beginning of the apostolate. Meanwhile, Ibn 'Abbas and al-Hasan al-Basri argued that what was meant by the two of them were the sorcerers, namely Musa and Muhammad, and this was the utterance of the polytheists of the Arab nation."
		   },
		   {
			"id": 3301,
			"surah": 28,
			"ayat": 49,
			"tafsir": "Allah ordered Muhammad to challenge the Meccan infidels who said that Moses and Muhammad were magicians, and the Torah and the Qur'an were mere magic, to bring a book from Allah that was more instructive and more beneficial than the two books. . The Prophet confirmed to them that he was willing to leave the Qur'an if they were true in their claim, and could actually bring the book in question."
		   },
		   {
			"id": 3302,
			"surah": 28,
			"ayat": 50,
			"tafsir": "This verse explains that if the polytheists could not fulfill the Prophet's challenge to bring a book from Allah that guaranteed happiness more than the Torah and the Qur'an, then that meant that their disobedience was really just mere impulses of lust, and following Satan's invitation. which is completely unreasonable. People who only follow their own desires and follow Satan's enticements without any guidance from Allah, are people who are very misguided, even the most misguided. Therefore, Allah forbids following lust because it will lead astray from the right path. Those who go astray from the way of Allah will receive a severe punishment, Allah says: (Allah said), \"O David! Indeed, We have made you the caliph (ruler) on earth, so give decisions (matters) among people fairly and do not you follow your desires, because it will lead you astray from Allah's path. Indeed, those who stray from Allah's path will receive a severe punishment, because they forget the day of reckoning.\" (shad\/38: 26) At the end of verse 50 it is emphasized that Allah will not guide people who are unjust and always abandon Allah's commands, violate His prohibitions, belie His messengers, follow the will of lust, and prioritize obedience to Satan than obedience to God. The wrongdoers will receive a very painful punishment in the hereafter. Allah's Word: So indeed, those (who are worshiped) have denied what you say, so you will not be able to reject (the punishment) and cannot (also) help (yourself), and whoever among you commits injustice, We will surely feel for him a great punishment. (al-Furqan\/25: 19) And His words: But the (existing) factions differ among themselves; so woe to those who are unjust because of the punishment on the Day of Judgment (Judgment). (az-Zukhruf43: 65)"
		   },
		   {
			"id": 3303,
			"surah": 28,
			"ayat": 51,
			"tafsir": "This verse explains that Allah revealed the Qur'an gradually, part by part according to the wisdom He has outlined, so that it is easy to read, remember, understand, and can strengthen the heart and strengthen faith. This is the answer to the request of the unbelievers who want the Al-Qur'an to be sent down all at once. Allah's Word: And those who disbelieve say, \"Why was the Qur'an not sent down to him all at once?\" Thus so that We strengthen your heart (Muhammad) with it and We recite it tartil (gradually, slowly and correctly). (al-Furqan\/25: 32)"
		   },
		   {
			"id": 3304,
			"surah": 28,
			"ayat": 52,
			"tafsir": "This verse explains that the People of the Book who believed in the Torah and the Bible, and met the prophethood of Muhammad, also believed in the Al-Qur'an. They found in their holy book the encouraging news about the Qur'an and the compatibility of the characteristics of the Qur'an with the characteristics described in their book. This is also explained in another verse: And indeed among the People of the Book there are those who believe in Allah, and in what has been revealed to you, and what has been revealed to them, because they are humble to Allah. (ali 'Imran\/3: 199) And His words: Those to whom We have given the Book, they read it as it should, they are the ones who believe in it. (al-Baqarah\/2: 121)"
		   },
		   {
			"id": 3305,
			"surah": 28,
			"ayat": 53,
			"tafsir": "This verse explains that when the Qur'an is recited to them, they acknowledge that the Qur'an is truly from Allah. In fact, they have justified it before it was sent down because they have found the characteristics of Muhammad and the characteristics of the Qur'an in their holy book. The belief of the People of the Book in the Qur'an has existed for a long time because their ancestors read descriptions of the characteristics of the Qur'an in their holy books. This custom has been passed down from generation to generation long before the Qur'an was revealed."
		   },
		   {
			"id": 3306,
			"surah": 28,
			"ayat": 54,
			"tafsir": "This verse explains that those who believe in the Qur'an after they have believed in the previous holy books, will be given a double reward. The reward for their belief in their holy books, and the reward for their belief in the Qur'an. It takes patience and fortitude to maintain their belief. The slander and trials that had to be faced were of course very heavy, they even received unfair treatment because they followed Muhammad and adhered to his religion. There are three kinds of people who get double the reward as explained in the words of the Prophet Muhammad: Three groups of people who are rewarded, each twice as much. A People of the Book who believes in his prophet, then he finds the period (Muhammad saw), then he also believes in him and follows him and confirms him then he will have two rewards. A slave who fulfills the rights of Allah 'Azza wa Jalla and the rights of his master, he will receive two rewards. And a person who has a female slave and then he feeds her, and gives her a good education, then he releases her and then marries her, then he will have two rewards.\" (Al-Bukhari history from Abu Musa al-Asy'ari). Apart from patience and fortitude, they also have several characteristics that make them close to Allah, including: 1. They reject evil with good. What they hear that hurts their heart, in the form of insults and so on, is not replied to but is greeted calmly and even forgiven. 2. They donate sustenance given by Allah to the right path. They also receive halal and good sustenance. They issue zakat, household expenses, donate for the construction of mosques, madrasas, recitation, training and maintenance of orphans, and so on. In His word: And spend (your wealth) in the way of Allah. (al-Baqarah\/2: 195) And His word: O you who believe! Spend some of the results of your good efforts k-fine. (al-Baqarah\/2: 267)"
		   },
		   {
			"id": 3307,
			"surah": 28,
			"ayat": 55,
			"tafsir": "This verse explains the third characteristic of those who draw near to Allah, that is, when they hear words that are not beneficial, both regarding the affairs of this world and the hereafter, such as insults, ridicule, and so on, they turn away and do not serve him. When they are treated harshly or hurt by word or deed, they do not reciprocate in kind. However, they faced him calmly and said, \"For us our deeds, you will not be rewarded nor will you be rewarded for them. As for your deeds, we will not demand anything from them, and will not try to repay them. Peace be upon you, we do not want to do as you do.\" Allah's Word: And those who do not bear false witness, and when they meet (people) who do unprofitable deeds, they pass by guarding their self-respect. (al-Furqan\/25: 72) It was narrated by Muhammad bin Ishak that he had visited the Prophet in Mecca more than twenty people from the Nasara Habasyah people after hearing news about him. They met the Prophet in the mosque, then they sat down together. Around the Kaaba at that time the figures of the Quraysh were sitting together. The Prophet then called on the Nasara Habasyah people to believe in Allah and read the Qur'an to them. After they heard the verses of the Qur'an, they burst into tears and spontaneously believed in Allah and believed in him and confirmed him. They knew that the characteristics they witnessed in the Prophet himself were the same as those described in their holy book. When leaving the Prophet Muhammad, they were intercepted by Abu Jahal bin Hisham and some Quraysh and they said, \"May Allah frustrate your intentions, you were sent by your friends only to find out Muhammad's personal characteristics and then tell them. However, the reality is you have been influenced and left your religion and confirmed what Muhammad said. We do not see any group more stupid than you.\" Hearing the sharp and sharp words of Abu Jahl bin Hisham, they replied, \"Goodbye to you, we will not retaliate and do evil to you. For us our deeds, and for you your deeds.\""
		   },
		   {
			"id": 3308,
			"surah": 28,
			"ayat": 56,
			"tafsir": "This verse explains that Muhammad could not make his people obey and adhere to the religion he brought, even though he tried his best. He is only obliged to convey and only Allah will guide those whom He wills. He who has deep wisdom and sufficient reason. This is also confirmed in other verses in the Qur'an. It is not your (Muhammad's) obligation to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272) And His words: And most people will not believe even though you really wanted to. (Yusuf\/12:103) At the end of this verse, Allah confirms that He knows better who are the people who are willing and deserving of that guidance. Among them are the People of the Book whose events have been narrated in the previous verses. On the other hand, for those who are not willing to accept guidance, such as some of the Prophet's relatives, guidance will not be given to them."
		   },
		   {
			"id": 3309,
			"surah": 28,
			"ayat": 57,
			"tafsir": "It was narrated by Ibn Jarir from Ibn 'Abbas that this verse was revealed regarding al-haris bin Uthman bin 'Abd Manaf when he and some other Quraysh came to the Prophet and they said to the Prophet, \"We already know that what you say is true. However, what prevents us from following your religion are the Arabs who will be hostile to us and expel us from our country, and we have no ability whatsoever to fight them.\" This verse explains that some Meccan polytheists put forward reasons that could not be accepted by a sound mind. They said, \"If we follow the instructions that Muhammad gave us, and the religion that was revealed to him, we are afraid that we will be expelled from our country. The polytheists and Arab national figures will also oppose us with violence while we are unable to fight them. .\" With this warning it appears that they are more afraid of creatures than God who created them. They never imagined the punishment that would be inflicted on them. They forget that they are in the Haram area which has been highly respected since ancient times, is safe and gets various kinds of sustenance and fruits. Do they think they will remain safe and prosperous in the secure area of the Haram if they remain in disbelief and polytheism? Not a few of them do not know and are aware of the favors and punishment of Allah that will be given to everyone according to their good and bad deeds. They should know that abundant sustenance comes from God. Therefore, it is He who should be feared and obeyed, not humans, creatures who are weak and lacking."
		   },
		   {
			"id": 3310,
			"surah": 28,
			"ayat": 58,
			"tafsir": "Many residents of the country who originally lived happily with abundant wealth, but because they always make damage and are not grateful for Allah's blessings, Allah destroyed their country and only a few of their houses remained. Whereas Allah will not destroy a land as long as the inhabitants of that land do good, Allah says: And your Lord will not destroy lands unjustly, as long as the inhabitants are people who do good. (Hud\/11: 117) After the people were destroyed, their place of residence became arid and no longer prospered, until the land returned to its true owner, namely Allah. Allah's Word: And Allah has made a parable (with) a land that was once safe and peaceful, sustenance came to it in abundance from all places, but (its inhabitants) denied Allah's favors, therefore Allah inflicted on them famine and fear , because of what they did. (an-Nahl\/16: 112)"
		   },
		   {
			"id": 3311,
			"surah": 28,
			"ayat": 59,
			"tafsir": "This verse explains that according to His sunna, Allah never destroys a city, unless he first sends an apostle to that city to read to its inhabitants Allah's verses which contain the truth. The apostle was assigned to call and warn them so that they would believe in Allah, but they did not heed it. Allah's Word: We will not punish before We send a messenger. (al-Isra'\/17: 15) After Allah sent messengers to guide the inhabitants of the city to the straight path, to guide the truth, but they continued to commit injustice and belied the apostles, denying His verses, then He will destroy the city it and its inhabitants. Mass destruction of the people as happened to the previous peoples did not happen to the people of the Prophet Muhammad. He is the last prophet sent to all the worlds, so that total annihilation will no longer occur. There is only partial or local destruction such as disease, natural disasters, earthquakes, tsunami waves, and so on. The sending of Muhammad as the last prophet means that Allah will not send any prophets or apostles after him. Meanwhile, the duties of preaching and the responsibility of giving warnings to the people rest on the shoulders of the clergy."
		   },
		   {
			"id": 3312,
			"surah": 28,
			"ayat": 60,
			"tafsir": "This verse explains that what God has given to humans, whether in the form of property or offspring, is only worldly pleasure. The life of the world with all its adornments does not necessarily guarantee their safety and happiness. On the contrary, the reward that is with Allah that is given to His obedient servants is better, because that is eternal and eternal. It is different from worldly pleasures which he worships because his time is very limited, and after that they run out and become extinct. Allah's Word: And what is with Allah is better for those who are devoted. (ali 'Imran\/3: 198) What is with you will vanish, and what is with Allah is eternal. (an-Nahl\/16: 96) And the life of this world is just fun and games. And verily the Land of the Hereafter is the real life, if only they knew. (al-'Ankabut\/29:64) While you (unbelievers) choose the worldly life, even though the hereafter is better and more lasting. (al-A'la\/87: 16-17) This verse closes with a question that is both a mockery and a warning from Allah. Why don't they want to use their reason, and think deeply so they know what is good and what is not. Do they think that the life of this world with all its pleasures which are ephemeral and can be enjoyed in a very short time is better than the life hereafter which is eternal and everlasting."
		   },
		   {
			"id": 3313,
			"surah": 28,
			"ayat": 61,
			"tafsir": "This verse begins with a question to make sure that the disbelievers consciously think and compare which one is better. Will those people who Allah promised if they obey and follow orders and stay away from His prohibitions will be blessed with favors in the hereafter that eyes have never seen, heard by ears, and never crossed someone's heart and they will actually get them in the hereafter. Which is better between people who obey Allah's commands and stay away from prohibitions and people who choose worldly pleasures but do not obey Allah's commands and do His prohibitions. According to common sense, of course the first group is better than the second group. This verse shows that disbelievers are given worldly pleasures, but in the hereafter are put into hell. Allah's Word: Indeed, Hell is the worst place to live and a place to live. (al-Furqan\/25: 66) While believers who are patient and steadfast in facing the various trials of the world, because they believe in Allah's promises, in the hereafter they will be admitted to heaven. Allah's Word: The inhabitants of heaven on that day are the best places to live and the most beautiful places to rest. (al-Furqan\/25: 24) The parable of paradise promised to those who are pious (is like a garden), rivers flow beneath it; always fruitful and shady. (ar-Ra'd\/13: 35)"
		   },
		   {
			"id": 3314,
			"surah": 28,
			"ayat": 62,
			"tafsir": "In this verse, Allah commands the Prophet (saw) to warn his people about the day when Allah will call those who lead astray and hinder people from Allah's way. Allah will say to them, \"Where are My partners? Where are the angels, jinn and idols that you consider My partners in the world? Can all of these deliver you from the punishment that befalls you?\" Certainly not. This was brought up simply as an insult to them. In line with this verse Allah says: And you really come to Us individually as We created you in the beginning, and what We have bestowed on you, you leave behind you (in the world). We do not see intercessors (helpers) with you whom you consider to be partners (to Allah). Verily, (all relations) have been cut off between you and what you used to think (partners with Allah) has disappeared from you. (al-An'am\/6: 94)"
		   },
		   {
			"id": 3315,
			"surah": 28,
			"ayat": 63,
			"tafsir": "This verse explains the answer of deceivers and invitees to disbelief who try to escape their responsibility to mislead others. They have been confirmed to receive wrath and have received threats from Allah with His words: I will certainly fill Hell with Jinn and humans together. (as-Sajdah\/32: 13) The inviters to disbelief eventually entered hell. They said, \"O our Lord, they are the ones we have led astray just as we have gone astray. We simply invite them and then they follow our misleading invitation of their own free will. There is no compulsion at all from us.\" When they are invited to believe in Allah, they do not pay any heed to it even though the invitation is the real invitation. Events like this are the same as events that will occur in the afterlife, namely the dialogue between Satan and humans who have been led astray, as Allah says: promised you but I violated it. I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, and you cannot help me. Truly I do not justify what you did associating me (with Allah) long ago.\" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) Satan's self-defense by saying that people who go astray obey his invitation with their own will, not pressure from him because he has no power over humans, is strengthened by God's word to Satan: Verily you (Iblis) have no power over My servants, except for those who follow you, i.e. people who go astray. (al-hijr\/15: 42) These misleading leaders claim that they are not responsible to Allah for the actions of their followers, on the grounds that they do not worship Him but idols. Incidents like this are mentioned in another verse, namely the word of Allah: (That is) when the people who are followed let go of the hands of those who follow, and they see the punishment, and (when) all relations between them are cut off. (al-Baqarah\/2: 166)"
		   },
		   {
			"id": 3316,
			"surah": 28,
			"ayat": 64,
			"tafsir": "In this verse it is explained that those who associate partners with gods and other gods in the world are ordered to call on their gods who are partners with Allah to reject the punishment that befalls them. When they called for him, the idols certainly couldn't answer because they were not the least bit helpless. This is done only to show their stupidity which is witnessed by all the inhabitants of the hereafter. Those who call and those who are summoned believe that they will be dragged to hell because of their sins, and they can no longer escape and run elsewhere, as Allah says: And those who sin see hell, then they suspect that they will fall into in it, and they found no place to turn from it. (al-Kahf\/18: 53) After witnessing the doom that would befall them, at that time they regretted that when they were still alive in the world they received guidance and believed in Allah. However, this assumption is only wishful thinking that is impossible to achieve."
		   },
		   {
			"id": 3317,
			"surah": 28,
			"ayat": 65,
			"tafsir": "After it was stated to them that their act of associating partners with Allah was misguided, then as an insult to their actions, in this verse they were asked about how they responded to the call of the apostles to rid themselves of idol worship, and invite them to believe in monotheism, oneness of Allah. They were silent in a thousand languages, unable to come up with the slightest reason in response to the statements made. They are confused do not know what to say. Hence, they asked each other, like people who were facing difficulties. They bowed their heads in shame and regret. If the apostles could not answer the questions put to them about the answers and responses of their people regarding their appeals to them, of course those who are misguided and misleading in the world who do not heed the calls of the prophets will be even more worried. Allah's Word: (Remember) on the day when Allah gathered the apostles, then He asked (to them), \"What is the answer (your people) to your (call)?\" They (the apostles) replied, \"We do not know (about it). Indeed, You are the Knower of all that is unseen.\" (al-Ma'idah\/5: 109)"
		   },
		   {
			"id": 3318,
			"surah": 28,
			"ayat": 66,
			"tafsir": "After it was stated to them that their act of associating partners with Allah was misguided, then as an insult to their actions, in this verse they were asked about how they responded to the call of the apostles to rid themselves of idol worship, and invite them to believe in monotheism, oneness of Allah. They were silent in a thousand languages, unable to come up with the slightest reason in response to the statements made. They are confused do not know what to say. Hence, they asked each other, like people who were facing difficulties. They bowed their heads in shame and regret. If the apostles could not answer the questions put to them about the answers and responses of their people regarding their appeals to them, of course those who are misguided and misleading in the world who do not heed the calls of the prophets will be even more worried. Allah's Word: (Remember) on the day when Allah gathered the apostles, then He asked (to them), \"What is the answer (your people) to your (call)?\" They (the apostles) replied, \"We do not know (about it). Indeed, You are the Knower of all that is unseen.\" (al-Ma'idah\/5: 109)"
		   },
		   {
			"id": 3319,
			"surah": 28,
			"ayat": 67,
			"tafsir": "No matter how many sins a person has, including associating partners with Allah which is the greatest sin, if he repents and returns to the truth, and worships Him, justifies His prophets, carries out His commands, and leaves His prohibitions, surely he is one of those who lucky and happy people in the hereafter. His evil was replaced by Allah with virtue. He got a gift and entered into heaven full of favors. He lives in it forever and ever, as Allah says: And those who do not associate partners with Allah with other gods and do not kill those whom Allah has made unlawful except for the right (reasons), and do not commit adultery; and whoever does this, surely he will receive a severe punishment, (namely) the punishment will be multiplied for him on the Day of Judgment and he will remain in that punishment, in humiliation, except for those who repent and believe and do good; then God replaced their evil with good. Allah is Forgiving, Most Merciful. (al-Furqan\/25: 68-70)"
		   },
		   {
			"id": 3320,
			"surah": 28,
			"ayat": 68,
			"tafsir": "This verse explains that Allah creates what He wills. He is the only one who has the authority to choose and determine things, both visible and invisible, as He says: Is it (appropriate) that Allah who created it does not know? And He is Subtle, All-Knowing. (al-Mulk\/67: 14) And His words: And do they not know that Allah knows what they hide and what they reveal? (al-Baqarah\/2: 77) Allah is All-Knowing of all His creatures, knows their circumstances, dispositions, and characteristics. Then He chooses from His servants which of them is entitled and reasonable to receive guidance and be appointed as an apostle who is able to carry out his duties. God's Word: God knows better where He places His apostolic task. (al-An'am\/6: 124) If Allah has determined something, then humans cannot choose according to their wishes. He must accept and obey what God has ordained. Allah's Word: And it is not appropriate for believing men and believing women, when Allah and His Messenger have established a decree, there will be (other) choices for them about their affairs. (al-Ahzab\/33: 36) This verse ends with an explanation that Allah is Most Holy and Most High of what they associate with. No one can hinder His choice and cancel His provision. However the desire and persistence of the Prophet Muhammad to give instructions to convert his uncle, Abu Talib, and however the desire and sincerity of the people of Mecca to send an apostle from among them, all of that failed and was not carried out. Only God's choices and provisions apply and come true."
		   },
		   {
			"id": 3321,
			"surah": 28,
			"ayat": 69,
			"tafsir": "This verse explains that what is hidden in the heart and what a person reveals, surely Allah knows it. His Word: It's the same (to Allah), who among you keeps his words secret and who is frank with him; and who hid by night and walked by day. (ar-Ra'd\/13: 10) And His word: He is God) who knows all that is unseen and all that is visible. Most High (Allah) from what they associate. (al-Mu'minun\/23: 92) (70) In this verse, Allah explains that He is the One and Only, no one has the right to be worshiped except Allah. It is He who knows everything and He also has power over it. He is the one who deserves to be praised for all His deeds, because He is the one who gives all the pleasures that we get both in this world and in the hereafter. All the rules and regulations outlined by Him must apply and be carried out. It is impossible to be contested because He is above all His creatures, the Most Just Judge, who determines and determines that what is right is right and what is wrong is wrong. To Him all things will be returned, says Allah: Only to Allah all matters are returned. (al-Anfal\/8: 44) On the Day of Judgment, each person is rewarded according to his deeds in the world. If you are good you will be rewarded with heaven, and if you are bad you will be rewarded with torment in hell."
		   },
		   {
			"id": 3322,
			"surah": 28,
			"ayat": 70,
			"tafsir": "In this verse, Allah explains that He is the One and Only, there is no one who has the right to be worshiped but Allah. It is He who knows everything and He also has power over it. He is the one who deserves to be praised for all His deeds, because He is the one who gives all the pleasures that we get both in this world and in the hereafter. All the rules and regulations outlined by Him must apply and be carried out. It is impossible to be contested because He is above all His creatures, the Most Just Judge, who determines and determines that what is right is right and what is wrong is wrong. To Him all things will be returned, says Allah: Only to Allah all matters are returned. (al-Anfal\/8: 44) On the Day of Judgment, each person is rewarded according to his deeds in the world. If you are good you will be rewarded with heaven, and if you are bad you will be rewarded with torment in hell."
		   },
		   {
			"id": 3323,
			"surah": 28,
			"ayat": 71,
			"tafsir": "In this verse, Allah commands His Messenger to ask those who associate partners with Him. If Allah were to make this night continuous all the time until the Day of Judgment without day to accompany it, would one of their offerings have power and be able to bring day to use its light? Do the polytheists not use their hearing? They seemed to be deaf. If they had used their reason as well as they could, they would have realized and realized and knew for certain that only Allah Almighty could bring night to replace day if they wished. He brings the day to wipe out the night when He wills and nothing else can do that. Allah's Word: And We made the night and the day as two signs (Our greatness), then We removed the sign of the night and We made the sign of the day bright. (al-Isra'\/17: 12)"
		   },
		   {
			"id": 3324,
			"surah": 28,
			"ayat": 72,
			"tafsir": "The content of this verse is the opposite of the previous verse. In this verse, Allah ordered His Messenger to ask the polytheists, if Allah made the day continue all the time until the Day of Judgment without alternating night with it, is there any god other than Allah who can bring on the night? Have they not noticed the signs of Allah's perfect power? It's as if they don't have a mind. If they had paid close attention, they would have come to the conclusion that there is nothing worthy of worship except God, who has given countless gifts and favors and has the power to make the day and night alternate to create a balance. Afternoon is made bright to seek sustenance with all existing abilities. Then the day disappears to be replaced by a night where the atmosphere is suitable for letting go and eliminating fatigue so that the energy and mind recover to seek sustenance the next day. Allah's Word: And He (also) makes the night and day alternate for people who want to take lessons or who want to be grateful. (al-Furqan\/25: 62) According to scientific studies, sunlight in physics is the emission of energy waves that produced from nuclear fusion and fission reactions that occur on the surface of the sun continuously. When this light is emitted continuously and for a long time it will generate heat. What will happen if there is continuous daylight until Doomsday? It is certain that the air and air from second to second, from minute to minute and from hour to hour will get hotter. Within 100 hours, air can reach temperatures above the boiling point of 100ÂºC. Hence, the oceans, lakes, rivers and so on would boil and bubble. Can you imagine what would happen if all the rivers, lakes and oceans boiled? Likewise, the blood that flows in our bodies also boils. Under such circumstances, not a single creature can live. Everything will die and disappear into flying dust. God also made the night a time of rest for humans. All of this is intended so that humans can imagine how great God's power is and also the protection He provides for the lives of every creature He creates, especially humans who are gifted with a perfect mind."
		   },
		   {
			"id": 3325,
			"surah": 28,
			"ayat": 73,
			"tafsir": "The alternation of day and night with their respective functions, namely the day is used to seek sustenance and the night is used to rest and relieve fatigue, so that the energy that has been used during the day is restored, is a great blessing from Allah which is priceless and must be grateful for. . The favors that are not grateful for will disappear, be revoked and withdrawn by Allah. On the contrary, the favors that are grateful for by making the best use of it in accordance with Allah's commands, will continue to increase. Allah's Word: And (remember) when your Lord announced, \"Indeed, if you are grateful, I will surely add (favors) to you, but if you deny (My favors), then My punishment will be very severe.\" (Ibrahim\/14: 7)"
		   },
		   {
			"id": 3326,
			"surah": 28,
			"ayat": 74,
			"tafsir": "This verse explains that on the Day of Judgment Allah will call the polytheists and say to them, \"Where are My partners whom you consider to be My partners in the world? Can they free you from the current state of affairs that you are in?\" Deliberately polytheists were called at that time to pledge a witness for their worship of other than Allah. This also aims to let them know that associating partners with Allah is the main cause for His displeasure, just as oneness with Him is the main cause for His pleasure."
		   },
		   {
			"id": 3327,
			"surah": 28,
			"ayat": 75,
			"tafsir": "Allah explains that on the Day of Judgment He will bring witnesses over every nation. Each apostle will be a witness for his own people, how far the welcome and acceptance of his people to the religion he brought from God. The Prophet Muhammad will also be a witness to his people later on the Day of Judgment, as Allah says: And what (the situation of the disbelievers will be), if We bring a witness (rasul) from every nation and We bring you (Muhammad) as a witness over them. (an-Nisa'\/4: 41) The polytheists on the Day of Judgment will be held accountable for their shirk deeds. They were also asked for information and reasons to justify their actions, which of course they could not state a single reason. It was then that they knew that they would be eternally punished in hell. God's Word: So I warn you with a burning hell, which only the most wretched people enter, who deny (truth) and turn away (from faith). (al-Lail\/92: 14-16) At that time, they will realize and believe that what Allah has explained through His prophet is the truth. Completely disappear from them everything that they used to create in the world, such as denying the apostles sent to them, associating partners with Allah, and so on."
		   },
		   {
			"id": 3328,
			"surah": 28,
			"ayat": 76,
			"tafsir": "This verse explains that Karun was part of the Prophet Musa's family, and was still counted as one of his uncles. Karun also has another name, namely \"al-Munawar\" (radiant) because of his handsome face. He read the Torah the most among his friends from the Children of Israel, only he was a hypocrite like Samiri. He was mistreated and arrogant towards his fellow Israelites. And if Allah extends sustenance to His servants, they will surely do extravagant things on earth, but He reduces it to the size He wants. Indeed, He is All-Seeing of (the condition of) His servants, All-Seeing. (asy-Syura\/42: 27) Abundant wealth and treasury of treasures that God gave him, so that the keys could not be carried by a number of strong people because of their weight, causing him to be very proud, abused, and arrogant towards each other and look down on them and contempt them. Ibn 'Abbas said that the keys to the treasure treasury could be carried by forty strong men. Even though he was warned by his people not to be too proud of his abundant wealth and accumulated wealth, because Allah does not like people who are proud, he did not pay any attention to it. He is still proud and arrogant. The warnings and prohibitions against being overly happy and proud of God's gifts are also confirmed in another verse, as He says: So that you do not grieve over what has eluded you, and do not be too happy about what He has given you. And Allah does not like every person who is proud and proud of himself. (al-hadid\/57: 23) Allah does not like people who are arrogant and proud of themselves. (an-Nisa'\/4: 36)"
		   },
		   {
			"id": 3329,
			"surah": 28,
			"ayat": 77,
			"tafsir": "In this verse, Allah explains four kinds of advice and guidance addressed to Karun by his people. People who practice the advice and instructions will get prosperity in this world and the hereafter. 1. People who are awarded by Allah with abundant wealth, treasury of treasures that are piled up, and many favors, he should make use of it in the way of Allah, obey and obey His commands, draw closer to Him to get as much reward as possible in this world and the hereafter. Word of the Prophet saw: Take advantage of the five before the fifth (his opponent) comes; your youth before your old age, your health before your illness, your wealth before your poverty, your free time before your busyness and your life before your death. (Al-Baihaqi history from Ibn 'Abbas) 2. Everyone is welcome not to give up the pleasures of the world at all in the form of food, drink, clothing, and other pleasures as long as they do not conflict with the teachings outlined by Allah. Both God, oneself, and family, have rights over someone who must be carried out. The words of the Prophet Muhammad: Do what people who think they will live forever do. And watch as if you're going to die tomorrow. (History of al-Baihaqi from Ibn 'Umar) 3. Everyone must do good as Allah has done good to him, for example helping people in need, connecting ties of friendship, and so on. 4. Everyone is prohibited from doing damage on earth, and doing evil to fellow creatures, because God does not like people who do damage."
		   },
		   {
			"id": 3330,
			"surah": 28,
			"ayat": 78,
			"tafsir": "This verse describes Karun's reaction to the advice and instructions given by his people. Arrogantly he said, \"The wealth that Allah has given me is because of the knowledge that I have. Allah knows that. Therefore, He is pleased with me and gave the treasure to me.\" Not a few people when they are in danger, they return to God, and pray wholeheartedly. All the prayers he knew were recited in the hope that the danger that befell him would go away. If his intention is achieved, he then forgets God who removed the danger from him. In fact, he admits that it happened because of his intelligence, because of the right calculations, and so on. Allah's Word: So when disaster strikes a person he calls to Us, then when We bestow Our favor on him he says, \"Indeed I was given this favor only because of my intelligence.\" Actually, it was a test, but most of them didn't know. (az-Zumar\/39: 49) Such a confession was rejected by Allah with His words, \"Did he forget or did he never know that Allah had destroyed the people before him, even though they were much stronger and had more treasures he had collected?\" .\" If Allah gave someone wealth and other things just because of the intelligence and kindness that is in him, so that Allah is pleased with him, surely He would not have destroyed the ancients who were much richer, stronger and smarter than Karun. Those whom Allah pleases will certainly not be destroyed by Him. Didn't he witness the fate of Pharaoh who had a large empire and many of his followers were destroyed by Allah in the twinkling of an eye. At the end of this verse, Allah confirms that if He wants to punish those who are wallowing in sin, He will not ask how many sins they have committed, as well as their type, because He is All-Knowing of all that. In another verse it is also emphasized as follows: So on that day humans and jinn will not be asked about their sins. (ar-Rahman\/55: 39)"
		   },
		   {
			"id": 3331,
			"surah": 28,
			"ayat": 79,
			"tafsir": "This verse explains that one day Karun came out into the midst of his people in magnificent clothes and extravagant jewelry in a procession complete with bodyguards, slaves, and nannies to show his height and greatness to people. Such a thing is the most despicable quality, the accursed pride of a man of reason and sound mind. This caused his people to be divided in two. First, people who are concerned with worldly life who always think and try their best how to live in luxury in this world. According to their opinion, such a life is happiness. They also hope to have what Karun has, namely abundant wealth and excessive wealth, because that is considered a great fortune. Thus they will live happily, and do whatever they want to feel the pleasures of the world with all its variations. Human desire like this until now still exists, even thrives in the midst of society. Everywhere we can see that not a few people are eager to own what rich people, big businessmen, and others have, such as big houses with luxurious furniture, luxury cars, land, and dozens of rice fields. tens or even hundreds of hectares. They do this even if they use an unnatural way, which is not in accordance with religious law and state regulations. This causes fraud and corruption everywhere."
		   },
		   {
			"id": 3332,
			"surah": 28,
			"ayat": 80,
			"tafsir": "This verse describes the second group of people who are knowledgeable and sane-minded. They consider that the way of thinking of people who belong to the first group is very wrong, even considered as a big disaster and a real loss, because they are more concerned with the life of this world than the eternal afterlife. The second group is of the opinion that the reward with Allah for those who believe in Allah and His messengers and do good deeds is far better than accumulating wealth. What is with Allah is eternal, while what belongs to humans will vanish and perish, as His word says: What is with you will perish, and what is with Allah is eternal. (an-Nahl\/16: 96) Verse 80 ends with an explanation that those who can receive and practice the advice from the verse above are only those who are patient and diligent in obeying Allah's commands, avoiding His prohibitions. They also take well what God has given them and spend it for the benefit of themselves and society."
		   },
		   {
			"id": 3333,
			"surah": 28,
			"ayat": 81,
			"tafsir": "In this verse, Allah explains the consequences of Karun's arrogance and arrogance. He and his house and all his splendor and wealth were sunk into the earth. Nothing can save him from the punishment of Allah, both individually and collectively. Karun himself was unable to defend himself. Not a few people have gone astray, and have misunderstood the treasure given to them. They think that wealth is only for splendor and pleasure so they do not channel its use in a way that pleases Allah. Therefore, Allah inflicted His punishment upon them."
		   },
		   {
			"id": 3334,
			"surah": 28,
			"ayat": 82,
			"tafsir": "This verse explains that people who originally aspired to have a respectable position and position as Karun had, immediately abandoned their aspirations after witnessing the punishment that befell Karun. They realize that many possessions and worldly life that is completely luxurious, do not lead them to the pleasure of Allah. He gives sustenance to those He wills, and does not give to those he does not want. Allah exalts and lowers those whom He wills. All of this is based on Allah's wisdom and the decrees that He has outlined. It was narrated from Ibn Mas'ud that Allah has given human beings their own character as He has distributed the sustenance among them. Verily, Allah gives wealth to those whom He likes, and does not grant faith except to those whom He likes and loves. They feel that they have received a gift from God because their goals have not been achieved. If this had been achieved, of course they would have been immersed in the earth as had been experienced by Karun. Their understanding has grown steadily that it is unfortunate for those who deny Allah's favors, belie His messengers, and the reward promised in the hereafter for those who obey Him. They will be annihilated by the doom, says Allah: And indeed, there came to them a messenger from their own (amongst), but they denied him, because of that they were overwritten by punishment and they were the wrongdoers. (an-Nahl\/16: 113)"
		   },
		   {
			"id": 3335,
			"surah": 28,
			"ayat": 83,
			"tafsir": "This verse explains that happiness and all the pleasures in the hereafter are reserved for people who are not arrogant, do not boast, and do not do mischief on earth, such as persecuting and so on. They are humble, know how to put themselves in front of people who are older and have more knowledge. To those who are younger and less knowledgeable, they are loving, not arrogant, and arrogant. People who are arrogant and arrogant are not liked by Allah, will receive a very painful punishment, and will not enter heaven in the hereafter, as Allah says: As for those who believe and do good, Allah will perfect their reward and increase a portion of their gifts -His. As for those who are reluctant (to worship Allah) and are arrogant, Allah will punish them with a painful punishment. And they will not get a protector and helper besides Allah. (an-Nisa'\/4: 173) Word of the Messenger of Allah: A person who has arrogance in his heart will not enter heaven, even if it is as big as a particle. (Muslim history and Abu Dawud from Ibn Mas'ud) Verse 83 concludes with an explanation that a good outcome in the form of heaven is obtained by those who fear Allah by practicing His commands, avoiding His prohibitions, not being arrogant and not arrogant like Pharaoh and Karun."
		   },
		   {
			"id": 3336,
			"surah": 28,
			"ayat": 84,
			"tafsir": "This verse explains that whoever in the hereafter comes with one good deed, will be rewarded with a better one, and multiplied as much as possible. No one knows how many it is except Allah as a gift and mercy from Him. Rasulullah saw said: Whoever intends to do a good deed, then does not do it, Allah records the reward on His side of a perfect deed, if he intends to do a good deed and then does it, then Allah records (reward) with all the good up to seven hundred times, even more times. (Al-Bukhari and Muslim from Ibn 'Abbas) In another hadith the Prophet said: And whoever intends to do a crime and then does not do it, then Allah SWT writes with Him a perfect good, and if he intends to do it later he did, then Allah recorded for him only one crime. (Al-Bukhari and Muslim from Ibn 'Abbas) This is in accordance with the word of Allah: And whoever brings evil, then their faces fall into hell. You are not rewarded, but (in proportion) to what you have done. (an-Naml\/27: 90)"
		   },
		   {
			"id": 3337,
			"surah": 28,
			"ayat": 85,
			"tafsir": "In this verse, Allah explains that it is He who made it obligatory for Muhammad to practice the contents of the Qur'an, and carry out the laws and orders contained in it. It was he who would return Muhammad to the holy land of Mecca, the land of his birthplace in a victorious state and reclaim it from the people who had driven him out of there. Muhammad saw returned to Mecca with a big victory for the Muslims, because then he could develop Islam freely and could suppress the will of the polytheists. This was a promise from Allah when Muhammad was always hurt and under heavy pressure from his people that he would emigrate to leave Mecca, and would return victorious. Apart from returning to Mecca, there are those who argue that Allah returned the Messenger to death or returned him to heaven, as Allah says: Say (Muhammad), \"O my people! Act according to your position, I will do (so). Later you will know, who will obtain the (best) place in the hereafter (later). In fact, those who are unjust will not be successful. (al-An'am\/6: 135)"
		   },
		   {
			"id": 3338,
			"surah": 28,
			"ayat": 86,
			"tafsir": "This verse explains that Muhammad never expected the Qur'an to be sent down to him to know the news of people before him, and things that happened afterward, such as religion that contains happiness for humans in this world and the hereafter, and also adab -adab that elevates their degrees and educates their minds. Even so, Allah revealed all of that to Muhammad as a mercy from Him. In this verse, Allah forbade the Prophet Muhammad and his people to help the struggle of the disbelievers in any form. Muhammad's people were demanded to help strengthen the struggle of Muslims. Therefore, let him praise his Lord for the favors bestowed on him by sending down the Holy Qur'an. The Prophet saw does not need to help and assist the polytheists who deny the Holy Qur'an, but let him separate himself and turn away from them according to the word of Allah: So convey (Muhammad) openly everything that is commanded ( to you) and turn away from the polytheists. (al-hijr\/15: 94)"
		   },
		   {
			"id": 3339,
			"surah": 28,
			"ayat": 87,
			"tafsir": "Allah advised Muhammad not to pay attention to the tricks of the disbelievers, and never to be influenced so that they succeeded in obstructing the transmission of the holy verses of the Qur'an after they were revealed to him. Allah is always with him and strengthens and wins His religion from the disbelievers. Even the Prophet was ordered to call his people to the path of Allah and convey His religion to them, worshiping only Allah alone who has no partner for Him. At the end of this verse, Allah emphasizes that Muhammad should never abandon his preaching, and always convey his message to the polytheists, so that he is not like them, committing acts of violating His orders. In another verse it is explained: And never enter into the group of polytheists. (al-An'am\/6: 14"
		   },
		   {
			"id": 3340,
			"surah": 28,
			"ayat": 88,
			"tafsir": "In this verse, Allah forbids the Prophet Muhammad from worshiping other gods besides Allah, because there is no god worthy of worship except Allah, as He says: (He is) the Lord of the east and the west, there is no god but Him, so make Him a protector. (al-Muzzammil\/73: 9) Allah is eternal even though all existing creatures have died and perished. God's Word: Everything on earth will perish, but the face of your Lord that has greatness and glory remains forever. (ar-Rahman\/55: 26-27) And the words of the Prophet Muhammad saw: The truest expression uttered by the poet is that spoken by Labid, namely: \"Know that everything other than Allah will perish.\" (Al-Bukhari and Muslim from Abu Hurairah) It is Allah who has the kingdom, and does what He wills. He is the one who determines everything that will apply to all creatures. To Him all will be returned, and rewarded according to their respective deeds. If he does good deeds, obeys, and obeys Allah's commands, he will be put into heaven. Conversely, if he commits immorality and wallows in sin, he will be put into hell. The Prophet said as narrated from Abu Hurairah: All my people will enter paradise except those who don't want to. Whoever obeys me, he will enter heaven, and whoever disobeys me, then indeed he has been reluctant. (Al-Bukhari's history from Abu Hurairah)."
		   }
	]
}
