{
	"tafseer": [
		{
			"id": 6205,
			"surah": 108,
			"ayat": 1,
			"tafsir": "In this verse, Allah explains that He has bestowed upon the Prophet Muhammad innumerable blessings and gifts which cannot be assessed for their high quality, even though (the polytheists) view these gifts as contemptible and do not value them due to their lack of reason and understanding. The gift is in the form of prophethood, true religion, instructions and the straight path that leads to happiness in life in this world and in the hereafter. The polytheists in Mecca and the hypocrites in Medina ridiculed and insulted the Prophet as follows: 1. The followers of Muhammad consisted of ordinary people who had no position. If the religion he brought was true, surely those who became his followers would be noble people who were among them. This remark is not an oddity, because Noah's people had previously stated this to Prophet Noah as the word of Allah: we don't see people following you, but people who are lowly among us who are quick to believe. We don't see you have any advantage over us, we even think you are liars.\" (Hud\/11: 27) It is sunnatullah that applies among Allah's servants that those who quickly accept the call of the apostles are ordinary people or weak people because they are not afraid of losing rank or position, because they do not have both. From that there was constant conflict between those who felt respected and the apostles, but Allah always helped His apostles and supported their da'wah. Such was the attitude of the inhabitants of Mecca towards the preaching of the Prophet Muhammad. Dignitaries and people in positions did not want to follow the Prophet because they hated him and the common people who followed him. 2. The people of Mecca when they saw the children of the Prophet Muhammad die, they said, \"The name Muhammad will disappear and he will die extinct.\" They thought that death was a drawback and then they mocked the Prophet and tried to keep people away from him. 3. The people of Mecca when they see a calamity or difficulty that befell the followers of the Prophet, rejoice and rejoice. They were waiting for the destruction of the followers of the Prophet, so that they would regain their former positions which had been shaken by the new religion. In this surahh, Allah conveys to His messenger, that the accusations leveled by polytheists are prejudices that have no meaning at all. But all of this is to cleanse the souls who can still be influenced by these issues and to break the deception of the polytheists, so that they know that the Prophet's cause will surely win and his followers will surely increase in number. Al-Kautsar is interpreted as a river in heaven that was bestowed by Allah to the Prophet Muhammad, and some are of the opinion that al-kautsar means a lot of goodness."
		   },
		   {
			"id": 6206,
			"surah": 108,
			"ayat": 2,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to perform prayers and slaughter sacrificial animals for Allah alone, because He alone educated him and bestowed His gifts on him. In another verse, Allah says: Say (Muhammad), \"Indeed, my prayer, my worship, my life and my death are for Allah, the Lord of the worlds, He has no partner; and that is what I have been ordered to do and I am the first to submit themselves (Muslims).\" (al-An'am\/6: 162-163)"
		   },
		   {
			"id": 6207,
			"surah": 108,
			"ayat": 3,
			"tafsir": "After Allah consoled and made the Prophet Muhammad happy and ordered him to be grateful for His gifts and as the perfection of His blessings, Allah made the enemies of the Prophet humiliated and helpless. Anyone who hates and abuses the Prophet will lose his influence and there will be no happiness for him in this world and in the hereafter. While goodness and the results of the struggle will remain victorious until the Day of Judgment. The Meccan disbelievers insulted the Prophet Muhammad not because they were displeased with the Prophet's personality, but because he denounced their stupidity and insulted the idols they worshiped and invited them to leave the worship of these idols. Truly Allah has kept His promise by humiliating and dropping the dignity of those who insulted the Prophet Muhammad, so that their names are only remembered when talking about bad people and their crimes. As for the position of the Prophet and those who received his instructions and their good names were raised as high as possible by Allah throughout the ages."
		   }
	]
}
