{
	"tafseer": [
		{
			"id": 1365,
			"surah": 10,
			"ayat": 1,
			"tafsir": "See the meaning of \"Alif Lam Ra\", in the description of \"mafatihus suwar\" in the first volume. Allah explains that the verses that are read are verses that are of high value, neatly arranged and solid, both in pronunciation and meaning, containing instructions for those who want to follow them. From these verses the surahs were composed and the Koran was compiled. In other words Allah explains the nature of the verses of the Koran. Alif Lam Ra, (this is) the Book whose verses are neatly arranged and then explained in detail, (which was revealed) from the side of (Allah) The Most Wise, The Most Observant. (Hud\/11: 1) From the arrangement of these verses it is understood that Allah commands people to know, study and remember the verses that serve as instructions, so that they can be understood and practiced."
		   },
		   {
			"id": 1366,
			"surah": 10,
			"ayat": 2,
			"tafsir": "Sabab Nuzul: Ibn Abbas stated that when Allah sent Muhammad as a messenger, the disbelievers denied him by saying, \"Allah is far more noble than making humans His messengers, like Muhammad.\" Then come down this verse. The Meccan infidels in particular and all the infidels in general were astonished and astonished why this revelation was revealed to an ordinary man like Muhammad, even to an orphan, not to a prominent person among them. Allah confirms with this verse, that it is their astonishment that is astonishing. Why should they be astonished that Allah has sent down the Quran to ordinary people. Regarding who is worthy and who is able to convey Allah's religion to all human beings, only Allah Himself knows best. Wealth, power, position and intelligence alone cannot be used as a reason to appoint someone to be a prophet and apostle. In fact, their attitude like this towards the apostles sent by Allah was also found in earlier humans to the apostles who were sent to them, as stated in the word of Allah. And are you surprised that there is a warning that comes from your Lord through a man from your own circle, to warn you and to be pious, so that you may receive mercy. (al-Araf\/7: 63) Their attitude in this way is because of the envy that has been buried in their hearts, no matter what evidence is put forward, they will not believe, so Allah sends down punishment on them. Allah said: And if We had made the messenger (from) an angel, We would have made him (in the form of) a male, and (thus) We would have surely made them remain in doubt as they are now in doubt. And indeed, some of the messengers before you (Muhammad) have been ridiculed, so that punishment descended on those who mocked it in return for their ridicule. (al-Anam\/6: 9-10) Allah explains the main duties of an apostle, namely: 1. To give warnings to people and explain to them about the oneness of Allah, there is a day of resurrection and a day of vengeance, there is a punishment from Allah for all those who do not follow His religion, the provisions, commandments, prohibitions of Allah, and so on. 2. Giving good news to those who believe, who follow the call of the Apostle, that they get a great reward from Allah, because they have done what is right and commendable. After the Arabs saw the enormous influence of the Koran on the souls and hearts of believers and their lives, they said that Muhammad was a sorcerer, and the Koran is magic. They call the Koran magic because the strong influence of the Koran on the hearts of believers is almost as great as magic, which can separate two people who were once brothers, between a person and their father, mother, wife and children. Because they really love Allah and His Messenger, it's as if their love is reduced to children, wives and so on. Believers believe that the Koran is not magic, nor is it something that can be used as a charm, but is a collection of Allah's instructions, explaining matters related to faith, the main points of law, morals, deeds good things that please God, ways to cleanse the body and spirit from all kinds of uncleanness, contain calls for happiness in life in this world and in the hereafter. Muhammad is the messenger of Allah who conveyed and taught the Quran to mankind. The Al-Quran is also a blessing and a miracle for Muhammad to strengthen his apostleship. Because Muslims really feel the benefits and guidance of the verses of the Al-Quran for themselves, and the truth of all that is in it. Therefore, they follow wholeheartedly, follow all the instructions that are very different from the directions of polytheism, imitate the morals of the Prophet Muhammad which are different from the morals of their ancestors, follow the customs of the Prophet which are different from the customs of their ancestors. They also love people who believe more than other people, even if those other people are their parents and so on. Thus the unbelievers assume that people who believe have been bewitched by Muhammad and they regard Muhammad as a sorcerer."
		   },
		   {
			"id": 1367,
			"surah": 10,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains that it is He who regulates the journey of the planets and other celestial bodies, so that they do not collide with each other. He is also the one who created the earth and everything in it, from the smallest to the biggest, all of which were created in six periods which only Allah Himself knows how long those six periods mean. After creating the heavens and the earth, He resides on the Throne, and from this Throne He governs and takes care of all His creatures. When Rasulullah saw was asked about the Throne, he said: The Prophet said, \"In the past, Allah existed, and there was nothing before Him and His Throne was on water, then He created the heavens and the earth, and wrote everything in Lauh Mahfudh .\" (Al-Bukhari's history in the Book of at-Tawhid) Furthermore, Allah explains other evidence that refutes the opinion of the disbelievers that the Koran is magic, that is, He owns and controls everything with unlimited power. He can do according to what He wills. There is not any creature \"even though he is an apostle or angel\" can provide intercession except with His permission. What is meant by \"intercession\" here is the help of angels, prophets and pious people to humans on the Day of Judgment to get relief or freedom from Allah's punishment if Allah orders or allows it. This verse refutes the accusations of the disbelievers that the idols they worship besides Allah can intercede for them on the Day of Resurrection. This is confirmed by the word of Allah: And how many angels are in the sky, their intercession (help) is of no use except when Allah has permitted (and only) for whom He wills and is pleased with. (an-Najm\/53: 26) The intercession that is most beneficial to a servant is the intercession given by the Prophet Muhammad, to someone whose heart and soul acknowledges the oneness of Allah. Abu Hurairah asked the Messenger of Allah about this, then the Messenger of Allah replied: The happiest people with my intercession on the Day of Judgment are those who say: \"La ilaha illallah\" arising from a clean heart and soul.\" (Al-Bukhari History) from Abu Hurairah) Allah confirms to the disbelievers, do they not remember and do not pay attention to these proofs and clear proofs, that the creator of this world is Allah himself, He who arranges all affairs from above His Throne, and He who intercedes for those whom He wills. That is God who must be worshiped, there is no other god besides Him. Do not associate anything with Him, neither in the creation of the heavens and the earth, nor in His worship. Even if people The Jahiliyah admit that it is Allah who created this world, they do not partner with anyone, but they associate Allah with others in worshiping Him. ah idols beside worshiping God."
		   },
		   {
			"id": 1368,
			"surah": 10,
			"ayat": 4,
			"tafsir": "Only to Allah all humans return after death and after the disappearance of this mortal world, not to something else, such as idols, which are considered as helpers for unbelievers. That is God's promise to His creatures. He will not break His promise in the slightest. As proof that Allah surely keeps His promises, He created the first creatures. The creation of humans by Allah for the first time can be used as a postulate that Allah also has the power to create His creatures for the second time and resurrect them. Repeating the creation of something is easier than creating something the first time. Allah says: And it is He who began creation, then repeats it again, and it is easier for Him. (ar-Rum\/30: 27) So strong is the evidence put forward by Allah regarding the day of resurrection, that He stated that if there are people who deny it, it means that they have forgotten what happened to themselves. Allah says: And if man does not see that We created him from a drop of semen, he turns out to be a real enemy! And he makes parables for Us and forgets their origin; he said, \"Who gives life to the bones, which are shattered?\" (Yasin\/36: 77-78) Against those who do not want to believe in the existence of the resurrection day even though arguments have been presented to them, Allah threatens them with Hellfire, as illustrated by the following verse: So by your Lord, indeed, We will certainly gather them together with Satan, then We will certainly bring them around Jahannam on their knees. (Maryam\/19: 68) Allah explains that the purpose of humans being resurrected after death is to give them a reward for the deeds they have done in accordance with the just and gracious nature of Allah. Allah does not reduce in the least what they have done. This aim is explained by Allah's word: We will set the scales right on the Day of Judgment, so that no one will be harmed even a little bit; even if it is only the weight of a mustard seed, We will certainly bring it (reward). And it is sufficient for Us to make calculations. (al-Anbiya\/21: 47) Allah gives fair vengeance, does not mean that Allah will not exaggerate the reward He will give, He will even multiply it, as stated in His word: As for those who believe and do good , Allah will complete the reward for them and increase some of His bounty. As for those who are reluctant (to worship Allah) and are arrogant, Allah will punish them with a painful punishment. And they will not get a protector and helper besides Allah. (an-Nisa\/4: 173) If you see that there are many unfair actions committed by some humans against others, and evil deeds overshadow good deeds in the world, and so on, surely there must be a time in the future when justice can be upheld perfectly. Unbelievers who deny the oneness of Allah and the existence of the Day of Resurrection, they will get appropriate retribution for the crimes they have committed. Among other things they were given to drink with scalding hot water which destroyed their intestines. Besides that they will get a painful punishment because of their disbelief."
		   },
		   {
			"id": 1369,
			"surah": 10,
			"ayat": 5,
			"tafsir": "This verse explains that Allah created the heavens and the earth and who resides on His Throne. He is the one who makes the sun shine and the moon shine. The sun with its rays is a source of life, a source of heat and energy that can move God's creatures that He created. With light humans can walk in the dark of night and do activities at night. This verse distinguishes between the light that the sun gives off and that that is reflected by the moon. What is emitted by the sun is called \"dhiya\" (light), while what is reflected by the moon is called \"nur\" (light). (Nuh\/71: 16) From these verses it is understood that the sun emits light that comes from itself, just as a lamp emits light from itself, namely from the fire that burns the lamp. It's different with the moon, whose light comes from the reflection of the light emitted by the sun onto its surface, then the light is reflected back in the form of light to the earth's surface. The sun and the moon are two celestial bodies which are mentioned a lot in the Quran. The word moon is found in 27 verses and the sun is mentioned in 33 verses. Often these two objects are mentioned together in one verse. A total of 17 verses mention the sun and the moon together. Usually verses that mention the sun and moon together are verses that explain the kauniyah aspects of these two celestial bodies. In 3 verses, these two celestial bodies are mentioned together with stars, other celestial bodies. Verse 5 of surahh Yunus above is an example of a verse which mentions the sun and the moon together. This verse hints at three important aspects of the creation of the sun and moon. First, in this verse Allah calls the sun and the moon by different names. Even though these two celestial bodies both emit light to the earth, the name of the light from the two is always called differently. In this verse, the sun is called dhiya and the moon is called nur. This is to distinguish the nature of the light emitted by these two objects. Today, science has shown that sunlight comes from nuclear reactions that produce very high heat and bright light. Meanwhile, the moon's light only comes from the reflection of sunlight reflected by the surface of the moon to the earth. These different terms show that the Al-Quran is indeed from Allah the Creator, because at the time the Al-Quran was revealed, human knowledge had not yet reached this kind of understanding. In another verse, the sun is referred to as siraj (lamp) and the moon is referred to as munir (shining bright). Glory be to Allah who made in the sky clusters of stars and He made them siraj (sun) and a shining moon (al- Furqan \/ 25: 61) And Allah created the moon as light and made the sun a lamp (bright) (Nuh \/71: 16) More explicitly in another verse the sun is referred to as siraj and wahhaj (bright burning). And We built above you seven solid (heavens), and We made a very bright lamp (sun). (an-Naba\/78: 12-13) Second, an affirmation from Allah that the sun and moon are always in a certain orbit (wa qaddahu manazila). This orbit is subject to the law that Allah has made, namely the law of gravity which says that there is an attractive force between two objects that have mass. The magnitude of this attractive force is directly proportional to the masses of the two objects and inversely proportional to the distance between them. It was Newton who formulated the law of gravity in the 18th century. Calculations using the law of gravity have succeeded in accurately calculating the orbits traversed by the moon when it revolves around the earth, and the earth when it revolves around the sun. This law of gravity is what Allah meant when He said in surahh al-Araf\/7: 54: \"... (He created) the sun, moon and stars subject to His commands¦.\" The sun, moon and stars are subject to God's provisions, namely the law of gravity that controls the motion of objects. In various other verses it is often stated that it is Allah who has subjected the moon and sun to humans (See for example surahh ar-Rad\/13: 2, Ibrahim\/14: 33, an-Nahl\/16: 12, Luqman\/31: 29, Fathir\/35: 13, az-Zumar\/39: 5). What is meant is that it is Allah who has ordained that the sun and the moon and the stars are subject to the laws of gravity that He has established. Third, Allah's stipulation regarding the regular orbit of the moon and sun is intended so that people know the calculation of the year and the science of reckoning (litalamu adad as-sinina walhisab). You can imagine, if the moon and the sun were not in a regular orbit, or in other words, they circulated randomly, how could we calculate how long one year or one month would last? Glory be to Allah, the Most Merciful, who has determined everything for the convenience of humans. This is also explained by the word of Allah: Glory be to Allah who made the clusters of stars in the sky and He also made the sun and moon shine in them. (al-Furqan\/25: 61) In essence and its use there is a difference between sunlight and moonlight. Sunlight is harsher than moonlight. The sunlight consists of the seven basic colors although in their entire form they appear to be white, while the moonlight is gentle and evokes serenity to those who see and feel it. So are its uses. Sunlight as mentioned above is the source of life and life, the source of power and energy movement. While the moonlight is an extension at night. There are countless uses and benefits of sunlight and moonlight for God's creatures in general, and for humans in particular. All of this can actually be used as evidence for the existence of God Almighty for people who want to use their minds and feelings. Allah explains that He has determined the orbit of the moon and determined the manzilah (places) for His journey. Every night, the moon passes through a manzilah. From the first manzilah to the last manzilah it takes between 29 or 30 nights or is called one month. In that month the moon can only be seen for 27 or 28 nights, while on other nights the moon cannot be seen, as Allah says: And We have determined the place of circulation for the moon, so that (after it has reached its final place of circulation) it returns like the shape of old bunches. (Yasin\/36: 39) The meaning of this verse is that at the beginning of the month it is small in the shape of a crescent, then after going through the manzilah it increases in size until it becomes a full moon, after that it returns to a small size, and becomes smaller which looks like a curved bunch. eventually disappearing and reappearing at the beginning of the month. Allah says: The sun and the moon revolve according to calculations. (ar-Rahman\/55: 5) Allah created the moon and made it circulate through the orbits in His manzilah so that humans could easily know the number of years, calculating time, calculating months, determining days, hours, seconds and so on, so that they can discard plans for themselves, for their families, for society, for their religion and other plans related to life and life as members of society and as servants of God. Allah says: And We made the night and the day as two signs (Our greatness), then We abolished the signs of the night and We made the signs of the day bright, so that you (can) seek bounty from your Lord, and so that you know the number of years and reckoning ( time). And We have explained everything clearly. (al-Isra\/17: 12) By knowing the calculation of the year, time of day and so on, humans can determine prayer times, fasting times, times to perform the pilgrimage, time to go down to the fields, and so on. Allah creates a shining sun and a luminous moon that is beneficial to life and the lives of all creatures that are based on reality, necessity, and have high wisdom. And Allah explains the signs of His power to those who are willing to use their minds correctly and to those who are willing to acknowledge the facts and have faith based on the evidence they have obtained. In other words, these signs of Allah's power and greatness will not be of any use to those who do not want to seek the truth, whose hearts are filled with envy and fanaticism for the beliefs they have embraced."
		   },
		   {
			"id": 1370,
			"surah": 10,
			"ayat": 6,
			"tafsir": "In this verse Allah explains other signs of His power, namely the change of night and day, although the change with the meaning of the change of night and day is caused by the rotation of the earth around its axis. The difference in the length of the night and day is caused by the location of a place on the earth's side, which is caused by the shift in the earth's axis and twenty-three and a half degrees from the rotation of the path (orbit) and the earth's circulation around the sun. In addition to the rotation of the night and day, in this verse Allah also explains that among the signs of His power is that Allah creates in the heavens and on earth various objects, such as liquids, solids, air, plants and animals, thunder, lightning, wind, all of that is evidence and a sign of the greatness and power of Allah, for those who want to fear Him."
		   },
		   {
			"id": 1371,
			"surah": 10,
			"ayat": 7,
			"tafsir": "These verses explain that the reason for people who do not believe in a meeting with Allah in the hereafter where all deeds will be weighed fairly, is because they love worldly life more and are willing to exchange the pleasures of life in the hereafter for the pleasures of life in this mortal world. This. It is also because they are influenced by worldly delights, as well as people who are negligent and do not heed the verses of the Qur'an, and do not want to study, understand and practice it, then their place will be hell in Jahannam. The punishment for such punishment is because of the sins they have committed while living in the world, and the reward is commensurahte with their actions. This verse mentions two kinds of human attitudes and actions that cause them to go to hell, namely: 1. Not believing in life after death, because they have been influenced by worldly pleasures. 2. Not heeding the verses of the Koran. Not believing in life after death, to meet Allah, means not believing in Allah's justice and His compassion for His servants. Such people are usually people who think that everything they have obtained is solely due to their own efforts, not as a mercy and gift from God; as if he is the one who determines everything. Such characteristics can lead to atheistic beliefs which argue that God does not exist, only humans themselves create everything. This is very contrary to the main principles of the Islamic creed. Likewise, not heeding the verses of the Koran means not believing that the Koran is the book of Allah which was revealed to the Prophet Muhammad, the last prophet, and also not believing that the book can be a guide for humans in navigating the ark of life in the world to achieve eternal life in the afterlife. Belief in the existence of life after death, and the Koran is the book of Allah revealed to Muhammad, is the main subject of Islamic teachings. To deny the two main teachings is to deny the teachings of Islam. That is why Allah threatens with severe sanctions in the form of the punishment of hell in Jahannam against those who deny Him."
		   },
		   {
			"id": 1372,
			"surah": 10,
			"ayat": 8,
			"tafsir": "These verses explain that the reason for people who do not believe in a meeting with Allah in the hereafter where all deeds will be weighed fairly, is because they love worldly life more and are willing to exchange the pleasures of life in the hereafter for the pleasures of life in this mortal world. This. It is also because they are influenced by worldly delights, as well as people who are negligent and do not heed the verses of the Qur'an, and do not want to study, understand and practice it, then their place will be hell in Jahannam. The punishment for such punishment is because of the sins they have committed while living in the world, and the reward is commensurahte with their actions. This verse mentions two kinds of human attitudes and actions that cause them to go to hell, namely: 1. Not believing in life after death, because they have been influenced by worldly pleasures. 2. Not heeding the verses of the Koran. Not believing in life after death, to meet Allah, means not believing in Allah's justice and His compassion for His servants. Such people are usually people who think that everything they have obtained is solely due to their own efforts, not as a mercy and gift from God; as if he is the one who determines everything. Such characteristics can lead to atheistic beliefs which argue that God does not exist, only humans themselves create everything. This is very contrary to the main principles of the Islamic creed. Likewise, not heeding the verses of the Koran means not believing that the Koran is the book of Allah which was revealed to the Prophet Muhammad, the last prophet, and also not believing that the book can be a guide for humans in navigating the ark of life in the world to achieve eternal life in the afterlife. Belief in the existence of life after death, and the Koran is the book of Allah revealed to Muhammad, is the main subject of Islamic teachings. To deny the two main teachings is to deny the teachings of Islam. That is why Allah threatens with severe sanctions in the form of the punishment of hell in Jahannam against those who deny Him."
		   },
		   {
			"id": 1373,
			"surah": 10,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains the good rewards and rewards that those who believe and do good will receive in the hereafter, that is, they will be given a glorious place in the form of a paradise full of enjoyment. Faith and good deeds are two things that are very closely related, one with the other intertwined and intertwined. Very many verses of the Al-Quran that explain the closeness of this relationship. Faith is belief and belief in the existence of God Almighty, Creator and Owner of the universe, Most Compassionate, Most Merciful to His servants. Because of the nature of the Most Merciful and Most Merciful that is in Him. He bestows guidance and guidance on human beings so that they can live happily in this world and in the hereafter. This guidance is recognized by believers as guidance from Allah, the manifestation of which is as stated and given examples in the Al-Quran and the hadiths of the Prophet. So the good deeds done by a Muslim are a manifestation of his faith, or in other words, a person who has professed faith, of course he likes to do good deeds. It is impossible for someone who has faith not to do it. This faith and good deeds are the reason why humans live happily in the world, and are rewarded by Allah in the form of heaven in the hereafter. Thus, they have reached the highest level of spiritual life."
		   },
		   {
			"id": 1374,
			"surah": 10,
			"ayat": 10,
			"tafsir": "This verse describes three parables of the life of believers in heaven. The three parables illustrate the high level of spiritual life that they have achieved. The descriptions are: 1. Their prayer begins by saying, \"Subhanaka Allahumma\" 2. Their salutation is \"Salam\". 3. The end of their prayer is, \"Alhamdulillah Rabbil Â'lamin\". Prayer is a request made to the Most High, wholeheartedly with words full of respect, because it feels the majesty of the place to ask. The acknowledgment of Allah's majesty is expressed by the words \"subhanaka Allahumma\" (Glory be to You, O Allah). This sentence gives the sense that Allah is One, only He alone has the right to be worshiped, who has the right to be glorified. Every creature must serve Him forever, both in this world and in the hereafter. Creatures like this are entitled to eternal happiness and enjoyment as well. Their greeting of respect is \"greeting\" which means to be prosperous and safe from being disliked and desired. They have always said this greeting of respect while living in the world. In surahh al-Ahzab\/33: 44 it is explained that \"salam\" is also a greeting spoken by Allah to those who believe when they first meet Allah in the hereafter. Allah says: Their honor (the believers) when they meet Him is, \"Salam,\" and He has prepared a glorious reward for them. (al-Ahzab\/33: 44) This greeting of respect was also spoken by the angels to them, when they first entered heaven. Allah says: And those who fear their Lord will be ushered into paradise in groups. So that when they reach it (heaven), and its doors have been opened, the guards say to them, \"Prosperity (spoiled) upon you, be happy you! So enter, you are eternal in it.\" (az-Zumar\/39: 73) And it is in this respect that fellow believers in heaven say. Allah says: In it they do not hear words that are useless, except (saying) greetings. And in it for them is sustenance morning and evening. (Maryam\/19: 62) The height of spiritual life reached by believers in heaven will also be understood from every closing prayer and request that they make to Allah, namely \"Alhamdulillahi Rabbil Â'lamin\" (Praise be to Allah, God of the universe). This speech is also spoken by believers when they first enter heaven. Allah said: And they said, \"Praise be to Allah who has fulfilled His promise to us and has given us this place while we (are allowed) to occupy paradise wherever we want.\" Then (heaven is) the best reward for those who do good deeds. (az-Zumar\/39: 74) And this is also what the angels say when they are around the Throne. Allah said: And you (Muhammad) will see angels circling around the Throne, glorifying and praising their Lord; then a decision was given between them (servants of Allah) fairly and it was said, \"Praise be to Allah, Lord of the worlds.\" (az-Zumar\/39: 75) From this verse it is understood that it is obligatory for every believer to purify his soul and cleanse himself. The way to purify the soul and cleanse oneself is by worshiping Allah, controlling lust and directing it to do good deeds and pious deeds. It is not purifying oneself by using intermediaries, such as intermediary for people who are considered sacred and so on, or expecting intercession from them. Even such actions can lead to polytheism. Allah says: (The reward from Allah) is not your wishful thinking and it is not (also) the wishful thinking of the People of the Book. Whoever does evil, surely he will be rewarded according to the crime and he will not find a protector and helper besides Allah. (an-Nisa\/4: 123) The three kinds of parables of high spiritual life obtained by the experts in heaven should always be accustomed to and practiced by believers as long as they live in the world so that they will obtain eternal happiness as well."
		   },
		   {
			"id": 1375,
			"surah": 10,
			"ayat": 11,
			"tafsir": "One of human nature and character, is to want everything that will happen to him to be accelerated or hastened, be it in the form of punishment or harm, good or reward. Whereas, they already know that everything happens by the will of Allah, in accordance with His laws and in accordance with His decrees and regulations. Allah says: ... They are just waiting (to come into effect) the provisions of the former people. Then you will not get changes to Allah's provisions and will not (also) find deviations from Allah's provisions. (Fathir\/35: 43) And the word of Allah: (Thus) Allah's law that has been in effect since long ago, you will never find any change in Allah's law. (al-Fath\/48: 23) In other verses of the Koran, human haste is explained, as Allah says: And man (often) prays for evil as (usually) he prays for good. And indeed humans are hasty. (al-Isra\/17: 11) And the word of Allah: Man was created (to be) hasty. Later I will show you My signs (power). So don't ask Me to hasten it. (al-Anbiya\/21: 37) The hasty nature of wanting to get goodness and pleasure from humans is because of their desire to benefit from something in a short time, even though they know that everything has a process. The process requires strong determination\/intention, patience and tenacity. It is impossible for them to achieve a pleasure, but they do not try to achieve it by following the conditions for the attainment of something. Another case with the human desire to experience a torment, danger or disaster. This desire arises because of their stupidity, disbelief, disobedience, and their denial of the Prophet Muhammad or because they want to make fun of something they don't want, or because of their anger and hatred towards something and so on, as happens to people who despair in his life, so he begged death for himself. Likewise the disbelievers who did not want something that was conveyed by Allah's Apostle, then asked for proof by immediately bringing the punishment promised to them. Their wishes and requests were answered by Allah emphatically through His word in this verse, that is, if Allah wants to allow people's prayers and requests, that punishment befalls them or a calamity, in accordance with the requests they submit solely out of stupidity or want weaken the prophetic evidence that was conveyed to them, as the polytheists of Mecca had asked for, of course Allah would immediately grant it and that would be very easy for Allah. This request was often made by the polytheists of Mecca to the Prophet Muhammad who conveyed Allah's religion to them. They ask what is not appropriate to the Prophet, such as asking for punishment to come to them as was brought to the nations in ancient times, asking for the coming of the Hour and so on, as Allah says: And they ask you to hasten (the arrival of) torment, before (they ask for ) goodness, even though there have been various examples of torment before them. Truly, your Lord truly has forgiveness for mankind for their injustice, and indeed, your Lord is severe in punishment. (ar-Raad\/13: 6) And the word of Allah: And they ask you to send down punishment immediately. Had it not been for the appointed time, the punishment would have come to them and (the punishment) would have come to them suddenly, while they were not aware of it. (al-Ankabut\/29: 53) Even those polytheists, because they really disobeyed the Qur'an, dared to pray that punishment would be hastened upon them if what Muhammad conveyed was true. Allah said: And (remember,) when they (the polytheists) said, \"O Allah, if this (Qur'an) is true (revelation) from You, then shower us with stones from the sky, or bring us a terrible punishment. sore.\" (al-Anfal\/8: 32) The polytheists who deny the existence of the Doomsday, challenged the Messenger of Allah to hasten the Doomsday, as Allah says: People who do not believe in the Doomsday ask for it to happen immediately, and people -those who believe are afraid of him and they are sure that the Last Hour is true (will happen). Know that in fact those who argue about the occurrence of the Doomsday have really gone astray. (asy-Syura\/42: 18) The purpose of the polytheists asked the Prophet Muhammad to bring the promised punishment immediately, not only because they did not believe in him, but also to refute and weaken hujjah and proof of prophethood, ridicule verses -the verses of the Koran that were conveyed to them and to tell the Prophet Muhammad that they really denied all kinds of things that he conveyed to them. Sometimes among them there are those who believe in the Prophet, but jealousy of Muhammad and fanaticism for the religion of their forefathers has caused them to continue to deny it. From this verse it is understood that Allah will not accept their prayers and requests, and does not want their destruction as has been experienced by past people, but Allah is Most Gracious, Most Merciful to them. Muhammad was sent as the last prophet and messenger to all mankind as a mercy to all nature. Therefore God always gives them the opportunity to repent. If they persist in their denial and disbelief until they die, then Allah will punish them with a painful doom. Allah will not bring punishment to them in this world as has been done to the peoples of the past, because if Allah had punished them, they would all have been destroyed, and this destruction would also befall those who believe who live and live in between them, as Allah says: And if Allah punishes human beings for their injustice, surely He will not leave anything (on earth) even from creatures that crawl, but Allah postpones them until an appointed time. So when their death comes, they cannot ask for a moment's delay or acceleration. (an-Nahl\/16: 61)"
		   },
		   {
			"id": 1376,
			"surah": 10,
			"ayat": 12,
			"tafsir": "In these verses, Allah explains another human character, that is, when harm, calamity or difficulty befalls them, they remember Allah and pray to Him, whether lying down, sitting or standing, so that all these harms are avoided and removed from them. . On the other hand, if the danger of misery and hardship has disappeared and they have enjoyed Allah's mercy, favors and gifts, then gradually they forget the giver of these blessings and gifts, and they even begin to disbelieve in Allah. This verse shows man's weaknesses when he receives trials from Allah, and also shows man's dependence on the grace and gifts of God, the Creator and Who Rules his life. Therefore let those who believe remember and do not forget the Creator and Supervisor, both in a state of difficulty and danger, as well as in a state of relief and joy. All of that is God's trial to His servants to test the strength of their faith. People who succeed in overcoming all the trials they experience both in the form of difficulties and pleasures, they are the ones who are entitled to eternal happiness in this world and in the hereafter. People who transgress the limits and people who go astray like the polytheists of Mecca are people who have been turned away by satan. Satan has made them look good at the bad deeds they have done, so that when the danger is gone they will return astray and disobey God."
		   },
		   {
			"id": 1377,
			"surah": 10,
			"ayat": 13,
			"tafsir": "This verse was originally addressed to the Meccan infidels who always made fun of the Prophet Muhammad, but also included all human beings who behaved and acted as the Meccan infidels had done. The ancient peoples were completely destroyed because of tyranny, disbelief, and denial of the apostles and prophets that Allah had sent to them. Even though the apostles and prophets had spread the path of truth, which if they followed it would lead them to a place full of happiness. People used to be destroyed by Allah, because of their injustice as stated in His word: And (the inhabitants of) the land We have destroyed when they were unjust, and We have set a certain time for their destruction. (al-Kahf\/18: 59) Allah confirms that the unjust and unjust people will surely be subject to a very painful punishment. Allah says: And there is not a land (the inhabitants of which are rebellious), but We destroy it before the Day of Judgment or We punish (its inhabitants) with a very severe punishment. That has been written in the Book (Lauh Mahfudz). (al-Isra\/17: 58) There are two types of punishment that Allah has ever inflicted on the ancients because of their negligence and tyranny, namely: 1. By destroying all those who belied the apostle and who committed injustice, as He had inflicted to the people of Â'd, samud, the people of Noah and so on. 2. Bringing doom in the form of damage, chaos in society and so on, as Allah says: And how many (people) of unjust lands We have destroyed, and We have made other generations after them (as replacements). (al-Anbiya\/21: 11) Damage and chaos in society occurs because of the many corrupted individuals, excessive luxuries, likes to live extravagantly, indulge in lust, corrupt morals and so on which results in the weak group among the they are under the rule of a powerful faction. However, if they belied the apostles who brought guidance to the straight path, they would no longer be able to accept the teachings brought by the apostles, because they had become accustomed to being unjust, disbelievers and living for worldly pleasures, so that their faith could no longer be relied upon. then Allah destroyed and destroyed them. Thus Allah rewards those who are unjust and commit acts of sin. There are times when Allah destroys them all at once, or brings doom in the form of damage and destruction in their society. This was a stern warning from Allah to the Meccan polytheists who belied the Prophet."
		   },
		   {
			"id": 1378,
			"surah": 10,
			"ayat": 14,
			"tafsir": "After the previous peoples were destroyed, Allah replaced them with the people of Muhammad, people who follow the Islamic religion, a religion that brings people to happiness in life in this world and in the hereafter. This verse is good news for the followers of the Prophet Muhammad who were being pressured and tormented by the polytheists of Mecca at that time. With this verse they are increasingly convinced of the truth of the religion of Islam and are increasingly convinced that their struggle will succeed in victory. This promise of Allah is also in accordance with His word: Allah has promised those among you who believe and do good, that He will indeed make them rule in the earth, as He has made those who were before them ruling, and indeed He will establish for them the religion He has approved. And He really changed their (state), after being in fear to be safe and secure. They (still) worship Me by not associating Me with anything. But whoever (still) disbelieves after that (promise), then they are the ones who are wicked. (an-Nur\/24: 55) This verse is a warning to Muslims to always be careful in determining what they will do and always remember the duties that Allah has given to humans as Khalifah on earth. Among the duties of the caliph on earth are upholding rights and justice, cleansing this nature from unclean, shirk, wicked deeds, and exalting Allah's words on earth. Allah will pay attention to and record all human actions in carrying out their duties, whether they are in accordance with what He has commanded or not. As He says: And it is He who created the heavens and the earth in six days and is His Throne on the water, so that He may test which of you is better in deeds. (Hud\/11: 7) Regarding this verse, Qatadah said, \"Our Lord has done the right thing. He made us caliphs on earth, nothing but to see our deeds, so show Allah your deeds good by night and by day.\""
		   },
		   {
			"id": 1379,
			"surah": 10,
			"ayat": 15,
			"tafsir": "This verse explains the attitude of polytheists when the Prophet Muhammad recited to them the verses of the Qur'an which were revealed to him which have beautiful language and high content, which show all kinds of truths, based on the reasons and evidence that strong, so they challenged the Prophet to bring a book other than the Qur'an for them which contains things that do not conflict with the beliefs they have embraced, that do not insult God and their worship, that do not conflict with their customs and do not forbid what they have made lawful. With that request they intend to break the hujjah that the Prophet Muhammad put forward. They hoped that Muhammad would be willing to grant their request. If Muhammad granted their request, it means they have been able to weaken the reasons justified by Muhammad himself. So Allah taught Muhammad to tell them that the Qur'an was from Allah, not from himself. If he changes and exchanges it, it means that the Qur'an is his own creation, not from Allah. However, the answer they received was contrary to their expectations, even in the tone of threats and harsh warnings stating that because of their extreme denial, they were no longer worthy of receiving God's teachings, but it was God's punishment that they received. The Prophet stated that it is not appropriate to change or change the verses of the Qur'an. The verses of the Qur'an are the words of Allah, not his words, therefore the only person who has the right to replace or change them is Allah himself. He is only an apostle of God's messenger, therefore what he follows is only the revelation that God has revealed to him. He will not follow other than that. He believes and believes that if he obeys the desires and requests of polytheists, it means that he has disobeyed Allah, has denied Allah's word, denies the existence of the Resurrection Day and so on. Such actions are threatened by Allah with a painful punishment."
		   },
		   {
			"id": 1380,
			"surah": 10,
			"ayat": 16,
			"tafsir": "In this verse Allah teaches the answer that the Prophet Muhammad would give to polytheists who deny the Qur'an, namely an order to tell polytheists that if Allah wills, the Prophet will not recite it. The Prophet recited the Qur'an to them solely at the behest of Allah and His will. If Allah had not wished to convey the Qur'an to them, surely He would not have sent himself to them, so that the Qur'an which contains instructions for the happiness of life in this world and in the hereafter would not reach them. Allah says: Indeed, We have brought to them the Book (Al-Qur'an), which We explained on the basis of knowledge, as guidance and mercy for those who believe. (al-Araf\/7: 52) This verse confirms that Allah has sent down the Qur'an to the Prophet Muhammad, which contains instructions for the benefit of life in this world and in the hereafter, and confirms that Muhammad is the messenger of Allah who conveys these instructions to humans . As proof of the truth of the revelation that had been conveyed, Allah ordered the Prophet to tell polytheists that he (Muhammad) had lived and socialized with them for more than 40 years. They all already know the characteristics, character and personality of the Prophet, also know his morals, behavior, attitude and justice towards all of them. During that time, they all knew that the Prophet had never read a single book, because he was not good at reading, had never studied with anyone, nor had he conveyed words of equal value to the verses of the Qur'an. Therefore, is it true that the Prophet lied, as they suspect. Why did they all ask the Prophet to replace the verses of the Qur'an with something else. As it is known that each of the apostles sent by Allah to his people was given various privileges by Allah, before being appointed as an apostle, just as Musa (as) was given wisdom and knowledge at the time when he was between 30 and 40 years old, when his mind was perfect according to the word of Allah : And after he (Moses) was mature and perfect in his mind, We bestowed upon him wisdom (prophecy) and knowledge. And thus We reward those who do good. (al-Qashash\/28: 14) Similarly, Yusuf as was given wisdom and knowledge by Allah when he reached adulthood, before being appointed as an apostle, (Yusuf\/12: 22) such as the science of interpreting dreams and so on. Prophet Isa before being appointed as an apostle, when he was small in the cradle he spoke fluently, was born without a father, was given the Book and Wisdom. (Â'li Imran\/3: 46, 47 and 48) The Prophet Muhammad had been given privileges by Allah like the privileges that had been given to previous prophets and messengers. He was also given another privilege, namely a privilege that was immediately felt, believed in, and known by all members of the Meccan community at that time. The entire population of Mecca regarded him as an honest person who could really be trusted, he was seen as a fair person in making decisions, not being one-sided. An example is his wisdom in giving decisions to the Quraysh tribes who asked him to determine who had the right to put the Black Stone back in its original place when the Kaaba was renovated. Quraysh leaders cleaned and repaired the Kaaba, so they removed the Black Stone from its place. After the Kaaba was cleaned and repaired, they wanted to put the Black Stone back in its place. The tribal chiefs are fighting over who is most entitled to put the Black Stone back in its original place. Each clan head felt entitled, so that debates and disputes ensued which almost led to bloodshed between them. So one of them asked Muhammad to make a decision about who had more right to put the Black Stone back. Whatever the Prophet's decision will be followed. The man's request was approved by the tribal chiefs, and Muhammad was also willing to comply with their request. He opened his turban and placed the Black Stone on it, then ordered each clan head to hold the edge of the turban and lift it together. After arriving at the Black Stone, he put it in its original place. His decision was recognized by the clan heads as a just, right and wise decision. The people of Mecca really believed in him, because of that belief he was called \"Al-Amin\" (a confidante). Because of that trust, Khadijah also entrusted her wares to him. Finally Khadijah became his wife. He was recognized by the people of Mecca as a person of noble character, strong personality, respected and so on. After he served as an apostle, he conveyed verses of the Koran to them and invited them to convert to Islam, suddenly they accused Muhammad of being a liar, someone who disturbed public peace and someone who changed and damaged beliefs and customs. customs that they have inherited from their ancestors long ago. Because of their hatred for Muhammad, they no longer remember their attitudes and beliefs towards him. This is what God meant by His word above, which means: \"Verily, I have lived with you for some time before.\""
		   },
		   {
			"id": 1381,
			"surah": 10,
			"ayat": 17,
			"tafsir": "This verse describes the actions of the most unjust in the sight of Allah, namely: 1. People who lie against Allah, as polytheists have done because of their denial, namely asking the Messenger of Allah to exchange verses of the Qur'an with other words which does not contradict their beliefs. 2. People who deny the verses of Allah. This verse warns that a person who commits one of the most unjust acts is someone who deserves Allah's wrath and His punishment. They have sinned, they will not gain good luck with those actions. Therefore, let those who have faith guard themselves so that they do not commit these acts."
		   },
		   {
			"id": 1382,
			"surah": 10,
			"ayat": 18,
			"tafsir": "This verse describes the form of belief of the Jahiliyah Arabs. They worship idols in addition to worshiping Allah, because they believe that those images and idols can benefit them as well as it can harm them, if they do something that can provoke their anger. Even if they wanted to think and really realized that the statue was an inanimate object made by their own hands, they would know that these idols would not be able to cause any harm or benefit to anyone and they certainly would not worship them. The only one who has the right to be worshiped is the Almighty, the Creator. The Arabs during the Jahiliyah adhered to various religions and beliefs, and had several ways of worshiping their gods. All of these beliefs show the belief that there are many gods, not one. In other words, they associate Allah with others. Among them there were also those who embraced Judaism such as some residents of Medina and some residents of Yemen, and there were also those who embraced Christianity such as residents of Gassan and residents of Najran, as well as a group of Aus and Khazraj tribes who lived in areas bordering Khaibar, Quraidhah , and Bani Nadhir. Among them there are also those who are of the Shabiin religion, namely people before the Prophet Muhammad who knew of the existence of God Almighty, and believed in the influence of the stars. Then Allah explained the attitude of the Arabs towards idols, some of whom said that they believed these idols could not bring harm and benefit, but they believed that those idols would intercede for them to ask for intercession for them in side of Allah, and that is the nearest way. That's why they made vows, slaughtered the sacrifices and prayed to the idols and mentioned their names. By doing so they feel closer to God. Ibn Abi Hatim narrated from Ikrimah that Nadhar bin Haris said, \"When the Doomsday comes, Lata and Uzza will intercede for me.\" From the explanation above, it can be concluded that the essence of the beliefs of the Jahiliyyah Arabs is that even though they believe that God the Creator exists, in the relationship between God and humans they still need an intermediary (wasilah) who will convey their requests to their God. Then Allah ordered the Prophet Muhammad to convey to the polytheists something that could prove their lies and something that could refute their words by saying whether they informed Allah something that He did not know, namely that there are intercessors in the heavens and in earth that can provide intercession as an intermediary between Allah and His creatures, whereas if there were Allah would have known about it. There is nothing in the heavens and on earth that Allah does not know, whether or not something exists solely according to Allah's will, moreover that intercession is only given solely with Allah's permission and is only given to whom He wills. The Messenger of Allah himself was not able to provide benefits for himself, nor did he refuse harm except with Allah's permission as the word of Allah: Say (Muhammad), \"I have no power to bring benefits or prevent harm to myself except what Allah wills. If I knew the unseen, surely I will do as much good as possible and no harm will befall me. I am only a warner, and a bearer of good news for those who believe. (Al-Araf\/7: 188) as said by the polytheists. This verse also implies that everything related to God can only be explained by means of the revelations conveyed to His messengers, while everything is known to God, whether hidden or manifest."
		   },
		   {
			"id": 1383,
			"surah": 10,
			"ayat": 19,
			"tafsir": "What is meant by one people here is one faith, namely believing in God Almighty, because humans have adhered to the belief in monotheism since they were born into the world, Allah has taken witness against humans, since they were expelled from sulbi, (see the tafsir of surahh al-Baqarah\/ 2: 213 and al-Araf\/7: 172) as the nature of the incident, as the words of the Prophet Muhammad saw: Every child born is born in a state of fitrah, so it is his parents who make him a Jew or Christian or Zoroastrian. (History of Abi Yala, ath-thabrani and al-Baihaqi from al-Aswad bin Sari) In the beginning, humans lived simply, in one unit, as if they were one family. However, after they multiplied, different tribes and nations were formed, both in terms of their interests and benefits. Because of lust, they also clash. Therefore, Allah sent them messengers who conveyed Allah's guidance, to eliminate disputes and differences of opinion between them. The apostles brought books containing God's revelations. Then people also disagree about the book that Allah has sent down, so that there is enmity and fighting between them. Some commentators are of the opinion that what is meant by \"human\" in this verse is Arabs. They used to be followers of the religion brought by the Prophet Abraham, a religion that acknowledges the oneness of Allah. Then an element of shirk entered into their beliefs, so that some of them worshiped idols in addition to worshiping Allah and some still adhered to the religion of the Prophet Abraham. There was a dispute between the two groups. If you pay attention to these two opinions, there is no main difference, because the first opinion is general in nature, covering all humans in the world, while the second opinion is specific to Arabs only, but does not rule out the possibility of its application to all humans. With a very strong warning by stating that if Allah had not predetermined to give a just and fair reward in the hereafter, then Allah would immediately destroy those who are in conflict in this world. They bring division and enmity, moreover their dispute is about the Book of Allah which was actually sent down to eliminate the dispute."
		   },
		   {
			"id": 1384,
			"surah": 10,
			"ayat": 20,
			"tafsir": "In this verse, the attitude of polytheists to the Prophet is explained by saying that why was it not revealed to Muhammad the signs of his apostolate related to this nature, as had been revealed to previous prophets, such as the hurricane of Prophet Noah, splitting the sea for Prophet Musa , etc. Their request and astonishment is described in another verse, as follows: And they said, \"Why did this Apostle (Muhammad) eat food and walk in the markets? Why was not an angel sent down to him (so that the angel) gave warning with him, or (why isn't wealth sent down to him or (why isn't there) a garden for him, so he can eat from it?\" And the wrongdoers said, \"You are only following a man who is bewitched.\" (al-Furqan\/25: 7-8) They also asked for other proofs of prophethood, such as beautiful gardens where rivers flowed there, or punishment by dropping the sky, or a house made of gold that was given to Muhammad. In another verse Allah says: And they said, \"We will not believe in you (Muhammad) until you bring forth springs of water from the earth for us. Or you have a garden of dates and grapes, then you flow in the crevices of a fast-flowing river, Or you make the heavens fall on us in pieces, as you say, or (before) you bring Allah and the angels face to face with us. Or you have a house (made of) gold, or you ascend to the sky. And we will not believe your ascension before you send us a book for us to read.\" (al-Isra\/17: 90-93) So Allah taught Prophet Muhammad the answer to the request of the polytheists as stated in His word: And nothing prevents Us from sending (to you) signs (Our power), but because (the signs) were denied by the former. And We have given to the people of the ocean a she-camel (as a miracle) that can be seen, but they persecuted (the she-camel). And We did not send these signs except to frighten them. (al-Isra\/17: 59) He gave each of the apostles sent by Allah a miracle to prove and strengthen his message, but the miracles that were given varied, according to the circumstances and the place of the people who would receive the message. In particular, the Prophet Muhammad was given a miracle in the form of the Koran because this miracle corresponded to the level of knowledge of the Arabs and the people who lived after him. It is narrated that the Prophet Muhammad said: There is no Prophet (who was sent by Allah), except He gave him miracles for which people believe in him. What was given to me was none other than the revelation that Allah had revealed to me. So I hope that I will be among those who have the most followers on the Day of Resurrection. (History of al-Bukhari, Muslim, and at-Tirmidhi from Abu Hurairah) Allah ordered the Prophet Muhammad to give a strong warning to polytheists by telling them that unseen things are under the power of Allah, only He has them, including the miracles they asked for. If Allah wishes to send it down to them, then He alone knows the time of its descent. Muhammad was only an apostle, whose job was to convey the religion and decree of Allah upon them, as Muhammad was also among those who were waiting for the decree to come. In another verse Allah says: Say (Muhammad), \"I am not the first messenger among the apostles and I do not know what will be done to me and to you. I only follow what is revealed to me and I am only a warner who explains. ( al-Ahqaf\/46: 9) What was waiting for Muhammad and what were they waiting for, Allah explained in verse 102 of this surah."
		   },
		   {
			"id": 1385,
			"surah": 10,
			"ayat": 21,
			"tafsir": "This verse explains the nature of disbelievers in general and the characteristics of polytheists in particular. That if God gives them relief after suffering a hardship or happiness after they are miserable, they do not admit that the relief and happiness come from God, so they are not grateful for Him. When God's mercy comes to him in the form of rain that comes down from the sky which grows plants and revives livestock, they claim that it is thanks to their idols and idols, or they say that the rain just falls by chance, because the rainy season has come . If they are overwritten by difficulties, then the difficulties disappear, so they say that the difficulties disappear solely because they themselves are people who are good at eliminating difficulties and are among those who are lucky. Pharaoh and his people did something like this every time they received Allah's punishment and every time they were released from it. The polytheists of Mecca did the same thing to the Prophet Muhammad and his followers. Al-Bukhari narrated from Abdullah bin Masud that when the Quraysh people hurt the Prophet to the point of exceeding the limit, the Messenger of Allah prayed to Allah that the polytheists would be punished in the form of a dry season like the dry year that occurred during the time of the Prophet Yusuf. So they were hit by a very terrible drought, until they were forced to eat bones and carrion. Because of the extreme drought and heat, their vision became dim and smoky as described by Allah in surahh ad-Dukhan\/44 verse 10. you ordered us to have friendly relations, and in fact your people have perished, so ask Allah to deliver them from this predicament.\" So the Messenger of Allah prayed to Allah, then the difficulties and calamities ended and it rained. Apparently, not long after, they again denied the Messenger of Allah and became enemies with him. Because of their attitude like that, God ordered the Messenger of Allah to convey a warning to the polytheists that Allah was quicker to punish Him than their deceit, Allah had prepared the punishment that would befall them, before they had time to set up a deceptive strategy. power to destroy Islam and the Muslims. All good and bad deeds will be recorded by angels who have been assigned by Allah. There is not a single human action, whether small or large, that is not written down. Then in the hereafter, every human being will get a reward for all his actions. Bad deeds are rewarded with the torments of hell, while good deeds are rewarded with the pleasures of heaven. This verse implies that all human speech is recorded by angels and the existence of angels is confirmed by this verse."
		   },
		   {
			"id": 1386,
			"surah": 10,
			"ayat": 22,
			"tafsir": "In this verse, Allah shows His ability, power, and grace to humans while saying, \"He is Allah who has given you (humans) the ability to walk on land, sail on the sea, and fly in the air by giving you the opportunity to use various types of means such as stars, ships, and so on. With these means of transportation you can achieve your various desires and to have fun.\" With the abilities and abilities that He has given, humans are tested and tried by Allah, so that their character and character are clearly visible, which Allah likens as follows: with the abilities that He has given, humans make an ark that can sail the vast ocean. When they were in the ark and he sailed with them with the help of a good wind and calm waves, they were happy. Suddenly there came a strong windstorm and waves crashing from all over, so that anxiety and fear arose in their hearts. They feel they will no longer be able to see the sun that will rise the next day because of the powerful waves. Because of that they also prayed to Allah while humbling themselves with sincerity, while regretting the actions they had done, so that Allah would deliver them from the terrible waves, they said, \"O our Lord, indeed if you deliver us from the calamity that will befall us, surely we will be grateful for the favors that You have bestowed.\""
		   },
		   {
			"id": 1387,
			"surah": 10,
			"ayat": 23,
			"tafsir": "After Allah delivered them from this calamity and they felt happy and lost all their worries, they forgot about the Supreme Savior and the Giver of Grace, they even disobeyed Him and returned to doing destruction on earth by committing tyranny and disorder among humans. Thus God describes the character and nature of man. They remember and humble themselves to Allah when they get tribulation and when the calamity has disappeared, they forget to even disobey Allah again. The character and character described above show human weakness, therefore humans should be aware and aware of that weakness. Don't let that weakness lead them to greater disaster. Arrogance and unjust behavior, if it is a pleasure for him, then it is a temporary pleasure, while living in the world, while the eternal pleasure and happiness are the pleasures and happiness caused by obedience to Allah in any circumstances, both in happy and miserable conditions. , joy and sorrow, in a state of loss and luck and so on. Such pleasure and happiness will be felt while living in the world, more so in the hereafter."
		   },
		   {
			"id": 1388,
			"surah": 10,
			"ayat": 24,
			"tafsir": "This verse explains the nature of worldly life and a parable that is appropriate in terms of its mortality, such as the disappearance of a hope that begins to arise in a person. This nature of the world is likened to rainwater that Allah sends down from the sky. With that water grow all kinds of plants and herbs, which are of various shapes and different tastes which serve as food for humans and animals. Then the surface of the earth was covered by the scenic beauty of verdant trees, which were adorned with flowers and fruits of various colors. At that time, the hopes and aspirations of the people who own the garden arose, if the plants were to bear fruit and could be picked. In the midst of such hope, a calamity came that destroyed the plants and trees, so that the earth, which was decorated with trees of various colors, suddenly became flat and flat as if nothing had ever grown. At that moment, those hopes and aspirations will vanish, just as worldly life and pleasures can also vanish in an instant. The transience of living in this world is confirmed by the word of God: Do the inhabitants of that land feel safe from Our torment that comes at night when they are sleeping? Or do the people of the land feel safe from Our torment that comes in the morning when they are playing? (al-Araf\/7: 97-98) Just as Allah has given a parable that is precise and clear in describing the conditions of world life and humans are deceived by that life due to the influence of Satan and following lust, so in this way Allah also clearly and clearly explains the essence of monotheism , religious principles, good manners and pious deeds that must be done and obeyed. Only people who are willing to use their common sense can understand the parables and explanations. Many humans are negligent and deny because they feel they have had enough, feel capable and feel powerful, so they forget the true purpose of life and life."
		   },
		   {
			"id": 1389,
			"surah": 10,
			"ayat": 25,
			"tafsir": "Allah calls on the Muslims to take the path that will lead them to Darussalam, namely the eternal happiness that they will feel in heaven later. As a guide to that happy life, Allah has given instructions to those whom He wills, so that they follow the straight path, namely the path that can lead them to that happy life. They are prohibited from imitating the actions of polytheists who prioritize worldly life. They are fascinated in such a way to the life of the world; they will not expect any other happiness than what they already feel. Thus, they have chosen a misguided path because the life of this world is very limited and their happiness is not eternal. That is why Allah invites Muslims to follow the Shari'a and instructions brought by the Prophet, so that they can live happily in this world and in the hereafter. God's instructions given to humans are very subtle signs, which can be achieved by a person by using his mind by paying attention to the universe and its contents, as well as the laws that apply in it, so that in this way humans will be able to reach the essential truth. . In addition, Allah provides an explanation of the law, both general and specific, namely the law of syara which regulates the relationship between creatures and the Creator and the relationship between fellow creatures. Allah's laws that apply to humans are shown by Allah with His taufik. People who reach His guidance are people who are given the ability to understand and implement it. This guidance is given by Allah to humans according to His will."
		   },
		   {
			"id": 1390,
			"surah": 10,
			"ayat": 26,
			"tafsir": "In this verse, Allah explains that for those who can understand the instructions and take advantage of the instructions and practice them, Allah will reward them according to their deeds. In fact, to encourage them to be more active in practicing it, Allah promises a tenfold reward or more than that. Allah's Word: (Thus) He will reward those who do evil according to what they have done and He will reward those who do good with a better reward (heaven). (an-Najm\/53: 31) People who do good deeds will get rewarded in excess of the reward they should receive. They will receive a double reward. They will receive an additional reward that is priceless, that is, they will truly know that Allah is the Most Glorious. This knowledge is the highest knowledge, because they truly know the Creator of this universe, and confirm the occurrence of the last day. They live happily, from their faces there is a radiant light, there is not the slightest hint of gloom and gloom, because they do not feel disappointed with their strong belief, and do not feel sad. Allah confirms that these are the people who have the right to be the inhabitants of heaven. They will reside in it forever. That's where they experience eternal happiness, because they won't feel bored and tired of the pleasures they feel, nor are they afraid of diminishing pleasure or being expelled from there."
		   },
		   {
			"id": 1391,
			"surah": 10,
			"ayat": 27,
			"tafsir": "In this verse, Allah provides an explanation that those who spread evil, do trouble on earth and disobey and deny the verses of Allah which were revealed to His Messenger, they will receive a balanced retribution, that is they will receive punishment from Allah. their faces are disheveled as they suffer the consequences of the shirk that has sunk into their bones, the evil that has poisoned them and their persecution of themselves. At that time they could not defend themselves, because indeed they could not protect themselves or prevent the disaster that would befall them. Such is the doom that they feel with great regret, as a result of worshiping idols which they see as intermediaries, who can convey their prayers to Allah. That is the day of vengeance where no one will help them except their good deeds. Allah's Word: (That is) on the day (when) someone is completely helpless (helping) others. And all matters on that day are in the power of Allah. (al-Infithar\/82: 19) As a sign of their regret, their faces looked as black as the darkness of the night, not the slightest spark of lightning, the glistening of the stars, or a ray of moonlight. They truly regret the deeds done in the world. Their hopes are empty, because they hold on to wrong beliefs and deny Allah's guidance. Allah confirms that they will be the inhabitants of hell forever and ever and there is no possibility for them to escape because that is the right place for them. Allah says: And the faces (of the disbelievers) on that day are gloomy, they are sure that a very terrible calamity will befall him. (al-Qiyamah\/75: 24-25) And the word of Allah: And on that day there will be (also) faces covered with dust (gloomy), covered with darkness (overwritten by humiliation and distress). They are the rebellious disbelievers.\" (Abasa\/80: 40-42)"
		   },
		   {
			"id": 1392,
			"surah": 10,
			"ayat": 28,
			"tafsir": "Allah ordered the Prophet Muhammad to pay attention to polytheists that at a certain time Allah would gather all the idol worshipers without anyone being left behind, that is when all human beings would be examined. God at that time spoke to those who associate partners with Him, while they were silenced and could not utter a word because of confusion and fear. \"Why are they no longer together with their allies in that place. So that until the time comes they will see what will be imposed on them and what decision is appropriate given to them, as a reward for their actions that really violate Allah's prohibition and contrary to their own nature, that is they have worshiped idols. They can no longer deny their actions, because the evidence has been evident and even against them.\" At that time their allies testified that they actually not only worshiped those allies, but they also worshiped lust and Satan. They make idols as tools for their own interests. Then Allah gave an explanation that they and their partners would be separated and each would be examined, they were accused, while their partners were witnesses."
		   },
		   {
			"id": 1393,
			"surah": 10,
			"ayat": 29,
			"tafsir": "In this verse, Allah explains that the idols give statements, while Allah is sufficient to be a witness between the idols and their worshippers. It was then that the idols left them and said they did not know what they were doing. In principle those who associate partners with Allah will be tortured, because they have made a big mistake. They have worshiped something that has no right to be worshiped even though they understand that they and the idols they worship were created by Allah. So Allah should be the one who deserves to be worshiped, because He is the One who has the highest authority over all His creatures and He also has the power to bring about benefits and harm if He so desires."
		   },
		   {
			"id": 1394,
			"surah": 10,
			"ayat": 30,
			"tafsir": "Furthermore, Allah explained that in Padang Mahsyar later all humans would be gathered to receive retribution for the actions they had committed, no one was free from His punishment. Those who do good will be rewarded and those who do evil will also be punished. Then their affairs will be returned to Allah because He is the most entitled to make decisions for them. At that time, what they hoped to provide intercession with, as well as everything they thought could provide assistance, would be in vain, nothing would fulfill their hopes, let alone save them from the torment that was about to befall them. Allah said: (That is the day (when) a person is powerless in the slightest to help others. And all matters on that day are in the power of Allah. (al-Infi (25) Allah calls on Muslims to take the path that leads them to Darussalam namely the eternal happiness that they will feel in heaven later. As a guide to that happy life, Allah has given instructions to those whom He wills, so that they follow the straight path, namely the path that can lead them to that happy life. They prohibited from imitating the actions of polytheists who prioritize worldly life. They are fascinated in such a way by worldly life; they will not expect other happiness than what they have experienced. Thus, they have chosen a wrong path because worldly life is very limited and their happiness is not That is why Allah invites Muslims to follow the Shari'a and instructions brought by the Apostle, so that they can live happily in this world and in the hereafter. God's instructions given to humans are very subtle signs, which can be achieved by a person by using his mind by paying attention to the universe and its contents, as well as the laws that apply in it, so that in this way humans will be able to reach the essential truth. . In addition, Allah provides an explanation of the law, both general and specific, namely the law of syara which regulates the relationship between creatures and the Creator and the relationship between fellow creatures. Allah's laws that apply to humans are shown by Allah with His taufik. People who reach His guidance are people who are given the ability to understand and implement it. This guidance is given by Allah to humans according to His will."
		   },
		   {
			"id": 1395,
			"surah": 10,
			"ayat": 31,
			"tafsir": "Allah ordered the Prophet Muhammad to say to the people of Mecca who opposed his prophethood, that who sent down sustenance from the sky and who also grew various kinds of plants on earth for humans or their livestock? This statement was meant to make the polytheists of Mecca realize themselves and remember that the idols were completely incapable of sending down rain and it was only Allah who sent down rain. Furthermore, Allah ordered the Prophet Muhammad to ask them who has the power to create ears as hearing instruments and eyes as their means of sight, so that with these two senses, they can know the universe with its phenomena. With the ear, humans can hear other people's words and through them can also receive knowledge and gain experience. Likewise, with his eyesight, humans can see the beauty of nature and can receive cues that can guide their minds to know who the creator of the universe is. Without these two senses, humans cannot know perfectly the natural state of the world. These two senses are mentioned in these two verses because these two senses are tools for receiving knowledge, so that humans have a higher degree than animals. Because, even though animals have hearing and sight, they were not given reason by Allah, so that animals cannot receive knowledge other than animal instincts. If humans like to think about who created the two senses, of course they will not hesitate, without even thinking they can find the answer. If they find the answer, of course they will be grateful for Allah's blessings and will have faith with true faith by admitting that there is no other god except the Almighty Who created the five senses. Furthermore, Allah ordered the Messenger of Allah to ask polytheists that who has the power to animate and die, and who created living things from inanimate things and created inanimate things from living things? This question is deliberately asked to raise their awareness, that it is only Allah who creates plants from the dead earth, after the earth is given life by Allah by sending down rain, Allah says: Have you not noticed, that Allah sends down water from the sky , then arranged it into sources of water on earth, then with that water He grew plants of various colors. (az-Zumar\/39: 21) The signs of life in every creature are different. The sign of life in plants is that the plants can continue to grow, develop, and expand, while the sign of life for animals is to move and breathe. Such signs of life are easily understood and accepted by the human mind. But what are the signs of life from grains, whether single grains or two pieces, or spore plants, and what about life in ova and sperm, both from animals and humans. This is a sign that is difficult for humans to imagine and analyze. For this reason, Allah gave an easy-to-understand imagery, namely bringing out living things from inanimate things and vice versa how to bring out inanimate things from living things to express Allah's power to create all inanimate or living things with His power. If someone were to research the origin of the occurrence of grains, spores, ova, and sperm as well as all kinds of origins of life, then they would come to the conclusion that the origin of life on earth came from inanimate matter. Of course this opinion contradicts the opinion of biologists who say that all kinds of living things could not have arisen except from living things. Indeed, this opinion seems correct if we observe it from the cycle of life cycles of animals and plants, but if we look at the origin of what happened, of course this opinion is not correct. Furthermore, Allah ordered the Messenger of Allah to ask who is in control of all kinds of affairs of creatures on this earth? The handling is amazing. All kinds of life are governed by harmonious and balanced laws. So for people who want to meditate on His laws, they will provide answers to all these questions that it is Allah who created everything, the Lord of all the worlds and He is also the one who manages and controls them. Allah ordered the Prophet to say to the polytheists, why do they not take care of themselves so that they are free from misguidance? If they want to take care of themselves they will certainly not fall into polytheism and become idol worshipers. Those who are worshiped besides Allah do not have the slightest power to bring harm or benefit to them."
		   },
		   {
			"id": 1396,
			"surah": 10,
			"ayat": 32,
			"tafsir": "Then this verse indicates to the polytheists of Mecca that the One who has the characteristics mentioned above is Allah Who takes care of them, He is the Righteous God, the One Who Lives and gives life. And He is the One who deserves to be worshiped. And Allah ordered the Prophet Muhammad to declare to them that there is no God who takes care of all the affairs in this world besides Allah. Allah blames their actions and asks them to account for why they deviated from the true religion, namely monotheism, to something that is false, as if they were running from Allah's guidance and looking for a misguided path, even though they know the proofs of the truth of the existence of Allah, the real God. If they already know the evidence of the existence of God the Creator of nature then they should not want to worship other gods. Because if this happens, it means that their confession is different from their actions, and what is written in their hearts is not in accordance with what they are doing. For those who are self-serving to Allah, it means that they have taken the right path and received His guidance, because they worship the true God. But those who worship gods other than Allah, they are the people who go astray, because they worship a god that has no right to be worshiped which they consider to be intermediaries. Everyone who worships gods besides Allah are polytheists and wallow in falsehood and fall into the valley of misguidance."
		   },
		   {
			"id": 1397,
			"surah": 10,
			"ayat": 33,
			"tafsir": "Allah gives threats to those who are wicked, with irreversible threats because they do not want to believe in the religion called for by the Prophet, namely the religion of monotheism and leave idol worship. Those who do not want to believe in the religion of monotheism are not forced to, but on the basis of their own will and endeavor because they do not have the right view that can free themselves from the shackles of polytheism. That is why their souls cannot be directed to a handle that can distinguish between right and wrong. They have sunk deep into disbelief, while they themselves are too fanatical to the beliefs of their ancestors. Allah's Word: Indeed, those who have been confirmed to receive the decree of your Lord, will not believe, even though they receive signs (the greatness of Allah), until they witness a painful doom. (Yunus\/10: 96-97)"
		   },
		   {
			"id": 1398,
			"surah": 10,
			"ayat": 34,
			"tafsir": "Allah ordered the Prophet Muhammad to ask them whether there is one of the gods they worship besides Allah, such as idols, ancestral spirits, animals, planets, angels, and jinn, who has the power to create creatures, then revive after the creatures died? Of course they would not be able to answer. This is because they deny the resurrection day, the day they are revived from the grave. After that, Allah gave an answer through His messenger, that it is only Allah who has the power to start life and He who has the power to start life or return it to its original state. However, they still do not want to accept the true religion, namely the religion of monotheism and prefer to worship idols and statues which they do because of the inclination of their own souls and not because they are forced to."
		   },
		   {
			"id": 1399,
			"surah": 10,
			"ayat": 35,
			"tafsir": "Furthermore, Allah ordered the Messenger of Allah to ask them the question whether any of the gods whom they associate with Allah can provide guidance to the true path as accepted by His believing servants? Allah confirms that Allah is the one who gives guidance or guidance in the sense of taufik. Allah's Word: He (Moses) replied, \"Our God is (God) who has given the shape of events to everything, then gave him guidance.\" (thaha\/20: 50) After the polytheists were unable to give an answer because none of them felt that they were getting guidance from the gods they associate with Allah, both the guidance that must be accepted as a creature or the religion that they accept As legal guidance, Allah ordered the Messenger of Allah to answer that Allah is the One who gives instructions to the truth. Both instructions given through messengers, instructions given through His books, instructions obtained by humans because they were ordered by Allah to reflect on such things and think about natural events as well as instructions given by Allah through the five senses. Allah ordered the Prophet to ask them, \"Which is more deserving to be followed, whether the One Who gives instructions to the truth or idols who cannot give the slightest guidance to them, they cannot even know themselves.\" Why did they accept such a choice. If they wanted to use their minds and minds, they would certainly choose the One who guides them, namely Allah. Because the other gods couldn't give any clues. Allah denounces their actions by asking what happened to them, so that they make the idols as intermediaries who can convey their worship to Allah, even though the idols are not God who creates, and not those who provide sustenance and also not God who gives instruction. So why did they make an unfair decision, namely to consider the gods they associate with, as the God who has the right to be worshiped, has the right to be asked for help without permission from the Creator. From this point of view, the error of the polytheists and the mistakes of their actions can be seen."
		   },
		   {
			"id": 1400,
			"surah": 10,
			"ayat": 36,
			"tafsir": "Next, this verse presents several reasons which show the truth of the monotheistic religion and the misguidance of the beliefs of the polytheists, that is, most of them associate partners with Allah with other gods, are hostile to the Prophet Muhammad and deny the Day of Resurrection. Such an assumption is not a true belief, but an assumption based on blind faith in their ancestors because they suspect that what was good according to their ancestors was good for them, even though what their ancestors did was misguided. On the other hand, there is a small group of them who know that the religion brought by Rasulullah saw is the true religion, and the idols they worship cannot have any effect on them. However, because their hearts were polluted by polytheism, and their arrogant attitude and denial of Muhammad's apostleship and their feelings of fear when their leadership was lost, they remained blindly devoted to their ancestors who wallowed in polytheism. Then Allah explains how the actual condition of those who base their beliefs on that conjecture, that in fact this conjecture is of no use to reach the truth. These assumptions cannot be equated with beliefs, and beliefs cannot occur unless they are based on something true, that is, on what has been established, whose truth cannot be doubted. At the end of the verse, Allah confirms that Allah is All-Knowing of what they do, both actions based on beliefs whose truth is uncertain, or deeds based on whose truth is certain. He is the One who knows their deeds, and repays them according to their deeds."
		   },
		   {
			"id": 1401,
			"surah": 10,
			"ayat": 37,
			"tafsir": "Allah explained that it is inappropriate and unreasonable for the Qur'an to be created by other than Allah. And it is impossible for humans to make the Koran. The reason for this impossibility is because no one other than Allah would have been able to produce something like the Qur'an. If anyone feels capable of making it, such an assumption is just a dream that is impossible to materialize in the real world. This was said by the most infidel and most hostile to the Prophet Muhammad, namely Abu Jahl, when commenting on Muhammad's honesty, \"Muhammad never lied to anyone, so is it possible for him to lie to Allah.\" So if it is impossible for the Al-Qur'an to be created by other than Allah, then what can be believed is that the Al-Qur'an is only the word of Allah. The Qur'an functions as a \"justification\" for the previous books, namely the books revealed to the Prophets Noah, Abraham, Moses and Isa as. The Qur'an contains religious principles that guide people who believe in Allah and the Day of hereafter and practice its contents as well as possible. The Qur'an was revealed to Muhammad saw not because the revelations that had been revealed to the previous prophets were not true, but because mankind had forgotten most of the main points of their religion, and some even deliberately distorted their religion and mixed it with new traditions created by their leaders to undermine the core teachings of their religion. The main points of their religious teachings had never been known by the Prophet Muhammad before he became a messenger, that is, before he received revelations from Allah. It is said that the Al-Qur'an serves as a justification for the previous book, because the Al-Qur'an brings the main points of teaching that correspond to the main points of the creed brought by the Prophet Abraham. It was also caused by the arrival of the Prophet Muhammad who received revelations from Allah, in accordance with the instructions contained in the previous books, as Allah says: Namely) people who followed the Messengers, Prophets who were unlettered (ill read and write) who ( name) they found written in the Torah and the Gospel that was with them. (al-Araf\/7: 157) The Qur'an functions as a \"detail\" of the contents of the books revealed by Allah, namely the books that contain laws from Allah, and serve as a guide for all humans, which contain aqidah, law, exemplary examples, advice, and social affairs. The Koran contains instructions and there is no part that can be doubted, the Koran comes from the Creator, and if the Koran were not the word of Allah, confusion and many errors would certainly be found in it."
		   },
		   {
			"id": 1402,
			"surah": 10,
			"ayat": 38,
			"tafsir": "Allah diverted the conversation to those ignorant people who denied Muhammad's apostleship and that the Qur'an was Muhammad's creation. Facing the accusations of the ignorant people, Allah ordered the Messenger of Allah to fend off their accusations by saying that if what they said was true, they should make a surahh similar to a surah in the Qur'an, in terms of its attractiveness, guidance of knowledge, style, and arrangement. As a challenge to them, Allah ordered the Prophet Muhammad to tell them that they invite anyone who is deemed capable besides Allah, to prove what they are saying. Allah's Word: Say, \"Indeed, if humans and jinn gather to make the likeness of this Al-Quran, they will not be able to make the likeness of it, even if they help each other.\" (al-Isra\/17: 88)"
		   },
		   {
			"id": 1403,
			"surah": 10,
			"ayat": 39,
			"tafsir": "Allah revealed that the polytheists were apparently unable to answer Allah's challenge to make something like the Al-Qur'an. Allah explains the true condition of the polytheists, that after hearing the verses recited by Muhammad, they immediately deny it, even though they have not thought about its contents beforehand, and do not know the problem. Such an attitude is because they are hostile to Muhammad who brought a new belief that is different from the beliefs of their ancestors. Then Allah compared the attitude of the polytheists with the attitude of the polytheists who lived before them. Because, there is something in common between them, that is, the polytheists of Mecca denied the verses received by Muhammad, while the polytheists of the ummah who then denied their messengers, equally denied the revelations received by the prophets. before they thoroughly investigate the truth before understanding the explanation. What is meant by explanation here is the reality that they have to face as a result of denying the verses revealed to Muhammad saw as a fact that was accepted by them or by people in the past, as a result of their denial of the revelations they received. The reality that they experience is Allah's torment that they feel in this world before they feel more severe torment in the hereafter. At the end of the verse, Allah explains that this is indeed the fate of those who deny the true apostles and prophets. This fate would certainly befall the polytheists of Mecca if they persisted in being tough in denying Allah's revelations. Allah ordered the Prophet Muhammad and his followers to pay attention to how the end of the lives of people who abuse themselves because they dared to make enemies and belied Allah's messengers. Allah said: So each (of them) We punished for his sins, among them We rained pebbles on him, some were hit by a loud thundering sound, some We buried into the earth, and some were We drown. Allah does not want to wrong them at all, but they are the ones who wrong themselves. (al-Ankabut\/29: 40)"
		   },
		   {
			"id": 1404,
			"surah": 10,
			"ayat": 40,
			"tafsir": "Allah explained to Rasulullah and his followers that the condition of polytheists who deny the verses of the Qur'an will be divided into two groups. A group truly believes in the Al-Quran with strong faith and another group does not believe it and continues to be in disbelief. However, they will not be punished directly in the world like the fate that has been experienced by people before the Prophet Muhammad saw. At the end of the verse it is explained that Allah knows better about those who make mischief on earth, because they associate partners with Allah, wrong themselves and oppose Allah's law. This is because their nature has been damaged. They are the ones who will get the painful torment."
		   },
		   {
			"id": 1405,
			"surah": 10,
			"ayat": 41,
			"tafsir": "Allah gave an explanation, if the polytheists continued to deny Muhammad, then Allah ordered him to tell them that the Prophet Muhammad was obliged to carry on his duties, namely to carry on his apostolic duties, as the messenger of Allah's commands whose truth was clear, orders containing warnings and promises. the promises and guidance of worship along with the main points of benefit that serve as guidelines for the life of the world. The Prophet Muhammad was not ordered to judge them, if they still maintain their attitude that denies the Qur'an and associates partners with Allah, Allah said: Say (Muhammad), \"Everyone acts according to his own nature.\" Then your Lord knows best who is more righteous in his way. (al-Isra\/17: 84) They are free (not responsible) for what was done by the Prophet Muhammad and the Prophet Muhammad was not responsible for what they did. This means that Allah will not punish someone for the mistakes of others. Allah said: Say, \"You will not be held responsible for what we do and we will not be held responsible for what you do.\" (Saba\/34: 25 Say (Muhammad), \"If I make this up, I will bear the sins, and I am free from the sins you have committed.\" (Hud\/11: 35) And His word again: Then if they disobey you then say (Muhammad), \"Indeed I am not responsible for what you do.\" (asy-Syuara\/26: 216)"
		   },
		   {
			"id": 1406,
			"surah": 10,
			"ayat": 42,
			"tafsir": "Allah explained to the Prophet Muhammad and his followers that among those who deny Allah's verses there is a group of people who listen secretly when the Qur'an is recited. They pay attention to the religious points contained in it, but they do not intend to listen sincerely, because when they hear it they do not want to use their minds to pay attention to the contents of the Al-Quran nor do they want to think about its aims and objectives, so they do not can understand its true purpose. They want to listen because they are attracted to the beautiful language of the Koran and are amazed to hear the beauty of its composition, like someone who is attracted to the singing of birds in the trees, they can only enjoy its beauty but cannot understand what the meaning is contained in its tweets. Allah says: Every time new verses are sent down to them from God, they listen to them while playing. (al-Anbiya\/21: 2) And His words: And among them there are those who listen to your reading (Muhammad), and We have closed their hearts (so they do not) understand it, and their ears are blocked. And even if they see all the signs (truth), they still do not want to believe in it. So that when they come to you to argue with you, those disbelievers say, \"This (Qur'an) is nothing but the tales of the ancients.\" (al-Anam\/6: 25) At the end of this verse, Allah confirms that the Prophet Muhammad would not be able to make them hear and understand what they heard, because they had lost the benefit of the sense of hearing in the truest sense- true. They are not good listeners, because a good listener is someone who can think and understand and carry out the intent and purpose of what he hears. What's more, they will never try to understand too, so they won't be able to benefit from what they hear and won't be able to understand the instructions it contains."
		   },
		   {
			"id": 1407,
			"surah": 10,
			"ayat": 43,
			"tafsir": "After that Allah explained that among the people who denied Allah's verses there was also a group of people who really paid attention to the Prophet Muhammad when he was reciting the Qur'an. However, their attention was only outwardly and only seeing the movement of the Prophet's tongue when pronouncing the pronunciation and its composition, was not a genuine concern that could understand and think about the meaning contained in the words that were composed in that sentence. That is why the light of faith in their hearts cannot shine because they are covered with the stains of polytheism. They cannot see the signs of truth and guidance contained in the Qur'an. Whereas this inner view is what distinguishes humans from animals. With that attention humans should be able to understand and think about what they see, because God likens them to blind people. At the end of the verse, Allah confirms that the Prophet Muhammad as a messenger was not able to make them see the signs of truth contained in the verses of the Qur'an. Because they will not be able to perceive the signs of the truth of the verses, moreover they do not have the intention to use their inner senses to understand the contents of the verses of the Al-Qur'an forever."
		   },
		   {
			"id": 1408,
			"surah": 10,
			"ayat": 44,
			"tafsir": "Then Allah emphasized to the Muslims, that He will not abuse His servants and will not reduce the power of the senses and all the tools that humans have to obtain instructions, so that they arrive at the truth and can be guided by those instructions so that they can carry them out to achieve everything that is beneficial to them. , as long as the man himself wants to make the best use of his five senses. Otherwise, they are the ones wronging themselves. Because they were given eyes and ears, but do not want to understand God's instructions, it means they are wronging themselves. Since they don't want to listen, and are given a heart but don't want to understand, it is only fitting that they be tortured because they wronged themselves. Allah has sent down messengers to guide them to a happy life in this world and in the hereafter, but they don't want to listen and don't want to obey it, so if they get lost in this world and in the hereafter are subjected to severe punishment, then those who persecute them are none other than themselves."
		   },
		   {
			"id": 1409,
			"surah": 10,
			"ayat": 45,
			"tafsir": "Allah ordered His Messenger to give a warning to polytheists that Allah will inflict punishment on them on the Day of Judgment, namely when they are gathered in Padang Mahsyar after they are resurrected from their graves. They will be examined on that day and will be rewarded according to their deeds. On that day they will be able to compare how much time they have to go through when compared to the life of the world which feels like a moment. It is at that moment that they will feel sorry for being deceived by the life and pleasures of this world which are only temporary, and forget about the afterlife even though the afterlife is eternal life and at that moment they will also feel prolonged regret and receive punishment. Allah says: On the day they see the promised doom, they feel as if they are staying (in the world) only for a moment during the day. Your job is just to deliver. So none will be destroyed except the wicked (disobeying Allah). (al-Ahqaf\/46: 35) And the word of Allah: And on the day (when) the Doomsday occurs, those who sin swear, that they dwell (in the grave) only for a moment (only). That's how they were turned away (from the truth). (ar-Rum\/30: 55) Allah explains that polytheists feel at a loss because they cannot experience eternal happiness, because they do not believe in true faith, and do not do good deeds, which can elevate themselves to become beings noble ones who deserve Allah's pleasure, so they are entitled to enter heaven. They also belied the belief that those who please Allah can meet Allah. That is why Allah, at the end of the verse, emphasizes that they are classified as people who do not receive guidance, because they have made the wrong choice, namely prioritizing the life of this world that is mortal, rather than the eternal life in the hereafter which contains incomparable pleasures."
		   },
		   {
			"id": 1410,
			"surah": 10,
			"ayat": 46,
			"tafsir": "Furthermore, it is emphasized that there is torment promised by Allah to polytheists, namely the torment that will be inflicted on them in this world and in the hereafter. The torment that will be inflicted on them will be shown to the Apostle in whole or in part both while the Apostle is still alive or after he dies. It depends on Allah's will alone. What is meant in this verse is that the Messenger of Allah will know that the torment that will be inflicted on them is not wholly, but only part of it, that is, the torment that has been inflicted on them in this world, such as the fulfillment of the Prophet's prayer at the time of the Battle of Badr, namely the pouring down of favorable rains. the Muslims and harm the polytheists so that the Muslims get a glorious victory. Also like the total defeat of the polytheists at Fath Makkah so that their strength becomes completely destroyed. Even so, their problems will be returned to Allah, because on the Mahsyar day later Allah will show the Prophet Muhammad the whole punishment that they will feel. Then Allah will reward them according to the deeds they have done and nothing can prevent the revenge and torment they will feel and experience. Allah said: So be patient you (Muhammad), indeed Allah's promise is true. Even though We show you some of the torment that We threatened them with, or even We let you go (before their death), it is to Us that they will be returned. (Gafir\/40: 77) And Allah said: Or We will show you (the punishment) that We have threatened them with. So indeed, We have power over them. (az-Zukhruf\/43: 42)"
		   },
		   {
			"id": 1411,
			"surah": 10,
			"ayat": 47,
			"tafsir": "This verse explains that Allah has sent messengers to every people, when the people need them. The purpose of sending messengers is to provide various guidelines that they must follow, such as the main points of faith and all good deeds that save them from torment on the Day of Judgment. When the apostles had come to them and had conveyed to them instructions that they should know about religious affairs, they should not have made excuses to reject and oppose them. On the Day of Judgment, Allah will also give a decision about what they should feel as fair as possible, and they will not be wronged in the least, that is retribution that is commensurahte with the actions they have committed, therefore they are entitled to be subjected to painful punishments."
		   },
		   {
			"id": 1412,
			"surah": 10,
			"ayat": 48,
			"tafsir": "In this verse it is explained that they will ask the Prophet and his followers about when the promise that has been promised to them will come true. The question was a mocking question to the Prophet and his followers as if according to their judgment that Allah's promise would not come true. Allah's promise that was asked of the Prophet and his followers was Allah's threat that would be inflicted upon them both the torments in this world and the torments in the hereafter. Allah says: ... So that when they have seen what was threatened to them, both the doom and the Last Hour, then they will know who is worse position and weaker army. (Maryam\/19: 75) And His word: Say (Muhammad), \"I do not know, whether the doom threatened for you is near or whether my Lord has decreed the time is still far away. (al-Jinn\/72: 25)"
		   },
		   {
			"id": 1413,
			"surah": 10,
			"ayat": 49,
			"tafsir": "Allah taught Rasulullah SAW the answer that must be said to them by ordering Rasulullah SAW to tell them that Rasulullah SAW does not have the power to bring harm and does not bring benefit to him. Because the Messenger of Allah is only a messenger of Allah who has no power to speed up or slow down the coming of the punishment that Allah has promised them, just as he also cannot delay the arrival of Allah's help that Allah has promised to the Muslims. However, the benefits and harms that are inflicted on humans are nothing but the will of Allah alone. That means if Allah wills something to happen, then it has nothing to do with the will of His messenger, because that will belongs solely to Allah who takes care of the universe. The Messenger's duty is only to convey Allah's will, not to create will. If the Messenger of Allah knows about things that are unseen, it is nothing but because he knows it from Allah's revelation alone. Allah's Word: Say (Muhammad), \"I have no power to bring benefit or reject harm to myself except what Allah wills. If I had known the unseen, I would have done as much good as possible and no harm would have happened to me. I am only a warner, and bearer of good tidings for the believers.\" (al-Araf\/7: 188) As an affirmation, Allah explains that every human being has a certain time of death by Allah. Death will come when the time that has been determined by God has arrived. The time of death is included in Allah's knowledge which cannot be known by anyone other than Him. So when their death has come they are not able to postpone it for a moment, nor are they able to advance the time from the predetermined time. Likewise, the Messenger of Allah will not have the power to determine the short length of death that has been determined by Allah."
		   },
		   {
			"id": 1414,
			"surah": 10,
			"ayat": 50,
			"tafsir": "Allah ordered the Messenger of Allah to tell the polytheists so that they would explain what they would do if the torment of Allah that was promised to them came suddenly. Whether it comes at night when they are deep asleep, or during the day, when they are busy with their business, do those who sin ask to be hastened too, then what do they want, do they want the afterlife torment that will befall to them on the Day of Judgment. So whatever their choice, it only shows their shortsightedness and stupidity, because God's promise will definitely come and no one can stop it. This statement contains ridicule against them because in general people who do evil and wallow in lawlessness are afraid of the torment that will befall them. Gradually the torment will surely come, and they will not be able to escape the torment."
		   },
		   {
			"id": 1415,
			"surah": 10,
			"ayat": 51,
			"tafsir": "In this verse, Allah orders the Messenger to ask them whether the polytheists would only believe Allah's threat to punish them after the punishment they feared had occurred. Even though at that time their faith was no longer useful, then what is the use of them always asking for the torment promised to them to be hastened, or is the request for haste only to show their attitude which always denies Allah's verses and responds with arrogance?"
		   },
		   {
			"id": 1416,
			"surah": 10,
			"ayat": 52,
			"tafsir": "Allah explained that if they still do not want to believe, let them be told that they will feel Allah's punishment which will definitely come and forever. God's punishment that will be inflicted on them is as a reward for what they do in this world. They will be rewarded according to the deeds they have done according to their own choice, such as denying the truth of Allah's verses, associating partners with God, causing mischief on earth and their stupidity does not want to stop being hostile to the Messenger of Allah and denying the resurrection day."
		   },
		   {
			"id": 1417,
			"surah": 10,
			"ayat": 53,
			"tafsir": "Allah explained to the Prophet that the Quraysh disbelievers would ask him very important news, namely regarding Allah's threats that would be inflicted upon them, the torments of this world and the torments of the hereafter. Is the promise really going to happen or is the threat just in the form of news to frighten them. Such questions show their own doubts, because when they belie Allah's verses they will not believe in the truth of their words because they are influenced by feelings of hostility towards the Prophet Muhammad and are only devoted to the beliefs of his ancestors. Facing this question, Rasulullah SAW was ordered to answer that what was reported was really going to happen. Even in that answer God stated with an oath that showed that the promise was really going to happen. Allah's Word: Indeed, the punishment of your Lord will surely come, nothing can prevent it. (ath-thur\/52: 7-8) At the end of the verse Allah emphasizes that if Allah has sent down the punishment promised to them, then they will never escape from this threat, even though they try to escape from the torment. Allah says: And verily we (jinns) have suspected, that we will not be able to escape (from the power) of Allah on earth and not (also) be able to escape (from) Him. (al-Jinn\/72: 12)"
		   },
		   {
			"id": 1418,
			"surah": 10,
			"ayat": 54,
			"tafsir": "Allah explains that if everyone who wrongs themselves by associating partners with Allah with other gods, has all the wealth that is on earth, and is given the opportunity for them to redeem themselves, so that they are safe from the torment of Allah with all the wealth that is they have, surely their guilt is not worth their ransom. Moreover, at that time repentance or sacrifice is no longer acceptable. There is no more protection for them to save themselves from the torment of Allah. However, they tried to hide their regrets. This is because they have truly realized that all their efforts are useless, whether they scream at the top of their lungs or silence a thousand languages. At that time God's decision was determined between them in the fairest way. They will feel the recompense of all their actions, which fanatically followed their forefathers who still wallow in polytheism. When they receive such torture it cannot be said that God is wronging them, but they are themselves the ones who are wronging themselves. The torment of Allah that will befall them is described as follows: Verily, We have warned you (unbelievers) of a near doom, on the day when mankind sees what his hands have done; and the heathen say, \"I wish I were dirt.\" (an-Naba\/78: 40) And His words: O, woe to me! If (in the past) I didn't make so and so (my) close friends. (al-Furqan\/25: 28) And His words: Indeed, he has led me astray from the warning (Al-Quran) when it (Al-Quran) has come to me. And satan is indeed a traitor to humans. (al-Furqan\/25: 29)"
		   },
		   {
			"id": 1419,
			"surah": 10,
			"ayat": 55,
			"tafsir": "In this verse, Allah explains the signs of His power in implementing His laws which cannot be hindered by anyone, and cannot be redeemed with any kind of ransom, because the heavens, the earth and everything in them belongs to Allah. God asks attention to all human beings, so as not to neglect His provisions. What is meant by everything that exists between the heavens and the earth in this verse, is all natural objects including intelligent creatures. This is meant so that people like to think that the heavens, the earth and all that is in them are under His control, and Allah establishes His laws according to His will. He can give gifts to His servants according to His will, and give punishment to His creatures according to His will too. In addition, Allah also emphasized that whatever promises Allah has made to His servants through His messengers, are the true promises for sure and will come because Allah has power over something, of course He has the power to fulfill His promises. No one can influence Him. Then Allah rebuked most of the polytheists because they always denied Allah's verses and the Resurrection Day, even though they had read the truth of Allah's verses, and had heard the guidance brought by the Messenger of Allah. This shows that their judgment is no longer pure, but influenced by their hostility to the Prophet, and their bigotry towards the religion of their ancestors."
		   },
		   {
			"id": 1420,
			"surah": 10,
			"ayat": 56,
			"tafsir": "Allah emphasizes that He is the Substance that shows, which can turn on and off. He has the power to determine the life and death of all creatures and living things in the heavens and the earth. There is no other Substance that influences Him and hinders His will. He also has the power to raise people from their graves and return them to Him, on the day that has been promised, namely the Day of Judgment, at which time humans will be judged, and will be given retribution accordingly, according to their deeds."
		   },
		   {
			"id": 1421,
			"surah": 10,
			"ayat": 57,
			"tafsir": "Allah calls out to all human beings that the Qur'an has been brought to them through His messenger. It contains life guidelines that are very useful for their lives. In this verse, the guidelines for life are mentioned, in response to their denial of Allah's verses and His threats. This verse summarizes the functions of the Al-Qur'an al-Karim in improving the human soul, including: 1. Mauidah, which is a lesson from Allah to all human beings so that they love what is right and right, and stay away from wrong and evil deeds. This lesson must really be realized in their actions. 2. Syifa is a cure for diseases that nest in the human chest, such as diseases of shirk, disbelief and hypocrisy, including all mental illnesses that disturb the peace of the human soul, such as hopelessness, weakness of conviction, following lust, harboring hatred and envy towards humans , feelings of fear and cowardice, loves evil and evil, and hates truth and justice. 3. Huda, namely guidance to the straight path that saves people from misguided beliefs by guiding their minds and feelings so that they have true beliefs by paying attention to the evidence of Allah's truth, and guiding them to be active in doing good deeds, by prioritizing the benefits they will get from sincere charity and carrying out the applicable legal rules, which actions are permissible and which actions must be avoided. 4. Rahmah, namely the gift of Allah given to believers, which they can learn from the instructions contained in the Al-Qur'an. Believers who believe and implement the instructions contained in the Qur'an will feel the fruit. They will live together, help each other, love each other, work together to uphold justice, eradicate crime and cruelty, and help each other to gain prosperity. Allah says: Muhammad is the Messenger of Allah and those who are with him are harsh towards the disbelievers, but compassionate towards each other. (al-Fath\/48: 29) And His words: Then he is among those who believe and instruct one another to be patient and instruct one another to be compassionate. (al-Balad\/90: 17) The four characteristics contained in this verse were created by Allah according to the nature of human events. That is, according to reason, humans have a tendency to receive good advice, receive advice that can cure their mental turmoil, receive instructions that can be guided for the happiness of their life and like to live in peace, love and affection between them. The attribute of mercy is specifically addressed to believers in this verse, because they are the ones who want to use the Qur'an as a guide, carry out His commands and stay away from His prohibitions. While the disbelievers and polytheists do not want to believe let alone work on its contents."
		   },
		   {
			"id": 1422,
			"surah": 10,
			"ayat": 58,
			"tafsir": "Allah ordered the Prophet Muhammad to tell His people that Allah's mercy is the most important gift, surpassing other virtues given to them in this world. Therefore, Allah commands them to be happy and grateful for the blessings they receive, which exceed other pleasures. The joy of the believers for sticking to the Qur'an is described in another verse as follows: Allah says: And on that day (victory of the Romans) the believers will rejoice. (ar-Rum\/30: 4) And His words: And those whom We have given the book to them are happy with what (the book) has been revealed to you (Muhammad). (ar-Rad\/13: 36) It is said that Allah's grace and His mercy are better than anything else they can achieve, because Allah's grace and His mercy that emanates from the Qur'an are eternal for them, while the enjoyment others are mortal and temporary, which they can only feel as long as they wade through life in the world, when they return to the afterlife, the pleasures they can collect in that world are no longer useful to them."
		   },
		   {
			"id": 1423,
			"surah": 10,
			"ayat": 59,
			"tafsir": "In this verse, Allah commands His Messenger to tell the polytheists who deny the truth of Muhammad's revelations and apostles that whether all the sustenance that has been sent down to them, which is the source of their livelihood, whether plants or livestock, can be determined law, lawful or unlawful by themselves. Even though it is clear that it is God who created everything. So actually they have no right to determine the law. That is why Allah ordered His Messenger to tell them that the one who has the right to determine the law is the one who created everything, namely Allah. Or do they think that Allah has given them permission to determine the law or do they just do that by making up things on behalf of Allah, or do they just think that what they have determined is in accordance with Allah's provisions, namely what they have forbidden, that is what Allah has made unlawful and what they have made lawful, that is what Allah has made lawful? The first possibility, namely that they received Allah's permission, is impossible because they themselves have denied the revelation itself, so the second possibility that can happen is that they determined the law only on the basis of mere conjecture, or in other words they invented it on behalf of Allah. . And they provide some of the crops and animals (shares) for Allah, saying according to their estimation, \"This is for Allah and this one is for our idols.\" The portion that is for their idols will not reach God, and the portion that is for God will reach their idols. Their decision is very bad. (al-Anam\/6: 136)"
		   },
		   {
			"id": 1424,
			"surah": 10,
			"ayat": 60,
			"tafsir": "Allah reveals the mistake of their assumption that on the Day of Judgment everyone will be given a reward according to their deeds, they will not be brought to account, they will not be punished, for lying in the name of Allah, or because they think that they have the right to determine the law, halal and something unlawful. It was their mistake that led them to an even bigger mistake, that is, they deliberately dared to interfere in matters that actually belong to Allah, oppose the revelations sent down from Allah and associate partners with Allah with other gods. They (the genies) worked for Solomon according to what he wanted, including (making) tall buildings, statues, plates that were (large) like ponds and pots that were fixed (on the stove). . Work, O family of Dawud, to give thanks (to Allah). And very few of My grateful servants. (Saba\/34: 13) Allah explains the reason why they should receive punishment, namely because of their own mistakes. Allah has bestowed His very great gift on human beings, namely sending down revelations to be used as a guide for their lives, so that they live happily in this world and in the hereafter, and has determined what is lawful and unlawful in everything, so that they are guided to a prosperous and prosperous life. Allah has sent down various kinds of sustenance to meet their needs. At the end of the verse Allah regrets why most people do not want to be grateful for all kinds of blessings that have been given to them, they even wrong themselves by going against the provisions and laws that have been established by Allah. They do not want to be guided by the revelations that have been revealed to them. Most of them live according to their desires and squander their possessions, because they feel arrogant and proud."
		   },
		   {
			"id": 1425,
			"surah": 10,
			"ayat": 61,
			"tafsir": "Allah explained to His Messenger and the Muslims that when Rasulullah carried out important matters concerning the interests of the community, when he recited verses from the Qur'an, and when humans carried out their deeds, nothing was separated from Allah's supervision. He witnessed all the deeds at the time they were performed. Important matters in this verse are all kinds of matters that concern the interests of the people, such as the affairs of Islamic da'wah, namely inviting the people to follow the straight path, in a wise and good way, awakening the people's awareness so that they are interested in carrying out religious orders and staying away from His prohibitions, including the affairs of the education of the people and ways of realizing that education so that it becomes a reality that is beneficial for the welfare of the people. It is also stated that the verses of the Al-Qur'an that are read cover all matters based on the patterns of their implementation, one cannot deviate from them, because in principle the affairs of all people have been regulated in that book. Then it mentions all the practices carried out by His servants, which have been outlined by the revelations sent down to His messengers, by referring to the contents of those revelations in their daily affairs, and obeying the apostles, because what the apostles say and do becomes a good example. good for all people. Allah emphasizes that all kinds of deeds carried out by His servants, none of them escape Allah's knowledge and supervision, even though these deeds are smaller than the smallest things, or those matters are very important so that humans cannot control them. He mentions the small affairs of the smallest and the most important affairs, so that it will be reflected in the hearts of His servants, that Allah's knowledge is so perfect that there is not a single matter that escapes His knowledge, no matter how trivial the matter is and how important it is, Moreover, the matter is beyond human ability. Knowledge of Allah does not only cover all kinds of affairs that exist on earth, but It also includes all kinds of affairs in the heavens, whose affairs are more complicated and more difficult to describe in the human mind. This is to strengthen the meaning of the breadth of Allah's knowledge, so that His majesty and power are felt. At the end of this verse, Allah states emphatically that there is not a single matter except that it has been recorded in a clear book, namely the Lawh Mahfudh, meaning that all kinds of affairs are all controlled and controlled and controlled by the knowledge of Allah, the Most Extensive and recorded in His clear book. in Lauh Mahfudh. Allah says: And the keys of all that is unseen are with Him; no one knows but Him. He knows what is on land and in sea. Not a leaf falls that He doesn't know about. There is not a grain in the darkness of the earth nor anything wet or dry that is not written in a real Book (Lauh Mahfudh). (al-Anam\/6: 59)"
		   },
		   {
			"id": 1426,
			"surah": 10,
			"ayat": 62,
			"tafsir": "In this verse, Allah directs the attention of Muslims so that they have full awareness, that in fact the guardians of Allah, will not feel anxiety and discouragement. The guardians of Allah in this verse are those who believe and are pious, as a designation for those who defend Allah's religion and those who uphold His laws in society, and as the opposite of those who people who are hostile to His religion, such as polytheists and infidels (see the tafsir of surahh al-Anam\/6: 51-55). It is said that there is no fear for them, because they believe that Allah's promise will surely come, and His help will certainly come, and His guidance will certainly guide them to the straight path. And when a disaster befalls them, they remain patient in facing and overcoming it with steadfastness and trust in Allah. (See the tafsir of surahh al-Baqarah\/2: 249). Nor are their hearts troubled, for they have believed and are willing that everything that happens under God's laws is in His hands. They are not discouraged by parting with the world, with all its great pleasures. They are not afraid of receiving Allah's punishment on the Day of Judgment because they and all their hearts have been surrendered to the interests of religion. They do not feel they have lost anything, because they have received invaluable guidance (see the tafsir of surahh al-Baqarah\/2: 2 and al-Anfal\/8: 29)."
		   },
		   {
			"id": 1427,
			"surah": 10,
			"ayat": 63,
			"tafsir": "Allah explains who is meant by the happy guardians of Allah and why they are like that. The explanation obtained in this verse shows that the guardians are people who believe and are pious. What is meant by faith here is someone who believes in Allah, in His angels, in His books, in His messengers, in the last day, all good and bad events are from Allah, and do what should be done. by believers. Meanwhile, what is meant by piety is protecting oneself from all actions that are contrary to Allah's laws, both Allah's laws which regulate the order of the universe, or the syara' law which regulates the order of human life in the world (see the tafsir of surahh al-Anfal\/8: 10)."
		   },
		   {
			"id": 1428,
			"surah": 10,
			"ayat": 64,
			"tafsir": "Allah explained that they got good news, which they will feel in their lives in this world and in the hereafter. The good news that they found was the good news that Allah had promised through His Messenger. In the world, the good news includes the victory they have won in upholding Allah's word, the success in life because they have followed the right path, and the hope they have gained as caliphs in the world. As long as they stick to Allah's law and defend the truth of Allah's religion, they will receive husnul khatimah. As for the good news that they will find in the hereafter, that is, they are safe from the torment of the grave, from the touch of the fire of hell and eternally they will be in paradise Adn (see the tafsir of surahh al-Anfal \/ 8: 10). God confirms that there is no change from the promises of God. It means that the good news that Allah has promised in His book and is confirmed by the words of His Messenger, both Allah's promises that they find in this world and those that they will find in the hereafter, will not change because it is the fruit of true faith, that they live and from the piety that they carry out. At the end of this verse Allah states that what they get is a glorious victory that has no equal in the world, namely the happiness of living in heaven and being released from the torments of hell."
		   },
		   {
			"id": 1429,
			"surah": 10,
			"ayat": 65,
			"tafsir": "Allah forbids Muslims to feel worried and upset because of the words of polytheists who are hostile to the religion of Allah and deny Allah's revelations, because in fact they do not have victory, strength and protection, but Allah is the one who has the power to give everything to His creatures according to His will. -His. Muslims are prohibited from being afraid of facing polytheists just because of their large numbers (see Tafsir of surahh al-Anfal\/8: 10). At the end of this verse, Allah confirms that He is the All-Hearer to the words of polytheists who deny the Messenger and deny the truth of revelation. The All-Knowing of the actions they committed against the Prophet and his followers, such as their deception to defeat the religion of monotheism and their persecution of the Prophet and his followers."
		   },
		   {
			"id": 1430,
			"surah": 10,
			"ayat": 66,
			"tafsir": "This verse reminds Muslims that everything in the heavens and on earth is under the power of Allah, including the statues they worship and associate with Allah, are also under His power. The polytheists associating partners with Allah with other gods is not based on true belief, but only based on conjecture. They worship statues because they think that the statues they worship can help them, and can draw closer to God, so that God will answer their prayers. Such an assumption arises in their minds, because they think that Allah is the same as their leaders and superiors who are ruthless and unjust. If they want to get in touch with their superiors or wish to submit a request to them, the request will not be accepted or received service as it should be, if it is not first through the right hand of their leader. At the end of the verse, Allah confirms that polytheists follow such assumptions because of ignorance which will not lead them to the slightest truth."
		   },
		   {
			"id": 1431,
			"surah": 10,
			"ayat": 67,
			"tafsir": "Allah confirms to the Muslims that it is Allah who created the night for humans, so that humans can rest at that time. He also created a bright day with sunlight so that people at that time could seek His grace. Alternation of day and night is regulated by Allah with His laws. By His laws, the heavenly bodies revolve in their predetermined orbits. In regulating the circulation of the heavenly bodies, Allah does not need other gods to help, but with His high wisdom, Allah has the power to regulate the circulation of these objects. Due to the circulation of the celestial bodies, there are time differences and changes in the weather, so that humans can choose the right time to fulfill their life needs and fulfill their obligations to their Creator. At the end of this verse, Allah explains that those who really pay attention to the verses recited by the Prophet Muhammad and think carefully about their contents, and pay attention to Allah's laws that apply in the universe, will certainly acknowledge the oneness and power of Allah. ."
		   },
		   {
			"id": 1432,
			"surah": 10,
			"ayat": 68,
			"tafsir": "Allah explains to the Muslims that Jews, Christians and polytheists say that Allah has children, such as the belief of the Jews that Uzair is the son of Allah, the belief of the Christians that Isa Al-Masih is the son of Allah, and the - polytheists suspect that the angels are the daughters of Allah. God refutes their presuppositions and accusations. How can these accusations be justified because He is the One who has created, owns, and is sufficient, even the heavens, the earth, and the things that exist between them are His creations. He is the Master, Allah does not need all existing things, on the contrary they are the ones who need Allah. If humans need children, it is appropriate, because children are the ones who continue their lineage and become their pride. But God does not need children because He created humans and His descendants. Allah emphasized that the People of the Book and polytheists who think so, do not have the slightest reason to prove the truth of their assumption, even that assumption only shows their own stupidity. That is why Allah stated at the end of this verse, that they are stating something that they themselves do not know the truth of, that is a great folly. Especially after they received information from the revelations that were read out, and they still maintained their assumptions, this shows their ignorance. From this verse it can be learned that people who say something without having a reason are showing their own stupidity."
		   },
		   {
			"id": 1433,
			"surah": 10,
			"ayat": 69,
			"tafsir": "Allah ordered His Messenger to say to those who associate Him with other gods, or those who say that Allah has children, that people who make ignorance of Allah like them will not be successful. because what they hope for, such as their safety from the torments of hell fire, and a happy life thanks to the help of the statues they dedicate, will not come true."
		   },
		   {
			"id": 1434,
			"surah": 10,
			"ayat": 70,
			"tafsir": "God gives an explanation that they get temporary pleasure in the world, deceived by the pleasures of this mortal world. The pleasures of this world when compared with the pleasures of the hereafter are meaningless. Then on the day of resurrection they will be returned to Allah. At that time they will be gathered in Padang Mahsyar, and held responsible for all the actions they have done in the world. Then Allah will give them punishment according to their actions, namely unspeakable painful torments, caused by their disbelief of Allah's verses and lies against the Prophet Muhammad."
		   },
		   {
			"id": 1435,
			"surah": 10,
			"ayat": 71,
			"tafsir": "Allah ordered the Prophet Muhammad to tell the polytheists of Mecca about an important event in the story of Prophet Noah and his people. Prophet Nuh as stated to his people about his determination to continue spreading the religion of Allah while completely surrendering all decisions to Allah. It did not matter whether his people objected to his presence in their midst to call them to worship Allah, or whether they objected to the warnings he conveyed about the proofs of the oneness of Allah. Thanks to his determination and his submission, Prophet Noah did not hesitate to oppose his people so that they made up their minds by including their sacrifices to destroy him. In fact, he advised them to make plans openly, not secretly. Then when the plan was ripe with an open consensus, Prophet Noah called on them to immediately carry out the plan to kill him and not delay it."
		   },
		   {
			"id": 1436,
			"surah": 10,
			"ayat": 72,
			"tafsir": "This verse explains that Prophet Noah as told his people that he would not ask them for anything in return and would not gain worldly benefits from his missionary duties, except for rewards and rewards from Allah. Therefore there is no reason for them to turn away from his call. If they had turned away from the warnings and calls, Noah would not have been harmed or inconvenienced in the slightest. He was commanded to be a person who upholds all of Allah's commandments and submits to Him."
		   },
		   {
			"id": 1437,
			"surah": 10,
			"ayat": 73,
			"tafsir": "In this verse it is explained that even though Prophet Noah as had stated the truth of his call and invitation with logical reasons, his people continued to deny it and belied his apostleship. Because the possibility of them believing had been closed, God's punishment was sent down to them in the form of a terrible hurricane and a great flood that drowned them. Prophet Noah and those who believed with him, were saved by Allah from the typhoon. They boarded an ark they made before the typhoon hit at the direction of Allah. It is they who become the inhabitants of the earth and replace the people who have perished, namely those who deny the verses of Allah. In one of His words, Allah said: And how many people after Noah, We have destroyed. And sufficient is your Lord, the All-Knowing, All-Seeing of the sins of His servants. (al-Isra\/17: 17) Allah then taught the Prophet Muhammad to convey this news to those who continuously denied the Messenger. What happened to the people of Prophet Noah, of course, will also be experienced by his people if they continue to deny his apostleship."
		   },
		   {
			"id": 1438,
			"surah": 10,
			"ayat": 74,
			"tafsir": "In this verse Allah explains about the sending of the apostles after the typhoon of Prophet Noah as. The prophets who were sent included Prophet Hud, Saleh, Ibrahim, Lut and Shuaib as. They were sent to their respective peoples; Prophet Hud to the ad people, Prophet Saleh to the samud people, and Shuaib was sent to his people, the people of Madyan, also sent to the people of Aikah, their neighbors. These two peoples are actually one family, they have the same language and the same homeland. Every prophet came to his people with proofs of the truth of his apostleship and gave instructions to the people. Each prophet outlined life guidelines for his people according to the time, situation and circumstances of their environment. Most of the people of the prophets did not believe, they even belied him like Noah's people. The habit of blind obedience to their leaders is always followed by the next generation. Therefore, just like the hearts of their forefathers, their hearts were locked in death, so the consciences of later generations were also locked. Such things are the result of their actions that exceed the limits. The Arab polytheists who opposed the Prophet Muhammad saw, their consciences were as dark as those of the peoples of the past. Their hearts are closed to accept the truth. They belied the Apostle and did disobedience. Allah's Sunnah still applies to those who challenge and deny religion. If the Arab polytheists persist in their denial, God's punishment will befall them just like the people of the past. Allah's Word: As the sunnah of Allah which (also applies) to those who have gone before (you), and you will not find changes to the sunnah of Allah. (al-Ahzab\/33: 62)"
		   },
		   {
			"id": 1439,
			"surah": 10,
			"ayat": 75,
			"tafsir": "After explaining the sending of the apostles to their respective peoples, in this verse, Allah specifically explains the sending of Musa and Aaron as to Pharaoh and the leaders of his people. The story of Musa (as) is found repeatedly in the Quran, because this story contains an important lesson. Musa as was a messenger of Allah who was confronted by a Pharaoh king who had great power and was the king of a country that had a high civilization and culture. It was because of his greatness that he became arrogant and persecuted his people. He was surrounded by the leaders of his people (the Qibthy nation) who had a great influence on him and misled him a lot. The native population of Egypt was greatly influenced by these leaders. If their leaders deny, then they also deny, if they believe, then they also believe. All their affairs and interests always depend on these leaders. When the Prophet Musa proved the truth of his apostleship with several miracles, they still did not want to believe because of the arrogance nesting in their hearts. Their minds actually acknowledge the truth of Musa's apostleship. They can distinguish between magic and non-magic (miracles) because they know what it really is. But they still deny, because they are people who are full of sin. Allah's Word: And they deny it because of their tyranny and arrogance, even though their hearts believe in it (the truth). So see how the end of those who do damage. (an-Naml\/27: 14)"
		   },
		   {
			"id": 1440,
			"surah": 10,
			"ayat": 76,
			"tafsir": "This verse explains the opinion of the leaders of the Pharaohs that miracles and proofs of the truth are real magic for those who witness and pay attention to them. Their accusations were very bad, because those who made the accusations were fully aware that the accusations were not true. The extraordinary miracle that was born by Musa (as) was not his own deed, but the event was a miracle that occurred by the power of Allah."
		   },
		   {
			"id": 1441,
			"surah": 10,
			"ayat": 77,
			"tafsir": "Allah explained Musa's objection that it was not appropriate for them to accuse the signs of Allah's power in the form of miracles when they were brought to them. Their eyes witness extraordinary events and thrilling feelings. If those events were just magic, of course at other times it would be defeated by magic too. But it became a fact that their sorcerers failed to beat the miracles of Prophet Musa. The sorcerers will not succeed in gaining victory with their magic. Magic is sleight of hand, sooner or later he will be exposed to his deception and deceit."
		   },
		   {
			"id": 1442,
			"surah": 10,
			"ayat": 78,
			"tafsir": "In this verse Allah explains the attitude of the leaders of the Qibty nation, after they failed to put forward a strong argument to break the truth of the Prophet Musa as, they looked for reasons to defend and defend their traditions or customs. They alleged that Moses' coming to them was to force them to abandon the customs and traditions they inherited from their ancestors, and then force them to follow the religion of Prophet Musa. According to them, the Prophet Musa's efforts were aimed at becoming a religious and state leader in Egypt along with his brother Harun. Their bad opinion of the arrival of Moses and his purpose made them determined not to believe in the teachings he brought and not to become his followers."
		   },
		   {
			"id": 1443,
			"surah": 10,
			"ayat": 79,
			"tafsir": "Then in this verse, Allah explains Pharaoh's attitude after being influenced by the leaders of his people with their accusations and bad views towards Moses. He then ordered them to summon clever sorcerers in order to match and destroy the miracles of Prophet Musa. Pharaoh's actions like this were to maintain his dignity, glory and position and hinder the development of the power of Musa and the Children of Israel in his kingdom."
		   },
		   {
			"id": 1444,
			"surah": 10,
			"ayat": 80,
			"tafsir": "Then after the sorcerers had been summoned to an open field they came to Moses to offer him whether he had cast his staff first or they had started. Musa invited them to show their magic first. So they threw down their ropes and sticks. With magic power, the ropes and sticks turned into snakes. They dazzle the eyes of men so as to frighten the hearts of those who witness them."
		   },
		   {
			"id": 1445,
			"surah": 10,
			"ayat": 81,
			"tafsir": "After they finished showing their magic, Musa said to them without paying the slightest heed to the awesomeness of the magic they showed, that what they were doing was mere magic, or an attempt to distort human vision. In essence, there is no change that occurs when the sticks and ropes turn into snakes. Meanwhile, what Moses will do is a miracle from God's power. Allah will cancel the magic with the miracle brought by Prophet Musa (as). It is clear that magic is a human act, not an extraordinary event. So Moses threw down his staff, and Allah turned the stick into a snake, and the snake swallowed the magic snakes that they did because Allah would not allow the magicians' deeds to continue."
		   },
		   {
			"id": 1446,
			"surah": 10,
			"ayat": 82,
			"tafsir": "Allah confirms that He with His words strengthens the truth. With that truth, humanity will prosper and be protected from tyranny. The word of Allah is Allah's rule that is instilled in the Shari'a which was conveyed to His messengers. With that sentence, Moses was able to defeat Pharaoh and free the Children of Israel from Pharaoh's slavery, even though Pharaoh and his princes did not like this."
		   },
		   {
			"id": 1447,
			"surah": 10,
			"ayat": 83,
			"tafsir": "In this verse Allah explains the condition of Moses and his people before they left Egypt. Pharaoh's failure with the leaders of his people and the sorcerers pushed Pharaoh to do even more cruel acts. He planned to kill the Prophet Musa and the people of the Children of Israel. This plan caused fear among the Children of Israel. Therefore, not many of them believe in the Prophet Musa. Those who believe are generally young people. Prophet Musa's people were afraid of Pharaoh and the leaders of his people who always tried to torture them and force them to apostatize from the religion of Musa as. Pharaoh at the time of Musa as, was one of the most cruel kings in Egyptian history. Because of that he was very feared by his people. He shed a lot of human blood and he also thinks of himself as God. The Israelites were made slaves in Egypt. God's Word describes Pharaoh's cruelty: And the leaders of Pharaoh's people said, \"Are you going to allow Moses and his people to do mischief in this land (Egypt) and leave you and your gods?\" (Pharaoh) replied, \"We will kill their sons and let their daughters live and indeed we have full authority over them.\" (al-Araf\/7: 127)"
		   },
		   {
			"id": 1448,
			"surah": 10,
			"ayat": 84,
			"tafsir": "After Musa saw the believers in a state of fear, he called on them to put their trust in Allah if they truly believed in Him accompanied by absolute submission and obedience to Allah's commands and prohibitions. Faith without real practice of the teachings of Allah and His Messenger, is a meaningless faith. Trust in Allah will be born from the soul of a believer and he is obedient in practicing his religious teachings within the limits of his ability. This verse shows that not all of the Children of Israel believed in Moses while they were in Egypt. Besides believing in Allah, one should also believe in the Prophet. Only then did he become a Muslim who surrendered and obeyed the orders and prohibitions of the religion brought by the Apostle. After the Jews left Egypt safely and arrived at Sinai, they demanded that Moses make a statue of God for them. Then, when they were left by Moses who was about to receive revelations on Mount Sinai, they made the calf as God and worshiped it. This event shows that not all Jews believe in and obey the teachings of Musa as"
		   },
		   {
			"id": 1449,
			"surah": 10,
			"ayat": 85,
			"tafsir": "Those who believed and obeyed when they heard Musa's call, they immediately greeted him with full obedience, even they only put their trust in Allah. They realize that the victory and happiness that God promises to believers depend on their faith, charity and trust. Then after trusting them, they pray to Allah to protect them from the crimes of the wrongdoers and protect them from the attempts of those who want to turn them away from religion."
		   },
		   {
			"id": 1450,
			"surah": 10,
			"ayat": 86,
			"tafsir": "This verse explains the continuation of the prayer of the Children of Israel when they asked Allah to deliver them from the power and cruelty of Pharaoh and the leaders of his people. For centuries they were in Pharaoh's slavery and they were subjected to forced labor and other gruesome and inhuman labour."
		   },
		   {
			"id": 1451,
			"surah": 10,
			"ayat": 87,
			"tafsir": "God ordered Moses and Aaron to look for several houses in the city of Egypt to be used as a place to live and protect their people and their activities. Allah ordered that the house be used as a place of prayer. Then specifically to Moses as the bearer of the Shari'a, Allah ordered him to give good news at a later date for those who believe in Allah and His messengers. It was in this sanctuary that the Prophet Musa filled their hearts with religious teachings and instilled faith and nobility of character into their souls."
		   },
		   {
			"id": 1452,
			"surah": 10,
			"ayat": 88,
			"tafsir": "In this verse, Pharaoh and the leaders of his people explain the defiance and arbitrariness of the Pharaoh and the leaders of his people, the anxiety and fear of the Children of Israel, and the complaints of Moses to Allah about the abundant blessings given to Pharaoh and his people such as gold jewels, luxurious clothes, and wealth. others, but all the favors that Allah has given them have actually led them astray from the path of Allah. In fact, they grew arrogant and persecuted over the wealth. God seems to let them in error so they do not believe. Then Prophet Musa prayed for the destruction of Pharaoh and the leaders of his people for the following reasons: First, Kufr towards Allah's favors. It is a fact that Pharaoh and the leaders of his people had great power and strength. In addition, science and technology reached its peak in the time of the Pharaohs in Egypt. The remains of the pharaohs, whether found in museums in Egypt or in Europe and America, show the height of their civilization and culture. Likewise ancient objects and ancient buildings found in Egypt. In government, Pharaoh holds absolute power even to his people he claims himself as god. Second, Reject the truth. The fact shows that Pharaoh and the leaders of his people have far left human and religious moral values. Human rights are not respected. They live in luxury, above the suffering of the people. Musa as has tried to bring Pharaoh and his officials to the path of Allah, by showing the evidence of his apostleship. He gave teachings about truth, justice, advice and warnings of Allah's punishment, and disaster, as a result of his actions. However, Musa's call was not received well and even received challenges and hostility. Thus the possibility of calling Pharaoh and his people to the way of Allah was closed and their faith could no longer be relied upon. Leaving Pharaoh and his superiors with great power, glory and strength while their basic principles of life are far lower than human and religious moral values, is very dangerous for world peace and the welfare of mankind. They, with their strength and power, commit immorality and corruption on earth, threatening the safety of mankind. Therefore, the Prophet Musa offered a prayer to Allah for the happiness of mankind, so that Allah would paralyze the Pharaoh's power by allowing them to go astray, because their error would result in their own destruction. Prophet Harun as the main assistant to Prophet Musa, agreed to the prayer of Prophet Musa."
		   },
		   {
			"id": 1453,
			"surah": 10,
			"ayat": 89,
			"tafsir": "In this verse God reveals to Moses and Aaron that their prayers for the destruction of Pharaoh and his power will be accepted by God. It has become God's decree. Then Allah ordered Musa and Aaron to keep carrying out His commands and continue to deliver calls to the way of Allah and prepare the Children of Israel to fight and move to leave the land of Egypt. Allah forbids following the path of those who do not follow God's Sunnah for His creatures, namely the law of cause and effect, such as demanding the immediate destruction of Pharaoh before his time or asking for the destruction to be postponed at a predetermined time. The time of Pharaoh's downfall must have come, because they could not escape God's law."
		   },
		   {
			"id": 1454,
			"surah": 10,
			"ayat": 90,
			"tafsir": "In this verse, Allah tells about the departure of the Children of Israel from the land of Egypt. When Prophet Musa asked Pharaoh to free the Israelites in Egypt from slavery, then allow them to return to Palestine, to practice their religion freely, Pharaoh refused the request. Finally Musa and his people fled from Egypt. Pharaoh and his army then chased them Pharaoh's entourage and his army almost caught up with Musa and his people when they were about to cross the sea. The Israelites were afraid of being caught by Pharaoh's troops, so Musa reassured his entourage by assuring them that they would witness the destruction of their enemies. So God revealed to Moses that he would strike his staff into the sea. The sea parted, entered Musa and his people walking in the dry crevices until they arrived safely across the sea. Pharaoh and his troops followed the same path but when they arrived in the middle of the journey, Musa stretched out his hand toward the sea, so the sea returned to normal. Pharaoh was swallowed up by the waves with his army. When he felt that he would drown to death, he declared his faith and Islam. He declared his faith in the God that the Children of Israel believed in. Statement of faith in Allah and Musa as, uttered with the sentence: \"I am a Muslim\". The confession of Islam contains faith in Allah and His Messenger, but this statement of faith was too late because it was stated at a time when he was almost drowning and no one could help him. Statements in such circumstances are not accepted by God. Allah's Word: So when they saw Our punishment, they said, \"We only believe in Allah and we disbelieve in the idols that we have associated with Allah.\" So their faith when they saw Our punishment was no longer useful to them. That is the (provision) of Allah that has applied to His servants. And at that time the disbelievers lost. (Gafir\/40: 84-85)"
		   },
		   {
			"id": 1455,
			"surah": 10,
			"ayat": 91,
			"tafsir": "In this verse Allah tells of Pharaoh's condition when he expressed his faith in despair, he was told that it was inappropriate for him to say faith and Islam at such a time because the statement was only to avoid death and seek salvation from disaster and after he was overcome with despair. Even though in the past he denied God and even claimed to be God so that he acted arbitrarily towards fellow human beings and committed persecution on earth. So such a statement of faith and Islam is not accepted because it was not born out of sincerity, but out of despair."
		   },
		   {
			"id": 1456,
			"surah": 10,
			"ayat": 92,
			"tafsir": "Then Allah in this verse explains that on the day of his death, the body of Pharaoh will be removed from the bottom of the ocean and thrown onto land so that those who doubt his death will become convinced and become a lesson for people afterward. How great and how wide is the power and strength of a person, if he disobeys the commands of Allah and abandons the instructions of His Messenger, surely he will experience destruction. God's promise to help His prophets is sure to come true. Many signs of Allah's power are found in human history. But most people do not want to contemplate these signs and are not aware of God's law that applies to mankind."
		   },
		   {
			"id": 1457,
			"surah": 10,
			"ayat": 93,
			"tafsir": "After Allah ended the story of Pharaoh, then in this verse, Allah mentions the history of the Children of Israel, when they arrived at the place promised by God. Allah has placed them in a beautiful land, namely the land of Palestine. As also explained in another verse the word of Allah: And We have left to the oppressed people the eastern and western parts of the earth which We have blessed. (al-Araf\/7: 137) Allah bestows good and varied sustenance, such as livestock, plantations, agriculture, and fisheries on land, such as the Dead Sea, and in the seas to the Children of Israel. They live in harmony and peace and happiness in the new land. But then a great dispute arose among them after they studied the Torah and His laws. In fact, it is not natural for them to have disagreements because Allah has explained clearly to them His Shari'ah. If a dispute arises then it is due to personal factors and group interests between them. Allah's Word: There is no dispute among those who have been given the Book, except after they have acquired knowledge, because of envy among them. (ali Imran\/3: 19) Envy and hatred of other groups, personal ambition, boasting and class interests as well as subjective factors greatly influenced the Jews in studying the Scriptures. They do not hesitate to distort the meaning of the verse from its true meaning. Allah's Word: (That is) among the Jews, who change the sayings of their places. (an-Nisa\/4: 46)"
		   },
		   {
			"id": 1458,
			"surah": 10,
			"ayat": 94,
			"tafsir": "Allah explains the attitude of the Jewish and Christian priests towards the Books of Allah which have been revealed to the messengers sent to them by saying, \"If you, O Muhammad, have doubts about the past messengers and the books which were revealed to them, then ask the Jewish and Christian priests who have known and read the books that We have sent down, before I sent down the Qur'an to you.\" According to the Arabic language, the expression in this verse is not to explain Muhammad's doubts, but to state that Muhammad truly believed and believed in the messengers sent by Allah and the books revealed to them. Only Jews and Christians are doubtful. Their doubts were deliberately made to cover up what was really in their hearts, namely believing in the truth of Muhammad's message and prophethood. Therefore, the meaning of this verse is that Allah revealed to Muhammad that he (the Prophet Muhammad) was sure and believed that what was revealed to you was something of truth and truth that must be believed. The only ones who doubted were Jews and Christians. Their doubts were stated solely to cover up their actions that had changed and exchanged the contents of the Torah and the Bible. They have read the Torah and the Gospels which explain the main points of the religion that God approves of, the apostles that God has sent and those that He will send later. But it was their lust that told them to do this forbidden act, so they led their followers astray. Therefore, actually the Jewish and Christian priests really know what is right and what is wrong. If asked to them something the right, they will definitely be able to answer it correctly. But they don't want to do it. This verse is an allusion to Jewish and Christian priests and reveals the sinful acts they have committed. This kind of expression is also found in other words of Allah, as in the following verse: And (remember) when Allah said, \"O Isa son of Maryam! Was it you who said to the people, \"Take me and my mother as two gods besides Allah?\" ( al-Maidah\/5: 116) If this verse is read at a glance, it will be understood as if it was Isa who ordered his people to acknowledge the existence of a father god, son god and mother god. But the purpose of this verse is to explain that Jesus as never doubt about the oneness of God. Those who preach that God is three, only Christians have changed and changed the contents of the Bible, such as exchanging the principle of the oneness of Allah contained in it with the principle of shirk. At the end of this verse Allah explains the attitude of the Prophet, people -Jews and Christians. Rasulullah SAW believes in Allah and in the Al-Quran which was revealed to him and believes in His oneness, while Jews and Christians have changed and exchanged the contents of Ta vein and the Gospel and associate partners with Him. Then Allah warned the Muslims not to do anything like the Christians and Jews did."
		   },
		   {
			"id": 1459,
			"surah": 10,
			"ayat": 95,
			"tafsir": "Allah confirms again that Muhammad and the Muslims should not be among those who deny Allah's verses, as the Jews and Christians have done, because these actions will cause great harm to those who do them in this world and in the hereafter. ."
		   },
		   {
			"id": 1460,
			"surah": 10,
			"ayat": 96,
			"tafsir": "This verse explains that for those who deny Allah's verses the provisions of Allah apply, namely to punish them with a painful punishment in the hereafter. Their faith can no longer be relied upon, because their hearts have been closed and locked shut, unable to accept Divine guidance, so they remain in disbelief and sin."
		   },
		   {
			"id": 1461,
			"surah": 10,
			"ayat": 97,
			"tafsir": "Those whose hearts are locked will not believe, even though they are presented with various kinds of evidence and signs of Allah's power and oneness. They will only believe after being put into hell, when they feel a painful doom. But their faith was no longer accepted, because the door to repentance was closed at that time."
		   },
		   {
			"id": 1462,
			"surah": 10,
			"ayat": 98,
			"tafsir": "This verse explains that the best attitude for a people to adopt is if an apostle calls on them to believe in Allah by presenting evidence of the truth of his call, then they are willing to accept the apostle's call with faith and carry out the message he brings. Faith like that is faith that is useful and profitable, because it is done when a person is in a state of being able to carry the burden that Allah bears on him (taklif). Faith is of no use to a person if he is in a state of non-taklif, like the faith of Pharaoh when he was about to drown in the middle of the ocean and like the faith of disbelievers when they are punished in hell. Faith at that time was no longer accepted. The Prophet Jonah's people were believers in a state of taklif, so that faith was beneficial to them. Prophet Yunus was sent to the residents of the city of Nainawa (Ninive), to convey Allah's religion, but they refused the call. Yunus explained to them that if they did not also believe, Allah would punish them after three days. On the third day, Jonah left the country. On the morning of the promised day, they saw a sign of the impending doom. Therefore, they looked for Jonah, but they did not find Jonah. Then they gathered with their families and livestock in the middle of the field asking Allah so that the promised doom would not befall them and they declared their faith in Him. Allah accepts their repentance and cancels their punishment. Then Allah gave them the pleasure of living until the end of their lives, as a reward for their faith."
		   },
		   {
			"id": 1463,
			"surah": 10,
			"ayat": 99,
			"tafsir": "This verse explains that if Allah wills that all human beings have faith in Him, then this will be accomplished, because to do so is easy for Him. But He didn't want it that way. He wishes to carry out His Sunnah in this universe of His creation. No one can change His Sunnah except if He Himself wants it. Among His Sunnah is to give humans reason, thoughts, and feelings that distinguish them from angels and other creatures. With reason, thought and feeling, humans become cultured beings, able to distinguish between what is good and what is bad, both for themselves, for others and for this universe. Then the deeds of man are rewarded according to the deeds he has done; good deeds are rewarded with rewards and bad and bad deeds are rewarded with punishment. In addition, God sent the apostles to convey His religion which explains to humans what is good to do and what is forbidden to do. Humans with reason, thoughts, and feelings that God bestowed upon them can judge what the apostles conveyed. There is no compulsion for humans in making choices, good or bad. And humans will be punished based on that choice."
		   },
		   {
			"id": 1464,
			"surah": 10,
			"ayat": 100,
			"tafsir": "Everything that happens in this world is by Allah's will. Nothing happens outside of His will. Allah guides and makes it easy for someone to believe, if that person wants to understand and practice the verses that have been conveyed to His messengers and He looks down on and punishes everyone who does not want to understand and practice His verses because that means they reject invitation of the apostle to follow the straight path he has spread."
		   },
		   {
			"id": 1465,
			"surah": 10,
			"ayat": 101,
			"tafsir": "In this verse, Allah explains His commands to His Messenger, so that he calls on his people to observe with their eyes and minds everything that happens in the heavens and on earth. They are commanded to meditate on the wonders of the sky full of stars, the sun and moon, the beauty of the alternation of night and day, the rain that falls on the earth, revives the dead earth, and grows plants and trees with fruit that various colors taste. Animals with various shapes and colors live on earth, providing many benefits for humans. Likewise the condition of the earth itself which consists of deserts, wide valleys, fertile plains, oceans full of fish of various types, all of these are signs of the oneness and power of Allah, for people who want to think and believe in their Creator. However, for those who do not believe in the existence of a Creator in this world, because their human nature does not function properly, all the signs of the oneness and power of Allah in this world are of no benefit to them. Likewise the warnings of the prophets to them did not affect their souls. Their minds and feelings are unable to take lessons from Allah's verses and do not lead them to believe in the existence of Allah Almighty. They have not learned from the Sunnah of Allah on mankind in the past. If they had learned from the verses of Allah and from Allah's Sunnah for mankind, their souls would have been clean and protected from the filth and uncleanness that had driven them to disbelief and misguidance."
		   },
		   {
			"id": 1466,
			"surah": 10,
			"ayat": 102,
			"tafsir": "Then, in these verses, Allah warns and threatens the Arab polytheists that punishment will soon befall them as was experienced by the people before them who also denied the messengers and denied them. Did the polytheists reject Muhammad's apostleship, because they wanted to wait for Allah's punishment first? Allah called the Prophet Muhammad, to tell them to wait for the doom. Allah's wrath will certainly come to them when they continue to deny and deny Muhammad's apostleship. The Messenger of Allah and the believers will also wait for their destruction. In accordance with the promise of Allah and His Sunnah, that those disbelievers will surely perish."
		   },
		   {
			"id": 1467,
			"surah": 10,
			"ayat": 103,
			"tafsir": "In this verse, Allah explains that in accordance with His Sunnah which applies to the apostles and their believers, Allah will save and protect them from destruction. That is Allah's provision and Allah will not change His provision. Allah's Word: (That is) a stipulation for Our apostles whom We sent before you, and you will not find any changes to Our stipulations. (al-Isra\/17: 77)"
		   },
		   {
			"id": 1468,
			"surah": 10,
			"ayat": 104,
			"tafsir": "Allah ordered the Messenger of Allah to tell his people that if they doubted the truth of the religion he brought, which taught about the oneness of Allah, then they should first doubt the beliefs they defended. Therefore, the Holy Prophet declared to them that he would not worship the stone idols and statues that they worshiped which did not have the slightest ability. But he will worship God the Creator, Who determines the life and death of His creatures. It is He who gives pleasure and pain, benefit and harm, according to His wisdom and inayah, not the god they worship. With this comparison, it becomes clearer the religious truth brought by the Prophet and the misguidance of the beliefs of the polytheists. Then the Prophet Muhammad SAW told the Arab polytheists that he was ordered to become a believer. Allah has promised the believers safety from punishment, victory over their enemies and dominion over the earth."
		   },
		   {
			"id": 1469,
			"surah": 10,
			"ayat": 105,
			"tafsir": "In this verse it is explained that the Prophet Muhammad was ordered to turn his face and his entire being to Allah, to focus on religious duties and to serve the Lord of the worlds. Because if he pays attention to other than Allah, then it reduces the determination of his soul in facing God and devotion to his religion. To Allah alone should the aim of all his devotion be outwardly and inwardly. He should not be one of those who associate partners with God in worshiping gods, demons, spirits, or statues like idol worshippers. Allah's prohibition against the Apostle is intended to encourage and stimulate the Prophet to stay away from polytheistic traits."
		   },
		   {
			"id": 1470,
			"surah": 10,
			"ayat": 106,
			"tafsir": "Allah explained His prohibition to the Prophet SAW not to pray and worship other than Allah, because apart from Allah, nothing can benefit and harm, or give pleasure and distress both in this world and in the hereafter. If the Apostle had done so, he would have been among those who abuse themselves. There is no greater disobedience than shirk because the person who commits shirk returns the affairs faced by humans to other than Allah. So come back to Allah. Say a prayer to Allah solely because prayer is a great act of worship, even the brain of worship."
		   },
		   {
			"id": 1471,
			"surah": 10,
			"ayat": 107,
			"tafsir": "Then Allah in this verse confirms His oneness in caring for His servants. Only He has the power to eliminate life's difficulties or harm that is befalling His servants, both difficulties due to lack of wealth or because of health problems and unfair treatment from others. All difficulties that befall a person must have a reason. These causes were created by Allah as a test for people, whether they truly surrender to Allah or not, and they are under His supervision. Humans thanks to their long and extensive experience can know some of these causes. For example, in matters of health, according to human experience, certain bacteria that infect the human body are the cause of certain diseases as well. Because of that humans protect themselves from these bacteria and if they are contaminated by these bacteria so that they are sick, they will try to treat their illness until they are cured. However, his recovery is not a certainty as a result of the treatment, but healing only with Allah's permission. Likewise in other areas of human life, such as the social, economic and political fields. When they experience difficulties, of course there are reasons and those causes are within their own environment. Man's obligation is to look for causes while praying to Allah with all his heart and trust in Him. After mentioning the difficulties of life that befall humans, Allah also mentions the pleasures and pleasures experienced by humans. Regarding the pleasures and ease of this life, Allah states that if He wills with His will to bestow pleasure on humans, then no one can hinder it. Happiness and pleasure are His gifts to His servants and according to His will. What He wills must happen, and Allah is not bound to a cause in giving pleasure and goodness. Allah's gift to His servants is based on the extent of His mercy. Allah is Most Forgiving, forgives all the sins of those who repent, and the sins of unbelievers who then believe in Him before death arrives. Allah is Most Compassionate, loves the believer and He does not punish him if he repents of his sins. His forgiveness and compassion cover all mankind. Because of His mercy, not all crimes in this world are subject to punishment but postpone it until a certain time. Allah's Word: And if Allah were to punish people for what they have done, He would not have spared a single living moving creature on this earth, but He has suspended (punishment) for it, until an appointed time. Later when their death comes, Allah is All-Seeing (the condition of) His servants (Fathir\/35: 45)"
		   },
		   {
			"id": 1472,
			"surah": 10,
			"ayat": 108,
			"tafsir": "Allah ordered His Messenger to tell the disbelievers after being presented to them the proofs of the oneness of Allah and His apostleship, that the truth from Allah, namely the Al-Qur'an which underlies the religion of Islam, has come before them, revealed to one of them. between themselves. In the Al-Qur'an there are explanations and descriptions about the ancient messengers and their preaching to their people. However, the Arab polytheists did not know the history of the apostles, or that history had been changed or distorted. The Al-Qur'an contains guidelines for human life to obtain worldly welfare and happiness in the hereafter. So whoever follows these guidelines in his life with full faith, the benefits will return to himself. He will live happily in this world and the hereafter. Vice versa, whoever goes astray, does not use the truth (Al-Qur'an) as a guide of life, and does not heed the signs of Allah's power in himself and in this universe, then the result will be inner misery in this world and in the hereafter. Prophet Muhammad SAW is obliged to convey the truth to humans. The final decision rests with the human being himself, whether he makes the Al-Quran his guide in life or turns away from it. He is not God's representative in this world to determine human destiny and has no power to force someone to give benefits and harm. He is only a messenger of Allah who conveys orders from the Lord Rabbul alamin."
		   },
		   {
			"id": 1473,
			"surah": 10,
			"ayat": 109,
			"tafsir": "Allah in this verse orders the Prophet Muhammad peace be upon him to follow what was revealed to him, and work according to that revelation and teach it to mankind, even if they do not believe in him. Rasulullah SAW was also asked to be patient in facing all kinds of disturbances and humiliation in carrying out his tabligh and da'wah duties. In time, God's decision will surely come as punishment against the enemies of that religion, and victory over the Prophet and his people according to God's promise to the believers. Allah is the Most Just Judge because He decides with the right reasons. The Prophet (peace be upon him) obeyed these commands and patiently waited for Allah's decision. These verses are Allah's promises that please the Prophet and the believers. The time will come when the Messenger and the believers will win and the polytheists will be destroyed. Allah bequeathed the world to Muslims, they became rulers on earth, on condition that they continue to uphold their religion."
		   }
	]
}
