{
	"tafseer": [
		{
			"id": 6107,
			"surah": 96,
			"ayat": 1,
			"tafsir": "Allah commands humans to read (study, research, and so on.) whatever He has created, both His explicit verses (qauliyah), namely the Qur'an, and His implied verses, meaning nature universe (kauniyah). Reading it must be in His name, meaning because of Him and hoping for His help. Thus, the purpose of reading and studying Allah's verses is to obtain results that are pleasing to Him, namely knowledge or something that is beneficial to humans."
		   },
		   {
			"id": 6108,
			"surah": 96,
			"ayat": 2,
			"tafsir": "Allah mentions that among those He has created is man, which shows the exaltation of that man in His sight. Allah created man from an 'alaqah (zygote), namely an egg that has been fertilized by sperm, which has attached to the mother's womb. Because it has attached, the zygote can develop into a human. Thus, that human's origins were something meaningless, but later he became a mighty human. Allah says: And among His signs (greatness) is that He created you from dust, then suddenly you (become) human beings who multiply. (ar-Rum\/30: 20) Its origin is also unstable, the zygote may not attach to the uterus, or it may detach from the uterus again, so that the process of human formation stops. Therefore, humans should not be arrogant and deny, but be grateful and obedient to Him, because it is with Allah's almightyness and grace that they can be created. Allah says regretting that man who is disbelieving and arrogant: And did man not see that We created him from a drop of sperm, he turned out to be a real enemy! (Yasin\/36: 77) According to scientific studies, 'alaqah is a form of pre-embryonic development, which occurs after the mixing of the sperm cell (sperm) and the egg cell. Moore and Azzindani explain that 'alaqah in Arabic means leech or a suspension (suspended thing) or a clot of blood. Leeches are low-level animals, shaped like springs, and live by sucking blood. So 'alaqah is an embryonic stage, which is shaped like a pear, where the cardiovascular system (heart-vessel system) has begun to appear, and its life depends on its mother's blood, similar to a leech. 'Alaqah is formed around 24-25 days after fertilization. If the pre-embryonic 'alaqah tissue is removed (aborted), it does look like a blood clot (a blood clot like). See also scientific studies on the explanation of surahh Nuh\/71 verse 14."
		   },
		   {
			"id": 6109,
			"surah": 96,
			"ayat": 3,
			"tafsir": "Allah asks people to read again, which implies that reading which will produce knowledge and faith needs to be done many times, at least twice. When the Qur'an or nature is read and investigated many times, people will find that Allah is gracious, that is, He will pour out His knowledge upon them and will strengthen their faith."
		   },
		   {
			"id": 6110,
			"surah": 96,
			"ayat": 4,
			"tafsir": "Among the forms of God's mercy is that He taught humans to be able to use writing instruments. Teaching here means giving him the ability to use it. With the ability to use this writing tool, humans can write down their findings so that they can be read by other people and the next generation. By being read by others, knowledge can be developed. Thus, humans can know what they did not know before, meaning that knowledge will continue to develop. Such is the magnitude of the read-write function."
		   },
		   {
			"id": 6111,
			"surah": 96,
			"ayat": 5,
			"tafsir": "Among the forms of God's mercy is that He taught humans to be able to use writing instruments. Teaching here means giving him the ability to use it. With the ability to use this writing tool, humans can write down their findings so that they can be read by other people and the next generation. By being read by others, knowledge can be developed. Thus, humans can know what they did not know before, meaning that knowledge will continue to develop. Such is the magnitude of the read-write function."
		   },
		   {
			"id": 6112,
			"surah": 96,
			"ayat": 6,
			"tafsir": "Allah regrets humans because many of them tend to forget themselves so they do actions that exceed the limits, namely disbelief in Allah and arbitrary towards humans. This tendency occurs when they feel they have had enough. Thus, he felt no need to have faith, and because of this he dared to violate God's laws. Likewise, because he already feels sufficient, he feels he doesn't need other people and feels powerful, and because of that he will act arbitrarily towards those other people."
		   },
		   {
			"id": 6113,
			"surah": 96,
			"ayat": 7,
			"tafsir": "Allah regrets humans because many of them tend to forget themselves so they do actions that exceed the limits, namely disbelief in Allah and arbitrary towards humans. This tendency occurs when they feel they have had enough. Thus, he felt no need to have faith, and because of this he dared to violate God's laws. Likewise, because he already feels sufficient, he feels he doesn't need other people and feels powerful, and because of that he will act arbitrarily towards those other people."
		   },
		   {
			"id": 6114,
			"surah": 96,
			"ayat": 8,
			"tafsir": "Allah confirmed to the Prophet Muhammad that those who are disobedient will return to Him. They must die and will face Him to account for their actions. If they have to be held accountable for their actions, it means that they will later know that they will be punished and will regret it. In another verse, Allah says about what the disobedient will be like: And do not think that Allah is unaware of what the wrongdoers do. Verily Allah postponed them until the day when (their) eyes widened, they came in haste (to fulfill the call) by raising their heads, while their eyes did not blink and their hearts were empty. (Ibrahim\/14: 42-43)"
		   },
		   {
			"id": 6115,
			"surah": 96,
			"ayat": 9,
			"tafsir": "Allah asked the Prophet Muhammad, who meant asking him to pay attention to people who forbade people to pray. The person who was forbidden was the Prophet Muhammad to perform prayers in the Grand Mosque. Meanwhile, the one who forbade it was Abu Jahal. He threatened the Prophet with the words: Abu Jahl said, \"If I see Muhammad praying at the Kaaba, I will run over his neck (to the ground).\" When it came to the Prophet, he said, \"If he does, the angels will beat him.\" (Al-Bukhari history from Ibn 'Abbas)"
		   },
		   {
			"id": 6116,
			"surah": 96,
			"ayat": 10,
			"tafsir": "Allah asked the Prophet Muhammad, who meant asking him to pay attention to people who forbade people to pray. The person who was forbidden was the Prophet Muhammad to perform prayers in the Grand Mosque. Meanwhile, the one who forbade it was Abu Jahal. He threatened the Prophet with the words: Abu Jahl said, \"If I see Muhammad praying at the Kaaba, I will run over his neck (to the ground).\" When it came to the Prophet, he said, \"If he does, the angels will beat him.\" (Al-Bukhari history from Ibn 'Abbas)"
		   },
		   {
			"id": 6117,
			"surah": 96,
			"ayat": 11,
			"tafsir": "Furthermore, Allah asked the Prophet Muhammad to pay attention, if people who were prohibited from praying in the mosque brought guidance and guided people to faith, and invited people to piety, that is, to do good and truth. This action must be better, because it will definitely benefit him and his community. The person who behaved like that was the Prophet Muhammad himself. They are two behaviors that are as opposite and contradictory as day and night: the first is evil and leads to evil, and the second is good and leads to good."
		   },
		   {
			"id": 6118,
			"surah": 96,
			"ayat": 12,
			"tafsir": "Furthermore, Allah asked the Prophet Muhammad to pay attention, if people who were prohibited from praying in the mosque brought guidance and guided people to faith, and invited people to piety, that is, to do good and truth. This action must be better, because it will definitely benefit him and his community. The person who behaved like that was the Prophet Muhammad himself. They are two behaviors that are as opposite and contradictory as day and night: the first is evil and leads to evil, and the second is good and leads to good."
		   },
		   {
			"id": 6119,
			"surah": 96,
			"ayat": 13,
			"tafsir": "Furthermore, Allah asked the Prophet Muhammad to pay attention to people who forbade people to worship, namely Abu Jahl as an example, what if he saw Allah and His teachings lying, then turned away, and did not want to pay attention to them. He did not know that God saw what he had done. Not so, Allah knows every act of sin and will give a reward."
		   },
		   {
			"id": 6120,
			"surah": 96,
			"ayat": 14,
			"tafsir": "Furthermore, Allah asked the Prophet Muhammad to pay attention to people who forbade people to worship, namely Abu Jahl as an example, what if he saw Allah and His teachings lying, then turned away, and did not want to pay attention to them. He did not know that God saw what he had done. Not so, Allah knows every act of sin and will give a reward."
		   },
		   {
			"id": 6121,
			"surah": 96,
			"ayat": 15,
			"tafsir": "Allah denounces those who forbid people from praying in mosques, with the example of Abu Lahab. Allah threatens that if they do not stop what they are doing, Allah will revoke their forelocks, that is, take their life so that they die instantly. The punishment was imposed on him because the forelock was the pulse of his life, while the pulse of his life was always full of lies and sins."
		   },
		   {
			"id": 6122,
			"surah": 96,
			"ayat": 16,
			"tafsir": "Allah denounces those who forbid people from praying in mosques, with the example of Abu Lahab. Allah threatens that if they do not stop what they are doing, Allah will revoke their forelocks, that is, take their life so that they die instantly. The punishment was imposed on him because the forelock was the pulse of his life, while the pulse of his life was always full of lies and sins."
		   },
		   {
			"id": 6123,
			"surah": 96,
			"ayat": 17,
			"tafsir": "Allah allows those who are arbitrary and forbid people from performing worship to ask for help from their group. This verse is specifically addressed to Abu Jahl, who was known as the greatest leader of those who opposed the Holy Prophet in Mecca. Allah threatened that if Abu Jahl summoned his accomplice friends for help, then Allah would summon the Zabaniyah angels, namely the guardians of hell who were very vicious. That is, he will be wretched in the world and in the hereafter will go to hell. The threat was later proven, namely in the second year after the Muslims migrated to Medina, the Battle of Badr occurred, in which Abu Jahl as the leader of the Quraysh was killed. And in the afterlife he will definitely go to hell."
		   },
		   {
			"id": 6124,
			"surah": 96,
			"ayat": 18,
			"tafsir": "Allah allows those who are arbitrary and forbid people from performing worship to ask for help from their group. This verse is specifically addressed to Abu Jahl, who was known as the greatest leader of those who opposed the Holy Prophet in Mecca. Allah threatened that if Abu Jahl summoned his accomplice friends for help, then Allah would summon the Zabaniyah angels, namely the guardians of hell who were very vicious. That is, he will be wretched in the world and in the hereafter will go to hell. The threat was later proven, namely in the second year after the Muslims migrated to Medina, the Battle of Badr occurred, in which Abu Jahl as the leader of the Quraysh was killed. And in the afterlife he will definitely go to hell."
		   },
		   {
			"id": 6125,
			"surah": 96,
			"ayat": 19,
			"tafsir": "Allah asked the Prophet or anyone who wanted to worship not to be afraid and not to obey the threats of people who forbade them to worship. They are asked to continue to perform their prayers diligently, especially prayers, and to use the mosque to carry them out. In another verse, Allah says: And do not obey those disbelievers and hypocrites, do not pay attention to their disturbances and put your trust in Allah. And sufficient is Allah as a protector. (al-Ahzab\/33: 48) Apart from praying, Muslims are also asked to perform other circumcision services in order to draw closer to Him, be it in the form of circumcision prayers or dhikr, and so on."
		   }
	]
}
