{
	"tafseer": [
		{
			"id": 5496,
			"surah": 74,
			"ayat": 1,
			"tafsir": "In verses 1-2 it is stated that the Prophet Muhammad was covered with a blanket because he was overwhelmed with feelings of fear at seeing the appearance of the Angel Gabriel, then a revelation came down ordering him to get up immediately and warning the people who were still astray so that they would know the right way. The words \"qum\" (wake up) show that a messenger must be diligent, tenacious, and not know despair because of the ridicule of people who do not like to accept his call. Apostles should not be lazy and do nothing. Since this verse was revealed, the Prophet Muhammad never stopped carrying out his missionary duties. Throughout his life he was filled with various kinds of activities that were useful for the benefit of the people and the propagation of Islam. The warnings he conveyed to the inhabitants of Mecca who were still polytheists at that time, were in the form of the awesomeness of Allah's punishment on the Day of Resurrection. To save themselves from this doom, humans should know God and obediently follow the orders of the Prophet Muhammad."
		   },
		   {
			"id": 5497,
			"surah": 74,
			"ayat": 2,
			"tafsir": "In verses 1-2 it is stated that the Prophet Muhammad was covered with a blanket because he was overwhelmed with feelings of fear at seeing the appearance of the Angel Gabriel, then a revelation came down ordering him to get up immediately and warning the people who were still astray so that they would know the right way. The words \"qum\" (wake up) show that a messenger must be diligent, tenacious, and not know despair because of the ridicule of people who do not like to accept his call. Apostles should not be lazy and do nothing. Since this verse was revealed, the Prophet Muhammad never stopped carrying out his missionary duties. Throughout his life he was filled with various kinds of activities that were useful for the benefit of the people and the propagation of Islam. The warnings he conveyed to the inhabitants of Mecca who were still polytheists at that time, were in the form of the awesomeness of Allah's punishment on the Day of Resurrection. To save themselves from this doom, humans should know God and obediently follow the orders of the Prophet Muhammad."
		   },
		   {
			"id": 5498,
			"surah": 74,
			"ayat": 3,
			"tafsir": "This verse instructs the Prophet Muhammad to glorify Allah by saying takbir and leaving all matters to His will. He was forbidden to seek help other than Him. Glorifying Allah with all the soul and body certainly grows a personality that is strong and not easily shaken. Because, people who have faith see that there is nothing to fear besides Allah. This attitude needs to be internalized by a preacher (proselytizer) whose daily job is to invite people to the path of Allah. This verse also implies that the Prophet Muhammad was ordered to say takbir, namely to magnify the name of His Lord, above all that exists. Because after humans know the creator of nature and themselves and are sure that the creator really exists, then he should cleanse His essence from all His rivals. If this is not the case, the polytheists also glorify the name of their god, but the majesty is associated with other substances. Magnifying Allah means glorifying Him in words and deeds, leaving all matters only to Him, worshiping and cleansing His substance from all that is associated with Him, and depending on hope in Him alone. If these elements are fulfilled in raising Allah, then the perfect appreciation of faith for a believer."
		   },
		   {
			"id": 5499,
			"surah": 74,
			"ayat": 4,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to clean clothes. The meaning of cleaning clothes according to some commentators is: 1. Cleaning clothes from all uncleanness and dirt, because purification with the intention of worshiping is obligatory, and apart from worshiping it is sunnah. Cleaning here also includes how to obtain it, namely the clothes used must be obtained in a lawful way. When Ibn 'Abbas was asked by people about the meaning of this verse, he replied that the word of Allah meant the prohibition of wearing clothes for sin and deceit. So to purify clothes is to clean them from uncleanness and dirt. In a broader sense, namely cleaning the residence and environment from all forms of dirt, garbage, and so on, because dirty clothes, bodies, and environments contain many sins. On the other hand, cleaning the body, residence, etc. means trying to distance oneself from sin. Thus the Syafi'iyah scholars made it obligatory to clean clothes from uncleanness for people who want to pray. That's how Islam requires its followers to always live clean, because physical cleanliness elevates humans to noble morals. 2. Cleaning clothes means spiritual cleansing from all despicable characters and traits. Specifically for the Prophet Muhammad, this verse instructs him to purify the nubuwwah (prophetic) values that he carries from everything that defiles him (envy, revenge, anger, etc.). This second meaning is figurative (majazi), and indeed in Arabic sometimes satirizes people who don't keep their promises by using the words, \"He likes to dirty his clothes (clothes),\" Meanwhile, people who like to keep promises are always praised with words , \"He likes to clean his clothes (clothes).\" In short, this verse instructs one to cleanse oneself, one's clothes and the environment from all uncleanness, dirt, garbage, and so on. In addition, it also means an order to maintain personal purity and honor from all despicable behavior."
		   },
		   {
			"id": 5500,
			"surah": 74,
			"ayat": 5,
			"tafsir": "Furthermore, the Prophet Muhammad was ordered to leave sinful acts such as worshiping idols or statues. The word ar-rujz contained in this verse means torment, and in this case what is meant is an order to keep away all causes that bring torment, namely immoral acts. Including what is prohibited by this verse is doing all kinds of actions that cause immoral acts. Cleansing oneself from sins especially for a preacher is an obligation. This is because if the dai himself is known to be disgraced and disgraced by society, of course his words and advice will be difficult for people to accept. Even preachers who are good at taking care of themselves must face two forms of challenges, namely: 1. It is possible that people who are invited and called on to the path of Allah will clap their chests, showing their arrogance, so that they feel they no longer need advice. With the wealth, knowledge, or high position he has, he feels that he no longer needs to be invited to the way of Allah. 2. It is also possible that the dai is hostile to the authorities and those who are not happy with him. The preacher will be expelled, tortured, reduced his rights, intimidated, prohibited, or hindered from conveying da'wah and upholding rights. All of these are consequences that must be faced by anyone who strives in the way of Allah. Protecting yourself from all actions and words that tarnish your good name in the eyes of society is part of your efforts to achieve success in preaching."
		   },
		   {
			"id": 5501,
			"surah": 74,
			"ayat": 6,
			"tafsir": "In this verse, the Prophet Muhammad was forbidden to give with the intention of getting more. This means that with effort and endeavor to invite people to the way of Allah, as well as with knowledge and treatises conveyed, he is prohibited from expecting greater rewards or rewards from those he calls. Strictly speaking, do not make da'wah as a business object that brings worldly benefits. For a prophet it is even more emphasized not to expect any reward at all in preaching, in order to maintain the nobility of the prophetic dignity he bears."
		   },
		   {
			"id": 5502,
			"surah": 74,
			"ayat": 7,
			"tafsir": "This verse instructs the Prophet Muhammad to be patient, because in doing so he must have faced many obstacles and trials. Especially in jihad to convey the message of Islam. Patience in this verse also means steadfast in suffering from being tortured or hurt because what people say is not liked. For a preacher, this verse means that he must be able to restrain himself and suppress his feelings when people do not accept his mission, and when people do not care about the truth he proclaims. Do not despair, because there is no successful struggle without sacrifice, as the struggles that have been experienced by the prophets and apostles. There are several forms of patience that are interpreted from the verse above, including: (1) patience in doing acts of obedience, so that you don't get bored, (2) patiently abstaining from immoral acts and facing enemies, (3) patience when facing trials and decrees (qadar) Allah, and (4) patience in facing the luxuries of life in the world. It is with patience and steadfastness that a struggle is guaranteed to succeed, as shown by our lord, the Prophet Muhammad."
		   },
		   {
			"id": 5503,
			"surah": 74,
			"ayat": 8,
			"tafsir": "After giving special instructions to the Prophet Muhammad (who is also a mirror of teaching for his people) starting from verse 1 to verse 7 above, then in this verse, Allah also explains the atmosphere of the arrival of the Doomsday. On that promised day, those who have hurt the hearts of the apostles and preachers by conveying God's teachings, will experience extraordinary difficulties. They gasped when they heard the call for Doomsday blown by Angel Israfil. They immediately felt how great the hardships must be gone through. Therefore, Allah ordered the Prophet Muhammad to be patient in facing the disturbances of the enemy. On the Day of Judgment, everyone will get what they have practiced: eternal pleasure for those who believe and strive to uphold true faith, as well as accidents and tribulations for those who deny and live on that denial."
		   },
		   {
			"id": 5504,
			"surah": 74,
			"ayat": 9,
			"tafsir": "After giving special instructions to the Prophet Muhammad (who is also a mirror of teaching for his people) starting from verse 1 to verse 7 above, then in this verse, Allah also explains the atmosphere of the arrival of the Doomsday. On that promised day, those who have hurt the hearts of the apostles and preachers by conveying God's teachings, will experience extraordinary difficulties. They gasped when they heard the call for Doomsday blown by Angel Israfil. They immediately felt how great the hardships must be gone through. Therefore, Allah ordered the Prophet Muhammad to be patient in facing the disturbances of the enemy. On the Day of Judgment, everyone will get what they have practiced: eternal pleasure for those who believe and strive to uphold true faith, as well as accidents and tribulations for those who deny and live on that denial."
		   },
		   {
			"id": 5505,
			"surah": 74,
			"ayat": 10,
			"tafsir": "In this verse it is emphasized again that it will not be easy for disbelievers to face the terrible and frightening atmosphere of the Doomsday. Because, on that day they receive all the results of their actions in the book of practice from the left as a sign of going to hell. There will be no happiness for disbelievers on that day. Everything is difficult and painful, not like the pleasures they once enjoyed in the world before. Why are they having trouble? Apart from ever receiving the book on the left, they must also be accountable for all their deeds before the Court of Allah, the Most Just, which no one can avoid and no one feels aggrieved. Because, on that very day all the members of the body speak up to give testimony by themselves about what has been done, even though the mouths that in the world can speak well, on that day are tightly locked and silent in a thousand languages. All humans on the Day of Judgment bow their heads before Allah, admitting past mistakes and oversights, but the door of regret has been closed. As for the believers who have used their best time to strive in the way of Allah, face the end of the world with a bright feeling, without the slightest fear. They will not be troubled by the calculation of their charity, and walk in rows and groups to the Divine Court with a bright face."
		   },
		   {
			"id": 5506,
			"surah": 74,
			"ayat": 11,
			"tafsir": "In this verse, Allah reveals that it is He who will do something with those whom He Himself has created. He had created it and brought it out of its mother's womb, without possessions or even children. Then He bestowed sustenance on him, and intelligence to lead his people. However, she disobeyed Him. This verse mentions the words \"wahid\" (the only one), as an allusion to al-Walid who holds the title of one, because he is the most prominent among his people because of his wealth, rank, and possessions. Al-Walid has a large field of gardens and livestock areas between Mecca and Ta'if. He owned camels, horses, goats and slaves. Has seven mighty children (three of whom converted to Islam, namely Khalid, Hisham, and 'Imarah). According to Mujahid, his sons are 10 people. More than that, Allah has bestowed long life with sufficient wealth to al-Walid (died at the age of 90), respected and respected by his people."
		   },
		   {
			"id": 5507,
			"surah": 74,
			"ayat": 12,
			"tafsir": "Allah revealed that He gave al-Walid a lot of wealth. Allah has bestowed him with various kinds of wealth, so that he is the only richest person among his people. It is not surprising that al-Walid said: I am the only child of the only one in this country, there is no one among the Arabs who is like me or like my father, al-Mugirah. (Al-Qurthubi's history)"
		   },
		   {
			"id": 5508,
			"surah": 74,
			"ayat": 13,
			"tafsir": "This verse reveals that Allah also bestowed upon the wealthy and noble Quraysh a son who always accompanied him. Because he is a rich man and does not need the help of others to take care of his children, his children do not need to wander to other countries in search of sustenance because everyone has to be close to their own father. There are also those who interpret that al-Walid's children always accompany him when he attends meetings or celebrations, thus giving the impression of his greatness and glory. There are 7 proud sons (al-Walid, Khalid, 'Imarah Hisham, 'As, Qais, and 'Abdussyam). Three of them (Khalid, Hisham, and 'Imarah) had converted to Islam, fulfilling the call of the Prophet Muhammad."
		   },
		   {
			"id": 5509,
			"surah": 74,
			"ayat": 14,
			"tafsir": "This verse states that Allah pours out as much sustenance as possible for al-Walid in the form of wealth, children, and longevity. Coupled with the gift of a high position among the Quraysh, so that he received the honorable title of \"Raihanah Quraysh\". Al-Walid should be grateful to Allah for all the blessings and pleasures he received. However, on the contrary he turned away from the truth and became stubborn. This quality is mentioned in the Qur'an: Praise be to Allah who created the heavens and the earth and made darkness and light, yet the disbelievers still associate something with their Lord. (al-An'am\/6: 1)"
		   },
		   {
			"id": 5510,
			"surah": 74,
			"ayat": 15,
			"tafsir": "This verse states that al-Walid really wanted Allah to increase his wealth, even though he was already so rich in everything. He still hopes for additions to what is already there. Such is the nature of a human who is never satisfied, never limited by his dreams and desires. This character will always appear throughout the ages. Rasulullah saw warned in his words that read: If the child of Adam (human) had one valley of wealth, he would have wanted the second one and if he had two valleys, he would have definitely wanted the third one. (History of al-Bukhari, Muslim, at-Tirmidhi, and Ahmad from Anas) In another hadith, the Prophet said: Ø¹Ø¨Ù'Ø§Ø³) Two people who eat a lot who are never full (ie) seekers of knowledge and seekers of wealth . (History of ad-Darimi from Ibn 'Abbas). Al-Walid's arrogance was too much. Al-Qurthubi said that al-Hasan and others said, \"Al-Walid once said: If indeed Muhammad was a righteous man, heaven would not have been created except for me. (History of al-Qurthubi and al-Alusi)"
		   },
		   {
			"id": 5511,
			"surah": 74,
			"ayat": 16,
			"tafsir": "Allah emphasized that al-Walid's attitude would not add to what he wanted, because in fact he was against His verses. Allah will never grant his wish. In fact, according to history, since the revelation of this statement of Allah, al-Walid's wealth and wealth have decreased. The children too, died one by one until they were all gone. In the end, al-Walid was left alone. Al-Walid always showed openly his attitude against what was conveyed by the Prophet Muhammad, in the form of arguments about the oneness and power of Allah, explanations about the existence of the resurrection day, information about the treatises and prophecies he brought, and so on. Al-Walid strongly opposed the revelation of Allah revealed through Muhammad saw. Therefore, he also tries to speak in the style of the Qur'an. He thought that if God still wanted to send an apostle among the Arabs, then no one was more deserving of this sacred task than he himself. Thus pride and stubbornness deprive him of all worldly pleasures. Another aspect that we take from this verse is that al-Walid's denial of Allah was categorized as kufr 'inad, meaning that he knew very well and admitted with his heart that what the Prophet Muhammad said was true, but his tongue (spoken) still denied it. This is the most filthy and heinous kind of disbelief. As there are many nowadays. The heart admits that religious teachings are true and profitable, but the tongue remains against it due to various factors."
		   },
		   {
			"id": 5512,
			"surah": 74,
			"ayat": 17,
			"tafsir": "In this verse, Allah confirms that He will give al-Walid a painful climb. The point is that God threw him into a very terrible hell that no one could bear the pain. Allah likens that the difficulties that will be felt on the Day of Judgment are likened to a mountain climber who is ordered to carry a heavy burden. In a hadith it is narrated that the meaning of sa'ud (climb) in this verse is as follows: Sa'ud is a volcano (in hell) that will be climbed by unbelievers for 70 years and then they (who climb it) will fall again into lower. That's how it goes on and on forever. (Ahmad and at-Tirmidhi's history from Abu Sa'id) There are those who interpret sa'ud as a punishment that if it befalls someone, it will never stop."
		   },
		   {
			"id": 5513,
			"surah": 74,
			"ayat": 18,
			"tafsir": "This verse explains that actually al-Walid thought and understood the revelations of Allah that he had heard. However, he also tried to compose his own words with the intention of criticizing what was in the Qur'an. He concocted other sayings that were against the Qur'an, so that the Quraysh people felt happy with him, they felt compatible with al-Walid's wishes."
		   },
		   {
			"id": 5514,
			"surah": 74,
			"ayat": 19,
			"tafsir": "Allah cursed al-Walid with the words \"woe to him, how will he determine?\" Cursed be al-Walid and the Quraysh who did that. In this regard, Allah says: And the Jews said, \"Uzair son of Allah,\" and the Christians said, \"Christ is the son of Allah.\" Those were the words that came out of their mouths. They imitated the words of the former disbelievers. Allah cursed them; how did they turn around? (at-Taubah\/9: 30)"
		   },
		   {
			"id": 5515,
			"surah": 74,
			"ayat": 20,
			"tafsir": "So woe to al-Walid how he determines. These words were repeated by Allah. Such was the severity of Allah's curse on al-Walid, because he had casually determined that what the Prophet Muhammad said was witchcraft and accused him of being a sorcerer, as mentioned in the 24th verse above."
		   },
		   {
			"id": 5516,
			"surah": 74,
			"ayat": 21,
			"tafsir": "Then al-Walid thought over and over whether there was an error in the verses of the Qur'an. He also hopes that there are verses of the Qur'an that are in accordance with his wishes. Then he checked again, maybe there are weak points in verses that can be used as a weapon to criticize and denounce the Prophet Muhammad."
		   },
		   {
			"id": 5517,
			"surah": 74,
			"ayat": 22,
			"tafsir": "This verse reveals that al-Walid was sullen and sullen because he failed to find a weakness in the Qur'an, and did not know what else to say to criticize it. This is a sign that al-Walid and people who are experts like him actually in their hearts have acknowledged the truth of the Prophet Muhammad. It's just that his stubbornness (kufr 'inad) pushed him to berate and denounce the Prophet. Had he been firm in his belief in the truth, he would have got what he wanted. There was no way he had that sullen face that represented dissatisfaction."
		   },
		   {
			"id": 5518,
			"surah": 74,
			"ayat": 23,
			"tafsir": "This verse reveals that al-Walid turned away from the truth and was arrogant by turning his head away from the truth. While showing his arrogance, he absolutely did not want to submit and obey the truth that the Prophet Muhammad brought."
		   },
		   {
			"id": 5519,
			"surah": 74,
			"ayat": 24,
			"tafsir": "This verse confirms that al-Walid then said that this Qur'an is nothing but magic that was learned (from the ancients). According to his conjecture, the Qur'an is a saying that Muhammad copied from someone else before him, received from the person who told it to him. Al-Walid also said that this Qur'an is nothing but human speech. That means besides accusing the Qur'an of being magic that can be learned, it is also the words of ordinary people and Muhammad stole it from other people's words. In short, he said that the Qur'an is not the word of Allah as preached by Muhammad. If al-Walid's accusation was true, that the Qur'an is the word of an ordinary human being, surely someone other than Muhammad would have been able to compile it like that or come up with an even better challenge. Even though among the Arab nation there are many literary figures whose tongues are fluent in poetry and speech. Among them, there is also a deep mastery of various kinds of knowledge. However, no one can match the words that came out of Muhammad's mouth."
		   },
		   {
			"id": 5520,
			"surah": 74,
			"ayat": 25,
			"tafsir": "This verse confirms that al-Walid then said that this Qur'an is nothing but magic that was learned (from the ancients). According to his conjecture, the Qur'an is a saying that Muhammad copied from someone else before him, received from the person who told it to him. Al-Walid also said that this Qur'an is nothing but human speech. That means besides accusing the Qur'an of being magic that can be learned, it is also the words of ordinary people and Muhammad stole it from other people's words. In short, he said that the Qur'an is not the word of Allah as preached by Muhammad. If al-Walid's accusation was true, that the Qur'an is the word of an ordinary human being, surely someone other than Muhammad would have been able to compile it like that or come up with an even better challenge. Even though among the Arab nation there are many literary figures whose tongues are fluent in poetry and speech. Among them, there is also a deep mastery of various kinds of knowledge. However, no one can match the words that came out of Muhammad's mouth."
		   },
		   {
			"id": 5521,
			"surah": 74,
			"ayat": 26,
			"tafsir": "In this verse, Allah describes the appropriate recompense for those who are so presumptuous to accuse the Qur'an of being the word of a human being. Allah will put al-Walid into the Saqar hell. Saqar is one of the names of hell."
		   },
		   {
			"id": 5522,
			"surah": 74,
			"ayat": 27,
			"tafsir": "This verse describes the nature of the hell of Saqar. The words wa ma adra ka (and you know what) in Arabic show the magnitude and the enormity of the problem in question. What do you know about Saqar? And surely no one knows and reaches its essence except with the information given by revelation. Saqar does not leave and does not return. This means that for every human body he burned, not a single one was left of flesh or bone. Then the charred body is returned to be new and fresh, but it is burned again until it is charred for the second time and so on. We get such information from another verse which reads: Whenever their skins are charred, We replace them with other skins, so that they will taste the punishment. (an-Nisa'\/4: 56)"
		   },
		   {
			"id": 5523,
			"surah": 74,
			"ayat": 28,
			"tafsir": "This verse describes the nature of the hell of Saqar. The words wa ma adra ka (and you know what) in Arabic show the magnitude and the enormity of the problem in question. What do you know about Saqar? And surely no one knows and reaches its essence except with the information given by revelation. Saqar does not leave and does not return. This means that for every human body he burned, not a single one was left of flesh or bone. Then the charred body is returned to be new and fresh, but it is burned again until it is charred for the second time and so on. We get such information from another verse which reads: Whenever their skins are charred, We replace them with other skins, so that they will taste the punishment. (an-Nisa'\/4: 56)"
		   },
		   {
			"id": 5524,
			"surah": 74,
			"ayat": 29,
			"tafsir": "This verse confirms that the hell of Saqar is burning human skin. That is, the Saqar burns human skin until it is black in color. The meaning of the word lawwahah in this verse is actually \"one who turns the skin black\". Blacker than the darkness of the night."
		   },
		   {
			"id": 5525,
			"surah": 74,
			"ayat": 30,
			"tafsir": "This verse confirms that the Saqar is guarded by 19 angels headed by Malik. It was narrated by al-Baihaqi and Ibn Mardawaih from al-Bara' that a group of Jews once asked some of the Prophet's companions about the guardians of the Hellfire. They replied, \"Allah and His Messenger know better.\" Then Jibril came down to the Prophet explaining what they were asking about, as in this 30th verse."
		   },
		   {
			"id": 5526,
			"surah": 74,
			"ayat": 31,
			"tafsir": "At the beginning of this verse, Allah confirms that the officers appointed by Allah to take care of the affairs of hell and give torment to its inhabitants are angels. They are entrusted with managing and supervising it. They are God's great and mighty creatures and act on His orders. They are neither human nor jinn, because those who are tortured there are those two creatures. If the guardians of hell were of the human or jinn kind, of course they would be compassionate and gentle to creatures of their kind. As for their small number (19 angels) compared to the vastness of hell that has no edges that must be watched over and the tens of billions of jinn and humans who fill it, it is only a test and trial for those who do not believe. So they say whatever they like that they can fight with angels, like what Ibn Kaladah said above. Allah purposely mentioned this small number so that the disbelievers would be even more arrogant, so that the retribution they would have to suffer would be multiplied. The slander (ordeal) referred to here is of course because their number is too few. That for non-believers will raise a question mark, \"How can angels who are not even 20 be able to control millions or even thousands of jinn and humans who inhabit hell? Even though if they realize, angels are only mere tools (attributes) that work on the orders and power of Allah. Even if there are only two or three angels, but if the Almighty is behind it, the work will surely run smoothly. On the other hand, for people who have been sent down in the book (Jews and Christians) the description of this verse should add to their confidence regarding the truth spoken by the Prophet Muhammad, because the number of 19 is in accordance with the information they obtained in their holy books (Torah and Bible). contradict each other. Believers will certainly be more confident in their faith, because they see t how can the people of the book justify and acknowledge the verses of the Qur'an, because its contents are in accordance with the Torah and the Bible. Thus, honest believers and people of the book (Jews and Christians) have no doubt about the meaning of the sentence of the 19 angels. They (the people of the book) also have no doubts about the true nature of a Muslim's faith, they are even expected to be able to explain this to people who are still in doubt, such as to the hypocrites and others. Here it is mentioned about the people of the book and the hypocrites, even though the verse was revealed in Mecca, and the people of the book and the hypocrites only appeared after the Messenger of Allah was in Medina. Therefore, this verse must be seen as the unseen news that will surely happen that Allah conveyed to the Prophet Muhammad. Telling what is still unseen or has not materialized is one of the forms of the Prophet's miracles as mentioned in the hadith books. Those who do not believe in the truth brought by the Prophet saw will question again about the 19 angels. What exactly does Allah want by mentioning this too few numbers, and why not just mention 20? Because the prevailing custom of mentioning examples\/examples always uses even numbers, this parable of Allah is seen as odd. Then Allah explained, \"Thus Allah misleads whom He wills from the hypocrites and polytheists who always question the number of angels. However, He also gives instructions to the right path for those whom He wants so that they understand the meaning of the verse. this. From this information it is clear to us that differences of opinion among humans and even between Muslims are normal, and it is a sunatullah. Only those who receive guidance will obtain the true nature of the problem in question. Allah reaffirms His authority that only He who knows the nature of the angels who were ordered to watch over the disbelievers in hell. Only He knows how the real angels are on duty. No human being understands the wisdom of making the number 19. Some explain that this verse came down in response to Abu Jahl said when he heard the verse about guards hell 19 people, \"Did you know that the Lord Muhammad is only 19 angels who help Him?\" What is clear is that the 19 angels were assisted by other soldiers of Allah whose number no one knows except Him alone. This verse confirms that the hell of Saqar, which is accompanied by a description as revealed in the verse above, is a warning to all humans."
		   },
		   {
			"id": 5527,
			"surah": 74,
			"ayat": 32,
			"tafsir": "In these verses, Allah warns that there is no way for humans to deny His power which they can clearly see for themselves. The words \"kalla\" (by no means) are also a rebuttal to the sayings of the polytheists above. To strengthen this, Allah swears by the moon, the night when it has passed, and when the dawn begins to shine. With the moon, night, and dawn, Allah confirms that the Saqar hell is a very terrible disaster for mankind. Some explain that the meaning of ihda al-kubar (one of the very big disasters) is one of the seven terrible hells. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. This is a threat to humans. The existence of the seven hells (one of which is Saqar) is a threat to those who still do not want to submit to God's will. There are those who interpret nadhir (threatening) as the nature of God, so the meaning of this verse is: \"I am threatening you, therefore you should be afraid of this threat.\" Some interpret nadhir as a characteristic of the Prophet Muhammad as mentioned in the second verse above."
		   },
		   {
			"id": 5528,
			"surah": 74,
			"ayat": 33,
			"tafsir": "In these verses, Allah warns that there is no way for humans to deny His power which they can clearly see for themselves. The words \"kalla\" (by no means) are also a rebuttal to the sayings of the polytheists above. To strengthen this, Allah swears by the moon, the night when it has passed, and when the dawn begins to shine. With the moon, night, and dawn, Allah confirms that the Saqar hell is a very terrible disaster for mankind. Some explain that the meaning of ihda al-kubar (one of the very big disasters) is one of the seven terrible hells. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. This is a threat to humans. The existence of the seven hells (one of which is Saqar) is a threat to those who still do not want to submit to God's will. There are those who interpret nadhir (threatening) as the nature of God, so the meaning of this verse is: \"I am threatening you, therefore you should be afraid of this threat.\" Some interpret nadhir as a characteristic of the Prophet Muhammad as mentioned in the second verse above."
		   },
		   {
			"id": 5529,
			"surah": 74,
			"ayat": 34,
			"tafsir": "In these verses, Allah warns that there is no way for humans to deny His power which they can clearly see for themselves. The words \"kalla\" (by no means) are also a rebuttal to the sayings of the polytheists above. To strengthen this, Allah swears by the moon, the night when it has passed, and when the dawn begins to shine. With the moon, night, and dawn, Allah confirms that the Saqar hell is a very terrible disaster for mankind. Some explain that the meaning of ihda al-kubar (one of the very big disasters) is one of the seven terrible hells. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. This is a threat to humans. The existence of the seven hells (one of which is Saqar) is a threat to those who still do not want to submit to God's will. There are those who interpret nadhir (threatening) as the nature of God, so the meaning of this verse is: \"I am threatening you, therefore you should be afraid of this threat.\" Some interpret nadhir as a characteristic of the Prophet Muhammad as mentioned in the second verse above."
		   },
		   {
			"id": 5530,
			"surah": 74,
			"ayat": 35,
			"tafsir": "In these verses, Allah warns that there is no way for humans to deny His power which they can clearly see for themselves. The words \"kalla\" (by no means) are also a rebuttal to the sayings of the polytheists above. To strengthen this, Allah swears by the moon, the night when it has passed, and when the dawn begins to shine. With the moon, night, and dawn, Allah confirms that the Saqar hell is a very terrible disaster for mankind. Some explain that the meaning of ihda al-kubar (one of the very big disasters) is one of the seven terrible hells. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. This is a threat to humans. The existence of the seven hells (one of which is Saqar) is a threat to those who still do not want to submit to God's will. There are those who interpret nadhir (threatening) as the nature of God, so the meaning of this verse is: \"I am threatening you, therefore you should be afraid of this threat.\" Some interpret nadhir as a characteristic of the Prophet Muhammad as mentioned in the second verse above."
		   },
		   {
			"id": 5531,
			"surah": 74,
			"ayat": 36,
			"tafsir": "In these verses, Allah warns that there is no way for humans to deny His power which they can clearly see for themselves. The words \"kalla\" (by no means) are also a rebuttal to the sayings of the polytheists above. To strengthen this, Allah swears by the moon, the night when it has passed, and when the dawn begins to shine. With the moon, night, and dawn, Allah confirms that the Saqar hell is a very terrible disaster for mankind. Some explain that the meaning of ihda al-kubar (one of the very big disasters) is one of the seven terrible hells. The seven valleys of hell (as mentioned in other verses) are: Jahanam, Ladha, Huthamah, Sa'ir, Saqar, Jahim, and Hawiyah. This is a threat to humans. The existence of the seven hells (one of which is Saqar) is a threat to those who still do not want to submit to God's will. There are those who interpret nadhir (threatening) as the nature of God, so the meaning of this verse is: \"I am threatening you, therefore you should be afraid of this threat.\" Some interpret nadhir as a characteristic of the Prophet Muhammad as mentioned in the second verse above."
		   },
		   {
			"id": 5532,
			"surah": 74,
			"ayat": 37,
			"tafsir": "Allah confirms that the threat is addressed to anyone who wants to accept or reject it. It is okay to reject the threat, but it will suffer the consequences, just like al-Walid mentioned in the last verse. Who wants to go forward or backward in this verse means \"for those who want to achieve as much goodness and obedience as possible or stay away from goodness and obedience so that they fall into the valley of sin and immorality\". In short, it can be explained that the disbelievers have understood the existence of Saqar hell, its torments, and its guardian angels. It is up to them whether to immediately avoid it by pursuing as many pious and pious deeds as possible, or whether to persist in rejecting and denying it, so that at the promised time, they will see the proof for themselves. From this 37th verse, Ibn 'Abbas concludes that apart from threatening sentences (tahdid), it is also an announcement that those who believe and obey the Prophet Muhammad will surely be rewarded with an uninterrupted reward, on the other hand those who reject the truth of Muhammad and lying to him will be tortured with unending punishment."
		   },
		   {
			"id": 5533,
			"surah": 74,
			"ayat": 38,
			"tafsir": "In this verse Allah confirms that every human soul is pawned in the sight of Allah. Both Muslim and unbeliever, disbeliever or obedient, all depend on Allah. Every soul is bound by the deeds that are done until the Day of Judgment, except for the right group. This means that they can release their attachment to Allah with the good deeds they do, just as a person can release himself from the pawn status because he has paid his obligations. The right group in question are sincere believers, who receive their books of practice on the right hand on the Day of Judgment. However, there are also those who say that the right group in this verse are children whose sins and crimes have not been reckoned with. Some even argue that the right group is the angels."
		   },
		   {
			"id": 5534,
			"surah": 74,
			"ayat": 39,
			"tafsir": "In this verse Allah confirms that every human soul is pawned in the sight of Allah. Both Muslim and unbeliever, disbeliever or obedient, all depend on Allah. Every soul is bound by the deeds that are done until the Day of Judgment, except for the right group. This means that they can release their attachment to Allah with the good deeds they do, just as a person can release himself from the pawn status because he has paid his obligations. The right group in question are sincere believers, who receive their books of practice on the right hand on the Day of Judgment. However, there are also those who say that the right group in this verse are children whose sins and crimes have not been reckoned with. Some even argue that the right group is the angels."
		   },
		   {
			"id": 5535,
			"surah": 74,
			"ayat": 40,
			"tafsir": "This verse further explains that the right group has a place in heaven, they ask each other how the fate of the rebellious group will be. They were greeted by angels with greetings as Allah says: So, \"Greetings to you (O) from the right!\" (greet the angel). (al-Waqi'ah\/56: 91) And the word of Allah: ¦The guards said to them, \"Prosperity (spoiled) upon you, be happy you! So enter, you are eternal in it.\" (az-Zumar\/39: 73)"
		   },
		   {
			"id": 5536,
			"surah": 74,
			"ayat": 41,
			"tafsir": "This verse further explains that the right group has a place in heaven, they ask each other how the fate of the rebellious group will be. They were greeted by angels with greetings as Allah says: So, \"Greetings to you (O) from the right!\" (greet the angel). (al-Waqi'ah\/56: 91) And the word of Allah: ¦The guards said to them, \"Prosperity (spoiled) upon you, be happy you! So enter, you are eternal in it.\" (az-Zumar\/39: 73)"
		   },
		   {
			"id": 5537,
			"surah": 74,
			"ayat": 42,
			"tafsir": "This verse explains that the right group is in a heavenly chamber full of pleasures, while the sinful group is wallowing in the torments of hell. However, they can ask each other questions, \"Why did you end up in that hell?\" They answered honestly and frankly that they did not pray above the world before, in contrast to the believers who still pray. Because at that time they did not have the slightest confidence that this was actually commanded by God."
		   },
		   {
			"id": 5538,
			"surah": 74,
			"ayat": 43,
			"tafsir": "This verse explains that the right group is in a heavenly chamber full of pleasures, while the sinful group is wallowing in the torments of hell. However, they can ask each other questions, \"Why did you end up in that hell?\" They answered honestly and frankly that they did not pray above the world before, in contrast to the believers who still pray. Because at that time they did not have the slightest confidence that this was actually commanded by God."
		   },
		   {
			"id": 5539,
			"surah": 74,
			"ayat": 44,
			"tafsir": "This verse explains that they are not among those who always do good to the poor and needy. Even though they can do so because of the excess of God's grace and sustenance that they get. They don't want to ease the difficulties of the poor with the alms they should spend."
		   },
		   {
			"id": 5540,
			"surah": 74,
			"ayat": 45,
			"tafsir": "This verse explains that they are involved in the actions of despicable people, who are displeased with Islam and the Prophet Muhammad by accusing him of being a liar or a crazy sorcerer. Regarding the Qur'an they consider it to be just magic, poetry or spells for sorcery. Anyway, they are involved in acts of evil."
		   },
		   {
			"id": 5541,
			"surah": 74,
			"ayat": 46,
			"tafsir": "This verse expresses their subsequent confession that they denied the hereafter. This means that they deny the existence of the day of reckoning and retribution for all human actions, until they come to the belief, namely death. Strictly speaking they believe and see with their own eyes that everything will return to Allah in the afterlife. Then it is no longer useful for them the intercession of those who intercede. This means that if a person already has the characteristics mentioned in the verse above (not praying, not wanting to pay attention to the livelihood of the poor, being involved in the actions of people who like to criticize, denying the arrival of the hereafter), any intercession (help) is useless for him. save them from the torments of hellfire. Because intercession is only useful for those who deserve it."
		   },
		   {
			"id": 5542,
			"surah": 74,
			"ayat": 47,
			"tafsir": "This verse expresses their subsequent confession that they denied the hereafter. This means that they deny the existence of the day of reckoning and retribution for all human actions, until they come to the belief, namely death. Strictly speaking they believe and see with their own eyes that everything will return to Allah in the afterlife. Then it is no longer useful for them the intercession of those who intercede. This means that if a person already has the characteristics mentioned in the verse above (not praying, not wanting to pay attention to the livelihood of the poor, being involved in the actions of people who like to criticize, denying the arrival of the hereafter), any intercession (help) is useless for him. save them from the torments of hellfire. Because intercession is only useful for those who deserve it."
		   },
		   {
			"id": 5543,
			"surah": 74,
			"ayat": 48,
			"tafsir": "This verse expresses their subsequent confession that they denied the hereafter. This means that they deny the existence of the day of reckoning and retribution for all human actions, until they come to the belief, namely death. Strictly speaking they believe and see with their own eyes that everything will return to Allah in the afterlife. Then it is no longer useful for them the intercession of those who intercede. This means that if a person already has the characteristics mentioned in the verse above (not praying, not wanting to pay attention to the livelihood of the poor, being involved in the actions of people who like to criticize, denying the arrival of the hereafter), any intercession (help) is useless for him. save them from the torments of hellfire. Because intercession is only useful for those who deserve it."
		   },
		   {
			"id": 5544,
			"surah": 74,
			"ayat": 49,
			"tafsir": "In this verse, in a scornful tone, Allah asks, \"Why did the disbelievers turn away from My warning?\" What this means is why did the Meccans and people like them oppose the truth of the Qur'an which had given them such great and terrible warnings? There are two ways to turn away from Allah (from the Qur'an), namely: first, being stubborn and not admitting it at all (denying it); secondly, leaving the deeds that He ordered. That is the opinion of Muqatil, one of the tabi'in."
		   },
		   {
			"id": 5545,
			"surah": 74,
			"ayat": 50,
			"tafsir": "Then it is also described the attitude of the polytheists and infidels to avoid religious warnings. They are likened to wild donkeys running surprised away from lions. This means that those polytheists ran away from Muhammad or those who disbelieved fled from the religion of Islam, like a scared donkey running away from being chased by a lion, or running scared because it is being chased by humans (hunters). This verse also implies that people who should have accepted Islam's call and learned from the warnings given by Allah, instead opposed it without any logical reasons. Here we also compare how a donkey runs away in fear without direction. Similarly, humans run away from religion without proper reasons. The nature of trying to avoid religious obligations like that we see today, has indeed been described by the Al-Qur'an since long ago."
		   },
		   {
			"id": 5546,
			"surah": 74,
			"ayat": 51,
			"tafsir": "Then it is also described the attitude of the polytheists and infidels to avoid religious warnings. They are likened to wild donkeys running surprised away from lions. This means that those polytheists ran away from Muhammad or those who disbelieved fled from the religion of Islam, like a scared donkey running away from being chased by a lion, or running scared because it is being chased by humans (hunters). This verse also implies that people who should have accepted Islam's call and learned from the warnings given by Allah, instead opposed it without any logical reasons. Here we also compare how a donkey runs away in fear without direction. Similarly, humans run away from religion without proper reasons. The nature of trying to avoid religious obligations like that we see today, has indeed been described by the Al-Qur'an since long ago."
		   },
		   {
			"id": 5547,
			"surah": 74,
			"ayat": 52,
			"tafsir": "In this verse, Allah mentions an example of their stubborn attitude which cannot be accepted by common sense or by a feeling heart. Each of them wishes to be given to him the open pages of the notebook (the book). Each of them also wants to receive revelations like those received by the Prophet Muhammad. In addition, the book was a bit special for them, namely with open pages that descended from the sky. It was narrated by commentators that a group of Quraysh came to the Prophet and said, \"It would be nice if each of our leaders had a book in open pages that came down from Allah. In that book we can read a statement that says you, O Muhammad, are the messenger of Allah.\" Him. It is this leaf that tells us to believe in you and follow your religion.\" From Qatadah, information was received that the meaning of the verse above is that they wish to be free from all sins without working and doing the slightest good. It was also narrated that Abu Jahl and his entourage consisting of Quraysh leaders said to the Prophet, \"O Muhammad, we will not believe in you unless you give each of us the book's address, each of which comes from God and is also in there is an order ordering us to follow your religion.\" This expression is also found in one of the verses of the Qur'an: And we will not believe in your ascension until you send us a book for us to read.\" Say (Muhammad), \"Glory be to my Lord, am I not only a human being who becomes messenger?\" (al-Isra'\/17: 93)"
		   },
		   {
			"id": 5548,
			"surah": 74,
			"ayat": 53,
			"tafsir": "With a tone of ridicule, Allah firmly refused the request, because actually they are not afraid of the hereafter. This means that Allah will not grant their demands. Allah will not send down a book from the sky especially for them. Allah says emphatically that actually what makes their souls rough, their morals evil, their eyesight closed, and their ears blocked from the truth, is because they do not believe in the Hereafter with all its awesomeness. If their request had been granted, there would have been many other requests to follow, simply to show their unfavorable intentions towards Islam. Because there are enough arguments and proofs of the truth of the Prophet Muhammad for them. Then they ask for the truth of the Prophet Muhammad for them and ask for another addition that is not worth asking for, a request that doesn't mean anything at all."
		   },
		   {
			"id": 5549,
			"surah": 74,
			"ayat": 54,
			"tafsir": "Furthermore, in this verse, Allah confirms again, \"This is absolutely not the case, in fact the Qur'an is a warning.\" The Qur'an is not what they accuse. The Qur'an is not magic that can be learned, but a direct warning from Allah, so that no one can escape accountability to Allah in the hereafter."
		   },
		   {
			"id": 5550,
			"surah": 74,
			"ayat": 55,
			"tafsir": "Allah says that whoever wants the Qur'an as a guide, surely he will get a lesson from it. Anyone who always remembers the Qur'an, does not forget it, and uses it as a guide in his life, will benefit himself. In the Qur'an there is happiness in the world and the hereafter."
		   },
		   {
			"id": 5551,
			"surah": 74,
			"ayat": 56,
			"tafsir": "This verse confirms that they will not take lessons from the Qur'an unless Allah so wills. Only He has the right to forgive. Strictly speaking, no one gets warnings and teachings from the Qur'an except who Allah wills. No one is able to do so except by virtue of the power given by God. That's how Allah does what He wills without being hindered by anyone. That is why it is only Allah that humans should fear, He alone must be feared and He alone must be obeyed. It is He who gives forgiveness to His faithful servants. In a hadith it is stated: That the Messenger of Allah, read this verse \"huwa ahlul-takwa wa ahlul-magfirah\" and said, \"Your Lord said, 'I am the most to be feared, so do not be made with Me another God. Whoever is pious to Me and if he does not make another God with Me, then I am the one who has the right to forgive him.\" (History of Ahmad, ad-Darimi, at-Tirmizi, an-Nasa'i, and Ibn Majah from Anas bin Malik)"
		   }
	]
}
