{
	"tafseer": [
		{
			"id": 3160,
			"surah": 27,
			"ayat": 1,
			"tafsir": "The beginning of this surah explains that the Qur'an is the revelation of Allah revealed to the Prophet Muhammad, the last prophet and messenger. The verses of the Qur'an were revealed through the intercession of the angel Gabriel. These verses provide explanations and explanations for people who think that the Qur'an is really the book revealed by Allah to the Prophet Muhammad. It is not the words of a hoax or the result of engineering by the Prophet Muhammad, nor is it the creation of one of Allah's creatures. It is not possible for humans and jinn to make the Qur'an or to emulate it, even though both of them work together for that. The meaning of the sentence \"The book that explains\" is the Qur'an. In this verse, the two names of the Qur'an are gathered, namely \"Al-Qur'an\" (which is read) and \"al-Kitab\" (which is written down). Two names that have the same meaning and purpose. In another verse, Allah says: Alif Lam Ra. This (surahh) is (part of) the verses of the (perfect) Book, namely (verses) of the Al-Qur'an which gives explanations. (al-hijr\/15: 1) The verses of the Qur'an provide an explanation of the meaning of the verses, because in it there are verses that explain each other. The point is that there are verses that discuss one issue in detail and explain the meaning of other verses which contain the same issue, but are revealed globally. The verses of the Al-Qur'an also provide an explanation of the purposes of its decline, such as the laws related to halal and haram, promises and threats, as well as orders and prohibitions. All of these are used as guidelines for life in the world as a way to achieve happiness in life in the afterlife."
		   },
		   {
			"id": 3161,
			"surah": 27,
			"ayat": 2,
			"tafsir": "The Qur'an is a guide and good news for those who believe. Guidance which is the guidance of Allah, so that people become confident and willing to believe. However, not all humans can obtain and enjoy guidance from Allah, even though the Al-Qur'an was revealed as a guide and differentiator between right and wrong for all humans, as in Allah's word: The month of Ramadan is (the month) in which Allah sent down -Qur'an, as a guide for humans and explanations regarding those instructions and the differentiator (between the true and the false)... (al-Baqarah\/2: 185). Only those who believe and who have the willingness within themselves to believe can enjoy the guidance of the Qur'an. For those who believe, the Al-Qur'an adds to the instructions and guidance that are already there, so that their faith and deeds also increase in carrying out Islamic teachings which also originate from the Al-Qur'an. Thus, a person's faith can increase and decrease according to his deeds. This is mentioned by Allah in His word: ... As for those who believe, then this surahh increases their faith, and they are happy. (at-Taubah\/9: 124). They were happy because they received news about the abundance of mercy and the pleasure of Allah. Heaven is also available for them as a place to live, which is full of various kinds of pleasures."
		   },
		   {
			"id": 3162,
			"surah": 27,
			"ayat": 3,
			"tafsir": "This verse describes the characteristics of a believer, namely: 1. Establishing prayer, namely performing the obligatory prayer by perfecting its pillars and conditions, in accordance with what Allah has commanded. Prayers are performed with all sincerity, solemnity, and humility before Allah. Prayer can prevent acts that are heinous and unjust because prayer can eliminate negative soul traits. Prayer is an element that forms piety in addition to faith in the unseen. Concentration in performing prayers is one of the conditions for becoming a true believer. The position of prayer in Islam includes: a. As a pillar of religion, without prayer religion will collapse. b. As the first obligation from Allah before other worship obligations. This mandatory order was received directly by the Prophet Muhammad without the mediation of the angel Gabriel as mentioned in the story of Isra' Mi'raj. c. Prayer is the first charity to be reckoned with (recount) on the Day of Judgment. If the prayer is good, then all other deeds will be good too. On the other hand, if the prayer is broken, then all other deeds are also damaged. 2. Paying zakat which is one of the five pillars of Islam. Paying zakat is obligatory in accordance with the provisions set by Allah and His Messenger. Abu Bakr as the first caliph after the death of the Prophet Muhammad, has fought against people who do not want to pay zakat. Even though zakat is an obligation related to wealth. With zakat, believers cleanse their souls from miserliness and covetousness. Both of these characteristics can cause slander (disorder) for property owners. Wealth is a provision from Allah that must be grateful for by paying zakat, as a way to purify it. In this treasure there is a share that belongs to the poor. For poor people, zakat can cleanse their souls from jealousy and jealousy towards rich people. Thus, good relations between the rich and the poor in society will be maintained and the gap between the two can be reduced. 3. Confident in the existence of the hereafter, the meaning is to believe in the existence of life after death. Everyone will return to Allah to be reckoned with his good and bad deeds. Both will be rewarded with the appropriate reward. Thus, every human being will be responsible for what he did while living in the world. This means that humans were created by Allah in the world not without purpose or in vain. Allah reminds this in His words: So do you think that We created you playfully (without any intention) and that you will not be returned to Us? (al-Mu'minun\/23: 115)."
		   },
		   {
			"id": 3163,
			"surah": 27,
			"ayat": 4,
			"tafsir": "In the past verses, Allah explains some of the attitudes of believers who receive guidance and guidance from Allah. This verse explains the behavior and actions of disbelievers, who do not want to believe in the existence of the hereafter, and the consequences they will experience. People who don't believe in the afterlife are those who don't believe in the Day of Judgment, don't believe that all humans will return to Allah through death, don't believe they will be resurrected on the day of reckoning, and don't believe there will be a reward in return for good deeds. and torture in return for bad deeds. They live in the world without restraining their lusts, and are very fond of worldly pleasures, as if living in this world is the only life for them. They do not recognize halal and haram, and do not think about responsibilities in the hereafter. All of these behaviors they consider good. Whereas following lust means following Satan's teachings which are misguided and misleading. Thus, they live and wallow in error. This is their recompense for their denial."
		   },
		   {
			"id": 3164,
			"surah": 27,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that they will receive a bad punishment in this world and in the hereafter. This is God's threat to unbelievers who do not believe in the hereafter. This verse is also a warning to all mankind. Torment in the world can occur with various natural disasters such as floods, earthquakes, wars that cause human and property victims, and so on. The torments of this world can also be in the form of mental or soul torments that are experienced individually, even though some of them have fulfilled the various needs of their worldly life, some even have more than enough. However, their lives are unhappy and always restless, their souls are empty, and they have no purpose in life because they do not believe in the afterlife. In the life of the hereafter, they will lose a lot and become residents of hell forever. Each received punishment according to the punishment according to their bad deeds. Because of the pain of the torment, they then asked for relief from the guardian angel of hell so that they would not be tortured, even if it was only for one day. This is mentioned by Allah in His word: And those who are in hell say to the keepers of Hell Hell, \"Ask your Lord to lighten our punishment for just one day.\" (al-Mu'min\/40: 49)."
		   },
		   {
			"id": 3165,
			"surah": 27,
			"ayat": 6,
			"tafsir": "In this verse, Allah said to the Prophet Muhammad to inform him that the Qur'an was revealed to him by the angel Gabriel to be understood, memorized, and taught to his people and to implement the teachings in it. The Qur'an is not a creation The Prophet emphasized in His words: By the setting star, your friend (Muhammad) is not astray and is not (also) mistaken, and what he says (Al-Qur'an) is not according to his will. None other than (the Qur'an) is a revelation that was revealed (to him), which was taught to him by (Gabriel) who is very powerful. (an-Najm\/53: 1-5). It is clear that the Qur'an is from Allah, the All-Wise in all actions towards His creatures, All-Knowing of their condition and what is good for them. His message is true and His law is just, as Allah has said: And perfected the word of your Lord (Qur'an) in truth and justice. (al-An'am\/6: 115)."
		   },
		   {
			"id": 3166,
			"surah": 27,
			"ayat": 7,
			"tafsir": "This verse was revealed to the Prophet Muhammad with an order that he convey to his people the story of Prophet Musa when he was on his way from Madyan to return to Egypt accompanied by his family. This trip was carried out after Musa completed the allotted time, as agreed between Musa and his parents-in-law. This is mentioned by Allah in His word: So when Moses had finished the appointed time and he departed with his family, he saw fire on the mountainside. He said to his family, \"Wait (here), in fact I see a fire, hopefully I can bring you some news from (place) the fire or (bring) a spark of fire, so you can warm yourself.\" (al-Qasas\/28: 29). The specified time was the result of an agreement between Musa and his parents-in-law when setting out the dowry for his marriage, which was to work in her parents-in-law's goat herding for eight years or be refined to ten years. Ten years shows his tenacity and sincerity. Whereas what is meant by his family in the verse above is his wife, without anyone else. On the way on that very dark and cold night, Musa got lost. When he saw from a distance there was a flame, Musa ordered his family to stay in that place, while he would go to the place of the fire. He hopes to get a guide, so he doesn't get lost again. According to him, the presence of fire meant that there were people around where they were. In addition, the Prophet Musa hoped to be able to bring his family a fire, which was lit from a source of fire that was visible to him. With that flame, he and his family would certainly be able to stay warm from the gripping cold."
		   },
		   {
			"id": 3167,
			"surah": 27,
			"ayat": 8,
			"tafsir": "When Musa came closer to the fire, it turned out that what he thought was not a fire like the fire he was used to seeing, but light emanating from a kind of green hair plant that twined and hung on a branch of wood. The light that emanated from the tree shone brilliantly, while the branches of the tree remained green and fresh, not burnt or withered. Musa did not find anyone in that place, so he was astonished and amazed to see such a situation. He intended to pluck some of the flame from a branch that leaned towards him. When he tried to light the flames, Moses was afraid. In such a state, suddenly he was called by a voice coming from the direction of the tree. The calling voice stated that those who were near the fire must be blessed, namely Moses and the angels. This statement is a greeting and respect from Allah to the Prophet Musa as the greetings of the angels to the Prophet Abraham in His words: Allah's mercy and His blessings, poured out on you, O ahlul-bayt. (Hud\/11: 73) 'Abdullah bin 'Abbas states that what is meant by \"blessed\" here is that which is purified by Allah. According to him, what the Prophet Musa saw as fire was not fire, but a blazing light like fire. That light is the light of the Lord of the Universe. This is corroborated by the hadith narrated by Abu 'Ubaidah from Abu Musa al-Asy'ari that the Prophet Muhammad said: Verily Allah does not sleep and it is not fitting for Allah to sleep, He lowers and raises the scales, deeds at night are raised before Him before day, and the deeds of the day before the night, and His veil is light. If He had opened His veil, surely the holiness of the light of His face would have burnt everything that His gaze could reach among His creation. (Muslim history) This incident occurred when Musa arrived at a blessed place, namely the holy valley called the Thuwa Valley, as mentioned in His word: ... He was called from (the direction of) the right edge of the valley, from a tree, in a blessed piece of land.... (al-Qasas\/28: 30). And the word of God which reads: When God called him (Moses) in the sacred valley, namely the Thuwa Valley. (an-Naziat\/79: 16). Allah's call that was heard by Moses in the sacred valley of Thuwa was a revelation of the appointment of the Prophet Musa as an apostle. He was sent by God to convey the treatise to Pharaoh in Egypt, equipped with various miracles. Moses was face to face with God when he received the revelation, but Moses could not see Him, because he was blocked by a veil of light. Receiving this kind of revelation is one of the ways of conveying God's revelation to His prophets. This is called Allah in His word: And it is not proper for a human being that Allah will speak to him except by means of revelation or from behind a veil or by sending messengers (angels) and then revealed to him with His permission what He wills.... (asy-Shura\/42: 51). Glory be to Allah, Lord of all the worlds who do according to what He wills. There is no single creature that equals Him. He is the Supreme and Most High of all His creatures. What Moses heard was the voice of the word of God. This is stated by Allah in the ninth verse that it is Allah who calls and calls him, not the voice of creatures. Allah is Mighty over all things, Wise in His words and deeds."
		   },
		   {
			"id": 3168,
			"surah": 27,
			"ayat": 9,
			"tafsir": "When Musa came closer to the fire, it turned out that what he thought was not a fire like the fire he was used to seeing, but light emanating from a kind of green hair plant that twined and hung on a branch of wood. The light that emanated from the tree shone brilliantly, while the branches of the tree remained green and fresh, not burnt or withered. Musa did not find anyone in that place, so he was astonished and amazed to see such a situation. He intended to pluck some of the flame from a branch that leaned towards him. When he tried to light the flames, Moses was afraid. In such a state, suddenly he was called by a voice coming from the direction of the tree. The calling voice stated that those who were near the fire must be blessed, namely Moses and the angels. This statement is a greeting and respect from Allah to the Prophet Musa as the greetings of the angels to the Prophet Abraham in His words: Allah's mercy and His blessings, poured out on you, O ahlul-bayt. (Hud\/11: 73) 'Abdullah bin 'Abbas states that what is meant by \"blessed\" here is that which is purified by Allah. According to him, what the Prophet Musa saw as fire was not fire, but a blazing light like fire. That light is the light of the Lord of the Universe. This is corroborated by the hadith narrated by Abu 'Ubaidah from Abu Musa al-Asy'ari that the Prophet Muhammad said: Verily Allah does not sleep and it is not fitting for Allah to sleep, He lowers and raises the scales, deeds at night are raised before Him before day, and the deeds of the day before the night, and His veil is light. If He had opened His veil, surely the holiness of the light of His face would have burnt everything that His gaze could reach among His creation. (Muslim history) This incident occurred when Musa arrived at a blessed place, namely the holy valley called the Thuwa Valley, as mentioned in His word: ... He was called from (the direction of) the right edge of the valley, from a tree, in a blessed piece of land.... (al-Qasas\/28: 30). And the word of God which reads: When God called him (Moses) in the sacred valley, namely the Thuwa Valley. (an-Naziat\/79: 16). Allah's call that was heard by Moses in the sacred valley of Thuwa was a revelation of the appointment of the Prophet Musa as an apostle. He was sent by God to convey the treatise to Pharaoh in Egypt, equipped with various miracles. Moses was face to face with God when he received the revelation, but Moses could not see Him, because he was blocked by a veil of light. Receiving this kind of revelation is one of the ways of conveying God's revelation to His prophets. This is called Allah in His word: And it is not proper for a human being that Allah will speak to him except by means of revelation or from behind a veil or by sending messengers (angels) and then revealed to him with His permission what He wills.... (asy-Shura\/42: 51). Glory be to Allah, Lord of all the worlds who do according to what He wills. There is no single creature that equals Him. He is the Supreme and Most High of all His creatures. What Moses heard was the voice of the word of God. This is stated by Allah in the ninth verse that it is Allah who calls and calls him, not the voice of creatures. Allah is Mighty over all things, Wise in His words and deeds."
		   },
		   {
			"id": 3169,
			"surah": 27,
			"ayat": 10,
			"tafsir": "This verse is a series of direct conversations between Allah and Moses in the holy valley of thuwa. After Moses was appointed as a prophet and apostle, God ordered Moses to throw the stick that was held in his right hand. When the stick was thrown, Musa saw it move like a jann, which is a kind of snake that is very agile in its movements. It did not cross Moses' heart for a moment that his stick would turn into a snake, even though with that staff Moses could benefit in his daily life as a goat herder. This is stated by Allah in His word: He (Moses) said, \"This is my stick, I rely on it, and I knock out (leaves) with it for (food) for my goats, and for me there are still other benefits.\" (thaha\/20: 18). When Musa saw his staff turning into a snake, he ran backwards without looking back, feeling very frightened. At that time, God said to Moses not to be afraid, because actually people who are appointed as apostles should not be afraid before Him. This call from God was preceded by an order to come before Him and guarantee safety. So Allah confirmed with His words: ...\"O Musa! Come here and don't be afraid. Verily, you are one of those who are safe. (Al-Qasas\/28: 31). In addition, Allah ordered Musa to hold the snake so that it becomes a stick back. This was the first miracle for Moses. Allah's Word: He (Allah) said, \"Take hold of him and do not be afraid, We will restore him to his former state. (thaha\/20: 21). As for those who fear Allah, they are those who do injustice, who place things out of place. Zalim can be against oneself, other people, or other creatures of God. People who truly repent to Allah, will not do wrong again, then accompany it with good deeds, there is no need to be afraid to face Allah. This is good news for them and also for all mankind, as was the behavior of the Pharaoh's sorcerers who believed in Moses as the messenger of God. Whoever commits a sin, then stops himself from these actions and repents, then Allah will accept his repentance. This is confirmed by Allah in His word: And indeed, I am Forgiving to those who repent, believe, and do good, then remain in guidance. (thaha\/20: 82). And His word again: And whoever commits evil and wrongs himself, then he asks Allah's forgiveness, surely he will find Allah Most Forgiving, Most Merciful. (an-Nisa'\/4: 110)."
		   },
		   {
			"id": 3170,
			"surah": 27,
			"ayat": 11,
			"tafsir": "This verse is a series of direct conversations between Allah and Moses in the holy valley of thuwa. After Moses was appointed as a prophet and apostle, God ordered Moses to throw the stick that was held in his right hand. When the stick was thrown, Musa saw it move like a jann, which is a kind of snake that is very agile in its movements. It did not cross Moses' heart for a moment that his stick would turn into a snake, even though with that staff Moses could benefit in his daily life as a goat herder. This is stated by Allah in His word: He (Moses) said, \"This is my stick, I rely on it, and I knock out (leaves) with it for (food) for my goats, and for me there are still other benefits.\" (thaha\/20: 18). When Musa saw his staff turning into a snake, he ran backwards without looking back, feeling very frightened. At that time, God said to Moses not to be afraid, because actually people who are appointed as apostles should not be afraid before Him. This call from God was preceded by an order to come before Him and guarantee safety. So Allah confirmed with His words: ...\"O Musa! Come here and don't be afraid. Verily, you are one of those who are safe. (Al-Qasas\/28: 31). In addition, Allah ordered Musa to hold the snake so that it becomes a stick back. This was the first miracle for Moses. Allah's Word: He (Allah) said, \"Take hold of him and do not be afraid, We will restore him to his former state. (thaha\/20: 21). As for those who fear Allah, they are those who do injustice, who place things out of place. Zalim can be against oneself, other people, or other creatures of God. People who truly repent to Allah, will not do wrong again, then accompany it with good deeds, there is no need to be afraid to face Allah. This is good news for them and also for all mankind, as was the behavior of the Pharaoh's sorcerers who believed in Moses as the messenger of God. Whoever commits a sin, then stops himself from these actions and repents, then Allah will accept his repentance. This is confirmed by Allah in His word: And indeed, I am Forgiving to those who repent, believe, and do good, then remain in guidance. (thaha\/20: 82). And His word again: And whoever commits evil and wrongs himself, then he asks Allah's forgiveness, surely he will find Allah Most Forgiving, Most Merciful. (an-Nisa'\/4: 110)."
		   },
		   {
			"id": 3171,
			"surah": 27,
			"ayat": 12,
			"tafsir": "In this verse, Allah shows another of His powers, after showing His power to change the inanimate object that was in the hands of Moses into a living creature in the form of a snake. Then Moses was ordered to put his hands in his armpits, through the slit of his shirt. When it was taken out, the hand gave off a brilliant white light. This was the second miracle of Moses. These two kinds of miracles of Moses are part of the nine miracles that God gave him. This miracle was proof to Pharaoh and his people that Moses was the messenger of God to invite him to the right path and be pleased with Him. The number of the nine miracles of Moses was confirmed by Allah in His word: And indeed, We have given Moses nine real miracles. (al-Isra'\/17: 101). Moses was sent by God with various extraordinary incidents to face Pharaoh and his people who were wicked, beyond the limits of human nature. Even Pharaoh claimed to be God and his confession was justified by his people. This is mentioned by Allah in His word: (Seraya) said, \"I am your most high god.\" (an-Nazi'at\/79: 24)."
		   },
		   {
			"id": 3172,
			"surah": 27,
			"ayat": 13,
			"tafsir": "When Musa confronted him, Pharaoh confessed that he was a god. Pharaoh asked Musa for proof that he was really the messenger of God. Moses as God's messenger gave evidence by throwing his stick which then became a snake that moved nimbly, then put his hand into his armpit through the slit of his shirt neck, then took it out so his hand became white and shone brilliantly for those who saw it. This verse explains that the two pieces of evidence above are very clear witnesses that Moses was truly the messenger of God. However, they denied the evidence and said that it was pure magic."
		   },
		   {
			"id": 3173,
			"surah": 27,
			"ayat": 14,
			"tafsir": "They belied the evidence with words, while in their small hearts, they confirmed that Moses was the messenger of God. They deny because their hearts are filled with injustice and pride, as a result they do not want to follow the truth. Their arrogant, arrogant, and haughty attitude is confirmed by Allah in His word: ... But they are arrogant and they are indeed a proud people. (al-Mu'minun\/23: 46). This is a warning to the Prophet Muhammad and his people. They were called upon to pay attention to the consequences that Pharaoh and his people experienced, namely they perished drowning in the sea, as Allah said: So We punished some of them, then We drowned them in the sea because they had denied Our verses and neglected our verses. We. (al-A'raf\/7: 136). The above verse is also a warning to those who belied the Prophet Muhammad. They will receive the same consequences as the ancients who denied the teachings of God."
		   },
		   {
			"id": 3174,
			"surah": 27,
			"ayat": 15,
			"tafsir": "This verse explains that Allah has bestowed upon Prophet David and Prophet Sulaiman (son of Prophet David) knowledge, both related to knowledge of God and His Shari'a, as well as those related to general knowledge, such as the ability and talent to lead and manage their people. These two prophets not only had knowledge, but also practiced it well. Thus, the knowledge possessed by each of the prophets is not only beneficial for himself, but also for society and his people in this world and in the hereafter. Due to obtaining unlimited favors from Allah, both of them are grateful for these blessings by saying: Praise be to Allah who has excelled us from most of the believing servants. The grateful attitude of the Prophet David and Prophet Sulaiman in receiving God's favors is a commendable attitude. Therefore, the scholars recommend that Muslims emulate this attitude. Being grateful for a favor means that the servant who receives the favor really feels that what he has received is an expression of God's love for him and feels that he really needs God's favor. Without that favor, he will not live and feel happiness. Allah said: And (remember) when your Lord announced, \"Indeed, if you are grateful, I will surely add (favors) to you, but if you deny (My favors), then My punishment will be very severe.\" (Ibrahim\/14: 7). Allah appointed the Prophet David as a head of state and an apostle of Allah. As the head of state, Allah bestowed upon the Prophet David all the necessary knowledge. Among the virtues and knowledge bestowed are: 1. God subjected mountains and birds to David. The mountain and the bird glorify David morning and evening. Allah said: Indeed, it is We who subject the mountains to glorify with him (David) in the evening and in the morning, and (We also subject) the birds in a state of gathering. Each one is very obedient (to Allah). (sad\/38: 18-19). 2. God gave David the knowledge to soften iron, so that he could make armor and other necessities, to strengthen his reign and ministry. Allah said: ... and We have softened the iron for him. (Saba'\/34: 10). 3. God has strengthened David's kingdom and bestowed upon him wisdom and wisdom, so that he can easily resolve disputes and matters submitted to him. Allah says: And We strengthened his kingdom and We gave him wisdom and wisdom in deciding matters. (sad\/38: 20). According to al-Baidhawi, what is meant by the word of Allah, \"And We strengthened his kingdom\" is, \"We (Allah) have strengthened him with invulnerability, won wars, and had many soldiers. 4. Allah revealed to him the Psalms, so that he was one of of the four apostles whose book was sent down to him. Allah said: \"... And indeed, We have given advantages to some of the prophets over some (others), and We gave the Zabur to David.\" (al-Isra'\/17 : 55) 5. Allah gave him the ability to understand bird speech, as explained in the following verse."
		   },
		   {
			"id": 3175,
			"surah": 27,
			"ayat": 16,
			"tafsir": "This verse explains that Solomon, the son of David, succeeded his father as king and apostle of Allah. According to Ibn 'Athiyyah, David was a king and an apostle of Allah who was sent to the Children of Israel. Sulaiman held this position after his father died. Because Solomon received these two positions after his father died, it is mentioned in this verse: And Solomon inherited David. According to al-Kalbi, the Prophet David had 19 sons. Of them all, only Solomon himself inherited the knowledge and ability to control government from his father. Because of that, he replaced his father as head of state. Then Allah also raised Solomon to be an apostle. According to the Encyclopedia Americana, the Prophet David was appointed king in 1002 BC (BC), when he was 37 years old (he was born in 1039 BC). David died in 962 BC, and reigned for 40 years, namely 7 years in Hebron and 33 years in Jerusalem. Before he died, David appointed his son Solomon to be the next king. He died after giving Sulaiman valuable advice and messages. Among the advice and messages is to worship Allah, maintain all of His laws, statutes, shari'a and words, according to those mentioned in the Torah of Moses, and establish a Haikal as a place of worship to Him. After the Prophet David died, Solomon began to hold the reins of government, namely in 961 BC. As a king and prophet, all the advice and messages of the Prophet David were carried out properly, so that the kingdom became stable and steady in his hands, until he died. (See \"David,\" Encyclopaedia Americana, Volume 8, p. 526). Besides inheriting the kingdom, science, prophecy, and the Psalms from his father, Solomon was also awarded by Allah with several other virtues. Therefore, he thanked Allah by saying, \"O people, Allah has bestowed upon us understanding and knowledge of the sound of birds and given everything that is needed. In fact, everything is really something real.\" Prophet Sulaiman with the strength and ability that God has given him, can understand the voices of other animals, apart from the sound of birds. In this verse, it is specifically stated that Solomon understands the sound of birds because birds are special soldiers of Prophet Sulayman who have special features as well, just as hud-hud birds have done. As it is known that the sound of animals is a sign language that applies between them. These sounds are heard in various forms and tones, such as the voice in a state of joy is different from the sound of birds in a state of fear. The sound of a female goat losing her child is different from the sound of being chased or pounced on by wild animals. Prophet Sulayman knew the meaning of the animal's voices with the power of feeling and knowledge that Allah had bestowed on him. According to al-Baidhawi, when he heard the voices of birds, Prophet Sulayman knew the meaning and purpose of those sounds with the strength of his feelings. In this verse it is also explained that Allah has bestowed upon Solomon all kinds of abilities and everything he needed to control the government of his country. Thus, the reign of Prophet Sulaiman was the heyday of the Children of Israel. Some commentators interpret the verse \"wa utina min kulli syai'in\" (and given everything needed), meaning that Allah has bestowed upon Sulaiman wisdom, multiplied treasures, great and extensive power as a king, and subdued the jinn, humans, birds and other animals. Because of the favors that have been bestowed upon him, Prophet Sulaiman thanked God by stating that all the blessings that had been bestowed on him, whether in the form of knowledge, gifts, virtues, and so on, were a privilege that had been given by God to him. With these various gifts, Allah has exalted him from other human beings."
		   },
		   {
			"id": 3176,
			"surah": 27,
			"ayat": 17,
			"tafsir": "This verse explains that Solomon was able to form an army consisting of various types of creatures, such as jinn, humans, birds, and other animals. The army can be mobilized at any time to fight those who do not heed his call. All the soldiers lined up neatly, united, and gathered under his leadership."
		   },
		   {
			"id": 3177,
			"surah": 27,
			"ayat": 18,
			"tafsir": "This verse explains that at one time Solomon was walking with his army in an area, which according to Qatadah, was an area in the valley of Sham. In such circumstances, suddenly Solomon heard the voice of the king of the ants ordering his people to immediately enter their respective burrows, so as not to be trampled by Solomon and his army. Solomon and his army could step on them without realizing it, because ants are very small creatures, so Solomon and his army did not see them. This verse shows the existence of communication between ants and social life under the leadership of the king. Research reveals that in order to carry out this highly organized social life, ants have sophisticated communication skills. On the ant's head is a set of sensory organs that can recognize both chemical and visual signals. Its brain consists of about half a million nerve nodes, has eyes that function properly, and antennae that function as noses for kissing or fingertips for touching. The protrusions located under the mouth function as taste buds. While the hairs on his body react to touch. Although many organs are owned by ants for communication, the main communication is chemical communication. They communicate using pheromones, a chemical compound like a hormone that gives off an odor and is produced by one of the glands in the ant's body. It is by using this hormone that the ants communicate. When an ant emits a pheromone, other ants will receive it by smelling it or touching it, and react to it."
		   },
		   {
			"id": 3178,
			"surah": 27,
			"ayat": 19,
			"tafsir": "Hearing the words of the king of the ants that Solomon and his soldiers did not intend to destroy them and do evil, Solomon smiled. The king of the ants also said that if any of the ants were stepped on by Solomon and his soldiers, then it was not done on purpose, but because Solomon and his soldiers did not see them, because their bodies were very small. For the grace and gift that Allah has given to Solomon in the form of the ability to understand the conversation of the ant king, and there is a kind of good opinion from the king of the ants towards Solomon and his army, Solomon prays to Allah, \"O my Lord, the Giver of Mercy, make me one of those who people who are constantly grateful for Your blessings that You have bestowed upon me and on my parents. Make me as a servant of Yours who always does good deeds that You are pleased with, and make me a person who wishes to do those good deeds. If I die, enter me into heaven with the righteous people whom You put into it with Your grace.\" From the prayer of Prophet Sulaiman it was understood that what Solomon asked God for was eternal happiness in the hereafter. Even though Allah has bestowed various worldly pleasures and powers on him, he does not forget himself because of it. He believes that worldly pleasures are temporary and impermanent pleasures. Prophet Sulayman's attitude when receiving God's grace is an attitude that must be emulated and made a role model by every Muslim. Pray and give thanks to Allah every time you get His favor, and don't act in denial of His favor."
		   },
		   {
			"id": 3179,
			"surah": 27,
			"ayat": 20,
			"tafsir": "This verse explains that one day Prophet Sulayman inspected the line of his soldiers, including the hud-hud bird, but he did not see it. In an angry and surprised tone he said, \"Why didn't I see the hud-hud bird! Did I not see it or did the hud-hud bird itself leave without asking my permission first?\" It was an act that had never happened before. From this verse, the following matters are understood: 1. Prophet Sulayman had an army, and among them there was a type of bird called the hud-hud bird. The hud-hud bird is a type of insect-eating bird, a type of woodpecker. It has a long beak, a crest on its head, a long tail, and beautiful, colorful feathers. It lives by making nests or holes in dead and weathered wooden trees. 2. Prophet Sulaiman always checked his soldiers. Therefore, he knows his soldiers who were present and who were not present during the interrogation. 3. Every soldier traveling or doing any work should get permission from him first. If anyone violates this provision, will receive punishment from Sulaiman. 4. Solomon's soldiers obediently followed all his orders and no one ever denied them. Therefore, Sulaiman was surprised and amazed at the departure of the hud-hud without saying goodbye. Never before had anything like this happened. He then threatened the hud-hud bird with severe punishment if it later returned without giving acceptable reasons."
		   },
		   {
			"id": 3180,
			"surah": 27,
			"ayat": 21,
			"tafsir": "This verse explains the threat of Prophet Sulaiman to the hud-hud bird that left without saying goodbye. He said, \"If the hud-hud bird returns later, without giving strong reasons for its departure without asking for permission, then I will torture it by plucking its feathers, so that it cannot fly again or I will slaughter it. One of the two punishments I will do that to him, so that it can be a lesson for others who act like the hud-hud bird.\" From this verse it is understood that if the hud-hud bird can state the reasons for its departure without saying goodbye and the truth of those reasons can be ascertained, then Solomon will not carry out the punishment that has been threatened."
		   },
		   {
			"id": 3181,
			"surah": 27,
			"ayat": 22,
			"tafsir": "Not long after the threat of punishment for the hud-hud bird was issued, the bird came. Sulaiman then asked the reasons for the departure of the hoopoe without saying goodbye. The hud-hud bird explained the reason for his departure by saying that he had gone and flown across a distant area and had arrived at a land called Saba'. He knew things about the land that Solomon himself did not know. The news he brought was important news and the truth could be trusted. The hud-hud bird conveyed this important news to Prophet Sulaiman in such a way, with words that were sweet and respectful, pleasing to the ear, accompanied by strong reasons too. Thus, Solomon's anger towards the hud-hud bird gradually subsided, finally completely disappearing. Even with that information, Prophet Sulayman had obtained something valuable, so that the punishment he had threatened was not carried out. The ability of the hud-hud bird to travel that far and convey important news to Prophet Sulaiman is a manifestation of Allah's power and inspiration that He instilled in the instinct of the hud-hud bird. He was able to go and fly across the area that lies between the present lands of Palestine and Yemen, a considerable distance, across a very hot desert area. He knew and understood the state of the land of Saba' which Prophet Sulaiman also had to know who served as the head of state and at the same time the apostle of Allah. He was also able to deliver the news and provide good understanding, so that Prophet Sulayman immediately responded to the news that the hud-hud bird brought. Prophet Sulayman is a prophet and apostle. He was also a wise king, who had great power and abundant wealth. He has a lot of knowledge in addition to other knowledge that only God might have given him. While the hud-hud bird is just a bird that has no meaning at all, when compared to what Prophet Sulaiman had. Even so, the hud-hud bird has knowledge that was not yet known by Prophet Sulaiman. This knowledge was very much needed by Prophet Sulaiman in carrying out his duties as a king, especially in carrying out his duties as a prophet and apostle of Allah. In dealing with the hud-hud bird as a source and carrier of important news, Prophet Sulaiman was able to behave naturally, as a servant of Allah. The story of Prophet Sulaiman and the hud-hud bird should be a parable and parable for humans, especially for people who have claimed to have faith in Allah. A person should not feel proud and arrogant because of the knowledge, power and wealth that Allah has given him. All that is given, no matter how much he thinks, but what is received is very little when compared with the knowledge, power and wealth of Allah. Therefore, never underestimate, lightly, and despise something or someone. Maybe Allah has given to someone who is considered despicable and lowly, what is not owned by other people, which may be needed for an interest, as He has bestowed on the hud-hud bird. Allah is Most Gracious, Most Merciful and glorifies human beings. Therefore, humans should live in compassion, help each other, and respect each other. Imitate the attitude of Prophet Sulaiman to the hud-hud bird, who always loved and respected it, even though it was only a bird."
		   },
		   {
			"id": 3182,
			"surah": 27,
			"ayat": 23,
			"tafsir": "This verse explains that the hud-hud bird conveyed to Prophet Sulaiman the various knowledge and experiences he had acquired during his journey to the land of Saba'. A big and rich country and ruled by a beautiful queen and has a big and beautiful throne. In this verse it is understood that there are three things concerning the land of Saba' which were conveyed by the hud-hud bird to Prophet Sulaiman: 1. The land of Saba' was ruled by a beautiful queen, who ruled her land kindly and wisely. 2. The queen ruled firmly and wisely because she was equipped with everything needed in government, such as wealth and wealth, strong soldiers, and so on. 3. The Queen has a beautiful and large throne, which shows the greatness and influence of her power, both to the people and to the countries around her. Historically, Saba' was the capital of the kingdom of Saba' or Sabaiyah. The kingdom of Saba' or Sabaiyah was founded by Saba' bin Yasyjub bin Ya'rub bin Qahthan who became the forerunner of the Yemeni people around 955 BC in Yemen. The name of the city of Saba' is taken from the name of Saba' bin Yasyjub, as well as the name of the kingdom of Saba' or Sabaiyah. The Sabaean people are famous in history as people engaged in commerce. Sea and land trade routes meet in Yemen. These trade goods were brought from the Far East (Indonesia, Malaysia, India and China) to Europe via Persia, Yemen, Syria and Egypt. Thus, the Yemen region is a trade chain that connects the eastern region with the western region. The Sabaeans played a big role in launching this trade. The country of Yemen had a sea fleet and land caravans to transport the trade, while the city of Ma'rib at that time was an international city. The goods that are traded are agricultural products and goods from the Far East, coupled with the abundant agricultural products of Yemen, because Yemen is indeed a very prosperous area. On their return from Europe, Egypt and Syria, these merchants brought textiles to the East. The prosperity of Yemen was due to the water dams built by the Sabaiyah kings. Among them is a giant dam in the city of Ma'rib which is known as the Ma'rib dam. With the existence of this Ma'rib dam, the Sabaeans were able to carry out regular irrigation, so that the Yemeni area became fertile, and produced abundant results. The Qur'an itself mentions that the fertility of Yemen is one of the signs of Allah's power. As for the woman or queen who rules over the Sabaean people mentioned in the verse, according to Arabic culture it is called Balqis. His reign was during the reign of Prophet Sulayman. She is the daughter of Syurahil who also comes from the descendants of Ya'rub bin Qahthan. Even though Balqis is a woman, she is able to bring the people of Saba' to prosperity and peace. He is someone who is loved by his people. In history known as Malikatus Saba '(Ratu Saba', The Queen of Sheba). The glory of the kingdom of Saba' lasted long enough. Then they turned away from God's call and belied the apostles and were not grateful for His blessings, even drowning in all kinds of pleasures and luxuries of life. Therefore, God destroyed them with a huge flood due to the collapse of the Ma'rib Saddu (Dam) which was the source of prosperity for their country. With the collapse of the Ma'rib Dam and the occurrence of the great flood, the city of Ma'rib was destroyed, and the kingdom of Sabaiyah collapsed. (See surahh Saba'\/34: 15-17)."
		   },
		   {
			"id": 3183,
			"surah": 27,
			"ayat": 24,
			"tafsir": "The hud-hud bird explained to Prophet Sulaiman about the religion adopted by the Sabaean people. In conveying the news, it appears that the hoopoe bird has compared the religion and actions of the people of the land of Saba' with the beliefs and religion they believe to be the true religion. Hud-hud said that he found the princess and her people worshiping the sun as a god, and doing immoral works that were against the true religion. They do that because Satan has succeeded in deceiving them. Satan has made their thoughts and views of bad deeds that God has forbidden as good and beautiful things. They no longer follow the teachings and religion that the apostles brought before. They no longer prostrate to Allah, but to the sun. Therefore, they didn't get a clue."
		   },
		   {
			"id": 3184,
			"surah": 27,
			"ayat": 25,
			"tafsir": "Satan has been able to turn them away from their belief in the power and oneness of Allah, so that they do not worship Him. They no longer believe that Allah knows all that is hidden in the heavens and on earth, He is the God who created all things, such as plants and metal objects hidden in the earth and in the sea."
		   },
		   {
			"id": 3185,
			"surah": 27,
			"ayat": 26,
			"tafsir": "Furthermore hud-hud said that it is actually Allah who has the right to be worshiped. He is the one who has the 'great Throne, has absolute power, and nothing can overcome it. Prophet Sulaiman was surprised and amazed to hear the description and response of the hud-hud bird. Why was the bird able to find out in such a short time about the state of the land of Saba', its governance procedures, wealth and influence, and also know the religion they profess. Hud-hud birds also know and believe in the power and oneness of Allah, acknowledging that the only God who has the right to be worshiped is Allah, nothing else. He also knows that worshiping the sun is a false belief, and knows the good and bad forms of action according to religion. From this verse it is understood that based on his knowledge and experience in the land of Saba', it was as if the hud-hud bird suggested to Prophet Sulaiman that he immediately call on Queen Balqis and her people to believe in Allah and follow Prophet Sulaiman's call."
		   },
		   {
			"id": 3186,
			"surah": 27,
			"ayat": 27,
			"tafsir": "Hearing the clear and convincing description of the hud-hud bird, Prophet Sulaiman suspended the punishment that had been threatened to the bird. Prophet Sulaiman then said, \"O hud-hud birds, we have heard all your statements and paid attention to them. However, we will still test you, is the information you have provided true or a lie?\""
		   },
		   {
			"id": 3187,
			"surah": 27,
			"ayat": 28,
			"tafsir": "To test the truth of the hud-hud bird, Prophet Sulaiman ordered him to deliver a letter to Queen Balqis. He was also ordered to pay attention to how Queen Balqis' reaction and attitude read the letter she was carrying. Hud-hud also brought the letter of Prophet Sulaiman. After he threw the letter to Queen Balqis, he hid and paid attention to Queen Balqis' attitude towards the contents of the letter, according to what Sulaiman had ordered."
		   },
		   {
			"id": 3188,
			"surah": 27,
			"ayat": 29,
			"tafsir": "After Queen Balqis read the letter of Prophet Sulaiman which was conveyed by the hud-hud bird, he gathered the leaders of his people and held a trial. During the trial, Queen Balqis conveyed the contents of the letter and asked those present for consideration, \"O leader of my people, I have received a noble letter and it means it was sent by someone noble too.\" In this verse it is explained that Queen Balqis negotiated and deliberated over the contents of Sulaiman's letter with the leaders of her people. Even though it was Ratu Balqis and the leaders of her people who did not have faith in the deliberations, the actions of Ratu Balqis were called by Allah in His word. This shows that the principle of deliberation is a principle taught by Allah to humans in dealing with the problems they experience in their lives. Therefore, whoever does it, then that action is an act that is praised by Allah. In this verse it is stated that Sulaiman's letter which was sent to Queen Balqis is called kitabun karim (noble letter). This shows that the letter of Prophet Sulayman is a noble and valuable letter because: 1. The letter is written in good language and uses a stamp as a sign of official letter. 2. The letter comes from Solomon, as a king as well as a prophet. 3. The surah begins with Bismillahir Rahmanir Rahim. According to a history, Sulaiman's letter is the first letter that begins with basmalah. How to make letters like what Prophet Sulaiman did is a good way to be emulated by every Muslim when making letters. Several things happened thanks to the specialness of Sulaiman's letter, including: 1. The letter was delivered by the hud-hud bird in a short time to the Queen of Saba'. 2. The ability of the hud-hud bird to receive messages and capture conversations in the Queen of Saba' negotiations with her superiors. 3. This letter can also be understood and understood by residents of the land of Saba'. 4. The delegates of the leaders of the Sabaean people can express their opinion freely. Nothing prevented them from expressing their own opinion. Thus, the outcome of the negotiations is a result that is in accordance with the thoughts and opinions of the people of the country of Saba'."
		   },
		   {
			"id": 3189,
			"surah": 27,
			"ayat": 30,
			"tafsir": "After Queen Balqis read the letter of Prophet Sulaiman which was conveyed by the hud-hud bird, he gathered the leaders of his people and held a trial. During the trial, Queen Balqis conveyed the contents of the letter and asked those present for consideration, \"O leader of my people, I have received a noble letter and it means it was sent by someone noble too.\" In this verse it is explained that Queen Balqis negotiated and deliberated over the contents of Sulaiman's letter with the leaders of her people. Even though it was Ratu Balqis and the leaders of her people who did not have faith in the deliberations, the actions of Ratu Balqis were called by Allah in His word. This shows that the principle of deliberation is a principle taught by Allah to humans in dealing with the problems they experience in their lives. Therefore, whoever does it, then that action is an act that is praised by Allah. In this verse it is stated that Sulaiman's letter which was sent to Queen Balqis is called kitabun karim (noble letter). This shows that the letter of Prophet Sulayman is a noble and valuable letter because: 1. The letter is written in good language and uses a stamp as a sign of official letter. 2. The letter comes from Solomon, as a king as well as a prophet. 3. The surah begins with Bismillahir Rahmanir Rahim. According to a history, Sulaiman's letter is the first letter that begins with basmalah. How to make letters like what Prophet Sulaiman did is a good way to be emulated by every Muslim when making letters. Several things happened thanks to the specialness of Sulaiman's letter, including: 1. The letter was delivered by the hud-hud bird in a short time to the Queen of Saba'. 2. The ability of the hud-hud bird to receive messages and capture conversations in the Queen of Saba' negotiations with her superiors. 3. This letter can also be understood and understood by residents of the land of Saba'. 4. The delegates of the leaders of the Sabaean people can express their opinion freely. Nothing prevented them from expressing their own opinion. Thus, the outcome of the negotiations is a result that is in accordance with the thoughts and opinions of the people of the country of Saba'."
		   },
		   {
			"id": 3190,
			"surah": 27,
			"ayat": 31,
			"tafsir": "This verse explains the contents of Prophet Sulaiman's letter, namely that the Queen of Saba' and her people would not be arrogant and arrogant. Prophet Sulayman hoped that they would come to him in a state of submission and surrender to Allah whose Asma had been used as the opening word in his letter. Let them never oppose Allah's religion. From Solomon's letter it was understood that that was all Solomon asked, namely that they immediately believe in Allah, and he did not demand anything else."
		   },
		   {
			"id": 3191,
			"surah": 27,
			"ayat": 32,
			"tafsir": "This verse describes the implementation of the principles of deliberation in the land of Saba'. Even though Queen Balqis already has her own opinion in responding to the contents of Sulaiman's letter, she still discusses it with her superiors. He said to them, \"O wise leaders of my people, express your opinion and your response to the contents of Solomon's letter that he has conveyed to me. I will not carry out a decision, except what we have mutually agreed upon.\""
		   },
		   {
			"id": 3192,
			"surah": 27,
			"ayat": 33,
			"tafsir": "Hearing Queen Balqis' words, some of the royal officials of Saba' felt offended by the contents of Sulaiman's letter. They felt insulted by the contents of the letter, as if they were ordered by Solomon to submit and obey him. Even though they are people who are respected, knowledgeable, and respected by neighboring countries. They said, \"O our queen, we who are here, are all distinguished people, have knowledge and expertise in warfare, and have adequate equipment. However, we leave all decisions to you. We are ready to do everything that is required of us.\" you command. Think carefully about the decision you will make.\""
		   },
		   {
			"id": 3193,
			"surah": 27,
			"ayat": 34,
			"tafsir": "This verse explains the wisdom of Queen Balqis in dealing with the attitude of her people towards the contents of Sulaiman's letter. He was not affected by the arrogant attitude and felt himself strong as reflected in the words of his royal officials. Queen Balqis said, \"O my people, this is a letter from a king. If we oppose and fight against him, we may win and we may also lose. If we lose, the king and his army will destroy our country, destroy and destroy all that has we have built so far. In general, the attitude and character of kings towards their enemies is the same, they like to oppress and kill cruelly the enemies they defeat, and destroy cities and insult the dignitaries of the countries they have conquered.\" Queen Balqis continued her conversation, \"To avoid all these unwanted events, I have thoughts that if carried out will benefit us all. The trick is that we try to soften Solomon's heart by sending gifts to him. The gifts will be delivered by people who are knowledgeable. In this way, we can know for sure their condition through the intercession of our messengers. After that, we will determine together the proper course of action that we will carry out in dealing with Solomon.\" The dignitaries of the land of Saba' agreed with the opinion put forward by their queen."
		   },
		   {
			"id": 3194,
			"surah": 27,
			"ayat": 35,
			"tafsir": "This verse explains the wisdom of Queen Balqis in dealing with the attitude of her people towards the contents of Sulaiman's letter. He was not affected by the arrogant attitude and felt himself strong as reflected in the words of his royal officials. Queen Balqis said, \"O my people, this is a letter from a king. If we oppose and fight against him, we may win and we may also lose. If we lose, the king and his army will destroy our country, destroy and destroy all that has we have built so far. In general, the attitude and character of kings towards their enemies is the same, they like to oppress and kill cruelly the enemies they defeat, and destroy cities and insult the dignitaries of the countries they have conquered.\" Queen Balqis continued her conversation, \"To avoid all these unwanted events, I have thoughts that if carried out will benefit us all. The trick is that we try to soften Solomon's heart by sending gifts to him. The gifts will be delivered by people who are knowledgeable. In this way, we can know for sure their condition through the intercession of our messengers. After that, we will determine together the proper course of action that we will carry out in dealing with Solomon.\" The dignitaries of the land of Saba' agreed with the opinion put forward by their queen."
		   },
		   {
			"id": 3195,
			"surah": 27,
			"ayat": 36,
			"tafsir": "So the entourage of Queen Balqis' envoys departed to meet Sulaiman bringing priceless gifts. After the envoys faced Solomon, he said to them, \"O envoys of Queen Balqis, do you intend to give your wealth to me. I will not seek and ask for worldly pleasures and wealth. I only want all of you and your people to follow my religion and worship Allah alone, God Almighty, does not worship the sun, as you do. Allah has bestowed upon me innumerable blessings such as prophetic blessings, knowledge, and great empires. Because of these blessings I can master the jinn, speak with animals, mastering the wind and much more knowledge that Allah has bestowed on me. If I compare the favors that I get with the favors that you get, then the blessings that you get mean nothing to me in the least. Because you do not know the religion of Allah, then you think that many possessions and worldly pleasures can satisfy your heart. B to me the treasure is meaningless and will not satisfy my heart. The pleasure and happiness that I seek is eternal pleasure and happiness, in accordance with what Allah has promised to His pious servants.\" Furthermore, Sulayman stated to Queen Balqis' envoys, \"If you all do not fulfill my call, then return to your people. . We will come with a complete army consisting of humans, jinn and animals that you will not be able to fight against. We will expel everyone who stands in the way of my troops from their land and homeland, and they will be made into despised people, taken as prisoners or made into slaves.\""
		   },
		   {
			"id": 3196,
			"surah": 27,
			"ayat": 37,
			"tafsir": "So the entourage of Queen Balqis' envoys departed to meet Sulaiman bringing priceless gifts. After the envoys faced Solomon, he said to them, \"O envoys of Queen Balqis, do you intend to give your wealth to me. I will not seek and ask for worldly pleasures and wealth. I only want all of you and your people to follow my religion and worship Allah alone, God Almighty, does not worship the sun, as you do. Allah has bestowed upon me innumerable blessings such as prophetic blessings, knowledge, and great empires. Because of these blessings I can master the jinn, speak with animals, mastering the wind and much more knowledge that Allah has bestowed on me. If I compare the favors that I get with the favors that you get, then the blessings that you get mean nothing to me in the least. Because you do not know the religion of Allah, then you think that many possessions and worldly pleasures can satisfy your heart. B to me the treasure is meaningless and will not satisfy my heart. The pleasure and happiness that I seek is eternal pleasure and happiness, in accordance with what Allah has promised to His pious servants.\" Furthermore, Sulayman stated to Queen Balqis' envoys, \"If you all do not fulfill my call, then return to your people. . We will come with a complete army consisting of humans, jinn and animals that you will not be able to fight against. We will expel everyone who stands in the way of my troops from their land and homeland, and they will be made into despised people, taken as prisoners or made into slaves.\""
		   },
		   {
			"id": 3197,
			"surah": 27,
			"ayat": 38,
			"tafsir": "After the envoys returned to their country, they conveyed to Queen Balqis what Prophet Sulaiman meant by his letter. Solomon asked them to accept his call to believe in Allah. They also conveyed the condition of the people led by Solomon, as well as the state of the army and its wealth. Therefore, Queen Balqis decided to go alone to Jerusalem to meet Solomon with a more valuable gift. After Solomon learned that Queen Balqis was going to visit his country, he built a large and magnificent palace whose floors were made of glass. By making such a palace, he wanted to show Queen Balqis something he had never seen. To welcome the arrival of Queen Balqis, Sulaiman wanted to show him the signs of Allah's power and greatness, and the power that He had bestowed, so that Queen Balqis and her people would believe in Allah. He intends to bring Queen Balqis's throne in his country to Jerusalem in a short time and will be used as Queen Balqis's seat in the palace she just made at the time of Queen Saba''s arrival. Sulaiman said that he meant to his princes, \"O my princes, which of you can bring the throne of Queen Balqis in his country to this place, before their entourage got here?\""
		   },
		   {
			"id": 3198,
			"surah": 27,
			"ayat": 39,
			"tafsir": "Hearing Sulaiman's request, the clever Ifrit (including the genie group) replied, \"I will come to you with the throne before you get up from your seat and I can really do it and my ability can be proven.\" What is meant by \"before you get up from your seat\" is before Solomon leaves that place. He usually left the place before noon."
		   },
		   {
			"id": 3199,
			"surah": 27,
			"ayat": 40,
			"tafsir": "Sulaiman was not satisfied with Ifrit's ability. He wanted the throne to arrive in even less time. Then he asked those present before him to carry it out. So someone who has acquired knowledge from the Bible replied, \"I will bring the throne to you in a blink of an eye.\" What the man said was proven, and the throne of Queen Balqis was before Solomon. There is an opinion that says that person is al-Khidhir. Some say he is an angel, and some say he is Asif bin Barqiya. Seeing the events that happened in just a blink of an eye, Prophet Sulaiman said, \"This is one of the gifts that God has bestowed on me. With that gift I was tested, whether I am one of those who are grateful for God's grace or one of those who deny it.\" From the attitude of Prophet Sulayman, the strength of faith and vigilance can be seen. He is not easily deceived by any of the gifts bestowed upon him, for all these gifts, whether they be happiness or sorrow, are all tests by God on His servants. Solomon said this because he firmly believed that whoever is grateful for God's blessings, then the benefits of being grateful for God's blessings will return to himself, because God will add more to those blessings. Conversely, those who deny Allah's favors, the sins of their denial will also return to them. He will be punished by Allah because of that disobedience. Furthermore Solomon said, \"That God who is worshiped is God Almighty, does not need anything from His creatures, but it is the creatures that need Him. The God who is worshiped is God who is Most Gracious to His servants when repaying their kindness with multiple returns.\" Prophet Sulaiman's attitude in receiving God's favor is an attitude that every Muslim must set as an example. Such an attitude will eliminate the arrogant and arrogant nature that is in a person. He will also relieve feelings of hopelessness and low self-esteem for people who are in a state of misery and suffering, because he knows that all of these are trials and tests from God to His servants."
		   },
		   {
			"id": 3200,
			"surah": 27,
			"ayat": 41,
			"tafsir": "Sulaiman ordered the leaders of his people to change the shape of the Balqis throne that had arrived before him. He wanted to see if Queen Balqis knew or not that what she was sitting on was her throne. In this way, it is hoped that Ratu Balqis will become more convinced that Solomon is a messenger of God. He did not expect anything other than the faith of Queen Balqis and her people."
		   },
		   {
			"id": 3201,
			"surah": 27,
			"ayat": 42,
			"tafsir": "After Queen Balqis came, Solomon asked her, \"Is this what your throne looks like?\" Balqis replied, \"That's right, this throne is very similar to mine.\" According to Mujahid, Queen Balqis knew that the throne was hers, because there were signs indicating that the throne was hers. However, he wondered why the throne was in Solomon's palace. Seeing this fact and connected with his knowledge of the hud-hud bird, Balqis said, \"Actually, we were given, prior to the occurrence of this miracle, the knowledge that the God who has the right to be worshiped is God Almighty. He is Almighty, so is the case with the hud bird. -hud, as an extraordinary bird that by the power of God has been able to connect our country with yours and also by paying attention to the news that we receive from our messengers. All of this shows that you, O Sulayman, are truly an apostle of Allah who sent to us to convey His religion.\" Balqis then said, \"We and our people declare our faith in you. We will leave our religion that we have adhered to. You don't need to tell us another miracle, because we already believe.\""
		   },
		   {
			"id": 3202,
			"surah": 27,
			"ayat": 43,
			"tafsir": "This verse explains that Queen Balqis did not want to accept Islam before because the leaders of her people who were infidels worshiped the sun. He was worried that his people would ostracize him. After dealing with Sulaiman, only then did he dare to declare his Islam and dare to express his heart."
		   },
		   {
			"id": 3203,
			"surah": 27,
			"ayat": 44,
			"tafsir": "According to one history, after Prophet Sulaiman learned from Allah that Queen Balqis was coming to his country, he ordered his people to build a large and beautiful palace. The floor is made of shiny glass that easily reflects light. Under the glass floor, there is a pond filled with all kinds of fish, and the water in the pool seems to flow like a river. At the arrival of Queen Balqis, Prophet Sulaiman received him in the new palace and invited him to enter. Queen Balqis was surprised and surprised when she entered Solomon's palace. According to his vision, there is a river that stretches that he must cross to meet Solomon. Therefore, he uncovered his cloth, so that the two calves were visible. Seeing this, Solomon said, \"What you see is not water or a river, but a glass floor under which there is flowing water.\" Hearing Solomon's words, Queen Balqis immediately lowered her cloth and admitted to herself that Solomon's palace was bigger and better than her palace. Then Prophet Sulaiman invited Balqis to embrace Islam, and explained the heresy of worshiping the sun. Solomon's call was well received by Balqis. He regretted his disbelief so far because by doing so it meant that he had wronged himself. Balqis also stated that he was willing to surrender with Solomon to Allah, the Lord of all the worlds. To Him he worshiped sincerely."
		   },
		   {
			"id": 3204,
			"surah": 27,
			"ayat": 45,
			"tafsir": "This verse explains that Allah has sent Prophet Saleh to the Samud people who live in al-Hijr, a rocky mountain area located between Wadil Qura and Syam. Nabi Saleh is still a descendant of Samud, so that means he was sent to his own people. Prophet Saleh called on his people who worshiped something beside Allah or partnered with Him, to worship only Allah, God Almighty. In response to Saleh's call, his people were divided into two: 1. A small number of them fulfilled his call by leaving idol worship and only worshiping God Almighty. 2. Most of them remained in denial and even threatened and opposed Prophet Saleh. Between the two groups above, there was debate and hostility. Each group accuses that the religion adhered to by its opponent is a false religion. Even those who claim to be strong, and have more followers, increase their tyranny, and oppose Prophet Saleh by killing camels that have been forbidden to be killed. They also asked for their punishment to be hastened, if he was truly a messenger sent by Allah. Allah said: Then they slaughtered the she-camel, and acted arrogantly against the command of their Lord. They said, \"O Saleh! Prove your threat to us, if it is true that you are one of the apostles.\" (al-A'raf\/7: 77)"
		   },
		   {
			"id": 3205,
			"surah": 27,
			"ayat": 46,
			"tafsir": "Seeing the attitudes and challenges of his people, Prophet Saleh told them, \"O my relatives, why do you all want doom to come upon you hastily, before you believe and do good. Why don't you all immediately believe and remain in disbelief? Even though your faith can bring rewards and eternal happiness for you. Whereas disbelief will result in sin and eternal punishment in the hereafter.\" Furthermore, Prophet Saleh called on his people to immediately ask forgiveness from Allah and repent to Him. Thus, their sins will be forgiven by Allah and the grace that He has given is added to with even greater mercy."
		   },
		   {
			"id": 3206,
			"surah": 27,
			"ayat": 47,
			"tafsir": "The Samud people who denied it answered Prophet Saleh's call by saying that they felt bad luck with Prophet Saleh's call and those who believed in him. Since Prophet Saleh called on them to leave their gods and only worship God Almighty, they have been beset by various calamities, such as the lack of rain which caused drought and so on. They believe that disasters will continue to befall them due to the anger of their gods due to the actions of Prophet Saleh. The signs of bad luck and the coming of disaster appear in every time they throw and shock the bird, which gives a sign of their fortune-telling, the bird shows signs that are not good for them. They answer this because of their ignorance and superstitious belief etc. As primitive people who believe in supernatural powers that exist in objects in this nature, in addition to the supernatural powers that exist in God himself, so do the Samud. One of the beliefs and customs of the Samud people is that when they go on a long journey they encounter birds from right to left, they are happy. This indicated that they may continue their journey. Conversely, if the bird flies and runs from the left to the right, this indicates that there is a disaster if they continue to travel far. Prophet Saleh answered the statement of his people by saying that in fact whatever befalls them, whether good or bad, happy or miserable, is Allah's provision and that is their qadha and qadar. No one can change the qadha and qadar of Allah. If He wills, He will provide sustenance. If He had willed, He would not have given them any sustenance. He and his followers have no power to bring bad luck or luck to them. Then Prophet Saleh explained that this misfortune was a test from God to them, whether they wanted to follow his call and no longer do the forbidden things they used to do, or didn't want to follow him."
		   },
		   {
			"id": 3207,
			"surah": 27,
			"ayat": 48,
			"tafsir": "This verse explains the reasons for a lot of destruction in their country because in the city of Hijr there were nine people who liked to cause chaos in society. Those nine people are the children of the nobles who rule in that country. They can do all good or bad deeds freely and no one can stop them. The evil deeds that they do are always protected and defended by their parents who rule in that country. Thus, the nine people become a source of bad deeds and anger. There are several traditions that explain the names of the nine people, as explained by al-Gaznawi, Ibn Ishaq, Zamakhsyari, al-Mawardi, and so on. Each of them put forward different names. However, what is important from all of this is that the damage and sin committed by the nine criminals is known and approved by the rulers of the land of Samud. Because they come from the ruling nobility in the country, they have enormous influence on the Samud people."
		   },
		   {
			"id": 3208,
			"surah": 27,
			"ayat": 49,
			"tafsir": "This verse explains the act of treason that was being negotiated by the nine men, after they committed the forbidden act by killing the camel that Prophet Saleh had forbidden them to kill. They received a threat from Nabi Saleh that they would be destroyed by Allah within three days after the camel was killed. Some of them said, \"Let us all solemnly swear that we will kill Prophet Saleh and his followers one night. Then we will tell the family who was killed the next day, that we know nothing about the incident. , and it is impossible for us to commit acts of maltreatment against our own family. We also tell him that we are all righteous people.\""
		   },
		   {
			"id": 3209,
			"surah": 27,
			"ayat": 50,
			"tafsir": "Allah explained that the plan for treason and deceit made by the Samud people was to kill Nabi Saleh and those who believed along with him. However, they forget that Allah has a plan and will that they cannot hinder in the slightest, according to His sunnah, namely He will inflict doom and torment on those who deny the call of the messengers He sent. In this world they will be struck by a calamity that comes without them knowing it, while in the hereafter they will meet a painful doom."
		   },
		   {
			"id": 3210,
			"surah": 27,
			"ayat": 51,
			"tafsir": "This verse instructs Muslims to think about the story of Prophet Saleh and his people. On the people of the Prophet Saleh, Allah inflicted punishment that destroyed them to the roots ('azb isti'sal). The punishment was the result of their disobedience to Prophet Saleh, and their deceit to destroy this prophet and those who believed along with him. They were destroyed by Allah with a powerful lightning strike that was beyond measure. In accordance with the sunatullah, disaster and doom will also befall the polytheists of Mecca, if they persist in disbelief and oppose the call of the Prophet Muhammad. There is a history explaining that the Prophet Saleh built a mosque in one of the valleys in al-Hijr. He used to pray at the mosque. After he conveyed Allah's threat, he and his family and those who believed with him went to the mosque. Because of his departure, his people negotiated and decided to kill Nabi Saleh before the third day of the promised day. So some of his people went to the valley of the mosque to carry out the plan. However, on their way they were hit by a large rock before they could carry out their purpose. The rest of his people were destroyed by Allah with a bolt of lightning. Prophet Saleh and his followers escaped and survived the doom."
		   },
		   {
			"id": 3211,
			"surah": 27,
			"ayat": 52,
			"tafsir": "This verse explains the consequences experienced by the Samud people and their country. Due to the powerful lightning strike, they died in their homes. No one was able to save themselves and take care of their carcasses, because they were all dead. The carcasses rotted and melted into the ground. Travelers can witness their former home and country, as documentation of the truth of the Al-Qur'an story about the Samud people who were destroyed by Allah due to their denial and disobedience to Prophet Saleh who called them to Allah's religion. In the story explained by Allah in these verses, which was conveyed by the Prophet Muhammad to his people, there really is teaching and compassion for humans. This verse reminds us of the sunatullah which must apply to people who deny Allah's commandments and who always do His prohibitions, including the Meccan polytheists."
		   },
		   {
			"id": 3212,
			"surah": 27,
			"ayat": 53,
			"tafsir": "This verse explains that Allah has saved Prophet Saleh and those who believe with him from that great calamity. God saved them because they did not want to do deeds that angered God which resulted in His torment overtook them. They protect themselves from Allah's wrath by doing all His commands and staying away from His prohibitions. This verse indicates to the Prophet Muhammad and those who believe that the polytheists of Mecca will receive punishment and calamity as received by the ancient peoples if they still do not believe. Allah will save Muhammad peace be upon him and those who believe, just as He saved Prophet Saleh and his people. The polytheists of Mecca who remain in their polytheism will be destroyed by Allah. After the destruction of his people, Prophet Saleh and those who believed went to a place called Ramallah in Palestine, and settled in that country. Until now there is still the grave of Prophet Saleh near the city of Ramallah. This grave is also a documentation for the events of Prophet Saleh and his people."
		   },
		   {
			"id": 3213,
			"surah": 27,
			"ayat": 54,
			"tafsir": "This verse explains the moral depravity of Lut's people. Therefore, Lut warned them loudly, so that they stop what they are doing. The actions of Lut's people are: 1. They commit homosexual acts, even though they know that these actions are forbidden. 2. They do homosexual acts in public, at various meetings, as if they are suggesting that other people do it too. 3. When they cannot do the deed to someone voluntarily, they force it. Therefore, if there are guests who stop over in their country, then they try to make the guests want to follow their wishes. If the guests were reluctant to do so, then they would force it"
		   },
		   {
			"id": 3214,
			"surah": 27,
			"ayat": 55,
			"tafsir": "This verse explains that the actions and deeds of Lut's people were contrary to God's purpose in creating humans consisting of men and women. With the existence of women and men, humans will be able to form families and establish affectionate relationships between family members, such as love relationships between husbands and wives, loving relationships between parents and children and other family members. In this way, life is felt to have meaning. Allah says: And among His signs (greatness) is that He created partners for you of your own kind, so that you are inclined and feel at ease to him, and He created between you feelings of love and compassion. Indeed, in that there are truly signs (of Allah's greatness) for people who think. (ar-Rum\/30: 21). This fact was denied by Lut's people, as if they did not believe in the truth of God's law. Therefore, Lut said to them, \"O my people, actually by doing that, you are people who don't want to know God's purpose for creating humans consisting of men and women. You don't know your position in society, and do not know also the great plan that will befall humans and humanity, if you continue to do such deeds.\""
		   },
		   {
			"id": 3215,
			"surah": 27,
			"ayat": 56,
			"tafsir": "Hearing Lut's statement, his people became angry, and it was as if they did not understand in the slightest what Lut's warning meant. Therefore, they threatened Lut with the words, \"Let's expel Lut and his family from our country, because he forbade us to do the things that we have enjoyed so far.\" They thought that Lut and his family could live safely and securely in their country because of their kindness and compassion. They thought that if they no longer gave Lut and his family mercy and compassion, he would certainly become miserable. This is what they meant by the order to expel Lut. They scoffed by saying that Lut and his followers were clean people, so they didn't want to do the things they did, because they considered them dirty."
		   },
		   {
			"id": 3216,
			"surah": 27,
			"ayat": 57,
			"tafsir": "Because Lut's people continued to deny and do acts that exceeded the limits, Allah destroyed them and saved Lut and those who were with him, except his wife. His wife was one of those who were in denial, so he lived with his people who were in denial. He was also stricken by a terrible disaster. The punishment of Allah that befell the people of Lut was in the form of a rain of stones from hard clay. The condition of those who are being punished is very terrible. Such is the reward received by the disobedient people."
		   },
		   {
			"id": 3217,
			"surah": 27,
			"ayat": 58,
			"tafsir": "Because Lut's people continued to deny and do acts that exceeded the limits, Allah destroyed them and saved Lut and those who were with him, except his wife. His wife was one of those who were in denial, so he lived with his people who were in denial. He was also stricken by a terrible disaster. The punishment of Allah that befell the people of Lut was in the form of a rain of stones from hard clay. The condition of those who are being punished is very terrible. Such is the reward received by the disobedient people."
		   },
		   {
			"id": 3218,
			"surah": 27,
			"ayat": 59,
			"tafsir": "This verse instructs the Prophet Muhammad and his people to pronounce the praises contained in this verse. Praise is al-hamdulillah, all praise is for Allah who has sent His messengers with guidance and religion that He won over all existing religions, even though the disbelievers and polytheists do not like victory That. The religion brought by the Prophets is the true religion. May Allah bestow safety and prosperity on the apostles He sent and upon His servants who truly believe. This verse is in line with the other verses: Glory be to your Lord, God Almighty from the nature of what they say. And good luck to the apostles. And all praise be to Allah, the Lord of all the worlds. (as-saffat\/37: 180-182). This verse is a good teaching, and high morals. Therefore, the scholars recommend that believers end all their actions, such as speaking, writing books, and so on by praising Allah and praying to the apostles. Then this verse tells people to think and compare which is the best between Allah and something they associate with Him. Even though according to the origin of this verse instructs people to compare Allah with idols, the point is that with the information and evidence that has been put forward, if unbelievers were to use their minds, they would surely come to the conclusion that it is Allah who has the right to be worshiped, not idols who are unable to do anything. It is narrated that when the Prophet read this verse, he said: Even Allah is better, more eternal, greater, and more noble than what they partner with. Praise be to Allah, but most of them do not know (Narrated by al-Baihaqi from 'Ali bin al-Husain)"
		   },
		   {
			"id": 3219,
			"surah": 27,
			"ayat": 60,
			"tafsir": "In this verse, Allah raises several questions that arouse their attention to His existence, taking into account the important things around them. The question revolves around who created the heavens, the earth and everything in them, and who sends down rainwater from the sky for humans, then because of rainwater beautiful gardens grow, where humans themselves are never able to grow trees. -the tree. This verse needs attention, especially by those who often travel around as tourists or others, when seeing beautiful sights, such as botanical gardens, zoos, aquariums, various exhibitions of agricultural, textile, and so on. They must see the beauty of nature that is in front of them and around them as a mirror showing all the beauty, majesty and perfection of Allah. By practicing this way, human memory will always be directed to Allah. Thus, when man sees every creature, he will surely remember his Creator. If it becomes a habit, then he will feel pure monotheism, clean from all elements of polytheism. So this question should be followed up with the second question: \"Are there other gods besides Allah?\" Of course the answer is: \"No, because only Allah is the only God who has the right to be worshiped.\" Actually those who worship idols are people who deviate from the truth. For, if they are asked, \"Who sends down rain from the sky and then revives with it the earth that was dead,\" they answer, \"God\" according to His word: And if you ask them, \"Who sends down water from the sky then with that (water) revived the dead earth?\" Surely they will answer, \"Allah.\" (al-'Ankabut\/29: 63) Those idol worshipers actually admit that their idols cannot bring down rainwater which is the cause of the prosperity of the earth, but why do they still worship them. Their answer is simply because they follow the customs of their ancestors, even though it is not in line with the logic of a common sense."
		   },
		   {
			"id": 3220,
			"surah": 27,
			"ayat": 61,
			"tafsir": "In this verse, Allah raises the second question in order to reveal the error of the idol worshippers. It was asked whether those worthy of worship are idols that do no benefit and harm, or is it God who has made the earth a place to live for humans and animals, God who has made the rivers in its crevices to be a source of drinking for humans and animals. animals, as well as for watering plants, God who made mountains to strengthen the earth which contains many benefits with the forests on it and various metals and minerals in it, and God who made a divider between the salty sea water and rivers that carry water bid to its mouth. Fresh river water after reaching the sea does not immediately become salty. When contemplating all these natural events, do you still have the thought that there is a god besides Allah? In fact, they do not know the value of the majesty of Allah, the Creator, so they equate Him with idols that are completely useless and harmful. According to scientific studies, the earth in this verse can be understood as land. In general, land is a place where humans live. The rivers that exist in the mainland are always located in the lowest part of the earth's surface, which is the gap between the mountains and the higher plains. Then, the seas are separated from one another because of the existence of dividing landmass such as peninsulas, islands, or because of the geographical distribution of continents. The distribution and shape of the landmass and islands on this earth are generally considered to have occurred by itself which is part or the result of natural processes, in essence is the will of Allah. This verse describes the condition of the earth that is suitable for human beings to live in. Of course this is closely related to the creation of the heavens and the earth which is so perfect. If there was even the slightest change in the \"trajectory\" of the sun and moon towards the earth, or changed its shape, or changed one of its elements, or changed the speed of rotation on its axis, or changed its rotation around the sun, or changed the rotation of the moon around it, then this earth would definitely not would be sturdy and would not be habitable for a life."
		   },
		   {
			"id": 3221,
			"surah": 27,
			"ayat": 62,
			"tafsir": "In this verse, Allah raises the third question in order to reveal the veil of error of idol worshipers. The two previous questions concern the material field, while the third question concerns spirituality. This question revolves around who grants the request of someone who is in trouble, when he prays to Him. Like a passenger on a ship in the middle of the sea that is being attacked by a violent hurricane, which is almost sinking, then he prays for safety to God. Is it the idol that can save him from the danger of death, or is it God himself? Then who made man a caliph on earth? Is there any god other than Allah who can control and arrange everything on this earth? Very few people want to remember Him."
		   },
		   {
			"id": 3222,
			"surah": 27,
			"ayat": 63,
			"tafsir": "In this verse, Allah raises the fourth question in order to reveal the veil of error of the idol worshipers. This question revolves around who led people on a dark journey on land and sea when they strayed from the right path? Was it not Allah who created the stars in the sky to guide the way, as stated in His word: And it is He who made the stars for you, so that you may make them guides in darkness on land and at sea.(al-An'am\/6 : 97) Can the idols they worship guide them in the darkness on land and in the sea? Of course not. If so, why were they worshipped? Who is it that brings the wind that brings good news to the farmers before it rains which is a great mercy from God? Can the idols do that? Are there other gods besides Allah? Exalted and Most High is Allah from what they associate with Him."
		   },
		   {
			"id": 3223,
			"surah": 27,
			"ayat": 64,
			"tafsir": "In this verse, Allah raises the fifth question in order to show His justice and oneness, namely who created man from the beginning to create the most beautiful form, then turns him off when He wills, then revives him on the Day of Resurrection after becoming bones. ? Who provides sustenance for humans from the heavens and the earth by sending down rainwater from the sky which causes the fertility of the soil to grow plants whose fruits can be eaten by humans and livestock? Are there any other gods besides Allah? After putting forward the five questions above, which should be thought about deeply until they become proof of His power and oneness, Allah ordered the Prophet Muhammad to ask the idol worshipers the reasons and proofs of the truth of their worship, \"Show me proof of your truth if you indeed a believer.\" This is how the Qur'an poses questions whose answers humans must seek for themselves. First, water that descends to the earth so that life arises in the form of beautiful gardens. Second, make the earth a pleasant place to live with rivers, mountains, lakes and seas. Third, humans are made caliphs on earth, namely as rulers and representatives of God to carry out His laws on earth. Humans as the highest creatures created by God travel on land and sea voyages to spread the message of God's laws. The last one is that even though a human being when the time comes to die and be buried in the earth so that his body is destroyed and becomes soil, on the Day of Resurrection he will be resurrected. Such is the power of Allah."
		   },
		   {
			"id": 3224,
			"surah": 27,
			"ayat": 65,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to explain to the polytheists of Mecca that no one knows about the unseen either in the heavens or on the earth except Allah, according to His words: And the keys to all the unseen are in -His; no one knows but Him. (al-An'am\/6: 59) And His word also: Indeed, only with Allah is the knowledge of the Day of Resurrection; and He who sends down the rain, and knows what is in the wombs. And no one can know (with certainty) what he will do tomorrow. And no one can know on which earth he will die. Indeed, Allah is All-Knowing, All-Knowing. (Luqman\/31: 34) The meaning of the unseen here is problems that have to do with conditions and life in the hereafter and problems in the world that are in the human environment and can be felt but beyond the ability of humans to reach them. Narrated from Masruq from 'Aisyah he said: From 'Aisyah ra, he said, \"Whoever thinks that the Prophet Muhammad knew what would happen tomorrow, then he has lied big against Allah, because Allah stated, 'Say, there is no who knows about the unseen heavens and the earth except Allah.\" (Muslim history) In this verse it is mentioned that one of the unseen is that they do not know when they will be resurrected from their graves on the Day of Judgment, because the Doomsday will come suddenly according to the word of Allah: Are they just waiting for the coming of the Doomsday that will come? come to them suddenly and they are not aware of it? (az-Zukhruf\/43: 66)"
		   },
		   {
			"id": 3225,
			"surah": 27,
			"ayat": 66,
			"tafsir": "In this verse, Allah explains their ignorance about the Day of Judgment. There are two opinions in understanding this verse. First, actually their knowledge of the afterlife is not comprehensive. Second, their knowledge of the apocalypse is perfect, but when they don't see it with their eyes in the world, they deny it. Not only do they not believe and do not know when the Doomsday will occur, but they are very doubtful which in the end leads to complete blindness about the Doomsday. Whatever evidence is shown to them about the coming of the Day of Judgment, they still reject it. The question of faith in the coming of the Doomsday really needs to be owned by everyone who wants to educate himself so that he becomes an honest and responsible human being. If he is sure that he will be examined on the Day of Judgment, then he will always curb his lust from every deviation and insolence. The state and all its citizens will not be harmed by all their attitudes and behavior. All of his wisdom leads to security, welfare and happiness together. Religion is an absolute element in nation building."
		   },
		   {
			"id": 3226,
			"surah": 27,
			"ayat": 67,
			"tafsir": "In this verse, Allah explains the disbelief of the disbelievers on the Day of Resurrection from the graves. They said, \"Is it after we die and become dust, and so will our ancestors, be brought back alive from the graves?\" Their question was uttered in a cynical manner which showed as if the event was impossible to happen, as stated in the word of God: And they said, \"When we have become bones and broken things, will we really be resurrected?\" as a new creature? (al-Isra'\/17: 49)"
		   },
		   {
			"id": 3227,
			"surah": 27,
			"ayat": 68,
			"tafsir": "In this verse, Allah explains the reason for the disbelievers who deny the Day of Resurrection with their statement that they have always been given such threats since their ancestors. It is nothing but a fairy tale of the ancients that has absolutely no basis in reality."
		   },
		   {
			"id": 3228,
			"surah": 27,
			"ayat": 69,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to give advice and guidance to those who deny the day of resurrection. The Holy Prophet ordered them to travel the earth and see how the fate of those who sinned among the former peoples who denied Allah and the messengers He sent. How those people have experienced destruction as a result of their disbelief in Allah and the Day of Resurrection. Let these events be a lesson for them. However, they are still in denial, so they will experience destruction, based on sunatullah that still applies."
		   },
		   {
			"id": 3229,
			"surah": 27,
			"ayat": 70,
			"tafsir": "In this verse, the Prophet Muhammad was commanded by Allah to be patient and calm in facing various challenges and ridicule from the disbelievers. The Prophet was forbidden to grieve and give up in facing their deception because Allah would surely provide help so that the religion of Islam would spread to all corners of the earth, even though the disbelievers did not like it, as stated in His word: It was He who sent His Messenger with guidance (Al-Qur'an) and the true religion to be superior to all religions, even though the polytheists do not like it. (at-Taubah\/9: 33)"
		   },
		   {
			"id": 3230,
			"surah": 27,
			"ayat": 71,
			"tafsir": "In this verse it is explained that the Quraysh people not only denied the Day of Resurrection, they even challenged it by ordering the Prophet Muhammad to bring the doom that was threatened to them. The challenge shows their attitude which completely denies the existence of the Day of Resurrection. In fact, they put forward demands on the Prophet Muhammad to hasten the arrival of God's threat with their words, \"When will the doom that you threaten us come if you are people who can be trusted?\""
		   },
		   {
			"id": 3231,
			"surah": 27,
			"ayat": 72,
			"tafsir": "Prophet Muhammad was ordered by Allah to answer the question of the Quraysh people by saying that the doom they had been waiting for and wanted to hasten would soon come. In reality, the doom appears in the form of destruction and defeat that they will experience during the Battle of Badr. As many as 70 people among their leaders, including Abu Jahl, were killed and 70 other people became prisoners of war."
		   },
		   {
			"id": 3232,
			"surah": 27,
			"ayat": 73,
			"tafsir": "In this verse, Allah explains that the doom that they ask for hastened is not sent down because He really has great gifts for humans. Allah, the All-Forbearing, did not immediately bring down His punishment, on the contrary, he gave them the opportunity to repent and realize their error so that they consciously accept Allah's instructions brought by His Prophet. The opportunity to repent and return to the path of truth is a great gift, but most people are not grateful for it. This is also stated in His words: ...Indeed, Allah gives gifts to humans, but most humans are ungrateful. (al-Baqarah\/2: 243)"
		   },
		   {
			"id": 3233,
			"surah": 27,
			"ayat": 74,
			"tafsir": "In this verse, Allah makes it clear that He really knows what they hide in their hearts and what they reveal. He knows what they hide about their enmity towards the Messenger of Allah and what they reveal in deeds and deceit. Allah will reward them according to their deeds. This is in accordance with His words: It is all the same (to Allah), who among you keeps his words secret and who is frank with him; and who hid by night and walked by day. (ar-Ra'd\/13: 10)"
		   },
		   {
			"id": 3234,
			"surah": 27,
			"ayat": 75,
			"tafsir": "In this verse it is explained that everything that is unseen that happens in the heavens and the earth has been recorded in the Lawh Mahfuz, according to His words: Don't you know that Allah knows what is in the heavens and on earth? Indeed, this is already contained in a Book (Lauh Mahfudh). Verily that is s"
		   },
		   {
			"id": 3235,
			"surah": 27,
			"ayat": 76,
			"tafsir": "In these two verses, Allah explains the features of the Al-Qur'an as the greatest miracle of the Prophet Muhammad, namely: 1. The Al-Qur'an gives certainty to the Children of Israel regarding various matters that they have disputed, especially those related to Isa al-Masih son of Maryam . Some of the People of the Book regard him as a god, some view him as the son of God, and some consider him the third person in the trinity. There are also those who see him as a false prophet, just as his mother, Maryam, was accused of committing adultery. 2. The Qur'an is truly a guide for believers because it contains various arguments and evidence that show the truth of monotheism which is the core of the treatises of the prophets. The Qur'an also contains laws that are needed by all mankind to achieve happiness in life in this world and in the hereafter. This convinces people who read the Qur'an that this book is truly a revelation from God. 3.Al-Qur'an is also a mercy for the believers. Even though the Prophet Muhammad was an Ummi who could not read and write, and had never associated with the leaders of the People of the Book before becoming an apostle, but because the Qur'an is the word of God which was revealed to the Prophet Muhammad, it contains complete stories about the stories of the previous prophets and people as described in the Torah and the Bible. Disputes of opinion among the People of the Book are indeed very deep and concern fundamental matters such as opinions about the trinity, the existence of God the Father and God the Son. There are also those who think that Isa al-Masih is a false prophet, the last prophet was Yusya and so on. If the People of the Book studied their scriptures honestly and earnestly to seek the truth without national or ethnic sentiments, they would undoubtedly come to the conclusion that the prophet hinted at in the Torah is none other than the Prophet Muhammad because the characteristics mentioned in the Torah are indeed the same as the properties. However, because the Prophet Muhammad was not from the descendants of the Children of Israel, they found it difficult to accept the truth. In the book of the Old Testament, the book of Deuteronomy (Deuteronomium 18: 18) is stated thus, \"That I (God) will make them a prophet from among all his brothers, who are like you (Moses), and I will give all My words in his mouth and he will say to him everything I tell him to. That whoever does not want to hear all My words, which he will speak in My name, I will definitely demand them from that person later. \" The sign from the book of Deuteronomy implies that the prophet that God will send after Prophet Musa will be from the brothers of the Children of Israel, namely the Children of Ismail or the Arabs, because Israel or Jacob and Ismail are both descendants of the Prophet Abraham. Ishmael was the son of Abraham and Jacob was the son of Isaac, who was also the son of Abraham. The prophet who will be sent is like Moses. In this verse, Allah explains that the Qur'an which was revealed to the Prophet Muhammad explained to the Children of Israel most of the issues they disputed. If they are aware and aware and distance themselves from the invitation of lust and ethnic sentiments, they will feel the right and purity of the teachings of the Qur'an. However, because they were hindered by arrogance, they still rejected it, even though the proofs of its truth were clear."
		   },
		   {
			"id": 3236,
			"surah": 27,
			"ayat": 77,
			"tafsir": "In these two verses, Allah explains the features of the Al-Qur'an as the greatest miracle of the Prophet Muhammad, namely: 1. The Al-Qur'an gives certainty to the Children of Israel regarding various matters that they have disputed, especially those related to Isa al-Masih son of Maryam . Some of the People of the Book regard him as a god, some view him as the son of God, and some consider him the third person in the trinity. There are also those who see him as a false prophet, just as his mother, Maryam, was accused of committing adultery. 2. The Qur'an is truly a guide for believers because it contains various arguments and evidence that show the truth of monotheism which is the core of the treatises of the prophets. The Qur'an also contains laws that are needed by all mankind to achieve happiness in life in this world and in the hereafter. This convinces people who read the Qur'an that this book is truly a revelation from God. 3.Al-Qur'an is also a mercy for the believers. Even though the Prophet Muhammad was an Ummi who could not read and write, and had never associated with the leaders of the People of the Book before becoming an apostle, but because the Qur'an is the word of God which was revealed to the Prophet Muhammad, it contains complete stories about the stories of the previous prophets and people as described in the Torah and the Bible. Disputes of opinion among the People of the Book are indeed very deep and concern fundamental matters such as opinions about the trinity, the existence of God the Father and God the Son. There are also those who think that Isa al-Masih is a false prophet, the last prophet was Yusya and so on. If the People of the Book studied their scriptures honestly and earnestly to seek the truth without national or ethnic sentiments, they would undoubtedly come to the conclusion that the prophet hinted at in the Torah is none other than the Prophet Muhammad because the characteristics mentioned in the Torah are indeed the same as the properties. However, because the Prophet Muhammad was not from the descendants of the Children of Israel, they found it difficult to accept the truth. In the book of the Old Testament, the book of Deuteronomy (Deuteronomium 18: 18) is stated thus, \"That I (God) will make them a prophet from among all his brothers, who are like you (Moses), and I will give all My words in his mouth and he will say to him everything I tell him to. That whoever does not want to hear all My words, which he will speak in My name, I will definitely demand them from that person later. \" The sign from the book of Deuteronomy implies that the prophet that God will send after Prophet Musa will be from the brothers of the Children of Israel, namely the Children of Ismail or the Arabs, because Israel or Jacob and Ismail are both descendants of the Prophet Abraham. Ishmael was the son of Abraham and Jacob was the son of Isaac, who was also the son of Abraham. The prophet who will be sent is like Moses. In this verse, Allah explains that the Qur'an which was revealed to the Prophet Muhammad explained to the Children of Israel most of the issues they disputed. If they are aware and aware and distance themselves from the invitation of lust and ethnic sentiments, they will feel the right and purity of the teachings of the Qur'an. However, because they were hindered by arrogance, they still rejected it, even though the proofs of its truth were clear."
		   },
		   {
			"id": 3237,
			"surah": 27,
			"ayat": 78,
			"tafsir": "In this verse, Allah explains that He will resolve all the disputed issues of the Children of Israel with His just and wise decision. Thus, those who are false will be punished, and those who are righteous will be rewarded according to their deeds, because Allah is the Almighty, All-Knowing God."
		   },
		   {
			"id": 3238,
			"surah": 27,
			"ayat": 79,
			"tafsir": "In this verse, Allah explains that He will resolve all the disputed issues of the Children of Israel with His just and wise decision. Thus, those who are false will be punished, and those who are righteous will be rewarded according to their deeds, because Allah is the Almighty, All-Knowing God."
		   },
		   {
			"id": 3239,
			"surah": 27,
			"ayat": 80,
			"tafsir": "In this verse, Allah explains that the Prophet Muhammad was not assigned to make the polytheists believe. He was only assigned to convey the call or treatise from Allah. It is not within his authority to force an infidel to become a believer. It is in God's power. The Prophet was unable to put instructions into the hearts of people who had been locked away. This verse also explains that Muhammad could neither make the dead hear nor make the deaf hear calls, especially if their hearts had turned backwards. The words \"those who died\" and \"those who were deaf\" in this verse are metaphorical expressions. The point is that polytheists are considered as people who have lost their minds, are deaf and cannot hear good calls and invitations. They have turned their backs. They are likened to dead people and deaf people because all the verses that are recited to them have no effect at all. Although in general this verse explains that a dead person cannot hear the cries of a living person, there are several valid hadiths, such as Narrated by Muslim, who explained that the Prophet Muhammad once spoke to the bodies of polytheists who were killed during the Battle of Badr and buried together in a well. Seeing this, some of his friends, including Umar bin Khattab, expressed their astonishment by asking why the Prophet spoke to people who had died. Responding to this, the Prophet said: You don't listen more than they do what I say, it's just that they can't answer. (History of Imam Muslim from Anas bin Malik) The understanding contained in the hadith above is that people who are still alive and the corpses can hear the words of the Prophet. However, people who are still alive can answer, but they can't. In several valid hadiths, the Prophet also explained that when a corpse has finished being put in its grave, he can hear the sound of shoes or the overlapping of the people who accompanied him. As a messenger of God's message, the Prophet could not give guidance to polytheists to become believers as happened with the Prophet's uncle, Abu Talib, who did not believe until the end of his life. Allah's Word: Indeed, you (Muhammad) cannot guide those you love, but Allah guides those whom He wills, and He knows better those who are willing to receive guidance (al-Qasas\/28: 56) Assignments The Prophet only gave instructions in the sense of giving guidance (irsyad), giving information (bayan), and carrying it out, as Allah says: ... And indeed, you really guide (people) to the straight path. (asy-Syura\/42 : 52) The definition of guidance in surahh al-Qasas\/28: 56 above is \"taufik\". This implies that the Prophet did not have the authority to give taufik to humans, even to those he loved, for example Abu Talib. only Allah can give guidance in the sense of taufik to those whom He wills. As for guidance in surahh as-Shura\/42: 52 it means \"tabyin and irshad\". This means that the Prophet has the authority to give explanations with broad instructions."
		   },
		   {
			"id": 3240,
			"surah": 27,
			"ayat": 81,
			"tafsir": "In this verse, Allah strengthens the understanding of the previous verse that the Prophet Muhammad could not turn away blind people who had locked their hearts from misguidance. The eyes of his heart cannot be guided to the straight path because there is a veil or a wall that covers his view, so he cannot see the truth at all. The Prophet Muhammad could not make someone able to hear his call with positive hearing, except for those who believe in Allah, then surrender sincerely to Him."
		   },
		   {
			"id": 3241,
			"surah": 27,
			"ayat": 82,
			"tafsir": "In this verse, Allah explains that when His anger and wrath have fallen on disobedient humans, for abandoning orders and polluting the purity of His religion, then at the time of the Day of Judgment, animals crawl out of the earth and speak to them with their tongues. who are eloquent, that most people do not believe in Allah's verses, and do not believe in the coming of the Day of Judgment. The words of the reptiles contained very harsh insults and warnings to the people around them. The strange thing that will happen before the end of the world, where a reptile can speak to warn people who disobey, is not impossible for Allah. He was able to give the beast the ability to speak at that time, according to His words: They said, \"God, who made us able to speak, must also be able to make all things speak.\" (Fussilat\/41: 21) Regarding the release of reptiles, it is considered a supernatural problem because their shape and nature are not mentioned in the Al-Qur'an. Information about this is only found in the hadith. Among them is a hadith narrated by Muslim from 'Abdullah bin amr: 'Abdullah bin 'Amr said, \"I memorized a hadith from the Messenger of Allah that I will never forget. I heard him say, 'Signs of (the coming of the Hour) that the first time it appears is the rising of the sun from the west and the release of reptiles to people in the morning. When one of these two events occurs, the other one follows immediately after it.\" (Muslim History)"
		   },
		   {
			"id": 3242,
			"surah": 27,
			"ayat": 83,
			"tafsir": "In these verses, Allah explains the behavior and actions of disbelievers who deny Allah and His Messenger when they witness the coming of the Day of Judgment themselves. On that day, Allah gathers those who deny His verses from every human being. After they gathered at Padang Mahsyar to be brought to account, they all stood before Allah to face various questions and examinations. The disbelievers and polytheists heard the accusations which were very piercing. One of them is why they have denied the verses of Allah which clearly inform about the existence of this day of resurrection and day of reckoning. Why didn't they think about the problem, even though the apostles conveyed the arguments clearly and clearly to them? Why do they act arrogant and arrogant and do not want to accept the statement of the apostles, even though they do not have definite knowledge and have never thought about it carefully and seriously."
		   },
		   {
			"id": 3243,
			"surah": 27,
			"ayat": 84,
			"tafsir": "In these verses, Allah explains the behavior and actions of disbelievers who deny Allah and His Messenger when they witness the coming of the Day of Judgment themselves. On that day, Allah gathers those who deny His verses from every human being. After they gathered at Padang Mahsyar to be brought to account, they all stood before Allah to face various questions and examinations. The disbelievers and polytheists heard the accusations which were very piercing. One of them is why they have denied the verses of Allah which clearly inform about the existence of this day of resurrection and day of reckoning. Why didn't they think about the problem, even though the apostles conveyed the arguments clearly and clearly to them? Why do they act arrogant and arrogant and do not want to accept the statement of the apostles, even though they do not have definite knowledge and have never thought about it carefully and seriously."
		   },
		   {
			"id": 3244,
			"surah": 27,
			"ayat": 85,
			"tafsir": "This verse explains that Allah's wrath towards those who disbelieve is due to their own tyranny. They could not say anything to reject the punishment that was about to befall them as stated in the word of Allah: This is the day, when they could not speak, and they were not allowed to make excuses so that they would be forgiven. (al-Mursalat\/77: 35-36)"
		   },
		   {
			"id": 3245,
			"surah": 27,
			"ayat": 86,
			"tafsir": "After conveying very frightening news about the awesomeness of the Day of Judgment, Allah in this verse presents the arguments for His oneness, regarding the certainty of the coming of the Day of Resurrection, and the arguments justifying Muhammad saw as Allah's messenger. Among the signs of Allah's power is the existence of night and day that come and go. Do those who deny the Day of Judgment not notice that in fact Allah has made the night a time to rest from busy and tired work during the day, a time to gather and relax with families in their respective homes, and to restore all energy and strength to function? continue work the next day. A bright day is waiting for them to continue their business to earn a living for themselves and their families. Don't they think that everything is arranged and controlled by Almighty Allah, who can revive, die and resurrect them after death? As day and night contain many benefits and benefits for human life, so the sending of the apostles brought enormous benefits for the happiness of human life in this world and the hereafter. Indeed, in these incidents there are signs of Allah's power for those who believe."
		   },
		   {
			"id": 3246,
			"surah": 27,
			"ayat": 87,
			"tafsir": "In this verse, Allah describes the events of the end of the world in particular, namely on the day when the angel Israfil blows the trumpet. Everything in the heavens and on earth was shocked, except for the angels Gabriel, Mikail, Israfil, Azrael, and those who believed. The trumpet blast occurred twice, the first blast which was named \"nafkhah as-sa'q\" caused the death of all beings except those who were excluded. Then with the second blast, they will all be resurrected from their respective graves, as in His word: And the trumpet is blown, then all (creatures) in the heavens and on earth die except those whom Allah wills. Then it is blown once again (the trumpet) so immediately they wake up (from their graves) waiting (God's decision). (az-Zumar\/39: 68) This second blast is named \"nafkhah al-ba'ts\" which means the blast of resurrection, as in His words: Then the trumpet is blown, so immediately they come out of their graves (alive), towards his Lord. (Yasin\/36: 51) This event is also mentioned in the word of Allah: (namely) on the day when they came out of the grave quickly as if they were going immediately to idols (while in the world), their eyes were downcast humiliation. That was the day that was threatened to them. (al-Ma'arij\/70: 43-44)"
		   },
		   {
			"id": 3247,
			"surah": 27,
			"ayat": 88,
			"tafsir": "In this verse, Allah explains that the mountains which now seem to be firmly standing in place, will be uprooted from the earth on the Day of Judgment and then blown away like feathers in the air and the clouds will travel. Allah's Word: And the mountains are like feathers (which fly). (al-Ma'arij\/70: 9) There are two opinions of commentators regarding the statement of this verse that the mountains will be blown up in the air like the running of the clouds, or in other verses like feathers being blown by the wind. The first opinion, which is the opinion of most commentators, suggests that this verse relates to the events of the Last Day, as in the word of Allah: On the day (when) the heavens shook violently, and the mountains moved (moved). (ath-thur\/52: 9-10 ) And His words: And the mountains were carried on so that they became mirages. (an-Naba'\/78: 20) In another of His words: (That is) on the day (when) the earth is replaced with another earth and (so does) the sky, and they (humans) gather (in Padang Mahsyar) before Allah the Almighty, the Most Mighty. (Ibrahim\/14: 48) These very terrible events took place on the Day of Judgment after the second trumpet blast, where all humans were resurrected from their graves and they witnessed all kinds of very terrible events with different attitudes. The second opinion regarding the tafsir of verse 88, namely the opinion of astronomers, states that this verse is not related to the events of the Doomsday, but to natural phenomena in the world. This verse says, \"And you will see the mountains, which you think are still in place, but they walk (like) the clouds walk.\" It was postulated that the earth rotates like the other planets in a predetermined orbit, it's just that humans, as inhabitants of the earth, don't feel it. The reasons for the scholars of Falak, that verse 88 relates to current events and not to the events of the Day of Judgment, are: 1. This verse cannot be included in the category of threatening or frightening with the awesomeness of the Day of Judgment because it is followed by the words: ( That is) the creation of Allah who created perfectly everything. Therefore, this verse is more appropriate when connected with the present, where humans as inhabitants of the earth think that the earth is stationary, as well as the mountains that are above its surface. In fact, the earth along with the mountains walk or circulate as the course of the clouds. 2. The mountains will be blown away to be destroyed on the Day of Judgment, and will coincide with the destruction of the universe, including the death of all mankind. Only a few angels survived. If on the day after the sound of the first trumpet there is no human left alive, how can it be said that later they will see mountains that are thought to be silent, but they walk like the clouds. 3. The people in Padang Mahsyar, who witnessed the mountains moving like the clouds, were of course aware and saw it with their own eyes, so it is not appropriate to say that they thought the mountains were standing still. It is very different if it is related to the present, because indeed humans cannot feel that the mountains are moving and walking in the sky as the clouds travel, because the mountains move with the earth and the air around them. With such an understanding, then it fits the words: (That is) the creation of Allah who created everything perfectly. These beautiful words are not appropriate in the context of the Day of Judgment which is full of threats and fear of the destruction of the entire universe. These are the two opinions regarding the tafsir of verse 88. Most commentators explain that the verse is related to the events of the Day of Judgment. Another part, consisting of celestial scholars, explained that the verse relates to current events, and was used as a postulate that everything on earth, including mountains, moves, travels in space as clouds travel. The difference in tafsir does not concern the level of meaning, but only concerns the time it occurred. Because this incident is included in the supernatural realm, it is better for human attention to focus on improving their deeds. Therefore, at the end of the verse it is stated that Allah is All-Knowing of what humans do. According to the view of scientists, the earth is the fifth largest planet of the nine planets in the solar system. It is similar in shape to a round ball, with a circumference of about 12,743 km. The surface area of the earth is estimated to be around 510 million km2. About 29% of the earth's surface is land, while the rest is in the form of oceans. Earth consists of several layers which are broadly divided into 3 parts. The topmost part is called the earth's crust and its thickness varies from 0-100 km where it gets thicker towards the continents. Underneath there is a mantle with a depth of up to 2,900 km. The deepest part is called the earth's core with a depth of 2,900-6,370 km. This division is based on the analysis of earthquake waves and each of these parts has different physical properties. The earth's core, for example, has physical properties like a liquid. This division can basically be broken down in more detail. Humans are in the upper layer of the earth, namely the earth's crust. Until the half of the 20th century, the terrestrial field was marked by debates about continental drift. Those who disagree are called fixists, while those who agree are called mobilists. According to the mobilist camp, continental floats and moves above the mantle. If we look at the world map, it is very easy for us to see the African continent and the [South] American continent when they are squeezed together, the coastlines of the two are relatively coincident. So basically all the continents that existed were one continent, called Pangea, then broke up and moved to where we see it today. Scientific data such as ancient magnetic data, similarity of fossils and similarity of geological formations support this theory. And you will see the mountains, which you think are still in place, but they walk (like) the clouds walk. This debate went on and on and peaked in the sixties. At that time, there was a revolution of thought in the field of geology and the thoughts of the mobilists began to be widely accepted. The discovery of mid-oceanic ridges in the Atlantic and Pacific Oceans supported by geological and geophysical data, especially magnetic data, shows that there is a spreading of the ocean floor where two plates are moving away from each other. On this ocean floor, magma with a very high temperature originating from the earth's mantle rises upwards to form a mid-oceanic ridge. From the two concepts above, Continental Drift and Oceanic Expansion, the concept of Plate Tectonics was born which developed very rapidly since 1967 and has implications for all geological aspects including earthquakes, volcanoes, to the development of hydrocarbon basins and mineral deposits. This theory says that the upper part of the earth consists of lithosphere plates consisting of the earth's crust and upper mantle which float and move above the part of the mantle called the asthenosphere. The lithospheric plates move and interact with each other. Where these plates meet, these plates meet causing earthquakes. An example is Indonesia, which is a meeting place for three plates: Eurasia, Pacific and Indo-Australia. When two plates meet, a continuous pressure (load) occurs, and if the plate can no longer withstand the pressure (load), then the load that has accumulated for hundreds of years is released, and is released in the form of an earthquake, as Allah says: When the earth was shaken with a great shock, and the earth has released its heavy burdens, and people ask, \"What happened to this earth?\" On that day the earth delivered its news. (al-Zalzalah\/99: 1-4) On that day, the earth tells its news. The heavy load incurred in the form of an earthquake is a geological process that lasts for years. And so on, every time the load is released, the load collection process occurs again. This geological process or geological news can be recorded, either naturally or by using geophysical or geodetic equipment. An example is the earthquakes several tens or hundreds of years ago, load shedding events were well recorded by coral reefs near the earthquake source. In modern times, this energy release is recorded by seismograph equipment (earthquake recorders) and geodetic equipment called GPS (Global Position System)."
		   },
		   {
			"id": 3248,
			"surah": 27,
			"ayat": 89,
			"tafsir": "This verse explains that those who believe in Allah and do good deeds, will get a better reward than their own deeds, and are given a comfortable and eternal residence in Na'im heaven, they will be safe from terrible shocks on the Day of Resurrection."
		   },
		   {
			"id": 3249,
			"surah": 27,
			"ayat": 90,
			"tafsir": "On the other hand, those who associate partners with Allah and do evil, their faces will be lowered down into hell and it will be said to them, \"You will not receive a reward, but according to the polytheism and evil that you used to do in the world, so that it becomes a cause for the coming of Allah's wrath.\""
		   },
		   {
			"id": 3250,
			"surah": 27,
			"ayat": 91,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to convey to the polytheists of Mecca that he was only ordered by Allah to worship the God of this country (Mecca) which had been made as Haram land (Holy Land), that it was forbidden to shed blood or commit injustice to anyone in there. The specific mention of the land of Mecca in this verse is because there is the Kaaba, which is the house of worship that was first built on this earth as a place for people to face when praying wherever they are, in accordance with His words: Truly a house (of worship) the first that was built for humans, is (Baitullah) which is in Bakah (Mecca) which is blessed and becomes a guide for all nature. (ali 'Imran\/3: 96) As for the one who must be worshiped is only Allah, not the idols that the polytheists put there, according to the word of Allah: So let them worship the Lord (owner) of this house (Kaaba), Who has given them food to satisfy their hunger and secure them from fear. (Quraish\/106: 3-4). This was a strong rebuke to the Meccan infidels who did not worship the God who owns the House, but worshiped the idols they placed around it. To Allah belongs all things, both in the heavens and the earth, in terms of creation, ownership and management, there is no partner for Him. Therefore, only Allah is the only one who has the right to be worshiped and to Him the Prophet was ordered to submit himself with full sincerity and monotheism, namely the straight path or the religion of Islam, in accordance with His words: Say (Muhammad), \"Verily, my Lord has given me a guide to the straight path, the true religion, the straight religion of Abraham. He (Ibrahim) is not one of the polytheists.\"(al-An'am\/6: 161)"
		   },
		   {
			"id": 3251,
			"surah": 27,
			"ayat": 92,
			"tafsir": "In this verse, Allah explains that the Prophet Muhammad was ordered to read the Qur'an to humans, to reveal the meaning and secrets contained therein, and absorb the postulates about Allah's power that can be seen in the universe. Thus, he can dive into the true nature of life and receive an abundance of God's grace to him. The Holy Prophet repeated the verse several dozen times until dawn. When reading it, it appeared to him that some of the secrets contained in it, so that he felt the benefits of reading the verses of the Qur'an and understanding its contents, according to His words: Thus We read to you (Muhammad) some verses and warnings that are full of wisdom. (ali 'Imran\/3: 58) Allah's other words: Thus, We have sent you (Muhammad) to a people who actually had previously passed several people, so that you read to them (Al-Qur'an) that We revealed to you . (ar-Ra'd\/13: 30) Whoever follows the teachings of the Qur'an, believes in the Prophet Muhammad, and accepts his instructions, then indeed he has walked the straight path to happiness in this world and the hereafter. The hint was for his own good. However, whoever goes astray and deviates from the straight path that was pioneered by the Prophet, then they will feel bad for themselves. The Prophet saw would not suffer any loss because his task was merely to give a warning in accordance with the word of Allah: So actually your duty is only to convey it, and We are the ones who take account of (their deeds). (ar-Ra'd\/13: 40) And the word of Allah: Indeed, you are only a warner and Allah is the guardian of all things. (Hud\/11:12)"
		   },
		   {
			"id": 3252,
			"surah": 27,
			"ayat": 93,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad, who has conveyed good news to the Muslims who followed his instructions, and warned those who disobeyed him, to say that all praise be to Allah for all His blessings and gifts. Among them are the blessings of prophethood and apostleship, which cause other blessings to come, both pleasures in this world and the hereafter. Allah has given the Prophet the opportunity to bear all the burdens in carrying out religious calls, in the context of obedience and obedience to God, the Most Gracious, the Most Compassionate, who has provided pleasure and great rewards for His sincere servants. Allah has given the Prophet various miracles, which show the truth of His message and the taufik to follow the straight path of religion. The Apostle really wants his people to open their hearts to be able to see the evidence of the truth. However, Satan and his passions have so deceived their eyes that they cannot see the true reality. If they are still disobedient and stubborn, then remember that all human beings will die. All of them on the Day of Judgment will be resurrected from their respective graves and presented to the presence of Allah, who will examine all the deeds they have done in the world. It is there that Allah will show those who disobey the signs of His greatness. There, too, Allah will show them His painful punishment, so that they will know it. It is also there that they will later express their infinite regret for their disbelief in the Prophet's message. Regret that has no meaning and benefits anymore because they have wasted the opportunity and age that has passed, while God is not negligent in what they do."
		   }
	]
}
