{
	"tafseer": [
		{
			"id": 6044,
			"surah": 91,
			"ayat": 1,
			"tafsir": "Allah swore by the sun and its light during Duha which was very bright and contrasted with the previous moment where darkness covered this world. Then Allah swears by the moon that is opposite to the sun, because it is not a source of light but only receives light from the sun. According to scientific studies, light in the morning is the most complete in terms of wavelength. Therefore, morning sunlight is the best for humans. The sun is the main source of energy for humans, while its light consists of visible, infrared and ultraviolet light. Visible light has seven different spectrums and each has a different use for the human body. Infrared is useful for reducing pain in the muscles, and ultraviolet functions as a phytocatalyst that accelerates the conversion of pro-vitamin D in human skin into vitamin D."
		   },
		   {
			"id": 6045,
			"surah": 91,
			"ayat": 2,
			"tafsir": "Allah swore by the sun and its light during Duha which was very bright and contrasted with the previous moment where darkness covered this world. Then Allah swears by the moon that is opposite to the sun, because it is not a source of light but only receives light from the sun. According to scientific studies, light in the morning is the most complete in terms of wavelength. Therefore, morning sunlight is the best for humans. The sun is the main source of energy for humans, while its light consists of visible, infrared and ultraviolet light. Visible light has seven different spectrums and each has a different use for the human body. Infrared is useful for reducing pain in the muscles, and ultraviolet functions as a phytocatalyst that accelerates the conversion of pro-vitamin D in human skin into vitamin D."
		   },
		   {
			"id": 6046,
			"surah": 91,
			"ayat": 3,
			"tafsir": "Then Allah swore by day and night. Day reveals the sun, while night hides the sun. With this, God gave a hint about the rotation system of the moon and the earth relative to the sun as a marker of time for humans. The earth's rotation relative to the sun gives rise to the syamsiah time marker system, while the moon's rotation relative to the earth creates the qomariyah time marker. The structured movement of these three celestial bodies shows how powerful God is."
		   },
		   {
			"id": 6047,
			"surah": 91,
			"ayat": 4,
			"tafsir": "Then Allah swore by day and night. Day reveals the sun, while night hides the sun. With this, God gave a hint about the rotation system of the moon and the earth relative to the sun as a marker of time for humans. The earth's rotation relative to the sun gives rise to the syamsiah time marker system, while the moon's rotation relative to the earth creates the qomariyah time marker. The structured movement of these three celestial bodies shows how powerful God is."
		   },
		   {
			"id": 6048,
			"surah": 91,
			"ayat": 5,
			"tafsir": "Furthermore, Allah swears by the heavens and the earth. The sky, namely the cosmos and everything in it, supports the sky so that it continues to function as the roof of the earth. And the earth is spread out so as to provide potentials that can be utilized by humans to live on it."
		   },
		   {
			"id": 6049,
			"surah": 91,
			"ayat": 6,
			"tafsir": "Furthermore, Allah swears by the heavens and the earth. The sky, namely the cosmos and everything in it, supports the sky so that it continues to function as the roof of the earth. And the earth is spread out so as to provide potentials that can be utilized by humans to live on it."
		   },
		   {
			"id": 6050,
			"surah": 91,
			"ayat": 7,
			"tafsir": "Finally, Allah swears by the human beings that He has created with perfect physical and psychological conditions. Having created him perfectly, Allah put into man the potential for evil and good."
		   },
		   {
			"id": 6051,
			"surah": 91,
			"ayat": 8,
			"tafsir": "Finally, Allah swears by the human beings that He has created with perfect physical and psychological conditions. Having created him perfectly, Allah put into man the potential for evil and good."
		   },
		   {
			"id": 6052,
			"surah": 91,
			"ayat": 9,
			"tafsir": "In these verses, Allah emphasizes a message that is so important that it is necessary for Him to take an oath. The message is that those who purify themselves, that is, control themselves so that they only do good deeds, will be lucky, that is, they will be happy in this world and especially in the hereafter. Meanwhile, those who pollute themselves, namely following their desires so that they commit sinful acts, will be wretched, that is, they will be unhappy in this world and will enter hell in the hereafter."
		   },
		   {
			"id": 6053,
			"surah": 91,
			"ayat": 10,
			"tafsir": "In these verses, Allah emphasizes a message that is so important that it is necessary for Him to take an oath. The message is that those who purify themselves, that is, control themselves so that they only do good deeds, will be lucky, that is, they will be happy in this world and especially in the hereafter. Meanwhile, those who pollute themselves, namely following their desires so that they commit sinful acts, will be wretched, that is, they will be unhappy in this world and will enter hell in the hereafter."
		   },
		   {
			"id": 6054,
			"surah": 91,
			"ayat": 11,
			"tafsir": "The Samud are the people of Prophet Saleh. They have denied and denied the prophethood and teachings that the Prophet Saleh brought from Allah. Prophet Saleh was given a miracle by Allah as a test for his people, namely a she-camel that was embodied from a large stone, to match the expertise of the people who were very good at stone sculpture. If they are good at sculpture so that the statue looks like it is alive, then Prophet Saleh's miracle was to incarnate a she-camel that really came alive from a rock. However, they disowned him, and tried to kill the camel."
		   },
		   {
			"id": 6055,
			"surah": 91,
			"ayat": 12,
			"tafsir": "The beginning of the disaster for the Samud people was when the most evil of them appeared, namely Qudar bin Salif. He was a very brave, mighty, and ruthless man. He came to provoke his people to kill the she-camel of Prophet Saleh's miracle."
		   },
		   {
			"id": 6056,
			"surah": 91,
			"ayat": 13,
			"tafsir": "Prophet Saleh warned his people not to disturb the camel. He warned that the camels were a miracle from Allah, and their right to drink with them every day, must be respected. He also warned that if they disturbed him, they would be in danger."
		   },
		   {
			"id": 6057,
			"surah": 91,
			"ayat": 14,
			"tafsir": "However, his people saw Prophet Saleh as a lie, as well as the camel as a miracle, and ignored Prophet Saleh's warning. They caught the camel together, then Qudar bin Salif killed it by cutting it into pieces. Finally Allah leveled their land to the ground, by sending thunderous thunder accompanied by a great earthquake, as a recompense for their disobedience and sins."
		   },
		   {
			"id": 6058,
			"surah": 91,
			"ayat": 15,
			"tafsir": "God does not care about the disaster that He brings on them with such great sacrifices. This was because of their extreme disobedience, namely killing the she-camel (miracle) that He sent down to His prophet."
		   }
	]
}
