{
	"tafseer": [
		{
			"id": 6080,
			"surah": 93,
			"ayat": 1,
			"tafsir": "In these verses, Allah swears by two kinds of signs of His greatness, namely dhuha (when the sun rises a piece) with its light and night with its darkness and silence, that He did not leave His Messenger, Muhammad, nor did he scold him, as people say or the feelings of Rasulullah himself."
		   },
		   {
			"id": 6081,
			"surah": 93,
			"ayat": 2,
			"tafsir": "In these verses, Allah swears by two kinds of signs of His greatness, namely dhuha (when the sun rises a piece) with its light and night with its darkness and silence, that He did not leave His Messenger, Muhammad, nor did he scold him, as people say or the feelings of Rasulullah himself."
		   },
		   {
			"id": 6082,
			"surah": 93,
			"ayat": 3,
			"tafsir": "In these verses, Allah swears by two kinds of signs of His greatness, namely dhuha (when the sun rises a piece) with its light and night with its darkness and silence, that He did not leave His Messenger, Muhammad, nor did he scold him, as people say or the feelings of Rasulullah himself."
		   },
		   {
			"id": 6083,
			"surah": 93,
			"ayat": 4,
			"tafsir": "In this verse, Allah revealed something that made the Prophet's chest expand and his soul reassured, that the Prophet's condition in his life in the days to come would be better than in the past. His greatness will increase and his name will be better known. Allah will always guide him to achieve glory and to go to greatness. It was as if Allah had said to His Messenger, \"Do you think that I will leave you? In fact, your position with Me now is stronger and closer than ever.\" Allah's promise to the Prophet Muhammad continues to be proven because since then the name of the Prophet has become more and more famous, his position has grown stronger, so that it has reached a level that was never achieved by the previous apostles. Allah has made the Prophet Muhammad as mercy, guidance, and light for all of nature and all of His servants. Allah made love for the Prophet Muhammad including love for Him too; following the Prophet and obeying him is the way to obtain His favors, and to make the Prophet's people as witnesses for all mankind. The Prophet himself has broadcast the religion of Allah in accordance with His will so that it reaches all corners of the world. This is an incomparable greatness, an incomparable pre-eminence, and a glory that no one can match. All of that is God's gift given to those whom He wills."
		   },
		   {
			"id": 6084,
			"surah": 93,
			"ayat": 5,
			"tafsir": "In this verse, Allah conveys the good news to the Prophet Muhammad, that He will continue to bestow His grace on him, so that he will be happy and happy. Among His gifts is the continuous revelation after that as a guide for the Prophet and his people to get the happiness of life in this world and the hereafter. He will win the religion that the Prophet Muhammad brought over all other religions and He will elevate his position above that of all mankind."
		   },
		   {
			"id": 6085,
			"surah": 93,
			"ayat": 6,
			"tafsir": "In this verse, Allah reminds of the blessings that the Prophet Muhammad had received by saying, \"Aren't you, O Muhammad, an orphan, you do not have a father who is responsible for your education, takes care of your interests and guides you, but I have guarded, protected and guided you and kept you away from the sins of the ignorant people and their bad behavior, so you get the nickname of the perfect Man.\" The Prophet saw lived in an orphaned state because his father died while he was still in his mother's womb. When he was born, Allah took care of Muhammad saw by making his grandfather, Abdul Muttalib, love and care for him. The Prophet Muhammad was under his care and guidance until Abdul Muttalib died, while the Prophet was eight years old at that time. With the death of Abdul Muttalib, the Prophet Muhammad became the responsibility of his uncle, Abu Talib, based on the will of Abdul Muttalib. Abu Talib had devoted all his attention to raising the Prophet, so that he grew up and was made an apostle. After Muhammad was made an apostle, the people of Quraysh were hostile and hurt him, but Abu Talib continued to defend him from all the threats of polytheists until Abu Talib died. With the death of Abu Talib, the Quraysh people had the opportunity to harm the Prophet through bad people among them who forced him to emigrate. How great is Allah's training and care for the Prophet Muhammad. Usually the orphanage of a child is the cause of his moral destruction because there is no responsible caregiver and mentor. Moreover, the atmosphere and attitude of the people of Mecca was more than enough to lead the Prophet astray. however, Allah's immaculate protection prevented him from accompanying them. Thus, he became a young man who was very honest, trusted, never lied, and never smeared with the sins of ignorant people."
		   },
		   {
			"id": 6086,
			"surah": 93,
			"ayat": 7,
			"tafsir": "In this verse, Allah reveals that He found the Prophet Muhammad in a state of not understanding Shari'a and not knowing the Qur'an. Then Allah gave instructions to him. What really confused the Prophet Muhammad was what he saw among the Arabs themselves about the lowliness of the creed, the weakness of judgment caused by the influence of wrong assumptions, bad deeds, and their divided and hostile state. They headed for destruction because they used foreigners who were free to act among them, which consisted of the Persians, Abyssinians and Romans. What path must be taken to correct their beliefs, free them from the influence of these bad customs, and what method must be followed to awaken them from this deep sleep? The people of other prophets were not better off than their people. But even so, Allah did not allow the Prophet Muhammad to carry out his da'wah without His help. Allah even gave a revelation explaining to him the path that must be taken in an effort to improve the condition of his people. Allah said: And thus We revealed to you (Muhammad) the spirit (Qur'an) by Our command. Previously you did not know what the Book (Al-Qur'an) was and what faith was, but We made the Qur'an a light, with it We gave guidance whom We wanted among Our servants. (asy-Shura\/42: 52)"
		   },
		   {
			"id": 6087,
			"surah": 93,
			"ayat": 8,
			"tafsir": "In this verse, Allah states that the Prophet Muhammad was a poor man. His father left him no inheritance except for a she-camel and a maidservant. Then Allah gave him property in the form of enormous profits from trading Khadijah's property and added to it the property that Khadijah gave him in the struggle to uphold Allah's religion. From the information mentioned above, Allah actually told the Prophet Muhammad that it was He who took care of him in an orphan condition, prevented him from confusion, and made him sufficient. Allah will not leave the Prophet Muhammad during his lifetime."
		   },
		   {
			"id": 6088,
			"surah": 93,
			"ayat": 9,
			"tafsir": "After stating in the previous verses about the various favors given to the Prophet Muhammad, in this verse, Allah asks His Prophet to be grateful for these blessings, and not to insult orphans and violate their rights. Instead, the Prophet Muhammad was asked to educate them with manners and manners, and to instill noble morals in their souls, so that they become useful members of society, not becoming seeds of evil that destroy those who associate with them. The Prophet Muhammad said: I (my position) and those who care for orphans in heaven (very close), are like these two (two fingers, namely the index and middle fingers). (History at-Tirmidhi from Sahl bin Sa'ad) Whoever has felt the bitterness of living in all deprivation, so he should be able to feel the bitterness of others. Allah has spared the Prophet Muhammad from misery and humiliation, so the Prophet should glorify all orphans as a sign of being grateful for the blessings bestowed upon him by Allah."
		   },
		   {
			"id": 6089,
			"surah": 93,
			"ayat": 10,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad that those who ask him for something should not be rejected harshly and yelled at, but instead be given something or politely refused. There is an opinion that what is meant by the word as-sa'il is a person who asks for guidance, so this applicant should be served gently while fulfilling his request."
		   },
		   {
			"id": 6090,
			"surah": 93,
			"ayat": 11,
			"tafsir": "In this verse, Allah reiterates to the Prophet Muhammad to multiply his gifts to the needy and poor and to be grateful, mention and remember the blessings Allah has bestowed on him. Mentioning God's blessings that have been bestowed on us is not to be proud of ourselves, but to be grateful and expect others to be grateful for the blessings they have obtained. In a hadith, the Prophet said: People who are not grateful to humans do not thank God. (History of Abu Dawud and at-Tirmizi from Abu Hurairah). The habit of miserly people often hide their wealth as an excuse for not giving alms, and they always reveal their shortcomings. On the other hand, generous people always show their gifts and sacrifices from the wealth that is bestowed upon them by expressing gratitude and gratitude to Allah for the abundance of His gifts."
		   }
	]
}
