{
	"tafseer": [
		{
			"id": 3341,
			"surah": 29,
			"ayat": 1,
			"tafsir": "Alif Lam Mim, see commentary on the hijaiyah letters at the beginning of surahh al-Baqarah"
		   },
		   {
			"id": 3342,
			"surah": 29,
			"ayat": 2,
			"tafsir": "In this verse, Allah asks people who have confessed their faith by reciting the creed, whether they will be allowed to confess their faith without being tested first? No, in fact, every believer must be tested first, so that it can be known to what extent they are patient and can stand the test. There are various tests that they must pass. For example, the order to emigrate (to leave one's hometown to save one's faith and beliefs), to strive in the way of Allah, to control one's desires, to carry out tasks in order to obey Allah, and various calamities such as the loss of family members, and dry heat which causes the growth of - Plants die from drought. All of these trials were meant to test which of them truly believed sincerely and who also had a hypocritical spirit. It also aims to find out whether they are people who are firm in their stance or people who are still unsure and doubtful so that their faith is still fragile. The meaning of this verse can be seen in another verse, namely: Do you think that you will be left alone (just like that), even though Allah does not know those who strive among you and do not take loyal friends other than Allah, His Messenger and those who believer. Allah is All-Aware of what you do. (at-Taubah\/9: 16) From the explanation above, it can be concluded that anyone who claims to have faith will not reach the true nature of faith before he has undergone various kinds of tests. The test can be in the form of obligations such as the obligation to utilize property, hijrah, jihad in the way of Allah, paying zakat to the poor, helping people who are experiencing difficulties and difficulties, and it can also be in the form of a disaster."
		   },
		   {
			"id": 3343,
			"surah": 29,
			"ayat": 3,
			"tafsir": "Those who believe and stick to their faith will face all kinds of suffering and difficulties. They are patient and steadfast to endure the suffering. For example, the Children of Israel who believed, were tested by Allah with various kinds of torture that Pharaoh imposed on him. The believers of Prophet Isa were also not spared from doom and tribulation. Everything is an example and a lesson for these Muslims. In a hadith the Prophet explained: Narrated by Khabbab bin al-Aratt that he said, \"We complained to the Messenger of Allah who was sleeping lying on his turban beside the Kaaba, we said (that we suffered various kinds of severe torment from the polytheists). Aren't you going to help us, O Messenger of Allah, by praying for our safety from this torment? The Messenger of Allah replied, \"People before you also experienced things like this, even more intense. Someone who because of his fervent faith in God he was punished, and a special pit was dug for him. Put the saw on his head. Then the saw was lowered slowly, so that the person's body was split in two. There are also those whose bodies are combed with a sharpened iron comb that has been heated. But they do not want to back down from their religious beliefs. By Allah, I will definitely uphold this religion anyway, so that travelers who are on their way from shan'a' to Hadramaut are safe. They fear nothing but Allah, even though the wolves surround their livestock. But you are too quick to succeed.\" (Narrated by al-Bukhari) It was narrated from Abi Sa'id al-Khudri that he said, \"I entered the Prophet's house and found him not feeling well (fever). I put my hand on his blanket. So I found a hot feeling on his blanket. I said, 'O Messenger of Allah, how great is this heat. The Prophet replied, 'Yes it is. We are being overwritten by trials that are multiplied, but the rewards are multiplied by Allah given to us. I asked again, 'O Messenger of Allah, who is the person who has suffered the most? He replied, 'The Prophets. I asked again, 'O Messenger of Allah, then who else? 'People who are pious, he replied.' that befalls him in the way of Allah, does not become discouraged and does not (also) surrender (to the enemy). And Allah loves those who are patient. (ali 'Imran\/3: 146) With that variety of suffering, Allah knows who is truly true perfect faith, and whoever covers up his falsehood with an attitude of faith. Allah will reward each of them with what he deserves. In short, Allah forbids humans to think that he was created for nothing. Precisely Allah will test every human being, to determine who has the highest degree in the sight of Allah. This degree cannot be obtained except by taking a severe test. Life is indeed full of challenges. struggle, whether we are reluctant or happy to face it. The higher the level of patience, the higher the victory and teaching that will be obtained. That is the sunna of Allah that applies to the people before and now."
		   },
		   {
			"id": 3344,
			"surah": 29,
			"ayat": 4,
			"tafsir": "God then warns, is there still a group of people who are prejudiced that people who are still doing evil deeds will be able to weaken God, so that He is unable to bring a reward in proportion to their deeds. Has not God's decree applied to the unjust people before, where they have been tortured with punishment that is commensurahte with their mistakes? According to Ibn 'Abbas, this verse came down as a criticism to a number of Meccan polytheists who thought that no matter what they did, no one could repay them. They were al-Walid bin al-Mugirah, Abu Jahal, al-Aswad, al-'as bin Hisham, 'Utbah bin Rabi'ah, al-Walid bin 'Utbah, 'Utbah bin Abi Mu'aith, Handhalah bin Abu Sufyan, and al-'as bin Wa'il. In fact, such thinking is wrong and not right. God does not make anything useless. He tests and educates people with various kinds of teaching, with the intention that they get a bright divine light."
		   },
		   {
			"id": 3345,
			"surah": 29,
			"ayat": 5,
			"tafsir": "This verse explains that people who really want to meet Allah and get a reward from Him on the Day of Judgment, should do good deeds and stay away from all prohibitions that might incur His wrath. Because the reward for someone's charity will surely come. Allah is All-Hearing and All-Knowing of one's intentions and deeds. Therefore, this verse is a warning so that everyone always intends to achieve what he wants, namely the pleasure of Allah and instills fear in his heart of punishment and His punishment. The meaning of \"meeting Allah\" in this verse is \"obtaining favors in heaven in return for good deeds\", where the culmination of the pleasure is to see the Essence of Allah himself. Meanwhile Ibn 'Abbas interpreted it to mean \"the day of Resurrection and the day of Judgment\". What is clear is the meaning contained in this verse encourages a person to prepare himself by doing as many good deeds as possible and completely avoiding Allah's prohibitions. Thus, they obtain eternal happiness in the afterlife. Jumhur scholars of tafsir interpret liqa'ullah with death (death) that is certain to come. However, the word above also contains the meaning of God's promise in the form of reward for good deeds and punishment for bad deeds. Either death or God's promise, both will surely come."
		   },
		   {
			"id": 3346,
			"surah": 29,
			"ayat": 6,
			"tafsir": "Allah explains that a person who really struggles (jihad), which is one aspect of the expression of longing to meet Allah, in essence struggles for himself, not for Allah. Jihad means fighting enemies and fighting one's own desires. It can also mean exerting all efforts for Allah and not only means war. The person who will get the result of his struggle is the one who relies on his intention to get a reward from Allah, the Lord of the worlds. Allah does not need whether they will struggle for themselves or not at all, because He is the Richest of all His creations. He is the Ruler of all these worlds and does according to his own will. The essence of jihad is patience, both jihad in fighting enemies and jihad in controlling lust. People who are patient in jihad mean that they can stand the trials and stick to the truth they believe in. In addition, he also tries to overcome obstacles in upholding the truth. In other verses, Allah confirms that the benefit of a person's deeds is truly for his own benefit. As Allah says: Whoever does good then (the reward) is for himself and whoever does evil then (his sin) becomes his own responsibility. And your Lord is not unjust at all (His) servants. (Fussilat\/41: 46) And the word of Allah: If you do good (means) you do good for yourself. And if you do evil, then (the loss of evil) is for yourself. (al-Isra'\/17: 7)"
		   },
		   {
			"id": 3347,
			"surah": 29,
			"ayat": 7,
			"tafsir": "Then Allah explained that those who believe in Allah and His Messenger with true faith, even though they are tested with various trials, they do not turn to disbelief (apostasy). Likewise, when experiencing suffering in dealing with polytheists, he continues to do all his obligations, stay away from all prohibitions, increase piety, help people who are in trouble, defend people who are persecuted, defend and defend the country from enemy attacks, and cooperate with one another. . They were rewarded by Allah in the form of forgiveness of all their past sins and mistakes. All of that is the cause of multiplying the reward given by Allah to be tenfold. Allah says: Whoever does good will be rewarded tenfold for his deeds. And whoever commits a crime will be rewarded in proportion to his crime. They are not the least bit disadvantaged (tortured). (al-An'am\/6: 160)"
		   },
		   {
			"id": 3348,
			"surah": 29,
			"ayat": 8,
			"tafsir": "God commands humans to do good to their parents (mother and father). The way to do good is to provide a living (shopping), maintain and respect both of them with great affection, except when both of them invite to shirk. So, the limit of doing good is as long as the things that are ordered do not involve acts that contain elements of shirk. In another verse it is also stated: And your Lord has commanded you not to worship other than Him and to do good to your parents. If one of them or both of them reaches an old age under your care, then never say \"ah\" to both of them and don't yell at both of them, and say good words to both of them. (al-Isra'\/17: 23) Information that is almost the same is also found in the verse: And We command humans to do good to their parents. His mother had conceived him with difficulty, and gave birth to him with difficulty (too). The period from pregnancy to weaning for thirty months, so that when he (the child) has grown up and reaches forty years of age he prays, \"O my Lord, give me instructions so that I can be grateful for Your blessings that You have bestowed on me and on the two my parents and so that I can do good deeds that You are pleased with; and grant me goodness that will flow to my children and grandchildren. Truly I repent to You and truly, I am one of the Muslims.\" (al-Ahqaf\/46: 15) In order to gain a thorough understanding of the meaning in the verse above, one can pay attention to Allah's statement in the verse below: And We command humans (to do good) to their parents. His mother had carried him in a state of increasing weakness, and weaned him at the age of two. Be thankful to Me and to your parents. Only to Me will you return. And if both of them force you to associate with Me with something that you have no knowledge of, then do not obey both of them, and get along well with both of them in this world, and follow the path of those who return to Me. Then only to Me is your return, then I will tell you what you have done. (Luqman\/31: 14-15) Regarding the prohibition of obeying creatures in committing immorality, it is stated in an authentic hadith, namely: One cannot obey creatures (humans) in disobeying God (Khaliq). (Ahmad's history from Ali bin Abi Talib) The meaning of the words \"something you do not know\" in this verse is that there is no knowledge of divine or divine matters. In other words, it is not justified to obey someone, as long as nothing is known about the matter being followed. Therefore, it is not permissible to imitate something that is clearly wrong. Furthermore, it is said that all humans will return to Allah on the Day of Judgment, both those who disbelieve and those who believe, both those who do good to their parents and those who are disobedient. All the good deeds that are done in the world, will be rewarded by Allah, those who do good are rewarded with good, and those who do evil are rewarded with evil as well."
		   },
		   {
			"id": 3349,
			"surah": 29,
			"ayat": 9,
			"tafsir": "Then reaffirmed the position of those who believe and do good and those who always purify their souls. They will be included in the group of pious people, and placed in heaven \"Jannatun na'im\". Allah included them among the righteous as a reward bestowed on anyone who chooses to heed the commands of Allah and His messengers rather than the commands of parents who are disobedient. The reluctance of children to follow the orders of their parents will inevitably lead to turbidity in the relationship between the two parties. For this reason, God promises the child that he will be given a better replacement, that is, he will be included in the group of pious people. As-shalihin here means a group of people who are very devoted to Allah and who join the group of prophets and others, as mentioned in the word of Allah in surahh an-Nisa'\/4: 69: And whoever obeys Allah and Apostles (Muhammad), then they will be with people who are favored by Allah, (namely) the prophets, lovers of truth, people who died martyrs and pious people. They are the best friends. (an-Nisa'\/4: 69)"
		   },
		   {
			"id": 3350,
			"surah": 29,
			"ayat": 10,
			"tafsir": "According to history, these verses were revealed in connection with an incident that happened to a person named 'Ayyasy bin Abi Rabi'ah where at first he had converted to Islam and then emigrated to Medina. However, because of his Islam, he experienced various kinds of torture. Unable to bear it any longer, he returned to apostasy and returned to being a polytheist. The people who tortured him were Quraysh infidel figures named Abu Jahal and al-harith. Both are his own uncle (his mother's younger brother). Finally 'Ayyasy converted to Islam again and became a good Muslim. This verse describes the condition of a person who claims to have faith in Allah and makes a vow with his tongue about His oneness. However, if he is slandered or tortured by polytheists who are not happy with his Islam, he considers that slander in the form of trials and torments from other people is tantamount to punishment from God in the hereafter. Therefore, instead of experiencing constant torment, it is better for him to return to the religion of idols (apostasy). In fact, if he really has faith, of course he is patient with these trials, and reassures his heart with the faith nestled in his chest. However, these trials actually turned his heart away from believing in Allah, just as Allah's punishment turns someone away from disbelief. He thought that human torment could not be avoided, while Allah's punishment in the hereafter could have been avoided. In another verse it is mentioned again: And among humans there are those who worship Allah only in the margins; so if he gains merit, he is content, and if some trial befalls him, he turns back. He loses in this world and in the hereafter. That's a real loss. (al-hajj\/22: 11) If Allah's help is brought to believers who are struggling, then those groups who are still in doubt about the truth of Islam pretend to be good friends and say, \"We are always with you as brothers and sisters.\" brethren, and we will help you against your enemies.\" What they said was nothing but mere words of their mouths. For they have lied about what they were accused of. The description of another verse confirms: (ie) people who are waiting for (events) to happen to you. When you get victory from Allah they say, \"Didn't we (participate in the fight) with you?\" And if the disbelievers get a share, they say, \"Didn't we also win you, and defend you from the believers?\" So Allah will judge between you on the Day of Resurrection. Allah will not give way to disbelievers to defeat believers. (an-Nisa'\/4: 141)"
		   },
		   {
			"id": 3351,
			"surah": 29,
			"ayat": 11,
			"tafsir": "Allah warns against the attitude of such people and confirms that He knows everything that is etched in their hearts. Nothing is hidden in the slightest. In short, these hypocrites have been known by Allah how their true heart is even though they always declare their faith. God could not possibly deceive them in this way. This slander in the form of trials and torments is nothing but to set aside those who believe, who have really pure beliefs and who are also hypocritical in spirit. A person who has true faith will obey Allah in all circumstances and situations. Those who are steadfast and patient in facing suffering will receive victory and a worthy reward from Allah. On the other hand, the hypocrites will again disobey Him when they are being overcome by trials or when they feel the burdens and obligations they carry are so heavy that their hearts cannot bear to do them. Further information can be seen in verse 12 of this surah, and in the verse: Allah will not allow those who believe as you are in this situation, so that He distinguishes the bad from the good. Allah will not show you things that are unseen, but Allah chooses whom He wills among His messengers. Therefore, believe in Allah and His messengers. If you have faith and are pious, you will receive a great reward. (ali 'Imran\/3:179)"
		   },
		   {
			"id": 3352,
			"surah": 29,
			"ayat": 12,
			"tafsir": "According to Mujahid, this verse was revealed to reveal the efforts of the Quraysh to persuade their people who have believed by saying, \"We and you will not be resurrected. Therefore, follow our steps. If you sin because of this work, we are the ones to bear that sin.\" In this regard, Allah warns the believers that the disbelievers are liars. Because on the Day of Judgment, no one is allowed to bear the sins of others. Allah confirms: And a person who sins will not bear the sins of others. And if someone who is heavily burdened by his sins calls (another person) to carry his burden, nothing will be borne even if (the one he calls is) his relatives. (Fathir\/35: 18) And the word of Allah: While they see each other. On that day, the sinner wishes that he could redeem (himself) from the punishment with his children. (al-Ma'arij\/70: 11) At the end of this verse, Allah reaffirms that they are liars. Imam az-Zamakhsyari interpreted that among those who invited their colleagues to sin there were also people who claimed to be Muslims. They promise to endure his torments so that the ignorant and weak in faith are seduced by his subtle persuasions and seductions."
		   },
		   {
			"id": 3353,
			"surah": 29,
			"ayat": 13,
			"tafsir": "Against the solicitations and persuasions of those disbelievers, Allah confirms that there is no use for them these seductions. The persuasion is conveyed in an effort to invite others to disbelief and misguidance which they must bear for their sins and those who do it because of their persuasion. However, the person who does it himself will not be less sinful even if the one who invites him first is multiplied by his torment. In this verse it is reiterated: (Their words) cause them on the Day of Resurrection to bear their own sins perfectly, and some of the sins of those they misled who do not know in the least (that they are being led astray). Remember, how bad (sin) they bear it. (an-Nahl\/16: 25) In a hadith narrated by Muslim from Abu Hurairah, the Messenger of Allah said: Whoever invites someone to guidance (God), he will get as much reward as the one who practices the guidance without the slightest deduction his reward (until the Last Hour), and whoever pushes someone to go astray, he will have as much sin as the sins of those who follow the error (until the Day of Judgment) without reducing their sins in the least. (Muslim history from Abu Hurairah). At the end of this verse, Allah confirms that in the future they will be held accountable for the lies they have committed in this world. He was asked contemptuous questions about those whom they had deceived with his lies, so that they had gone astray."
		   },
		   {
			"id": 3354,
			"surah": 29,
			"ayat": 14,
			"tafsir": "The story of the prophets begins by telling the story of Noah's struggle. He is the father of the prophets. He preached calling his people to believe in God Almighty and believe in his apostleship for nine hundred and fifty years. Nevertheless, he never felt tired of inviting them, day or night. Sometimes with a soft voice, but often with a loud voice God's threats against their disbelief. However, his efforts were not successful. Only a handful of them who want to believe. The rest rejected and belied him. Therefore, Allah tormented them. Torture was sent which is called \"Typhoon of Prophet Noah\", namely in the form of a flood that drowned them all. No one survived from Allah's torment except the believers who participated in Noah's ark. Al-hakim narrated: It was narrated from Ibn 'Abbas that he said, \"Allah sent Prophet Noah when he was 40 years old and preached to his people for 950 years calling them to follow Allah's religion and Prophet Noah lived after the flood (typhoon) for 60 years, so the number of people became many and scattered.(History of al-hakim)"
		   },
		   {
			"id": 3355,
			"surah": 29,
			"ayat": 15,
			"tafsir": "Allah saved Noah and his followers with a boat he had made. The existence of Noah's Ark became an example and teaching for people afterwards, because he was stranded still intact on a hill called Bukit Judi. Prophet Noah's boat until some time can still be witnessed by people who visit there in one piece. This makes people aware of God's grace that He sent down to believers by saving them from the danger of flooding. This is stated in another verse which reads: Indeed, when the water rises (up to the mountain), We bring your (ancestors) into the ship. So that We may make it (the event) as a warning for you and to be noticed by ears that are willing to hear. (al-haqqah\/69: 11-12) The lesson to be learned from the story above is that the apostles after Noah did not need to feel sad because their people refused to accept the truth of the revelation they brought. The torment and obstruction of unbelievers and polytheists who are displeased with Islam is a warning to believers that even if the polytheists torment and harm them in this world, in the end everything will return to God. The polytheists return to meet calamity and misery in a burning hell, while those who are faithful and patient in facing suffering return to a glorious place with the full help of Allah. Such is the lesson from the story of Prophet Noah. The disbelievers who had been hurting Noah and his people were eventually drowned by God in a flood, but the believers and Noah survived, sailing on a ship. Noah's patience in preaching for a long time should be a lesson for every preacher. In fact, those of us who are older should have a sense of patience from Noah, because our age and age of preaching is not as long as Prophet Noah's age."
		   },
		   {
			"id": 3356,
			"surah": 29,
			"ayat": 16,
			"tafsir": "Allah ordered the Prophet Muhammad to tell his people the story of the Prophet Abraham. After becoming an adult, having perfect growth in his mind, being able to think and analyze things objectively, and having been enabled to achieve the perfect degree of prophethood, Abraham began to devote his attention to calling people to accept the truth he brought. He invites them to unite Allah in worship and rid themselves of all forms of polytheism. He also called on them to sincerely serve Allah both when alone or in front of a crowd, and to stay away from Allah's wrath by carrying out all the duties and obligations that He ordered, and to stay away from all His prohibitions. All of these were God's commands that Abraham had to convey to his people. What was conveyed was best if they had a little knowledge. With that knowledge they can distinguish between good and bad, and how to seek or obtain as much benefit as possible for this world and the hereafter. Then Abraham showed them the tribulations that befall those who seek gods other than Allah."
		   },
		   {
			"id": 3357,
			"surah": 29,
			"ayat": 17,
			"tafsir": "In this verse, Allah emphasizes that gods other than Him are clearly the creations of human hands themselves, but they lie by considering them to be true gods. They think that their creations in the form of statues and idols can benefit them. Ibrahim denounced and condemned their opinion because the statues were not able to provide them with sustenance in the slightest. Fortune is absolute authority that only belongs to God. Therefore, it is recommended for them to ask for sustenance and income only from Allah, then be grateful if what is asked has been granted by Him. Only Allah who brings sustenance to humans and all the pleasures of His servants. Humans are encouraged to seek His pleasure by drawing closer to Him. This verse closes with the recitation \"to Him you will be returned\" meaning that humans must prepare to meet Allah by worshiping and giving thanks. Every human being will be held accountable for all their deeds and all the pleasures they receive"
		   },
		   {
			"id": 3358,
			"surah": 29,
			"ayat": 18,
			"tafsir": "Ibrahim again warned his people that if they confirmed what had been conveyed to them, they would surely be happy. On the contrary, they will get harm and misery if they continue to deny the prophet's call as experienced by those before them who denied God's messengers. Among them is what happened to the people of Prophet Noah, Prophet Hud, and Prophet Saleh. All of them have been tormented by Allah because of their disobedience. On the other hand, Allah has saved those who believe and His messengers. This verse ends by emphasizing that the task and mission of the apostle is to convey real truth to mankind. If they wanted to justify or reject it, it would not have any effect on the apostle himself. There is no authority given by Allah to every apostle to force people to believe the call of his da'wah. Whether they want to justify it or continue to deny it is beyond their responsibility."
		   },
		   {
			"id": 3359,
			"surah": 29,
			"ayat": 19,
			"tafsir": "Some scholars view that this verse is addressed to the people of Mecca who do not want to believe in the Prophet. But the majority of commentators are of the opinion that this verse is still a series of warnings from the Prophet Abraham to his people. Here Allah emphasizes that if disbelievers still do not believe in Allah Almighty as conveyed by His messengers, then they are invited to see and think about the process of events themselves from the beginning to the end. God created humans from the process in the mother's womb for six or nine months, or more. After birth, humans are equipped with the ability to hear, see, and reason. To guarantee his life, Allah facilitates the sources of sustenance to support the preservation of his life. When destiny comes, Allah passes it off through an assigned angel. For God to resurrect people is as easy as it was to create them. Allah confirms in another verse: And it is He who begins creation, then repeats it again, and that is easier for Him. He has the nature of the Most High in the heavens and on earth. And He is the Most Mighty, the Most Wise. (ar-Rum\/30: 127) Strictly speaking, this verse warns that humans should be able to understand how easy it was for Allah to create humans. However, why do they not believe in the existence of the Resurrection when it is actually easier for Allah?"
		   },
		   {
			"id": 3360,
			"surah": 29,
			"ayat": 20,
			"tafsir": "If humans still don't understand what the verse above means, Allah recommends that they walk to visit other places while paying attention and thinking about how powerful Allah is in creating His creatures. Humans are also commanded to pay attention to the arrangement of the heavens and the earth, as well as the millions of shining stars. Some of them remain in position, but rotate in their orbits. Likewise the mountains and vast lands that God created as a place to live. Various kinds of plants and fruits, rivers and seas that stretch wide. Everything when contemplated will make someone aware of how Almighty Allah is the Creator of all that. So should we not believe that to turn on and off a weak human self is a very easy thing for God? Likewise, to revive in living the second life (the hereafter) is also a problem that is not difficult for Allah. In another verse Allah explains again: We will show them our signs (greatness) in all directions and in themselves, so that it is clear to them that the Qur'an is true. Is it not sufficient (for you) that your Lord bears witness over all things? (Fussilat\/41: 53) Likewise we find a verse that reads: Thus Allah, your Lord, Creator of all things, there is no god but Him; then how can you be turned away? (al-Mu'min\/40: 62)"
		   },
		   {
			"id": 3361,
			"surah": 29,
			"ayat": 21,
			"tafsir": "Hearing the advice put forward by the man and seeing his attitude that showed honesty and sincerity, Musa immediately left in a state of constant vigilance, because behind him some of Pharaoh's soldiers were getting ready to surround and arrest him. How much pressure Musa was under. Even so, he still tried to save himself and prayed to Allah, \"O my Lord, the Almighty, the Most Gracious, the Most Merciful, free me from the clutches of the persecuting Pharaoh's people. Allah granted his prayer and showed him the way to Madyan. According to history, Fir 'aun ordered his soldiers to chase Musa down the small roads and forbade them to go through the main roads because he was sure that Musa would not be able to go that way."
		   },
		   {
			"id": 3362,
			"surah": 29,
			"ayat": 22,
			"tafsir": "Nothing beats and rivals the power of God. Allah has power over all His servants. All beings need Him. If someone goes looking for an escape to the high heavens, or hides in the belly of a fish in the sea, he will not be able to escape from the grip of Allah's power. Therefore, no one among humans can find a helper who will deliver him from the punishment and torment of Allah, both in heaven and on earth."
		   },
		   {
			"id": 3363,
			"surah": 29,
			"ayat": 23,
			"tafsir": "After explaining the three main issues in Islam which are part of the pillars of faith, Allah threatens the disbelievers who do not want to justify His statements above that they will not receive Allah's mercy, so they despair. Because they deny the oneness of Allah, deny the apostles who were sent to them, and do not believe in the existence of the Day of Resurrection, it means that they are not afraid of the threat of Allah's punishment and do not expect a good reward from Him. Therefore, it is natural that they are threatened with a painful punishment, in this world and the hereafter."
		   },
		   {
			"id": 3364,
			"surah": 29,
			"ayat": 24,
			"tafsir": "Musa quickly fetched water for the two girls to water their goats. Because of exhaustion, he took shelter under a tree while feeling hungry and thirsty because he had not eaten for several days except for leaves. Moses prayed to Allah because he desperately needed His grace and mercy, to remove the suffering he was experiencing."
		   },
		   {
			"id": 3365,
			"surah": 29,
			"ayat": 25,
			"tafsir": "After being saved, Ibrahim came to his people again with an attitude of criticizing and denouncing the gods they worshiped. \"Actually, you worship these idols for nothing but to maintain affection between your neighbors. You feel intimate and more intimate because you worship them. Even though there is not the slightest reason that can justify this worship,\" said Ibrahim teaching his people. On the other hand, on the Day of Judgment, this affectionate relationship will turn into an atmosphere of mutual accusations and hatred, and even condemnation of each other, both among close friends, and between those who follow (the people) and those who are followed (the leader). There is only one thing they can no longer hope for, namely help from Allah. This will not happen to those who are faithful and pious. Allah says: On that day intimate friends will be enemies with one another, except for those who are pious. (az-Zukhruf\/43: 67)"
		   },
		   {
			"id": 3366,
			"surah": 29,
			"ayat": 26,
			"tafsir": "This verse mentions a servant of God named Lut, Lut bin Haran. He is the son of Prophet Abraham's brother. After witnessing the greatness of God's miracles on the Prophet Abraham (not scorched by fire), he immediately declared his faith. Ibrahim welcomed his first followers with the words, \"I will make the country of Syria the village where I emigrated.\" According to historians, the village that Ibrahim made his emigration to was in the Kufah region, namely Kutsa to the land of Syam. Lut grew stronger in his faith by receiving guidance from Allah, even though he lived in a society that was in ruins, wasted time, and did useless work. If Ibrahim was silent without carrying out his da'wah duties, then this was a sign of disapproval of the wrongdoing that his people had committed. Ibrahim said in his heart, if he stays in his country, it means he is wasting his time in vain. It was for this reason that Ibrahim moved to Syria. Imam al-Baihaqi narrated from Anas bin Malik that among the Muslims (during the time of the Prophet Muhammad) the first to migrate with his family was a friend of Uthman bin 'Affan: Narrated from Anas bin Malik, he said, \"Uthman and his wife Ruqayah bint Rasulullah migrated to the land of Habsyah. Then the Prophet was held back from receiving news about their situation in Habsyah, even though he expected their news. Then there was a woman who told the Prophet about 'Uthman and his daughter, the Prophet then said, 'Uthman was the first person to migrate with his family to Allah after the Prophet Lut.\" (History of ath-thabrani) Based on the hadith above, it is clear that Lut was the first person who was forced to migrate with Abraham in order to save his religion. The reason Ibrahim made the hijrah was because Allah alone had the power to give him help. God who prevents the intention of someone who wants to do evil to him. He is Wise in managing the affairs of His creatures, and all that they strive for. Another reason is because the country of Abraham is no longer conducive to maintaining the faith of its followers."
		   },
		   {
			"id": 3367,
			"surah": 29,
			"ayat": 27,
			"tafsir": "In this verse, Allah tells of some of the favors that Allah has bestowed on Abraham in this world and the hereafter as a reward for his sincerity in doing good deeds. The favors of these gifts include: a. Ibrahim was blessed with a son named Isaac. Isaac later had a son named Jacob. Both of them were appointed prophets, Allah said: So when he (Ibrahim) had distanced himself from them and from what they worshiped besides Allah, We bestowed upon him Isaac and Jacob. And each of us appointed a prophet. (Maryam\/19: 49) In another verse it is also explained: And We bestowed upon him (Ibrahim) Isaac and Jacob, as a gift. And We made each one righteous. (al-Anbiya'\/21: 72) The elevation of the degrees of Ibrahim, Isaac, and Jacob was also emphasized by the Prophet in his words: Indeed, people who are said to be noble are children of noble people, children of noble people, children of noble people , namely Yusuf son of Jacob son of Ishak son of Ibrahim. (History of al-Bukhari and Muslim from Abu Hurairah) b. From the lineage of the descendants of Abraham, people were born who received the degree of prophecy (prophecy) by obtaining revelation. From his son Isaac was born Jacob, Yusuf, and Isa and from Ismail was born the Prophet Muhammad. c. Bestowed on Abraham the reward in the world. The interpreters explain the meaning of \"reward in the world\" here, namely the descendants of many who changed the beliefs of their followers from a misguided nation to a nation that received guidance. From among his descendants, many who obtained the degree of prophethood. Ibrahim's name is mentioned in congratulations when praying, and his name is known as the \"father of the prophets\", where before he was a man who was not very well known. This is emphasized by Allah in the verse which reads: They say, \"Who did this (deed) against our gods? Indeed, he is one of the wrongdoers.\" They (the others) said, \"We heard that there was a young man who denounced (these idols), his name was Ibrahim.\" (al-Anbiya'\/21: 59-60) Prophet Ibrahim was the only prophet who received the title \"Khalilullah\" (beloved of Allah). d. On the Day of Judgment, Ibrahim is included in the ranks of the righteous. The meaning is perfected for him the reward of goodness and piety. Also enhanced reward by providing various advantages. Moreover, he gained victory by attaining several high degrees with the Lord of the worlds. In short, Allah has bestowed upon Ibrahim various kinds of happiness in this world and the hereafter."
		   },
		   {
			"id": 3368,
			"surah": 29,
			"ayat": 28,
			"tafsir": "Allah told Prophet Muhammad to tell the story of Prophet Lut. He was sent to a people who lived in the land of Sodom. Lot himself dwelt in the land. One of the daughters of the people he married, so that Lut had a great relationship with them. Lut firmly told his people that what they had been doing so far was seen as an act called fahisyah (an evil and despicable act). The term sodomy that is popular today comes from the name of the city where Lut's people committed this despicable act. What they did had never been done by the people before as explained in the next verse about what type of deed they were doing."
		   },
		   {
			"id": 3369,
			"surah": 29,
			"ayat": 29,
			"tafsir": "Lut people like to vent their desires on fellow men. This habit is clearly contrary to the goals of ordinary human biological needs. Normal sexual desire actually stimulates men to vent their lust for women. This act was highly reproached by Lut and he advised his people to abandon this cursed act. The inhabitants of the city of Sodom also loved to commit robbery and murder on the roads traveled by caravans carrying merchandise. Their belongings were confiscated, then their owners were killed. In addition, their words and actions in gathering places are disgusting, damaging the foundations of noble character and morals and a sound mind. The Messenger of Allah said: It was narrated from Umm Hani bint Abu Talib, who asked the Messenger of Allah, \"O Messenger of Allah, what do you think about the meaning of the verse \"You do evil in the places where you meet\" (al-'Ankabut\/29: 29), what evil do they do? do it?\" He explained that they enjoy taunting passers-by on the street and insulting them. (History of al-hakim) Lut did not stay silent to see the imbalances that occurred in the community of his people. He tried to prevent it by giving valuable advice and teachings. However, they underestimate all of this and they never pay attention to it. When Lut threatened his people that Allah would punish them if they did not change their heinous behavior, they even challenged them. If it was true that God was going to bring His torment, they challenged Lot to ask God to bring down the torment that was promised right away. \"We will prove how far your words are true, O Lut,\" they said firmly. Because of deep hatred, they expelled Lut from their land. Because there is no use for holy people like him to live with them. Allah explained: And the answer of his people was nothing but saying, \"Expel them (Lut and his followers) from your country, they are people who consider themselves holy.\" (al-A'raf\/7: 82) The people of Lut challenged them to bring doom. Prophet Lut finally begged Allah to help him. The verse above illustrates how hard their attitude of disbelief and stubbornness was, to the point that they had the heart to expel God's messenger from his own country."
		   },
		   {
			"id": 3370,
			"surah": 29,
			"ayat": 30,
			"tafsir": "Lut then came to the conclusion that it was no longer possible for his people to accept his call. He no longer hopes that his people will get guidance from Allah. At that time, Lut prayed to God to help him deal with and eradicate evil and rotten deeds that had become ingrained in the lives of his people, and had become a culture that had been passed down for generations. They saw Lut's threats as mere bluffs. Therefore, God truly answered Lut's prayer. Allah then sent them raining stones from the sky so that they all perished. This is due to their wickedness and disbelief."
		   },
		   {
			"id": 3371,
			"surah": 29,
			"ayat": 31,
			"tafsir": "In this verse, Allah explains about the arrival of an angel who met the Prophet Abraham. They gave the good news that God would give him a son named Isaac. Later the son will be appointed as a prophet and apostle to replace Abraham's duties and positions. Then he was told that the land of Sodom would be destroyed in order to punish the people who belied Lut and committed injustice."
		   },
		   {
			"id": 3372,
			"surah": 29,
			"ayat": 32,
			"tafsir": "Ibrahim was worried and worried about Lut's fate, because Lut might be destroyed with them. Therefore, he reminded this to those who were assigned by God. Ibrahim said, \"O angels, there is a messenger of Allah named Lut. He is not one of those who wronged him, he is even an apostle who believes and obeys Him.\" The angel replied, \"Yes, we have understood it, and Lut is not one of those evil people. However, his wife is one of those who will still be tortured, because she helped justify Lut's people for their disbelief, tyranny, and abominable deeds."
		   },
		   {
			"id": 3373,
			"surah": 29,
			"ayat": 33,
			"tafsir": "When the angel came to meet Lut and conveyed the purpose of his arrival, Lut became panicked and short of breath. Because, he was worried that the people of Sodom would bother him later if he found out that there was such a noble guest. Therefore, the arrival of the angel was deliberately kept secret. Lut could not resist their arrival. After seeing Lut's fear and anxiety over the arrival of his people, the angels reassured him by saying, \"O Lut, be calm, don't be upset. You don't have to worry about our safety and what your people have done to us. Because their evil deeds have reached peak and you have given enough advice to them.\" To reassure Lut's feelings, the angel also said, \"We will save you from the torment that will be passed on to your people in the near future, as well as your faithful and loyal followers. You can't help it, they will definitely experience severe torment. And your wife including those who will be punished. Lut's wife knew that a male guest was staying at her house, so she immediately informed her colleagues about it. Therefore, news spread quickly that Lut's house had an unknown visitor. Immediately there was an evil intention in their hearts to disturb the guest. They then negotiated and agreed to make a plan so they could carry out that intention. Thus, it became clear that Lut's wife was one of the people involved in the plot. The above description of the angel calmed Lut's feelings of fear. He was reminded again, \"We angels will surely bring torment to them with our own hands, due to the ungodliness that has been ingrained in them.\" The popular opinion states that at first there was a violent shock, and the land where the rebellious man lived became upside down. After being hit by hailstones and violent earthquakes, the land was turned into ruins and leveled to the earth. Finally the land of Sodom, the former residence of Prophet Lut's people, became a dead sea (al-Bahrul Mayit)."
		   },
		   {
			"id": 3374,
			"surah": 29,
			"ayat": 34,
			"tafsir": "When the angel came to meet Lut and conveyed the purpose of his arrival, Lut became panicked and short of breath. Because, he was worried that the people of Sodom would bother him later if he found out that there was such a noble guest. Therefore, the arrival of the angel was deliberately kept secret. Lut could not resist their arrival. After seeing Lut's fear and anxiety over the arrival of his people, the angels reassured him by saying, \"O Lut, be calm, don't be upset. You don't have to worry about our safety and what your people have done to us. Because their evil deeds have reached peak and you have given enough advice to them.\" To reassure Lut's feelings, the angel also said, \"We will save you from the torment that will be passed on to your people in the near future, as well as your faithful and loyal followers. You can't help it, they will definitely experience severe torment. And your wife including those who will be punished. Lut's wife knew that a male guest was staying at her house, so she immediately informed her colleagues about it. Therefore, news spread quickly that Lut's house had an unknown visitor. Immediately there was an evil intention in their hearts to disturb the guest. They then negotiated and agreed to make a plan so they could carry out that intention. Thus, it became clear that Lut's wife was one of the people involved in the plot. The above description of the angel calmed Lut's feelings of fear. He was reminded again, \"We angels will surely bring torment to them with our own hands, due to the ungodliness that has been ingrained in them.\" The popular opinion states that at first there was a violent shock, and the land where the rebellious man lived became upside down. After being hit by hailstones and violent earthquakes, the land was turned into ruins and leveled to the earth. Finally the land of Sodom, the former residence of Prophet Lut's people, became a dead sea (al-Bahrul Mayit)."
		   },
		   {
			"id": 3375,
			"surah": 29,
			"ayat": 35,
			"tafsir": "Then it was explained that in addition to punishing the mistakes that had been committed by Lut's people, the punishment and reinforcements were also passed down, it was hoped that they would serve as a warning for generations to come after, namely people who used their minds and wanted to learn a lesson from what had happened."
		   },
		   {
			"id": 3376,
			"surah": 29,
			"ayat": 36,
			"tafsir": "Allah sent the Prophet Shuaib to the people who live in the land of Madyan, so that they worship Allah Almighty sincerely. This worship will be useful for the happiness of life in this world and in the hereafter. In this verse it says \"expect (reward) the last day\", meaning you should be afraid of the coming of that day and prepare yourself with as many good deeds as possible to face it. In addition to calling for worshiping God Almighty, and increasing charity for supplies in the afterlife village, Syuaib also recommends abandoning all actions that are destructive and destructive. Do not harm each other among human beings, such as reducing measures and weights, and robbing past caravans. Then they are also ordered to multiply repentance to God while returning to Him by doing His commands and staying away from His prohibitions."
		   },
		   {
			"id": 3377,
			"surah": 29,
			"ayat": 37,
			"tafsir": "However, like the people of Prophet Lut, the people of Prophet Shuaib were disobedient and did not want to accept Prophet Shuaib's advice. They even belied him. Therefore, apply the sunnah of Allah. When they openly denied Shuaib after being warned repeatedly, then the time came for Allah to punish them. The earth where they live was shaken by an earthquake that shook and destroyed their land. They died upside down and swallowed up by the earth, without moving again. A more complete story about the Prophet Shuaib has also been mentioned by God in other verses, namely in surahh Al-A'raf\/7: 88-93, Hud\/11: 87-94, and asy-Syu'ara'\/26: 176-190."
		   },
		   {
			"id": 3378,
			"surah": 29,
			"ayat": 38,
			"tafsir": "However, like the people of Prophet Lut, the people of Prophet Shuaib were disobedient and did not want to accept Prophet Shuaib's advice. They even belied him. Therefore, apply the sunnah of Allah. When they openly denied Shuaib after being warned repeatedly, then the time came for Allah to punish them. The earth where they live was shaken by an earthquake that shook and destroyed their land. They died upside down and swallowed up by the earth, without moving again. A more complete story about the Prophet Shuaib has also been mentioned by God in other verses, namely in surahh Al-A'raf\/7: 88-93, Hud\/11: 87-94, and asy-Syu'ara'\/26: 176-190."
		   },
		   {
			"id": 3379,
			"surah": 29,
			"ayat": 39,
			"tafsir": "Musa had explained to Karun, Pharaoh, and Haman the signs of Allah's verses as a basis for strengthening the message he was carrying. However, they are arrogant or arrogant and do not want to believe. Pharaoh's arrogance really has exceeded the limit. He regards himself as a god to be worshipped. Therefore, they are all inseparable from Allah's punishment in various torments."
		   },
		   {
			"id": 3380,
			"surah": 29,
			"ayat": 40,
			"tafsir": "Allah destroyed the previous people who belied the apostles by sending down various punishments, including: a. The wind was very strong and brought stones, which were brought to the people of 'Ad. They challenged Prophet Hud, \"Who is stronger and more powerful than us?\" God rewarded their arrogance by bringing the wind, so that they died in abundance. Allah says in another verse which explains about the torment, namely: As for the people of 'Ad, they were destroyed by a very cold hurricane, Allah brought the wind on them for seven nights and eight days continuously; then you saw the people of 'Ad at that time dead lying like empty (rotted) palm tree trunks. So did you see anyone who was still left among them? (al-haqqah\/69: 6-8) b. A thunderous sound that pierces the ears. This torment was passed down to the Samud people. They still disobeyed, did not want to believe in Prophet Saleh. Suddenly they were stunned and then died by the shock of a terrible thunder. Allah explained again: So as for the Samud people, they were destroyed with a very loud voice. (al-haqqah\/69: 5) c. Swallowed by the earth, this is the story of Karun, a wealthy man. In the beginning, he was a believer and obedient to Moses. Then after being rich, he became arrogant and rebellious. He commits evil beyond measure. More than that, he did not want to hand over zakat as a property obligation for the rich. Because of this arrogance, Allah tormented him. The ground around Karun's feet shook, collapsed, and gradually engulfed Karun's body until it completely disappeared from the earth's surface. Allah's Word: So We buried him (Karun) with his house into the earth. So there is no group for him who will help him other than Allah, and he is not one of those who can defend themselves. (al-Qasas\/28: 81) d. Sink into the water. This is the torture for Noah's people along with all their wealth. Apart from Noah's people, Pharaoh, Haman and his army also drowned in the Red Sea as retribution for their arrogance and the torment they inflicted on Musa and his followers. God's Word about Noah in surahh al-Anbiya'\/21: 76-77: And (remember the story) Noah, before that, when he prayed. We allowed (praying) him, then We saved him and his followers from a great calamity. And We helped him from those who denied Our signs. Verily they were evil people, so We drowned them all. (al-Anbiya'\/21: 76-77) God's Word about Pharaoh in surahh al-Qasas\/28: 39-40: And he (Pharaoh) and his army acted arrogantly, on earth without a just reason, and they thought that they would not be returned to Us. So We punished him (Pharaoh) and his army, then We threw them into the sea. So see how the end of the wrongdoers. All of that is a proper recompense for the mistakes they have made, not tyranny from Allah. He will not torture anyone except those who do despicable deeds. To punish someone without any fault is not in accordance with the prevailing Sunnah of Allah. Those mentioned in the previous verses were tortured because of their sin and disbelief towards Allah. In addition, also because they worship idols and deny the favors given to them."
		   },
		   {
			"id": 3381,
			"surah": 29,
			"ayat": 41,
			"tafsir": "The idol worshipers who look to anyone other than Allah as their helper and always look to him for help and averting harm, are like a spider that takes refuge in a web that is so weak that it cannot withstand the wind and protects it from cold and heat. The nest cannot fulfill its main needs when it is needed. That is the case with the disbelievers (musyrik). They could not save themselves if Allah brought His punishment. Their protector (apart from Allah) will not be able to provide any help. In fact, they themselves cannot avoid them from Allah's punishment. In short, a polytheist who worships idols is like a spider making a web, very fragile and weak. The cobweb is like a building that is very fragile. Likewise, a very weak religion is a religion that worships idols"
		   },
		   {
			"id": 3382,
			"surah": 29,
			"ayat": 42,
			"tafsir": "Allah is All-Knowing about what they ask of idols, statues, jinns, even humans. Everything will not be able to benefit or bring harm to someone if Allah does not will. So weak is what they worship that it is the same as spiders that are only able to build a very fragile house. Allah has the power to punish those who disbelieve. Therefore, polytheists should fear Allah, and immediately believe in Him before His punishment comes, as He sent to people long ago. When Allah's torment comes, none of their helpers (idols) can save them. Allah is always mighty to destroy those who should be destroyed, and All-Wise to resign the torment for those who are expected to change towards good and persistently carry out that goodness."
		   },
		   {
			"id": 3383,
			"surah": 29,
			"ayat": 43,
			"tafsir": "Thus Allah parables a parable for mankind. Only intelligent people can think of such parables. Allah deliberately took the spider as a parable, because that is perhaps something that is easy for them to understand. Apart from that, it is also intended to explain all their doubts so far. People who always use their hearts and minds and are experts in science can certainly understand this parable and will know more and more of God's secrets contained in His verses. It was narrated from Jabir that the Messenger of Allah once said: \"A knowledgeable person is one who takes care of the things that are from Allah, and does good deeds in order to obey Him and stay away from all His anger.\" (History of al-Haitsami)"
		   },
		   {
			"id": 3384,
			"surah": 29,
			"ayat": 44,
			"tafsir": "The evidence for the greatness and majesty of Allah can be seen in the creation of the heavens and the earth. For people who believe and use their minds, all of God's creations contain wisdom, and are not made for nothing. Thus the occurrence of the heavens and the earth, allows humans to increase and broaden the horizons of their knowledge. In addition, their introduction will be more intensive to their Creator, namely Allah. According to scientific studies, in creating everything, Allah never plays games. He did it \"correctly\", with truth (among other things, it can also be seen in surahh Ibrahim\/14: 19). The word haq indicates something that is lasting, steady, so that it will not change. It can be seen that the presence of all objects in this universe has a purpose. There is not a single object created by God without having a purpose. This planet earth with its sky (atmosphere), has been created by Allah with truth. This word haq means \"correctly, correctly\". How the truth and accuracy of His creation, can be seen from the following description. The earth's atmosphere mainly consists of Nitrogen gas (70% N2) which is not toxic to humans. This gas is very important in the growth process of living things, especially plants. While the other 20% is filled with oxygen gas (O2) which provides energy for the metabolic processes of all creatures, through the process of breathing (respiration). The distance between the sun and the earth is about 139 million km. This distance is considered appropriate because at this distance sunlight can function to help the ongoing process of life. If the distance changes, whether away or closer, then the effect of light falling on the earth will be very fatal for living things. Earth's temperature at the equator is also considered very moderate, which averages between 28-350C. In the description above it has been described that God created the earth not by playing games. Everything was just so right for the start of life on this earth. How comfortable the earth is compared to several other planets in the same solar system, we can see in the description below. In the comparisons made, especially at the distance between the sun and each planet, it can be seen that the effect of the distance with each planet."
		   },
		   {
			"id": 3385,
			"surah": 29,
			"ayat": 45,
			"tafsir": "This verse instructs the Prophet Muhammad to always read and understand the Al-Qur'an which was revealed to him in order to draw closer to Allah. By understanding the messages of the Qur'an, he can improve and develop himself according to Allah's requirements. This order is also addressed to all Muslims. The appreciation of the divine words that is continuously read will affect the attitude, behavior and character of those who read them. After ordering to read, study, and implement the teachings of the Qur'an, Allah ordered the Muslims to perform the obligatory prayers, namely the five daily prayers. Prayers should be done in accordance with the pillars and conditions, and full of solemnity. It is highly recommended to do the prayer complete with the sunnahs. If done perfectly, the prayer can prevent and hinder those who do it from heinous and unjust acts. Performing prayers is a manifestation of the belief that has been instilled in the heart of the person who does it, and is proof that he believes that he is very dependent on Allah. Therefore, he tried his best to carry out Allah's commands and stay away from His prohibitions, according to the reading of surahh Al-Fatihah in prayer, \"Show us (O Allah) the straight path, that is the path of those who have You have bestowed favors on them; not the way of the wrathful and not the way of those who have gone astray.\" He always remembers this prayer, so that he has no desire to do anything heinous and unjust. Some commentators are of the opinion that it is the prayer itself that protects the person who performs the prayer from heinous and unjust acts. According to them, prayer keeps a person as long as that person maintains his prayer, as Allah says: Take care of all prayers and wustha prayers. And carry out (prayer) for Allah with humility. (al-Baqarah\/2: 238) The Messenger of Allah explained the virtues and benefits that people who pray and the losses and torment that will befall people who don't do them, as stated in the hadith: From the Prophet saw, that he one day mentioned prayer , then he said, \"Whoever keeps the prayer, he will get light, guidance, and safety on the Day of Judgment, and whoever does not keep it, he will not get light, guidance, and safety. And he is on the Day of Judgment with Karun , Pharaoh, Haman, and Ubai bin Khalaf (History of Ahmad and ath-thabrani from 'Abdullah bin 'Umar) The Prophet also explained the condition of people who pray the five daily prayers in earnest, complete with pillars and conditions, staying on appointed times. Such a person, said the Prophet, was as if his sins were washed five times a day, so that nothing was left behind. The Messenger of Allah said: What do you say, if there is a river near the door of one of you's house, he bathes in the river five times every day. Is there still a little bit of his feet left?\" The friends replied, \"Not even a little bit of his feet left.\" The Messenger of Allah said, \"So that is the parable of the five daily prayers, with that prayer Allah will erase all his mistakes.\" (History of the five daily prayers) at-Tirmidhi from Abu Hurairah) Such is the parable given by Rasulullah SAW about the situation of people who pray the five daily prayers earnestly only because of Allah. From the verses and hadiths of the Prophet mentioned above it can be concluded that there are three goals that the people who pray, namely: 1) sincerity arises; 2) the emergence of piety to Allah; and 3) always remember Allah. Prayer should be able to cause sincerity for those who do it because it is done solely because of Allah, to purify obedience only to Him As a manifestation of this sincerity in a person is the emergence of a desire in his heart to work of everything that pleases God. Fearing Allah means that the desire arises for the person who performs the prayer to carry out everything that Allah has commanded and stay away from everything that He has forbidden. By praying someone will also always remember Allah, because in the reading of the prayer there are tasbih, tahmid, and takbir utterances. He can also feel the majesty and greatness of Allah. Allah threatens those who do not pray with the punishment of hell. Allah also threatens those who pray because they are happy and those who are negligent in doing so. Allah says: (4) So woe to those who pray, (5) (namely) those who neglect their prayers, (6) who do joy, (7) and are reluctant (to provide) assistance. (al-Ma'un\/107: 4-7) In line with the verse above, the Messenger of Allah said: Whoever has prayed, but his prayer cannot prevent him from abominable and unjust acts, then his prayer will not increase the slightest (to him), unless he grows further away from Allah. (History of Ibn Jarir from Isma'il bin Muslim bin al-Hasan) Furthermore, this verse explains that the remembrance of Allah is greater. The meaning of this statement is that prayer is the most important worship compared to other worship services. Therefore, let every Muslim do it seriously. In other words, this sentence reaffirms the previous sentence which ordered Muslims to pray and explained the wisdom of doing so. Ibn 'Abbas and Mujahid interpreted the sentence \"wa ladzikrullah Akbar\" (remembrance of Allah is greater) with the Prophet's explanation that Allah remembers His servants more than they remember Him by obeying Him. The Prophet said: Allah remembers you more than you remember Him. (Al-Baihaqi History) This is in accordance with the hadith qudsi Prophet saw: Whoever remembers Me in himself, I will remember it in Myself, and whoever remembers Me together with a congregation I will certainly remember him in better group than them. (Al-Bukhari's history from Abu Hurairah)"
		   },
		   {
			"id": 3386,
			"surah": 29,
			"ayat": 46,
			"tafsir": "In this verse, Allah gave instructions to the Prophet Muhammad and the Muslims regarding the matter of preaching and how to deal with the People of the Book, because most of them did not accept his call. When the Prophet conveyed the teachings of Islam, most of them belied him. Only a very few of them accept it. Even though they already know Muhammad and the teachings he brought, as they know and know their own children. Allah says: Those to whom We have given the Book (Torah and Gospel) know him (Muhammad) as they know their own children. Indeed, some of them must hide the truth, even though they know (it) (al-Baqarah\/2: 146) In another verse, Allah explains and explains the good way of preaching, as He says: Call (people) to the way of your Lord with wisdom and good teaching, and argue with them in a good way. Surely your Lord, He is the one who knows best who has strayed from His way and He knows best who is guided. (an-Nahl\/16: 125) Calling people to God's way with wisdom and wisdom and debating them in a good way is done to people who do not commit injustice. As for those who commit tyranny, namely people whose hearts have been locked in death, do not want to accept the truth anymore, and are trying to eliminate Islam and its people, this cannot be dealt with in the ways above. The unjust People of the Book are those in whose hearts there is a disease of envy, hatred and envy towards the Muslims, because the last messenger and prophet were not appointed from among them. They fought the Messenger of Allah and the Muslims by holding tricks and slander in secret and openly. They always tried to hinder the da'wah carried out by the Prophet and his companions, such as entering into alliance agreements with other unbelievers. There are many examples in history related to this. Therefore, they are called people who are unjust, and try to harm the Muslims. In the afterlife, they will become the losers by receiving a punishment that is commensurahte with their actions. Allah further warns that if the People of the Book invite Muslims to discuss their holy book, and tell them what should be justified and rejected, while they themselves know their situation, then the Muslims should say, \"We believe in the Al-Qur'an which was revealed to us and also believe in the Torah and the Gospel that was sent down to you. The God we and you worship is actually the same, namely God Almighty. Therefore, let us submit and obey Him together and carry out all orders and stop prohibitions -His.\" With regard to the intent of this verse, Abu Hurairah said, \"The People of the Book read the Torah in Hebrew and interpret it in Arabic for Muslims. Then the Prophet said: Do not justify the People of the Book and do not deny them either. Say to they said, \"We believe in what has been revealed to us and what has been revealed to you. Our God and your God are one and we submit ourselves to Him alone. (History of al-Bukhari and an-Nasa'i from Abu Hurairah)"
		   },
		   {
			"id": 3387,
			"surah": 29,
			"ayat": 47,
			"tafsir": "In this verse, Allah explained to the Prophet Muhammad that just as He had sent down the book to the apostles who were sent before, so He also sent down the Qur'an to him. In these books, the arrival of the Prophet Muhammad was hinted at at a later date. This then actually became a reality with the sending of Muhammad saw as the last prophet and messenger. The apostles of Allah were warned to tell their people to believe and follow the apostles who came later. Because, if someone believes in one of the apostles sent by Allah, then he must also believe in the other apostles of Allah, both those who came first and those who came later. Therefore, some of the People of the Book who existed at the time of the Prophet Muhammad believed in him and in the Qur'an, according to the orders of their prophets. They are more concerned with the hereafter than this mortal world, and do not follow lust. Among those who behaved this way were Abdullah bin Salam, Tamim al-Ansari, and others. As for those whose hearts are diseased, such as jealousy because the messenger they are waiting for is not from their group, or deceived by worldly pleasures because they indulge their lusts, they will deny the Qur'an, especially the verses that proclaim apostleship. Mohammed. The people of the People of the Book should heed the calls and instructions of their messengers to worship Allah, and believe that Muhammad is the last messenger and prophet. There was not a single prophet or apostle sent by Allah after him."
		   },
		   {
			"id": 3388,
			"surah": 29,
			"ayat": 48,
			"tafsir": "This verse explains that before the Qur'an was revealed, the Prophet Muhammad was well known to the Arabs. He had lived among them for a long time before being made an apostle. All Arabs at that time acknowledged that Muhammad had high moral character, could be trusted, never lied, and was respected by his friends. They really knew that Muhammad was not good at reading and writing, let alone composing story books. Besides Arabs, Jews and Christians also know from their books that Muhammad was someone who was not good at writing and reading. Mujahid said, \"The People of the Book knew from their books that the Prophet Muhammad was not good at writing and reading, that's why this verse was revealed.\" In another verse, Allah says: (That is) those who followed the Messengers, prophets who were unlettered (ill illiterate) whose (names) they found written in the Torah and the Gospels that were with them, who commanded them to do good and preventing from what is unrighteous, and which makes all that is good lawful for them and prohibits all that is bad for them, and releases the burdens and shackles that are on them. (al-A'raf\/7: 157) Under these circumstances, Allah revealed the Qur'an to Muhammad. It contains a very high value creed and is equipped with convincing evidence. The Qur'an also has a very beautiful style of language, so that no one can match it, even though at that time among the Arabs there were many famous literary poets because the art of literature was at its peak. However, very few of them have faith. If Muhammad saw could read and write, had studied with the People of the Book, or he was not a trusted person, did not have a noble character, and was not someone who was respected, surely the Meccan infidels would easily accuse and say that the Qur'an 'an is made by Muhammad, not Kalamullah. From this verse it can be understood that the hearts and minds of the disbelievers of Mecca, based on their knowledge of the person of Muhammad, and the high literary value of the Qur'an, believed from the beginning on the Qur'an and Muhammad's apostleship. However, because they have a disease in their hearts, and are afraid that their position among their people will fall, they say something that is contrary to their own hearts and minds. The definition of ummi in this verse is not good at writing and reading. This does not mean that Muhammad was not knowledgeable, because Allah had taught him high knowledge, perhaps even knowledge that He had never taught to ordinary people. Thus, he became a pious and wise person. Allah says: And (also because) Allah has sent down the Book (Al-Qur'an) and Wisdom (Sunnah) to you, and has taught you what you did not know. God's gift bestowed on you is very great. (an-Nisa'\/4: 113)"
		   },
		   {
			"id": 3389,
			"surah": 29,
			"ayat": 49,
			"tafsir": "This verse emphasizes that the verses of the Qur'an are the guidance of Allah, there is not the slightest ambiguity about their meaning. Allah makes it easy to interpret it for people who want to seek the ultimate truth. In another verse, Allah says: And indeed, We have made the Qur'an easy for warning, so is there anyone who wants to take lessons? (al-Qamar\/54: 17) The People of the Book who want to seek the truth, can easily understand the Qur'an. Thus, they want to believe in him and believe that Muhammad is really a messenger. Allah told the Prophet Muhammad to say to the disbelievers who did not believe in his apostleship: And the disbelievers said, \"You (Muhammad) are not a Messenger.\" Say, \"Sufficient is Allah and those who are well versed in the knowledge of the Bible to be witnesses between me, Aisha and you. (ar-Ra'd\/13: 43) have read in their books about his coming. Thus, there are among the People of the Book who believe in the Prophet Muhammad, among them the people mentioned above. Allah confirms again that the Qur'an is preserved in the breasts of the Muslims . They memorized it from generation to generation so that no one can change it. Furthermore, this verse explains that no one denies the verses of Allah, except those who are unjust. This verse is a sign for the People of the Book that they have learned from their holy book about Muhammad's prophethood and the revelation of the Qur'an to him. However, many of them denied the truth after knowing it. Allah said: It turned out that when he reached to them what they already know, they deny it. So the curse of Allah be on those who disbelieve. (al-Baqarah\/2: 89) Apart from being a sign for the People of the Book, this verse is also a rebuke from Allah directed at the polytheists of Mecca who denied His verses. They don't believe in the Al-Qur'an and Muhammad's apostleship which has become the real truth. They are called by Allah as unjust people. This unjust character is the most appropriate trait for them because it hides the truth that they already know. Allah says: And who is more unjust than one who conceals the testimony of Allah that is in him? (al-Baqarah\/2: 140)"
		   },
		   {
			"id": 3390,
			"surah": 29,
			"ayat": 50,
			"tafsir": "In this verse, Allah explains that the polytheists demanded that Muhammad show real miracles such as those that had been brought to the previous prophets, for example the Prophet Saleh's she-camel, the staff of the Prophet Musa, and others. Their request was answered by explaining that the issue of miracles is God's provision. It then explains their shortsightedness in rejecting a miracle that is higher in value and suitable for them. They do not understand that the Qur'an is actually an eternal miracle, unmatched by anyone until the Day of Judgment. This verse implies that the Meccan disbelievers denied the Qur'an as a miracle revealed to the Prophet Muhammad. According to them, the Qur'an does not deserve to be used as a miracle, because a miracle should be something real, and can be seen and felt immediately as it was revealed to the previous apostles, such as the typhoon of Noah, the staff of Prophet Musa, and so on. They claim that real miracles are easy on the mind and can inspire confidence in those who see them. Allah ordered the Prophet Muhammad to answer the request of the polytheists of Mecca by saying that the issue of miracles is God's business. He is the one who determines what miracles will be given to an apostle that He sends, because it must be adjusted to the ability level of the people who will witness. Regarding the Quraysh's claim that they could not accept the Qur'an as a miracle, Allah knows their hearts. In fact, their hearts have recognized the miracle of the Qur'an as a miracle, but because of the denial and sickness in their hearts, they do not want to say that. If they really will believe in the reduction of miracles according to their request, surely Allah will send them down. Nothing is difficult for Allah, everything is easy for Him. Allah says: And there is nothing that prevents Us from sending (to you) signs (Our power), except because (signs) have been denied by the former. (al-Isra'\/17: 59) After the request of the strange polytheists was answered, Allah ordered the Prophet Muhammad to convey to them that he was just giving a warning to people who did not heed it. His job is just to convey the treatise to them. He could not turn them into believers. Only God can do that. Allah says: Whoever is guided by Allah, then he is the one who gets the guidance; and whoever He leads astray, then you will not find a helper who can guide him. (al-Kahf\/18: 17) Another word of Allah: It is not your (Muhammad) obligation to guide them, but it is Allah who guides whom He wills. (al-Baqarah\/2: 272)"
		   },
		   {
			"id": 3391,
			"surah": 29,
			"ayat": 51,
			"tafsir": "Ad-Darimi and Abu Dawud narrated that a group of Muslims had come to the Prophet Muhammad with stories they had written themselves, some of which were sourced from the Jews. The Prophet saw said, \"It is enough ignorance and misguidance for a people who reject what their prophet brought, and want something brought by a prophet who is not their prophet for someone else. Then this verse was sent down by Allah. This verse is also a response that rejects the claim the polytheists of Mecca who asked for a real miracle. Even though the Qur'an had been recited to them. Was it not sufficient for them the arguments explaining the proofs of Muhammad's apostleship, contained in the earlier holy books? , while they themselves do not know for sure. Does it not occur to them that a person who is not good at writing and reading, and has never socialized or studied with the People of the Book, is able to convey the Qur'an to them with true, noble and noble contents and with such a high literary value. If they want to think and want the truth, the Al-Qur'an alone is actually enough evidence for them to to justify Muhammad's apostleship. Then Allah explains the virtues and strengths of the Qur'an by saying that its verses are a mercy for them, because there are no threats in it, as was ever given to the previous people. Because they also denied it, they should have experienced what the ancients who had denied His messengers, such as the 'Ad, Samud, Pharaohs, and others had experienced. The absence of the threat of annihilation for the polytheists in the Qur'an is a great mercy from Allah for the people of Muhammad who came later. It is also explained that the verses of the Al-Qur'an are lessons for believers. The point is that the verses of the Al-Qur'an explain the events experienced by ancient peoples, and how their attitude towards the apostles who were sent to explain the strong and complete proofs of the oneness of Allah. The Qur'an also explains the noble character that a good human being must have, explains laws and instructions for achieving happiness in life, contains knowledge that is very useful for humans, and so on. If polytheists and other humans wanted to take these verses as a lesson, think about and practice them, surely they would get the right path, and be happy in this world and in the hereafter. However, if they do not want and do not intend to get rid of the disease that is in their hearts, they will certainly be losers in this world and the hereafter."
		   },
		   {
			"id": 3392,
			"surah": 29,
			"ayat": 52,
			"tafsir": "In this verse, Allah commands the Prophet Muhammad to convey to the polytheists who still do not believe in his apostleship that Allah knows and witnesses how he has carried out his duties to them. He had delivered threats and glad tidings to them, but they had denied them. Allah knows their attitude towards the Prophet's call, even knows what is in their hearts. He will reward every thing that is done by His creatures. If the Prophet Muhammad lied and fabricated lies against Allah, he would surely be punished. Allah said: And if he (Muhammad) concocted some words on Our (name), We would surely hold him in his right hand. Then We cut his heart vessels. So none of you can prevent (We are to punish him). (al-haqqah\/69: 44-47) Allah explains that He knows everything in the heavens and on earth. He knows the condition of His creatures from the subtle and invisible to the eye to the great. He also knows the condition of polytheists and believers. He was also aware of the accusations of polytheists that the Qur'an was made by Muhammad, even though none of them could match it. Those who believe in falsehood and deny Allah are the ones who lose their lives in this world and the hereafter."
		   },
		   {
			"id": 3393,
			"surah": 29,
			"ayat": 53,
			"tafsir": "This verse explains that the polytheists already know God's threat in the form of punishment that will befall them. However, they did not believe in the coming of the doom, so they challenged that if there was a doom, then it should befall them immediately, as they say in the word of Allah: So rain stones from the sky, or bring us a painful doom. (al-Anfal\/8: 32) Allah's Word: And they said, \"When (the) threat, if you are truthful?\" (Yunus\/10: 48) Allah explains that the provisions for the coming of doom are entirely in His hands, no one can know about it. Allah has determined to postpone the doom until the time He has determined. If Allah had set a time to bring doom, surely he would come to the polytheists suddenly, when they were negligent and did not realize it. Of course, there is wisdom and purpose to the postponement of the punishment for the disbelievers. Among them is as a test for humans, which of them is patient and who is not. For those who are patient, the test will strengthen their faith. While people who are impatient, then with that test he will return to disbelief or increase in disbelief. Allah's Word: And indeed, We will really test you so that We know those who really strive and are patient among you; and we will test you. (Muhammad\/47: 31) Sometimes the suspension of punishment aims to increase the denial of the person who disobeys. Thus, they will be overwritten double punishment. Allah says: Those who disbelieve and hinder (people) from the path of Allah, We add to them torment after torment because they always do mischief. (an-Nahl\/16: 88) Actually there was a doom that had befallen the polytheists of Mecca, but they did not realize it was God's punishment, namely their defeat at the battle of Badr. At that time, they saw and felt how Allah had inflicted punishment on them. However, Allah did not destroy all the disbelievers in that war, as happened with the ancient peoples. Some of the commentators are of the opinion that Allah purposely did not destroy all of the disbelievers because some of them still hoped for their faith after the war. It is hoped that they will become experienced Islamic soldiers to carry the banners of Islam, then be continued by their descendants from one generation to the next, until the time determined by Allah. Everything happened according to God's plan and wisdom that no one but Him knows."
		   },
		   {
			"id": 3394,
			"surah": 29,
			"ayat": 54,
			"tafsir": "This verse explains the consequences that will be experienced by polytheists because of their ignorance and stupidity. They will be put into hell whose fire burns the whole body. This verse is a strong warning to disbelievers by explaining the punishment that will befall them in the hereafter. This is due to their demand that the doom comes hastily."
		   },
		   {
			"id": 3395,
			"surah": 29,
			"ayat": 55,
			"tafsir": "This verse explains how the fire of hell burns infidels in the hereafter. All parts of their bodies will feel the punishment, from the crown to the tips of the toes, from the visible to the invisible. They will be covered with punishment from all around, from above and below, and from the right and left. In such circumstances, they are told, \"You will feel this day the punishment that was promised, as a result of your past actions.\" In other verses it is explained how the fire of hell covers the disbelievers. Allah says: For them is a sleeping mat from the fire of hell and on them is a blanket (fire of hell). (al-A'raf\/7: 41) His Word also: Above them are layers of fire and underneath there are also layers prepared for them. (az-Zumar\/39: 16)"
		   },
		   {
			"id": 3396,
			"surah": 29,
			"ayat": 56,
			"tafsir": "In this verse, Allah commands His believing servants to leave their homes if they cannot carry out the provisions of their religion there, and live in a state of oppression. This verse contains a universal principle which states that God's earth was created for the benefit of humans. A person may stay wherever he wants if he feels safe there. In this new place, the Muslims will find new brothers and families to replace the relatives and families they left behind, because basically all Muslims are brothers, brothers in faith, in the same destiny and in arms. Another principle contained in this verse is that the religion of Islam instructs its adherents not to be too fanatical about their hometown and place of birth. The homeland must be defended, fostered, and built, as well as the nation must be promoted. However, don't give too much importance to your homeland and your own nation, causing harm to other countries and nations. It is as if Allah reminds us that this universe belongs to Allah and was created for the benefit of humans. Therefore, humans are ordered to use nature according to God's purpose for creating it. Never should anyone claim that something is his absolute possession. Someone's ownership of something is only temporary, and in time that property will be taken by Him again. The phrase in the sentence above also reminds Muslims of the extent and abundance of Allah's possessions, so that they can look far ahead, and not be narrow-minded and limited. This expression reminds Muslims not to only look at their own homes and assume that the earth is only limited to their homes. Such an assumption is wrong. God's earth is wider than they originally thought. If they go out of their own country to explore the countries in this world, of course they will see and gain valuable experience on the way. They will also find spaciousness after narrowness and so on. Allah says: Whoever migrates in the way of Allah, they will surely find on this earth a wide place of migration and abundant sustenance. (an-Nisa'\/4: 100) Then in a hadith, the Messenger of Allah said: All countries are the land of Allah, and all servants are servants of Allah, so wherever you get good (fortune) then reside. (Ahmad's history from az-Zubair bin al-'Awwam) Allah ordered His faithful servants to leave their hometowns, because He guaranteed their lives on the earth where they migrated. Carrying out orders to migrate to leave one's hometown is an order that is very difficult for someone to carry out, because it means he is separated and leaves his family and relatives. He also left the house and yard that he had cared for and nurtured for a long time, as well as his possessions and beloved livestock. He will be separated from the country and everything in it, which so far has seemed to have been united with himself as the body is united with other members of the body. Therefore, Allah conveyed the command to emigrate in a very gentle and subtle tone, as if he had been ordered to them, \"O My servants who have believed in Me, remember that I have created this vast earth for you all. Therefore, use and occupy the earth by you.\" The appeal also illustrates the promise expected by those who emigrated, namely that Allah will repay their deeds because of their obedience in carrying out His call. The reward is in the form of houses that are better than the ones they left behind, and treasures that have more blessings than the ones they left behind. Likewise, their brothers and relatives will be replaced by relatives who are better and nobler than the relatives and relatives they left behind as long as they continue to serve Him and carry out da'wah to humans. The Prophet saw and the Muslims have fulfilled the holy call. They migrated to Allah both individually and in groups. The first time they migrated to Ethiopia (Habsyah).*) There Allah placed them in a glorious place. Then they migrated to Medina, which eventually became the place where the Muslims migrated, especially after the Prophet Muhammad also migrated there. In Medina the Muhajirin (Muslims who came from Mecca) were received with open arms and gladly by the Ansar (indigenous inhabitants of Medina who had converted to Islam), as if the Emigrants were guests they were waiting for. so far. Their houses and property were shared with the newly arrived Muhajirin, who had not brought anything from Mecca. It was even seen that the Ansar had prioritized the Muhajirin over themselves. The relationship between the two groups was so close that the Prophet made the two of them close friends and relatives. Even at the beginning of the migration, the Muhajirin and Ansar groups could inherit from each other. With the arrival of the Muhajirin, the city of Medina became more lively and developed. The city later became the center for fostering an Islamic community, a gathering place for Muslims from all over and eventually became the center of Islamic government. The close relationship between the Muhajirin and Ansar groups is praised by Allah as the relationship that forms the basis for the formation of Islamic society. Allah elevates the position of the Muhajirin because they have sacrificed everything they have, for the sake of Allah's religion, while the Ansar are the helpers of religion. They are willing to spend what they have for the sake of religion. Everything that the Muhajirin people experienced after arriving and settling in Medina and associating with the original inhabitants of Medina, namely the Ansar group, is proof of the truth of Allah's promise to them when they were ordered to migrate to Medina. This verse closes with the words, \"Therefore it is only Him that you worship.\" This sentence means that the earth is vast and belongs to God. Wherever humans are and live, that place belongs to God. Therefore, it is appropriate for humans to unite and devote themselves to Him. The above verse is a samawiyah preaching to humans to free themselves both physically and spiritually from all kinds of attachments and material or spiritual shackles that can interfere with their movements and hinder their freedom. In life everywhere and in any situation, man will not get the freedom, independence, survival and continuity of his essential kind, as God has ordained, if he himself does not make serious efforts towards it. If they try, of course they will get it. Conversely, if they don't try, it means they have wronged themselves and will not get what they want. Da'wah of Islam is to liberate people from oppression and misguidance. Therefore, the Muslims are obliged to wage jihad against this oppression and misguidance by sacrificing their wealth and lives. The jihad that has the highest value and is the most important for a believer is the jihad that is carried out to free oneself from oppression and misguidance, after which the new jihad is continued on other people. A believer must free himself from all oppression that is humiliating and humiliating, so he must eradicate both diseases. Allah says: Indeed, those whose souls are taken by angels in a state of wrongdoing themselves, they (the angels) ask, \"How are you?\" They replied, \"We are the oppressed people in the earth (Mecca).\" They (the angels) asked, \"Isn't Allah's earth wide, so that you can emigrate (move) in the earth?\" So those people's place is in Hellfire, and (Jahanam) is the worst place to return to, (an-Nisa'\/4: 97) In the verse above, Allah promises a very painful punishment in the hereafter to those who despicable and weak because they have demeaned religion and belittled themselves before the disbelievers. They are like merchandise that passes from one hand to another. They are unable to express their will and desires, let alone preach the good way. Therefore, Islamic da'wah is aimed at liberating humans, developing minds, and eliminating all kinds of pressure on the heart and soul, as the da'wah is aimed at maintaining human survival, as creatures created to worship Him."
		   },
		   {
			"id": 3397,
			"surah": 29,
			"ayat": 57,
			"tafsir": "This verse strengthens the previous verse by explaining the nature of human life itself. It is explained that every human being will definitely die and after death, he will return to his owner, namely the Lord of the worlds. Since man is resurrected in the afterlife, he will experience true and eternal life from then on. The actual form of life is determined by one's attitude and actions while living in the world. If he is a believer, then he will get eternal happiness, whereas if he is a disbeliever, he will experience a painful punishment in hell. This verse is in line with verse 185 of surah ali 'Imran and has been explained there, but it is repeated as a warning to Muslims not to be too captivated and fascinated by the life of this temporary world, because all of this is temporary pleasure and will end. The human relationship with all that it has will gradually end. Do not let someone's love for something prevent him from obeying Allah and His Messenger, because something is temporary. While what is eternal is only the result of one's worship and good deeds. With all that, he obtained the pleasure of Allah and the paradise that He promised."
		   },
		   {
			"id": 3398,
			"surah": 29,
			"ayat": 58,
			"tafsir": "This verse explains the rewards that will be obtained by those who believe in Allah, because they have migrated for the sake of His religion. They broke away from those who associated partners with Allah and dared to bear all the risks resulting from that migration. Allah's promise is to reward those who believe and do righteous deeds a paradise full of enjoyment. Inside there are beautiful gardens with rivers flowing under them. They will remain in that heaven forever. Regarding the description of heaven, it is explained by the hadith of the Prophet, where he said: \"Verily, the inhabitants of heaven see each other the inhabitants of a high place above them, just as you see the shining stars passing on the horizon, both from the east and from the west, because the degree of difference that exists between them.\" The companions said, \"O Messenger of Allah, those are the places of the prophets, other humans will not get there.\" Rasulullah replied, \"It is possible, by Allah whose soul is in His hands, those are places that believe in Allah and justify the apostles.\" (Muslim narration from Sahl bin Sa'd) In another hadith the Prophet said: \"Surely in heaven there are high places, behind which can be seen through from the front and the front can be seen through from behind.\" Then a Bedouin Arab stood up and asked, \"Who are these places for, O Messenger of Allah?\" The Messenger of Allah replied, \"These places are for people who are good in speech, feed (poor people), always fast and pray for Allah at night while other people sleep.\" (History of at-Tirmidhi from 'Ali bin Abi Talib) This is the paradise promised by Allah to those who believe, do good deeds, be patient, and put their trust in Him. In this verse it is explained that Allah promises to reward those who believe. God's promise is strengthened by an oath. This is to reassure the hearts of the Muslims, so that their steps are steady in taking the straight and difficult path, such as hijrah and so on."
		   },
		   {
			"id": 3399,
			"surah": 29,
			"ayat": 59,
			"tafsir": "This verse explains the rewards that will be obtained by those who believe in Allah, because they have migrated for the sake of His religion. They broke away from those who associated partners with Allah and dared to bear all the risks resulting from that migration. Allah's promise is to reward those who believe and do righteous deeds a paradise full of enjoyment. Inside there are beautiful gardens with rivers flowing under them. They will remain in that heaven forever. Regarding the description of heaven, it is explained by the hadith of the Prophet, where he said: \"Verily, the inhabitants of heaven see each other the inhabitants of a high place above them, just as you see the shining stars passing on the horizon, both from the east and from the west, because the degree of difference that exists between them.\" The companions said, \"O Messenger of Allah, those are the places of the prophets, other humans will not get there.\" Rasulullah replied, \"It is possible, by Allah whose soul is in His hands, those are places that believe in Allah and justify the apostles.\" (Muslim narration from Sahl bin Sa'd) In another hadith the Prophet said: \"Surely in heaven there are high places, behind which can be seen through from the front and the front can be seen through from behind.\" Then a Bedouin Arab stood up and asked, \"Who are these places for, O Messenger of Allah?\" The Messenger of Allah replied, \"These places are for people who are good in speech, feed (poor people), always fast and pray for Allah at night while other people sleep.\" (History of at-Tirmidhi from 'Ali bin Abi Talib) This is the paradise promised by Allah to those who believe, do good deeds, be patient, and put their trust in Him. In this verse it is explained that Allah promises to reward those who believe. God's promise is strengthened by an oath. This is to reassure the hearts of the Muslims, so that their steps are steady in taking the straight and difficult path, such as hijrah and so on."
		   },
		   {
			"id": 3400,
			"surah": 29,
			"ayat": 60,
			"tafsir": "This sabab nuzul verse is based on a history from Ibn 'Abbas which states that the Prophet Muhammad said to the believers in Mecca, when the polytheists tortured them, \"Get out of you all and emigrate. Don't be neighbors with those who are unjust.\" The believers replied, \"O Messenger of Allah, there we have no house, no wealth, no one to feed, and no one to drink.\" So this verse came down as an answer to the worries of the believers. This verse was sent down to reassure the hearts of those who believe in fulfilling the Messenger of Allah's call to emigrate, both those who have emigrated and Muslims who are preparing to emigrate, as if Allah said, \"O you who believe, challenge the enemies of Allah. Do not be afraid of destitution and poverty because of how many reptiles are unable to collect food every day for their needs, but Allah still gives them sustenance. You, O you who believe, are much better than animals and are better at finding food, why are you worried that you will not get food. Even though you migrated without bringing anything, Allah will surely provide you with sustenance. Allah is All-Hearing all kinds of prayers, knows all the conditions of His servants.\" This verse indicates to the Muslims that Allah will not spare any of His creatures. He put forward a parable that is easy for Muslims to understand, like baby animals that cannot find their own food. Allah made their parents love them, so they want to try and work hard to find food for their children. Then the mother feeds the food she gets into the mouths of her children, as we see with birds and so on. There are also animals that feed their children with milk from their mothers, as is found in mammals. Everything is God's provision, so that in this way every creature can maintain the survival of its kind. Likewise with humans, some are strong, some are weak, some are rich, some are poor, some are small, some are big, some live in fertile places, and some live in barren places, all of them are given sustenance. by Allah, according to their needs. This is what is meant by this verse. Allah provides sustenance to all His creatures, including the Muhajirin, even though their property is left behind in Mecca, and their livelihoods are cut off. Allah says: And not a single creature moves (lives) on earth but all of it is guaranteed by Allah for its sustenance. He knows his residence and where it is kept. All (written) in a real Book (Lauh Mahfudh). (Hud\/11: 6) Then this verse closes by emphasizing that Allah is All-Hearing what His servants ask for and All-Knowing of all their needs. From the verses above it is understood that humans do not know exactly what they are doing. He only knows the needs and external needs, while the needs that are spiritual, and many others, he does not know, such as the need for air that he must breathe throughout the day, water, and so on. Even so, every believer is required to try and endeavor in his life. Allah has given us the potential to will and try so that we are still obliged to try, as Allah says: Verily Allah will not change the condition of a people before they change their own condition. (ar-Ra'd\/13: 11)"
		   },
		   {
			"id": 3401,
			"surah": 29,
			"ayat": 61,
			"tafsir": "This verse explains that the polytheists admit that the one who created the heavens and the earth is God Almighty. He is the one who subjected the sun and the moon for the benefit of mankind. Their acknowledgment is a natural thing because in the beginning their forebears were monotheistic religions, namely, the Prophets Abraham and Prophet Ismail. At first they were proud of the monotheistic religion, so they were not interested in Judaism and Christianity that developed in the Arabian Peninsula. As time goes by and generations change, without them realizing the pure monotheistic religion, elements of shirk have gradually penetrated it. Because they indulge their feelings and passions, they stray farther and farther from their original foundation. Finally, they worshiped statues, jinn, and other objects in addition to worshiping Allah. Even though their beliefs have deviated far from the monotheistic religion, they still admit that they adhere to the Abrahamic religion. When asked about who created the heavens and the earth and subjected the sun and the moon, they replied, \"The creator is Allah and Allah is the master over it.\""
		   },
		   {
			"id": 3402,
			"surah": 29,
			"ayat": 62,
			"tafsir": "In this verse, Allah states that it is He who widens sustenance for whom He wills and constricts sustenance for whom He wills. He alone has the power to determine sustenance, so that believers need not be reluctant to emigrate for fear of poverty. Allah provides sustenance wherever they are, whether in their own country, or in other people's lands or on their way, even when they are captured by enemies. Allah says: Indeed Allah, He is the Giver of sustenance Who Has Strength and is Very Sturdy. (adz-dzariyat\/51: 58) This verse further states that Allah knows all the benefits of His creatures. He also knows people who do good deeds because they are given a lot of sustenance, and knows people who do mischief and evil with the wealth that Allah has bestowed on them.\" This verse can also be linked to the statement of the polytheists in the previous verse. (verse 61) where Allah declares to the polytheists, \"Who created and rules this universe?\" They do not get an answer, except to submit by stipulating that Allah is the One who created and controls all creatures. If they have acknowledged If that's the case, why do they still doubt who will bear the sustenance for all of these creatures. If they say that it is Allah who widens and narrows the sustenance for His creatures, there is no other, why do they still worship and ask for that sustenance to idols? Allah further explains that He distinguishes His servants in terms of providing sustenance because He is more rewarding know their benefit. The gift must be adapted to their respective circumstances."
		   },
		   {
			"id": 3403,
			"surah": 29,
			"ayat": 63,
			"tafsir": "In this verse, the question is still faced by the polytheists of Mecca. They were asked about who sent down rainwater from the sky, then with that water the land was fertile and barren? What is their answer to this question? In verse 61 above they have stated that it is Allah who made the heavens and the earth, and subjected the sun and the moon. This is something that does not need to be discussed anymore because it is in accordance with the right mind and religious teachings brought by the Prophet Abraham, the religion that is recognized as their religion. However, their actions contradict the statements they make. This is the oddity that is in them. So in this verse 63, Allah explains that if they were asked this question, they would also answer, \"Allah.\" Thus it is clear that they believe that Allah is the Owner of all that is in the heavens and on earth. He is the one who controls everything that exists in both of them, like sending down rain from the sky, then with the rain water the earth becomes fertile and plants grow. However, their belief is not based on the deeds they do every day, because they associate God with idols that do not have any power or power. Even though polytheists make statements like the one above, most of them don't want to understand and practice that confession. They are like fools who cannot understand the essence of their confession. This is caused by misguidance and tyranny that has defeated the truth. When the truth is presented to them, though their minds and instincts accept it, their hearts no longer accept it. They even accused the Prophet Muhammad of having bewitched them, so that they doubted the reality seen by their own eyes and minds. Allah said: Surely they will say, \"Surely it is our sight that has been obscured, even we are the people affected by magic.\" (al-hijr\/15: 15) In this verse, Allah commands the Prophet Muhammad to say \"al-hamdulillah\". These words were uttered as an expression of gratitude to Allah for the blessings He has given, namely the revelation of the truth with the acknowledgment and statement of the polytheists about the oneness of God. However, even though they have acknowledged the power and mercy of Allah, their hearts are still dependent on the idols they worship."
		   },
		   {
			"id": 3404,
			"surah": 29,
			"ayat": 64,
			"tafsir": "This verse explains the nature of worldly life, especially to polytheists who are deceived by worldly life. It was explained that worldly life is just games and fun, not real life. The views and minds of polytheists have been closed, so they have been preoccupied with worldly affairs. They compete for the wealth, power, pleasures and delights they have, as if the life of this world were the real life for them. If they wanted to reduce their attention to worldly life just a little, and see it as a preparation field for provisions in another life that is more eternal and eternal, and also wanted to listen to Allah's verses, they would certainly not be disobedient and associate partners with Allah. If they listened to the messenger's call by using their ears, minds and hearts, they would not have strayed from Allah's way. Then Allah explained that the essential life is the afterlife, and it is the other side of human life, namely life that is covered by absolute truth. The life of this world is a life in which truth and falsehood are mixed together, whereas in the afterlife, truth and falsehood are separated. Much of the afterlife is determined by the worldly life one lives, and depends on one's deeds and efforts while still alive. Worldly life can be likened to childhood life, while the afterlife can be likened to adult life. If a person in childhood prepares himself seriously, such as studying and working diligently, then his adult life will be a bright life. Conversely, if he plays around a lot and doesn't make the best use of his time, then he will have a bleak adulthood. This is the case with the afterlife, depending on one's deeds and efforts while still living in this world. If he lives in the world of faith and does good deeds, then his life in the hereafter will be good and happy. On the other hand, if he disbelieves and does forbidden things, he will experience a miserable life in the afterlife. At the end of this verse, Allah warns polytheists to know the essence of life. If they had studied and known this, they would not have been led astray and deceived by the life of this mortal world. Everyone who is knowledgeable and willing to use his mind can easily distinguish between good and bad, between right and wrong, and so on."
		   },
		   {
			"id": 3405,
			"surah": 29,
			"ayat": 65,
			"tafsir": "This verse describes the life of polytheists who are full of contradictions and contradictions. Their hearts believe in the power and oneness of Allah, but the influence of the world and passions overshadows the true conviction of their hearts. Therefore, they cannot do good deeds and remember Allah sincerely. They are like confused people in a life full of polytheism. They are likened to Allah with people who board ships, sailing across the wide seas. Suddenly there came a strong hurricane accompanied by mountainous waves and waves so that their ship was thrown here and there. Then there was fear in their hearts, accompanied by a feeling that they would not survive and would be swallowed up by the waves. At that moment, they remember Allah, and believe that only He Almighty saves and protects them from the crashing waves. They acknowledge the oneness of Allah, both in their hearts and feelings as well as in speech. In short, in all their actions, they return to their original nature, namely acknowledging the oneness and power of Allah. They no longer believe that the gods they have been worshiping are able to deliver and save them from the catastrophe that is threatening them. Therefore, they pray and ask for help to Allah alone. So Allah granted their sincere request and prayer by saving them from all disasters. However, after they were released from the terrifying disaster, and their hearts felt safe and secure, they immediately returned to denying Allah who had saved them. They forget that they once prayed to Him for salvation and promised to remain submissive and obedient only to Him. They returned to associating partners with Allah with gods who did not deserve the slightest association with Him. So Allah let them have fun until the appointed time and Allah will reward them accordingly in the hereafter. In another verse, the condition of the polytheists in the afterlife is explained. They will acknowledge the oneness and power of Allah when they experience the painful torments in hell and pray for His help to be delivered from these torments. Allah said: O our Lord, remove us from it (return us to the world), if we still return (to disbelief), indeed, we are unjust.\" He (Allah) said, \"Stay in it with contempt , and do not talk to me.\" (al-Mu'minun\/23: 107-108) Muhammad bin Ishaq in the Sirah book (dates of the Prophet Muhammad) narrates that 'Ikrimah bin Abi Jahal said, \"When the Messenger of Allah conquered Mecca, I run from it. When I boarded the ship to Habsyah, the ship was tossed around. The passengers on the ship said, \"O friends, pray sincerely to your Lord, in fact no one can save us from this disaster except him.\" there is no land that can save, except Him. O my Lord, I promise you, if I get out of this sea, then I will go to Muhammad and I will declare my faith in him, then I will find him a very loving and compassionate person, and my promise will be fulfilled.\" Ikrimah also said, \"Nation Jahiliah means that when they board the ship, their idols are also taken with them. When a storm comes, the idols are thrown into the sea, then they say, \"My God, My God.\" Ar-Razi said in his book, al-Lawami, \"This is a sign that knowledge of God is natural for humans. Even though they neglect to remember Him when they are happy, they remember Him when they are sad.\""
		   },
		   {
			"id": 3406,
			"surah": 29,
			"ayat": 66,
			"tafsir": "This verse explains the consequences of the behavior of the polytheists associating partners with Allah after they were saved from disaster, and is a threat to their disbelief against His grace. In the last verse, Allah explained that after they were safe, they suddenly returned to associate partners with Him, so the question arose why did He save them from the danger of drowning? Why wasn't the ship and all its passengers allowed to sink to the bottom of the sea, so that their problems would be solved? The answer is that it is only natural that Allah, the Most Gracious and Most Merciful, allows the prayers of His servants who ask sincerely. They were saved as a test of their faith; whether they will remain in that faith or will polytheists return. It turned out that this test did not bring results. After being saved by Allah, they returned to polytheism. They behave like that because polytheism has been entrenched and rooted in their souls. This resulted in them disbelieving in the grace of Allah who had saved them from drowning in the sea and made them live happily in disbelief. Therefore, Allah threatened them by saying that one day they would know the consequences of their actions. The sentence \"then they will know (the result of their actions)\" has a threatening tone to polytheists, because the signs of Allah's power and oneness and the blessings that have been bestowed upon them cannot convince them, and even increase their denial. It was as if they were being told, \"If they are negligent and do not change their behavior, they will know for sure that the promised punishment will surely befall them.\" When the punishment has befallen them, then all the doors of repentance will be closed for them."
		   },
		   {
			"id": 3407,
			"surah": 29,
			"ayat": 67,
			"tafsir": "This verse reminds the polytheists of Mecca of the blessings bestowed upon them. Allah made them special from the inhabitants of the countries around them by making the city of Mecca a safe, peaceful country, and it was forbidden to fight there. Allah protects the country from enemies who want to destroy and control it, as happened in the year the Prophet Muhammad was born. At that time, Abraha's soldiers riding elephants were destroyed by Allah before they could touch the Kaaba. Allah said: (1) Haven't you (Muhammad) noticed how your Lord has acted towards the army of elephants? (2.) Had He not made their deception useless? (3) And He sent them flocks of birds, (4) who threw stones at them from burnt clay, (5) so that He made them like leaves eaten (worms). (al-Fil\/105: 1-5) In another verse, the condition of the city of Mecca and the life of the Quraysh people is explained. Allah said: (1) Because of the habits of the Quraysh people, (2) (namely) their habit of traveling in winter and summer. (3) So let them worship God (owner) of this house (Kaaba), (4) who has given food to them to relieve hunger and secure them from fear. (Quraish\/106: 1-4) On the other hand, the countries around Mecca were in a state of insecurity. There were frequent robberies, killings, riots, and wars between tribes, so that people could not feel peace and security for their lives, families, and property. Every time the population is always in a state of fear of being attacked by enemies. In this verse, the polytheists are questioned whether they do not see the clear and obvious blessings? Do they not feel a little too that Allah has distinguished them from the inhabitants of the land around them. Why don't they leave the idol worship that pollutes the Kaaba? Actually the Meccans already knew everything, but because of their denial, they believed in falsehood and denied Allah's favor. How lowly are they."
		   },
		   {
			"id": 3408,
			"surah": 29,
			"ayat": 68,
			"tafsir": "This verse explains that the polytheists are people who are very unjust, because they create partners for Allah and say that He has children. They are the ones who fabricate lies against Allah and become His enemies. They make statues, then worship them to draw closer to God. Allah tells the beliefs of the polytheists in His word: Remember! Only belongs to Allah pure religion (from shirk). And those who take protectors other than Him (say), \"We do not worship them but (hope) that they draw us closer to Allah as closely as possible.\" Indeed, Allah will judge between them about what they dispute. Indeed, Allah does not guide liars and people who are very disbelieving. (az-Zumar\/39: 3) After a Messenger of Allah came to them who explained the falsehood and falsehood of their deeds, and showed them the straight path based on the truth, they denied and denied everything. In fact, they deny all the blessings of Allah that have ever been given to them. In fact, the polytheists have committed the greatest sin that has no equal in this world. There is no proper reward for them except the torment of hell in the hereafter and that is the proper place for them."
		   },
		   {
			"id": 3409,
			"surah": 29,
			"ayat": 69,
			"tafsir": "This verse explains the glorious promise of Allah to the believers who strive in His way by sacrificing their lives and property and enduring torment and obstacles. Therefore, Allah will give them guidance, help them make up their minds, and provide assistance, so that they gain victory in this world and happiness and glory in the hereafter. Allah says: (That is) people who were expelled from their hometowns without good reason, just because they said, \"Our Lord is Allah.\" If Allah had not repelled some people with others, Christian monasteries, churches, Jewish houses of worship and mosques, in which the name of Allah is often mentioned, would have been torn down. Allah will surely help those who help His (religion). Truly, Allah is Powerful, Mighty. (al-hajj\/22: 40) The meaning of jihad in verse 69 is to do all kinds of efforts to uphold the religion of Allah and exalt His sentence, including fighting the disbelievers who are fighting Muslims. According to Abu Sulaiman ad-Darani, jihad here does not only mean fighting unbelievers, but also means defending religion and eradicating tyranny. As for the main thing is advocating good deeds, forbidding wrongdoing, and fighting lust in order to obey Allah's commands. Those who strive are promised by Allah a broad way. This promise will surely be fulfilled, as His words: And indeed, We have sent before you (Muhammad) several messengers to his people, they came to him with (sufficient) information, then We took vengeance on those who sinful. And it is Our right to help those who believe. (ar-Rum\/30: 47) In this verse it is explained that those who strive in the way of Allah are those who do good (muhsin). This means that all kinds of actions, according to what Allah has outlined in jihad, are good deeds. So named because those who strive always walk in the way of Allah. People who don't want to do jihad are bad people, because they have disobeyed God's command to do jihad. That person is a misguided person, because he does not want to follow the straight path that He has laid out. In this verse it is stated that Allah is always with those who fight in His way, fights their desires, expels all the whisperings of Satan from their hearts, and never wastes His religious teachings. This statement can reassure the hearts of believers in facing disbelievers and raise their spirits to fight in His way. This verse explains that those who strive for the pleasure of Allah will surely be shown His way. From this verse it is understood that the broad field of jihad can be carried out in various ways, in the form of words, writing, and in certain situations it can be carried out with weapons. Because the area and many fields of jihad mean that there are many paths that a believer can take to reach Allah's pleasure, as long as all of these paths are intended to uphold truth, justice and goodness."
		   }
	]
}
