{
	"tafseer": [
		{
			"id": 5218,
			"surah": 65,
			"ayat": 1,
			"tafsir": "In this verse, Allah's khithab (call) is addressed to the Prophet Muhammad, but in essence it is also intended for his people who believe. Allah calls on believers if they want to divorce (reject) their wives, so that they do so when their wives can immediately undergo their Idah, that is, when the wives are pure from menstruation and have not been interfered with, as explained in one hadith of the Prophet comes from Ibn 'Umar: 'Abdullah bin 'Umar had divorced his wife while she was menstruating. Then 'Umar bin Khaththab asked the Prophet about this, then he ordered 'Abdullah bin 'Umar to refer to his wife, keep her (living together) until the holy period. Then wait for her menstrual period again until she is pure, then after that if she wants to stay with his wife (then do it), and if he wants to divorce his wife (then do it) before having sex with her. This is the period of Idah ordered by Allah when women are divorced. (Al-Bukhari and Muslim) A husband who is about to divorce his wife, should research and correctly calculate when his wife's iddah begins and when it ends, so that the wife can live her iddah immediately so she doesn't wait too long. Husbands are also asked to carry out laws and fulfill the rights of wives that must be fulfilled during the iddah period. Let the husband fear Allah and do not violate what He has commanded regarding divorce, that is, pronounce divorce at the time He approves and fulfill the rights of the wife who is divorced. Among other things, the husband should not expel the wife he divorced from the house he lived in before he divorced on the grounds of anger and so on, because placing the wife in a proper place is a wife's right that has been made obligatory by Allah as long as she is still in Idah. The husband is also prohibited from removing his wife who is undergoing Idah from the house where she lives. Moreover, letting go out at will, because that is a violation of religion, unless the wife openly commits heinous acts, such as committing adultery and so on. If the wife behaves impolitely towards her parents-in-law, then she may be expelled from her residence. Such are the limits and provisions that have been outlined by Allah regarding divorce, idah, and so on. Therefore, whoever violates Allah's laws, it means that he is doing injustice to himself. If Allah ordains a change, then the husband's heart turns to love again for his wife whom he has divorced and feels sorry for his actions and then he wants to reconcile, then the road has been closed for him, if his wish is carried out after the end of his waiting period because he has wasted the opportunity that was given to him. The wife referred to here is a wife who has or is still menstruating and has been interfered with after the marriage contract. There is also a wife who is still small or has ayisah (no longer menstruating) or has not been interfered with after the marriage contract, if divorced, has its own idah law. Unlike the applicable law as mentioned above."
		   },
		   {
			"id": 5219,
			"surah": 65,
			"ayat": 2,
			"tafsir": "In these verses, Allah explains that when the wife's Idah period is almost over and the husband still wants to be reunited, he may refer to his wife and live well together as husband and wife, carry out his obligations, provide groceries, clothes, housing, and so on. . However, if the husband still does not reconcile with his wife, then he may release her properly without any tension occurring, completing the dowry, giving mut'ah in return and thanking her for her kindness while living together and other things that comfort her. . If the husband chooses reconciliation, then it should be witnessed by two fair male witnesses, to reconfirm his household. Furthermore, Allah calls for the testimony to be given honestly because Allah is solely without expecting payment and without taking sides, as Allah's word: Be the upholders of justice, bear witness for Allah, even against yourselves. (an-Nisa'\/4: 135) Such is the call for reconciliation and divorce to be a lesson for those who believe in Allah in the Hereafter. People who fear Allah, and obediently comply with the rules that have been set, among others, regarding the reconciliation and divorce mentioned above, He will surely show him a way out of the difficulties he faces. For those who fear Allah, they are not only given and made easy ways out of the difficulties they face, but they are also given sustenance by Allah from unexpected directions, which have never crossed their minds. Furthermore, Allah calls on them to put their trust in Him, because it is Allah who fulfills their needs to make their affairs successful. Putting your trust in Allah means surrendering yourself to Him, fully surrendering to Him the success of your business. After he tries and establishes an endeavor, then he puts his trust in it. It is not trustworthiness if a person surrenders his situation to Allah without effort and endeavor. Try and endeavor first then put your trust in Allah. Once it happened that a Bedouin Arab visited the Prophet in Medina by riding a camel. After the Arab arrived at his destination, he got off his camel and entered to meet the Prophet. The Prophet asked, \"Has the camel been moored?\" The Bedouin replied, \"No! I just let go, and I put my trust in Allah.\" The Prophet said, \"Treat your camel first, then put your trust in it.\" Allah will carry out and perfect the affairs of those who put their trust in Him in accordance with the nature of His iradat, at a predetermined time, as explained in His word: And everything has a measure with Him. (ar-Ra'd\/13: 8)"
		   },
		   {
			"id": 5220,
			"surah": 65,
			"ayat": 3,
			"tafsir": "In these verses, Allah explains that when the wife's Idah period is almost over and the husband still wants to be reunited, he may refer to his wife and live well together as husband and wife, carry out his obligations, provide groceries, clothes, housing, and so on. . However, if the husband still does not reconcile with his wife, then he may release her properly without any tension occurring, completing the dowry, giving mut'ah in return and thanking her for her kindness while living together and other things that comfort her. . If the husband chooses reconciliation, then it should be witnessed by two fair male witnesses, to reconfirm his household. Furthermore, Allah calls for the testimony to be given honestly because Allah is solely without expecting payment and without taking sides, as Allah's word: Be the upholders of justice, bear witness for Allah, even against yourselves. (an-Nisa'\/4: 135) Such is the call for reconciliation and divorce to be a lesson for those who believe in Allah in the Hereafter. People who fear Allah, and obediently comply with the rules that have been set, among others, regarding the reconciliation and divorce mentioned above, He will surely show him a way out of the difficulties he faces. For those who fear Allah, they are not only given and made easy ways out of the difficulties they face, but they are also given sustenance by Allah from unexpected directions, which have never crossed their minds. Furthermore, Allah calls on them to put their trust in Him, because it is Allah who fulfills their needs to make their affairs successful. Putting your trust in Allah means surrendering yourself to Him, fully surrendering to Him the success of your business. After he tries and establishes an endeavor, then he puts his trust in it. It is not trustworthiness if a person surrenders his situation to Allah without effort and endeavor. Try and endeavor first then put your trust in Allah. Once it happened that a Bedouin Arab visited the Prophet in Medina by riding a camel. After the Arab arrived at his destination, he got off his camel and entered to meet the Prophet. The Prophet asked, \"Has the camel been moored?\" The Bedouin replied, \"No! I just let go, and I put my trust in Allah.\" The Prophet said, \"Treat your camel first, then put your trust in it.\" Allah will carry out and perfect the affairs of those who put their trust in Him in accordance with the nature of His iradat, at a predetermined time, as explained in His word: And everything has a measure with Him. (ar-Ra'd\/13: 8)"
		   },
		   {
			"id": 5221,
			"surah": 65,
			"ayat": 4,
			"tafsir": "This verse explains that the iddah of women who are ya'is (no longer menstruating), is three months. So do young women who have never menstruated. As for women who are pregnant, her iddah is until she gives birth to her womb. The same goes for pregnant women whose husbands have died and their wives have given birth to their wombs, as narrated by Imam Malik, Imam Syafi'i, Abdur Razaq, Ibn Abi Syaibah, and Ibn Mundhir from Ibn 'Umar. When asked about a pregnant woman whose husband died, Ibn 'Umar replied, \"If the woman gives birth to her womb, then she becomes lawful (to marry).\" Regarding this matter, there are scholars who argue that it is based on the longest of two periods, that is, if you are heavily pregnant and give birth soon, then the waiting period is 4 months and 10 days. Meanwhile, if you are pregnant at a young age, the beauty is until the woman gives birth. People who fear Allah, carry out His commands and stay away from His prohibitions, then their affairs will be facilitated, released from the difficulties they experience. The two ayats above (ayats 1 and 4), and the other 2 (two) ayats in between (ayats 2 and 3), regulate the procedures for divorce. Among them are things that regulate the iddah period. This period is clearly stated as 3 (three) months for women who are not menstruating and those who have entered menopause, and until the time of delivery for those who are pregnant. Basically, within three months, if intercourse no longer occurs, the condition of the woman can be determined whether she is pregnant or not. Because starting in the first month of pregnancy, menstruation will stop. Of course, the cessation of menstruation can be caused by many things. It can be due to pregnancy, or are starting the process of menopause, or because of an illness. For a woman, they will know the occurrence of pregnancy from the presence of several other characteristics, because pregnancy is not only marked by a delay in menstruation or an increasingly \"fat\" stomach. There are still other signs. It's not easy to know whether someone is really pregnant or not."
		   },
		   {
			"id": 5222,
			"surah": 65,
			"ayat": 5,
			"tafsir": "In this verse, Allah explains that the laws that have been prescribed regarding divorce, residence, and women's ideals listed in the previous verses are Allah's provisions that must be practiced and implemented. At the end of this verse, Allah once again explains that for those who fear Him by carrying out His commands and avoiding His prohibitions, He will surely erase and forgive their sins as He has promised. In another verse Allah says: Good deeds erase mistakes. (Hud\/11: 114) Apart from that, Allah also multiplies the reward of their deeds, as He promised in His word: Whoever does good will be rewarded tenfold for his deeds. And whoever commits a crime will be rewarded in proportion to his crime. They are not the least bit disadvantaged (tortured). (al-An'am\/6: 160)"
		   },
		   {
			"id": 5223,
			"surah": 65,
			"ayat": 6,
			"tafsir": "In this verse, Allah explains that it is the husband's obligation to provide a decent place to live according to his ability to his wife who is undergoing Idah. He should never do anything that narrows and troubles his wife by placing her in an inappropriate place or allowing someone else to live with her, so that she feels compelled to leave that place and demand another place that she likes. If the wife who is divorced ba'in is pregnant, then she must be given enough maintenance until she gives birth. When she gives birth, then the end of her beautiful period. However, because she breastfeeds the children of the husband who divorced her, the husband must provide maintenance for her as much as is generally applicable. It is better for a father and mother to negotiate in a good way about the benefit of their children, both regarding health, education, and other matters. In a number of Muslim countries, the rights of divorced women have been specifically regulated in law. If there is no agreement between the two parties, then the father may choose another woman who can accept and understand his ability to breastfeed his children. Even so, if the child does not want to breastfeed another woman, but only to the mother, then the father is obliged to provide the same amount of maintenance as is given to other people."
		   },
		   {
			"id": 5224,
			"surah": 65,
			"ayat": 7,
			"tafsir": "In this verse, Allah explains that it is the duty of the father to give wages to the woman who breastfeeds according to her ability. If the father's ability is only to be able to feed because he has little sustenance, then that is all that is his obligation. Allah will not burden a person but according to his ability, as His word: Allah does not burden a person but according to his ability. (al-Baqarah\/2: 286) In another verse it is also explained: A person is not burdened with more than his capacity. (al-Baqarah\/2: 233) Nothing is permanent in the world. At one time, Allah will provide spaciousness after narrowness, wealth after poverty, pleasure after suffering. Allah says: Verily, with hardship there is relief. (asy-Syarh\/94: 6)"
		   },
		   {
			"id": 5225,
			"surah": 65,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains that there are not a few areas whose inhabitants violate His orders, denying the apostles who have been sent to them. They will be brought to account with a very careful calculation, so that all the evil that has been done in the world will be revealed. They were then punished with terrible torments."
		   },
		   {
			"id": 5226,
			"surah": 65,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains that people who will be punished on the Day of Judgment with a terrible punishment are like people who pick their crops, get the results of their efforts in accordance with their crops and efforts. If good is planted, good will be reaped, conversely if bad is planted, bad will be picked, and it cannot be the other way around. In line with this description, in another verse it is explained: Whoever does good then his (reward) is for himself and whoever does evil then his (sin) becomes his own responsibility. And your Lord is not unjust at all (His) servants. (Fussilat\/41: 46) As a result of the bad deeds they did, they suffered huge losses."
		   },
		   {
			"id": 5227,
			"surah": 65,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains that for those who always show disobedience and disobedience to the teachings of the apostles who came from Allah, a painful punishment has been prepared in the hereafter. People who have reason and faith should fear Allah, because He has long sent down a warning, namely the Qur'an, which warns about everything, to be a guide by practicing and obeying its contents."
		   },
		   {
			"id": 5228,
			"surah": 65,
			"ayat": 11,
			"tafsir": "In this verse, Allah explains that He has sent a messenger to read and teach the verses of the Holy Qur'an which were revealed to him, which contain various instructions and laws. The verses are very clear and easy to understand for those who are willing to think and use their minds, so that those who believe and do good deeds receive guidance, and come out of darkness into bright light. Those who believe in Allah acknowledge the greatness of His power. They will be admitted to gardens beneath which rivers flow, they will remain there forever, will not die and will not be expelled. In heaven, they will get various kinds of great pleasures, ample sustenance in the form of food and drink that eyes have never seen, ears heard, and never crossed the human heart."
		   },
		   {
			"id": 5229,
			"surah": 65,
			"ayat": 12,
			"tafsir": "In this verse, Allah explains that it is He who created the seven heavens and who created the seven layers of the earth. In a hadith narrated by Ibn Mas'ud, the Prophet said: O Abu dzarr, there are not (comparison) the seven petals of the sky with a chair but like a small circle on a wide expanse of land. Meanwhile (comparison) 'Arsy with chairs on a wide expanse of land with a small circle. (History of Ibn hibban and Abu Nu'aim) Allah's orders, qadha', and qadar prevail between the earth and the heavens. He is the one who arranges everything according to His vast knowledge, applies His just wisdom and brings benefit. All of that aims to make people know the extent of God's power. Nothing can stand in the way of His will. He is power over all. It is also intended that people know that God's knowledge includes everything. There is nothing in the heavens and on earth, no matter how small, unless it is known by Allah. Nothing is hidden from Him, as explained in His word: With God nothing is hidden in the earth and in the heavens. (Ali 'Imran\/3: 5) It is also explained in another of His words: And nothing is hidden from Allah, neither on earth nor in the heavens. (Ibrahim\/14: 38)"
		   }
	]
}
