{
	"tafseer": [
		{
			"id": 1,
			"surah": 1,
			"ayat": 1,
			"tafsir": "Surah al-Fatihah begins with Basmalah\n\nThere are several opinions of scholars regarding the Basmalah found at the beginning of surah Al-Fatihah. Among these opinions, the most well-known are:\n\n1. Basmalah is a separate verse, revealed by Allah to be the head of each sura, and the boundary between one sura and another. So he is not a verse from al-Fatihah or from any other surah, which starts with the Basmalah. This is the opinion of Imam Malik along with the qiraah and fuqaha (jurists) of Medina, Basrah and Syam, as well as the opinion of Imam Abu Hanifah and his followers. Therefore, according to Imam Abu Hanifah, it is not emphasized to read Basmalah in prayer, even Imam Malik did not read Basmalah at all. \n\nHadith of the Prophet SAW:\n\nFrom Anas bin Malik, he said, \"I prayed behind the Prophet saw, Abu Bakr, Umar and Usman. They started with al-hamdulillahi rabbil 'alamin, did not mention Bismillahirrahmanirrahim at the beginning of the reading, nor at the end. \"(History of al-Bukhari and Muslim).\n\n2.Basmalah is one of the verses of al-Fatihah, and in surah an-Naml/27:30, /27:30) which begins with Basmalah. This is the opinion of Imam Shafi'i and the Mecca and Kufa qiraah experts. Therefore, according to them, Basmalah is read aloud in prayer (jahar). The arguments that show this include the Hadith of the Prophet PBUH: \n\nFrom Ibn 'Abbas, he said, the Messenger of Allah emphasized the reading of Bismillahirrahmanirrahim. (Al-hakim's history in al-Mustadrak and according to him, this hadith is valid)\n\nFrom Umm Salamah, he said, the Messenger of Allah stopped many times in his reading Bismillahirrahmanirrahim, al-hamdulillahi Rabbil-'alamin, ar-Rahmanir-rahim, Maliki Yaumid-din. (History of Ahmad, Abu Daud, Ibn Khuzaimah and al-hakim. According to ad-Daruqutni, the sanad of this hadith is valid).\n\nAbu Hurairah also prayed and recited the basmalah. After finishing the prayer, he said, \"I am the person whose prayer is most similar to the Messenger of Allah.\" Muawiyah also prayed in Medina without raising the sound of the basmalah. He was protested by other friends who were present there. Finally, at the next prayer, Muawiyah loudly recited the basmalah. \n\nIf we notice that the companions of the Prophet Muhammad agreed to write the Basmalah at the beginning of the surah of the Al-Qur'an, except for the sura at-Taubah (because indeed from the beginning the revelation did not start with the Basmalah) and that the Prophet forbade writing anything that is not the Al-Qur'an so that it does not get mixed up with the Al-Qur'an, so that they do not write 'amen at the end of surah al-Fatihah, then Basmalah is one of the verses of the Al-Qur'an. In other words, that the \"basmalah-basmalah\" contained in the Qur'an are the verses of the Qur'an, regardless of whether one verse is from al-Fatihah or from another surah, which begins with Basmalah. or not.\n\nAs mentioned above that sura al-Fatihah consists of seven verses. Those who argue that the Basmalah does not include one verse from al-Fatihah, views:\n\nis one verse, thus the verses of al-Fatihah remain seven.\n\n\"In the name of Allah\" means \"In the name of Allah I read or I start\". It is as if the Prophet said, \"I read this sura in the name of Allah, not by mentioning my own name, because it is a revelation from God, not from myself.\" So Basmalah here implies that the Qur'an is revelation from Allah, not the composition of Muhammad saw and Muhammad was only a Messenger of Allah who was given orders to deliver the Qur'an to people.\n\nThe meaning of the word Allah \n\nAllah is the name for the Substance that exists by itself (wajibul-jadi). The word \"Allah\" is only used by the Arabs for the real God, who has the right to be worshiped, who has the attributes of perfection. They did not use the word for their gods or any other gods. \n\nThe Wisdom of Reading Basmalah\n\nA person who always reads Basmalah before doing important work, means that he always remembers Allah in every job. Thus he will carry out the work by always paying attention to God's norms and not harming others. As a result, the work he does will bear fruit as a ukhrawi practice. \n\nA Muslim is ordered to read Basmalah when doing something good. That is to remind that something is done because of God's command, or because He has permitted it. So because of Allah he did the work and from Him he asked for help so that the work was carried out properly and successfully.\n\nThe Prophet said:\n\n\"Any important work that does not start by saying Basmalah is stubby (lack of blessings).\" (History of Abdul-Qadir ar-Rahawi).\n\nThe Arabs before coming to Islam did something by calling al-Lata and al-'Uzza, the names of their idols. who has confirmed Him, so that they do something in the name of Allah."
		},
		{
			"id": 2,
			"surah": 1,
			"ayat": 2,
			"tafsir": "In the verse above, Allah begins His word by saying \"Basmalah\" to teach His servant to start a good deed by saying basmalah, as a statement that he is doing the deed because of Allah and it is to Him that he asks for help and blessing. So, in this verse Allah teaches His servants to always praise Him. \n\nAl-hamdu means praise, because of the goodness given by the one being praised, or because of a virtue that he has. All the blessings that have been felt and obtained in this world are from Allah, because He is the source of all blessings. Only Allah has the attributes of perfection. Therefore, Allah alone has the right to be praised. People who say al-hamdu lillah not only admit that praise is for Allah alone, but by saying that he praises Allah. \n\nRabb means owner, manager and caretaker. It contains the meaning of educating, that is conveying something to a perfect state gradually. Alamin means the whole of nature, namely all kinds of creatures. There are various types of nature, namely the natural world of plants, animals, humans, natural objects, natural spirits, for example angels, jinn, and other natural worlds. There are interpreters specializing 'alamin in this verse to Allah's intelligent creatures, namely humans, angels and jinns. But this narrows the meaning of the word which is actually very broad. Thus, Allah is the Educator of the entire universe, nothing from Allah's creation is separated from His upbringing. God educates His creatures with the broadest meaning of that word. As an educator, He grows, maintains, gives power (energy) and weapons to these creatures, for the perfection of each life. \n\nWho pays attention to the journey of the stars, investigates the life of plants and animals in the sea and on land, studying human growth from the womb of his mother to childhood, then becoming a perfect human being, he knows that there is nothing in God's creation that is apart from His care, maintenance, care and inayah."
		},
		{
			"id": 3,
			"surah": 1,
			"ayat": 3,
			"tafsir": "In verse two above Allah SWT explains that He is the Lord of all the worlds. So to remind me of the multiplied favors and gifts, which He has bestowed, as well as the nature and eternal love for Himself, He repeated once again calling ar-Rahman ar-Rahim. This is intended so that images of ferocity and tyranny such as kings who are masters and are arbitrary in nature disappear from the mind of the servant.\n\nAllah reminds in this verse that the nature of God's lordship over His servants is not the nature of violence and tyranny, but based on love and affection. Thus man will love his Lord, and worship Allah with a safe and secure heart, free from fear and anxiety. Instead he will take lessons from the attributes of God. He will base his association and behavior towards fellow human beings, or towards people under his leadership, even towards animals that can't even speak, on the nature of love and affection. Because in this way humans will receive mercy and grace from their Lord.\n\nRasulullah said:\n\nGod only loves His loving servants. (History at-tabrani)\n\nThose who are merciful, will be loved by Allah who is Rahman Tabaraka wa Ta'ala. (Therefore) love all creatures on earth, surely all creatures in the sky will love you all. (History of Ahmad, Abu Dawud at-Tirmidhi and al-hakim).\n\nRasulullah said: \n\n\"Whoever cares even for a bird (sparrow) that is slaughtered, Allah will love him on the Day of Judgment. (History al-Bukhari)\n\nThe meaning of the third hadith is to use rules and procedures when slaughtering birds, for example using a sharp knife. It can also be understood from the order of the words ar-Rahman, ar-Rahim, that God's care, maintenance and care for whole Nature, not because one expects something from nature, but solely because of His mercy and compassion.\n\nPerhaps it has occurred to people, why does Allah make rules and laws, and punishes those who break these rules? This thought will disappear when it is known that regulations and laws, as well as punishment in the hereafter or in the world that Allah has made for His servants who violate them, are not contrary to the nature of Allah, the Most Compassionate and Most Merciful, because regulations and laws are a mercy from Allah for the sake of human goodness itself. Likewise, Allah's punishment for His servants who break the rules and laws is in accordance with His justice."
		},
		{
			"id": 4,
			"surah": 1,
			"ayat": 4,
			"tafsir": "After Allah mentions some of His attributes, namely: Lord of all the worlds, Most Gracious, Most Merciful, then He accompanies Him by mentioning one more of His attributes, namely \"mastering the day of judgment\". The mention of this verse is intended so that God's power over nature does not stop in this world, but continues until the end of the day.\n\nThere are two kinds of readings regarding Malik. First, by lengthening ma, and second by shortening it. According to the first reading, Malik means \"the one who owns\" (the owner). While according to the second reading, it means \"King\". Both readings are correct.\n\nWhether according to the first reading or the second reading, it can be understood from that word the meaning of \"ruling\" and acting fully. That's why it is translated as \"the master\". \"Yaum\" means day, but what is meant here is absolute time. \n\nAd-din has many meanings, including: (1) calculation, (2) reward, retribution, (3) obedience, (4) subject, and (5) sharia, religion. What is in harmony here is the meaning of \"revenge\". So, Maliki yaumiddin means \"God is the one in power and who can act fully against all His creatures on the Day of Judgment.\"\n\nActually on the following day many things will happen, namely the Doomsday, resurrection, gathering, reckoning, vengeance, but it is vengeance that is mentioned by Allah here, because that is what is most important. Other than that, for example the doomsday, resurrection and so on, is a prelude to revenge, especially for targib and tarhib (promote and frighten), the mention of \"day of revenge\" is more appropriate. the hereafter, on which day an account will be held for human actions in their lifetime and appropriate retribution will be made, is a belief that is in accordance with reason. Therefore the existence of another life, after living in this world, is not only determined by religion, but also shown by reason. \n\nA person who wants to think will certainly feel that life in this world is not perfect, it needs to be continued with another life. How many people who are persecuted living in this world have returned to Rahmatullah before getting justice. How many people who have made small or big contributions, have not been rewarded for their services. How many people have tried, worked hard, worked hard, but have not yet had the chance to feel the fruit of their efforts. On the other hand, how many criminals, persecutors, troublemakers, who cannot be reached by the courts in this world. Moreover, if those who commit crimes or abuse are people who have the power as kings, officials and others. So even though the crimes and persecution have chained the entire nation, no one will sue them, instead they will still be worshiped and respected. So, where will justice be obtained, if later there is no higher court, the Court of Allah in the afterlife?\n\nTherefore, thinkers from ancient times have come to believe in the existence of the afterlife, solely by way of thinking, including Pythagoras. This philosopher argues that living in this world is the provision of eternal life in the hereafter. Therefore from the world let people be prepared for eternal life. Socrates, Plato and Aristotle argued, \"A good soul will experience pleasure and delights in the hereafter, but not material pleasures, because material pleasures are limited and bring boredom and boredom. Only spiritual delights, which no matter how many and long, does not cause boredom and boredom.\n\nArab Pre-Islamic Beliefs about the Hereafter\n\nAmong the pre-Islamic Arab communities there were several thinkers and poets who believed in a later day, such as Zuhair bin Abi Sulma who died a year before the Prophet Muhammad was sent by Allah as a messenger. \n\nThere are also those who do not believe in the afterlife. Hear what one of their poets said: \"Life, then death, after that resurrected again, that's a fairy tale, hai fulan.\" Because of this, the religion of Islam came, bringing certainty about the existence of the next day, big or small. Allah said:\n\n(7) So whoever does an atom's weight of good, surely he will see (reply) it, (8) and whoever does an atom's weight of evil, surely he will see (reply) it. (az-Zalzalah/99: 7-8)\n\nThere are not a few verses in the Qur'an which explain that there are indeed many among them who do not believe in the hereafter; live only in the world, after it is finished (al-An'am/6: 29 ; al-Mu'minun/23: 37). They say, if a father dies, then a child is born, if a nation goes extinct, then another nation comes. They do not believe that after death humans will still live again (Hud/11: 7; al-Isra'/17: 49) and there are many similar verses that describe such a stance. In the history of thought, it is recorded that since time immemorial there have been many such assumptions."
		},
		{
			"id": 5,
			"surah": 1,
			"ayat": 5,
			"tafsir": "In the previous verses four kinds of attributes of Allah are mentioned, namely: Educator of all nature, Most Compassionate, Most Merciful, and Master of the Day of Judgment. The qualities mentioned are the qualities of perfection that only Allah has. Therefore, in this verse, Allah teaches His servants that Allah alone is worthy of worship, and it is Him alone that humans should ask for help, and that His servants must make such a pledge. Iyyaka is dhamir for the second person in the position of mansub because it becomes maf'ul bih (object). In Arabic grammar, maf'ul bih must come after fi'il and fa'il. If prioritizing what should have been said then in the Balagah it shows qasr, namely a limitation which can be interpreted as \"only\". So the meaning of this verse is \"You alone we worship, and only You we ask for help\". -Each is specially presented to Allah and to be able to achieve the delicacy of munajat (talking) with Allah. Because for a servant of Allah who worships with all his soul and body there is nothing that is more enjoyable and delicious than having a munajat with Allah. will we be in His presence, and to Him be directed the conversation solemnly and humbly. It is as if we were saying: \n\n\"O Allah, the one who is obligatory to exist, Who is with all the attributes of perfection, Who guards and cares for the whole world, Who bestows His mercy and gifts multiplied, Who reigns on the Day of Judgment , You are the one we worship, and it is You alone we ask for help, because only You have the right to be worshiped, and only You can help us\".\n\nIn this way people will be more solemn in worshiping Allah and be more drawn to him the greatness he worshiped. This is what the Prophet meant by saying:\n\n\"You worship Allah as if you see Him (History of al-Bukhari and Muslim from 'Umar bin al-Khatthab).\n\nBecause surah al-Fatihah contains verses munajat (talking) with Allah according to the way which has been explained, it is a secret that it is obligatory to read it in every cycle of prayer, because its soul is munajat, by facing itself and focusing its memory on Allah. Allah is a human obligation towards His Lord. But help from Allah to His servants is the right of that servant. So Allah teaches His servants to fulfill their obligations first, before he claims his rights.\n\nSeeing the words na'budu and nasta'inu (we worship, we ask for help), not a'budu and asta'inu (I worship and I ask for help) is to show human weakness, it is not proper for humans to present themselves alone in worshiping and asking for help to Allah. It is as if the fulfillment of the obligation to worship and the request for help from Allah are not yet perfect, unless they are done together. please Allah. The meaning of \"worship\" as mentioned above is submission and surrender to Allah, which is caused by the awareness that Allah created this world, Who grows, who develops, who protects and maintains and Who brings it from one state to another. until it reaches perfection.\n\nStrictly speaking, worship arises from the feeling of monotheism. Therefore, a person who likes to think about the state of nature, who pays attention to the journey of the stars, the life of plants, animals and humans, and even who wants to pay attention to himself, can be sure that behind the zahir nature there is a supernatural substance that controls this nature. , which is characterized by all the characteristics of perfection, namely He is the Almighty, Most Compassionate, All-Knowing and so on. So a feeling of gratitude and indebtedness grows in his heart to the Almighty, All-loving and All-Knowing. it is a statement of gratitude and return of favor to Him. But there are also people who don't want to think, and are not aware of God's greatness and power, and often forget Him. For this reason, every religion prescribes various kinds of worship, the purpose of which is to remind people of the greatness and power of Allah. With this explanation it can be seen that monotheism and worship influence each other, in the sense that monotheism fosters worship, and worship fosters monotheism. affect the character and character of those who do it. For example, a person who prays because he is aware of the greatness and power of Allah, and is driven by feelings of gratitude and indebtedness to Him, will keep him far from doing bad deeds. Thus the prayer will prevent him from doing those bad deeds, according to the word of Allah SWT:\n\n\"Indeed, prayer prevents from (deeds) abominable and unjust.\" (al-'Ankabut/29: 45)\n\nSo is fasting. This worship will give rise to feelings of love and compassion for the poor. The same goes for the other services. True worship is worship that is engendered by belief in the greatness and power of God, and is driven by feelings of gratitude to God. Worship that is only for joining in, or for maintaining traditions that have been passed down for generations, is not true worship. Although it seems as if it is worship, it does not have a soul of worship. It's just like a statue, however it looks like a human being, it's not called a human being. Such worship has no effect on character and morals.\n\nTry, Pray and Trust\n\nIsti'anah (asking for help) as mentioned above is specifically presented to Allah, meaning that no one has the right to be asked for help except Allah . In another verse, Allah instructs humans to help each other in doing good. (al-Ma'idah/5: 2)\n\nIs there a contradiction between the two verses? \n\nAchieving a purpose, or carrying out a job well, depending on the fulfillment of the conditions needed in carrying out the work, and the absence of obstacles that prevent it. Humans have been given potential by God, both in the form of mind and body strength, so that they can meet the requirements or reject obstacles in achieving a goal, or doing a job. However, there are among those conditions that humans are unable to fulfill. Besides that, there were also obstacles that he was unable to resist. Likewise, there are among these conditions or among the obstacles that cannot be known. \n\nEven though in my mind all the necessary conditions are sufficient, and all the obstacles that get in the way have been successfully overcome, sometimes the results of the work are not as expected. There are things that are beyond the limits of human power and ability. That is what asked for special help to Allah. Preferably, for something that is still within the limits of power and ability, humans are asked to help each other, so that the nature of mutual love, respect, and mutual assistance arises in each individual. told to help each other, and help. In addition to carrying out endeavors and efforts, he must also pray, asking for taufik, guidance and ma'unah. This should be asked specifically to Allah, because only He has the power to give it. After all that, then he put his trust in Him.\n\nIbadah itu sendiri pun suatu pekerjaan yang berat, sebab itu haruslah dimintakan ma'unah dari Allah agar semua ibadah terlaksana sesuai dengan yang dimaksud oleh agama. Oleh karena itu, seseorang hendaknya menuturkan bahwa hanya kepada Allah sajalah kita beribadah, diikuti lagi dengan pernyataan bahwa kepada-Nya saja minta pertolongan, terutama pertolongan agar amal ibadah terlaksana sebagaimana mestinya. Ayat di atas, sebagaimana telah disebutkan, mengandung tauhid, karena beribadah semata-mata kepada Allah dan meminta ma'unah khusus kepada-Nya, adalah intisari agama, dan kesempurnaan tauhid."
		},
		{
			"id": 6,
			"surah": 1,
			"ayat": 6,
			"tafsir": "Ihdi: lead, show, give guidance. The meaning of \"guidance\" is to show a way or a way of conveying people to the people they are addressing, properly.\n\nTypes of Guidance (Guide)\n\nAllah has given humans various kinds of guidance, as also discussed in Tafsir Al-Fatihah by Muhammad Abduh.\n\n1. Guidance of Instinct (Garizah)\n\nHumans as well as animals, are equipped by Allah with various characteristics, which arise not from learning, nor from experience, but have been brought from their mother's womb. These qualities are called \"instinct\", in Arabic it is called garizah. For example, the instinct of \"wanting to protect oneself\" (preservation of life). A baby when he feels hungry he cries. After tasting his mother's nipple on his lips, he sucked it until his hunger was gone. This deed he did without anyone teaching him, nor did it arise from his experience, only inspiration and guidance from Allah to him, to sustain his life. \n\nAnother example is bees making their nests, spiders making their webs, ants making their holes. and hoard food in the hole. All that is done by the animals to maintain their lives and maintain themselves, by impulse alone. There are many other instincts, for example \"curiosity", "want to have", "want to compete", "want to play", "want to imitate", "fear\" , and others.\n\nInstinct Traits\n\nInstinct (garizah), as mentioned, is present in both humans and animals. The difference is that human instincts are amenable to education and improvement, but animal instincts are not. That's why humans can progress, while animals can't, they stay the same as before. \n\nThose instincts are the basis for good, and also the basis for evil. For example, the instinct of \"wanting to take care of oneself\", people try, trade, farm, meaning earn a living in a lawful way. On the other hand, because of the instinct of \"wanting to protect oneself\", people steal, cheat, rob and so on. Because the instinct of \"curiosity\" people learn, so they have a lot of knowledge and high education. On the other hand, because of this \"curiosity\" instinct, people also like to seek out the disgrace and secrets of each other, which results in hostility and disputes. And so it goes with the other instincts.\n\nThose instincts cannot be eradicated and there is no point in killing them. There are thinkers and educators who want to extinguish instincts, because they see the bad (evil) side of it. That's why they make various rules to bind children's independence so that those instincts don't grow, or which ones have grown die. But their actions are very dangerous for the growth of the mind, body and morals of children. However people try to kill that instinct, but it will not die.\n\nPerhaps because of the severity of the pressure and the strong resistance to an instinct, it appears that it has died out, but when someone awakens it, it reappears. Therefore, even though the instinct is the basis for good, as it is also the basis for evil, the human obligation is not to eliminate it, but to educate and train it, so that it can be utilized and channeled in a good direction.\n\nAllah has bestowed upon humans various instincts to be guidance (guidance) that will be used wisely.\n\n2. Pancaindra's Hidayah\n\nBecause instinct is uncertain as mentioned above, it is not enough to be a guide for the happiness of human life in this world and in the hereafter. Therefore, humans are equipped again by Allah SWT with five senses. The five senses play a very big role in the growth of the human mind and mind. In this regard, education experts say:\n\n(The five senses are the doors of knowledge).\n\nThe meaning is: it is by means of the five senses that humans can relate to the natural surroundings, in the sense that something from the natural surroundings reaches them into the human body. the human brain is through the doors of the five senses. But instinct, coupled with the five senses, is also not enough to become the basis of human happiness. There are many things in nature that cannot be seen by the eye. There are many kinds of sounds that cannot be heard by the ear. In fact, apart from the mahsusat realm (which can be captured by the five senses), there is another ma'qulat realm (which can only be grasped by reason). \n\nThe sense of sight (eyes) can only perceive the mahsusat realm, the catch about the mahsusat is not always right, sometimes wrong. This is what psychology calls \"optical illusion\" (deception of views), in Arabic it is called khida' an-nadhar. Because of that humans still need other guidance. So Allah bestowed a third guidance, namely \"guidance of reason\". Guidance of Intellect (mind)\n\na. Reason and level of ability\n\nWith the existence of reason, humans can channel instincts in a good direction, so that instincts become a source of goodness, and humans can correct errors in their five senses, distinguish between bad and evil. the good one. Reason is even capable of compiling preambles to convey them to the natijah, attributing effects to causes, using the mahsusat as a ladder to the ma'qulat, using what can be seen, touched and felt to arrive at the abstract, meaningful, and the occult, taking evidence from the existence of beings. to establish the existence of a creator, and so on.\n\nBut human reason is also not sufficient to bring him to the happiness of living in this world and in the hereafter besides the various kinds of instincts and senses. Moreover, the opinions of reason vary, what is good according to person A's mind is not necessarily good according to person B's view, in fact many people use their minds, but their minds are defeated by their desires and sentiments, so that what is bad becomes good in their eyes, and what is good it becomes bad.\n\nThus it is clear that instinct coupled with the five senses, and also added with reason is not enough to become guidance that will convey humans to the happiness of physical and spiritual life, in this world and the hereafter. Therefore, humans need other guidance, in addition to their senses and reason, namely religious guidance brought by the apostles 'alaihimus-salatu was-salam.\n\nb. The seeds of religion and the belief in monotheism in the human soul. If you look at the religions and beliefs created by humans (al-adyan al-wadh'iyyah), it can be seen that in the human soul there are seeds of religious tendencies. That's because humans have the nature of feeling indebted, like to thank and return favors to people who do good to him. So, when he pays attention to himself and the nature around him, for example the bread he eats, the plants he plants, the livestock he grazes, the sun that shines, the rain that falls from the sky that grows plants, he will feel indebted to \"a Substance\" that is unseen that has done good and bestowed great favors upon him.\n\nMan understands with his mind that it is this supernatural substance that creates him, that bestows upon him and the whole human kind, everything he needs in this nature, to nourish himself and sustain his life. Feeling indebted to an Unseen Substance, he thinks about how to thank and return the favor, or in other words how to \"worship the Unseen Substance\". is a difficult problem, which cannot be achieved by human reason. Therefore, in history it seems that there has never been uniformity in this matter. Even the human mind will lead him to believe in glorifying nature in addition to glorifying the Unseen Substance.\n\nBecause his mind is still simple and has not yet pictured in his brain how to worship the \"Unseen Substance\", then he chooses something big, beautiful, which has many benefits, or something he is afraid of to become a symbol for the Unseen Substance. That. When he admires the sun, moon and stars, rivers, animals and so on, then he worships these objects, as a symbol of worshiping God or the Unseen Substance, and creates ways of worshiping (worshiping) these objects. \n\nIn this way a kind of belief arose, which is called \"belief in worshiping the forces of nature\", as found in Egypt, the Chaldeans, Babylonia, Assyria and in other places in ancient times. With this description: It can be seen that humans, according to their nature, tend to be religious, often thinking about where this nature came from and where it will return. to belief in the oneness of God (tawhid), because this belief (belief) in the oneness of God is easier, and more quickly understood by the human mind. Because of that we can emphasize that according to instinct, human beings are monotheistic. After King Namrudz died, they deified and worshiped Namrudz. At first, the Assyrians were monotheistic, then they forgot the monotheistic creed and they associated God with the animals, and this was what the Babylonians chose. As for the Egyptians, if you pay attention to the songs they sing in worship ceremonies, it is clear that not all of the ancient Egyptians were polytheists and watsani (idol worshipers), but that among them there were also muwahhidin, adherents of the monotheistic creed. In the songs there are expressions as follows:\n\n\"He is God Almighty, Who has no partner for Him\"\n\n\"He loves all creatures, while He himself has no one who creates- His\"\n\n\"He is God Almighty, Owner of heaven and earth, Creator of all creatures\"\n\nIt can be emphasized that this belief in monotheism has never completely disappeared, and still exists. God Almighty is the creator of all that exists in this world. The other gods or gods they consider only as helpers and servants or symbols for the Almighty.\n\nc. Opinion of the Arabs before Islam about the Creator (Creator)\n\nThe Arabs before coming to Islam, if asked to them, \"Who made the heavens and this earth?\" They replied, \"Allah.\" If asked, \"Did al-Lata and al-Uzza create something that exists in this nature?\" They answered, \"No!\" Actually. Allah says about the words of the Arab polytheists:\n\n\"We do not worship them, but (hope) that they will bring us closer to Allah, as close as possible.\" (az-Zumar/39: 3)\n\nd. Belief in the afterlife can be achieved by reason\n\nWhen humans think about \"where is the return of this nature?\" he will arrive at the belief that behind living in a world that is this mortal will live again in the hereafter which is eternal and everlasting. But can man with his mind and mind alone know what needs to be done or avoided in preparation for happiness in the hereafter (the hereafter)? He replied, \"Of course no, history has also proven this.\"\n\nThus it can be concluded that man has been given reason by Allah to be a guide for him, in addition to instincts and senses. But the guidance of reason is not sufficient for the happiness of his life in this world and the hereafter. \n\nLikewise, humans have a religious nature, with their minds they sometimes reach monotheism.\n\nBy using his mind, humans can also come to the conclusion about the existence of the hereafter, but the guidance of reason is not sufficient for the happiness of his life in this world and the hereafter. So in order to convey people to the pure monotheistic faith, which is not interfered with in the slightest by beliefs of worshiping and exalting other than Allah, to lay out the right path to be followed in the journey of seeking happiness in life in this world and in the hereafter, and to be a guide in In his life in this world, he needs other guidance besides those mentioned above. So Allah brought the fourth guidance, namely \"religion\" which was brought by the apostles 'alaihimus-salatu was-salam.\n\n4. Religious guidance\n\na. Principles of divine religion\n\nAllah sent messengers to bring religion that would show people the path they should take for their happiness in this world and the hereafter. At first, what was instilled by the apostles was the belief in the existence of God Almighty with all His perfect attributes, in order to cleanse human intentions from shirk (associating partners with Allah). and logic, namely by using appropriate and logical arguments. The dialogue between Prophet Ibrahim and Namrudz, Prophet Musa and Pharaoh, and the appeals of the Qur'an to the Quraysh polytheists all invite them to use reason.\n\nIn addition to the belief in the existence of God Almighty, the apostles also calls to believe in the afterlife, and the angels.\n\nBelieving in the existence of God Almighty with all His perfect attributes, as well as the existence of angels and the day to come is called al-iman bi al-gaib (belief in the unseen). That is what is fundamental to all divine religions, in the sense that all religions that come from God believe in the oneness of God, the angels and the hereafter. rules, morals and lessons. These laws and regulations are not entirely the same, meaning that what was revealed to the Prophet Abraham was not the same as what was revealed to the Prophet Musa, and what was brought by the Prophet Isa was not the same as that brought by the Prophet Muhammad. This is because the laws and regulations must be in accordance with the conditions of the place and time. So the Shari'a brought by the prophets is in accordance with their respective times. So what is different are the laws of furu' (branches), while the main points of religious law such as creed are the same. Because Muhammad saw was the Seal of Prophets, the Shari'a he brought, was given certain characteristics by Allah to suit all times and circumstances.\n\nb. The guidance that is asked of God\n\nAllah has bestowed the religion of Islam as guidance and the final weapon of life, or the way to the last happiness, but is there everyone, good at using that weapon, and are all of Allah's servants successful in following the path that has been laid out by God?\n\nMany people misapply religion, do not worship (worship Allah) according to what is desired by those who are worshipped, do not carry out the Shari'a according to what is intended by the law maker. For this reason, Allah teaches humans how to ask Him to give them ma'unah, to guide and protect them forever, and to give them taufik so that they can take advantage of all kinds of guidance that have been bestowed accordingly. Instincts so that they can be channeled in a good direction, senses so that they are correct, reason so that they are in accordance with what is right, religious guidance so that it can be carried out according to what was intended by the one who sent down the religion, without any defects, awkwardness and mistakes, humans who have been given various kinds of guidance by Allah mentioned above (instinct, senses, reason and religion) are not enough, but they still need ma'unah and guidance from Allah (namely His taufik). ) Then ma'unah and guidance are what we ask for, and it is to Allah alone that we turn our requests. In other words, Allah has given humans these guidance, as if He had laid out a highway that will convey humans to the happiness of worldly and spiritual life. Then what is asked of Him again, is \"to guide us through the path that has been stretched out.\"\n\nSuccinctly guidance in the verse ihdinas-siratal-mustaqim means \"taufik\" (guidance), and taufik that is what is asked here of God. This taufik is asked to Allah after we have tried with all our energy, mind and endeavor, because trying with all our energy is our obligation, but the success of an endeavor belongs to the power of Allah. This shows the connection between this verse and the previous verse. In the previous verse Allah taught His servants to worship and ask Him for help, while in this verse Allah explained what to ask for and how to ask for it. So there is no contradiction between the two words of God and the word of God addressed to the Prophet:\n\n¦ And truly, you really guide (people) to the straight path. (asy-Shura/42: 52).\n\nIndeed, you (Muhammad) cannot guide those you love, but Allah guides those whom He wills, and He knows better those who are willing to receive guidance. (al-Qasas/28: 56).\n\nBecause what is meant by guidance in the first verse is to show the way to be taken, and this is indeed the task of the prophet. What is meant by guidance in the second verse is to guide people in taking that path and provide the means to be successful and happy on their journey, and this does not fall under the authority of the prophet, but is solely the right of Allah. target).\n\nWhat is meant by the straight path? It has been explained above that the apostles have brought aqa'id (beliefs), laws, regulations, morals, and lessons. In short, the apostles have brought everything that is necessary for the happiness of human life in this world and the hereafter.\n\nSo aqa'id, laws, regulations, morals and lessons are what is meant by the straight path, because he is which conveys humans to the happiness of living in this world and the hereafter as mentioned. So by mentioning this verse it is as if we are asking Allah, \"Guide and give us taufik, O Allah in carrying out our religious teachings. Correct our beliefs. Guide and give us taufik in carrying out our beliefs. Guide and give us taufik in implementing laws, regulations, and religious lessons us. Make us have noble morals, so that we will be happy in this world and the hereafter.\""
		},
		{
			"id": 7,
			"surah": 1,
			"ayat": 7,
			"tafsir": "After Allah SWT teaches His servants to ask Him to always guide them towards the straight and true path, in this verse Allah explains what the straight path is. Before the Qur'an was revealed, Allah had sent down His other holy books, and before the Prophet Muhammad was sent, Allah had sent messengers, because before the current ummah there were many previous ummah. In the early ummah there were prophets, siddiqins who justified the messengers honestly and obediently, martyrs' who sacrificed their lives and property for the glory of Allah's religion, and pious people who had made good deeds and avoided Allah's prohibitions.\n\nThey are the people who have been given favors by Allah, and we are taught to ask Him, so that He will give taufik and guidance as He has given taufik and guided them. This means that as they have been happy in aqa'id, in carrying out religious laws and regulations, and have had noble morals and ethics, so should we. In other words, Allah commands us to follow the example and example of those who were before us.\n\nThe question arises: why did Allah tell us to follow their previous path, even though in our religion there are lessons, laws and instructions that they do not have. The answer: actually the religion of Allah is one. Even though there are differences, the differences are in the parts, while the principals are similar, as already mentioned. the wrath of Allah and those who go astray. The people who were angry with God were those who did not want to accept God's call conveyed by the apostles, because it was different from their habits, or because it was not in accordance with their desires, even though it was clear that what the apostles brought was true. Also included in this group are those who initially accepted what was conveyed by the apostles, but then for some reason they turned their backs, and turned their backs on the lessons brought by the apostles. \n\nIn history there are many people who are angry Allah, since in the world they have been punished by Allah, as a fitting reward for their denial and insolent nature of their anger. For example, the people of 'ad and samud who have been destroyed by Allah. Until now there are still traces of their legacy on the Arabian Peninsula (peninsula). So did Pharaoh and his people who had been destroyed by Allah in the Red Sea. Pharaoh's mummy is still stored in museums in Egypt. If a person's faith is not correct, or his work and deeds are wrong, and his morals are corrupted, woe will be to him, and if a nation is in such a situation that nation will fall.\n\nSo with this verse Allah teaches His servants to ask to Him so far away from His wrath, and avoid error. It also contains God's commandment for humans to take lessons from the history of earlier nations. There are so many events in history that can be used as inspiration and lessons. In the Qur'an there are many verses that deal with the history of the peoples and nations of the past. Indeed, nothing has had a greater effect on the human soul than the examples and comparisons found in stories and history."
		}
	]
}
