{
	"tafseer": [
		{
			"id": 5376,
			"surah": 70,
			"ayat": 1,
			"tafsir": "These verses explain that Meccan polytheists such as an-Nadhr bin al-Harith asked the Prophet Muhammad to immediately inflict the promised doom on them, if the threat really came from Allah, and if Muhammad was really a messenger sent by Allah. This verse responds to this request by saying that the promised doom will surely befall the disbelievers, whether they are asked for it or not. Because, it has become sunatullah that punishment must befall on every disbeliever."
		   },
		   {
			"id": 5377,
			"surah": 70,
			"ayat": 2,
			"tafsir": "These verses explain that Meccan polytheists such as an-Nadhr bin al-Harith asked the Prophet Muhammad to immediately inflict the promised doom on them, if the threat really came from Allah, and if Muhammad was really a messenger sent by Allah. This verse responds to this request by saying that the promised doom will surely befall the disbelievers, whether they are asked for it or not. Because, it has become sunatullah that punishment must befall on every disbeliever."
		   },
		   {
			"id": 5378,
			"surah": 70,
			"ayat": 3,
			"tafsir": "The punishment comes from Allah at a predetermined time, and when it comes, no one can refuse it. The meaning of the words \"al-ma'arij\" (has a ladder) contained in this verse is that punishment comes from Allah, the Most High and Most Perfect. There is not the slightest deficiency in Allah, and the arrival of doom is solely at His will and decision, not based on the request of creatures, as was done by an-Nadhr bin al-Harith. From this verse it is understood that it is as if the polytheists do not know the glory and greatness of Allah. It is as if to Allah, all their will and desires can be asked, as they do to idols."
		   },
		   {
			"id": 5379,
			"surah": 70,
			"ayat": 4,
			"tafsir": "The angels and Jibril facing Allah takes a very short time and if it is done by humans it will take fifty thousand years. The number of 50,000 years mentioned in this verse is not the actual number, but to explain that the Throne of Allah is very far and high, none of His servants can reach it. Here are several other creatures of God of varying levels and abilities. In another word of God, it is explained that He arranges affairs from heaven to earth in a moment whose level is equal to a thousand years according to human reckoning: He arranges all affairs from heaven to earth, then (affairs) it ascends to Him in one day its measure (length) is a thousand years according to your reckoning. (As-Sajdah\/32: 5) Actually the question is how long this world lasts, and how long it takes for angels to ascend to Allah and then descend back to this world to carry out His commands, including things unseen. Only Allah knows for sure. For us as servants of Allah, it is enough to believe that there is Allah's punishment that will befall those who deny the Day of Judgment. In surahh Az-Zariyat\/51: 7, Allah swears by the sky which has roads. Scientifically, these roads can be interpreted as wormholes, namely shortcuts that connect one place to another in this universe. Then Allah confirms in surahh Al-Ma\\\\'arij\/70: 4 that He has ma'arij, where the angels and Gabriel ascend (facing) to God in a day which is fifty thousand years. As has been explained in the tafsir of surahh Az-Zariyat\/51: 7 that in the physical theory of general relativity, it is known about the mechanism of shortening very long distances to only a few meters which scientists currently call wormholes. These roads may be ma'arij, in which Allah further details that the angels and Gabriel ascended to Allah through these roads and it is described that they ascend in a day which is fifty thousand years. Although no physicist has used it yet, in wormholes we move without the need for energy. As soon as we enter it, the gravitational field pulls us in and suddenly we have been thrown somewhere else. In a wormhole, our watch moves slower and the wand we happen to be carrying shortens as well. However, once out, everything returned to normal, including the clock and stick that we brought. Anyone passing through this ma'arij will experience a dilation of time, that is, a day which is fifty thousand years on earth. It doesn't mean how long we go through ma'arij, but if we go this way we will be older by comparison. The journey of the Prophet during the Isra' Mi'raj, may have gone through a mechanism of shortening the distance so that such a long distance was traveled by the Prophet in just a few hours. When the Prophet told the events that happened to him, the disbelievers clearly did not believe it. Yet it is a sign of the greatness of God. It is interesting to note in surahh Al-Hijr\/15: 13-15: They do not believe in it (the Qur'an) even though circumcision has passed on the former people. And if We open for them one of the gates of heaven, then they continue to climb on it, they will surely say, \"Indeed it is our vision that has been obscured, even we are people who are enchanted.\" (Al-Hijr\/15: 13-15) Allah thus states that for those who do not believe, until the gates of heaven are opened and they pass through them, they will still argue that it is an illusion. Sub¥anallah, Allah gives a description of how to arrange His creatures. The angels were passing from place to place by using a special road called ma'arij, and the Prophet, the Beloved of Allah, had the opportunity to go through this ma'arij-special road on a very rocky night, namely Isra' Mi'raj ."
		   },
		   {
			"id": 5380,
			"surah": 70,
			"ayat": 5,
			"tafsir": "Rasulullah saw was told to be patient with the attitude of the polytheists who always made fun of him. He was also asked not to feel disturbed by their attitude, because matters of doom are God's business. Only Allah knows when the punishment will befall them."
		   },
		   {
			"id": 5381,
			"surah": 70,
			"ayat": 6,
			"tafsir": "The polytheists see that punishment is impossible to happen, because they are deceived by the temporary pleasures of this world. Also because they have very little knowledge and do not heed God's guidance."
		   },
		   {
			"id": 5382,
			"surah": 70,
			"ayat": 7,
			"tafsir": "However, the doom must occur because Allah is the one who determines everything. Nothing is difficult for Him. If He wills something to happen, it will happen when He wills it. Nothing can go against his will."
		   },
		   {
			"id": 5383,
			"surah": 70,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains the time of the coming of doom and the condition of mankind at that time. The punishment comes to the disbelievers when the sky is shattered, like silver that melts because it is heated, and when the mountains are shattered, as if the feathers of a bird are being blown away by a gust of wind. Confusion and suffering faced mankind at that time. Each of them could not help others, none of their close friends asked about their friends, while they saw and knew the suffering of their friends."
		   },
		   {
			"id": 5384,
			"surah": 70,
			"ayat": 9,
			"tafsir": "In this verse, Allah explains the time of the coming of doom and the condition of mankind at that time. The punishment comes to the disbelievers when the sky is shattered, like silver that melts because it is heated, and when the mountains are shattered, as if the feathers of a bird are being blown away by a gust of wind. Confusion and suffering faced mankind at that time. Each of them could not help others, none of their close friends asked about their friends, while they saw and knew the suffering of their friends."
		   },
		   {
			"id": 5385,
			"surah": 70,
			"ayat": 10,
			"tafsir": "In this verse, Allah explains the time of the coming of doom and the condition of mankind at that time. The punishment comes to the disbelievers when the sky is shattered, like silver that melts because it is heated, and when the mountains are shattered, as if the feathers of a bird are being blown away by a gust of wind. Confusion and suffering faced mankind at that time. Each of them could not help others, none of their close friends asked about their friends, while they saw and knew the suffering of their friends."
		   },
		   {
			"id": 5386,
			"surah": 70,
			"ayat": 11,
			"tafsir": "On that day, disbelievers hope that they will be released from the punishment they suffer, by redeeming themselves with children they are proud of, wives they love, brothers who used to help them while living in the world, people who always help and protect them. , and all human beings on earth. Because that's what they used to do in the world; help their friends, family and children, even if those who are being helped commit evil and unjust acts."
		   },
		   {
			"id": 5387,
			"surah": 70,
			"ayat": 12,
			"tafsir": "On that day, disbelievers hope that they will be released from the punishment they suffer, by redeeming themselves with children they are proud of, wives they love, brothers who used to help them while living in the world, people who always help and protect them. , and all human beings on earth. Because that's what they used to do in the world; help their friends, family and children, even if those who are being helped commit evil and unjust acts."
		   },
		   {
			"id": 5388,
			"surah": 70,
			"ayat": 13,
			"tafsir": "On that day, disbelievers hope that they will be released from the punishment they suffer, by redeeming themselves with children they are proud of, wives they love, brothers who used to help them while living in the world, people who always help and protect them. , and all human beings on earth. Because that's what they used to do in the world; help their friends, family and children, even if those who are being helped commit evil and unjust acts."
		   },
		   {
			"id": 5389,
			"surah": 70,
			"ayat": 14,
			"tafsir": "On that day, disbelievers hope that they will be released from the punishment they suffer, by redeeming themselves with children they are proud of, wives they love, brothers who used to help them while living in the world, people who always help and protect them. , and all human beings on earth. Because that's what they used to do in the world; help their friends, family and children, even if those who are being helped commit evil and unjust acts."
		   },
		   {
			"id": 5390,
			"surah": 70,
			"ayat": 15,
			"tafsir": "No ransom will be accepted for the sins committed by unbelievers. Allah does not need a ransom, He is Rich and does not need anything. Indeed, those who disbelieve and die in disbelief, will not be accepted (ransom) from one of them even if (in the form of) gold all over the earth, if he wants to redeem himself with it. They are the ones who will receive a painful punishment and will not find a helper. (Ali Imran\/3: 91) The doom provided for unbelievers is hell. No one is safe and can escape his doom. Hell calls on disbelievers to be punished, as well as those who turn their backs and flee from the truth, like to do wrong or evil, and like to collect wealth, but don't want to give alms and God's rights, as He has ordained. This verse does not aim to prohibit Muslims from collecting wealth. This verse only prohibits collecting wealth without removing the rights of Allah in the assets that have been collected."
		   },
		   {
			"id": 5391,
			"surah": 70,
			"ayat": 16,
			"tafsir": "No ransom will be accepted for the sins committed by unbelievers. Allah does not need a ransom, He is Rich and does not need anything. Indeed, those who disbelieve and die in disbelief, will not be accepted (ransom) from one of them even if (in the form of) gold all over the earth, if he wants to redeem himself with it. They are the ones who will receive a painful punishment and will not find a helper. (Ali Imran\/3: 91) The doom provided for unbelievers is hell. No one is safe and can escape his doom. Hell calls on disbelievers to be punished, as well as those who turn their backs and flee from the truth, like to do wrong or evil, and like to collect wealth, but don't want to give alms and God's rights, as He has ordained. This verse does not aim to prohibit Muslims from collecting wealth. This verse only prohibits collecting wealth without removing the rights of Allah in the assets that have been collected."
		   },
		   {
			"id": 5392,
			"surah": 70,
			"ayat": 17,
			"tafsir": "No ransom will be accepted for the sins committed by unbelievers. Allah does not need a ransom, He is Rich and does not need anything. Indeed, those who disbelieve and die in disbelief, will not be accepted (ransom) from one of them even if (in the form of) gold all over the earth, if he wants to redeem himself with it. They are the ones who will receive a painful punishment and will not find a helper. (Ali Imran\/3: 91) The doom provided for unbelievers is hell. No one is safe and can escape his doom. Hell calls on disbelievers to be punished, as well as those who turn their backs and flee from the truth, like to do wrong or evil, and like to collect wealth, but don't want to give alms and God's rights, as He has ordained. This verse does not aim to prohibit Muslims from collecting wealth. This verse only prohibits collecting wealth without removing the rights of Allah in the assets that have been collected."
		   },
		   {
			"id": 5393,
			"surah": 70,
			"ayat": 18,
			"tafsir": "No ransom will be accepted for the sins committed by unbelievers. Allah does not need a ransom, He is Rich and does not need anything. Indeed, those who disbelieve and die in disbelief, will not be accepted (ransom) from one of them even if (in the form of) gold all over the earth, if he wants to redeem himself with it. They are the ones who will receive a painful punishment and will not find a helper. (Ali Imran\/3: 91) The doom provided for unbelievers is hell. No one is safe and can escape his doom. Hell calls on disbelievers to be punished, as well as those who turn their backs and flee from the truth, like to do wrong or evil, and like to collect wealth, but don't want to give alms and God's rights, as He has ordained. This verse does not aim to prohibit Muslims from collecting wealth. This verse only prohibits collecting wealth without removing the rights of Allah in the assets that have been collected."
		   },
		   {
			"id": 5394,
			"surah": 70,
			"ayat": 19,
			"tafsir": "In this verse it is explained that humans have the nature of complaining and miserly. However, this nature can be changed if you follow God's instructions which He stated in verses 22 to 24 of this surah. Humans who do not pay attention to God's instructions and the messenger's call are people who are astray. Allah's Word: And most people will not believe even if you really want to. (Yusuf\/12: 103) Humans can go astray from God's way because of their haste, restlessness, and miserliness. This is not a provision from Allah towards them, but they become believers or become disbelievers because of their own efforts and choices. It is He who created you, then among you there are those who disbelieve and among you (also) there are those who believe. And Allah is Seeing of what you do. (At-Tagabun\/64: 2) A straight path is laid out for humans to please Allah and the happiness of life in this world and in the hereafter as conveyed by the Prophet, as contained in the Al-Qur'an and hadith. In addition, there is also a misguided path, a path that is displeased by Allah and leads to a place full of suffering and misery in the afterlife. Humans may choose one of the two paths; which way will he take, whether the straight path or the wrong path. Then they are rewarded according to their choice."
		   },
		   {
			"id": 5395,
			"surah": 70,
			"ayat": 20,
			"tafsir": "When people are beset by tribulations, they are impatient and steadfast, sometimes giving up. However, if he gets a lot of sustenance and gifts from Allah, he becomes stingy. Anxiety and stinginess arise in humans because they do not truly believe in Allah. He felt as if he was isolated, that nothing could help him in this predicament. However, when he gets sustenance, he feels that he gets this sustenance solely because of his own efforts, without the help of other people. They think that the sustenance and gifts they get are not gifts from God. Therefore, miserliness arises. It's different with people who believe. He believes that everything that comes to him is a test and trial from God, whether it comes in the form of suffering or pleasure. The trials were given to him to test and strengthen his faith. Therefore, he remains steadfast and patient in accepting all trials, and repents to Allah with real repentance if there is a mistake he has made. On the other hand, if he receives mercy and bounty from Allah, he is grateful to Him and feels himself bound by that grace. Then he took out the rights of other people or the rights of Allah that were in his wealth, as the Prophet Ayub had done: And (remember the story of) Job, when he prayed to his Lord, \"(O my Lord), indeed, I have been afflicted with a disease, even though You Lord, the Most Merciful of all the merciful.\" So We granted him (prayer), then We removed the disease that was in him and We returned his family to him, and (We multiplied their number) as a mercy from Us, and to be a warning to all who worship Us. (Al-Anbiya'\/21: 83-84) A believer will not grieve or give up on world affairs that escape him, and will not affect his soul, because he believes in Qada and Qadar Allah. It is not certain that what is thought to be bad is also bad in the sight of Allah, and what is thought to be good is also good in His sight. Maybe on the contrary, what is thought to be bad is good in the sight of Allah and what seems good is bad in the sight of Allah. He is sure that this is true, because Allah stated in His word: If you don't like them, (then be patient) because maybe you don't like something, even though Allah has made a lot of goodness in it. (an-Nisa\\\\\\'\/4: 19) As for the disbelievers, they do not have such beliefs. They do not believe that the joys and sorrows that God brings to someone are God's trials to him. They thought that it was a disaster for him. When in a happy and joyful state, they only see as if they are the only ones who exist, while the others do not exist, as Allah says: People do not tire of asking for good, and when calamity befalls them, they despair and lose hope. And if We give him a mercy from Us after being afflicted, he will surely say, “This is my right, and I am not sure that the Day of Resurrection will occur. And if I am returned to my Lord, surely I will get good with Him.\" So indeed, We will inform the disbelievers about what they have done, and indeed, We will inflict a severe punishment on them. (Fussilat\/41: 49-50)"
		   },
		   {
			"id": 5396,
			"surah": 70,
			"ayat": 21,
			"tafsir": "When people are beset by tribulations, they are impatient and steadfast, sometimes giving up. However, if he gets a lot of sustenance and gifts from Allah, he becomes stingy. Anxiety and stinginess arise in humans because they do not truly believe in Allah. He felt as if he was isolated, that nothing could help him in this predicament. However, when he gets sustenance, he feels that he gets this sustenance solely because of his own efforts, without the help of other people. They think that the sustenance and gifts they get are not gifts from God. Therefore, miserliness arises. It's different with people who believe. He believes that everything that comes to him is a test and trial from God, whether it comes in the form of suffering or pleasure. The trials were given to him to test and strengthen his faith. Therefore, he remains steadfast and patient in accepting all trials, and repents to Allah with real repentance if there is a mistake he has made. On the other hand, if he receives mercy and bounty from Allah, he is grateful to Him and feels himself bound by that grace. Then he took out the rights of other people or the rights of Allah that were in his wealth, as the Prophet Ayub had done: And (remember the story of) Job, when he prayed to his Lord, \"(O my Lord), indeed, I have been afflicted with a disease, even though You Lord, the Most Merciful of all the merciful.\" So We granted him (prayer), then We removed the disease that was in him and We returned his family to him, and (We multiplied their number) as a mercy from Us, and to be a warning to all who worship Us. (Al-Anbiya \\'\/21: 83-84) A believer will not grieve and give up on world affairs that escape him, and will not affect his soul, because he believes in Qada and Qadar Allah. It is not certain that what is thought to be bad is also bad in the sight of Allah, and what is thought to be good is also good in His sight. Maybe on the contrary, what is thought to be bad is good in the sight of Allah and what seems good is bad in the sight of Allah. He is sure that this is true, because Allah stated in His word: If you don't like them, (then be patient) because maybe you don't like something, even though Allah has made a lot of goodness in it. (an-Nisa\\'\/4: 19) As for the disbelievers, they do not have such beliefs. They do not believe that the joys and sorrows that God brings to someone are God's trials to him. They thought that it was a disaster for him. When in a happy and joyful state, they only see as if they are the only ones who exist, while the others do not exist, as Allah says: People do not tire of asking for good, and when calamity befalls them, they despair and lose hope. And if We give him a mercy from Us after being afflicted, he will surely say, “This is my right, and I am not sure that the Day of Resurrection will occur. And if I am returned to my Lord, surely I will get good with Him.\" So indeed, We will inform the disbelievers about what they have done, and indeed, We will inflict a severe punishment on them. (Fussilat\/41: 49-50)"
		   },
		   {
			"id": 5397,
			"surah": 70,
			"ayat": 22,
			"tafsir": "Such are the characteristics of humans in general, except for those who pray. Salat is the second pillar of Islam; sign that distinguishes between a believer and an unbeliever. If someone prays, it means he has a relationship with his Lord. He will always remember his Lord. Conversely, if he does not pray, he will forget his Lord so that the relationship is cut off. Truly, I am Allah, there is no god but Me, so worship Me and perform the prayer to remember Me. (°aha\/20: 14) If people are truly absorbed in their prayers, it means that their hearts and minds are focused on Allah alone. He felt face to face with Allah in his prayer. Fear arises in his heart because of the sins he has committed besides being full of hope for the abundance of His rewards, grace, and gifts. Therefore, he promised in his heart to stay away from and stop His prohibitions. His heart surrendered and peacefully surrendered himself to Him. People who pray in this way will be protected from heinous and unjust acts. Read the Book (Qur'an) that has been revealed to you (Muhammad) and pray. Verily prayer prevents from (deeds) abominable and unjust. And (know) the remembrance of Allah (prayer) is greater (its priority than other acts of worship). Allah knows what you do. (Al-'Ankabµt\/29: 45) This verse mentions prayer in a general sense, including the five obligatory prayers and sunnah prayers. This means that all the prayers that Allah commands to do can eliminate anxiety, reassure the heart, and increase the strength of the faith of those who do them. Even so, of course the prayer that is most prioritized to do it is the five daily prayers. Then it was continued that the prayer was always done at every appointed time, continuously, nothing was missed even though one prayer. This is the condition of performing the prayer that can eliminate anxiety and stinginess."
		   },
		   {
			"id": 5398,
			"surah": 70,
			"ayat": 23,
			"tafsir": "Such are the characteristics of humans in general, except for those who pray. Salat is the second pillar of Islam; sign that distinguishes between a believer and an unbeliever. If someone prays, it means he has a relationship with his Lord. He will always remember his Lord. Conversely, if he does not pray, he will forget his Lord so that the relationship is cut off. Truly, I am Allah, there is no god but Me, so worship Me and perform the prayer to remember Me. (Thaha\/20: 14) If people are truly solemn in their prayers, it means that their hearts and minds are focused on Allah alone. He felt face to face with Allah in his prayer. Fear arises in his heart because of the sins he has committed besides being full of hope for the abundance of His rewards, grace, and gifts. Therefore, he promised in his heart to stay away from and stop His prohibitions. His heart surrendered and peacefully surrendered himself to Him. People who pray in this way will be protected from heinous and unjust acts. Read the Book (Qur'an) that has been revealed to you (Muhammad) and pray. Verily prayer prevents from (deeds) abominable and unjust. And (know) the remembrance of Allah (prayer) is greater (its priority than other acts of worship). Allah knows what you do. (Al-'Ankabµt\/29: 45) This verse mentions prayer in a general sense, including the five obligatory prayers and sunnah prayers. This means that all the prayers that Allah commands to do can eliminate anxiety, reassure the heart, and increase the strength of the faith of those who do them. Even so, of course the prayer that is most prioritized to do it is the five daily prayers. Then it was continued that the prayer was always done at every appointed time, continuously, nothing was missed even though one prayer. This is the condition of performing the prayer that can eliminate anxiety and stinginess."
		   },
		   {
			"id": 5399,
			"surah": 70,
			"ayat": 24,
			"tafsir": "In addition to performing prayers to remember and serve Allah, humans are commanded to always research the treasures that Allah has bestowed upon them; whether or not the property has the rights of the poor who beg, and the poor who do not have anything. If there is a right for them, he immediately removes it because he believes that as long as there are other people's rights in his property, it means that his property is not sacred. Take zakat from their property, to clean and purify them, and pray for them. (at-Taubah\/9: 103) From the words ¥aqq ma'lµm (certain parts) it is understood that what is meant in this verse is obligatory alms, namely zakat. This is reinforced by the mention of it in this verse accompanied by the mention of prayer. In the Al-Qur'an there are twenty-seven places which mention simultaneously the command to pray with the command to give zakat. This shows that the two have a close relationship. By praying, a person can purify himself from all shirk and forbidden acts, and submit and serve himself only to Allah. Whereas with zakat, a person can purify his wealth from the property of other people and instill confidence in himself that the wealth that God has given him must be used and used for a path that pleases Him. Wealth is only a tool to seek His pleasure, not as a goal in life. In other words, zakat is the result and embodiment of the success of one's prayers."
		   },
		   {
			"id": 5400,
			"surah": 70,
			"ayat": 25,
			"tafsir": "In addition to performing prayers to remember and serve Allah, humans are commanded to always research the treasures that Allah has bestowed upon them; whether or not the property has the rights of the poor who beg, and the poor who do not have anything. If there is a right for them, he immediately removes it because he believes that as long as there are other people's rights in his property, it means that his property is not sacred. Take zakat from their property, to clean and purify them, and pray for them. (at-Taubah\/9: 103) From the words ¥aqq ma'lµm (certain parts) it is understood that what is meant in this verse is obligatory alms, namely zakat. This is reinforced by the mention of it in this verse accompanied by the mention of prayer. In the Al-Qur'an there are twenty-seven places which mention simultaneously the command to pray with the command to give zakat. This shows that the two have a close relationship. By praying, a person can purify himself from all shirk and forbidden acts, and submit and serve himself only to Allah. Whereas with zakat, a person can purify his wealth from the property of other people and instill confidence in himself that the wealth that God has given him must be used and used for a path that pleases Him. Wealth is only a tool to seek His pleasure, not as a goal in life. In other words, zakat is the result and embodiment of the success of one's prayers."
		   },
		   {
			"id": 5401,
			"surah": 70,
			"ayat": 26,
			"tafsir": "People who don't like to complain are people who pray and pay zakat. They are the ones who believe in the Day of Resurrection, the existence of life after death, and when all the deeds that have been done while living in the world are weighed. Good deeds are rewarded with heaven, while evil deeds, which are not pleased by Allah, will be rewarded with hell. People who believe in the existence of the afterlife are very sure that on that day they will receive the reward of faith and charity that they have done while living in this world. They believe that living in the afterlife is the real life; while living in this world is only a temporary life, to prepare oneself for life in the hereafter. Therefore, all kinds of trials that come to them while in the world, are faced with steadfastness and patience. They never complain, no matter what trials they suffer. Nor will they be stingy to help others who live in poverty and suffering. It has become the basis for the happiness of human life is that his efforts to avoid harm and harm are always greater and take precedence over his efforts to obtain happiness and benefit. However, humans in their daily lives sometimes forget or neglect this basis. He is sometimes quick to be taken in by anything that seems to be doing him good or benefiting him. So do something without taking into account or considering the harm it will cause. As a result he suffers and is miserable. That is the punishment and punishment from God for that negligence. There is a rule of Usul Fiqh which reads: Rejecting harm takes precedence over taking benefit."
		   },
		   {
			"id": 5402,
			"surah": 70,
			"ayat": 27,
			"tafsir": "People who don't like to complain are people who pray and pay zakat. They are the ones who believe in the Day of Resurrection, the existence of life after death, and when all the deeds that have been done while living in the world are weighed. Good deeds are rewarded with heaven, while evil deeds, which are not pleased by Allah, will be rewarded with hell. People who believe in the existence of the afterlife are very sure that on that day they will receive the reward of faith and charity that they have done while living in this world. They believe that living in the afterlife is the real life; while living in this world is only a temporary life, to prepare oneself for life in the hereafter. Therefore, all kinds of trials that come to them while in the world, are faced with steadfastness and patience. They never complain, no matter what trials they suffer. Nor will they be stingy to help others who live in poverty and suffering. It has become the basis for the happiness of human life is that his efforts to avoid harm and harm are always greater and take precedence over his efforts to obtain happiness and benefit. However, humans in their daily lives sometimes forget or neglect this basis. He is sometimes quick to be taken in by anything that seems to be doing him good or benefiting him. So do something without taking into account or considering the harm it will cause. As a result he suffers and is miserable. That is the punishment and punishment from God for that negligence. There is a rule of Usul Fiqh which reads: Rejecting harm takes precedence over taking benefit."
		   },
		   {
			"id": 5403,
			"surah": 70,
			"ayat": 28,
			"tafsir": "Not a single human being feels safe from the coming of his Lord's punishment. Therefore, he tries to keep him away from the punishment by fearing Him. God's punishment will only be inflicted on people who do not fear Him. All those who truly believe, perform the obligatory prayers, pay zakat, and believe in the existence of the hereafter, the day when true justice is carried out, will have peace of mind and will not worry about the coming of Allah's punishment, even if they cannot be certain whether they are among the inhabitants. heaven or hell. What reassures the heart of a believer is faith and good deeds that have been done. Allah's Word: Whoever believes in Allah, in the Last Day, and does good, then there is no fear of him and they are not sad. (al-Ma'idah\/5: 69) And His words: No! Whoever submits himself completely to Allah, and he does good, he will be rewarded with his Lord and there is no fear of them and they do not grieve. (al-Baqarah\/2: 112)"
		   },
		   {
			"id": 5404,
			"surah": 70,
			"ayat": 29,
			"tafsir": "In these two verses, it is explained that the nature of a human being whose heart is peaceful, does not complain and is not stingy, that is, one who maintains his honor and does not commit adultery. They only do what has been made lawful, only having intercourse with their wives or with the female slaves they already have. The words fa innahum gairu malµm³n (then in fact they are not reprehensible) convey the meaning that the right to interfere with one's wife or slaves is not an unlimited right, but must be adapted to religious provisions. According to Islam, the husband and wife relationship is a sacred relationship, a relationship that pleases Allah, a relationship of love, a relationship motivated by the desire to follow the Sunnah of the Prophet, and the desire to have children. Husband-wife relationship has elements of worship. This relationship is described in the word of God: It is lawful for you to fast at night to mix with your wife. They are clothes for you, and you are clothes for them. (Al-Baqarah\/2: 187) Rasulullah SAW said: From 'Abdullah bin 'Amr that Rasulullah SAW said, \"The world is something pleasant, the best property of world life is a pious wife.\" (Muslim History) This verse gives instructions to husbands and wives that in having a relationship with a wife or husband, the master with the slave girl, it should be done in such a way, so that in that relationship there are elements of worship, noble character, good manners, and so on, so as to maintain the glory and dignity as a Muslim. Not just fulfilling lust, biological needs, or like what animals do, but for a noble purpose. This surahh Al-Ma'arij is Makkiyyah, so at that time there were no provisions for marriage as later regulated in surahh an-Nisa'\/4: 24-25. The words au ma malakat aimanuhum which are found in several surahhs, are often translated \"or the female slaves they have\". , which now belongs to him (usually from prisoners of war), and must in the sense of prisoners in jihad wars, under the orders of a pious and just imam in dealing with opponents who want to oppress believers. Captive women may have intercourse, but must be married first, and marriage is not driven by lust, but to maintain the chastity of the woman, which in this case means that the husband avoids committing adultery and at the same time elevates the dignity of the woman from the status of a former prisoner of war slave. (which was generally accepted at that time) became their women, no longer having the status of slaves. This habit of prisoners of war is now no longer valid. If a Muslim has been able to have relations with his wife or with his slaves in accordance with the requirements of the Islamic religion, it means that he has mastered the peak of his lust, because the peak of lust lies in relationships such as between men and women. If they have been able to do that, then they will be more able to do other things at a lower level."
		   },
		   {
			"id": 5405,
			"surah": 70,
			"ayat": 30,
			"tafsir": "In these two verses, it is explained that the nature of a human being whose heart is peaceful, does not complain and is not stingy, that is, one who maintains his honor and does not commit adultery. They only do what has been made lawful, only having intercourse with their wives or with the female slaves they already have. The words fa innahum gairu malµm³n (then in fact they are not reprehensible) convey the meaning that the right to interfere with one's wife or slaves is not an unlimited right, but must be adapted to religious provisions. According to Islam, the husband and wife relationship is a sacred relationship, a relationship that pleases Allah, a relationship of love, a relationship motivated by the desire to follow the Sunnah of the Prophet, and the desire to have children. Husband-wife relationship has elements of worship. This relationship is described in the word of God: It is lawful for you to fast at night to mix with your wife. They are clothes for you, and you are clothes for them. (Al-Baqarah\/2: 187) Rasulullah SAW said: From 'Abdullah bin 'Amr that Rasulullah SAW said, \"The world is something pleasant, the best property of world life is a pious wife.\" (Muslim History) This verse gives instructions to husbands and wives that in having a relationship with a wife or husband, the master with the slave girl, it should be done in such a way, so that in that relationship there are elements of worship, noble character, good manners, and so on, so as to maintain the glory and dignity as a Muslim. Not just fulfilling lust, biological needs, or like what animals do, but for a noble purpose. This surahh Al-Ma'arij is Makkiyyah, so at that time there were no provisions for marriage as later regulated in surahh an-Nisa'\/4: 24-25. The words au ma malakat aimanuhum which are found in several surahhs, are often translated \"or the female slaves they have\". , which now belongs to him (usually from prisoners of war), and must in the sense of prisoners in jihad wars, under the orders of a pious and just imam in dealing with opponents who want to oppress believers. Captive women may have intercourse, but must be married first, and marriage is not driven by lust, but to maintain the chastity of the woman, which in this case means that the husband avoids committing adultery and at the same time elevates the dignity of the woman from the status of a former prisoner of war slave. (which was generally accepted at that time) became their women, no longer having the status of slaves. This habit of prisoners of war is now no longer valid. If a Muslim has been able to have relations with his wife or with his slaves in accordance with the requirements of the Islamic religion, it means that he has mastered the peak of his lust, because the peak of lust lies in relationships such as between men and women. If they have been able to do that, then they will be more able to do other things at a lower level."
		   },
		   {
			"id": 5406,
			"surah": 70,
			"ayat": 31,
			"tafsir": "Anyone who acts outside these provisions, for example, commits adultery, is homosexual or lesbian, they are transgressors. In the previous verse, it was explained that one of the conditions for getting rid of complaining and miserliness is maintaining one's honor and glory, namely only by interfering with one's wife or slave. Apart from that, by staying away from actions that can encourage or accelerate people to do prohibited acts, such as promiscuity between men and women, and so on. Therefore, Allah confirms in His word: Say to men who believe, that they guard their eyes, and guard their private parts; that is purer for them. Indeed, Allah is All-Knowing of what they do. (an-Nµr\/24: 30) In this verse it can be understood that Allah commands that Muslims maintain their view is to protect themselves from adultery."
		   },
		   {
			"id": 5407,
			"surah": 70,
			"ayat": 32,
			"tafsir": "In this verse, Allah explains other conditions that can eliminate the nature of being complaining and miserly, namely maintaining the mandate entrusted to him, both in the form of Allah's mandate, such as the obligation to believe, perform prayers, pay zakat, perform hajj, jihad, and so on. , as well as human mandates towards him, such as maintaining private parts, fulfilling promises, and so on. The mandate is an agreement to maintain something done by the servant to his Lord, himself and others. Being able to maintain a mandate is one of the characteristics of a Muslim, and it is this trait that distinguishes the believer from the hypocrite. The Prophet Muhammad said: The Prophet Muhammad said, \"The signs of a hypocrite are three, namely: when he says, he lies, when he makes a promise, he breaks it (breaks him), and when he is given a mandate, he betrays.\" (History of al-Bukhari and Muslim from Abu Hurairah)"
		   },
		   {
			"id": 5408,
			"surah": 70,
			"ayat": 33,
			"tafsir": "The meaning of the phrase \"a person who adheres to his testimony\" contained in this verse is a person who is willing to testify when necessary and when he becomes a witness, he does it correctly, does not lie, does not change or hide anything in his testimony. God's Word: And do not hide testimony, for whoever hides it, verily, his heart is dirty (sin). Allah is All-Knowing of what you do. (al-Baqarah\/2: 283) Humans are also ordered to carry out testimony in order to uphold justice with the aim of seeking the pleasure of Allah, not for a purpose that is contrary to His teachings. Witness with two witnesses who are just among you and uphold the testimony for Allah. (Al-Alaq\/65: 2)"
		   },
		   {
			"id": 5409,
			"surah": 70,
			"ayat": 34,
			"tafsir": "Apart from what has been mentioned above, there is still one more thing that can eliminate the nature of complaining and miserliness, namely always maintaining prayer. The definition of maintaining prayer in this verse is: 1. Trying to complete the requirements of prayer properly and perfectly, such as examining the clothes worn so that there is no uncleanness, performing ablution properly, and setting aside everything that can eliminate or reduce solemnity. 2. Trying to carry out all the pillars of prayer properly and perfectly. 3. Strive earnestly. 4. Trying to carry out the five obligatory prayers. 5. Try to perform the prayer at the beginning of its time."
		   },
		   {
			"id": 5410,
			"surah": 70,
			"ayat": 35,
			"tafsir": "Humans who have the characteristics above will be rewarded by heaven in the hereafter and people who are like that will be able to erode the nature of complaining and miserliness from his heart."
		   },
		   {
			"id": 5411,
			"surah": 70,
			"ayat": 36,
			"tafsir": "According to some commentators, this verse relates to the incident when Rasulullah saw was praying and reading the Qur'an near the Kaaba. Then the polytheists gathered in groups around him, mocking and saying that they deserve more to enter heaven than the Muslims, because they are more noble. The Meccan polytheists who came to the Prophet rushed to sit on his right and left to hear and pay attention to the verses he was reading, as if they believed them. When they heard the Holy Prophet reading the Qur'an, they bulged their eyes like people in fear. They sat on either side of the Prophet in groups and seemed to be paying attention to the verses being recited. They also nodded their heads, but their real intention was to insult the Prophet Muhammad."
		   },
		   {
			"id": 5412,
			"surah": 70,
			"ayat": 37,
			"tafsir": "According to some commentators, this verse relates to the incident when Rasulullah saw was praying and reading the Qur'an near the Kaaba. Then the polytheists gathered in groups around him, mocking and saying that they deserve more to enter heaven than the Muslims, because they are more noble. The Meccan polytheists who came to the Prophet rushed to sit on his right and left to hear and pay attention to the verses he was reading, as if they believed them. When they heard the Holy Prophet reading the Qur'an, they bulged their eyes like people in fear. They sat on either side of the Prophet in groups and seemed to be paying attention to the verses being recited. They also nodded their heads, but their real intention was to insult the Prophet Muhammad."
		   },
		   {
			"id": 5413,
			"surah": 70,
			"ayat": 38,
			"tafsir": "Allah said that the actions of the polytheists were very surprising. Do they do this because they want to go to heaven? This is not possible because they deny the verses of the Qur'an. Allah provides heaven only for those who believe and do good deeds, not for unbelievers like them."
		   },
		   {
			"id": 5414,
			"surah": 70,
			"ayat": 39,
			"tafsir": "They think they will enter heaven, because they feel more noble and have a higher degree than those who believe. However, their assumption is wrong because they are made from semen just like all humans, there is no difference. There is no one person's privilege over another and Allah does not discriminate between them. The only thing that distinguishes the degree of a human being from other human beings is only faith and charity. This is God's law and no one can change it."
		   },
		   {
			"id": 5415,
			"surah": 70,
			"ayat": 40,
			"tafsir": "Allah swears by Himself as the Lord of rulers and owner of the universe and all in it, to confirm that He has the power to destroy them instantly and replace them with other people who are better than them. No one can resist His will or avoid the punishment that will be inflicted on it. In another verse, Allah says: Do you not see that Allah has created the heavens and the earth with (true) rights? If He had willed, He would have destroyed you and brought in a new creature (to replace you), and that would not be difficult for Allah. (Ibrahim\/14: 19-20) At the end of this verse, it is emphasized that Allah cannot be defeated by anyone who has been punished for him. They will not be able to avoid it as He explained in His other words: Or do those who do evil think that they will escape (punishment) Us? It's so bad what they charge it! (al-'Ankabµt\/29: 4)"
		   },
		   {
			"id": 5416,
			"surah": 70,
			"ayat": 41,
			"tafsir": "Allah swears by Himself as the Lord of rulers and owner of the universe and all in it, to confirm that He has the power to destroy them instantly and replace them with other people who are better than them. No one can resist His will or avoid the punishment that will be inflicted on it. In another verse, Allah says: Do you not see that Allah has created the heavens and the earth with (true) rights? If He had willed, He would have destroyed you and brought in a new creature (to replace you), and that would not be difficult for Allah. (Ibrahim\/14: 19-20) At the end of this verse, it is emphasized that Allah cannot be defeated by anyone who has been punished for him. They will not be able to avoid it as He explained in His other words: Or do those who do evil think that they will escape (punishment) Us? It's so bad what they charge it! (al-'Ankabµt\/29: 4)"
		   },
		   {
			"id": 5417,
			"surah": 70,
			"ayat": 42,
			"tafsir": "This verse is a strong warning to the polytheists who always oppose and deny the call of the Prophet Muhammad. Various ways have been done to awaken, but they still deny. Therefore, Allah ordered the Prophet Muhammad to let the polytheists deny his call, so that they would sink into misguidance and be neglectful of the pleasures of life they enjoy. They must die and then be resurrected on the Day of Judgment. It was only on that day that they learned the truth of the message that the Prophet had conveyed to them, namely when they were asked to account for all their actions in the world."
		   },
		   {
			"id": 5418,
			"surah": 70,
			"ayat": 43,
			"tafsir": "On the Day of Judgment, they will be revived and raised from the graves. They came hastily to answer the call that called them that time in the hope that the call would contain something pleasant. They came in haste as when they came to worship their idols when they were on earth."
		   },
		   {
			"id": 5419,
			"surah": 70,
			"ayat": 44,
			"tafsir": "On that promised day, the polytheists ran with their heads bowed towards Allah's judgment. That was the day that Allah had warned them about. That day was a day full of misery and suffering. On that day nothing can help except Allah."
		   }
	]
}
