{
	"tafseer": [
		{
			"id": 1161,
			"surah": 8,
			"ayat": 1,
			"tafsir": "This verse discusses the issue of the spoils of war that were obtained by the Muslims after the end of the Badr Kubra War. This war ended with the victory of the Muslims. They got a lot of spoils of war. Al-Anfal (al-Ganimah) are all kinds of property obtained by the Muslims from the enemy in the battlefield. These spoils of war are called al-Anfal (plural of Nafal) because these treasures became the property of the Muslims. After the Muslims got the spoils of war, there was a disagreement between those who participated in the war. The dispute is about the ways in which it is distributed, and which parties are entitled to receive it. The youth side or the old people side, the Muhajireen side or the Ansar side, or does each side equally get a share. The matter was brought to Rasulullah saw in order to get a fair decision. As an answer to the questions of the Muslims, Allah ordered the Messenger of Allah to determine the law, that the spoils of war are the right of Allah and His Messenger. Therefore, it is not the youth group or the elderly group that determines the distribution of the loot, not the Muhajirin or Ansar people, nor the attacking team, the protection team, or the team collecting spoils of war, but it is Allah who determines with the revelations sent down to His Apostle. The Prophet divided the spoils of war equally among the Muslims. This stipulation contains a high lesson for the Muslims so that they do not think that the spoils of war they have obtained are rewards for war services, but they have only received them because of the grace of Allah. If they think that they got the spoils of war as compensation for services, then their struggle is not purely because of Allah and following the orders of His Messenger. This verse also gives encouragement to Muslims, so that when they face heavy responsibilities, they should face them together, and when they get pleasure, they feel it together too. Regarding the distribution of spoils of war, the tafsir will be explained in detail in verse 41 of this surahh. Allah also ordered the Messenger of Allah to be pious to the Muslims, to stay away from disputes and disputes that cause trouble and lead them to the wrath of Allah. Piety is required in every situation, especially in war and the distribution of spoils of war, the consequences of disputes can be felt, namely the disruption of unity and the emergence of divisions that result in defeat. After that Allah ordered that Muslims improve relations among Muslims, namely establishing love and strengthening the unity of opinion. This is what can bind them in a united movement in achieving a common goal, namely to elevate the Word of God. This unity and oneness is the basis of the strength of the Ummah in all fields. That is why, improving relations among fellow Muslims is obligatory, so that Muslims are aware of the importance of avoiding the dangers that threaten them, the dangers of rifts that shake the unity of the Ummah. This is clearly illustrated when disputes occur between groups because one group feels more meritorious than the other group. Likewise this happens because they forget their important duty, namely that the task of defending the truth is a collective responsibility. At the end of the verse, Allah confirms that Muslims obey Allah and the Prophet, in this case obey the provisions of war, which were conveyed to the Prophet through revelation. Allah's provisions must be obeyed, He is the God of all nature and the Almighty, while obeying the Messenger, in matters of religion, means obeying Allah because he is the one who conveys that religion and gives explanations contained in his words, deeds and decisions. This order was emphasized when the Muslims were in a state of dispute regarding the distribution of the spoils of war, to remind them that in any event the Muslims must still obey Allah and His Messenger, so that they do not cause divisions because of group ambitions and desires of lust, which usually plunges them into ruin. In this verse there are several important elements that can maintain the unity of the people, namely; piety, improving relations among fellow Muslims, and obeying Allah and the Messenger in every situation."
		   },
		   {
			"id": 1162,
			"surah": 8,
			"ayat": 2,
			"tafsir": "Allah explains that the believers are those who adorn themselves with the qualities mentioned in this verse. Three characteristics are mentioned in this verse, while two more are mentioned in the next verse. 1. When the name of Allah is mentioned, his heart trembles because he remembers His majesty and power. At that moment arose in his soul full of emotion remembering the magnitude of His favors and gifts. They feel afraid if they do not fulfill their obligations as servants of Allah, and feel guilty if they violate His prohibitions. The trembling of the heart as a parable of the feeling of fear, is an abstract mental attitude, which can only be felt by the person concerned and only God himself knows it. While other people can find out by paying attention to the outward signs of the person who feels it, which is depicted in the words or gestures of his actions. This mental attitude is sometimes seen in words, as illustrated in the word of God: \"And those who give what they give (alms) with a heart full of fear, (because they know) that they will actually return to their Lord\". (al-Muminun\/23: 60) And sometimes it appears in the gestures in action, the word of Allah: \"When they entered the place, then they said, \"salam.\" He (Ibrahim) said, \"We are really afraid to you.\" (al-Hijr\/15: 52) 2. When the verses of Allah are read, their faith will increase, because the verses contain strong arguments, which influence their souls in such a way, so that they become more confident and steady and able to understand its contents, while his limbs are moved to carry it out. In this verse there is an indication that a person's faith can increase and decrease according to his knowledge and deeds, the Messenger of Allah said: \"Faith has more than 70 branches, the highest is the acknowledgment that there is no God besides Allah, and the lowest is getting rid of distractions from the road.\" (Al-Bukhari and Muslim history from Abu Hurairah) Thus increasing one's faith can be known if he is more active in doing good deeds. n charity is a unified whole that cannot be separated. Word of Allah swt: (That is) those (who obey Allah and the Messenger) who when people say to him, \"The people (Quraish) have gathered troops to attack you, therefore fear them,\" it turns out (the words ) it increased (strength) their faith and they replied, \"Allah is sufficient (to be a helper) for us and He is the best protector.\" (ali Imran\/3: 173) And the word of Allah: And when the believers saw the (allied) groups, they said, \"This is what Allah and His Messenger promised us.\" And true is Allah and His Messenger. And that adds to their faith and Islam. (al-Ahzab\/33: 22) 3. Put your trust only in Allah Almighty, do not surrender to others. Tawakal is a person's last weapon in realizing a series of charities after various means and conditions are prepared. This is understandable, because in essence all kinds of activities and deeds, only materialize according to applicable laws that are subject to the power of Allah. So it is not right if someone surrenders to other than Allah."
		   },
		   {
			"id": 1163,
			"surah": 8,
			"ayat": 3,
			"tafsir": "Allah explains the outward characteristics of the believers as a continuation of the past characteristics. 4. Always perform the five daily prayers with perfect conditions and pillars, and on time, while his soul is devoted to following the outward movements and submitting solely to Allah. 5. Donate part of the property given to him. What is meant by spending assets in this ayat includes the issuance of zakat, providing maintenance for immediate or distant family, or helping social activities and religious interests, as well as the benefit of the people."
		   },
		   {
			"id": 1164,
			"surah": 8,
			"ayat": 4,
			"tafsir": "Allah confirms that those who adorn themselves with these qualities are true believers. Ibn Hazm explained that these qualities are qualities that other people can know about him, so if someone knows that he has faith in Allah, in His Messenger Muhammad saw and believes that what the Prophet brought is true, while that person pledge all his confessions verbally, then he is obliged to say that he has become a true believer. At the end of the verse, Allah explains the rewards that will be received by believers who truly believe and adorn themselves with the qualities mentioned, that is, they will gain a high degree and a noble position in the sight of Allah, because of Allah's power alone. If Allah has the power to create all kinds of life forms. So He also has the power to give primacy to His creatures according to His will. That high degree can be in the form of the priority of living in the world and can be the priority of living in the hereafter, or both. Allah says: Those who believe and emigrate and strive in the way of Allah, with their wealth and their souls, are of a higher rank in the sight of Allah. They are the ones who get the victory. (at-Taubah\/9:20) And the word of Allah: And it is He who made you vicegerents on earth and He raised (degrees) some of you above others. (al-Anam\/6: 165)"
		   },
		   {
			"id": 1165,
			"surah": 8,
			"ayat": 5,
			"tafsir": "Allah explained that He arranged the spoils of war fairly, just as Allah ordered them to go to war to defend Allah's religion fairly too. Then a dispute arose regarding the spoils of war as well as a disagreement when they went to face the caravan led by Abu Sufyan or the Quraysh infidels who came from Mecca to defend Abu Sufyan's caravan. If there are some people who do not like Allah's decree regarding the distribution of spoils of war, then this is a sign that their faith is not perfect, as was the case when the Battle of Badr was approaching. They did not follow Allah's orders and His Messenger was reluctant to leave their homes to fight in the battlefield. Because they are still not perfect believers in their faith. At the end of the verse Allah explains that some of the believers were not happy with the Prophet Muhammad's decision to attack the enemy outside the city. This is because their war preparations are not yet complete. However, this assumption is not true, because no matter what difficulties they will face, they should not be able to avoid it anymore, because it has become a decision that must be obeyed. The dispute that occurred between them is mentioned in the history below: \"After the Messenger of Allah heard the news that Abu Sufyan bin Harb brought a group of camels from Sham, the Prophet moved the Muslims to block him. The Prophet said, \"This caravan is carrying property (merchandise) so go to deal with it, maybe Allah will make the property as spoils of war for you.\" So the companions moved. Among the Muslims there were those who did not object, and there were those who objected, this was because they did not believe that the Messenger of Allah was going to face war, while Abu Sufyan when approaching the Hijaz had mobilized several spies, to obtain information by asking the people who were driving he met, so he received news from them that Muhammad had dispatched his companions to block his caravan. So Abu Sufyan hired amdham bin Amr al-Giffari u nto go to Mecca and tell him to meet the Quraysh so that they will send people who will protect their property and to convey the news that Muhammad has intercepted the property. So amdham bin Amr immediately went to Mecca, and the apostle went with his companions until they reached the valley, which is called ¨afran. After he arrived at the wadi, news came to him of the departure of the Quraysh people to protect their caravan. Therefore Rasulullah consulted with his companions. Then Abu Bakr got up and said put forward a good response too. After that Miqdad bin Amir got up and said, \"O Messenger of Allah! Do what Allah has commanded, we are always with you. By Allah, we will not say to you like what the Children of Israel had said to Musa, go with your Lord and fight both of you, actually we are just sitting here waiting, but you go with your Lord, then indeed we will be with you for the sake of God who sent you correctly. If you go and take us to Barkil Gimad (a city in Habasyah) we will surely stay with you towards that city , so you get there.\" Then Rasulullah saw said good words and prayed for him with good prayers too. After that the Messenger of Allah said, \"O people, give me consideration. These words were addressed to the Ansar people. This is because they had pledged allegiance to the Prophet at Aqabah. They said, \"O Messenger of Allah! In fact we have protected you as we protect our children and our wives.\" The Messenger of Allah was actually worried that the Ansar did not feel the need to help him, except when the enemy attacked the city, and they did not feel obliged to defend the Prophet if the Prophet attack. So after the Messenger of Allah said this, Saad bin Muadh said, \"By Allah! Apparently what you mean is us (the Ansar).\" The Prophet replied, \"Yes\". what Allah has commanded. So, by God, who sent you correctly, if you take us across the ocean, we will surely cross it. Neither of us will object nor deny, if you take us to face the enemy tomorrow morning. In fact, we are people who are steadfast in battle and willing to face the enemy. May Allah reveal to you what pleases you.\" So go with us under the protection of Allah. The Messenger of Allah was pleased with Saad's opinion and his dexterity in dealing with war. Then the Messenger of Allah said, \"Go you under Allah's protection and be happy that Allah has promised victory in between two enemy lines. By Allah, it is as if we saw the enemy in a state of falling down.\" (Narrated by Ibn Ishak from Ibn Abbas)"
		   },
		   {
			"id": 1166,
			"surah": 8,
			"ayat": 6,
			"tafsir": "Allah explains that among the believers there are those who dispute the decision that has been determined, namely the decision to attack the enemy who came from Mecca under the leadership of Abu Jahl, even though the decision is the truth that is already evident and they have been promised victory by Allah wherever they are. is at. However, they avoided that decision, preferring to face the enemy group under the leadership of Abu Sufyan. They avoided fighting the enemy forces that came from Mecca and were described by Allah, as if they were driven to death. They gave the excuse that they had not prepared everything for war. In this case they seemed to be trying to distort the understanding that the promise of victory that Allah would give to the Muslims was the caravan of Abu Sufyan. That is why Allah describes their condition as if they saw the causes of death. When viewed from the point of view of war strategy, the Prophet's decision to face the Quraysh army even though it was equipped with sufficient war equipment was right, because if the Prophet's attack were aimed at a group of camels coming from Sham, the Muslims would undoubtedly become an easy target for the Quraysh army. who came to protect Abu Sufyan, because the Quraysh could hit the Muslims from behind. This was because the Quraysh army had previously suspected that the Muslims were ready to confront Abu Sufyan's camel group."
		   },
		   {
			"id": 1167,
			"surah": 8,
			"ayat": 7,
			"tafsir": "In this verse, Allah reminds the Muslims of an important event, namely when Allah promises victory to the Muslims against one of the two groups faced, namely one of the camel groups carrying merchandise or the Quraysh army carrying complete war equipment. . At that time the Muslims tended to choose to deal with groups carrying merchandise which numbered no more than 40 camels. This is a satire for some Muslims who are afraid to get involved in war, but they want to get a lot of wealth. Their inclination is far from the truth, because their aim has turned towards material pleasures. They have deviated from upholding monotheism and destroying polytheism. That is why Allah explained to them that what Allah wants is not what they want. Allah wants the Muslims to uphold the truth in accordance with the revelation that was revealed to His Messenger, which states that the victory will be obtained by the Muslims from one of the two groups. It is not explained that the combat objective that must be chosen is to train Muslims so that they can make choices and determine a war strategy by responding to the situation and assessing it by way of deliberation and educating them to obey the results of the decision. Then Allah emphasized His will, namely to destroy the polytheists who disobey Allah's religion as a whole including their supporters. Allah describes the destruction of the entire army of the disbelievers of Quraysh by saying that the destruction of the rear guard is the most difficult undertaking, which can only be carried out if the vanguard has been destroyed first. The main aim of this war is to annihilate the polytheists because the victory of the Muslims against them in the Battle of Badr is the first victory which will be followed by other victories in the following wars, and ends with the conquest of Mecca as a total victory that is resplendent for the Muslims and complete destruction of the disbelievers of Quraysh."
		   },
		   {
			"id": 1168,
			"surah": 8,
			"ayat": 8,
			"tafsir": "Allah explained to the Muslims that the victory they won was none other than so that the truth of the religion of Islam would rise and the evil of shirk would disappear from the face of the earth. This is the main goal that must be chosen by the Muslims when carrying out war. The goal of upholding the Islamic religion and destroying polytheism will not be achieved unless the Muslims can defeat the Quraysh army that came from Mecca with complete war equipment with the aim of destroying the Muslims. At the end of the verse, Allah confirms that the aim of upholding the religion of Islam and destroying polytheism must be realized, no matter how fierce the hostility and hatred of the polytheists is."
		   },
		   {
			"id": 1169,
			"surah": 8,
			"ayat": 9,
			"tafsir": "Allah reminds the Muslims of Allah's help given to them when they face difficulties and tries to overcome these difficulties by praying to Allah swt that Allah will give them help in facing His enemies, because of their efforts to overcome difficulties. with birth effort is not possible. According to reality, the strength of the Islamic army at that time consisted of more than 313 people, while the polytheist army consisted of 1,000 people, especially when viewed from the aspect of weapons. They brought weapons of war that were more complete than the equipment of the Muslims. After that, Allah granted the prayers of the Muslims by bringing reinforcements in the form of angels who came successively. Regarding Allah's assistance to the Muslims with the number of angels which number 3,000, it is explained in another verse, namely by the word of Allah: (Remember), when you (Muhammad) said to the believers, \"Is it not enough for you that Allah helps you with three thousand angels sent down (from the sky)?\" (ali Imran\/3: 124) And the word of Allah SWT: \"Yes\" (enough). If you are patient and fearful when they come to attack you suddenly, Allah will help you with five thousand angels wearing signs. (ali Imran\/3: 125) Regarding Allah's help, namely the angels whose number varies as mentioned in these verses, the commentators differ: For those who think that these verses are about the story of the Battle of Badr, then it should be understood, that in the first time Allah swt helped the Muslims with a thousand angels. After that the help was supplemented by three thousand angels. These aids which were given successively, in ever-increasing amounts, were to make a firmer impression on the enemy's mentality, so that they would feel more fearful in battle. But for those who understand that these two verses are the story of Uhud, then the 3,000 will be given to the Muslims, even if they are patient they will be given the help of another five thousand angels. But this is a promise, but because they disobey, the promise is not fulfilled by God."
		   },
		   {
			"id": 1170,
			"surah": 8,
			"ayat": 10,
			"tafsir": "This verse provides an explanation that Allah does not send reinforcements except as good news, that is so that the Muslims will be at peace because of it, and have a high fighting spirit and have a strong belief that victory will be obtained by them as Allah has promised, also to avoid shocks. soul, in spite of fear because it sees the sum of strength of endurance and firm belief in achieving glorious victory. In this verse it is also explained that the victory they won was not because of strength and weaponry, but solely because of Allah's help, and only Allah can provide help by sending an army of angels. This statement of Allah is very important for Muslims, so that they do not feel arrogant and arrogant when facing enemies. Because these two characteristics can eliminate caution and self-control in war. At the end of this verse Allah emphasizes that indeed Allah is Almighty, Most Wise. Omnipotence means the power to give victory to Muhammad's people according to what He wills. While Mahawisana means giving victory to His servants who believe in monotheism and destroying His servants who fall into polytheism."
		   },
		   {
			"id": 1171,
			"surah": 8,
			"ayat": 11,
			"tafsir": "Allah explains to the Muslims that besides Allah providing assistance in the form of angels who come successively, he also provides other assistance in the form of situations and conditions that are favorable for the Muslims. Like Allah's help when the Muslims are in fear of facing the enemy, they are covered with sleep, so they cannot feel fear anymore. Fear caused them to see the large number of enemy troops and their complete preparations. So with that drowsiness, they no longer feel fear and they return to being peaceful. To give a broader picture of the sleepiness of the Muslims while fighting, it can be followed by the hadith narrated by Abu Yala and al-Baihaqi from Ali who said: \"We did not have horse troops during the Battle of Badr except Al-Miqdad. All of us fell asleep, except the Messenger of Allah, he prayed under a tree until morning\". (History of Abu Yala and al-Baihaqi from Ali) According to the verses that can be understood is that the onset of drowsiness occurs when the battle is in progress. The drowsiness dispelled the fear and trepidation. By itself, the feeling of fear of danger will disappear. This is the same as the incident that happened to them during the battle of Uhud, as mentioned in the word of Allah: \"Then after you were struck by sorrow, He sent down a sense of security upon you, (in the form of) drowsiness that covered a group of you.\" (ali-Imran\/3: 154) After that Allah swt mentions His other help to the Muslims, namely at the time of the Battle of Badr, Allah swt sent down rain on the Muslims from the sky, so that they could purify themselves with it. The description of Allah swt's intention to rain down on the Muslims, and what his wisdom can be seen from the hadith narrated by Ibn Mundhir through Ibn Jarir from Ibn Abbas: \"The polytheists at the beginning of the war had mastered the water sources ahead of the Muslims, so -Muslims become thirsty. They pray in a state of junub and berhadas (without washing with water). While around them there is only sand. Then they are tempted by Satan, as if the devil was saying, \"Do you think that there is a Prophet among you and you are the guardians of Allah. While you pray in a state of junub and hadas? Therefore Allah swt sent down rain from the sky, so that the water flowed in the valley. So the Muslims drank water and purified themselves with it and their hearts strengthened, and their worries disappeared.\" (History of Ibn Mundzir from Ibn Abbas) Allah also explained that He sent down rain from the sky to remove the disturbances of satan and to remove fear and They were apprehensive, because the Muslims at that time were in a disadvantageous position. They were in a desert area which was not strategically used as a stronghold, because it was difficult to move their feet let alone to carry out attacks, even in that area there was no source of water. On the other hand, Allah explained that by raining their feet it was easy for them to walk on the desert, so that they would gain stability and full confidence in order to survive and attack the enemy and be able to unite their fighting power. namely: 1. To provide opportunities for Muslims ag ar they can purify from junub and hadas so that they can worship in a state of purity physically and spiritually. 2. To dispel the misgivings whispered by Satan, and eliminate fear due to the lack of water supply. 3. So that the Muslims are free to regulate their movements in battle, because they are no longer bothered by soft sand that interferes with their foot movements."
		   },
		   {
			"id": 1172,
			"surah": 8,
			"ayat": 12,
			"tafsir": "In this verse, Allah reminds the Muslims of His help, which is another thing in the Battle of Badr, namely when Allah SWT revealed to the angels to provide assistance to the Muslims. Angels were commanded by Allah to accompany the Muslims to be able to provide assistance at any time. This assistance is to stabilize the hearts of the Muslims in battle. And convinced them that Allah created fear in the hearts of the disbelievers, because they saw the number of angels accompanying the Islamic army. In this way the Muslims can control the battle, they can advance swiftly and they easily break the enemy's attacks."
		   },
		   {
			"id": 1173,
			"surah": 8,
			"ayat": 13,
			"tafsir": "Allah explains the reasons for the victory of the Muslims and the defeat of the polytheists, namely because of Allah's assistance given to the Muslims in dealing with the polytheists and their struggle based on the truth, namely upholding the religion of monotheism. While the polytheists suffered defeat because they were enemies to Allah and His Messenger and their struggle was based on falsehood, namely struggles to defend idols. Allah swt gives a strong threat to anyone who opposes Allah and His Messenger, whether challenging His laws or denying the blessings given to them, that Allah will give them torment. The enmity of polytheists towards Allah and His Messenger is in the form of their challenge to the Apostle's call when conveying Islamic da'wah. At that time the Prophet was not only lied to and humiliated, he was even expelled from his country so he migrated to Medina. While they cling to the religion of their ancestors, namely the religion of shirk and idol worship. After the Prophet Muhammad was in Medina with his friends they tried to wipe out the Muslims from the face of the earth and eliminate the teachings of Islam. So it is appropriate for them to be given harsh punishment, namely their defeat in the Battle of Badr and the punishment of Allah that will be inflicted on them, namely the torment of the fires of hell in the hereafter."
		   },
		   {
			"id": 1174,
			"surah": 8,
			"ayat": 14,
			"tafsir": "Allah swt confirms his threat to the disbelievers that the worldly punishment that is inflicted on them is a punishment that must be felt as a reward for their disobedience to the laws and favors of Allah. Besides that, Allah also emphasized that for them there is another torment that is most painful to feel, namely the torment of hell fire that will befall them in the hereafter."
		   },
		   {
			"id": 1175,
			"surah": 8,
			"ayat": 15,
			"tafsir": "Allah calls on believers that when faced with infidels who are attacking, Muslims are not allowed to flee from battle. The disbelievers moved from Mecca with a large number of troops. They deliberately met the Muslims who were already in Badr. They already knew the plans of the Muslims who would block the caravan led by Abu Sufyan on the grounds of protecting their trade. They moved from Mecca, when in fact they intended to exterminate the Muslims. That is why, Allah swt forbade the Muslims to turn their backs on them. Moreover, running away from fighting against them, even though they brought quite a lot of troops and complete war equipment. What was forbidden was running away from battle, without any justifiable reason for fear of encountering the enemy. As for retreating to arrange tactics, it is not included in the prohibition contained in this verse."
		   },
		   {
			"id": 1176,
			"surah": 8,
			"ayat": 16,
			"tafsir": "Allah threatened the Muslims who fled from the battle that they would return with Allah's wrath. God's wrath is in the form of a threat that will be inflicted on them, that is, they will be tortured with the hell of Jahannam, a very scary place to live. From this verse it can be understood that running away from war is a grave sin. The Prophet Muhammad said: \"Keep away from all of you the seven things that destroy. They asked: \"What are the seven things, O Messenger of Allah? The Prophet replied: \"Associating partners with Allah, practicing magic, killing someone whom Allah has forbidden to kill, unless there are reasons that allow it, eating usury, eating the property of orphans, fleeing from battle (war), and accusing a good believing woman of adultery.\" who do not intend to commit adultery\". (Al-Bukhari and Muslim from Abu Hurairah) In this case Allah explains several exceptions from turning their backs on the enemy and fleeing from the battle, namely when the Muslims retreat at the time of the war, to arrange tactics such as finding a more advantageous position in battle, fishing the enemy to pursue out the more strategic battlefield so that thus the enemy can be annihilated, or by holding feints so that the combat objectives become chaotic, or dividing troops to attack from all directions, so that the enemy's unit can be divided and so on. When the war broke out, the Muslims fled to join other units in order to make their combat targets stronger or to get help from troops when the enemy was deemed to have stronger troops."
		   },
		   {
			"id": 1177,
			"surah": 8,
			"ayat": 17,
			"tafsir": "From Ibn Abbas that the Messenger of Allah ordered Ali bin Abi Talib: Take a handful of soil, Ali took it and gave it to the Apostle and then threw it at the polytheists, then none of them got hit by their eyes, then this verse was revealed. Then Allah gave an explanation regarding the reason why the Muslims were forbidden to turn their backs on the enemy, namely because the victory would not be achieved by the Muslims except by going forward to attack the enemy, throwing spears or throwing fists at them. From Allah's victory and help, it can be understood that every time the Muslims stick their spears to kill the enemy and every handful of soil they throw is guaranteed to hit the target, because Allah is the one who guarantees and helps them. Allah says: Fight them, surely Allah will torment them with (the intercession of) your hand and He will humiliate them and help you (with victory) over them, and comfort the hearts of those who believe. (at-Taubah\/9: 14) Besides that, the conditions that are favorable for the Muslims are the belief that their struggle will win, and Allah will help them. While the disbeliever's goal is only to obtain satisfaction in life in the world. Allah said: \"And do not be weak-hearted in pursuing them (your enemies). If you suffer pain, then know that they also suffer pain (also), as you feel, while you can still expect from Allah what they cannot expect.\" . (an-Nisa\/4: 104) Allah's Word: \"How many small groups defeat large groups with Allah's permission.\" (al-Baqarah\/2: 249) Allah explains that all kinds of assistance given to the Muslims in the Battle of Badr is a strong reason for Allah's prohibition on the Muslims, running away from battle, and is a gift of victory given by Allah to those who believers, that is, victory and a lot of booty. At the end of the verse, Allah confirms that Allah is All-Hearing to all the requests of His servants who really carry out orders and stay away from His prohibitions, is All-Knowing of all kinds of whispers in the hearts of His servants and knows which of His servants deserves victory and who deserves to suffer defeat."
		   },
		   {
			"id": 1178,
			"surah": 8,
			"ayat": 18,
			"tafsir": "Allah emphasized that the grace of Allah given to the Muslims was aimed at weakening the deceit of the disbelievers and weakening their attack on the Prophet and all Muslims. Also to build the attention of Muslims so that they continue to struggle to uphold the religion of monotheism and do good to each other in defending and upholding religion. From this verse it can be understood that Allah always protects every struggle of Muslims in upholding the monotheism religion and will weaken the struggle of the polytheists in their every move and step aimed at fighting those who uphold the monotheism religion and spread Islam."
		   },
		   {
			"id": 1179,
			"surah": 8,
			"ayat": 19,
			"tafsir": "After that Allah gave a statement addressed to the polytheists that if they wanted to find a decision which of the two armies was the most superior and the most guided so as to gain victory, then it was clear that the one who received a resounding victory was the superior and most powerful troop. got a hint. This statement is a mockery of the polytheists because at the end of the Battle of Badr the victory was clearly won by the Muslims, while the polytheists experienced destruction and defeat. This statement applies at any time and place, wherever and whenever there is upheaval between the two factions, then the victory will certainly be won by the group that stands on the right principles. Then Allah called on the polytheists that if after suffering defeat in the Battle of Badr they stopped making enemies of Muhammad and his followers, then it would actually be better for them. God made this offer to them because they had experienced the bitterness of war. From that experience they have seen the fact that no matter how strong and no matter how large the number of troops they deploy and the armor they rely on, in the end they also suffer defeat. If they disobeyed this call and returned to making enemies and fighting the Prophet and his followers, then the reality that they experienced would be repeated, that is, Allah would again give His help to the Messenger of Allah. Allah confirms that the army of the polytheists, no matter how strong, will not be able to resist the catastrophe that will be inflicted by Allah upon them. This shows that a large number of soldiers does not always determine the course of the war, unless a large number is accompanied by soul strength and belief in Allah Azza wa Jalla. No matter how persistent Abu Jahal and his followers were to defeat the Muslims in the Battle of Badr, they were also not successful, as explained by the Hadith narrated by Ahmad and an-Nasai: \"O Allah, who among us has broken the ties of brotherhood and brought a religion that unknown, then destroy him before dawn, then that is as a request for victory from him (to the Messenger of Allah) (Records of Ahmad and an-Nasai). According to the history of as-Suddi from Mujahid, it is said that before the Quraysh army departed to the battlefield they pray: When the polytheists came out of the city of Mecca towards Badr, they held the curtain of the Kaaba and then they asked Allah for victory and said: \"O Lord, give victory to the highest troops (degrees) to the most noble group and to the best qibla.\" Then the verse was revealed: If you (the polytheists) look to decision."
		   },
		   {
			"id": 1180,
			"surah": 8,
			"ayat": 20,
			"tafsir": "Allah calls on the believers to obey Allah and His Messenger. Obeying Allah and His Messenger in this verse is carrying out jihad, fighting to defend the religion of monotheism and leaving their homeland and using their property and souls when necessary, and forbidding the believers to turn away from His commandments, while at that time they had know and hear the call to obey His commandments and help his cause. What is meant by hearing in this verse is understanding the Apostle's call and justifying it. As a believer he should have said when he heard the Apostle's exclamation \"samina wa athana\" (we hear and obey), as Allah says: Only the words of the believers, when they are invited to Allah and His Messenger for the Apostle to decide (cases) between them, they say, \"We hear, and we obey.\" And they are the lucky ones. (an-Nur\/24: 51) And the word of Allah again: \"We do not discriminate against anyone from His Messengers.\" And they said, \"We hear and we obey.\" (al-Baqarah\/2: 285) What is meant by hearing the Apostle's call in this verse is obeying all God's commands conveyed to him through revelation."
		   },
		   {
			"id": 1181,
			"surah": 8,
			"ayat": 21,
			"tafsir": "Allah forbids the believers to act as hypocrites and disbelievers when they hear the Apostle's call, they act as if they hear the call, but in fact their hearts deny it. So the Muslims are also prohibited from acting like them, who seem to have listened to the Prophet's call with great attention, even though they did not pay the slightest attention let alone carry it out. In this verse the hypocrites are declared as those who do not want to listen to the words of the Prophet, namely embracing Islam, this gives an indication that they do not want to justify what the Prophet called for. Allah said: And among them there are people who listen to your words (Muhammad), but when they have left your side, they say to those who have been given knowledge (companions of the Prophet), \"What did he say earlier?\" They are the people whose hearts are locked by Allah, and follow their wishes. (Muhammad\/47: 16)"
		   },
		   {
			"id": 1182,
			"surah": 8,
			"ayat": 22,
			"tafsir": "Allah likens the hypocrites to the worst animals, because they do not want to use their hearing to know the true calls and do not pay attention to good advice. The hypocrites are likened to animals in this verse, not that their physique is like animals, but their mental nature is like animals. They reject the understanding of God's word and are unwilling to think about and understand the truth. In this case they don't want to distinguish which calls are true and which are wrong invitations and which are the right intentions and which are wrong beliefs. Another reason for equating them with animals is because they don't want to tell the truth, as if they don't think, because they waste their minds so they can't tell the truth properly. If they had used reason, they would have listened to the Prophet's call and followed him. In this verse or in another verse, Allah explains that the hypocrites are more astray than animals. Allah's Word: \"And verily, We will fill hell with hell, many from among the jinn and humans. They have hearts, but they do not use them to understand (the verses of Allah) and they have eyes (but) they do not use them to see (signs of power) Allah), and they have ears (but) are not used to hear (the verses of Allah). They are like livestock, even more astray. They are the ones who are heedless.\" (al-Araf\/7: 179) Hearing and sight cannot be made by humans, because both are related to the soul, to life. Cannot be expected from inanimate objects that do not have hearing and sight. Even living hearing and sight do not function if they are not directed."
		   },
		   {
			"id": 1183,
			"surah": 8,
			"ayat": 23,
			"tafsir": "Allah gave a statement to the hypocrites and polytheists that if they had the will to believe and hope to follow the instructions conveyed by the Messenger of Allah, Allah would have made them able to hear. But because their talent to receive Allah's guidance has been tainted with the stains of polytheism and hypocrisy, there is no other way to direct their talents to receive guidance. If Allah had made them able to understand the Prophet's call, they would have been reluctant to carry out what they heard, let alone practice it, because in their hearts there was nested disbelief and disbelief. From God's word it can be understood that the degree of people who listen to the Apostle's call is in stages. 1. There were people who intentionally did not want to listen to the Apostle's call openly and greeted him with hostility from the start, because they felt that his call would destroy their faith. 2. There are people who listen to the Apostle's call, but do not intend to understand and think about what is called for, like hypocrites. 3. There are people who listen to the Apostle's call with the intention of looking for opportunities to refute and reject it. The same thing is done by polytheists and people of the book who deny the truth of the verses of the Koran. 4. There are people who listen with the intention of wanting to understand and think about the Apostle's call. But sometimes Islamic teachings are used as knowledge that is used for certain purposes and sometimes Islamic teachings are used as material for discussion and targets of criticism. This act is done by most orientalist people."
		   },
		   {
			"id": 1184,
			"surah": 8,
			"ayat": 24,
			"tafsir": "Allah calls on the believers, that when Allah and His Messenger convey His laws that are useful for their lives, they should welcome the call and receive it with great attention and try to grant it. Because the call contains teachings that are useful for their lives, such as knowing God's laws given to His creatures, life examples that can be used as examples and main lessons to increase human values and elevate their lives to a higher dignity. perfect, so that they can walk the straight path that draws closer to God. In the end they will live to the good pleasure of Allah; in the world they will be happy and in the hereafter will get heaven. In another verse the command to follow the Apostle is accompanied by an order to hold on firmly. Allah says: \"Hold fast to what We give you and listen to it.\" (al-Baqarah\/2: 93) Obeying the Prophet is obligatory, both during his life and after his death. Obeying the Prophet is obeying all kinds of commands and avoiding his prohibitions which are contained in the Al-Quran and which are also contained in the Hadith books whose validity is known. Allah commands the Muslims so that they really know that Allah limits between man and his heart. This expression contains many meanings: 1. If God controls a person's heart, then it is God who determines the inclination of that heart according to His will. Allah has the power to direct the hearts of the disbelievers if He wants the disbelievers to receive guidance and controls the heart of a believer to lead him astray if He wishes to lead astray. This similar understanding is also found in the hadith narrated by al-Hakim in Kitab al-Mustadrak from Ibn Abbas and from most of the salaf scholars. Hadiths that reinforce this understanding, among others, that the Prophet Muhammad often said: \"O God who turns hearts, set my heart on your religion. Then the Messenger of Allah was asked, \"O Messenger of Allah! We have believed in you and in the Book that you brought, so what do you worry about us? So the Messenger of Allah replied, \"Yes! Truly the heart is between the two fingers of God's fingers. He is the One who turns it back and forth.\" (History of Imam Ahmad and at-Tirmidhi from Anas). 2. That Allah, orders his servants to hasten to obey Allah before the soul is released from the body, but they do not heed that order. This means that Allah numbs his heart so that this good opportunity is lost, namely the loss of a person's opportunity to do good deeds and efforts to heal the heart with various antidotes for the soul so that his soul becomes healthy, according to Allah's will. Limiting words are words used for the meaning of death, because it is usually the heart that can understand something, so when it is said that one's heart has died it means that one's opportunity to take advantage of knowledge is lost. 3. The word limit (yahulu) is a majaz word that describes the closest limit to the servant. Because something that separates the two items, is very close to the two items. This same understanding is quoted from Qatadah, because when discussing the meaning of the verse, he brings the word of Allah: \"And We are nearer to him than his jugular vein.\" (Qaf\/50: 16) How are the differences of opinion among the mufassir regarding the tafsir of this verse, but what cannot be denied is that Allah has created talents in a person. Both good talents and bad talents can develop according to the Sunnah of Allah which has been established for humans. The development of these talents depends on the situation, conditions and environment. If a person is well educated, his soul will undoubtedly be good. Conversely, if the soul is educated with evil, or is in an evil environment, the soul will undoubtedly become evil. The heart is the center of feelings, abilities and will of a person who can control his body to realize deeds. It is appropriate that in this verse it is said that Allah separates a person from his heart, because Allah is the One who knows the conscience of a person better. He is the One who controls the heart, because He is also the one who creates the talents in the heart and He is also the one who can best determine where the heart goes. At the end of this verse Allah confirms that in fact all human beings will be gathered to Allah, in Padang Mahsyar to be accountable for all kinds of deeds and receive compensation according to their deeds."
		   },
		   {
			"id": 1185,
			"surah": 8,
			"ayat": 25,
			"tafsir": "Allah calls on believers to protect themselves from torment, which does not only affect the unjust among the believers. The point is that if within a group of immoral acts are evenly distributed, Allah will punish them as a whole. The torment is not only for the person who committed the disobedience, but the torment will befall them equally without favoritism, even though there are also pious people among them. The Messenger of Allah said: \"There is not a people whose majority of people are more deceived into committing disobedience than those who do not do it, then they do not want to change it other than Allah will torture them with even torment.\" (Ahmad's history from Jarir) That's why in society there are institutions that take care of benefit and manage good and forbidding evil. This institution should be tasked with researching disobedience that arises in society, and also trying to find ways to prevent it. Also this institution is trying to activate the community to do everything that is ordered by religion and stop everything that is forbidden. If the disobedience is spread evenly, and the community has forgotten religion, then the disaster that will befall the community will not only befall a certain group of people, but the disaster will be felt by members of society as a whole and evenly. At the end of this verse Allah warns the believers so that they know that Allah is very painful in His torment. Allah's punishment is inflicted on anyone who violates His law. This very harsh threat from God will take effect when the evil has become rampant and evenly distributed among all members of society without discrimination. While the threats in the hereafter are inflicted on people, who do it according to the severity of the actions that were done by that person."
		   },
		   {
			"id": 1186,
			"surah": 8,
			"ayat": 26,
			"tafsir": "Allah reminds the Muslims of Allah's favor which has been given to them at the event of hijrah. At that time those who emigrated from Mecca to Medina were few in number, and they were among the oppressed. At the beginning of Islam, the Muslims were worried that the Quraysh polytheists would kidnap them. Then Allah removed the worry. Allah, provide a safe place for them, namely Medina. After that Allah provided assistance to the Muslims so that they became a strong nation, either in the form of assistance given by the Ansar people when he and his followers were in Medina, or the assistance of Allah which was given when they were dealing with the polytheists in Battle of Badr. Allah also reminds the Muslims of His other blessings, namely good and lawful sustenance, whether in the form of the prosperity of the land of Medina that they experienced or victory in the Battle of Badr. The favors of Allah that are given to the Muslims mentioned in these verses, are to provide incentives so that the Muslims are grateful for these blessings."
		   },
		   {
			"id": 1187,
			"surah": 8,
			"ayat": 27,
			"tafsir": "Abdullah bin Abi Qatada said, \"This verse was revealed regarding Abu Lubabah when the Messenger of Allah, surrounded the Quraidhah tribe and ordered them to accept Saad's decision. After that Quraidhah negotiated with Abu Lubabah about accepting Saad's decision, because Abu Lubabah's family and his property were in their power. Then Quraidhah pointed to his neck (ie as a sign to be slaughtered). Abu Lubabah said, \"Before the soles of my feet moved, I already knew that I had betrayed Allah and His Messenger.\" Then he swore not to eat anything so that he dies, or Allah accepts his repentance. Then he goes to the mosque and ties himself to a pillar, and stays there a few days until he faints, because his body is very weak. Then Allah accepts his repentance. And he swears, that he should not freed from his bonds except by the Prophet himself. Then he said, \"O Messenger of Allah! I vowed to give up my wealth as sadaqah.\" The Messenger of Allah said, \"It is enough to give one-third in sadaqah.\" (History of Saad bin Mansur from Abdillah bin Abi Qatada). Allah calls on Muslims so that they do not betray Allah and His Messenger, namely ignoring the obligations that they must carry out, violating His prohibitions, which have been determined through the mediation of revelation, not betraying the mandate that has been entrusted to them, namely betraying all kinds of matters relating to the orderliness of the people, such as government affairs, war affairs, civil affairs, social affairs and rules of community life. To regulate all kinds of affairs in society, it is necessary to have rules that are obeyed by all members of the community and by officials who are entrusted with taking care of the interests of the people. These regulations in principle have been outlined in the Al -Quran and Hadith. So all that collides and all social affairs must not conflict with predetermined principles. Therefore all regulations concerning the interests of the people may not be betrayed, and must be obeyed accordingly. Almost all activities in this society are related to that belief. That is why Allah, forbids Muslims from betraying the mandate, because if the mandate is no longer maintained, it means that trust is lost. If trust has been lost, it means that legal order will no longer be maintained and peace in social life can no longer be enjoyed. Allah emphasized that the dangers that will befall the community due to betraying the mandate that has been known, both the dangers that will befall them in this world, namely the rampant crime and immorality that shake people's lives, or the eternal regret and torment of hellfire that will befall them in the afterlife. Betrayal is the characteristic of the hypocrites, while trust is the characteristic of the believers. So a believer must stay away from this trait of betrayal so that he is not infected with the nifak disease which can completely erode his faith. Anas bin Malik said: \"Rasulullah saw in every sermon he always said:\" People who cannot be trusted don't believe, and people who can't be trusted don't believe. -There are three signs of a hypocrite. When he utters words he lies, and when he makes a promise he violates it, and when he is entrusted he betrays.\" (Muslim history from Abu Hurairah)"
		   },
		   {
			"id": 1188,
			"surah": 8,
			"ayat": 28,
			"tafsir": "Allah warns the Muslims so they know that their wealth and their children are a trial. The point is that Allah bestows property and children on the Muslims as a test for them whether the wealth and children increase their piety to Allah, are grateful for His blessings and carry out the rights and obligations as determined by Allah. If a Muslim is given wealth by Allah, then he is grateful for that wealth by spending it according to Allah's provisions means fulfilling the obligations that Allah has determined for them. But if with the wealth they acquire, they grow greedy and try to increase their wealth in ways that are not lawful and are reluctant to spend their wealth, it means that such a person is a person who denies the favor of Allah. In human life in society, property is a pride in the life of the world. Often people forget that wealth is only a trust from Allah that is entrusted to them, so they are mostly attracted to these assets and forget the obligations that must be carried out. Likewise children are one of the joys of life and a person's pride. This is also a trial for the Muslims. The child must be educated with a good education so that he becomes a pious child. If someone succeeds in educating their children according to religious requirements, it means that the child is a priceless blessing. However, if the child is allowed to become a child who follows his own desires, does not want to carry out religious orders, then this will be a disaster, not only for his parents, but also for society as a whole. Therefore, it is obligatory for a Muslim to protect himself from these two trials. Let him control his wealth and children to be used and educated in accordance with the demands of religion and keep away from the disasters caused by the assets and children earlier. Allah confirms that verily with Allah is a great reward. The meaning is that whoever prioritizes the pleasure of Allah rather than loving his wealth and children, then he will get a great reward from Allah. Allah's warning so that people do not forget the provisions of religion because of the many treasures and many children are also mentioned in other verses. Allah's Word: O you who believe! do not let your possessions and your children distract you from the remembrance of Allah. And whoever does so, then they are the ones who are the losers. (al-Munafiqun\/63: 9)"
		   },
		   {
			"id": 1189,
			"surah": 8,
			"ayat": 29,
			"tafsir": "Allah calls on those who believe that if they fear Allah, that is, take care of themselves by carrying out what they determine based on Allah's laws and stay away from all kinds of His prohibitions, such as not wanting to betray, prioritizing His laws, Allah will give them instructions that can distinguish between right and wrong, and these instructions are a helper for them in times of trouble and as a light in times of darkness. Allah said: O you who believe! Fear Allah and believe in His Messenger (Muhammad), Allah will surely give His mercy to you in two parts, and make a light for you by which you can walk and He will forgive you. And Allah is Forgiving, Most Merciful. (al-Hadid\/57: 28) Allah promised them that it would erase all their mistakes and forgive their sins because they were pious, and were given furqan, so that they could know which actions should be avoided, because Allah prohibited them, and can also protect himself from things that lead to damage. Those who receive Allah's forgiveness means that they live happily. This is what they can achieve because of God's grace alone. Allah confirms that Allah has a great gift because He is the one who can give priority to His creatures, both priority to His servants in the world or maghfirah and His heaven which are given to His beloved servants in the hereafter."
		   },
		   {
			"id": 1190,
			"surah": 8,
			"ayat": 30,
			"tafsir": "Allah reminded the Prophet Muhammad and his companions about an event that they had experienced while they were in Mecca. They were saved from the torment of the polytheists. At that time the Quraysh infidels were plotting tricks to be carried out against the Prophet, namely capturing the Prophet so that he could not meet humans and could no longer spread the religion of Islam, or killing the Prophet in a way that made it difficult for his tribe to retaliate, so as not to cause danger to whoever kills him, or expels the Prophet and exiles him to a remote place. At that time the disbelievers of Quraysh were planning a trick. Allah provided His assistance to the Prophet Muhammad, namely Allah thwarted their efforts by ordering the Prophet and his companions to migrate to Medina, so that the Prophet and his companions were spared from the deception of the polytheists. Allah emphasized that He is the best avenger of deceit, that is, he can defeat the deceit of polytheists and unbelievers of Quraysh who wanted to harm the Prophet."
		   },
		   {
			"id": 1191,
			"surah": 8,
			"ayat": 31,
			"tafsir": "Allah explained the disbelief of the Quraysh people and their arrogance towards the Prophet's call, especially when hearing the verses recited by the Prophet. They responded with arrogance. They think they can recite like that. These words are emphasized by an-Nadhar bin al-Haris from Bani Abdid Dar. He went back and forth to Persia and heard from them about Rustam and Isfandiar from some of the leading aristocrats. He often met with Jews and Christians, so he heard from them the contents of the Torah and the Bible. Then Allah explained the reasons why the Quraysh people expressed this opinion, namely because they considered the verses of the Koran recited by the Prophet Muhammad and his followers to resemble the stories found in the Torah and the Bible. That is why they feel able to recite the verses recited by the Prophet. They think that the verses read by Muhammad are not revelations, but the stories of ancient people. However, it is possible that the one who uttered those words was an-Nadhar, then followed by the others. But they do not believe that the verses read are the tales of the ancients, which are confusing and they also do not think that Muhammad made them up, because they have never accused Muhammad of being a liar. Allah says: Because in fact they do not belie you, but those who are unjust deny Allah's verses. (al-Anam\/6: 33) And the word of Allah: And they said, \"(It's just) the tales of the ancients, who were asked to write down, then read those tales to him every morning and evening.\" (al-Furqan\/25: 5) In fact, they did not not believe in the truth of these verses, because they already knew that the Prophet Muhammad was an Ummi, but they said that only to hinder people from listening to the Koran. . There are also those who think that Quraysh leaders such as an-Nadhar bin al-Haris, Abu Jahal, and al-Walid bin Mugirah both agreed to order people not to listen to the Koran. Then they came to the Prophet's house at night to listen to him and they were attracted to the Quran. Because the reading of the Koran was so impressive on their hearts that al-Walid bin Mugirah said the famous words, \"Indeed, the Koran is of great value\". That is why they prevent the Arabs from listening to the verses of the Koran and keep the Arabs away from the Koran, they say that the Koran is magic."
		   },
		   {
			"id": 1192,
			"surah": 8,
			"ayat": 32,
			"tafsir": "Allah reminds the believers about an incident where the Quraysh disbelievers opposed the Prophet Muhammad that if it is true that the Al-Quran spread by Muhammad was really descended from Allah, as said by the Prophet and used as the basis of his religion, then people -the Quraysh asked Allah to give evidence, as reinforcement of his words. They asked to rain stones from the sky or to be given painful torments to them. In this verse there is a hint, in fact the Quraysh infidels would not want to become followers of the Prophet Muhammad, even though what Muhammad said were truly verses sent down from Allah. This proves that they prefer destruction to faith in Muhammad. They ask Allah to be showered with stones from the sky or to be tortured with painful torments."
		   },
		   {
			"id": 1193,
			"surah": 8,
			"ayat": 33,
			"tafsir": "Allah explains to the Muslims how their attitude towards the actions of the polytheists. Allah told the Muslims to let their attitude, because he would not comply with their request. Because that request is not in accordance with the Sunnatullah and also not in accordance with the characteristics of Allah who is very wise and Most Compassionate. Allah will not punish them in this world, because the Prophet was sent to give instructions to them, to convince them of disbelief, so that they show remorse for their actions. The Prophet was sent as a mercy not as a disaster. Allah will not punish them, as long as the Messenger of Allah is among them. Allah only punished them after the Prophet migrated to Medina. Allah explained that He would not punish them if they wanted to stop their denial and repent, that is, follow the instructions given by the Messenger of Allah and they want to embrace Islam."
		   },
		   {
			"id": 1194,
			"surah": 8,
			"ayat": 34,
			"tafsir": "After that Allah explained that Allah would not bring down punishment on them, even though they deserved to be punished, because they had prevented the believers from entering the Grand Mosque to perform the pilgrimage. The punishment was not sent down because the Prophet Muhammad was among them, and there were still believers who asked Allah's forgiveness with the Prophet Muhammad. Allah explained that those disbelievers had no right to control Baitullah and the forbidden areas, because they had committed shirk and had done various damages in those areas. However, those who actually have the right to control Baitullah and those forbidden areas are only pious people who respect Baitullah as a holy and worship place, namely the Prophet Muhammad and his followers. Allah confirms that most of the disbelievers do not know that they have no right to control the Baitullah and the forbidden areas, because they are not religious helpers. And those who have the right to control the Baitullah are only those who are pious."
		   },
		   {
			"id": 1195,
			"surah": 8,
			"ayat": 35,
			"tafsir": "Allah explains the reasons why they do not have the right to control the Baitullah, and the area is forbidden, that is because they are during their prayers, doing tawaf, they are naked and whistling and clapping. It was narrated from Ibn Abbas ra: \"The people of Quraysh circled the Baitullah naked, whistling and clapping their hands.\" (History of Ibn Abi Hatim from Ibn Abbas). And he said: \"That the Quraysh, both men and women, surrounded the Kaaba naked. They held hands, whistled and clapped their hands.\" (History of Ibn Abi Hatim from Ibn Abbas) Ath-thasti related a history that was asked by Nafi bin al-Azraq that he said to Ibn Abbas: \"Tell me about the meaning of the word of Allah Azza wa Jalla \"Illamukaan wa tashdiyah.\" He said, \" Al-Muka is the sound of the Qunburah bird and Tashdiyah is the sound of the sparrow, which is the same as clapping. And that was when the Messenger of Allah was praying, while he was in a place between the Black Stone and the pillars of Yemen (ie he was facing north so that he could unite the direction of the Kaaba and Baitul Makdis in one direction). Then came two men from Bani Sahm, one of whom stood to the right of the Prophet, while the other clapped his hands as loud as the sound of sparrows disturbing the Prophet's prayer.\" (History of Ath-thasti from Nafi bin Azraq) Then Allah threatened their actions with severe threats, in the form of punishment for their disbelief. This torment includes the torment of this world and the torment of the hereafter. The torment of this world they experience is the death of their leaders and the captivity of their soldiers during the Battle of Badr and their total defeat at the time of the conquest of Mecca. As for the torment in the afterlife they will have endless regrets when they feel the enormity of suffering due to the heat of the fires of hell."
		   },
		   {
			"id": 1196,
			"surah": 8,
			"ayat": 36,
			"tafsir": "The mufassir narrated from Ibn Abbas, Mujahid, Said bin Jubair, and others as follows, \"This verse was revealed regarding Abu Sufyan himself and his property which was handed over to finance the polytheists during the Battle of Badr, as well as his assistance to them during the battle of Uhud and others.\" In another narration it is stated that, after Abu Sufyan was able to save his caravan (in the Battle of Badr) by taking the coastal road to Mecca he walked accompanied by a team of soldiers of the polytheists to incite people not to fight them. So they came to the people who had merchandise in the caravan and said, \"O people of Quraysh, know: That Muhammad has exiled you and killed your leaders. So help us by sacrificing your property to fight Muhammad. Maybe we can achieve victory over him.\" Then they carried out the recommendation. Said bin Jubir said, \"In fact Abu Sufyan at the time of the Uhud war hired 2,000 people from the Bani Kinanah tribe to fight the Prophet apart from the Arabs who were already in the army.\" (History of Ath-thasti from Nafi bin Azraq) In this verse Allah explains the preparations of the Quraysh infidels before the Battle of Badr, that is, they mobilized their energy and possessions to block the spread of Islam and the struggle of the Prophet Muhammad. No matter how much army strength they have and the property they use, they will experience failure in providing for this property, none other than because their actions are like the actions of Satan who are not based on the right stance. The result is sheer regret, because their soul strength and property are lost for nothing and their struggle is in vain. Then their successive struggles will be broken, so that in the end, only God's words will rise high. Allah threatens disbelievers with a strong threat, that on the Day of Resurrection they will be herded into the fires of hell."
		   },
		   {
			"id": 1197,
			"surah": 8,
			"ayat": 37,
			"tafsir": "Allah explains, that He will give victory to the believers and give defeat to the disbelievers. The aim is to separate the bad groups from the good ones and make the bad groups as a unity that cannot be separated from one another. The good group are those who operate under the auspices of the monotheistic religion and struggle to elevate the sentence of Allah under the leadership of the Prophet to realize what Allah has commanded and to destroy everything that hinders it. And prevent everything that is prohibited by Allah and destroy everything that causes the prohibition to occur. They struggle with energy, mind and property for the sake of religion. While the bad group are those who wallow in polytheism and hinder the religion of Islam and violate the laws of Allah and inflame enmity and cruelty. Separation between the two groups is a provision that applies continuously. While the eternal is that which is good between the two groups. Allah's Word: As for the foam, it will disappear as useless; but what is beneficial to humans, will remain on earth. Thus God made a parable. (ar-Rad\/13: 17) Allah also explains that the bad people will be piled into one heap like useless things and they will be put into the fires of Hell. These are described by Allah as those who are truly at a loss as a result of their property and soul being sacrificed to a futile struggle. They will experience useless remorse, because they cannot escape from Allah's torment which is very painful."
		   },
		   {
			"id": 1198,
			"surah": 8,
			"ayat": 38,
			"tafsir": "Allah ordered the Prophet Muhammad and his followers to declare to the Quraysh infidels, namely Abu Sufyan and his followers that Allah made an offer to them, if they wanted to stop their hostility towards the Prophet Muhammad's call and stop his deception in obstructing the spread of Allah's religion, they are still given the opportunity to repent. And Allah will forgive them their sins that they have committed and they will not experience torment in the hereafter. Likewise, the Messenger of Allah would not fight them and would not exact revenge for their actions which they had committed in the form of torture, expulsion, murder, plundering, or other things. This is an Islamic stipulation, which is to love peace as long as the teachings of Islam can be spread over the face of the earth and not be hindered. However, if the call to Islam is obstructed, then Muslims will act against those who obstruct it. Allah gave threats and warnings that if they still ignore the call and they continue to be tough in opposing Islamic teachings, as well as obstructing and fighting against Muslims, then the sunnah of Allah that has been applied to the ancients will return to effect, namely Allah will help struggle of the believers and destroy the deceit of the disbelievers. Allah said: Verily, We will help Our messengers and those who believe in the life of the world and on the day when the witnesses appear (the Day of Resurrection). (al-Mumin\/40: 51) To illustrate that if the polytheists really stopped their actions against the Prophet Muhammad, accepted his call and converted to Islam, they would receive forgiveness from Allah. As the hadith narrated by Amr bin al-ash said: \"After Allah absorbed the religion of Islam truly into my heart, I came to the Prophet and said:\" Stretch out your hand, I will pay allegiance to you. So Rasulullah stretched out his right hand, then I pulled my hand. The Prophet asked: \"Why did you withdraw your hand?\" I replied: \"I will set a condition\". Rasulullah asked: \"You will require what?\" I replied: \"I want Allah to forgive me.\" The Messenger of Allah said: \"Don't you know, O Amr, that Islam erases what happened before, and that the migration has erased what was before and the pilgrimage removes the previous sins.\" (Muslim history from Amr bin al-ash)"
		   },
		   {
			"id": 1199,
			"surah": 8,
			"ayat": 39,
			"tafsir": "Allah inflames the fighting spirit of the believers, that is, if the polytheists still refuse calls to stop hostilities, Allah orders the Messenger of Allah and his followers to fight them so that there will be no more slander that will disturb Muslims and their religion. So that there will be no more fear and worry that grips the heart of a person when he converts to Islam. This is a guarantee for humans that they have freedom in embracing religion and implementing the Shari'a. Allah says: \"There is no compulsion in (adhering to) religion (Islam), in fact there is a clear (difference) between the right path and the wrong path.\" (al-Baqarah\/2: 256) Then Allah offers once again to the polytheists that if they stop disbelief and enmity, then Allah is Seeing of what they do, and will reward them for their deeds. Rasulullah said: \"I was ordered to fight people so that they say \"La ilaha illallahu\". Azza wa Jalla\". (Al-Bukhari and Muslim history from Ibn Umar) This war order is a last resort, there are other verses that recommend inviting you to the right path wisely, as stated in surahh an-Nahl\/16 verse 125."
		   },
		   {
			"id": 1200,
			"surah": 8,
			"ayat": 40,
			"tafsir": "Allah threatened them that if they continued to reject the Prophet's call for peace and still did not stop their denial of the Apostle's call and continued to fight and antagonize the Muslims, then Allah ordered the Muslims to tell them that Allah remained a protector who would help the Muslims. And Allah guarantees victory for the Muslims. And Allah forbids Muslims to surrender and be afraid of the challenge of the polytheists. At the end of the verse Allah confirms to the Muslims that He is Allah the best Protector. Then it will not be in vain who seek His protection. And indeed this has always happened in human life, both from ancient times until the arrival of the Islamic religion, that is, those who have the right to control Allah's earth are only pious people among His servants. Allah's Word: \"And indeed, We have written in the Zabur after (written) in Az-dzikr (Lauh Mahfudh), that this earth will be inherited by My pious servants.\" (al-Anbiya\/21: 105)"
		   },
		   {
			"id": 1201,
			"surah": 8,
			"ayat": 41,
			"tafsir": "In this verse Allah explains the division of the spoils of war in accordance with Islamic law. Jumhur scholars are of the opinion that this verse was revealed related to the Battle of Badr and is the first verse regarding the distribution of spoils of war after the Battle of Badr. Allah explains that all the ganimah that Muslims get from disbelievers in war, must be taken one-fifth for Allah and the Messenger, namely for matters related to religion, such as the benefit of a preacher in preaching, establishing religious symbols, to maintain Kaaba, and for the needs of the Prophet and his household for one year. Then from this one-fifth must also be given to his relatives. In this case, only Bani Hasyim and Bani Muttalib were considered relatives of the Prophet and not Bani Abdi Shams and Bani Naufal. Then it is also given to Muslims who need help such as orphans, the poor and ibnussabil (travelers who lack funds). Four-fifths of the ganimah were distributed to the soldiers who took part in the war. Narrated by Imam al-Bukhari from Mutim bin Jubair from Bani Naufal, he said, \"I and Uthman bin Affan from the tribe of Bani Abdi Shams together came to the Messenger of Allah, then we asked him, \"O Messenger of Allah, you have given ganimah to tribe of Bani Muttalib and let us not get a share, even though we are equal with them.\" The Messenger of Allah replied, \"Indeed the tribes of Bani Muttalib and Bani Hasyim are one unit.\" The Prophet's answer was as an insinuation to Bani Shams and Bani Naufal, that they could not likened to the Bani Muttalib and Bani Hasyim who always struggled to accompany the Prophet and were never hostile to him. Mujahid, an expert in commentary said that Allah knows, among the tribes of Bani Hasyim and Bani Muttalib there are many who are poor. Therefore they were given a share of the ganimah, because they were not may receive zakat.The difference in treatment above must be returned to history, namely k ethics of the Quraysh wrote a treatise that determined their attitude towards the Prophet Muhammad to boycott the Prophet's companions. So the Quraysh expelled the Bani Hashim from Mecca and placed them in the syiib (valley) of the Bani Hashim, because they always protected the Prophet Muhammad. Then the Bani Muthalib tribe came to join them, while the Abdi Shams and Bani Naufal tribes did not join them so they were not boycotted by the Quraysh people. Abu Sufyan from the descendants of the Umayyads often fought the Prophet Muhammad together with the polytheists and Jews until Mecca was controlled by the Prophet Muhammad and only then did Abu Sufyan convert to Islam. As for the lesson from the division of ganimah for Allah and the Prophet, it is because the Islamic government in managing its people needs to have funds to be used for the public good, to uphold religious symbols and for defence. Everything is taken from a fifth for Allah. Then for the benefit of the head of state the share of the Prophet and his household is given. Then they were also given close relatives who were close to the Prophet, namely Bani Hasyim and Bani Muttalib as a reward for their support for the Prophet's cause. Then also to people who need help, and Muslims who are economically weak. This mode of division has always been practiced in most Islamic countries although there are slight differences in the practice of dealing with the needs of society and its people. This method of distribution must be accepted and implemented if Muslims truly believe in Allah and in what He has revealed. The Battle of Badr was named yaum al-furqan. Furqan day is the day that separates faith and disbelief. The victory of the Muslims in the Battle of Badr was the first victory against the polytheists, even though their number was three times that of the Muslims, Allah is Almighty over all things, has the power to give victory to the Muslims according to His promise. In addition to being called the Battle of Badr as \"yaum al-furqan\" it is also \"yaum iltaqa al-jam'an\" which means the day the two armies met, the Muslim army under the leadership of the Prophet Muhammad and the Quraysh army under the leadership of Abu Jahl and his friends."
		   },
		   {
			"id": 1202,
			"surah": 8,
			"ayat": 42,
			"tafsir": "In this verse Allah shows His mercy to the Muslims when the Battle of Badr occurred. The Muslims occupy a very strategic place, it is very possible to gain victory, namely choosing a place that is on the edge of the valley near Medina, while the polytheists are at the end of the valley far from the caravan of camels carrying merchandise led by Abu Sufyan on the edge of coast, about five miles from Badr. The Muslims were on the edge of the valley closest to Medina, when it had just rained, so they had an adequate supply of drinking water and the situation of the land being drenched with rain, while the polytheists were at the far end of the valley, which was dry because they did not get rainwater. and the ground trampled by the polytheists is soil that contains dust, so that their feet easily sink. If the Muslims reach an agreement to determine the time of the battle, surely they will not agree in determining the time of the battle. However, because Allah has determined the course of the battle, the Muslims themselves did not even plan the time, especially when they saw that the number of Muslim soldiers was very small compared to the number of soldiers of the polytheists and their weapons were incomplete. The intention of the Muslims was to fight for control of the camel caravan full of merchandise brought from Syria under the leadership of Abu Sufyan. This action was in response to the actions of the polytheists who confiscated the property of the Muslims who had been left behind in Mecca due to their migration to Medina. Initially the polytheists were not afraid to face the Muslims who were led by the Prophet. But after they know their position and condition, they feel afraid to face the Muslims. Abu Sufyan as the leader of the trading caravan then sent a messenger to Mecca informing them of the danger they were facing. Then the Quraysh from Mecca sent troops led by Abu Jahl with the intention of helping Abu Sufyan's caravan. Noticing the arrival of a sizeable Quraysh army from Mecca, Prophet Muhammad changed direction from blocking Abu Sufyan to facing the Quraysh army. So there was a battle in the valley of Badr. Allah brought together the two armies without prior approval from both sides, to determine the battle. Allah wants victory for the Muslims and destroys the polytheists, so that those who believe achieve victory based on evidence that can be witnessed clearly as proof of the truth of Islam, and as proof that Allah has carried out His promise to His Prophet and the Muslims , so that their doubts disappeared and the victory was in the hands of the Muslims. Allah is All-Hearing, All-Knowing of everything that is said by the disbelievers and believers and will certainly give a reply according to what He hears and knows."
		   },
		   {
			"id": 1203,
			"surah": 8,
			"ayat": 43,
			"tafsir": "Allah knows what was said by the Prophet's companions and also knows what was stored in his heart when Allah showed the Prophet in a dream that the number of enemies was few. After the Prophet told his companions about his dream, their hearts calmed down and their hopes for victory increased, so that the dream gave them encouragement and enthusiasm to face the battlefield. If Allah showed His Prophet that the number of polytheists is large, fear will arise in their hearts, they will be afraid to face the enemy and of course this will cause great conflict among the Muslims who do not agree to continue the war, because among the Muslims there are those who have strong faith and want to obey the Apostle's orders to fight and there are also those who are weak in faith, who want to avoid war. Allah saves the Muslims from fear and strife which can lead to weakness and destruction. Indeed, Allah is All-Knowing of what is stored in the heart, namely the feelings of fear and anxiety from people who are weak in faith and the courage to go forward to the battlefield for people who have strong faith who always trust Allah."
		   },
		   {
			"id": 1204,
			"surah": 8,
			"ayat": 44,
			"tafsir": "In this verse Allah commands the Prophet to be grateful for His blessings, when He showed the enemy in small numbers to the vision of the Prophet and his companions, similarly Allah revealed the number of Muslim soldiers to be small in the sight of the enemy's eyes, so that both sides would go to war in the hope of winning the war. achieve victory. The Muslims fought with enthusiasm because their hearts were full of faith and trust in Allah's promise that they would achieve victory and would be assisted by angels. The disbelievers came forward because they were driven by feelings of pride and self-deceit, so Abu Jahl said, \"The number of Muhammad's army was small, it was enough to be fed with a camel.\" Because each group had the hope of winning, a fierce battle ensued which ended in accordance with Allah's provisions, namely victory on the part of the Muslims."
		   },
		   {
			"id": 1205,
			"surah": 8,
			"ayat": 45,
			"tafsir": "In this verse, Allah commands the Muslims, when they encounter enemy troops, to strengthen their hearts and always remember Allah with lots of remembrance, so that they will gain courage in battle, so they will not run away from the enemy. It is the force that leads to victory in every struggle, both as an individual and as an army. Like in a boxing or wrestling arena, the two boxers or wrestlers after wrestling for some time, of course, will feel tired and weak and each is waiting for a moment or opportunity to knock down his opponent. However, sometimes it also occurred to him that his opponent would be seized with fear, so he persisted in maintaining his determination until in the final round he was declared the winner, even if only with numbers. Likewise, in every battle between troops and troops, what leads to superiority and victory is the steadfastness of the soldiers and not giving up. Fortitude is very useful in every struggle. Allah commands the Muslims to increase their remembrance of Allah in the face of war by always remembering His power and promise to provide assistance to His Messenger and the Muslims. In every struggle, Muslims must believe that victory is in the hands of Allah and Allah will give it to whoever He wills. Dhikr is to read the takbir \"Allahu Akbar\" or pray sincerely and believe that Allah Almighty can give victory. Fortitude and lots of remembrance of Allah are two very important things to reach the goal."
		   },
		   {
			"id": 1206,
			"surah": 8,
			"ayat": 46,
			"tafsir": "In this verse, Allah commands Muslims to obey Allah and His Messenger, especially in war. Obedience to the Apostle with the understanding that he must be seen as the supreme commander in battle who will carry out God's commands, by word and deed. Obedience to the Messenger, in the sense of obeying his orders and tactics, is an absolute requirement for victory. Allah also ordered that there should be no disputes among fellow soldiers, because these disputes bring weakness and will lead to destruction so that in the end they are defeated by the enemy. The conflict caused the Muslims to be afraid and lose their strength. Muslims are ordered to be patient, because Allah is always with those who are patient. There are five kinds of patience: (1) Patience in obedience to Allah and His Messenger; (2) Patience away from His prohibition; (3) Patience does not complain when receiving trials; (4) Patience in the struggle, until the last drop of blood; (5) Patience abstain from luxury and useless deeds, and live simply."
		   },
		   {
			"id": 1207,
			"surah": 8,
			"ayat": 47,
			"tafsir": "In this verse, Allah forbids the Muslims not to act like the Quraysh infidels who left their villages arrogantly with the intention of making people happy. They act arrogantly and arrogantly towards humans who see it and they always praise their soldiers by showing their bravery and bravery. They intend to stir up enmity with the Prophet Muhammad and turn away from his preaching and torture the companions who follow in the footsteps of the Prophet. Allah gives a warning, that He is All-Knowing of what they do and threatens with punishment commensurahte with their crimes. According to Imam al-Bukhari, the verse was revealed in connection with the incident of the Quraysh polytheists, when they left the land of Mecca and moved towards Badr. When the Prophet was confronted with the polytheist army, he munajat by saying, \"O Allah, these are the Quraysh who have come with their arrogance and arrogance, they deny You and deny Your messenger, so give us the help You have promised us.\" When Abu Sufyan, who led the caravan of commercial camels, saw that his camels had been safely along the coast, he said to Abu Jahl, who led the Quraysh troops, \"Your arrival is just to save the caravan of camels from being seized by Muhammad's companions, so now the caravan the camel is safe. Therefore, return home to Mecca.\" Abu Jahl said, \"By Allah we will not return until we reach Badr.\" It so happened that at that time in Badr there was a big market that collected a lot of merchandise every year. Abu Jahl said, \"We will stay at Badr for three days so that we can drink wine with satisfaction, eat delicious dishes, slaughter camels and entertain ourselves with songs and arts. Let all the Arabs know and witness that the Quraysh are in greatness and success.\" Therefore Allah forbids Muslims to act like them, instead the believers must maintain sincerity, steadfastness, patience and obedience to the Messenger of Allah."
		   },
		   {
			"id": 1208,
			"surah": 8,
			"ayat": 48,
			"tafsir": "In this verse, Allah instructs the Muslims to pay attention to the incident that happened to the polytheists and the devil during the Battle of Badr, namely when the devil made them look at their work favorably by saying that no human being can beat you today and even the devil will will provide the assistance needed. Satan imagined to the polytheists of Quraysh that they would definitely win, no one group could beat them, because of the large number of soldiers and complete weapons. Satan also instigates his followers by saying that their struggle is truly a holy struggle, and Satan himself will still be with them as a loyal friend. When the two armies were facing each other so that each saw the state of his opponent clearly, then before the war started the demon turned back and said, \"I escape from you because I can see what you all cannot see.\" What satan saw were Allah's reinforcements for the Muslims, namely an army of angels whose number was not less than a thousand angels. Satan continued, \"I fear Allah, and Allah is very grievous in torment.\" Satan's fear caused him to see angels sent down from the sky to help the struggle of Muslims. Satan and the angels are two factions that are very contradictory and cannot get together. If the two of them got together, then surely the strong group, namely the angels, would destroy the weak group, namely Satan and his friends."
		   },
		   {
			"id": 1209,
			"surah": 8,
			"ayat": 49,
			"tafsir": "In this verse Allah warns the Muslims not to be swayed by the utterances uttered by the enemy, when the hypocrites and those who have a disease in their hearts say, \"What was it that prompted Muhammad's companions to advance to the battlefield at Badr? , even though their numbers are few, more or less three hundred people and the number of enemies is very large, their courage is nothing but because they were deceived by their religion.\" Allah refutes their words with His word which says, \"Whoever trusts in Allah and believes in Him with a sincere and firm heart, Allah will surely help him and nothing can prevent Allah's will, for Allah is Mighty, Wise. .\""
		   },
		   {
			"id": 1210,
			"surah": 8,
			"ayat": 50,
			"tafsir": "In this verse Allah explains that if the Messenger of Allah had seen with his own eyes the condition of the unbelievers of Quraysh when their souls were taken by the angels, while hitting them in the face and back, surely the Prophet would have been horrified at the sight of this doom. In addition to the torments that their bodies feel, they also suffer pain because of the rebuke of the angel who said, \"You feel the torment of the burning hell.\" In fact, what Allah has explained in this verse is a matter that includes supernatural matters, humans cannot see and witness the doom. If they could see, surely they would witness a terrible event, so that it could make disbelievers flee from their disbelief, and unjust people stop from their tyranny for fear of the consequences. According to a history, the meaning of this verse is: the Muslims hit them from the front, while the angels hit them from behind during the Battle of Badr. This shows the miracles of the Prophet in facing the Quraysh army which is quite large."
		   },
		   {
			"id": 1211,
			"surah": 8,
			"ayat": 51,
			"tafsir": "The punishment they feel is as a result of what their own hands have done, namely their disbelief and tyranny, both in words and in deeds. It is called the \"hand\" that performs the action, even though an action is sometimes carried out with the hands or feet, the five senses or the mind, because according to custom most human deeds are carried out by the hands. God will not punish anyone, except because of his own sins and transgressions. Truly Allah says, \"O My servants, in fact I have forbidden injustice to Myself and have also forbidden injustice among you. Therefore you should never commit injustice. O My servants! I will count your deeds only for you. Whoever gets good, let him praise Allah and whoever gets bad, let him not criticize, except himself.\" (Muslim history from Abu dhar)"
		   },
		   {
			"id": 1212,
			"surah": 8,
			"ayat": 52,
			"tafsir": "The situation of the polytheists of Quraysh was similar to that of Pharaoh and his followers and the previous disbelievers. They denied Allah's verses, so Allah recompensed them by torturing them, because of their sins, the torments inflicted on the Almighty and Almighty God. It has been Sunnatullah that Allah tortures disbelievers because of their sins, so that is what happened during the Battle of Badr. Allah helps His Messenger and the Muslims, and destroys the disbelievers because of their sins. Allah is almighty, His torment is painful. No one can escape from the punishment that He has determined. The Prophet Muhammad said: \"Indeed, Allah Taala gives an opportunity (not immediately torturing) the wrongdoer, but if he is going to torture him, then he will not escape His torment.\" (History of al-Bukhari and Muslim)"
		   },
		   {
			"id": 1213,
			"surah": 8,
			"ayat": 53,
			"tafsir": "This incident, namely to torture the Quraysh people, was because they denied Allah's blessings, when Allah sent an apostle from among themselves, who recited His verses, then they denied him, even expelled him from his country, then fought continuously. Allah tormented them because of their sins. This proves the sunatullah that has been in effect since long ago. Allah does not change a favor that has been valid for a long time. Allah does not change a favor that He has bestowed on a people, so that people change what is in themselves. This verse contains a hint, that the blessings that God has given to people or individuals are always related to their continuity with their own morals and deeds. If their morals and deeds are well maintained, then the grace that God has given them will still be with them and will not be revoked. Allah will not revoke it, without their tyranny and transgression. However, when they have changed these blessings in the form of faith, morals, and good deeds, then Allah will change their condition and will revoke the favors of His gifts from them so that the rich become poor, the noble ones become despicable and the strong become weak. . And it is not the case that the happiness of the people is linked to wealth or a large number of children as it is thought by most of the polytheists that Allah told in His words: And they said, \"We have more wealth and children (than you) and we will not be punished.\" (Saba\/34: 35) Thus the nobility of a people is not associated with their descendants or the virtues of their ancestors, as the Jews acknowledge. They were deceived by their arrogance that they were made by Allah as the chosen people above other people, because it was associated with the glory of Prophet Musa as Allah is All-Hearing, All-Knowing of what those who belied the messengers said, He is All-Knowing of what they do, what they leave behind and will surely give a reward according to their deeds."
		   },
		   {
			"id": 1214,
			"surah": 8,
			"ayat": 54,
			"tafsir": "They change the grace of Allah that is in him like the behavior of Pharaoh and his followers and the disbelievers before. First, they deny the verses brought by the apostles about the oneness of Allah, the obligation to worship only Allah, and the existence of Allah's punishment in the hereafter. Second, they deny Allah's verses and deny His gifts, even though He created all things. Allah destroyed them because of their sins and had drowned Pharaoh and his followers because they were all wrongdoers."
		   },
		   {
			"id": 1215,
			"surah": 8,
			"ayat": 55,
			"tafsir": "In fact, the worst animals that crawl on earth in the sight of Allah are disbelievers who are disobedient, so that their condition is continuous in disbelief and is in denial of the Prophet, so faith cannot be expected from them. There are those of them whose position as leaders are always envious of the Messenger of Allah, denying every verse that is also written in the Torah which bears witness to its truth, even though in their hearts they believe that Muhammad is really the messenger of Allah, so they know the Prophet Muhammad as they know a child. -his own son. Those who become their followers are people who are blindly following their leaders and don't want to see the evidence mentioned in their book. In this verse Allah equates them with animals, even more astray than animals, because the animals have benefits for humans, while they have absolutely no benefits for themselves or for others. This is explained by Allah in His word: Or do you think that most of them hear or understand? They are just like cattle, even more astray. (al-Furqan\/25: 44)"
		   },
		   {
			"id": 1216,
			"surah": 8,
			"ayat": 56,
			"tafsir": "The Jews have made several agreements with the Muslims but they always betray their promises and they are not afraid of Allah and the various consequences of that betrayal. After the Prophet Muhammad migrated to Medina, he entered into an agreement with the Jews in Medina. In that agreement, they were allowed to stay in Medina while still embracing their religion, and they were given security guarantees for themselves and their property. With this the Prophet participated in maintaining the security of Medina from enemies. But each of the Jewish tribes violated the agreement. It was narrated from 'Abdullah bin 'Abbas, that the Jews of Medina who broke their promise were the tribe of Bani Quraidhah. They had broken their promise to the Prophet, because they provided weapons to the Quraish infidels during the Battle of Badr. Then they said, \"We forgot and felt guilty.\" Then the Prophet made a second agreement, but this was also violated by inciting people to fight the Prophet when the Battle of Khandak occurred. One of their leaders deliberately came to Mecca to make an agreement with the Quraysh to jointly fight the Prophet Muhammad."
		   },
		   {
			"id": 1217,
			"surah": 8,
			"ayat": 57,
			"tafsir": "Allah explained what the Muslims should do after the repeated breaches of the promises of the Jews. Allah explained that if the Muslims meet them in battle, they must be scattered, likewise those who are behind them must be annihilated so that they can take lessons from the actions of these Jews. The strict action of the Muslims on them must be able to create a frightening impression on those behind them, so that they don't dare to break their promises anymore. In this verse, Allah also warns the Muslims not to be deceived a second time after being betrayed the first time by the Jews and they apologize. So Allah emphatically explained that Muslims should not hesitate to take firm action so that such violations do not recur in the future and so that those behind them learn lessons from them. It was narrated by al-Bukhari and Muslim that the Prophet Muhammad once preached in front of his companions in the face of battle as follows: \"O people, do not aspire to (want) to meet the enemy and ask God for safety. But when you meet them, then endure with patience (in battle), and know that paradise is under the shadow of the sword.\" Then he added with a prayer, \"O Allah, who sent down the Qur'an, and who drives the clouds in the sky, destroy these groups of enemies. Disperse them and give us help to defeat them.\""
		   },
		   {
			"id": 1218,
			"surah": 8,
			"ayat": 58,
			"tafsir": "If the Muslims feel there are signs of betrayal from a group that entered into a defense agreement, the agreement must be returned to them and they should try to prevent the betrayal from occurring, by returning the agreement honestly accompanied by a warning that after the betrayal the Muslims no longer bound by any promises with them. Allah does not like those who betray, and also does not allow absolute betrayal. The Muslims are prohibited from fighting them before there is notification, that the agreement between them and the opposing party is no longer valid, because of treason. This needs to be announced, so that there are no accusations from the enemy that the Muslims have been fighting them without cause or violating the agreement. Allah also warns those who betray the punishment that will befall them as a result of their betrayal."
		   },
		   {
			"id": 1219,
			"surah": 8,
			"ayat": 59,
			"tafsir": "And let the disbelievers think that they can escape the power of Allah, and can be saved from the consequences of their crimes and treachery, because in fact they cannot weaken Allah at all. On the other hand, Allah will reward them in this world by being defeated by the Prophet and the Muslims, so that they will feel the consequences of their betrayal, and in the hereafter they will also feel the punishment from Allah which is even more humiliating."
		   },
		   {
			"id": 1220,
			"surah": 8,
			"ayat": 60,
			"tafsir": "To deal with the betrayal of the Jews and their conspiracy with the polytheists with the aim of destroying the Muslims, Allah commands in this verse that the Muslims prepare their strength to face the enemies of Islam, both enemies that they clearly know, and those who have not declared their hostility openly. -blatantly. What must be nurtured first is the power of faith that will make them believe and believe that they are defenders of truth, enforcers of Allah's words on earth and they will definitely win in facing and eradicating tyranny and disobedience. It is this perfect power of faith that can build mental strength that is always instilled in the hearts of all the people so that they truly become a strong and mighty nation in facing various kinds of difficulties and trials. A mentally strong nation cannot be defeated by other nations no matter how perfect their equipment and weapons are. This has been proven in the Battle of Badr where the army of the polytheists who were much larger in number and weapons could be beaten back by the Islamic army which was few in number and very underarmed, but had a strong mentality and firm faith. In addition to their faith\/mental strength, physical strength must also be prepared because these two strengths must be combined into one, physical strength alone will be less effective if it is not accompanied by mental strength. Likewise, mental strength alone will be powerless if it is not supported by physical strength. Allah ordered the Muslims to prepare horse troops placed in strategic places, ready to attack and destroy every enemy attack from wherever it came. During the time of the Prophet, this horse troop was of very strategic value and of great efficacy. A country that has a large cavalry army will be respected by other countries, and that other country will think beforehand when it comes to attacking that country. At present the cavalry (cavalry) has been replaced by armored tank troops, the problem of war today is different in style and form from the wars of the past. The weapons used also vary, in the form of air fleets, sea fleets, and even the use of very sophisticated weaponry. If at the time of the Prophet Muhammad Allah ordered that cavalry be prepared, so at this time the Muslims must prepare various modern weapons to defend their country from enemy attacks. As is known today's modern weapons are the result of technological advances. So Muslims are obliged to try to achieve the highest knowledge and master technology and always follow developments and progress. To achieve high science and technology we need a very large cost. We are obliged to accelerate economic progress and increase people's income. Thus it will be easy for the people to spend part of their wealth for the interests and defense of their country. A country that is mentally strong, has a strong defense, and has a strong economy will surely be respected by other countries and they will not dare to make enemies of it, let alone attack it. This is what Allah demands of the Muslims. There are several verses in the Al-Qur'an that encourage you to spend your wealth fi sabilillah, including the word of Allah: And spend (your wealth) in the way of Allah, and do not drop (yourself) into destruction with your own hands, and do good. Indeed, Allah loves those who do good. (al-Baqarah\/2: 195) And the word of Allah swt: And the parable of those who spend their wealth to seek the pleasure of Allah and to strengthen their souls, is like a garden located on a plateau that is watered by heavy rain, then the garden bears fruit double fruit. If heavy rain does not water it, then dew (is sufficient). Allah is Seeing of what you do. (al-Baqarah\/2: 265) Allah promises a great reward to everyone who spends his wealth in the way of Allah, and he will not be harmed in the slightest because he spends his wealth. Instead the deed will get a double reward."
		   },
		   {
			"id": 1221,
			"surah": 8,
			"ayat": 61,
			"tafsir": "If the enemies of Islam, both Jews and polytheists, are inclined towards peace, perhaps because they really want peace or because they see the strength and solidarity of the Muslims or because they have not yet consolidated themselves for war or for other reasons, then the possibility of peace should be explored. After it turns out that making peace will not harm the strategy of Islamic struggle, peace should be accepted, of course with terms and conditions that can guarantee the common interest and not harm each party, because the basis of Islamic struggle is peace. This has been practiced by the Prophet when he accepted Hudaibiyah peace between the Muslims and the polytheists in the sixth year of Hijri. Even though the conditions for peace at Hudaibiyah were seen as detrimental to the Muslims, so that many of his friends objected, the Prophet, who had far-reaching views and wise tactics and tactics, was able to accept them. It turned out later, as stated by historians, that the Hudaibiyah Peace was the foundation for the next victory of the Muslims. After the peace agreement is accepted, the Prophet and the Muslims should place their full trust in Allah, because He is the All-Hearing and All-Knowing of the true nature of peace, whether the Jews and polytheists are really honest and want peace to be carried out, or is it just a tactic? and tactics, or because they want to deceive or just wait for the Muslims to be off guard."
		   },
		   {
			"id": 1222,
			"surah": 8,
			"ayat": 62,
			"tafsir": "If the Jews and polytheists wanted to deceive or wanted to find an opportunity to attack in the presence of peace, then Allah gave assurahnces to the Prophet Muhammad that it would not harm the Muslims. Sufficient is Allah (as a protector), Allah always protects His Messenger and protects the Muslims and will give them victory if the enemies attack again. Allah has strengthened the position of His Messenger with the help He has given to the Muslims in the past as happened during the Battle of Badr, where the Muslims were weak and few in number. They can defeat the multiplied and fully armed polytheists. Allah has united the hearts of the Muslims so that they live in harmony and peace, love and help each other, so that they are an inseparable unit, even though they previously lived in tribes and were enemies between one group and another. They initially consisted of Muslims who came to Medina and the Ansar residents of Medina who welcomed the arrival of the Muslims. The Ansar themselves were once divided, consisting of the Aus and Khazraj tribes. Between these two tribes there is always enmity and war. But by God's will they all become a united people under the banner of faith, willing to sacrifice their wealth and lives to uphold God's sentence. This is a priceless gift from Allah which cannot be attained even at the cost of all possessions and wealth. Unity of heart, unity of determination and unity of ideals and ideology are very important and valuable things to achieve one ideal. This is the gift of Allah that has been owned by the Muslims at that time. Because of the importance of this gift and its very high value, Allah reminds them to always remember Allah with His words: And remember Allah's favor upon you when you were enemies (during ignorance), then Allah united your hearts, so that with His grace you became brothers. (Ali 'Imran\/3: 103) So with Allah's help and the unity of the Muslims as well as the love and affection that exists between them, no matter how difficult and how great the danger that will befall them, it will certainly be overcome and overcome. Allah also warns in this verse how high the value of unity is, so that if the Prophet Muhammad himself spent all the wealth on earth to achieve it, he would definitely not succeed. But God has united their hearts with strong faith and high compassion. This is a sign that Allah is pleased with the Muslims and approves of their struggle and they do not need to worry, indeed Allah is Mighty and Wise."
		   },
		   {
			"id": 1223,
			"surah": 8,
			"ayat": 63,
			"tafsir": "If the Jews and polytheists wanted to deceive or wanted to find an opportunity to attack in the presence of peace, then Allah gave assurahnces to the Prophet Muhammad that it would not harm the Muslims. Sufficient is Allah (as a protector), Allah always protects His Messenger and protects the Muslims and will give them victory if the enemies attack again. Allah has strengthened the position of His Messenger with the help He has given to the Muslims in the past as happened during the Battle of Badr, where the Muslims were weak and few in number. They can defeat the multiplied and fully armed polytheists. Allah has united the hearts of the Muslims so that they live in harmony and peace, love and help each other, so that they are an inseparable unit, even though they previously lived in tribes and were enemies between one group and another. They initially consisted of Muslims who came to Medina and the Ansar residents of Medina who welcomed the arrival of the Muslims. The Ansar themselves were once divided, consisting of the Aus and Khazraj tribes. Between these two tribes there is always enmity and war. But by God's will they all become a united people under the banner of faith, willing to sacrifice their wealth and lives to uphold God's sentence. This is a priceless gift from Allah which cannot be attained even at the cost of all possessions and wealth. Unity of heart, unity of determination and unity of ideals and ideology are very important and valuable things to achieve one ideal. This is the gift of Allah that has been owned by the Muslims at that time. Because of the importance of this gift and its very high value, Allah reminds them to always remember Allah with His words: And remember Allah's favor upon you when you were enemies (during ignorance), then Allah united your hearts, so that with His grace you became brothers. (Ali 'Imran\/3: 103) So with Allah's help and the unity of the Muslims as well as the love and affection that exists between them, no matter how difficult and how great the danger that will befall them, it will certainly be overcome and overcome. Allah also warns in this verse how high the value of unity is, so that if the Prophet Muhammad himself spent all the wealth on earth to achieve it, he would definitely not succeed. But God has united their hearts with strong faith and high compassion. This is a sign that Allah is pleased with the Muslims and approves of their struggle and they do not need to worry, indeed Allah is Mighty and Wise."
		   },
		   {
			"id": 1224,
			"surah": 8,
			"ayat": 64,
			"tafsir": "In this verse, Allah repeats His guarantee to the Prophet Muhammad, that Allah will help him with the help of Muslims who truly believe and have full confidence that Allah is with them. According to the history of Ibn Abbas, this verse was revealed in connection with Umar's conversion to Islam, following his conversion to Islam 33 men and six women, as stated by Jubair (see Tafsir al-Kabir, Volume VIII, pp. 197-198). With faith and belief, their determination will not be shaken by any event or threat. Faith and belief are described by Allah in His words: (Namely) people (who obey Allah and the Messenger) who, when someone said to him, \"The people (Quraish) have gathered troops to attack you, because fear them,\" it turns out (sayings) that increase (strengthen) their faith and they replied, \"Allah is sufficient (to be a helper) for us and He is the best protector.\" (Ali 'Imran\/3: 173) So with the firm belief and determination engendered by the faith and assurahnce of Allah, the Muslims are ready to accept Allah's orders, no matter how hard and difficult they are, even though with those orders they will face many enemies or danger. the big one."
		   },
		   {
			"id": 1225,
			"surah": 8,
			"ayat": 65,
			"tafsir": "Allah ordered His Messenger to inflame the enthusiasm of the Muslims to fight against the enemy in war. The Prophet carried out this order by encouraging his companions to go to war as in the Battle of Badr. Even though the number of the Quraysh disbelievers from Mecca was very large, and their equipment was better, the Prophet encouraged the believers by saying, \"Qumu ila jannatin 'ardzuha as-samawat wa al-ard (Arise you all forward to the battlefield that provides wide heaven, as wide as the heavens and the earth).\" In this verse Allah also confirms that the strength of a Muslim army that truly believes and trusts in Allah will be able to defeat the enemy's forces even if they are ten times as many. If the Muslim army only consisted of twenty soldiers, they could defeat the enemy army which consisted of two hundred people. If their army consisted of a hundred men, they could defeat an enemy army of a thousand, and so on, each warrior of Allah could defeat ten enemies. This is a comparison of power that has no equal in history, because the way of war at that time was not like the war today. War in the present is very dependent on the strength of weapons and perfection. An army that is small in number, equipped with powerful modern weapons can easily defeat a large army but only has mediocre weapons. The war at that time was really a contest of strength and skills because the means of war used were practically of the same kind and quality. It seemed inconceivable that a small army would be able to triumph over a large army ten times its size. But this is what Allah confirms or commands to the Muslims. They should not be afraid or afraid to face multiple opponents, because they are believers who fight not for their own sake, or to seek worldly wealth and glory, but they are God's soldiers who fight to defend the truth; to elevate the sentence of Allah and for the glory of the religion that He has approved. If they die in battle, they will die martyrs, the reward with Allah is immeasurahble. The opponents of the Muslims are disbelievers who only want to maintain their position, rank and property. They do not have high and noble goals in life because they do not believe in God Almighty and do not believe in the Resurrection Day. Their life is to be proud and prioritize material possessions. As for the Jews in Medina, although they believed in God Almighty, they could no longer see the truth, because their eyes had been dazzled by the pleasures of this world. They want to live, if they get a thousand years, they have sunk in the material world, unable to escape greed and greed. These two groups have truly strayed from the right path, can no longer distinguish between right and wrong, they no longer know the path that leads to happiness in this world and the hereafter. People with this trait when faced with a terrible battle they will run helter-skelter because they prefer life over death. This is explained by Allah in His words: Indeed, in their hearts, you (Muslims) are more feared than Allah. That is because they are people who do not understand. (al-hashr\/59: 13) If Allah orders the Muslims to dare to face the enemies of Allah who are ten times their number and declares that they will win, then victory is certain even though it has never happened before in history. Therefore they cannot run away from battle and must fight tooth and nail until victory is achieved. This is the highest degree a Muslim can achieve."
		   },
		   {
			"id": 1226,
			"surah": 8,
			"ayat": 66,
			"tafsir": "In this verse Allah gives relief to the Muslims in the face of enemies who attack them. If in verse 65 Allah orders them to be brave in facing enemies who are ten times bigger than their number, then in this verse it is explained that they are given leniency because they are already in a weak state, both in spirit and in preparation for war. Under these circumstances they were required to face an enemy that was twice their number. This was a minimum level that they had to maintain, because the waivers given were too many compared to the original orders and there was no reason to ask for more waivers. With strong faith and fortitude and full confidence will achieve victory. This was proven when they faced the polytheists in the Battle of Badr. Their strength is less than a third of the enemy's strength, but they can destroy the polytheists. During the Yarmuk War the number of soldiers gathered by the emperor Heraclius, the Eastern Roman empire, to face the Muslim army, was not less than 200,000 (two hundred thousand) people, while the Muslim army sent by friends was only 24,000 (twenty four thousand) people . Thanks to a strong faith, strong, and high spirits the Muslims can defeat the many enemies. It is narrated that the Roman soldiers who died in that battle numbered 70,000 (seventy thousand) people. All the victories that were won by the Muslims were in accordance with the will and permission of Allah as evidence for this truth. Allah says: How many small groups defeat large groups with Allah's permission. And Allah is with those who are patient. (al-Baqarah\/2: 249)"
		   },
		   {
			"id": 1227,
			"surah": 8,
			"ayat": 67,
			"tafsir": "This verse is a rebuke to the Prophet's decision to accept ransom from the polytheists to free their people who were held captive by the Muslims. He leaned towards the opinion of most of his companions who suggested that the prisoners should not be killed and that it would be better if the ransom money was received from them and the proceeds of the ransom could be used for the purposes of the struggle and preparations for war if the enemy attacked again. Therefore Allah confirms in this verse that it is not proper for a Prophet in a war to hold prisoners and wait for a verdict, whether they will be released just like that or by receiving a ransom from their family, unless the circumstances of his followers, their position is strong, and their enemies helpless anymore. The condition of the Muslims before the Battle of Badr was still weak and their strength was still too small compared to the strength of the polytheists. If the captives were not killed, instead they were released again, even if they paid a ransom, while they were the leaders and leaders of their people, they would certainly incite again, and gather a large force to attack the Muslims. This is very dangerous for the weak position of the Muslims. They should not have been taken prisoner, but killed immediately on the battlefield, so that with the death of the dignitaries and leaders, the polytheists would feel afraid and no longer dare to attack the Muslims. Allah's Word in surahh Muhammad\/47: 4): So when you meet people who disbelieve (on the battlefield) then beat them in the neck. Furthermore, when you have defeated them, take them prisoner and after that you may release them or accept ransom until the war is over. Thus, and if Allah had willed, He would have destroyed them, but He wanted to test you one by one. And those who are killed in the way of Allah, Allah does not waste their deeds. (Muhammad\/47: 4) This verse is not only a warning to the Prophet Muhammad, but also a warning to the companions and most of the Muslims who recommend that the captives not be killed, because they are relatives and relatives and maybe someday they will become believers, moreover their ransom money can be used for their own interests. With this recommendation they have taken actions that are contrary to the tactics of war. Whatever reason they put forward, they have been influenced by worldly goods and they have unconsciously forgotten and given no thought to the consequences of carrying out the suggestion. Therefore Allah emphatically states that they want material possessions and worldly life, while Allah wants them to seek rewards for the hereafter by fighting in His way, exalting His sentence until the glory and height of His religion is reached, as stated in His word: Whereas the power is only for Allah, His Messenger and for the believers. (al-Munafiqun\/63: 8) This is the way that Allah wills for those who believe and struggle with wealth, and all the abilities they have even with their souls to achieve it. Allah will always help them. Verily, Allah is Mighty, Most Wise."
		   },
		   {
			"id": 1228,
			"surah": 8,
			"ayat": 68,
			"tafsir": "In this verse Allah explains that the act of the Muslims accepting the ransom is wrong. Had it not been for Allah's pre-existing decree that He would not punish them for this mistake, surely they would have received a severe punishment. Regarding what is meant by \"God's existing decree to save the Muslims from torment because of this mistake,\" the commentators put forward several verses including the word of God: But God will not punish them, as long as you (Muhammad) are among them. And not (also) Allah will punish them, while they (still) ask for forgiveness. (al-Anfal\/8: 33) Even though this verse concerns the polytheists, the Muslims are more entitled to that decision. While the misguided and disobedient polytheists were able to survive the torment of Allah with the presence of the Prophet among them, moreover the devout and loyal Muslims always helped the Prophet and always asked for forgiveness from Allah, of course they deserved more not to be subjected to this severe torment. Allah's Word: Your Lord has set the quality of compassion on Himself, (namely) whoever does evil among you out of ignorance, then he repents after that and corrects himself, then He is Most Forgiving, Most Merciful. (al-An'am\/6: 54)"
		   },
		   {
			"id": 1229,
			"surah": 8,
			"ayat": 69,
			"tafsir": "Allah is Most Forgiving, Most Merciful towards His servants, so with this noble nature Allah forgives and does not inflict torment on the Muslims, even giving them the right to eat and own the spoils obtained in war including the ransom as stated in The following narration: It is narrated that at first the Muslims did not want to use the ransom property paid by the polytheists, for fear that they would be wrong again if there was no revelation that allowed them to use it, so this verse was revealed. This is another proof for them of Allah's mercy and compassion for them. After they made a mistake, they were forgiven and freed from the torment of that mistake, then they were also allowed to eat and have the fruit of that wrong action, namely the ransom they received from the captives. Allah confirms that the treasures obtained from the ransom of captives are lawful and good, not like pork and carrion. Then Allah ordered them to always fear Him by carrying out all His commands and staying away from all His prohibitions, because He is the Most Forgiving and Most Merciful."
		   },
		   {
			"id": 1230,
			"surah": 8,
			"ayat": 70,
			"tafsir": "This verse instructs the Messenger of Allah to tell the prisoners who find it hard to take out treasures for their own redemption that Allah will replace the property they surrender with better and cleaner ones and have faith in Allah. Allah will forgive all sins including shirk, being hostile to Muslims, hostile to Islam, the religion He pleases and carrying out various kinds of actions that He is angry with. Allah is Most Forgiving and Most Merciful towards His servants."
		   },
		   {
			"id": 1231,
			"surah": 8,
			"ayat": 71,
			"tafsir": "With the information that the Prophet gave to the captives as ordered by Allah, many of them declared that they had converted to Islam and were no longer hostile to the Prophet Muhammad and the Muslims. But Allah warned and delighted the Prophet about their next attitude by explaining in this verse that if any of them betrayed their promise by returning to kufr or attacking the Muslims, then the Prophet need not feel upset and grieve. This is normal and common in humans. When he is in trouble and under pressure he speaks sweet words and makes grandiose promises, but when he is in a safe and good mood he breaks all his promises and turns into an even more evil enemy. That's the nature of some of the polytheists, because that trait has become flesh and blood in their bodies. While Allah Almighty and Almighty they have betrayed by associating partners with Him and worshiping idols and doing things that are not pleasing to Him. It is because of this betrayal of Allah that He gave victory to the Muslims, as happened in the Battle of Badr, even though the polytheists were more numerous and more equipped with weapons. Allah is All-Knowing of all that is stored in their hearts, and All-Wise in giving a reply to what humans do, the good ones are rewarded with rewards and the bad ones are rewarded with punishment."
		   },
		   {
			"id": 1232,
			"surah": 8,
			"ayat": 72,
			"tafsir": "In this verse, three groups of Muslims are mentioned: The first group is those who have the highest and noble rank in the sight of Allah, namely the Muhajirin who migrated with the Prophet Muhammad to Medina and those who followed later, namely the emigration before the Battle of Badr. Then some commentators argue that this group includes people who migrated before the occurrence of the Hudaibiyah peace in the 6th year of Hijri. This first group, in addition to their struggle in Medina with the Ansar, had also previously fought in Mecca against the cruel polytheists, who did not hesitate to commit violence and persecution against those who believe in the religion brought by the Prophet Muhammad. All the violence and cruelty inflicted on the immigrants was accepted patiently and steadfastly and could not shake their faith in the slightest. They persist and fight to defend the right religion and are willing to sacrifice their property and lives, they are even willing to leave their homeland, children, wives and their possessions. Therefore they were given a special designation by Allah, first: \"Belief\", second: \"Emigrated\", third: \"Fighting\" with property and goods in the way of Allah\". The second group is \"the Ansar\" in Medina who embraced Islam , believed in the Prophet and they promised the Prophet and the Muhajirin that they would fight together in the way of Allah, were willing to bear all the risks and sufferings of the struggle, for this they were ready to sacrifice their wealth and lives. The Prophet Muhammad instilled a sense of Islamic ukhuwah between the two groups This is so that the Ansar view the Muhajirin as siblings, which each group can inherit. Allah gave them two names, first: \"Giving a place to live\" and second: \"Helper\" because of this they are also called \"The Ansar\". It is as if these two groups, because of their close relationship, have become one, so that there is no longer any difference in rights and obligations between them. the relationship between them is that of close relatives, of loyal friends, each feeling obliged to help and assist the other when some danger or calamity befalls him. They help each other, advise each other and will not let others take care of their business. Only from among them are leaders appointed when they need a leader who will handle their affairs. Anas' friend narrated that the Messenger of Allah had bound the Muhajirin and the Ansar in an oath of allegiance in my house. This hadith was narrated by Anas to the person who asked about the hadith: \"There is no oath of allegiance in Islam\". The third group is the group of Muslims who did not migrate to Medina. They still live in countries controlled by polytheists like believers who are in Mecca and several places around the city of Medina. They cannot be equated with the two groups of Muhajirin and Ansar because they are not in the Islamic community, but are in the mushrikin community. So the relationship between them and the Muslims in Medina cannot be equated with the relationship between the Muhajirin and Ansar believers in Islamic society. If the relationship between fellow believers in Medina is very close, even reaching close relations with relatives and descendants, then the relationship with these three is only bound by faith. If unjust acts are committed against them by the polytheists, the Muslims in Medina will be powerless to defend them because they are in a land of polytheists, and the Muslims of Medina have no right to interfere in the internal affairs of the polytheists. If they had emigrated, they would have been free from this arbitrary and unfair treatment. As for the believers who were captured by the polytheists, they must be freed by the believers with all their might because their stay in the land of the polytheists was not of their will, but under compulsion and they could not escape from there. But if this third group asks for help from the believers because they are oppressed and forced to leave their religion or are pressured and are always hindered by force in implementing Islamic law, then the Muslims are obliged to provide assistance to them, even if necessary by carrying out attacks and wars, unless if between the believers and the polytheists there is a peace agreement or an agreement not to attack each other. Such is the relationship between the first two groups and this third group, which must be considered and practiced and they must act according to the provisions that have been set by Allah. Allah always sees and knows what His servants are doing (Al-Bukhari and Muslim). The fourth group will be explained in verse 75."
		   },
		   {
			"id": 1233,
			"surah": 8,
			"ayat": 73,
			"tafsir": "In this verse, Allah confirms that all disbelievers, even though they have different religions and sects, because some of them are polytheists, Christians, Jews and so on, and even though there are disputes and sometimes hostility between themselves, they can all become loyal friends among themselves. them in various matters. Some of them became leaders for others and sometimes they even agreed to be hostile and attack the Muslims as happened in the Khandaq war. At the time of the revelation of this verse, it can be said that there were only polytheists and Jews in the Hijaz. The Jews often made alliances with the polytheists and helped them in antagonizing the Muslims and often even betrayed the agreement so that they were fought by the Muslims and expelled from Khaibar outside the city of Medina. So the Muslims must forge a solid union and never make an oath of allegiance with them or entrust them with taking care of the affairs of the Muslims, because doing so will lead to great losses or calamities. Allah warns that if this is not heeded, then there will be slander and corruption on earth."
		   },
		   {
			"id": 1234,
			"surah": 8,
			"ayat": 74,
			"tafsir": "In this verse Allah explains the superiority of the Muhajirin and Ansar over other Muslims. They are given the title of people who truly believe, that is, people who have perfect faith. They have proven this with real deeds since the revelation of the Prophet Muhammad until the establishment of the Islamic government in Medina. Ansar people have sacrificed with all their abilities both with property and with their lives to uphold the religion of Allah. If there is no full assistance and assistance from them, it is not certain that the Muhajirin will be able to build the power of Islam perfectly. Thanks to the strong faith and unity between these two factions and the close cooperation between them, a formidable power was created which the enemies of Islam could not paralyze even though their strength multiplied. Because of their strengths, Allah also promised them forgiveness for all the mistakes they made before and provided for them in the hereafter sustenance that never ends, namely heaven full of incomparable favors. To explain the degrees of the first, second and third three groups who have several virtues, Allah says: (The spoils are also) for poor people who emigrated who were expelled from their hometowns and left their possessions in order to seek grace from Allah and be pleased( Him) and (for the sake of) helping the (religion) of Allah and His Messenger. They are the right people. (al-hasyr\/59: 8) And the word of Allah: And those (Ansar) who have occupied the city of Medina and believed before (the arrival of) them (Muhajirin), they love those who emigrated to their place. And they do not put a desire in their hearts for what is given to them (Muhajirin); and they prioritize (Muhajirin), over themselves, even though they also need it. And whoever protects himself from stinginess, then they are the lucky ones. (al-hasyr\/59: 9) And His words: And those who came after them (Muhajirin and Ansar), they prayed, \"Our Lord, forgive us and our brothers who have believed before us , and do not instill hatred in our hearts towards those who believe. O our Lord, indeed, You are Forgiving, Most Merciful.\" (al-hashr\/59: 10)"
		   },
		   {
			"id": 1235,
			"surah": 8,
			"ayat": 75,
			"tafsir": "In this verse it is mentioned that the fourth group is those who converted to Islam too late, believed too late and too late to migrate. But even so they can join the fight with sincerity with the Muslims. They are also willing to sacrifice their wealth and lives like their friends who first converted to Islam. Because of that they are not classified as \"late heroes,\" on the contrary they can be classified into the Muhajirin and Ansar groups even though their rank in the sight of Allah is not as high as that of the first and second groups. To explain the elevation of the rank of the Muhajirin and Ansar, Allah says: Not the same person who spends (his wealth) in the way of Allah among you and fights before the conquest (Mecca). They are higher in rank than those who spent (their wealth) and fought after that. And Allah promised each of them a better (reply). And Allah is All-Seer of what you do. (al-hadid\/57: 10) And His word again: Those who were earlier first (converted to Islam) among the Muhajirin and Ansar and those who followed them well. Allah is pleased with them and they are pleased with Allah and Allah has prepared for them gardens beneath which rivers flow, they will abide therein forever. That's a great victory. (at-Taubah\/9: 100) In concluding this verse, Allah explains the position of ulul arham (close relatives) compared to the position of Muslims in general. Ulul arham who believes is closer to someone than other Muslims, both from the Muhajirin and Ansar. Therefore, they are more entitled to receive help, solidarity, and take care of various affairs. Because of that, it is obligatory to foster a relationship between them by helping each other, inheriting, and appointing them as guardians in marriage and so on. It is narrated that Rasulullah SAW once said: Start (do good) to yourself, then give yourself a living first. If you still have something to support, give it to your family. If there is still more after giving your family, give it to your close relatives. And if there is still more after giving your close relatives, then act like that, that is, some are more entitled than others, and so on. (History of an-Nasa'i from Jabir) In the Qur'an there are also many sayings of Allah which prioritize the position of close relatives, namely fathers and mothers by mentioning them first, then followed by those closest, namely ulul arham and so on, saying Allah: And do good to parents, relatives, orphans and the poor. And speak kind words to people. (al-Baqarah\/2: 83) Prioritizing parents and close relatives in doing good does not mean that Islam teaches or permits nepotism. Nepotism gives priority to relatives and close relatives and close friends by sacrificing other people's rights, both in appointing certain positions and in providing certain facilities (conveniences) by setting aside other people who are also entitled to them. Nepotism is actually prohibited by religion because it is contrary to the principle of justice, because religion orders its adherents to always uphold it. Justice must be upheld against oneself, against parents, and close relatives. The Word of God in surahh an-Nisa\/4: 135 confirms the following: O you who believe! Be upholders of justice, witnesses for Allah, even against yourselves or against your parents and relatives. If he (the defendant) is rich or poor, then Allah knows better his benefits (goodness). So do not follow your passions because you want to deviate from the truth. And if you twist (words) or are reluctant to be a witness, then know that Allah is All-Aware of all that you do. (an-Nisa\/4: 135) Such is the relationship between believers and such is their level and degree in the sight of Allah. This matter should be paid attention to as well as possible so that Muslims can live peacefully and happily, because the one who determines this order is Allah, who knows everything."
		   }
	]
}
