{
	"tafseer": [
		{
			"id": 1803,
			"surah": 15,
			"ayat": 1,
			"tafsir": "This verse explains that the verses of the surah that will be explained include one of the surahhs in the perfect and glorious book, namely the Qur'an which was revealed by Allah to the Prophet Muhammad, the last prophet. It is the most complete book among the books that Allah sent down to His apostles, justifying the previous book, and explaining the way to happiness and the wrong path that the previous peoples had taken. Thus, humans can distinguish between the two paths, which one to follow and which one to avoid and shun. In the Al-Qur'an there are also verses that explain monotheism, stories, good manners, science, Allah's promises and His threats, and laws that guide human life and life in this world and in in order to achieve safety and happiness in the hereafter, as the word of Allah swt: Alif Lam Ra. (This is) a Book whose verses are neatly arranged and then explained in detail, (which was revealed) from (Allah) Who is All-Wise, All-Knowing. (Hud\/11: 1) And the word of Allah swt: Alif Lam Mim shad. (This is) the Book that was sent down to you (Muhammad); so do not be short of breath over it, so that you may warn with it (the Book) and become a lesson for those who believe. (al-A'raf\/7: 1-2)"
		   },
		   {
			"id": 1804,
			"surah": 15,
			"ayat": 2,
			"tafsir": "This verse is a warning from Allah SWT to disbelievers by explaining to them that in the hereafter when they feel the severity of the torments of hell, they will regret their actions and actions of denying God Almighty while living in this world. If they had followed the messenger's call, carried out Allah's commandments, abandoned His prohibitions, and worshiped submissively and obediently to Him, surely they would not have been punished as they experienced on that day. If they had done otherwise, Allah would have entered them into a paradise full of pleasures as experienced by the Muslims at that time. But at that time, all their regrets would be of no use. Allah swt has determined His decisions that cannot be changed anymore, unless His power wants something else. In a hadith, the moments of their regret are explained: From Abu Musa, may Allah be pleased with him, he said, \"The Messenger of Allah said, \"When the inhabitants of hell have gathered together with them, there are people whom Allah wills from the qibla experts (believers), people infidels said to the Muslims, \"Didn't you all used to be Muslims.\" The Muslims say, \"That's right.\" They said, \"It does not benefit you the religion of Islam that you professed before, so that you are gathered with us in this hell?\" The Muslims say, \"We have committed a sinful act, so we are punished for it.\" So Allah swt heard their conversation, then ordered the Muslims who were in hell to be expelled. When the remaining unbelievers saw this, they said, \"O if we were Muslims, we would also be expelled from hell, just as they were expelled.\" Abu Musa Said, \"Then the Messenger of Allah said, \"I seek refuge in Allah from the accursed devil.\" And then he recited this verse.\" (History of ath-thabrani) The word of Allah swt which is in line with this verse is: And if you (Muhammad) see when they are brought to hell, they say, \"If we were returned (to the world) we certainly would not deny the verses of our Lord , and become people of faith.\" (al-An'am\/6: 27) As mentioned in al-Maragi, Az-Zajjaj said, \"Indeed, the disbelievers, when they see the state of the punishment of hell and see the condition of the Muslims in heaven, they wish, if in the past their world is Muslim people.\" Thus Allah describes the character of humans who deny Allah. They only remember Allah when the danger and punishment befalls them, but when the danger and punishment is gone, they turn back to deny Allah, their helper and creator. Things like that also happen to disbelievers who dream of returning to live in the world to worship and they promise that if their wish is granted, they will truly believe that they will not deny again as before. If humans really want to believe, then Allah SWT's instructions are sufficient which are conveyed by His prophets and messengers, but most humans are affected by the pleasures of worldly life which are temporary in nature. They serve themselves more to the accursed satan than to serve themselves to Allah, the God who created them. There have been enough opportunities to repent that God gave them while on earth, but they ignored the opportunity. Once they are in the afterlife, that opportunity will not be given again. For them, Allah's provisions have been applied which will punish everyone who disbelieves in Him. This verse is a strong warning to Arab polytheists in particular, and disbelievers in general, especially those who prevent the spread of Allah's religion on earth. For the Prophet and his companions, this verse is good news. At the time of the revelation of this verse, the disbelievers severely hindered the implementation of the Islamic da'wah that was being carried out by the Prophet and his companions, even the polytheists of Mecca had reached the level of carrying out acts of persecution accompanied by harsh threats to the followers of the Prophet Muhammad, so that the Prophet and his companions almost despair and worry, if the task that God bears cannot be carried out properly. The revelation of this verse creates a sense of optimism. Their steadfastness and patience increase in spreading Allah's religion because they really believe that Islam will definitely develop and the most essential victory is the victory that will be obtained in the afterlife. From this verse and the hadith above, it can be understood that the reward or punishment that will be received by those who believe and those who disbelieve is appropriate and in accordance with the deeds they have done while in the world."
		   },
		   {
			"id": 1805,
			"surah": 15,
			"ayat": 3,
			"tafsir": "In the verse above, Allah swt has described to disbelievers their condition in the hereafter and when they will suffer a painful punishment. However, that image did not leave the slightest impression on their hearts, they even considered God's warning to be something that had no meaning at all. In this verse, Allah ordered the Messenger of Allah, if they still deny even though they have received warnings and lessons, to leave them in their negligence and carelessness as they have done, to enjoy and taste all the pleasures and delights of life in this world and to follow their desires. The Apostle was also ordered to let them eat food and do as they pleased until the appointed time, wishing and imagining that they would get unlimited possessions, get what they wanted, such as many offspring, beautiful palaces, and impose will on the enemy and whomever they will. The warning delivered by Allah is a severe threat to disbelievers, that their actions and actions are contrary to the teachings of Allah's religion, contrary to the morals and personality of Muslims. The destruction of Muslim character and personality is illustrated in the words of the Prophet Muhammad: From Amr bin Shuaib from the Prophet Muhammad, he said, \"The goodness of the first generation of this ummah was by asceticism and faith. Meanwhile, later ummah will be damaged by stinginess and wishful thinking.\" (Ahmad's history, ath-thabrani and al-Baihaqi) Ali bin Abi Talib said, \"That what I fear for you are two things, namely wishful thinking and following your passions. So actually longing makes you forget the Hereafter, while following your passions prevents validity of the truth.\""
		   },
		   {
			"id": 1806,
			"surah": 15,
			"ayat": 4,
			"tafsir": "In the verse above, Allah swt has described to disbelievers their condition in the hereafter and when they will suffer a painful punishment. However, that image did not leave the slightest impression on their hearts, they even considered God's warning to be something that had no meaning at all. In this verse, Allah ordered the Messenger of Allah, if they still deny even though they have received warnings and lessons, to leave them in their negligence and carelessness as they have done, to enjoy and taste all the pleasures and delights of life in this world and to follow their desires. The Apostle was also ordered to let them eat food and do as they pleased until the appointed time, wishing and imagining that they would get unlimited possessions, get what they wanted, such as many offspring, beautiful palaces, and impose will on the enemy and whomever they will. The warning delivered by Allah is a severe threat to disbelievers, that their actions and actions are contrary to the teachings of Allah's religion, contrary to the morals and personality of Muslims. The destruction of Muslim character and personality is illustrated in the words of the Prophet Muhammad: From Amr bin Shuaib from the Prophet Muhammad, he said, \"The goodness of the first generation of this ummah was by asceticism and faith. Meanwhile, later ummah will be damaged by stinginess and wishful thinking.\" (Ahmad's history, ath-thabrani and al-Baihaqi) Ali bin Abi Talib said, \"That what I fear for you are two things, namely wishful thinking and following your passions. So actually longing makes you forget the Hereafter, while following your passions prevents validity of the truth.\""
		   },
		   {
			"id": 1807,
			"surah": 15,
			"ayat": 5,
			"tafsir": "This verse explains that there is not a country that is destroyed by Allah, except when Allah has determined the time of its destruction in the Lawh Mahfudh, He has forgotten nothing to write down, nothing is too late, and it does not occur before the stipulated time. From this verse it can be understood that Allah swt will not punish a people before there is reason to impose punishment. What is meant by reason is that an apostle was sent to the people to convey Allah's religion, but they rejected the apostle or denied his teachings. This verse is a warning to the polytheists of Mecca who always prevented the Prophet and his companions from conveying their messages. This warning also applies to people who came later who took actions similar to the actions of the polytheists of Mecca. God's decision and warning must apply."
		   },
		   {
			"id": 1808,
			"surah": 15,
			"ayat": 6,
			"tafsir": "This verse describes the words and ridicule of the Meccan pagans to the Prophet Muhammad when verses of the Qur'an were conveyed to them. They said, \"O Muhammad, you who claim to be a prophet and messenger of Allah and the Qur'an has been sent down to you. In fact, your words and preaching show that you are actually a mad person or there are signs of madness in you, because Al- The Qur'an does not have the slightest meaning and meaning, is contrary to our opinion, and violates the beliefs that have been passed down from our ancestors. Is it possible for us to accept something that is not in accordance with our minds and is also not liked by our scholars and scholars.\" From the words of the disbelievers, it becomes clear their true attitude towards the Qur'an and the Prophet Muhammad. They refute the Qur'an without thinking about and reflecting on the evidence and arguments mentioned in it which explain the signs of Allah's power and greatness that are in themselves, in the livestock they raise, in the plants they grow. plant to meet their needs, on the earth where they live, on the universe, and so on. They deny and deny all of this without pondering and thinking about it first. Their attitude arises because of misguidance, stubbornness, and fanaticism towards their ancestors who have been stuck in them, as Allah says: Every time new verses are sent down to them from God, they listen to them while playing. Their hearts are in a state of heedlessness. And those who were unjust kept their conversation secret, \"(Man) this (Muhammad) is nothing but a human being (too) like you. Did you accept it (the magic) even though you witnessed it?\" (al-Anbiya'\/21: 2-3) Due to their inattentiveness and deep fanaticism, they deny the verses of the Qur'an, as Allah says: And every verse of the verses of God that reaches they (unbelievers), everything is always denied. (al-An'am\/6: 4) Their attitude thus creates arrogance and arrogance in themselves, as Allah says: And those who do not expect to meet Us (in the hereafter) say, \"Why don't the angels sent down to us or (why) do we (not) see our Lord?\" Indeed, they have been proud of themselves and have really transgressed (in committing injustice). (al-Furqan\/25: 21)"
		   },
		   {
			"id": 1809,
			"surah": 15,
			"ayat": 7,
			"tafsir": "Furthermore, the disbelievers said, \"If you, O Muhammad, really believe in the truth of what you convey and believe that you are truly a prophet and messenger of Allah, who was sent to us, surely you can ask Him to be sent with you. also an angel from the sky, who can strengthen and prove your prophethood and apostleship to us.\" From their request, their way of thinking about prophethood and apostolate was illustrated. According to them, if a prophet or apostle is sent, there must be an angel accompanying him, so that the angel can strengthen his prophethood and apostleship, making it easier for humans to accept his message, or it is sufficient for the prophet to be just an angel. According to their way of thinking, those who carry God's verses are only spiritual beings, while humans are physical beings (can be seen). Humans, even though they have high power, still cannot become prophets and apostles, because they still associate with humans, are in their midst, and still have physical needs, such as eating, drinking, dressing, wanting power, wanting to collect wealth, interested in worldly life, and so on. Therefore it is impossible for a human being to become a prophet and apostle, unless the appointment of prophethood and apostolate is strengthened or confirmed by the presence of angels as companions. The beliefs of the polytheists of Mecca are like the beliefs of Pharaoh and his followers about the apostles and prophets. According to them, all the apostles sent by God should be appointed with a ceremony full of majesty and grandeur, such as the appointment of their kings, wearing bracelets and necklaces made of gold and royal clothing, or the apostle came accompanied by angels, as explained in the word of Allah SWT: \"Then why was he (Moses) not put on a bracelet of gold or an angel came with him to escort him?\" So (Pharaoh) with those words influenced his people, so they obeyed him. Indeed, they are a wicked people. (az-Zukhruf\/43: 53-54)"
		   },
		   {
			"id": 1810,
			"surah": 15,
			"ayat": 8,
			"tafsir": "Allah replied to the ridicule and ridicule of the polytheists of Mecca with this verse, that He will not send down angels because there is no wisdom and benefit. This means that even if Allah swt sent down angels from the sky and appointed them as messengers who conveyed His religion, it would be of no use and would not be able to convince and straighten the beliefs of the polytheists. As it is known that angels are supernatural and subtle creatures so that the human eye will not be able to see them. If Allah swt willed and made the angel in human form, so that human eyes could see it, then Allah sent him as a prophet and messenger to them, the angel ate and drank like them, walked and socialized with them, then it would also appear in their minds that angels those who are given the task of being an apostle are humans too like them, not angels. That is, doubts in themselves will continue to exist. This is explained in the word of Allah SWT: And if We had made the messenger (from) an angel, We would have made him (in the form of) a male, and (thus) We would have made them remain in doubt as they are now in doubt. (al-An'am\/6: 9) From their attitudes and ways as stated in the word of God above, it is evident that their hearts have actually been closed to accept the truth. Whatever evidence is put forward to them, they still will not believe, Allah SWT said: And even though We really sent down angels to them, and people who had died spoke to them and We collected (also) before them everything (that they want), they will not also believe, unless Allah wills. But most of them do not know (the meaning of truth). (al-An'am\/6: 111) Because of their attitude like that, Allah gave them a stern warning that if an angel was sent down, it was a sign that they would be overtaken by a great calamity, and destroyed so that their history would be destroyed. end. This stipulation is in accordance with the sunatullah that has been applied to the previous ummah who have made fun of the messengers of Allah who have been sent to them. Before the punishment was meted out, an angel was sent to them, as had happened to the people of Lut, as the word of Allah swt: They (the angels) said, \"O Lut! Indeed we are the messengers of your Lord, they will not be able to disturb you, so go and your family at the end of the night and do not let anyone of you look back, except your wife. In fact, she (also) will be overwritten (torment) that befell them. In fact, when the punishment for them will be at dawn. Isn't it already dawn? near?\" (Hud\/11: 81) Mujahid in his tafsir of this verse says that Allah sent down angels only as Allah's apostles, signs of the coming of punishment, or carriers of Allah's punishment."
		   },
		   {
			"id": 1811,
			"surah": 15,
			"ayat": 9,
			"tafsir": "This verse is a strong warning to those who ignore the Qur'an and do not believe that it was sent down by Allah to His prophet Muhammad. It's as if Allah said to them, \"You, O disbelievers, are actually misguided people who make fun of the prophets and apostles that We have sent to convey the religion of Islam to you. In fact, your attitude like that will not affect one bit even against the purity and sanctity of the Qur'an because it was We who sent it down. You accuse Muhammad of being mad but We affirm that it is We ourselves who have preserved the Qur'an from all kinds of attempts to pollute it and attempts to add, subtract and change verses -the verses. We will protect it from all kinds of human interference with it. There will come a time when people will memorize, read, study, and explore its contents, so that they obtain from the Al-Qur'an guidance and wisdom, guidance on morals and manners the good, knowledge and thinking guidelines for experts and clever people, as well as instructions for the way of life in the world and in the afterlife later.\" Allah's guarantee regarding the maintenance of the Qur'an is reaffirmed in His words: They want to extinguish Allah's light (religion) with their mouths (sayings), but Allah continues to perfect His light even though the disbelievers hate it. (as-shaff\/61: 8) Regarding Allah's guarantee of the sanctity and purity of the Qur'an and the affirmation that it is Allah who maintains it, it is evident by paying attention to and studying the history of the revelation of the Al-Qur'an, the methods used by the Prophet when broadcasting , maintaining and correcting the readings of the companions, prohibiting writing other than verses from the Qur'an, and so on. Then the maintenance of the Qur'an was continued by the companions, tabiin, and by every generation of Muslims who came after, until now. In order to find out and prove that the purity of the Qur'an that has come down to us today is explained in the history of the Qur'an, both at the time of the Prophet and at the time of the Companions, and the efforts of Muslims to preserve it today. On the other hand, the authenticity of the Qur'an can be traced from the history of its writing and reading. First: Al-Qur'an was revealed gradually to the Prophet Muhammad saw in approximately 23 years. Every verse down, the Prophet told his companions to memorize and write it on stones, animal skins, and palm fronds. The Prophet had several companions who were in charge of writing revelations and accompanying him when verses were revealed. Among the authors of the revelation were Zaid bin Sickle, Ali bin Abi Talib, Uthman bin 'Affan, Ubay bin Ka'ab, and others. Each verse was revealed, the Prophet explained to the authors of the revelation in which part of the verses came down first or in what surah the verse was placed and written. He forbade the Companions to write anything other than the Qur'an, whether the explanations were the tafsirs of the verses or the statements written by the Companions themselves. The hadith of the Prophet as narrated by Abu Sa'id al-Khudri: Do not write anything from me other than the Qur'an. Whoever writes anything other than the Qur'an, let him erase it. (Muslim History) The general prohibition is to maintain the purity of the writings of the Al-Qur'an so that they do not get mixed up with other writings besides the Al-Qur'an, both originating from the Prophet and companions. However, there were some friends who were good at reading and writing, writing down the Prophet's sayings as an tafsir of the Qur'an and their notes, such as 'Abdullah bin 'Umar, 'Abdullah bin Mas'ud, Ali bin Abi Talib, Ibn Abbas, and others. Apart from being written by the revelation writers and some of the friends, the Qur'an was also memorized by the friends and they were required to recite it in prayer. Given the important role of literacy in maintaining the authenticity or purity of the Qur'an, the Prophet greatly appreciated those who could read and write, and encouraged his friends to study it. After the Battle of Badr, the Prophet used the illiterate prisoners of war at Badr to redeem himself by teaching 10 Muslim children to read and write. With this Apostle's decision, the more people who can read and write, the more people who can record and memorize the Qur'an. Thus, there are three factors that help preserve the writings and readings of the Qur'an: 1. Writings or manuscripts written by the authors of revelation. 2. Memorizing from friends who are very enthusiastic about memorizing it. 3. Personal writing or manuscripts written by friends who were already good at reading and writing such as 'Abdullah bin 'Umar, 'Abdullah bin Mas'ud, Ali bin Abi Talib, and others. In addition to the three factors above, the Archangel Gabriel always checks the readings of the Holy Quran every year. When checking, the Prophet was told to repeat the recitation of the Qur'an that had been revealed. Even before he died, the Archangel Gabriel checked twice. The Prophet himself often checked the readings of his companions. They were told to read the Koran in front of him, and he corrected their readings. The Prophet died after the Qur'an had been revealed and had been memorized by many people according to the orderly arrangement of the Qur'an that we read today, in accordance with the instructions he gave when reading the Qur'an, both inside and outside of prayer . By means of practical practice above, the purity of the Qur'an can be maintained and spread easily in society. After Rasulullah saw died, the friends agreed to choose Abu Bakr as caliph. At the beginning of his reign, many Muslims who were not yet strong in their faith became apostates and some of them claimed to be prophets. Therefore, Abu Bakr fought them. In this battle, 70 people who memorized the Qur'an had died and several people had died before that. At the suggestion of Umar bin Khaththab and accepted by Abu Bakr, Zaid bin Sickle was assigned to rewrite the Qur'an, the manuscript of which had been written at the time of the Prophet and was supported by the memorization of the companions who were still alive. After finishing writing it in sheets, tied with thread, arranged according to the order set by the Prophet, the Mushaf was then handed over to Abu Bakr. After Abu Bakr died, this manuscript was handed over to his successor Umar bin al-Khaththab. After Umar died, this mushaf was kept in the house of Hafsah, Umar's daughter and wife of the Prophet Muhammad, until the time when the Al-Qur'an was recorded during the time of the caliph Uthman bin 'Affan. At the time of the caliph Uthman bin 'Affan, Islamic government areas had reached Armenia and Azerbaijan in the east and Tripoli in the west. Thus, the companions at that time were scattered in Egypt, Syria, Iraq, Persia, and Africa. Wherever they go and where they live, Al-Qur'an Al-Karim remains their imam, many of them memorize the Al-Qur'an. They have manuscripts of the Qur'an, but the texts they have are not the same in the arrangement of the surahhs because they are recorded according to their understanding or they are still mixed with the Prophet's explanations as their tafsirs. This led to disputes about the recitation of the Qur'an among them. The origin of this difference in reading is because the Prophet himself gave leeway to the Arab tribes who were in his time, to recite and recite the Al-Qur'an according to their respective dialects. This leeway was given by the Prophet so that they could easily pronounce and memorize the Qur'an. But then there was concern that this dispute over the recitation of the Qur'an, if left unchecked, would lead to unwanted discord and division among the Muslims. The person who first showed concern about this was a friend named Huzaifah bin Yaman. He participated in the wars of conquering Armenia and Azerbaijan. During his journey, he once heard Muslims arguing over the recitation of several verses of the Qur'an and once heard a Muslim say to his friend, \"My recitation is better than yours.\" When this was conveyed to Caliph Uthman bin 'Affan, he immediately agreed to do the writing of the Qur'an, so a team was immediately formed consisting of revelation writers, such as Zaid bin Sickle who became the team leader, 'Abdullah bin Zubair, Sa'id bin 'As and' Abdurrahman bin Haris bin Hisham, and others. The manuscript containing sheets with the inscriptions of the Qur'an, which had been compiled by Caliph Abu Bakr, and kept at Hafsah's house, was requested by Uthman. Because this team was tasked with re-copying the Qur'anic writings in the mushaf and uniforming the readings and writings. The results of this team's work will become a reference and reference for the recitation of the Qur'an by Muslims around the world. In carrying out their duties, this team applies the following conditions: 1. Not to write down unless what is truly believed is the Qur'an, with reference to the writings and memorization of friends. 2. Not written except for verses that are believed to have never been written down. 3. If there is a word that has several different readings, then it is written in the Quraish dialect because the majority of the Qur'an is written in that dialect. 4. If there are two different readings but can be accommodated in one writing, write it in one writing like malik and malik. Mushafs whose readings have been uniformed are known as al-Mushaf al-Imam or al-Mushaf al-'Othmani. This manuscript was multiplied into five manuscripts, each of which was sent to Mecca, Syria, Basrah, Kufa, and one was left in Medina. Thus the Qur'an was recorded at the time of the Companions. All manuscripts published later must be adapted to al-Mushaf al-Imam. Then efforts to maintain the purity of the Qur'an are still being carried out by Muslims around the world, down to the present generation. In order to maintain the purity of the Al-Qur'an in Indonesia, various efforts have been carried out, including: 1. Forming a \"Lajnah Pentashihan Mushaf Al-Qur'an\" which has the task of, among other things, examining all mushafs that will be printed before being distributed to the public. The team is under the supervision of the Minister of Religion. 2. The government already has the Al-Qur'an manuscript which is the standard in the publication of the Al-Qur'an in Indonesia, which has been adapted to the Mushaf al-Imam. 3. Holding annual Musabaqah Tilawatil Qur'an which is handled and managed by the state. 4. Other efforts carried out by the Muslim community, such as establishing educational institutions, studies, and tahfiz of the Qur'an. Muslims in reading the Koran. However, there are also some differences in the readings. The reasons for these differences can be summed up in two ways: First: The writing of the Qur'an itself was not perfect. Second: The differences in the dialects of the Arabs. The writing of the Al-Quran can make a difference because al-Mushaf al-Imam was written by friends whose writings cannot be said to be perfect writing because they have not received punctuation and periods. As explained by Ibn Khaldun in his book \"Muqaddimah Ibn Khaldun\", he said, \"Pay attention to the consequences that occur because the mushaf writings were written by the friends themselves with their hands. The writing was not perfect, so sometimes there were some mistakes in understanding the reading of the text because it is without dots and lines.\" As for the different dialects of the Arabs, which had been tolerated by the Prophet, this gave rise to various qira'at (recitations), so that in the year 200 Hijriah, countless qira'at experts appeared. Among the well-known Arabic dialects are lahjah Quraysh, Hudzail, Tamim, Asad, Rabiah, Hawazin, and Sa'ad. At that time famous qiraat experts appeared, and there were seven famous people, namely: 'Abdullah bin Amir, Abu Ma'bad 'Abdullah bin Katsir, Abu Bakar Asim bin Abi an-Najud, Abu Amr bin A'la, Nafi ' bin Abi Nu'aim, Abul Hasan 'Ali bin Hamzah al-Kisa'i, Abu Jarah bin Habib Ibn Zayyat\/Hamza. Qiraat-qiraat people popularized by the name \"Qiraat Sab'ah\" (seventh reading). As explained above, the Al-Qur'an was originally written without dots and lines, but this did not affect the reading of the Al-Qur'an because the companions and tabiin besides memorizing the Al-Qur'an were also people who were fluent in Arabic. Therefore, they can read it properly and correctly. But after the spread of Islam and many non-Arab nations embraced Islam, it was difficult for them to read the Koran without dots and lines. It is feared that this will lead to errors in the recitation of the Qur'an. So Abul Aswad Ad-Duali took the initiative to provide punctuation marks in the Qur'an with different colored ink. The dot is the dot above for fathah, the dot below for kasrah, the dot on the upper left for dhamah, and the two dots for tanwin. This happened during the time of Ali bin Abi Talib. Then during the time of the caliphs Abdul Malik bin Marwan, Nasr bin Asim, and Yahya bin Ya'mar added signs for letters dotted with the same ink as the writings of the Qur'an to distinguish between the meaning of the dots Abul Aswad Ad- Duali with this new point. Abul Aswad point is for punctuation and Nasr bin Asim point is for letter point. This way of writing remained in effect during the Umayyad period, and at the beginning of the Abbasid empire, and was even used in Spain until the middle of the fourth century Hijra. Later it turned out that this method of marking still creates difficulties for readers of the Qur'an because there are too many dots, while the dots gradually become similar in color. So al-Khalil took the initiative to make new signs, namely the small wau above for dhammah, the lowercase alif for fathah, the lowercase yes for kasrah, the head of the letters sin for syiddah, the head ha for breadfruit and the head ' ain for hamzah. Then these signs were simplified by cutting and adding them so that they became the current form. Thus the efforts of the Prophet Muhammad and the Muslims to preserve and safeguard the Qur'an from all kinds of human interference, so that the Al-Qur'an that is in the hands of the Muslims today, is exactly the same as the Al-Qur'an which was revealed to Prophet Muhammad SAW. This is proof of Allah's guarantee that he will preserve the Qur'an forever."
		   },
		   {
			"id": 1812,
			"surah": 15,
			"ayat": 10,
			"tafsir": "With this verse, Allah swt comforted the heart of the Prophet Muhammad who was grieving and suffering from the ridicule, insults, and tyranny of the polytheists of Mecca. He felt sad for the stupidity of his people who did not want to understand the Qur'an, and even accused himself of being mad. Allah swt explained that what the Prophet Muhammad was experiencing had also been experienced by the previous apostles who were sent to the ancient peoples. Almost all of the people made fun of the apostles and some even made evil plans to kill him. They deny the apostle's call and continue to carry out the customs and beliefs inherited from their ancestors. Almost all the apostles were sent to their people alone, without friends and helpers who helped him except for helpers and helpers from followers who were obtained after a lot of preaching. In general, the apostles were poor, with no superiors or authorities to support them, and without sufficient wealth to finance their preaching, but all the apostles were trustworthy, steadfast, and patient in carrying out the tasks assigned to them. With this verse, it is as if Allah swt emphasized to the Prophet Muhammad not to despair because of the attitudes and actions of the disbelievers, because all the apostles experienced trials and challenges like that. Such an attitude of disbelievers is because their morals have been corrupted, and their passions have defeated all truth that might enter their hearts. Therefore, they cannot accept the truth of the verses of the Qur'an that are conveyed to them."
		   },
		   {
			"id": 1813,
			"surah": 15,
			"ayat": 11,
			"tafsir": "With this verse, Allah swt comforted the heart of the Prophet Muhammad who was grieving and suffering from the ridicule, insults, and tyranny of the polytheists of Mecca. He felt sad for the stupidity of his people who did not want to understand the Qur'an, and even accused himself of being mad. Allah swt explained that what the Prophet Muhammad was experiencing had also been experienced by the previous apostles who were sent to the ancient peoples. Almost all of the people made fun of the apostles and some even made evil plans to kill him. They deny the apostle's call and continue to carry out the customs and beliefs inherited from their ancestors. Almost all the apostles were sent to their people alone, without friends and helpers who helped him except for helpers and helpers from followers who were obtained after a lot of preaching. In general, the apostles were poor, with no superiors or authorities to support them, and without sufficient wealth to finance their preaching, but all the apostles were trustworthy, steadfast, and patient in carrying out the tasks assigned to them. With this verse, it is as if Allah swt emphasized to the Prophet Muhammad not to despair because of the attitudes and actions of the disbelievers, because all the apostles experienced trials and challenges like that. Such an attitude of disbelievers is because their morals have been corrupted, and their passions have defeated all truth that might enter their hearts. Therefore, they cannot accept the truth of the verses of the Qur'an that are conveyed to them."
		   },
		   {
			"id": 1814,
			"surah": 15,
			"ayat": 12,
			"tafsir": "This verse describes the response of the disbelievers to the Qur'an. They make fun of him and do not accept him. This is because the attitude of denial and ridicule has grown in their hearts, so that they no longer have a willingness to accept the truth. In their hearts, there is no longer a lamp emitting light that can guide and illuminate the path to truth. Their condition is the same as the condition of the peoples who used to receive the book of Allah conveyed by the apostles, but there is not the slightest trace of it in their hearts. Therefore, for people who have been sent messengers to them, but they deny the messenger's call, sunatullah applies, that is, Allah will destroy everyone who disobeys the messenger and the message he delivered, and helps and gives victory to those who accept his call. . At some point in the future, the disbelievers will know the truth of the news and warnings of the Qur'an, as confirmed in the word of Allah swt: And indeed, you will know (the truth) of its message (Al-Qur'an) after some time. . (shad\/38: 88) The truth of the Qur'anic messages referred to in the above verse has been implemented in the world, such as the truth of Allah's promise to believers that they will win in wars against polytheists, and some are carried out in the afterlife, such as the truth of God's promise regarding the reward and reckoning that will be carried out on humans in the last day."
		   },
		   {
			"id": 1815,
			"surah": 15,
			"ayat": 13,
			"tafsir": "This verse describes the response of the disbelievers to the Qur'an. They make fun of him and do not accept him. This is because the attitude of denial and ridicule has grown in their hearts, so that they no longer have a willingness to accept the truth. In their hearts, there is no longer a lamp emitting light that can guide and illuminate the path to truth. Their condition is the same as the condition of the peoples who used to receive the book of Allah conveyed by the apostles, but there is not the slightest trace of it in their hearts. Therefore, for people who have been sent messengers to them, but they deny the messenger's call, sunatullah applies, that is, Allah will destroy everyone who disobeys the messenger and the message he delivered, and helps and gives victory to those who accept his call. . At some point in the future, the disbelievers will know the truth of the news and warnings of the Qur'an, as confirmed in the word of Allah swt: And indeed, you will know (the truth) of its message (Al-Qur'an) after some time. . (shad\/38: 88) The truth of the Qur'anic messages referred to in the above verse has been implemented in the world, such as the truth of Allah's promise to believers that they will win in wars against polytheists, and some are carried out in the afterlife, such as the truth of God's promise regarding the reward and reckoning that will be carried out on humans in the last day."
		   },
		   {
			"id": 1816,
			"surah": 15,
			"ayat": 14,
			"tafsir": "This verse explains that the Meccan polytheists were very disbelievers and did not want to accept the truth. Their situation is like that described by Allah in this verse. If Allah opened the doors of heaven for them and provided a ladder to go up to the sky, then they would also go up. If they saw angels in the sky or a miracle which is a sign of the power and greatness of Allah, they would not admit it, they even said, \"Our eyes have been obscured so that we do not see clearly a sign that is in front of us. what we see is nothing but imagination, as a result of Muhammad's magic that has bewitched us, so that we no longer see the essence of truth.\" This verse is in line with the word of Allah SWT: And if We sent down to you (Muhammad) writing on paper, so that they could hold it with their own hands, surely those disbelievers would say, \"This is nothing but real magic.\" (al-An'am\/6: 7)"
		   },
		   {
			"id": 1817,
			"surah": 15,
			"ayat": 15,
			"tafsir": "This verse explains that the Meccan polytheists were very disbelievers and did not want to accept the truth. Their situation is like that described by Allah in this verse. If Allah opened the doors of heaven for them and provided a ladder to go up to the sky, then they would also go up. If they saw angels in the sky or a miracle which is a sign of the power and greatness of Allah, they would not admit it, they even said, \"Our eyes have been obscured so that we do not see clearly a sign that is in front of us. what we see is nothing but imagination, as a result of Muhammad's magic that has bewitched us, so that we no longer see the essence of truth.\" This verse is in line with the word of Allah SWT: And if We sent down to you (Muhammad) writing on paper, so that they could hold it with their own hands, surely those disbelievers would say, \"This is nothing but real magic.\" (al-An'am\/6: 7)"
		   },
		   {
			"id": 1818,
			"surah": 15,
			"ayat": 16,
			"tafsir": "This verse explains that Allah SWT created various celestial bodies in the form of countless planets, moons and stars, all of which adorn the sky, thus attracting the hearts of those who look at them. All of this becomes food for thought for people who want to think, especially in seeking benefits for humans and humanity, as Allah SWT says in another verse: Glory be to Allah who made in the sky clusters of stars and He also made the sun and moon that shine. And He (also) who made night and day alternate for people who want to take lessons or who want to be grateful. (al-Furqan\/25: 61-62) In another verse, Allah SWT also explains: And indeed, We have decorated the near sky with stars. (al-Mulk\/67: 5) Some of the stars created by Allah are not shining and some are shining, twinkling at night, as Allah says: Then He created seven heavens in two periods and in every heaven He reveals the affairs of each. Then the heavens are close (to the earth), We adorn them with stars, and (We create) to preserve them. Such is the provision of (Allah) the Almighty, the All-Knowing. (Fussilat\/41: 12) And the word of Allah swt: And indeed, We have decorated the near sky with stars and We have made them (the stars) as tools for throwing devils, and We have prepared for them the punishment of hell that flaming. (al-Mulk\/67: 5) The celestial bodies are a guide for travelers who walk in the middle of the desert at night, ships that sail in the middle of the ocean, as well as airplanes and spaceships that fly towards the destination. The circulation of the sun, moon and stars can also be used as a basis for knowing the number of days, the number of years and the calculation of time, as Allah says: It is He who makes the sun shine and the moon shine and it is He who determines the places of their orbits, so that you know the number of years. , and calculation (time). Allah did not create that way but correctly. He explains the signs (His greatness) to those who know. (Yunus\/10: 5) The atmosphere of the night when the sky is clear and cloudless, the stars are scattered in the sky and their light is intermittent, and the light of the full moon creates peace in the hearts of those who have faith in Allah. All of this strengthened his faith, so that without realizing it his mouth spoke words that glorified God."
		   },
		   {
			"id": 1819,
			"surah": 15,
			"ayat": 17,
			"tafsir": "This verse explains that Allah swt protects the sky and its contents from the accursed satan. In another verse, Allah swt says: And (We) have guarded it from every rebellious devil. (as-shaffat\/37: 7) Meanwhile there are demons who do not heed God's prohibitions. He was looking for news that he might hear from the angels, so such demons were chased by burning flames, so he ran and did not have time to hear the angels talk. This is explained by the word of Allah swt: They (the devils) could not hear (the talk) of the angels and they were stoned from all directions. (as-shaffat\/37: 8) And the word of Allah swt: And indeed we (jinns) have tried to know (the secrets of) the sky, so we found it full of strong guards and fiery arrows, and indeed we (jinns) used to be able to occupy several places in the sky to overhear (the news). But now whoever (tries to) eavesdrop (like that) will surely find arrows of fire lurking (to burn him). (al-Jinn\/72: 8-9) As mentioned above that there are several verses that explain the various efforts of satan to listen to the talk of the angels in the sky, but before he could hear it, he was chased and burned by hot bursts of fire. This includes things that are unseen because they are difficult to know and cannot be seen by the human eye and their essence cannot be known, as well as evidence that can be used as a basis for determining the true meaning of the verse. Because what explains this is the Qur'an and the human mind has not yet reached it, it is obligatory for Muslims to believe in it, and believe that the heavens and the earth and the universe belong to Allah, the Most Creator. Allah swt protects and manages all that belongs to Him. How He regulates and maintains, very little human knowledge about it. Likewise, how the devil peeps into the conversation of the angels and how the shape of the flames hunts down the devil. Only Allah Knows."
		   },
		   {
			"id": 1820,
			"surah": 15,
			"ayat": 18,
			"tafsir": "This verse explains that Allah swt protects the sky and its contents from the accursed satan. In another verse, Allah swt says: And (We) have guarded it from every rebellious devil. (as-shaffat\/37: 7) Meanwhile there are demons who do not heed God's prohibitions. He was looking for news that he might hear from the angels, so such demons were chased by burning flames, so he ran and did not have time to hear the angels talk. This is explained by the word of Allah swt: They (the devils) could not hear (the talk) of the angels and they were stoned from all directions. (as-shaffat\/37: 8) And the word of Allah swt: And indeed we (jinns) have tried to know (the secrets of) the sky, so we found it full of strong guards and fiery arrows, and indeed we (jinns) used to be able to occupy several places in the sky to overhear (the news). But now whoever (tries to) eavesdrop (like that) will surely find arrows of fire lurking (to burn him). (al-Jinn\/72: 8-9) As mentioned above that there are several verses that explain the various efforts of satan to listen to the talk of the angels in the sky, but before he could hear it, he was chased and burned by hot bursts of fire. This includes things that are unseen because they are difficult to know and cannot be seen by the human eye and their essence cannot be known, as well as evidence that can be used as a basis for determining the true meaning of the verse. Because what explains this is the Qur'an and the human mind has not yet reached it, it is obligatory for Muslims to believe in it, and believe that the heavens and the earth and the universe belong to Allah, the Most Creator. Allah swt protects and manages all that belongs to Him. How He regulates and maintains, very little human knowledge about it. Likewise, how the devil peeps into the conversation of the angels and how the shape of the flames hunts down the devil. Only Allah Knows."
		   },
		   {
			"id": 1821,
			"surah": 15,
			"ayat": 19,
			"tafsir": "After Allah SWT explains His signs of greatness and power in the sky, in this verse Allah explains the signs of His power that humans can see, know, feel and think about. Among other things, Allah created the earth as if it were spread out, making it easy for humans to live in, allowing them to grow crops on it, and making it easier for them to travel to all corners of the world seeking lawful sustenance and having fun. Allah created deep ravines on earth and flowed by small rivers which then united to become large rivers that led to the vast ocean. He also created mountains that soared into the sky, adorned with various kinds of green plants and vegetation, pleasing to the hearts of those who looked at them, as Allah says: And He who spread out the earth and made mountains and rivers river above it. And in him He made all the fruits in pairs; He closes the night to the day. Indeed, in that there are signs (of Allah's greatness) for people who think. (ar-Ra'd\/13: 3) Verse 19 of surahh al-Hijr implies how geological processes run for tens, hundreds and even millions of years. Based on scientific studies, basically the geological process is in the form of a cycle that does not stop. At the bottom of the ocean, such as in the Pacific Ocean for example, there is a process of continuous expansion of magmatic materials that come out of the mid-ocean ridge and form oceanic plates [see description an-Naml\/27: 88 and at-thur\/52: 6 ]. This plate continues to move and crash into other plates. Meanwhile, the process of erosion starts from high places and then the material resulting from this erosion is spread and deposited in lower places. These deposits then experience pressure due to the movement of the plates and bring the eroded rock layers to bend and lift, forming mountains. See also an-Nahl\/16: 15 related to this verse. How great is Allah who created all that can be benefited and enjoyed by humans, but most of them deny their Creator. Allah has created various plants and herbs, each of which has a certain size and degree. The durian tree, with its sturdy trunk, is in harmony with its large, thorny fruit. The stalks of rice match well with the fruit that is stalked and the soil where it grows. Likewise, other plants created by Allah are balanced, harmonious, and in accordance with the climate, regional conditions, and the needs of the humans or animals where they grow. Meanwhile, differences in area and soil where a tree grows will cause differences in the taste and size of the fruit. The element of sugar in sugar cane is different from the element of sugar in coconut water, different in sweetness from mangoes and oranges. Salak fruit when it is still a pistil is surrounded by sharp thorns, but after it is ripe, it is as if the thorns reveal themselves, making it easy for humans to take the fruit which tastes sweet. Papaya pistils taste bitter when they are small, so humans don't want to take and eat them. The bigger the pistil, the less bitter it is, and the closer humans are to it. After cooking, the fruit is picked and becomes a preferred food. Thus Allah creates something with a certain size and level, so that seeing the perfection of His creation will also increase faith in the hearts of people who want to think and also increase the belief that Allah is Most Perfect. Allah swt says: And it is He who makes the plants that have vines and those that do not have vines, date palms, plants of various tastes, olives and pomegranates that are similar (shape and color) and dissimilar (taste). Eat its fruit when it bears fruit and give its due (zakat) when it reaps the fruit, but don't overdo it. Verily, Allah does not like those who are excessive. (al-An'am\/6: 14)"
		   },
		   {
			"id": 1822,
			"surah": 15,
			"ayat": 20,
			"tafsir": "This verse explains the infinite grace of Allah SWT to humans, that is, He has created various necessities of life for humans. He has created fertile soil that can be planted with plants that are useful and are a staple for him. He created drinkable water and gave life to plants. He also created birds that fly in the sky that can be caught and made into delicious and delicious food. He created the sea in which various kinds of edible fish live and pearls and minerals needed by humans and become a source of livelihood. The vast sea is navigable by humans to all corners of the world. He is the one who creates all kinds of sources of pleasure for humans. Allah swt also created animals and other living things whose sustenance is guaranteed by Allah. Allah has also made it easy for humans to have all the necessities of life, which can be processed into clothing, food, medicine, and so on. Allah also makes children and grandchildren on earth as entertainers and successors of human life. Some humans become servants or helpers, and some others become masters or superiors. Allah also created pets and pleasures. This verse is a warning to humans that Allah guarantees sustenance for children, helpers, and livestock."
		   },
		   {
			"id": 1823,
			"surah": 15,
			"ayat": 21,
			"tafsir": "This verse explains that the source of everything in nature is God's creation. All come from the treasury or savings of God's treasury, both in the form of natural resources (SDA) and human resources (HR). Everything that is on the earth or in its stomach was created by Allah for humans. Humans are given the task by Allah to manage, benefit from, and maintain it. This is confirmed by Allah in surahh Hud\/11 verse 61: He has created you from the earth (soil) and made you prosperous, therefore ask forgiveness from Him, then repent to Him. Indeed, my Lord is very near (His mercy) and allows (the prayers of His servants). (Hud\/11: 61) To be able to take great advantage of the available natural resources (SDA), humans need to develop their human resource (HR) capabilities and skills by mastering various sciences and technologies. Then to really be able to explore natural resources need capital. With a combination or combination of natural resources, namely natural resources, human skills or skills, and sufficient capital, humans can obtain sustenance from Allah for the prosperity and welfare of their lives. This is in accordance with the sunatullah, that is, people who are given sustenance are only those who try and work hard to find it. Trying and working hard to earn sustenance from the treasures of God's treasury must also be accompanied by the responsibility to maintain (conserve) wealth and natural resources, and not damage and destroy them. Therefore, at the end of verse 61 of surahh Hud, Allah reminds people to always ask forgiveness and repent to Allah, and stop acts that damage the natural order that has been determined in sunatullah. This can be known from the understanding of science and technology. A good human according to the guidance of the Islamic religion is one who can carry out his duties well in worship and khilafah (carrying out leadership and good management of nature). He earns his sustenance by working and trying well and earnestly, not destroying and being a burden to others. The hadith of the Prophet narrated by al-hakim has provided guidance, including: From Rifaah bin Rafi that the Prophet was asked, \"Which business is the best?\" Rasulullah said, \"A person's business is done with his hands and all transactions are mabrur (clean trading does not contain elements of deception, coercion, and so on).\" (History of al-hakim) According to this hadith, good sustenance is the result of good work or effort from the person himself (not a gift from someone else), and the result of a mabrur sale and purchase. What is meant by a mabrur sale and purchase is a sale and purchase that is carried out fairly, mutually willingly between the seller and the buyer, without coercion and no lies. Allah's Word: O you who believe! Do not eat each other's wealth in a vanity (unrighteous) way, except in trading that applies on the basis of mutual consent between you. And don't kill yourself. Truly, Allah is Most Merciful to you. (an-Nisa'\/4: 29) Enjoying sustenance from one's own efforts and sweat or the result of buying and selling is an honorable way as a Muslim human being, not because of gifts and compassion from others and not because of businesses that are prohibited by religion, such as taking rights, or buying and selling by force or trickery. Allah is Most Just and Most Wise in giving sustenance to His servants. The point is to give a certain size, according to the needs, circumstances, abilities and efforts of the person. Thus, in the provision of sustenance, God's love for His servants is illustrated. Allah swt said: Say (Muhammad), \"To whom belongs what is in the heavens and on earth?\" Say, \"Belongs to Allah.\" He has fixed (the nature of) compassion on Himself. (al-An'am\/6: 12) The bestowal of Allah's gifts and favors on His servants is mentioned in the Qur'an with the words anzala (sent down), as stated in another of His words: And He sent down eight raise livestock for you (az-Zumar\/39: 6) And the word of Allah swt: .... And We created iron which has great strength and many benefits for humans.... (al-hadid\/57: 25) Something was said descends when he moves from a high place to a low place, both literally and figuratively. Therefore, from this verse it can be understood that the favors and gifts come from Allah, the Most High, the Most Rich, bestowed upon creatures lower than Him. All creatures depend for their entire life and continuation of life on the favors and gifts of Allah. Thus, it is an obligation for every creature to be grateful for the favors and gifts of Allah by serving Him."
		   },
		   {
			"id": 1824,
			"surah": 15,
			"ayat": 22,
			"tafsir": "Allah explains some of the blessings that are in His treasury, that is, He has sent winds to fertilize, develop, and reproduce plants. The meaning of the growth, development, and marriage of plants by means of the wind is: 1. Allah blows a wind that carries clouds containing rain. The longer the exhaled cloud became heavier and blacker, until it turned into a thick black cloud. Regarding the process of rain formation, the following is an explanation based on scientific studies. To explain the occurrence of rain, it must be seen in a full water cycle. All water that evaporates, whether it comes from streams, rivers or the sea, forms water vapor in the atmosphere. This vapor rises and cools as it reaches the higher atmosphere. If there is a lot of gas in the atmosphere, it will condense into gas groups called clouds. If the clouds are blown by the wind so that they gather together, and rise upwards so that they reach a higher part of the atmosphere, the water vapor will turn into ice drops. Dust, or anything that evaporates with it, will likely be trapped by moisture or ice droplets. Thus, the volume and weight of the ice formed will increase. As the clouds get colder due to the lower atmospheric temperature, the water solidifies (ice) and falls, initially as tiny ice drops, which usually melt before reaching the ground. Thus, water drops will fall to earth as rain. In some high mountains or in cold parts of the world, this ice does not melt before it reaches the ground, so it falls as snow or ice. Then from the dark clouds it rained down which wet the surface of the earth, so that the land which was previously dry became fertile. Plants and plants grow and develop and then flower, pistil, and bear fruit. Some of the fruit can only be used by humans and animals, while some others grow and develop again to continue their descent and protect their species from extinction. Some plants grow by planting their stems. With a shower of rain water, the planted stems will grow and develop. Scientifically it can be explained that raindrops contain these revitalizing ingredients commonly known as \"surface tension droplets\". These elements are obtained from the surface layer of the ocean, which is commonly called the \"micro layer\" evaporates. In the outer layer of raindrops, there is a lot of organic litter that comes from the decomposition process of micro algae and zooplankton. Some of this litter collects and absorbs elements, such as phosphorus, magnesium and potassium, which are rare in seawater. This litter also contains heavy metals such as copper, zinc, cobalt and iron. Plants on land, as well as life in the sea itself, will receive most of the mineral salts and other elements they need for life along with the arrival of rainwater. The salts that fall with rainwater are a miniature of fertilizers commonly used in agriculture (NPK elements and so on). Heavy metals in the air that are carried down by rain water will form elements that increase productivity during plant growth and fruiting. Thus, rain is a very important source of fertilizer. Experts estimate that with the fertilizer contained in raindrops alone, within 100 years, nutrient-poor soil can collect all the elements needed for the growth of trees. Forests also grow and obtain their necessities of life from all the chemicals that come from the sea. In this way, it is estimated that every year, about 150 million tons of fertilizer fall to the earth. The process of the wind blowing the clouds, so that they become rain that wets the surface of the earth, revives the dead land, is explained by the word of Allah swt: And it is He who blows the wind (as) the bearer of good news before the arrival of His mercy (rain); and We send down from the sky very clean water. (al-Furqan\/25: 48) 2. Allah swt blows a wind that blows pollen from various flowers. Then the male pollen alights on the flower pistil, so that marriage takes place which gives rise to the ovary, and the ripe fruit tastes delicious and enjoyable for humans and the seeds can grow and bear fruit also in other places. According to scientific studies, the verse above seems to give a hint about the process of the botanical phenomenon known as pollination or persarian. In open-seeded plants (gymnosperms), pollination or persarian is the event of the fall of pollen (pollen) into the ovary (microphyll) which is directly related to the ovule. Whereas in closed seed plants (Angiosperms), pollination or persarian is the event of the fall of pollen from the stamens to the stigma. Pollination is then followed by fertilization or fertilization. This is the process of marriage in the world of botany (plants). Pollination requires an intermediary or vector. Based on the intermediary or vector, the pollination process is grouped into pollination by wind, water, or animals\/insects. The sentence in the verse above which reads 'We have blown the wind to marry implies the event of pollination by means of the wind, which in scientific language is known as anemophily or anemogamy. 3. The wind blows away the dirt and dust that settles on the stems and leaves of plants, so that the plants breathe easily and grow big, and the leaves easily absorb sunlight which increases their sturdiness and fertility. This provides a lesson on how humans make artificial marriages (al-talqih al-sina'i) on various kinds of flower and fruit trees. In this way flowers can be produced with lots of fruit. Even by crossing several types of fruit, more beautiful and more colorful flowers can be produced, as well as more delicious or larger fruit. From artificial mating with plants, humans can then develop artificial mating with several livestock such as cows, goats, horses, and others. These artificial matings produce larger, more meaty animals and are more resistant to disease. This is the case if humans want to learn from Allah's instructions in the verses of the Qur'an. Another favor of Allah swt related to the water that He sends down from the sky as mentioned in this verse is: Allah sends down rain from the sky, then the water is made for humans as a drink that can quench thirst, as the word of Allah swt: Have you ever noticed water what do you drink? Did you send it down from the clouds or did We send it down? If We had willed, We would have made it salty, why are you not grateful? (al-Waqi'ah\/56: 68-70) And the word of Allah swt: And it is He who blows the wind (as) the bearer of good news before the arrival of His mercy (rain); and We send down from the sky very clean water, so that (with that water) We revive a dead (barren) land, and We give drink to some of what We have created, (in the form of) many cattle and humans. (al-Furqan\/25: 48-49) In this verse it is emphasized that Allah is the one who regulates when rain water is sent down and in which area according to His will. However, humans are tasked with regulating the use and storage of water on earth so that the rain which is a blessing does not turn into a disaster. By His will, Allah bestowed water on humans, so that they could drink, wash, irrigate rice fields and fields, and give water to livestock. This water irrigates rivers, lakes and oceans navigable by humans and is an inexhaustible source of sustenance and life. If Allah swt wills, He stores the water in the ground or in the bowels of the earth that can be dug up and pumped by humans who need it, especially during the dry season. This is explained by Allah SWT in His other words. And We sent down water from the sky with a measure; then We caused the water to settle on the earth, and surely We have power to make it disappear. (al-Mu'minun\/23: 18) And His words: Do you not see, that Allah sends down water from the sky, then arranges it into sources of water on earth, then with that water He grows various plants -various colors, then it dries up, then you see it is yellowish, then He makes it crumble. Indeed, in that there is a lesson for people who have common sense. (az-Zumar\/39: 21)"
		   },
		   {
			"id": 1825,
			"surah": 15,
			"ayat": 23,
			"tafsir": "In this verse, Allah confirms that it is He who gives life to man if He wills, and He also turns him to death if He wills. Furthermore, as explained by Ibn Jarir ath-Tabari in his commentary, if all that is alive has died, then at that time only Allah is alive, because only He alone is eternal. Then Allah resurrects humans to be weighed and counted for their deeds, as Allah says: There is no god but Him, He who gives life and causes death. (He is) your Lord and the God of your forefathers. (ad-Dukhan\/44: 8) Verse 23 ends with the expression wa nahnul-waritsun (and it is We who inherit). Al-Qasimi in his tafsir of Mahasin at-Ta'wil explains that We (also) are the inheritors, meaning that We are the ones who still exist and receive or possess everything that has been left by humans who have died. The term inheritance is also used by the Prophet in his prayer: And make him our heir. (Narrated at-Tirmidhi from Ibn Umar)"
		   },
		   {
			"id": 1826,
			"surah": 15,
			"ayat": 24,
			"tafsir": "In a history conveyed by at-Tirmizi and al-hakim from Ibn Abbas it is explained that this verse was revealed in connection with a beautiful woman who prayed following the Prophet. Therefore, some of the companions who wanted to pray following the Prophet advanced to the first row so they could not see the woman. They were worried that by seeing the woman's face, the prayer would become invalid. While some of the other friends retreated to the back in the hope of seeing the woman's face when bowing through their armpits. So this verse came down to denounce the friend's actions. Allah swt knows the intentions of the friends who advance to the first row and the intentions of the friends who retreat to the back row. This shows that some of the Prophet's companions as human beings were very kind, very careful about their prayers so they would not see beautiful women for fear that they would cancel the prayer. However, there are those who actually want to see the beautiful woman. This is reasonable and humane in nature, and has not yet reached the sinful act that violates religion. Even though this verse was revealed with the events above, it also includes Allah's knowledge of everything that is implied and etched in one's heart. Based on this sabab nuzul, Ibn 'Abbas interprets al-mustaqdimin wal-musta'khirin as the virtue of praying in the front row compared to praying in the back row. Some scholars interpret it as knowledge of humans who were created first, humans now, and humans who were created later. Another meaning of al-mustaqdimin wal-musta'khirin is that Allah knows the past and the future of mankind. There are also scholars who interpret al-mustaqdimin as people who hasten to do good, and al-musta'kirin with the opposite meaning. In this verse, Allah swt confirms that He is the Almighty who knows everything that preceded it and the events that have occurred from the biggest to the smallest. He knows what is in the present, and knows what will happen in the future, nothing that He does not know."
		   },
		   {
			"id": 1827,
			"surah": 15,
			"ayat": 25,
			"tafsir": "This verse explains that Allah swt will gather all human beings in the hereafter, both former, present and future. All of their deeds will be weighed for their deeds, none of them will not be weighed, because none of these deeds escape the knowledge of Allah. Then He rewards and recompenses people according to the deeds they have done. Allah is Wise and All-Knowing of all things."
		   },
		   {
			"id": 1828,
			"surah": 15,
			"ayat": 26,
			"tafsir": "This verse explains that after perfecting the form of His creation, Allah then breathed a spirit upon him. According to scientists, the word pest' (black mud) in this verse indicates the involvement of water molecules (H2O) in the process of forming molecules that support life processes. As is well known, 'water is a medium for the occurrence of a chemical\/biochemical reaction process to form a new molecule. The word \"formed\", implies that the biochemical reactions taking place in the aqueous medium have transformed the elements, which were originally 'only atoms' into an organic molecule, having a certain structure and shape, such as amino acids or nucleotides. In another verse, Allah swt explains the human incident: He created humans from dry earth like pottery, and He created the jinn from smokeless flames. (ar-Rahman\/55: 14-15) Scientifically, pottery is a kind of porcelain, which in a chemical reaction process can be used as a catalyst for the polymerization process to occur. The word \"dry earth like pottery\" may indicate the occurrence of a polymerization process or a chain extension reaction of molecules from amino acids to proteins or from nucleotides to polynucleotides, including Desoxyribonucleic Acid (DNA) molecules, a building block for the genetic structure of living things. And the word of Allah swt: (Remember) when your Lord said to the angels, \"Indeed I will create man from dust. Then when I have perfected the incident and I blow My spirit (creation) on him; then submit yourself by prostrating to him.\" (shad\/38: 71-72) What is meant by insan (human) in this verse, is Adam as who is the father of all mankind. Some commentators are of the opinion that the Adam referred to in this verse is not the first human being, because before that Allah SWT had created thousands of Adams. But the Prophet Adam was the first prophet who was given the task of preaching to humans to follow the right path. In the hadith of the Prophet, the process of Adam's creation is explained. The Prophet Muhammad saw said: Indeed, Allah 'Azza wa Jalla has created Adam from a fist of earth taken from all kinds of soil, then the child of Adam was born according to the level of the soil. Some of them are red, some are black, and some are in between the two colors. Some are easy, some are difficult, some are good, and some are bad. (History of Ahmad and Muslim from 'Aisyah)"
		   },
		   {
			"id": 1829,
			"surah": 15,
			"ayat": 27,
			"tafsir": "Allah swt explained that He had created the jinn from a very hot fire before creating Adam. About the nature of this fire, only Allah knows. In accordance with the hadith above that human nature varies according to the condition of the land that forms it, then this can be used as an argument that the character of the jinn is in accordance with the nature of the origin of the incident. As fire is hot, so is the character of the genie. The fire can suddenly become big, then suddenly become smaller and smaller. Likewise the jinn, like to be in a hurry, get angry quickly, like to play games and hurt humans, sometimes submit and obey Allah, but immediately disobey and disobey Allah. Humans are in accordance with the nature of the origin of events, such as being patient, likes to grow, develop, maintain and look for something good, likes to heed orders, has the nature of being submissive and obedient, although sometimes he is disobedient to Allah because he is submissive and follows his desires. In the hadith qudsi it is mentioned the origin of the occurrence of angels, jinns and humans based on the history of 'Aisyah: Allah swt said, \"I have created angels from light, and I have created jinn from flames of fire and Adam has been created as explained to you.\" (History of Ahmad and Muslim from 'Aisyah) Jin including God's creatures. As with other creatures of Allah, there are jinn who obey Allah and there are also those who are disobedient, as Allah says: And indeed among us (jinn) there are those who are pious and there are (also) the opposite. We took different paths. (al-Jinn\/72: 11) Jinn was given a burden and responsibility by Allah, as humans are given a burden and responsibility, it develops and reproduces. It's just that humans can't see it, while he can see humans. Therefore, there are jinns who are submissive to Allah, and there are also rebellious ones like the Devil. Allah swt said: And among us there are those who are Muslims and there are those who deviate from the truth. Who are Muslims, then they have chosen the straight path. (al-Jinn\/72: 14) According to Ibn 'Abbas, what is meant by jan (jinn) in this verse is the father of all jinns, just as Adam is the father of all humans. Satan is the father of all demons. Jinn also eat, drink, live and die like humans. Allah swt said: O children of Adam! Don't be deceived by Satan, just as he (Satan) brought your parents out of heaven, by undressing both of them to show their nakedness. Verily he and his followers can see you from a place where you cannot see them. Verily, We have made the devils a leader for those who do not believe. (al-A'raf\/7: 27)"
		   },
		   {
			"id": 1830,
			"surah": 15,
			"ayat": 28,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to remind his people, when Allah told the angels about His intention to create Adam. He will create man from dry soil that comes from black mud, and when He has perfected his form to the best of his ability, will breathe into it the spirit of His creation and will command angels and demons to bow down to him in homage to him. This command of Allah is carried out by the angels obediently and solemnly, except for the Devil. He was reluctant to prostrate to Adam, because he felt he was higher in rank than Adam. He was created from fire, while Adam was created from dust. Most commentators are of the opinion that the events of Adam's creation and the events of Satan's denial of God's commands as well as the obedience and sincerity of angels in carrying out those orders illustrate the character of the three types of God's creatures. Angels were created as creatures who are always submissive and obedient to God's commands, never denying them in the slightest. Therefore, angels were made by Allah as bodyguards and rulers of the earth with His permission, and were ordered to submit to Adam and his descendants. Humans are God's creatures which consist of two elements, namely physical elements and spiritual elements. The combination of these two kinds of elements causes humans to have the potential to benefit from the whole earth with the knowledge that God has bestowed upon them. There are various possibilities for him to act and work in order to meet and complete the needs he needs by exploring and taking them from the treasury of Allah swt. With self-potential and knowledge, humans can utilize water, air, minerals, plants, livestock, orbits of the planets, electricity, atomic force, and so on. Thus, the superiority of humans from angels and demons can be seen, as can be understood from God's answer to the angels when Adam was about to be created by God. Allah swt said: And (remember) when your Lord said to the angels, \"I want to make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Above has been explained the denial of Satan who does not want to follow God's command to prostrate to Adam. Also explained are the various reasons put forward by Satan in connection with his denial. Such an attitude of Satan shows his stupidity and wickedness, because: 1. He goes against the commands of his Lord, as understood from his answer. 2. He presented very weak reasons. Those excuses showed his own stupidity. 3. He did not want to follow God's commands by saying that he was better than Adam. 4. The reason put forward that he is better than Adam is his own opinion without reasons that can be accepted by reason."
		   },
		   {
			"id": 1831,
			"surah": 15,
			"ayat": 29,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to remind his people, when Allah told the angels about His intention to create Adam. He will create man from dry soil that comes from black mud, and when He has perfected his form to the best of his ability, will breathe into it the spirit of His creation and will command angels and demons to bow down to him in homage to him. This command of Allah is carried out by the angels obediently and solemnly, except for the Devil. He was reluctant to prostrate to Adam, because he felt he was higher in rank than Adam. He was created from fire, while Adam was created from dust. Most commentators are of the opinion that the events of Adam's creation and the events of Satan's denial of God's commands as well as the obedience and sincerity of angels in carrying out those orders illustrate the character of the three types of God's creatures. Angels were created as creatures who are always submissive and obedient to God's commands, never denying them in the slightest. Therefore, angels were made by Allah as bodyguards and rulers of the earth with His permission, and were ordered to submit to Adam and his descendants. Humans are God's creatures which consist of two elements, namely physical elements and spiritual elements. The combination of these two kinds of elements causes humans to have the potential to benefit from the whole earth with the knowledge that God has bestowed upon them. There are various possibilities for him to act and work in order to meet and complete the needs he needs by exploring and taking them from the treasury of Allah swt. With self-potential and knowledge, humans can utilize water, air, minerals, plants, livestock, orbits of the planets, electricity, atomic force, and so on. Thus, the superiority of humans from angels and demons can be seen, as can be understood from God's answer to the angels when Adam was about to be created by God. Allah swt said: And (remember) when your Lord said to the angels, \"I want to make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Above has been explained the denial of Satan who does not want to follow God's command to prostrate to Adam. Also explained are the various reasons put forward by Satan in connection with his denial. Such an attitude of Satan shows his stupidity and wickedness, because: 1. He goes against the commands of his Lord, as understood from his answer. 2. He presented very weak reasons. Those excuses showed his own stupidity. 3. He did not want to follow God's commands by saying that he was better than Adam. 4. The reason put forward that he is better than Adam is his own opinion without reasons that can be accepted by reason."
		   },
		   {
			"id": 1832,
			"surah": 15,
			"ayat": 30,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to remind his people, when Allah told the angels about His intention to create Adam. He will create man from dry soil that comes from black mud, and when He has perfected his form to the best of his ability, will breathe into it the spirit of His creation and will command angels and demons to bow down to him in homage to him. This command of Allah is carried out by the angels obediently and solemnly, except for the Devil. He was reluctant to prostrate to Adam, because he felt he was higher in rank than Adam. He was created from fire, while Adam was created from dust. Most commentators are of the opinion that the events of Adam's creation and the events of Satan's denial of God's commands as well as the obedience and sincerity of angels in carrying out those orders illustrate the character of the three types of God's creatures. Angels were created as creatures who are always submissive and obedient to God's commands, never denying them in the slightest. Therefore, angels were made by Allah as bodyguards and rulers of the earth with His permission, and were ordered to submit to Adam and his descendants. Humans are God's creatures which consist of two elements, namely physical elements and spiritual elements. The combination of these two kinds of elements causes humans to have the potential to benefit from the whole earth with the knowledge that God has bestowed upon them. There are various possibilities for him to act and work in order to meet and complete the needs he needs by exploring and taking them from the treasury of Allah swt. With self-potential and knowledge, humans can utilize water, air, minerals, plants, livestock, orbits of the planets, electricity, atomic force, and so on. Thus, the superiority of humans from angels and demons can be seen, as can be understood from God's answer to the angels when Adam was about to be created by God. Allah swt said: And (remember) when your Lord said to the angels, \"I want to make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Above has been explained the denial of Satan who does not want to follow God's command to prostrate to Adam. Also explained are the various reasons put forward by Satan in connection with his denial. Such an attitude of Satan shows his stupidity and wickedness, because: 1. He goes against the commands of his Lord, as understood from his answer. 2. He presented very weak reasons. Those excuses showed his own stupidity. 3. He did not want to follow God's commands by saying that he was better than Adam. 4. The reason put forward that he is better than Adam is his own opinion without reasons that can be accepted by reason."
		   },
		   {
			"id": 1833,
			"surah": 15,
			"ayat": 31,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to remind his people, when Allah told the angels about His intention to create Adam. He will create man from dry soil that comes from black mud, and when He has perfected his form to the best of his ability, will breathe into it the spirit of His creation and will command angels and demons to bow down to him in homage to him. This command of Allah is carried out by the angels obediently and solemnly, except for the Devil. He was reluctant to prostrate to Adam, because he felt he was higher in rank than Adam. He was created from fire, while Adam was created from dust. Most commentators are of the opinion that the events of Adam's creation and the events of Satan's denial of God's commands as well as the obedience and sincerity of angels in carrying out those orders illustrate the character of the three types of God's creatures. Angels were created as creatures who are always submissive and obedient to God's commands, never denying them in the slightest. Therefore, angels were made by Allah as bodyguards and rulers of the earth with His permission, and were ordered to submit to Adam and his descendants. Humans are God's creatures which consist of two elements, namely physical elements and spiritual elements. The combination of these two kinds of elements causes humans to have the potential to benefit from the whole earth with the knowledge that God has bestowed upon them. There are various possibilities for him to act and work in order to meet and complete the needs he needs by exploring and taking them from the treasury of Allah swt. With self-potential and knowledge, humans can utilize water, air, minerals, plants, livestock, orbits of the planets, electricity, atomic force, and so on. Thus, the superiority of humans from angels and demons can be seen, as can be understood from God's answer to the angels when Adam was about to be created by God. Allah swt said: And (remember) when your Lord said to the angels, \"I want to make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Above has been explained the denial of Satan who does not want to follow God's command to prostrate to Adam. Also explained are the various reasons put forward by Satan in connection with his denial. Such an attitude of Satan shows his stupidity and wickedness, because: 1. He goes against the commands of his Lord, as understood from his answer. 2. He presented very weak reasons. Those excuses showed his own stupidity. 3. He did not want to follow God's commands by saying that he was better than Adam. 4. The reason put forward that he is better than Adam is his own opinion without reasons that can be accepted by reason."
		   },
		   {
			"id": 1834,
			"surah": 15,
			"ayat": 32,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to remind his people, when Allah told the angels about His intention to create Adam. He will create man from dry soil that comes from black mud, and when He has perfected his form to the best of his ability, will breathe into it the spirit of His creation and will command angels and demons to bow down to him in homage to him. This command of Allah is carried out by the angels obediently and solemnly, except for the Devil. He was reluctant to prostrate to Adam, because he felt he was higher in rank than Adam. He was created from fire, while Adam was created from dust. Most commentators are of the opinion that the events of Adam's creation and the events of Satan's denial of God's commands as well as the obedience and sincerity of angels in carrying out those orders illustrate the character of the three types of God's creatures. Angels were created as creatures who are always submissive and obedient to God's commands, never denying them in the slightest. Therefore, angels were made by Allah as bodyguards and rulers of the earth with His permission, and were ordered to submit to Adam and his descendants. Humans are God's creatures which consist of two elements, namely physical elements and spiritual elements. The combination of these two kinds of elements causes humans to have the potential to benefit from the whole earth with the knowledge that God has bestowed upon them. There are various possibilities for him to act and work in order to meet and complete the needs he needs by exploring and taking them from the treasury of Allah swt. With self-potential and knowledge, humans can utilize water, air, minerals, plants, livestock, orbits of the planets, electricity, atomic force, and so on. Thus, the superiority of humans from angels and demons can be seen, as can be understood from God's answer to the angels when Adam was about to be created by God. Allah swt said: And (remember) when your Lord said to the angels, \"I want to make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Above has been explained the denial of Satan who does not want to follow God's command to prostrate to Adam. Also explained are the various reasons put forward by Satan in connection with his denial. Such an attitude of Satan shows his stupidity and wickedness, because: 1. He goes against the commands of his Lord, as understood from his answer. 2. He presented very weak reasons. Those excuses showed his own stupidity. 3. He did not want to follow God's commands by saying that he was better than Adam. 4. The reason put forward that he is better than Adam is his own opinion without reasons that can be accepted by reason."
		   },
		   {
			"id": 1835,
			"surah": 15,
			"ayat": 33,
			"tafsir": "In this verse, Allah swt ordered the Prophet Muhammad to remind his people, when Allah told the angels about His intention to create Adam. He will create man from dry soil that comes from black mud, and when He has perfected his form to the best of his ability, will breathe into it the spirit of His creation and will command angels and demons to bow down to him in homage to him. This command of Allah is carried out by the angels obediently and solemnly, except for the Devil. He was reluctant to prostrate to Adam, because he felt he was higher in rank than Adam. He was created from fire, while Adam was created from dust. Most commentators are of the opinion that the events of Adam's creation and the events of Satan's denial of God's commands as well as the obedience and sincerity of angels in carrying out those orders illustrate the character of the three types of God's creatures. Angels were created as creatures who are always submissive and obedient to God's commands, never denying them in the slightest. Therefore, angels were made by Allah as bodyguards and rulers of the earth with His permission, and were ordered to submit to Adam and his descendants. Humans are God's creatures which consist of two elements, namely physical elements and spiritual elements. The combination of these two kinds of elements causes humans to have the potential to benefit from the whole earth with the knowledge that God has bestowed upon them. There are various possibilities for him to act and work in order to meet and complete the needs he needs by exploring and taking them from the treasury of Allah swt. With self-potential and knowledge, humans can utilize water, air, minerals, plants, livestock, orbits of the planets, electricity, atomic force, and so on. Thus, the superiority of humans from angels and demons can be seen, as can be understood from God's answer to the angels when Adam was about to be created by God. Allah swt said: And (remember) when your Lord said to the angels, \"I want to make a caliph on earth.\" They said, \"Are you going to make someone who destroys and sheds blood there, while we glorify your praise and sanctify your name?\" He said, \"Surely I know what you do not know.\" (al-Baqarah\/2: 30) Above has been explained the denial of Satan who does not want to follow God's command to prostrate to Adam. Also explained are the various reasons put forward by Satan in connection with his denial. Such an attitude of Satan shows his stupidity and wickedness, because: 1. He goes against the commands of his Lord, as understood from his answer. 2. He presented very weak reasons. Those excuses showed his own stupidity. 3. He did not want to follow God's commands by saying that he was better than Adam. 4. The reason put forward that he is better than Adam is his own opinion without reasons that can be accepted by reason."
		   },
		   {
			"id": 1836,
			"surah": 15,
			"ayat": 34,
			"tafsir": "Allah swt replied to the denial of Satan by ordering him to get out of heaven or from the angels. As a result of this denial, Satan has fallen far from God's grace, is subject to punishment, and continues to receive His curse until the day of judgment. In another word of God, it is explained that Satan was expelled from heaven because he was arrogant and belonged to the class of despicable people. Allah swt said: (Allah) said, \"Then come down from it (heaven); because you should not be arrogant in it. Get out! Indeed, you are one of the despicable creatures.\" (al-A'raf\/7: 13) After hearing God's decision, Satan declared that he had accepted the punishment. However, he asked God to extend his life until the day when humans were raised from the graves. Satan's request was granted by God and he will live continuously until the end of time until the trumpet blows that raises people from the grave."
		   },
		   {
			"id": 1837,
			"surah": 15,
			"ayat": 35,
			"tafsir": "Allah swt replied to the denial of Satan by ordering him to get out of heaven or from the angels. As a result of this denial, Satan has fallen far from God's grace, is subject to punishment, and continues to receive His curse until the day of judgment. In another word of God, it is explained that Satan was expelled from heaven because he was arrogant and belonged to the class of despicable people. Allah swt said: (Allah) said, \"Then come down from it (heaven); because you should not be arrogant in it. Get out! Indeed, you are one of the despicable creatures.\" (al-A'raf\/7: 13) After hearing God's decision, Satan declared that he had accepted the punishment. However, he asked God to extend his life until the day when humans were raised from the graves. Satan's request was granted by God and he will live continuously until the end of time until the trumpet blows that raises people from the grave."
		   },
		   {
			"id": 1838,
			"surah": 15,
			"ayat": 36,
			"tafsir": "Allah swt replied to the denial of Satan by ordering him to get out of heaven or from the angels. As a result of this denial, Satan has fallen far from God's grace, is subject to punishment, and continues to receive His curse until the day of judgment. In another word of God, it is explained that Satan was expelled from heaven because he was arrogant and belonged to the class of despicable people. Allah swt said: (Allah) said, \"Then come down from it (heaven); because you should not be arrogant in it. Get out! Indeed, you are one of the despicable creatures.\" (al-A'raf\/7: 13) After hearing God's decision, Satan declared that he had accepted the punishment. However, he asked God to extend his life until the day when humans were raised from the graves. Satan's request was granted by God and he will live continuously until the end of time until the trumpet blows that raises people from the grave."
		   },
		   {
			"id": 1839,
			"surah": 15,
			"ayat": 37,
			"tafsir": "Allah swt replied to the denial of Satan by ordering him to get out of heaven or from the angels. As a result of this denial, Satan has fallen far from God's grace, is subject to punishment, and continues to receive His curse until the day of judgment. In another word of God, it is explained that Satan was expelled from heaven because he was arrogant and belonged to the class of despicable people. Allah swt said: (Allah) said, \"Then come down from it (heaven); because you should not be arrogant in it. Get out! Indeed, you are one of the despicable creatures.\" (al-A'raf\/7: 13) After hearing God's decision, Satan declared that he had accepted the punishment. However, he asked God to extend his life until the day when humans were raised from the graves. Satan's request was granted by God and he will live continuously until the end of time until the trumpet blows that raises people from the grave."
		   },
		   {
			"id": 1840,
			"surah": 15,
			"ayat": 38,
			"tafsir": "Allah swt replied to the denial of Satan by ordering him to get out of heaven or from the angels. As a result of this denial, Satan has fallen far from God's grace, is subject to punishment, and continues to receive His curse until the day of judgment. In another word of God, it is explained that Satan was expelled from heaven because he was arrogant and belonged to the class of despicable people. Allah swt said: (Allah) said, \"Then come down from it (heaven); because you should not be arrogant in it. Get out! Indeed, you are one of the despicable creatures.\" (al-A'raf\/7: 13) After hearing God's decision, Satan declared that he had accepted the punishment. However, he asked God to extend his life until the day when humans were raised from the graves. Satan's request was granted by God and he will live continuously until the end of time until the trumpet blows that raises people from the grave."
		   },
		   {
			"id": 1841,
			"surah": 15,
			"ayat": 39,
			"tafsir": "Because Allah has cursed and cursed him by keeping him away from His favors and making him astray and despicable, the Devil begs Allah to give him the opportunity to mislead Adam's children and grandchildren by making evil deeds good in his eyes. Thus, it will attract their hearts so that they unknowingly commit those evil deeds. But that does not apply to sincere and pious servants, who cannot be turned away from the truth. According to some commentators, after being cursed, Iblees did not ask Allah for forgiveness, but instead vowed to deceive and deceive Adam's children and grandchildren until the Day of Judgment, except for pious and sincere servants. They cannot be deceived and deceived because of the strength of their faith, based on the word of Allah SWT: (Satan) replied, \"For the sake of Your glory, surely I will lead them all astray, except for Your servants who are chosen among them.\" (shad\/38: 82-83) This oath was actually carried out and manifested by the Devil with all the capabilities that were in him, as the word of Allah swt: (Iblis) replied, \"Because You have led me astray, surely I will always block them from the way You are straight, then surely I will come to them from in front, from behind, from their right and from their left. And You will not find most of them grateful.\" (al-A'raf\/7: 16-17) Allah swt states that the Devil can fulfill the target of his oath by misleading the majority of people. Allah says: And indeed, Satan has been able to convince them of the truth of his suspicions, then they follow him, except for some of the believers. (Saba\/34: 20) Those who follow Satan and Satan make him their leader, as Allah says: O son of Adam! Don't be deceived by Satan, just as he (Satan) brought your parents out of heaven, by undressing both of them to show their nakedness. Verily he and his followers can see you from a place where you cannot see them. Verily, We have made the devils a leader for those who do not believe. (al-A'raf\/7: 27)"
		   },
		   {
			"id": 1842,
			"surah": 15,
			"ayat": 40,
			"tafsir": "Because Allah has cursed and cursed him by keeping him away from His favors and making him astray and despicable, the Devil begs Allah to give him the opportunity to mislead Adam's children and grandchildren by making evil deeds good in his eyes. Thus, it will attract their hearts so that they unknowingly commit those evil deeds. But that does not apply to sincere and pious servants, who cannot be turned away from the truth. According to some commentators, after being cursed, Iblees did not ask Allah for forgiveness, but instead vowed to deceive and deceive Adam's children and grandchildren until the Day of Judgment, except for pious and sincere servants. They cannot be deceived and deceived because of the strength of their faith, based on the word of Allah SWT: (Satan) replied, \"For the sake of Your glory, surely I will lead them all astray, except for Your servants who are chosen among them.\" (shad\/38: 82-83) This oath was actually carried out and manifested by the Devil with all the capabilities that were in him, as the word of Allah swt: (Iblis) replied, \"Because You have led me astray, surely I will always block them from the way You are straight, then surely I will come to them from in front, from behind, from their right and from their left. And You will not find most of them grateful.\" (al-A'raf\/7: 16-17) Allah swt states that the Devil can fulfill the target of his oath by misleading the majority of people. Allah says: And indeed, Satan has been able to convince them of the truth of his suspicions, then they follow him, except for some of the believers. (Saba\/34: 20) Those who follow Satan and Satan make him their leader, as Allah says: O son of Adam! Don't be deceived by Satan, just as he (Satan) brought your parents out of heaven, by undressing both of them to show their nakedness. Verily he and his followers can see you from a place where you cannot see them. Verily, We have made the devils a leader for those who do not believe. (al-A'raf\/7: 27)"
		   },
		   {
			"id": 1843,
			"surah": 15,
			"ayat": 41,
			"tafsir": "Allah swt criticized the Devil with this verse that what the Devil stated was not all true because he could not deceive His pious servants. This is what Allah says is the straight path. He rewards all the good deeds of a servant and repays with punishment all the bad deeds of a person. In order to remove any doubts that may be understood in the previous verses, Allah SWT confirms in this verse, that none of Allah's servants who sincerely believe can be controlled by Satan. All of them have been given taufik to believe, carry out Allah's commands, and stop all of His prohibitions. No temptation will affect their faith. This is confirmed by Allah in His other words: And Satan said when the matter (recount) had been settled, \"Verily Allah has promised you a true promise, and I have promised you but I violated it. I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, and you cannot help me. Verily, I do not justify what you did associating me (with Allah) long ago. \" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) Word of Allah swt: Truly, the devil will not affect those who believe and put their trust in God. His influence is only on those who make him a leader and on people who associate him with Allah. (an-Nahl\/16: 99-100) Then Allah swt threatens Satan and his followers with hell as revenge for all kinds of crimes they have ever done. Allah swt explains the state of hell that will be inhabited by people who go astray, which consists of seven levels. Each level is inhabited by people whose sins and punishments correspond to the degree of crime they have committed. According to Ibn Juraij, hell is seven levels, the first is Jahannam; the two Ladhas; third Huthamah; fourth: Sair; the fifth Saqar; the six Jahims; and the seventh Hawiyah. Each level is occupied according to the degree of their sins. From these verses it can be understood that humans have two kinds of prominent characteristics, namely first, having a nature that likes to follow lust and is influenced by worldly life with all kinds of life's pleasures that fascinate him. They are polytheists who are easily influenced by Satan. Second, humans who have the nature of believing in Allah and the Messenger, have a clean and noble soul, have a very close relationship with Allah, and like goodness. This group cannot be influenced by Satan because their hearts are inclined towards Allah SWT."
		   },
		   {
			"id": 1844,
			"surah": 15,
			"ayat": 42,
			"tafsir": "Allah swt criticized the Devil with this verse that what the Devil stated was not all true because he could not deceive His pious servants. This is what Allah says is the straight path. He rewards all the good deeds of a servant and repays with punishment all the bad deeds of a person. In order to remove any doubts that may be understood in the previous verses, Allah SWT confirms in this verse, that none of Allah's servants who sincerely believe can be controlled by Satan. All of them have been given taufik to believe, carry out Allah's commands, and stop all of His prohibitions. No temptation will affect their faith. This is confirmed by Allah in His other words: And Satan said when the matter (recount) had been settled, \"Verily Allah has promised you a true promise, and I have promised you but I violated it. I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, and you cannot help me. Verily, I do not justify what you did associating me (with Allah) long ago. \" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) Word of Allah swt: Truly, the devil will not affect those who believe and put their trust in God. His influence is only on those who make him a leader and on people who associate him with Allah. (an-Nahl\/16: 99-100) Then Allah swt threatens Satan and his followers with hell as revenge for all kinds of crimes they have ever done. Allah swt explains the state of hell that will be inhabited by people who go astray, which consists of seven levels. Each level is inhabited by people whose sins and punishments correspond to the degree of crime they have committed. According to Ibn Juraij, hell is seven levels, the first is Jahannam; the two Ladhas; third Huthamah; fourth: Sair; the fifth Saqar; the six Jahims; and the seventh Hawiyah. Each level is occupied according to the degree of their sins. From these verses it can be understood that humans have two kinds of prominent characteristics, namely first, having a nature that likes to follow lust and is influenced by worldly life with all kinds of life's pleasures that fascinate him. They are polytheists who are easily influenced by Satan. Second, humans who have the nature of believing in Allah and the Messenger, have a clean and noble soul, have a very close relationship with Allah, and like goodness. This group cannot be influenced by Satan because their hearts are inclined towards Allah SWT."
		   },
		   {
			"id": 1845,
			"surah": 15,
			"ayat": 43,
			"tafsir": "Allah swt criticized the Devil with this verse that what the Devil stated was not all true because he could not deceive His pious servants. This is what Allah says is the straight path. He rewards all the good deeds of a servant and repays with punishment all the bad deeds of a person. In order to remove any doubts that may be understood in the previous verses, Allah SWT confirms in this verse, that none of Allah's servants who sincerely believe can be controlled by Satan. All of them have been given taufik to believe, carry out Allah's commands, and stop all of His prohibitions. No temptation will affect their faith. This is confirmed by Allah in His other words: And Satan said when the matter (recount) had been settled, \"Verily Allah has promised you a true promise, and I have promised you but I violated it. I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, and you cannot help me. Verily, I do not justify what you did associating me (with Allah) long ago. \" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) Word of Allah swt: Truly, the devil will not affect those who believe and put their trust in God. His influence is only on those who make him a leader and on people who associate him with Allah. (an-Nahl\/16: 99-100) Then Allah swt threatens Satan and his followers with hell as revenge for all kinds of crimes they have ever done. Allah swt explains the state of hell that will be inhabited by people who go astray, which consists of seven levels. Each level is inhabited by people whose sins and punishments correspond to the degree of crime they have committed. According to Ibn Juraij, hell is seven levels, the first is Jahannam; the two Ladhas; third Huthamah; fourth: Sair; the fifth Saqar; the six Jahims; and the seventh Hawiyah. Each level is occupied according to the degree of their sins. From these verses it can be understood that humans have two kinds of prominent characteristics, namely first, having a nature that likes to follow lust and is influenced by worldly life with all kinds of life's pleasures that fascinate him. They are polytheists who are easily influenced by Satan. Second, humans who have the nature of believing in Allah and the Messenger, have a clean and noble soul, have a very close relationship with Allah, and like goodness. This group cannot be influenced by Satan because their hearts are inclined towards Allah SWT."
		   },
		   {
			"id": 1846,
			"surah": 15,
			"ayat": 44,
			"tafsir": "Allah swt criticized the Devil with this verse that what the Devil stated was not all true because he could not deceive His pious servants. This is what Allah says is the straight path. He rewards all the good deeds of a servant and repays with punishment all the bad deeds of a person. In order to remove any doubts that may be understood in the previous verses, Allah SWT confirms in this verse, that none of Allah's servants who sincerely believe can be controlled by Satan. All of them have been given taufik to believe, carry out Allah's commands, and stop all of His prohibitions. No temptation will affect their faith. This is confirmed by Allah in His other words: And Satan said when the matter (recount) had been settled, \"Verily Allah has promised you a true promise, and I have promised you but I violated it. I have no power over you, except (merely) I call upon you and you obey my call, therefore do not revile me, but blame yourselves. I cannot help you, and you cannot help me. Verily, I do not justify what you did associating me (with Allah) long ago. \" Indeed, the unjust will be subject to a painful punishment. (Ibrahim\/14: 22) Word of Allah swt: Truly, the devil will not affect those who believe and put their trust in God. His influence is only on those who make him a leader and on people who associate him with Allah. (an-Nahl\/16: 99-100) Then Allah swt threatens Satan and his followers with hell as revenge for all kinds of crimes they have ever done. Allah swt explains the state of hell that will be inhabited by people who go astray, which consists of seven levels. Each level is inhabited by people whose sins and punishments correspond to the degree of crime they have committed. According to Ibn Juraij, hell is seven levels, the first is Jahannam; the two Ladhas; third Huthamah; fourth: Sair; the fifth Saqar; the six Jahims; and the seventh Hawiyah. Each level is occupied according to the degree of their sins. From these verses it can be understood that humans have two kinds of prominent characteristics, namely first, having a nature that likes to follow lust and is influenced by worldly life with all kinds of life's pleasures that fascinate him. They are polytheists who are easily influenced by Satan. Second, humans who have the nature of believing in Allah and the Messenger, have a clean and noble soul, have a very close relationship with Allah, and like goodness. This group cannot be influenced by Satan because their hearts are inclined towards Allah SWT."
		   },
		   {
			"id": 1847,
			"surah": 15,
			"ayat": 45,
			"tafsir": "This verse explains that those who are pious will be placed in paradise with gardens that have several flowing springs. In another word of Allah SWT, it is also explained the nature of heaven which is promised to those who are pious, as Allah says: The parable of the garden of paradise which is promised to those who are pious; there are rivers whose water is not brackish, and rivers of milk whose taste does not change, and rivers of khamar (non-intoxicating wine) delicious to the drinker and rivers of pure honey. In it they find all kinds of fruits and forgiveness from their Lord. Are they the same as those who are eternally in hell, and are given a drink of boiling water so that their intestines are cut into pieces? (Muhammad\/47: 15) What is meant by pious people are people who protect themselves from Allah's punishment by carrying out Allah's commands and staying away from His prohibitions."
		   },
		   {
			"id": 1848,
			"surah": 15,
			"ayat": 46,
			"tafsir": "This verse explains that pious people are welcome to enter heaven. There they will be safe, prosperous, safe and secure, and have no fear of being sad or upset. There is nothing that disturbs the peace of their feelings, and no disaster will trouble them, even Allah will send down unfailing blessings."
		   },
		   {
			"id": 1849,
			"surah": 15,
			"ayat": 47,
			"tafsir": "Allah promises to uproot from the hearts of the inhabitants of heaven all kinds of grudges, hatred and envy that have been pent up while they lived on earth, and make them brothers and sisters and have compassion. They were always happy together and sat face to face on the spread rugs. Narrated by al-Qasim and Abu Umamah, he said, \"Originally the people of heaven when they enter heaven still carry what has been stored in their hearts while living in the world, such as envy and revenge, until they sit face to face with their friends on couches in heaven God then revoked everything that was stored in their hearts.\" Then Abu Umamah recited this verse. The condition of the inhabitants of heaven is also explained in the word of Allah SWT: They are on couches studded with gold and jewels, they lean on them face to face. They were surrounded by young people who were still young, with glasses, kettles and shot glasses (goblets) filled with running water, they were not bothered by it nor drunk, and whatever fruit they chose, and whatever bird they want. And there are angels who have beautiful eyes, like well-kept pearls. (al-Waqi'ah\/56: 15-23)"
		   },
		   {
			"id": 1850,
			"surah": 15,
			"ayat": 48,
			"tafsir": "Residents of heaven never feel tired and tired, because they are no longer burdened by various efforts to complete the basic needs they need. Everything they want is available, they just need to take advantage of it. They never worry about being transferred to a place they don't like because they are eternal in heaven. They will continue to feel the enjoyment and pleasure that is already available. In another verse Allah SWT describes the conditions in heaven: Who by His grace places us in an eternal place (heaven); in it we neither feel tired nor lethargic.\" (Fathir\/35: 35) The Hadith of the Prophet describes the state of heaven: The Messenger of Allah said, \"Verily Allah commands me to give good news to Khadijah in the form of a house (which she will live in) in heaven made of bamboo, there is no difficulty in it, and there is no fatigue.\" (History of a-Bukhari and Muslim from 'Abdullah bin Aufa) From the information above, the condition of the believers in heaven can be described as follows : believers are in a state of honor, clean from various diseases of the heart such as envy, jealousy, anger, disappointment, and the like, never feel tired, sick, and hungry, always in a state of joy and joy, silaturrahim each other, and friends with other residents of heaven, and they are eternal in heaven so there is no need to worry about being moved to a place they don't like. Narrated by ath-thabrani from Abdu llah bin Zubair that the Messenger of Allah rebuked the companions who laughed when he passed in front of them. He said, \"What makes you laugh?\" So this verse was revealed as a warning to the Prophet to let them laugh because Allah is Forgiving and His punishment is very painful. It was also narrated by Abu Hatim from Ali bin Abi Husain that this verse was revealed in connection with Abu Bakr and Umar bin al-Khaththab, both of whom Allah had revoked the envy of from their hearts. When people ask, \"What malice?\" Ali bin Abi Husain replied, \"The envy of the ignorant, namely the enmity between the Bani Tamim (Ababu Bakr tribe) and the Umayyads.\" When Abu Bakr was suffering from lumbago, Ali heated his hands and with his hands he heated Abu Bakr's waist, then this verse was revealed. In this verse, Allah swt explains His promises and threats to His servants. Allah ordered the Prophet Muhammad to convey to His servants that He is willing to erase all sins, if someone has repented in the truest sense and returns to the path that pleases Him. Allah will not punish His servants who repent. Allah also ordered the Prophet Muhammad to convey to His servants that His punishment will befall those who are disobedient and commit immorality and do not want to repent or return to His ways. His punishment is very painful, and has no equal in this world."
		   },
		   {
			"id": 1851,
			"surah": 15,
			"ayat": 49,
			"tafsir": "Residents of heaven never feel tired and tired, because they are no longer burdened by various efforts to complete the basic needs they need. Everything they want is available, they just need to take advantage of it. They never worry about being transferred to a place they don't like because they are eternal in heaven. They will continue to feel the enjoyment and pleasure that is already available. In another verse Allah SWT describes the conditions in heaven: Who by His grace places us in an eternal place (heaven); in it we neither feel tired nor lethargic.\" (Fathir\/35: 35) The Hadith of the Prophet describes the state of heaven: The Messenger of Allah said, \"Verily Allah commands me to give good news to Khadijah in the form of a house (which she will live in) in heaven made of bamboo, there is no difficulty in it, and there is no fatigue.\" (History of a-Bukhari and Muslim from 'Abdullah bin Aufa) From the information above, the condition of the believers in heaven can be described as follows : believers are in a state of honor, clean from various diseases of the heart such as envy, jealousy, anger, disappointment, and the like, never feel tired, sick, and hungry, always in a state of joy and joy, silaturrahim each other, and friends with other residents of heaven, and they are eternal in heaven so there is no need to worry about being moved to a place they don't like. Narrated by ath-thabrani from Abdu llah bin Zubair that the Messenger of Allah rebuked the companions who laughed when he passed in front of them. He said, \"What makes you laugh?\" So this verse was revealed as a warning to the Prophet to let them laugh because Allah is Forgiving and His punishment is very painful. It was also narrated by Abu Hatim from Ali bin Abi Husain that this verse was revealed in connection with Abu Bakr and Umar bin al-Khaththab, both of whom Allah had revoked the envy of from their hearts. When people ask, \"What malice?\" Ali bin Abi Husain replied, \"The envy of the ignorant, namely the enmity between the Bani Tamim (Ababu Bakr tribe) and the Umayyads.\" When Abu Bakr was suffering from lumbago, Ali heated his hands and with his hands he heated Abu Bakr's waist, then this verse was revealed. In this verse, Allah swt explains His promises and threats to His servants. Allah ordered the Prophet Muhammad to convey to His servants that He is willing to erase all sins, if someone has repented in the truest sense and returns to the path that pleases Him. Allah will not punish His servants who repent. Allah also ordered the Prophet Muhammad to convey to His servants that His punishment will befall those who are disobedient and commit immorality and do not want to repent or return to His ways. His punishment is very painful, and has no equal in this world."
		   },
		   {
			"id": 1852,
			"surah": 15,
			"ayat": 50,
			"tafsir": "Residents of heaven never feel tired and tired, because they are no longer burdened by various efforts to complete the basic needs they need. Everything they want is available, they just need to take advantage of it. They never worry about being transferred to a place they don't like because they are eternal in heaven. They will continue to feel the enjoyment and pleasure that is already available. In another verse Allah SWT describes the conditions in heaven: Who by His grace places us in an eternal place (heaven); in it we neither feel tired nor lethargic.\" (Fathir\/35: 35) The Hadith of the Prophet describes the state of heaven: The Messenger of Allah said, \"Verily Allah commands me to give good news to Khadijah in the form of a house (which she will live in) in heaven made of bamboo, there is no difficulty in it, and there is no fatigue.\" (History of a-Bukhari and Muslim from 'Abdullah bin Aufa) From the information above, the condition of the believers in heaven can be described as follows : believers are in a state of honor, clean from various diseases of the heart such as envy, jealousy, anger, disappointment, and the like, never feel tired, sick, and hungry, always in a state of joy and joy, silaturrahim each other, and friends with other residents of heaven, and they are eternal in heaven so there is no need to worry about being moved to a place they don't like. Narrated by ath-thabrani from Abdu llah bin Zubair that the Messenger of Allah rebuked the companions who laughed when he passed in front of them. He said, \"What makes you laugh?\" So this verse was revealed as a warning to the Prophet to let them laugh because Allah is Forgiving and His punishment is very painful. It was also narrated by Abu Hatim from Ali bin Abi Husain that this verse was revealed in connection with Abu Bakr and Umar bin al-Khaththab, both of whom Allah had revoked the envy of from their hearts. When people ask, \"What malice?\" Ali bin Abi Husain replied, \"The envy of the ignorant, namely the enmity between the Bani Tamim (Ababu Bakr tribe) and the Umayyads.\" When Abu Bakr was suffering from lumbago, Ali heated his hands and with his hands he heated Abu Bakr's waist, then this verse was revealed. In this verse, Allah swt explains His promises and threats to His servants. Allah ordered the Prophet Muhammad to convey to His servants that He is willing to erase all sins, if someone has repented in the truest sense and returns to the path that pleases Him. Allah will not punish His servants who repent. Allah also ordered the Prophet Muhammad to convey to His servants that His punishment will befall those who are disobedient and commit immorality and do not want to repent or return to His ways. His punishment is very painful, and has no equal in this world."
		   },
		   {
			"id": 1853,
			"surah": 15,
			"ayat": 51,
			"tafsir": "This verse describes the condition of the Prophet Abraham when an unknown and uninvited guest arrived. The guests entered and greeted. Not knowing his guests, Prophet Ibrahim said that he was afraid of them. The cause of Ibrahim's fear is explained in another verse. Allah swt said: So when he saw that their hands did not touch him, he (Ibrahim) suspected them, and was afraid of them. They (angels) said, \"Don't be afraid, indeed we were sent to the people of Lut.\" (Hud\/11: 70) According to this verse, Abraham was afraid of his guests because they did not want to eat the calf that was roasted and served to them. According to custom, a guest who does not want to eat the treat served to him is a guest who has come for evil intentions or it could also mean that the guest is suspicious of the good intentions of the host."
		   },
		   {
			"id": 1854,
			"surah": 15,
			"ayat": 52,
			"tafsir": "This verse describes the condition of the Prophet Abraham when an unknown and uninvited guest arrived. The guests entered and greeted. Not knowing his guests, Prophet Ibrahim said that he was afraid of them. The cause of Ibrahim's fear is explained in another verse. Allah swt said: So when he saw that their hands did not touch him, he (Ibrahim) suspected them, and was afraid of them. They (angels) said, \"Don't be afraid, indeed we were sent to the people of Lut.\" (Hud\/11: 70) According to this verse, Abraham was afraid of his guests because they did not want to eat the calf that was roasted and served to them. According to custom, a guest who does not want to eat the treat served to him is a guest who has come for evil intentions or it could also mean that the guest is suspicious of the good intentions of the host."
		   },
		   {
			"id": 1855,
			"surah": 15,
			"ayat": 53,
			"tafsir": "Seeing that Ibrahim was afraid, the guests told him not to be afraid because the purpose of their arrival was to convey the good news from Allah, that he would be blessed with a pious son. In another word of God it is stated that the child who will be conferred will have an important position in the future. Allah said: And We gave him good tidings with (the birth of) Isaac a prophet who was among the pious. (as-shaffat\/37: 112) Ibrahim was astonished at the good news that the angels had delivered. He almost did not believe it, especially since the news was delivered by someone he did not know and at that time Ibrahim and his wife Sarah were already old. According to custom, people who are old are no longer possible to have children. Of course he found the news strange, especially since his wife was also barren. Ibrahim's guests emphasized that the news they conveyed was true news, because the desired birth of a son was one of God's blessings given to His servants. Allah has the power to bestow these blessings upon whomever He wills. He also has the power to hold or create something that deviates from His own sunnah. After hearing the description of the angels, Ibrahim was convinced that this strange guest was not just any guest. They were God's angels sent to him to bring good news. It was because of that belief that Ibrahim immediately answered their words that no one despairs of the mercy of his Lord except those who go astray. In the hadith of the Prophet, it is explained how many and extensive the blessings of Allah: Rasulullah saw said, \"Indeed, Allah has created mercy, when He created a hundred graces, then He withheld ninety-nine graces, and released one mercy to all His creatures. If the disbelievers know all the blessings that are with Allah, they will not despair of these blessings, and if the believers know all the punishments that are with Allah, they will not feel safe from the fires of hell.\" (History of al-Bukhari and Muslim from Abu Hurairah) In this case, Ibrahim as a prophet and messenger of Allah must have known how much mercy there is on Allah's side. Therefore, he was sure of the truth conveyed by the angels."
		   },
		   {
			"id": 1856,
			"surah": 15,
			"ayat": 54,
			"tafsir": "Seeing that Ibrahim was afraid, the guests told him not to be afraid because the purpose of their arrival was to convey the good news from Allah, that he would be blessed with a pious son. In another word of God it is stated that the child who will be conferred will have an important position in the future. Allah said: And We gave him good tidings with (the birth of) Isaac a prophet who was among the pious. (as-shaffat\/37: 112) Ibrahim was astonished at the good news that the angels had delivered. He almost did not believe it, especially since the news was delivered by someone he did not know and at that time Ibrahim and his wife Sarah were already old. According to custom, people who are old are no longer possible to have children. Of course he found the news strange, especially since his wife was also barren. Ibrahim's guests emphasized that the news they conveyed was true news, because the desired birth of a son was one of God's blessings given to His servants. Allah has the power to bestow these blessings upon whomever He wills. He also has the power to hold or create something that deviates from His own sunnah. After hearing the description of the angels, Ibrahim was convinced that this strange guest was not just any guest. They were God's angels sent to him to bring good news. It was because of that belief that Ibrahim immediately answered their words that no one despairs of the mercy of his Lord except those who go astray. In the hadith of the Prophet, it is explained how many and extensive the blessings of Allah: Rasulullah saw said, \"Indeed, Allah has created mercy, when He created a hundred graces, then He withheld ninety-nine graces, and released one mercy to all His creatures. If the disbelievers know all the blessings that are with Allah, they will not despair of these blessings, and if the believers know all the punishments that are with Allah, they will not feel safe from the fires of hell.\" (History of al-Bukhari and Muslim from Abu Hurairah) In this case, Ibrahim as a prophet and messenger of Allah must have known how much mercy there is on Allah's side. Therefore, he was sure of the truth conveyed by the angels."
		   },
		   {
			"id": 1857,
			"surah": 15,
			"ayat": 55,
			"tafsir": "Seeing that Ibrahim was afraid, the guests told him not to be afraid because the purpose of their arrival was to convey the good news from Allah, that he would be blessed with a pious son. In another word of God it is stated that the child who will be conferred will have an important position in the future. Allah said: And We gave him good tidings with (the birth of) Isaac a prophet who was among the pious. (as-shaffat\/37: 112) Ibrahim was astonished at the good news that the angels had delivered. He almost did not believe it, especially since the news was delivered by someone he did not know and at that time Ibrahim and his wife Sarah were already old. According to custom, people who are old are no longer possible to have children. Of course he found the news strange, especially since his wife was also barren. Ibrahim's guests emphasized that the news they conveyed was true news, because the desired birth of a son was one of God's blessings given to His servants. Allah has the power to bestow these blessings upon whomever He wills. He also has the power to hold or create something that deviates from His own sunnah. After hearing the description of the angels, Ibrahim was convinced that this strange guest was not just any guest. They were God's angels sent to him to bring good news. It was because of that belief that Ibrahim immediately answered their words that no one despairs of the mercy of his Lord except those who go astray. In the hadith of the Prophet, it is explained how many and extensive the blessings of Allah: Rasulullah saw said, \"Indeed, Allah has created mercy, when He created a hundred graces, then He withheld ninety-nine graces, and released one mercy to all His creatures. If the disbelievers know all the blessings that are with Allah, they will not despair of these blessings, and if the believers know all the punishments that are with Allah, they will not feel safe from the fires of hell.\" (History of al-Bukhari and Muslim from Abu Hurairah) In this case, Ibrahim as a prophet and messenger of Allah must have known how much mercy there is on Allah's side. Therefore, he was sure of the truth conveyed by the angels."
		   },
		   {
			"id": 1858,
			"surah": 15,
			"ayat": 56,
			"tafsir": "Seeing that Ibrahim was afraid, the guests told him not to be afraid because the purpose of their arrival was to convey the good news from Allah, that he would be blessed with a pious son. In another word of God it is stated that the child who will be conferred will have an important position in the future. Allah said: And We gave him good tidings with (the birth of) Isaac a prophet who was among the pious. (as-shaffat\/37: 112) Ibrahim was astonished at the good news that the angels had delivered. He almost did not believe it, especially since the news was delivered by someone he did not know and at that time Ibrahim and his wife Sarah were already old. According to custom, people who are old are no longer possible to have children. Of course he found the news strange, especially since his wife was also barren. Ibrahim's guests emphasized that the news they conveyed was true news, because the desired birth of a son was one of God's blessings given to His servants. Allah has the power to bestow these blessings upon whomever He wills. He also has the power to hold or create something that deviates from His own sunnah. After hearing the description of the angels, Ibrahim was convinced that this strange guest was not just any guest. They were God's angels sent to him to bring good news. It was because of that belief that Ibrahim immediately answered their words that no one despairs of the mercy of his Lord except those who go astray. In the hadith of the Prophet, it is explained how many and extensive the blessings of Allah: Rasulullah saw said, \"Indeed, Allah has created mercy, when He created a hundred graces, then He withheld ninety-nine graces, and released one mercy to all His creatures. If the disbelievers know all the blessings that are with Allah, they will not despair of these blessings, and if the believers know all the punishments that are with Allah, they will not feel safe from the fires of hell.\" (History of al-Bukhari and Muslim from Abu Hurairah) In this case, Ibrahim as a prophet and messenger of Allah must have known how much mercy there is on Allah's side. Therefore, he was sure of the truth conveyed by the angels."
		   },
		   {
			"id": 1859,
			"surah": 15,
			"ayat": 57,
			"tafsir": "After Ibrahim was sure that his guests were angels, a question arose in his mind why several angels came, when usually only one came. If several angels come, of course the task they carry is very large. He then asked the angels about the task Allah had given them. The angel replied that they were assigned to punish the people who sinned, namely the people of Lut who had disobeyed God and had denied the call of the apostle sent to them."
		   },
		   {
			"id": 1860,
			"surah": 15,
			"ayat": 58,
			"tafsir": "After Ibrahim was sure that his guests were angels, a question arose in his mind why several angels came, when usually only one came. If several angels come, of course the task they carry is very large. He then asked the angels about the task Allah had given them. The angel replied that they were assigned to punish the people who sinned, namely the people of Lut who had disobeyed God and had denied the call of the apostle sent to them."
		   },
		   {
			"id": 1861,
			"surah": 15,
			"ayat": 59,
			"tafsir": "The angels who were the guests of Prophet Abraham explained to him that they were assigned to destroy Lut's people who did not heed the call of the prophet sent to them. Including those who were destroyed was Lut's own wife. Meanwhile, those who follow Lut will be saved from that punishment. From this verse it can be understood that a person cannot free another person from Allah's punishment even if the other person is his wife, children or parents, because humans are responsible to Allah for all the actions they have done. God will not burden someone with the sins of others in the slightest. Allah's Word:  And a person will not bear the burden of other people's sins  (al-An'am\/6: 164)"
		   },
		   {
			"id": 1862,
			"surah": 15,
			"ayat": 60,
			"tafsir": "The angels who were the guests of Prophet Abraham explained to him that they were assigned to destroy Lut's people who did not heed the call of the prophet sent to them. Including those who were destroyed was Lut's own wife. Meanwhile, those who follow Lut will be saved from that punishment. From this verse it can be understood that a person cannot free another person from Allah's punishment even if the other person is his wife, children or parents, because humans are responsible to Allah for all the actions they have done. God will not burden someone with the sins of others in the slightest. Allah's Word:  And a person will not bear the burden of other people's sins  (al-An'am\/6: 164)"
		   },
		   {
			"id": 1863,
			"surah": 15,
			"ayat": 61,
			"tafsir": "After the angels conveyed the good news to Ibrahim as about Allah's gift to him in the form of the birth of a son and the news of the destruction of Lut's rebellious people, they left Ibrahim's house for the city of Sodom, the land where Lut's people lived in Jordan, to carry out the task assigned to them. God has borne on them. Their sudden arrival at his house was unexpected by Lut a.s. and he did not know at all who the guests who had come were. This is illustrated in Lut's words when welcoming his guest, \"Indeed you are strangers.\" In another word of Allah, Lut's anxiety and ignorance of his people are also described. Allah said: And when Our messengers (angels) came to Lut, he felt sad because of their (arrival), and (felt) had no power to protect them. (al-'Ankabut\/29: 33) From the verse it is understood that the reason for the worry and anxiety of the Prophet Lut was the arrival of the guests to his house suddenly and unexpectedly. The angels disguised themselves as beautiful men who were very liked by Lut's people who liked to do homosexual acts. Usually when a man like that came, Lut's people would flock to his house and force Lut to hand over his guests to them. If Lut as knew for certain that the angels were coming, he would not have worried because he believed that the angels could defend and defend themselves from their actions."
		   },
		   {
			"id": 1864,
			"surah": 15,
			"ayat": 62,
			"tafsir": "After the angels conveyed the good news to Ibrahim as about Allah's gift to him in the form of the birth of a son and the news of the destruction of Lut's rebellious people, they left Ibrahim's house for the city of Sodom, the land where Lut's people lived in Jordan, to carry out the task assigned to them. God has borne on them. Their sudden arrival at his house was unexpected by Lut a.s. and he did not know at all who the guests who had come were. This is illustrated in Lut's words when welcoming his guest, \"Indeed you are strangers.\" In another word of Allah, Lut's anxiety and ignorance of his people are also described. Allah said: And when Our messengers (angels) came to Lut, he felt sad because of their (arrival), and (felt) had no power to protect them. (al-'Ankabut\/29: 33) From the verse it is understood that the reason for the worry and anxiety of the Prophet Lut was the arrival of the guests to his house suddenly and unexpectedly. The angels disguised themselves as beautiful men who were very liked by Lut's people who liked to do homosexual acts. Usually when a man like that came, Lut's people would flock to his house and force Lut to hand over his guests to them. If Lut as knew for certain that the angels were coming, he would not have worried because he believed that the angels could defend and defend themselves from their actions."
		   },
		   {
			"id": 1865,
			"surah": 15,
			"ayat": 63,
			"tafsir": "The angels explained the purpose of their arrival to Lut as. They came to convey bad news, namely the doom that would befall his people who had denied and denied him. In this verse, the answers of the angels are mentioned, \"Indeed, we have come to you with the doom that they always deny.\" Even with the words, \"We have come to punish them.\" The purpose of the angels' answers with such words was to state the truth of the threats that Lut used to convey to his people so far. Prophet Lut as always warned his people to follow and embrace the religion he had conveyed and acknowledge his apostleship. If they persist in denying, they will be overwritten by Allah's punishment. They greeted Lut's exclamation and statement with ridicule. They do not believe in the oneness and power of Allah who can punish those who deny. They even challenged Lut to immediately bring down the promised doom. Then the angels confirmed to Lut that the purpose of their arrival was to carry out the task that Allah swt had assigned them to deliver doom to his people. This task must be carried out and everything they say is true, because they themselves are angels who have never violated God's commands. After that, the angels gave orders to Lut as regarding ways that he and his followers should carry out to avoid Allah's punishment that would come. Lut and his family and people who had believed were ordered to immediately leave the country at the end of the night. Lut as was asked to walk behind his followers, so he could manage and defend himself from attacks from his people who were chasing from behind. This was also intended so that Lut as could encourage his followers to walk as fast as possible, because the doom that was about to be inflicted was near, and he could pay attention to his people who did not want to continue their journey. Furthermore, the angels ordered that none of Lut's followers looked back when they heard the devastating thunder. Thus, they cannot see the terrible events that can damage and shake their souls, so they are safe and their faith grows stronger to the safe place they are going to. In this verse, it is stated that Lut departed with his family and loyal people. Then the angels strengthened his commands and prohibitions by saying, \"Continue your journey to the place that you have been commanded to do.\" According to a history, the place referred to in this verse is the land of Sham (Syria). In surahh Hud, the story of Lut is told in the order of events that once happened, while in this surah it is told in skips, not according to the actual sequence of events. The difference in the way of telling this story is because God's purpose in telling this story in the two surahhs is also different. If connected with the previous verses, the purpose of telling the story of Lut in surahh Hud is to strengthen the hearts of the Prophet Muhammad and his companions, in conveying Allah's religion and declaring the oneness and power of Allah who must be worshiped. The apostles sent by God have always faced challenges and threats from their people, but they remained steadfast and patient in carrying out the tasks assigned by God to them. While the purpose of Lut's story with his people in surahh Al-Hijr is to explain to those who believe in the mercy and favors of Allah that they have received. Also the blessings that have been received by those who believed long ago in the messengers that Allah sent to them. Among them are the favors bestowed upon the Prophet Ibrahim as in the form of the sons he has always yearned for, and the favors bestowed upon the Prophet Lut and his followers. Also to explain God's punishment that has been inflicted on disbelievers and disbelievers to the message of the apostles sent to them."
		   },
		   {
			"id": 1866,
			"surah": 15,
			"ayat": 64,
			"tafsir": "The angels explained the purpose of their arrival to Lut as. They came to convey bad news, namely the doom that would befall his people who had denied and denied him. In this verse, the answers of the angels are mentioned, \"Indeed, we have come to you with the doom that they always deny.\" Even with the words, \"We have come to punish them.\" The purpose of the angels' answers with such words was to state the truth of the threats that Lut used to convey to his people so far. Prophet Lut as always warned his people to follow and embrace the religion he had conveyed and acknowledge his apostleship. If they persist in denying, they will be overwritten by Allah's punishment. They greeted Lut's exclamation and statement with ridicule. They do not believe in the oneness and power of Allah who can punish those who deny. They even challenged Lut to immediately bring down the promised doom. Then the angels confirmed to Lut that the purpose of their arrival was to carry out the task that Allah swt had assigned them to deliver doom to his people. This task must be carried out and everything they say is true, because they themselves are angels who have never violated God's commands. After that, the angels gave orders to Lut as regarding ways that he and his followers should carry out to avoid Allah's punishment that would come. Lut and his family and people who had believed were ordered to immediately leave the country at the end of the night. Lut as was asked to walk behind his followers, so he could manage and defend himself from attacks from his people who were chasing from behind. This was also intended so that Lut as could encourage his followers to walk as fast as possible, because the doom that was about to be inflicted was near, and he could pay attention to his people who did not want to continue their journey. Furthermore, the angels ordered that none of Lut's followers looked back when they heard the devastating thunder. Thus, they cannot see the terrible events that can damage and shake their souls, so they are safe and their faith grows stronger to the safe place they are going to. In this verse, it is stated that Lut departed with his family and loyal people. Then the angels strengthened his commands and prohibitions by saying, \"Continue your journey to the place that you have been commanded to do.\" According to a history, the place referred to in this verse is the land of Sham (Syria). In surahh Hud, the story of Lut is told in the order of events that once happened, while in this surah it is told in skips, not according to the actual sequence of events. The difference in the way of telling this story is because God's purpose in telling this story in the two surahhs is also different. If connected with the previous verses, the purpose of telling the story of Lut in surahh Hud is to strengthen the hearts of the Prophet Muhammad and his companions, in conveying Allah's religion and declaring the oneness and power of Allah who must be worshiped. The apostles sent by God have always faced challenges and threats from their people, but they remained steadfast and patient in carrying out the tasks assigned by God to them. While the purpose of Lut's story with his people in surahh Al-Hijr is to explain to those who believe in the mercy and favors of Allah that they have received. Also the blessings that have been received by those who believed long ago in the messengers that Allah sent to them. Among them are the favors bestowed upon the Prophet Ibrahim as in the form of the sons he has always yearned for, and the favors bestowed upon the Prophet Lut and his followers. Also to explain God's punishment that has been inflicted on disbelievers and disbelievers to the message of the apostles sent to them."
		   },
		   {
			"id": 1867,
			"surah": 15,
			"ayat": 65,
			"tafsir": "The angels explained the purpose of their arrival to Lut as. They came to convey bad news, namely the doom that would befall his people who had denied and denied him. In this verse, the answers of the angels are mentioned, \"Indeed, we have come to you with the doom that they always deny.\" Even with the words, \"We have come to punish them.\" The purpose of the angels' answers with such words was to state the truth of the threats that Lut used to convey to his people so far. Prophet Lut as always warned his people to follow and embrace the religion he had conveyed and acknowledge his apostleship. If they persist in denying, they will be overwritten by Allah's punishment. They greeted Lut's exclamation and statement with ridicule. They do not believe in the oneness and power of Allah who can punish those who deny. They even challenged Lut to immediately bring down the promised doom. Then the angels confirmed to Lut that the purpose of their arrival was to carry out the task that Allah swt had assigned them to deliver doom to his people. This task must be carried out and everything they say is true, because they themselves are angels who have never violated God's commands. After that, the angels gave orders to Lut as regarding ways that he and his followers should carry out to avoid Allah's punishment that would come. Lut and his family and people who had believed were ordered to immediately leave the country at the end of the night. Lut as was asked to walk behind his followers, so he could manage and defend himself from attacks from his people who were chasing from behind. This was also intended so that Lut as could encourage his followers to walk as fast as possible, because the doom that was about to be inflicted was near, and he could pay attention to his people who did not want to continue their journey. Furthermore, the angels ordered that none of Lut's followers looked back when they heard the devastating thunder. Thus, they cannot see the terrible events that can damage and shake their souls, so they are safe and their faith grows stronger to the safe place they are going to. In this verse, it is stated that Lut departed with his family and loyal people. Then the angels strengthened his commands and prohibitions by saying, \"Continue your journey to the place that you have been commanded to do.\" According to a history, the place referred to in this verse is the land of Sham (Syria). In surahh Hud, the story of Lut is told in the order of events that once happened, while in this surah it is told in skips, not according to the actual sequence of events. The difference in the way of telling this story is because God's purpose in telling this story in the two surahhs is also different. If connected with the previous verses, the purpose of telling the story of Lut in surahh Hud is to strengthen the hearts of the Prophet Muhammad and his companions, in conveying Allah's religion and declaring the oneness and power of Allah who must be worshiped. The apostles sent by God have always faced challenges and threats from their people, but they remained steadfast and patient in carrying out the tasks assigned by God to them. While the purpose of Lut's story with his people in surahh Al-Hijr is to explain to those who believe in the mercy and favors of Allah that they have received. Also the blessings that have been received by those who believed long ago in the messengers that Allah sent to them. Among them are the favors bestowed upon the Prophet Ibrahim as in the form of the sons he has always yearned for, and the favors bestowed upon the Prophet Lut and his followers. Also to explain God's punishment that has been inflicted on disbelievers and disbelievers to the message of the apostles sent to them."
		   },
		   {
			"id": 1868,
			"surah": 15,
			"ayat": 66,
			"tafsir": "In this verse it is explained that before the arrival of the angels, Allah had revealed to Lut as about the events that would occur before and after the punishment that befell his people. Therefore, it can be understood that after the angels explained to Lut as about the burden that Allah had assigned to them, and heard the orders of the angels given to him, and in accordance with the revelation that Allah had sent down, he believed that the doom that would befall on his people by the angels will really happen. Because of that too, he followed reverently the orders and instructions given by the angels in an effort to save the believers from that terrible calamity."
		   },
		   {
			"id": 1869,
			"surah": 15,
			"ayat": 67,
			"tafsir": "When Lut's people, the inhabitants of the city of Sodom, heard that Lut had dashing guests, they rejoiced. Arise their evil lust to do homosexuality with the guests, which is a bad habit they always do. Seeing the behavior of his people, Lut as said to them, \"Surely the youths you come and you invite to commit obscene acts are my guests. I must respect and glorify my guests, do not do obscene acts with them, because their actions you will shame me. Fear Allah, protect yourselves from His torment, and do not rape them.\" The people of Lut opposed and threatened the Prophet Lut because of his words by saying, \"Didn't we ever forbid you to protect guests who come here from the desires and actions that we will do to them.\" The words of the Lutites give a hint that the Lutites always force guests who come at that time to be willing to do homosexual acts with them. This heinous act was prohibited by Lut. However, they ignored the ban, they even threatened Lut with a punishment, if Lut still interfered in their affairs. But Lut still warned them and offered them his daughters for them to marry, because that was according to sunatullah. He said, \"O my people, marry my daughters. Do not marry someone of your own kind, because marrying someone of that kind is forbidden by Allah. Do things that are lawful and in accordance with sunatullah. Allah deliberately created men and women so that they marry and have children. If you continue to do this, surely you will not have children and the human race will disappear from the face of the earth.\" In this verse, Lut as mentions \"my daughters\". The meaning is \"his followers who are women\" because a prophet used to call his people with his children and the wife of the prophet is the mother of his people as Allah says: The prophet is more important for the believers than themselves and his wives are mothers. they. (al-Ahzab\/33: 6) If the wives of the prophet are the mothers of those who believe, surely the prophet himself is their father and all his people are his sons and daughters."
		   },
		   {
			"id": 1870,
			"surah": 15,
			"ayat": 68,
			"tafsir": "When Lut's people, the inhabitants of the city of Sodom, heard that Lut had dashing guests, they rejoiced. Arise their evil lust to do homosexuality with the guests, which is a bad habit they always do. Seeing the behavior of his people, Lut as said to them, \"Surely the youths you come and you invite to commit obscene acts are my guests. I must respect and glorify my guests, do not do obscene acts with them, because their actions you will shame me. Fear Allah, protect yourselves from His torment, and do not rape them.\" The people of Lut opposed and threatened the Prophet Lut because of his words by saying, \"Didn't we ever forbid you to protect guests who come here from the desires and actions that we will do to them.\" The words of the Lutites give a hint that the Lutites always force guests who come at that time to be willing to do homosexual acts with them. This heinous act was prohibited by Lut. However, they ignored the ban, they even threatened Lut with a punishment, if Lut still interfered in their affairs. But Lut still warned them and offered them his daughters for them to marry, because that was according to sunatullah. He said, \"O my people, marry my daughters. Do not marry someone of your own kind, because marrying someone of that kind is forbidden by Allah. Do things that are lawful and in accordance with sunatullah. Allah deliberately created men and women so that they marry and have children. If you continue to do this, surely you will not have children and the human race will disappear from the face of the earth.\" In this verse, Lut as mentions \"my daughters\". The meaning is \"his followers who are women\" because a prophet used to call his people with his children and the wife of the prophet is the mother of his people as Allah says: The prophet is more important for the believers than themselves and his wives are mothers. they. (al-Ahzab\/33: 6) If the wives of the prophet are the mothers of those who believe, surely the prophet himself is their father and all his people are his sons and daughters."
		   },
		   {
			"id": 1871,
			"surah": 15,
			"ayat": 69,
			"tafsir": "When Lut's people, the inhabitants of the city of Sodom, heard that Lut had dashing guests, they rejoiced. Arise their evil lust to do homosexuality with the guests, which is a bad habit they always do. Seeing the behavior of his people, Lut as said to them, \"Surely the youths you come and you invite to commit obscene acts are my guests. I must respect and glorify my guests, do not do obscene acts with them, because their actions you will shame me. Fear Allah, protect yourselves from His torment, and do not rape them.\" The people of Lut opposed and threatened the Prophet Lut because of his words by saying, \"Didn't we ever forbid you to protect guests who come here from the desires and actions that we will do to them.\" The words of the Lutites give a hint that the Lutites always force guests who come at that time to be willing to do homosexual acts with them. This heinous act was prohibited by Lut. However, they ignored the ban, they even threatened Lut with a punishment, if Lut still interfered in their affairs. But Lut still warned them and offered them his daughters for them to marry, because that was according to sunatullah. He said, \"O my people, marry my daughters. Do not marry someone of your own kind, because marrying someone of that kind is forbidden by Allah. Do things that are lawful and in accordance with sunatullah. Allah deliberately created men and women so that they marry and have children. If you continue to do this, surely you will not have children and the human race will disappear from the face of the earth.\" In this verse, Lut as mentions \"my daughters\". The meaning is \"his followers who are women\" because a prophet used to call his people with his children and the wife of the prophet is the mother of his people as Allah says: The prophet is more important for the believers than themselves and his wives are mothers. they. (al-Ahzab\/33: 6) If the wives of the prophet are the mothers of those who believe, surely the prophet himself is their father and all his people are his sons and daughters."
		   },
		   {
			"id": 1872,
			"surah": 15,
			"ayat": 70,
			"tafsir": "When Lut's people, the inhabitants of the city of Sodom, heard that Lut had dashing guests, they rejoiced. Arise their evil lust to do homosexuality with the guests, which is a bad habit they always do. Seeing the behavior of his people, Lut as said to them, \"Surely the youths you come and you invite to commit obscene acts are my guests. I must respect and glorify my guests, do not do obscene acts with them, because their actions you will shame me. Fear Allah, protect yourselves from His torment, and do not rape them.\" The people of Lut opposed and threatened the Prophet Lut because of his words by saying, \"Didn't we ever forbid you to protect guests who come here from the desires and actions that we will do to them.\" The words of the Lutites give a hint that the Lutites always force guests who come at that time to be willing to do homosexual acts with them. This heinous act was prohibited by Lut. However, they ignored the ban, they even threatened Lut with a punishment, if Lut still interfered in their affairs. But Lut still warned them and offered them his daughters for them to marry, because that was according to sunatullah. He said, \"O my people, marry my daughters. Do not marry someone of your own kind, because marrying someone of that kind is forbidden by Allah. Do things that are lawful and in accordance with sunatullah. Allah deliberately created men and women so that they marry and have children. If you continue to do this, surely you will not have children and the human race will disappear from the face of the earth.\" In this verse, Lut as mentions \"my daughters\". The meaning is \"his followers who are women\" because a prophet used to call his people with his children and the wife of the prophet is the mother of his people as Allah says: The prophet is more important for the believers than themselves and his wives are mothers. they. (al-Ahzab\/33: 6) If the wives of the prophet are the mothers of those who believe, surely the prophet himself is their father and all his people are his sons and daughters."
		   },
		   {
			"id": 1873,
			"surah": 15,
			"ayat": 71,
			"tafsir": "When Lut's people, the inhabitants of the city of Sodom, heard that Lut had dashing guests, they rejoiced. Arise their evil lust to do homosexuality with the guests, which is a bad habit they always do. Seeing the behavior of his people, Lut as said to them, \"Surely the youths you come and you invite to commit obscene acts are my guests. I must respect and glorify my guests, do not do obscene acts with them, because their actions you will shame me. Fear Allah, protect yourselves from His torment, and do not rape them.\" The people of Lut opposed and threatened the Prophet Lut because of his words by saying, \"Didn't we ever forbid you to protect guests who come here from the desires and actions that we will do to them.\" The words of the Lutites give a hint that the Lutites always force guests who come at that time to be willing to do homosexual acts with them. This heinous act was prohibited by Lut. However, they ignored the ban, they even threatened Lut with a punishment, if Lut still interfered in their affairs. But Lut still warned them and offered them his daughters for them to marry, because that was according to sunatullah. He said, \"O my people, marry my daughters. Do not marry someone of your own kind, because marrying someone of that kind is forbidden by Allah. Do things that are lawful and in accordance with sunatullah. Allah deliberately created men and women so that they marry and have children. If you continue to do this, surely you will not have children and the human race will disappear from the face of the earth.\" In this verse, Lut as mentions \"my daughters\". The meaning is \"his followers who are women\" because a prophet used to call his people with his children and the wife of the prophet is the mother of his people as Allah says: The prophet is more important for the believers than themselves and his wives are mothers. they. (al-Ahzab\/33: 6) If the wives of the prophet are the mothers of those who believe, surely the prophet himself is their father and all his people are his sons and daughters."
		   },
		   {
			"id": 1874,
			"surah": 15,
			"ayat": 72,
			"tafsir": "This verse explains Allah swt's affirmation to Prophet Muhammad saw that homosexual and lesbian acts committed by Lut's people were truly heinous and misguided acts, and therefore must be shunned and abandoned. Arabs used to swear by saying someone's age. In this verse, Allah swt swears by the age and life of the Prophet Muhammad, whose purpose is to show the primacy of the Prophet Muhammad. Some commentators are of the opinion that the ones who swear in this verse are the angels. They declared that the actions of the people of Lut were outrageous. However, this opinion is refuted by narrations which say that Allah swt never swore by mentioning the age of the other prophets and messengers, except for mentioning the age of the Prophet Muhammad. This is solely to show the primacy of the Prophet Muhammad."
		   },
		   {
			"id": 1875,
			"surah": 15,
			"ayat": 73,
			"tafsir": "This verse explains the punishment that was inflicted on Lut's people, to show the consequences of their actions. The doom came at dawn in the form of thunder that destroyed the city of Sodom. In another verse it is stated that the doom comes at dawn and ends at sunrise."
		   },
		   {
			"id": 1876,
			"surah": 15,
			"ayat": 74,
			"tafsir": "Allah explains that there are three types of punishment that befell Lut's people: 1. In the form of a thunderous and terrifying sound; 2. Overturned the city of Sodom, so that the layer of soil that was originally above was turned upside down to become the layer below; 3. Showering them with stones."
		   },
		   {
			"id": 1877,
			"surah": 15,
			"ayat": 75,
			"tafsir": "This verse describes the actions and behavior of Lut's people, then they were destroyed because of their actions that were contrary to the orders of Allah, God Almighty, Almighty, loves and loves His faithful servants, and punishes those who disobey -His. Believers, who pay attention to the signs of Allah's power and greatness, take all of this as a lesson, as stated in the hadith: The Messenger of Allah said, \"Beware of the hunch of the believer because in fact he sees with the light of Allah,\" then he recited this surahh. (History of at-Tirmidhi and Ibn Jarir ath-tabari from Abu Sa'id al-Khudri) These hunch are of two kinds: 1. An impression and feeling that Allah swt makes on the hearts of pious people. The ability given to him to read the expressions, behavior and circumstances of other people. 2. Hunches engendered by experience, noble life, and noble manners. In the hadith it is also mentioned: Rasulullah SAW said, \"Verily Allah has servants who know humans by signs.\" (History of ath-thabrani and al Bazzar from Anas bin Malik)"
		   },
		   {
			"id": 1878,
			"surah": 15,
			"ayat": 76,
			"tafsir": "Allah swt explained that the land of Lut's people who had been destroyed was located on the roads that humans used to walk. Its ruins can be seen to this day by people traveling from Medina to Sham. This is emphasized by Allah SWT in another word of His: And verily you (people of Mecca) will really pass through their (traces) in the morning and at night. Then why don't you understand? (as-shaffat\/37: 137-138) Meccan Arabs usually held trade to Sham. They departed in caravans. On their way back and forth from Mecca to Sham, they passed through the land of Lut's people and could see the traces of it."
		   },
		   {
			"id": 1879,
			"surah": 15,
			"ayat": 77,
			"tafsir": "Then Allah swt warned that the punishment He inflicted on the people of Lut so that they were destroyed and the escape of Lut and his followers were signs of Allah's power and greatness. He will punish everyone who disobeys and disobeys and rewards those who believe in Him. As for the disbelievers, the event that destroyed Lut's people was simply the result of a natural disaster. Earthquakes, scorching heat throughout the year, and outbreaks of disease are common things in nature, and have nothing to do with human disobedience and denial of Allah."
		   },
		   {
			"id": 1880,
			"surah": 15,
			"ayat": 78,
			"tafsir": "This verse explains that the inhabitants of the city of Aikah are people who are unjust and unfaithful. Prophet Shuaib as was sent to them, but they denied and denied his message. The hadith explains the relationship between the people of Aikah and the people of the city of Madyan. Rasulullah SAW said, \"Verily, the residents of the city of Madyan and the residents of Aikah are two people to whom Allah sent the Prophet Shuaib\". (History of Ibn Mardawaih and Ibn 'Asakir) The basic meaning of Aikah is forest, then it becomes the name of a country because that country has lots of forests. The country is located in the Madyan region. The people of Aikah adhere to polytheistic beliefs, like to rob and rob people who pass through their country, and cheat when weighing and measuring. Prophet Shuaib as was sent to them, but they denied it."
		   },
		   {
			"id": 1881,
			"surah": 15,
			"ayat": 79,
			"tafsir": "Because of their actions that violated Allah's prohibition and ignored the messenger's call, they were doomed in the form of scorching heat for seven days, without the slightest cloud to cover them. Allah then sent a cloud, then they took shelter under it. Suddenly from within the cloud emanated a flame that scorched them. In surahh al-A'raf\/7: 91, it is explained that they were also hit by a terrible earthquake. Then an earthquake came upon them, and they died lying in the ruins of their homes. (al-A'raf\/7: 91) Then Allah SWT explained that the city of Sodom and the city of Aikah are two cities that are close together, both are located on roads that are usually passed by humans. In fact, their former remains can still be seen and studied, so that they can be used as a lesson by those who are willing to use their minds."
		   },
		   {
			"id": 1882,
			"surah": 15,
			"ayat": 80,
			"tafsir": "This verse explains that the inhabitants of the city of al-Hijr have denied the apostles. This verse mentions the apostles even though they only belied one apostle, namely Prophet Saleh, because to deny one apostle is the same as denying all of Allah's apostles. All the apostles sent by Allah carried the monotheistic religion and the same religious principles. Even though they have denied an apostle, they have denied monotheism and religious principles that the apostle brought, which means they have belied all the apostles. The city of al-Hijr is the home of the Samud located between Mecca and Sham, near Wadil-Qura. Prophet Saleh was sent to them, who was given a miracle as proof of his apostleship. Saleh stated his miracle in the form of a she-camel that they knew as proof of his apostleship. The camel should not be disturbed or hurt. The amount of drinking water was determined alternately, that is, one day for the camels to drink and one day for all of them. But they did not want to follow Saleh's provisions, they even slaughtered the camel."
		   },
		   {
			"id": 1883,
			"surah": 15,
			"ayat": 81,
			"tafsir": "This verse explains that the inhabitants of the city of al-Hijr have denied the apostles. This verse mentions the apostles even though they only belied one apostle, namely Prophet Saleh, because to deny one apostle is the same as denying all of Allah's apostles. All the apostles sent by Allah carried the monotheistic religion and the same religious principles. Even though they have denied an apostle, they have denied monotheism and religious principles that the apostle brought, which means they have belied all the apostles. The city of al-Hijr is the home of the Samud located between Mecca and Sham, near Wadil-Qura. Prophet Saleh was sent to them, who was given a miracle as proof of his apostleship. Saleh stated his miracle in the form of a she-camel that they knew as proof of his apostleship. The camel should not be disturbed or hurt. The amount of drinking water was determined alternately, that is, one day for the camels to drink and one day for all of them. But they did not want to follow Saleh's provisions, they even slaughtered the camel."
		   },
		   {
			"id": 1884,
			"surah": 15,
			"ayat": 82,
			"tafsir": "The Samud are a people who are strong and mighty in body. They carved rock mountains to make their houses, so their city was named \"city of al-hijr\" which means city of rock mountains. Because of their disobedience, Allah inflicted punishment on them in the form of a loud sound that thundered and destroyed them all. The harsh doom came in the morning of the fourth day of the day that Saleh had set for them to think. But they paid no heed to it, so they were buried in their houses which were caves hewn into the rocks. Their condition is explained by Allah in another of His words: Then a thunderous voice fell on the unjust people, so that they died in their homes. It was as if they had never lived in that place. Remember, the Samud people denied their God. Remember, the Samud people perished. (Hud\/11: 67-68) The Samud cannot escape Allah's punishment in the slightest. There is no use for the might of their bodies, their ability to carve mountains to make a house as if it were a solid fortress, as well as their many treasures and numbers. Everything was destroyed with them, as if the land had never been inhabited by humans. About the terrible doom that the Samud people experienced, is illustrated in the hadith of the Prophet saw: From Ibn Umar ra that the Prophet saw had passed in the city of Hijr on his way to the Tabuk war, then he lowered his head and accelerated his journey while saying to his companions, \"Do not enter the houses of the people who are being punished (Samud), unless you will cry. If you do not cry, then let it be as if you were crying because you are afraid that you will be punished later as they were punished before.\" (Al-Bukhari)"
		   },
		   {
			"id": 1885,
			"surah": 15,
			"ayat": 83,
			"tafsir": "The Samud are a people who are strong and mighty in body. They carved rock mountains to make their houses, so their city was named \"city of al-hijr\" which means city of rock mountains. Because of their disobedience, Allah inflicted punishment on them in the form of a loud sound that thundered and destroyed them all. The harsh doom came in the morning of the fourth day of the day that Saleh had set for them to think. But they paid no heed to it, so they were buried in their houses which were caves hewn into the rocks. Their condition is explained by Allah in another of His words: Then a thunderous voice fell on the unjust people, so that they died in their homes. It was as if they had never lived in that place. Remember, the Samud people denied their God. Remember, the Samud people perished. (Hud\/11: 67-68) The Samud cannot escape Allah's punishment in the slightest. There is no use for the might of their bodies, their ability to carve mountains to make a house as if it were a solid fortress, as well as their many treasures and numbers. Everything was destroyed with them, as if the land had never been inhabited by humans. About the terrible doom that the Samud people experienced, is illustrated in the hadith of the Prophet saw: From Ibn Umar ra that the Prophet saw had passed in the city of Hijr on his way to the Tabuk war, then he lowered his head and accelerated his journey while saying to his companions, \"Do not enter the houses of the people who are being punished (Samud), unless you will cry. If you do not cry, then let it be as if you were crying because you are afraid that you will be punished later as they were punished before.\" (Al-Bukhari)"
		   },
		   {
			"id": 1886,
			"surah": 15,
			"ayat": 84,
			"tafsir": "The Samud are a people who are strong and mighty in body. They carved rock mountains to make their houses, so their city was named \"city of al-hijr\" which means city of rock mountains. Because of their disobedience, Allah inflicted punishment on them in the form of a loud sound that thundered and destroyed them all. The harsh doom came in the morning of the fourth day of the day that Saleh had set for them to think. But they paid no heed to it, so they were buried in their houses which were caves hewn into the rocks. Their condition is explained by Allah in another of His words: Then a thunderous voice fell on the unjust people, so that they died in their homes. It was as if they had never lived in that place. Remember, the Samud people denied their God. Remember, the Samud people perished. (Hud\/11: 67-68) The Samud cannot escape Allah's punishment in the slightest. There is no use for the might of their bodies, their ability to carve mountains to make a house as if it were a solid fortress, as well as their many treasures and numbers. Everything was destroyed with them, as if the land had never been inhabited by humans. About the terrible doom that the Samud people experienced, is illustrated in the hadith of the Prophet saw: From Ibn Umar ra that the Prophet saw had passed in the city of Hijr on his way to the Tabuk war, then he lowered his head and accelerated his journey while saying to his companions, \"Do not enter the houses of the people who are being punished (Samud), unless you will cry. If you do not cry, then let it be as if you were crying because you are afraid that you will be punished later as they were punished before.\" (Al-Bukhari)"
		   },
		   {
			"id": 1887,
			"surah": 15,
			"ayat": 85,
			"tafsir": "This verse explains that Allah created everything in the heavens and on this earth, not to do injustice and wrongdoing to all residents or creatures, as was done to the people of the past who were ungodly. Allah created these objects with the intent and purpose, in accordance with the knowledge and compassion of Allah for His creatures. Likewise, the stories of the people that used to be told to be used as references, parables, and parables for people who want to believe in the power and greatness of Allah. Then Allah swt emphasized that the Day of Judgment will definitely come, there is not the slightest doubt, because at that time Allah will perfect his reward for humans according to the deeds they have done. Good deeds are rewarded with heaven, while bad deeds are rewarded with the punishment of hell. Allah warns that if people do not want to believe in Allah and the Prophet Muhammad, and do not want to take the lessons and experiences that have been experienced by the past peoples, then the Prophet was ordered to turn away from them, and show a good attitude, high manners, and forgive their unnatural behavior towards him. This verse explains the attitudes that must be possessed by a preacher in particular and all Muslims in general in conveying the religion of Allah and dealing with disobedient people. The Muslims are only obliged to convey the religion of Allah, and are not required to force and make them (disobedient people) believe, which makes a person's faith and disbelief only Allah."
		   },
		   {
			"id": 1888,
			"surah": 15,
			"ayat": 86,
			"tafsir": "Furthermore, Allah confirms that He is God Almighty, the Creator, and All-Knower of all things, whether visible or not, what is real and what is hidden, and He is All-Knowing of all that is in the heart."
		   },
		   {
			"id": 1889,
			"surah": 15,
			"ayat": 87,
			"tafsir": "This verse explains that Allah has sent down to the Prophet Muhammad \"as-sab'ul matsani\" (seven verses that are read repeatedly) and the great Qur'an. It is not explained in this verse what is meant by \"as-sab'ul matsani\" and \"the great Qur'an\". However, there is a hadith explaining that what is meant by as-sab'ul matsani and the great Qur'an is surahh al-Fatihah. The hadith is: From Abi Said Al-Mu'alla he said, \"The Prophet passed before me while I was praying, so he called me and I did not go to him until I finished praying. Then I came to him, then the Prophet said, \"Why you do not come to me.\" I replied, \"I am praying.\" He said, \"Not that Allah has said, \"O you who believe, accept the call of Allah and the Messenger,\" then he said, Know! I will teach you the most glorious surahh in the Qur'an, before I leave this mosque.\" So the Prophet went out and I reminded him, then he said, \"Al-hamdu lillahi rabbil-'alamin is \"as- sab'ul-matsani\" and \"the great Qur'an\" which he gave me.\" (Al-Bukhari) In another hadith, Rasulullah saw said: Ummul-Qur'an is as-sab'ul- matsani and the Great Qur'an (History of al-Bukhari) Many other authentic hadiths explain that as-sab'ul-matsani and the Great Qur'an are other names for surahh al-Fatihah. commentators are of the opinion that what is meant by as-sab'ul matsani in the verse above is as-sab'uth-thiwal (the seven surahhs of the Qur'an which have the longest verses), namely surahh al-Baqarah, Ali 'Imran, al-Ma'idah, an-Nisa, al-A'raf, al-An'am, and at-Taubah or al-Anfal.The seven surahhs are called as-sab'ul-matsani, because in the surahhs the seven repeated mentions of tales, laws, monotheism, and others. However, this opinion contradicts the above authentic hadiths. Meanwhile, part of the surahh as-sab'uth-thiwal was revealed in Medina, while the verse that explains this as-sab'ul-matsani is Makkiyah. It is called as-sab'ul-matsani (seven repetitions) because surahh al-Fatihah consists of seven verses which are repeated in every cycle of prayer. A Muslim prays at least seventeen cycles a day and a night. Therefore, they read al-Fatihah at least seventeen times a day and a night. It is called the great Al-Qur'an because the contents of surahh al-Fatihah are the main points of the entire Al-Qur'an, and are also in accordance with the meaning of the hadith above."
		   },
		   {
			"id": 1890,
			"surah": 15,
			"ayat": 88,
			"tafsir": "In the verse above it is explained that Allah SWT has bestowed something of great value on those who believe, namely surahh al-Fatihah. The gift is in the form of instructions to the right path and cannot be valued by any amount of wealth. Therefore, Allah swt warns believers not to feel disheartened and grieve over the worldly pleasures that Allah has bestowed on disbelievers. It is inappropriate for someone to turn his attention from something that is noble and of high value to something that is of less value, especially if the pleasures of this world are obtained in a way that is not justified by God. All that is temporary pleasure, then they will be put into the burning hell fire. This verse is in line with the word of Allah SWT which forbade the Messenger to see the pleasures given to the disbelievers: And do not fix your eyes on the pleasures that We have given to some groups of them, (as) the flowers of the life of the world so that We may test them with ( pleasure) it. Your Lord's gift is better and more lasting. (thaha\/20: 131) Allah swt forbade the Prophet Muhammad saw to grieve against unbelievers who did not heed his call. Allah's prohibition is because the Prophet saw really hoped that all people would believe and hoped that disbelievers would not be overwritten by Allah's punishment in the afterlife because of the vastness of His mercy. Allah's prohibition also reminded the Prophet that his duty was only to convey Allah's religion, not to force people to believe. Then Allah decided that the Prophet was gentle and told the disbelievers that Allah's punishment would befall them if they continued in disbelief and misguidance, as had been inflicted on people before them."
		   },
		   {
			"id": 1891,
			"surah": 15,
			"ayat": 89,
			"tafsir": "In the verse above it is explained that Allah SWT has bestowed something of great value on those who believe, namely surahh al-Fatihah. The gift is in the form of instructions to the right path and cannot be valued by any amount of wealth. Therefore, Allah swt warns believers not to feel disheartened and grieve over the worldly pleasures that Allah has bestowed on disbelievers. It is inappropriate for someone to turn his attention from something that is noble and of high value to something that is of less value, especially if the pleasures of this world are obtained in a way that is not justified by God. All that is temporary pleasure, then they will be put into the burning hell fire. This verse is in line with the word of Allah SWT which forbade the Messenger to see the pleasures given to the disbelievers: And do not fix your eyes on the pleasures that We have given to some groups of them, (as) the flowers of the life of the world so that We may test them with ( pleasure) it. Your Lord's gift is better and more lasting. (thaha\/20: 131) Allah swt forbade the Prophet Muhammad saw to grieve against unbelievers who did not heed his call. Allah's prohibition is because the Prophet saw really hoped that all people would believe and hoped that disbelievers would not be overwritten by Allah's punishment in the afterlife because of the vastness of His mercy. Allah's prohibition also reminded the Prophet that his duty was only to convey Allah's religion, not to force people to believe. Then Allah decided that the Prophet was gentle and told the disbelievers that Allah's punishment would befall them if they continued in disbelief and misguidance, as had been inflicted on people before them."
		   },
		   {
			"id": 1892,
			"surah": 15,
			"ayat": 90,
			"tafsir": "This verse explains that just as Allah has bestowed as-sab'ul-matsani on the people of the Prophet Muhammad, He has also bestowed the same on previous people through the intercession of the prophets who were sent to them. Similar to the attitude and actions of the earlier people towards the books that were revealed to them, so too is the attitude of the polytheists in Mecca who have named the Qur'an with various names, such as poetry, magic, folk tales. ancient, made by Muhammad, and so on. The commentators differ on what is meant by the words \"al-muqtasimin\" (one who divides). The first opinion interprets al-muqtasimin with unbelievers who have sworn that Allah will not resurrect the dead. These words are in accordance with the word of Allah swt: And they swear by (name) Allah with a solemn oath, \"Allah will not raise the dead.\" Not so (surely Allah will raise him up), as a true promise from Him, but most people do not know. (an-Nahl\/16: 38) And the word of Allah swt: Are these the people whom you have sworn, that they will not receive Allah's mercy? (al-A'raf\/7: 49) The second opinion interprets al-muqtasimin with \"those who divide\" the book of Allah, namely reducing, exchanging, and adding to the contents of the book of Allah which has been revealed to His messengers. The basis of their opinion is the word of Allah swt: Do you believe in some of the Books (Torah) and deny some (others)?... (al-Baqarah\/2: 85) And the word of Allah swt: (That is) among people Jews, who change the words from the places (an-Nisa'\/4: 46) The third opinion interprets al-muqtasimin with \"those who divide\". The point is that they name the Qur'an according to the name they want, so that people do not believe it is a book sent down by Allah. Their reason is the word of Allah SWT: In fact they say, \"(The Qur'an is the fruit of) chaotic dreams, or the result of engineering (Muhammad), or even he is just a poet. (al-Anbiya\/21: 5) Word of Allah swt: Then he said, \"(Al-Qur'an) this is just magic learned (from the ancients). (al-Muddatstsir\/74: 24) Each of the above opinions has strong arguments, but what is more appropriate and in accordance with these verses is the third opinion, especially when connected with the following verses, namely the word of God which means: \"That is the people who have made the Koran was divided.\" Al-Maragi, citing the opinion of Ibn Abbas, said that the Jews and Christians have divided the Al-Qur'an into divisions, there are parts that they believe in, and there are also parts that they deny. Hasan al-Basri is of the opinion that the Meccan polytheists had divided the paths that would be followed by humans, then they stood in the paths that would be passed by humans and frightened those who would take the path that had been laid out by the Prophet."
		   },
		   {
			"id": 1893,
			"surah": 15,
			"ayat": 91,
			"tafsir": "This verse explains that just as Allah has bestowed as-sab'ul-matsani on the people of the Prophet Muhammad, He has also bestowed the same on previous people through the intercession of the prophets who were sent to them. Similar to the attitude and actions of the earlier people towards the books that were revealed to them, so too is the attitude of the polytheists in Mecca who have named the Qur'an with various names, such as poetry, magic, folk tales. ancient, made by Muhammad, and so on. The commentators differ on what is meant by the words \"al-muqtasimin\" (one who divides). The first opinion interprets al-muqtasimin with unbelievers who have sworn that Allah will not resurrect the dead. These words are in accordance with the word of Allah swt: And they swear by (name) Allah with a solemn oath, \"Allah will not raise the dead.\" Not so (surely Allah will raise him up), as a true promise from Him, but most people do not know. (an-Nahl\/16: 38) And the word of Allah swt: Are these the people whom you have sworn, that they will not receive Allah's mercy? (al-A'raf\/7: 49) The second opinion interprets al-muqtasimin with \"those who divide\" the book of Allah, namely reducing, exchanging, and adding to the contents of the book of Allah which has been revealed to His messengers. The basis of their opinion is the word of Allah swt: Do you believe in some of the Books (Torah) and deny some (others)?... (al-Baqarah\/2: 85) And the word of Allah swt: (That is) among people Jews, who change the words from the places (an-Nisa'\/4: 46) The third opinion interprets al-muqtasimin with \"those who divide\". The point is that they name the Qur'an according to the name they want, so that people do not believe it is a book sent down by Allah. Their reason is the word of Allah SWT: In fact they say, \"(The Qur'an is the fruit of) chaotic dreams, or the result of engineering (Muhammad), or even he is just a poet. (al-Anbiya\/21: 5) Word of Allah swt: Then he said, \"(Al-Qur'an) this is just magic learned (from the ancients). (al-Muddatstsir\/74: 24) Each of the above opinions has strong arguments, but what is more appropriate and in accordance with these verses is the third opinion, especially when connected with the following verses, namely the word of God which means: \"That is the people who have made the Koran was divided.\" Al-Maragi, citing the opinion of Ibn Abbas, said that the Jews and Christians have divided the Al-Qur'an into divisions, there are parts that they believe in, and there are also parts that they deny. Hasan al-Basri is of the opinion that the Meccan polytheists had divided the paths that would be followed by humans, then they stood in the paths that would be passed by humans and frightened those who would take the path that had been laid out by the Prophet."
		   },
		   {
			"id": 1894,
			"surah": 15,
			"ayat": 92,
			"tafsir": "This verse instructs the Prophet Muhammad to warn those who divide the Qur'an and do not believe it as a holy book that Allah will bring down punishment upon them as Allah has destroyed previous peoples for actions similar to them."
		   },
		   {
			"id": 1895,
			"surah": 15,
			"ayat": 93,
			"tafsir": "This verse instructs the Prophet Muhammad to warn those who divide the Qur'an and do not believe it as a holy book that Allah will bring down punishment upon them as Allah has destroyed previous peoples for actions similar to them."
		   },
		   {
			"id": 1896,
			"surah": 15,
			"ayat": 94,
			"tafsir": "This verse instructs the Prophet Muhammad to spread the religion of Islam openly, no longer secretly, challenging polytheists, not caring about them and what they say, and not being afraid of those who hinder him from spreading the religion of Allah, because Allah protected him from their disturbances. Some commentators interpret \"Turn away from polytheists\" to mean do not care about all kinds of actions of polytheists who have belied, ridiculed and opposed you. Do not let their actions prevent you from propagating Allah's religion, because Allah protects you from their disturbances."
		   },
		   {
			"id": 1897,
			"surah": 15,
			"ayat": 95,
			"tafsir": "This verse instructs the Prophet Muhammad to spread the religion of Islam openly, no longer secretly, challenging polytheists, not caring about them and what they say, and not being afraid of those who hinder him from spreading the religion of Allah, because Allah protected him from their disturbances. Some commentators interpret \"Turn away from polytheists\" to mean do not care about all kinds of actions of polytheists who have belied, ridiculed and opposed you. Do not let their actions prevent you from propagating Allah's religion, because Allah protects you from their disturbances."
		   },
		   {
			"id": 1898,
			"surah": 15,
			"ayat": 96,
			"tafsir": "This verse guarantees the Prophet Muhammad that Allah swt will protect him from the actions of the Meccan polytheists who mock and hurt him and protect the Qur'an from the efforts of people who want to pollute it. Ath-tabari conveyed a history from Sa'id bin Jubair that the polytheists of Mecca who made fun of the Qur'an and the Prophet Muhammad were al-Walid bin Mugirah, al-'As bin Wa'il, Al-'Adi bin Qais, Aswad bin Abdu Yaguts, and Aswad bin Muttalib. They were all famous in history, and the causes of their deaths were the result of their own actions. According to a history, it is explained that once the Prophet saw was in the presence of Meccan infidels, they winked at each other without the knowledge of the Prophet Muhammad saw, and said to each other with the intention of ridiculing the Prophet, \"Is this the person who claims he is a prophet?\" At that time, Jibril was accompanying the Prophet, then Jibril stabbed the backs of those who made fun of him with his finger, causing scars, wounds and ulcers that smelled bad. No one approached them because of the smell. So this verse came down which confirms that the Prophet saw was protected by Allah from the disturbances of the disbelievers. Allah knows that the Holy Prophet was grieved by the ridicule and actions of the disbelievers. To cure his sadness, Allah ordered the Prophet to glorify Allah, purify Allah from everything that associates partners with Him, pray, bow, prostrate, do a lot of worship, do good, and curb lust. This also applies to Muslims until the end of their lives."
		   },
		   {
			"id": 1899,
			"surah": 15,
			"ayat": 97,
			"tafsir": "This verse guarantees the Prophet Muhammad that Allah swt will protect him from the actions of the Meccan polytheists who mock and hurt him and protect the Qur'an from the efforts of people who want to pollute it. Ath-tabari conveyed a history from Sa'id bin Jubair that the polytheists of Mecca who made fun of the Qur'an and the Prophet Muhammad were al-Walid bin Mugirah, al-'As bin Wa'il, Al-'Adi bin Qais, Aswad bin Abdu Yaguts, and Aswad bin Muttalib. They were all famous in history, and the causes of their deaths were the result of their own actions. According to a history, it is explained that once the Prophet saw was in the presence of Meccan infidels, they winked at each other without the knowledge of the Prophet Muhammad saw, and said to each other with the intention of ridiculing the Prophet, \"Is this the person who claims he is a prophet?\" At that time, Jibril was accompanying the Prophet, then Jibril stabbed the backs of those who made fun of him with his finger, causing scars, wounds and ulcers that smelled bad. No one approached them because of the smell. So this verse came down which confirms that the Prophet saw was protected by Allah from the disturbances of the disbelievers. Allah knows that the Holy Prophet was grieved by the ridicule and actions of the disbelievers. To cure his sadness, Allah ordered the Prophet to glorify Allah, purify Allah from everything that associates partners with Him, pray, bow, prostrate, do a lot of worship, do good, and curb lust. This also applies to Muslims until the end of their lives."
		   },
		   {
			"id": 1900,
			"surah": 15,
			"ayat": 98,
			"tafsir": "This verse guarantees the Prophet Muhammad that Allah swt will protect him from the actions of the Meccan polytheists who mock and hurt him and protect the Qur'an from the efforts of people who want to pollute it. Ath-tabari conveyed a history from Sa'id bin Jubair that the polytheists of Mecca who made fun of the Qur'an and the Prophet Muhammad were al-Walid bin Mugirah, al-'As bin Wa'il, Al-'Adi bin Qais, Aswad bin Abdu Yaguts, and Aswad bin Muttalib. They were all famous in history, and the causes of their deaths were the result of their own actions. According to a history, it is explained that once the Prophet saw was in the presence of Meccan infidels, they winked at each other without the knowledge of the Prophet Muhammad saw, and said to each other with the intention of ridiculing the Prophet, \"Is this the person who claims he is a prophet?\" At that time, Jibril was accompanying the Prophet, then Jibril stabbed the backs of those who made fun of him with his finger, causing scars, wounds and ulcers that smelled bad. No one approached them because of the smell. So this verse came down which confirms that the Prophet saw was protected by Allah from the disturbances of the disbelievers. Allah knows that the Holy Prophet was grieved by the ridicule and actions of the disbelievers. To cure his sadness, Allah ordered the Prophet to glorify Allah, purify Allah from everything that associates partners with Him, pray, bow, prostrate, do a lot of worship, do good, and curb lust. This also applies to Muslims until the end of their lives."
		   },
		   {
			"id": 1901,
			"surah": 15,
			"ayat": 99,
			"tafsir": "This verse guarantees the Prophet Muhammad that Allah swt will protect him from the actions of the Meccan polytheists who mock and hurt him and protect the Qur'an from the efforts of people who want to pollute it. Ath-tabari conveyed a history from Sa'id bin Jubair that the polytheists of Mecca who made fun of the Qur'an and the Prophet Muhammad were al-Walid bin Mugirah, al-'As bin Wa'il, Al-'Adi bin Qais, Aswad bin Abdu Yaguts, and Aswad bin Muttalib. They were all famous in history, and the causes of their deaths were the result of their own actions. According to a history, it is explained that once the Prophet saw was in the presence of Meccan infidels, they winked at each other without the knowledge of the Prophet Muhammad saw, and said to each other with the intention of ridiculing the Prophet, \"Is this the person who claims he is a prophet?\" At that time, Jibril was accompanying the Prophet, then Jibril stabbed the backs of those who made fun of him with his finger, causing scars, wounds and ulcers that smelled bad. No one approached them because of the smell. So this verse came down which confirms that the Prophet saw was protected by Allah from the disturbances of the disbelievers. Allah knows that the Holy Prophet was grieved by the ridicule and actions of the disbelievers. To cure his sadness, Allah ordered the Prophet to glorify Allah, purify Allah from everything that associates partners with Him, pray, bow, prostrate, do a lot of worship, do good, and curb lust. This also applies to Muslims until the end of their lives."
		   }
	]
}
