{
	"tafseer": [
		{
			"id": 4785,
			"surah": 53,
			"ayat": 1,
			"tafsir": "Allah swt explains that He swears by His great creatures, namely stars that circulate on their axis, so that they do not collide with each other. The stars are a guide for humans in the forest and in the desert, in residences and on journeys, in villages and cities, and also at sea, the stars are of great use to human life. Allah swt directs His oath to the polytheists in order to know how much the stars are useful for them. Among others, to know the changing seasons so they get ready to graze their livestock, then after it rains they can plant crops according to the season. Allah's oath reminds people that there are mighty objects in space that they must know about so that they can believe in the magnitude of Allah's source of power and the beauty of His creation. Modern science has explained that in the universe there are miracles that can be seen from the speed of circulation and its large shape. The solar realm consists of the sun and 9 planets, most of which are surrounded by several moons. The sun in its nature is part of the universe of space. In the universe there are about 30,000,000,000 (thirty billion) stars. Every star is as sun like the sun of human beings on this earth. Some are bigger and some are smaller than that. The age of the sun is about five billion years, the age of the earth is about 2000 million years. The age of water on earth is about 300 million years. And the human lifespan is about 300,000 years. And the universe has a guardian (only Allah knows). And no one knows the army of God except Him. Al-'Amasy of Mujahid said that this verse refers to the Qur'an when it was revealed as in His words: Then I swear by the places where the stars fly. And indeed it is truly a great oath if you know, and (this) is indeed the very noble Qur'an, in the preserved Book (Lauh Mahfudz), no one has touched it except the servants who are purified. Sent down from the Lord of all the worlds. (al-Waqi'ah\/56: 75-80)"
		   },
		   {
			"id": 4786,
			"surah": 53,
			"ayat": 2,
			"tafsir": "Allah explained that their friend (Muhammad) was truly a prophet. He never strayed from the right path. He also never commits evil. In fact Rasulullah saw was a messenger who was guided by Allah, he followed the truth. He is not a misguided man (nor is he walking a path that he himself does not know). He is not a heretic who turns away from the truth with a specific purpose. His condition was like that, not only after he was appointed as an apostle, but also before. That is why Allah gave him instructions and Shari'a to give light to those who are astray, both Jews and Christians, who actually know the truth, but do not practice it."
		   },
		   {
			"id": 4787,
			"surah": 53,
			"ayat": 3,
			"tafsir": "In this verse Allah swt explains that Muhammad saw was not misguided and not wrong because he was a person who never indulged his desires including his words. People who may be mistaken or lost are people who follow their desires. As God's word: Do not follow your lust, because it will lead you astray from God's way. (shad\/38: 26)"
		   },
		   {
			"id": 4788,
			"surah": 53,
			"ayat": 4,
			"tafsir": "In this verse, Allah strengthens the previous verse, namely that Muhammad only said what was ordered by Allah to be conveyed to humans perfectly, not adding or subtracting according to what was revealed to him. 'Abdullah bin 'Amr bin 'As wrote down everything he heard from the Prophet, because he wanted to memorize it. But the Quraysh forbade it. They say why he wrote down every word of Muhammad saw, whereas Muhammad was an ordinary man who spoke in a state of anger. So stop 'Abdullah bin 'Umar writing. Then he came to Rasulullah SAW, and told him about it. Then the Messenger of Allah said: \"Write for the sake of the Substance that controls me, nothing comes out of my words except the truth.\" (History of Ahmad and Abu Dawud) Al-hafidz Abu Bakr al-Bazzar mentions the history of Abu Hurairah that the Prophet Muhammad said: ) \"Something I tell you that it is from Allah, then there is no doubt about it.\" (History of Ibn hibban and al-Bazzar) Imam Ahmad and al-Bazzar narrated from Abu Hurairah, he said that the Messenger of Allah said: \"I do not say except what is true.\" (History of Ahmad and al-Bazzar)"
		   },
		   {
			"id": 4789,
			"surah": 53,
			"ayat": 5,
			"tafsir": "In this verse Allah swt explains that Muhammad saw (their friend) was taught by Jibril. Jibril is very strong, both knowledge and charity. In the word of God it is explained: Verily (the Qur'an) is truly the word (of Allah brought by) a noble messenger (Gabriel), who has power, has a high position with (Allah) who has a 'Throne, who is there (in the angelic realm) is obeyed and trusted. (at-Takwir\/81: 1921) Then Muhammad learned it and practiced it. This verse is the answer to those who say that Muhammad was just a storyteller who told tales (legends) of the ancients. From this it is clear that Muhammad saw was not taught by a human being, but he was taught by the very powerful Angel Gabriel. ("
		   },
		   {
			"id": 4790,
			"surah": 53,
			"ayat": 6,
			"tafsir": "Allah swt explains in this verse, that Jibril has extraordinary strength. As in history, he once overturned the settlements of the Prophet Lut, then they were lifted up to the sky and then dropped to the earth. He has never blown the Samud people to fly. And when he descends to earth it only takes a blink of an eye. After all, he can change shape to be like a human. ("
		   },
		   {
			"id": 4791,
			"surah": 53,
			"ayat": 7,
			"tafsir": "After that Muhammad saw Gabriel in a high place. Then Jibril filled the sky, then approached Muhammad saw and Gabriel got closer to Muhammad saw until he was almost, about two more arrowheads or closer."
		   },
		   {
			"id": 4792,
			"surah": 53,
			"ayat": 8,
			"tafsir": "After that Muhammad saw Gabriel in a high place. Then Jibril filled the sky, then approached Muhammad saw and Gabriel got closer to Muhammad saw until he was almost, about two more arrowheads or closer."
		   },
		   {
			"id": 4793,
			"surah": 53,
			"ayat": 9,
			"tafsir": "After that Muhammad saw Gabriel in a high place. Then Jibril filled the sky, then approached Muhammad saw and Gabriel got closer to Muhammad saw until he was almost, about two more arrowheads or closer."
		   },
		   {
			"id": 4794,
			"surah": 53,
			"ayat": 10,
			"tafsir": "It was further explained that after the Prophet Muhammad had become close to Gabriel, Jibril conveyed Allah's revelation regarding religious matters."
		   },
		   {
			"id": 4795,
			"surah": 53,
			"ayat": 11,
			"tafsir": "This verse explains that most people think that he has described what he saw, even though his heart is not yet sure of what he has seen, this is not the case in Muhammad's vision and belief in Jibril, even though his coming to Muhammad is often different in form, because Muhammad saw already knew original form. Because Allah swt corroborates the statement that the arrival of Jibril disguised in the form of a friend named Dihyah al-Kalbi does not remove his characteristics because Muhammad saw his original form before that, namely in the Cave of Hira when he received the first revelation, although later Jibril appeared again in another way."
		   },
		   {
			"id": 4796,
			"surah": 53,
			"ayat": 12,
			"tafsir": "In this verse, Allah asked whether the people of Quraysh would deny and dispute Muhammad about the form of Gabriel that Muhammad had seen with his own eyes. ("
		   },
		   {
			"id": 4797,
			"surah": 53,
			"ayat": 13,
			"tafsir": "Furthermore, in these verses Allah explains that in fact Muhammad saw Jibril (for the second time) in his original form when he was mi'raj to Sidratul Muntaka, a place which is a natural boundary that can be known by angels. There are those who argue that the meaning of this verse is as in the word of Allah: And verily to your Lord is the end (of everything). (an-Najm\/53: 42) Every believer must believe that Sidratul Muntaha is as explained by Allah in His verses. But he is not allowed to explain his place and its characteristics, with information that exceeds what Allah has explained in the Qur'an, unless we get that information from the hadith of the Prophet Muhammad who explained it to us clearly and definitely, because it is included in the occult that we have not been allowed to know. According to the hadith narrated by Ahmad, Muslim, atTirmidhi, and others that Sidratul Muntaka is in the seventh heaven."
		   },
		   {
			"id": 4798,
			"surah": 53,
			"ayat": 14,
			"tafsir": "Furthermore, in these verses Allah explains that in fact Muhammad saw Jibril (for the second time) in his original form when he was mi'raj to Sidratul Muntaka, a place which is a natural boundary that can be known by angels. There are those who argue that the meaning of this verse is as in the word of Allah: And verily to your Lord is the end (of everything). (an-Najm\/53: 42) Every believer must believe that Sidratul Muntaha is as explained by Allah in His verses. But he is not allowed to explain his place and its characteristics, with information that exceeds what Allah has explained in the Qur'an, unless we get that information from the hadith of the Prophet Muhammad who explained it to us clearly and definitely, because it is included in the occult that we have not been allowed to know. According to the hadith narrated by Ahmad, Muslim, atTirmidhi, and others that Sidratul Muntaka is in the seventh heaven."
		   },
		   {
			"id": 4799,
			"surah": 53,
			"ayat": 15,
			"tafsir": "In this verse, Allah SWT explains that it is in that place (near Sidratul Muntaka) that heaven is located. It is a place of residence for those who are pious and those who are martyred."
		   },
		   {
			"id": 4800,
			"surah": 53,
			"ayat": 16,
			"tafsir": "Furthermore, in this verse, Allah swt explains that Muhammad saw Jibril in Sidratul Muntaka when Sidratul Muntaha was covered by an atmosphere that signifies the greatness of Allah in the form of beautiful rays and angels. The Qur'an does not explain clearly. For us, such an explanation is sufficient, not adding or subtracting it if there is no clear argument that explains it. If there is a benefit to be explained surely it will be explained by Allah swt."
		   },
		   {
			"id": 4801,
			"surah": 53,
			"ayat": 17,
			"tafsir": "Then in this verse Allah explains again that when the Messenger of Allah saw Jibril there, he did not turn away from looking at all the miracles of Sidratul Muntaka according to what Allah had allowed him to see. And he does not transgress except what has been permitted to him."
		   },
		   {
			"id": 4802,
			"surah": 53,
			"ayat": 18,
			"tafsir": "This verse explains that by seeing Sidratul Muntaka, it means that Muhammad saw some of the signs of Allah's greatness which are miracles of His power. It was narrated by al-Bukhari and others that at that time Muhammad saw a green wave from heaven that filled the horizon (direction of view). So let us not limit what Muhammad saw with his own eyes, after being vaguely explained in the Qur'an about it. What is clear is that the Prophet saw the signs of the infinite greatness of Allah."
		   },
		   {
			"id": 4803,
			"surah": 53,
			"ayat": 19,
			"tafsir": "Allah swt asked the polytheists, whether after they heard the signs of Allah both His perfection and His majesty in power, and after hearing the condition of the angels with their high positions and abilities, they still make idols that are despicable in their condition as partners to Allah, while they know His greatness? This question is a mockery of God, because it is impossible for a reasonable person to have crossed his mind to worship an idol that they made themselves, then put it in a house that they built as a rival to the Kaaba. As for al-Lata, it is the name of a large white stone, on which a stone is carved the image of a house. Al-Lata is located in the Taif area. The house was covered with curtains. Around it there is a terrace that is glorified by the Taif people, including the Saqif tribe and their followers. They are among those who are more proud of this object than other Arabs besides Quraysh. Ibn Jarir said, they thought that the word al-Lata was taken from the pronunciation of Allah. They consider al-Lata (Glory be to Allah from what they say). According to Ibn 'Abbas, Mujahid, Rabi' bin Anas, they named al-Lata after the name of a man who pounded flour for the pilgrims. After he died, people gathered together to perform Itikaf over his grave, which they then worshiped and made a statue of him. According to Ibn Jarir, al-'Uzza comes from the word 'Aziz, al-Uzza is a tree on which there is a building and a curtain, located in Nakhlah, which is between Mecca and Taif; Quraysh people glorify the tree. It is narrated that Abu Sufyan, when he was still a polytheist, said during the battle of Uhud that they had Uzza, while the others did not. So the Messenger of Allah said. \"Say! Allah is our God, and you have no God.\" (History of al-Bukhari and Ahmad)"
		   },
		   {
			"id": 4804,
			"surah": 53,
			"ayat": 20,
			"tafsir": "In this verse, Allah SWT continues the previous verse, namely that the polytheists also worship the third Manat, namely the last one, as Allah's daughter. Manat is a large rock located in Musyallal with Qudaid between Mecca and Medina. The tribes of Khuza'ah, al-Aus and Khazraj venerated this Manat and in performing their pilgrimage from Manat to the Kaaba. In addition to these three objects, there are many other objects that are highly venerated by polytheists. However, the most famous are these three objects. Ibn Ishaq said that the Arabs considered the three objects other than the Ka'bah as objects of worship, made like the building of the Ka'bah which has a veil on which they rely on it like tawaf on the Kaaba and cut the sacrificial animal beside it. They also know the glory of the Kaaba, namely that it is the house of Abraham and his mosque."
		   },
		   {
			"id": 4805,
			"surah": 53,
			"ayat": 21,
			"tafsir": "In this verse Allah rejects their assumption that He has daughters and they have sons because they think that women are weak and have deficiencies while men are perfect. This expresses their assumption that God has flaws, while those who have those flaws consider themselves perfect. ("
		   },
		   {
			"id": 4806,
			"surah": 53,
			"ayat": 22,
			"tafsir": "The division as they say in verse 21 is an unfair, inappropriate and imperfect division because they think that their God has things that they themselves hate. And for them whatever they like"
		   },
		   {
			"id": 4807,
			"surah": 53,
			"ayat": 23,
			"tafsir": "In this verse Allah explains that they named the idols God, even though those are just names that have no meaning at all. They thought and believed that these idols had the right to be used for the sake of worshiping them and as a place to offer sacrificial animals. They don't have reasons or they can't explain the reasons for what they say and do. They only imitate the people who were thereafter will be followed by their children and grandchildren. In the same verse meaning Allah says: What you worship besides Him, are only the names that you have made up both by yourself and by your ancestors. (Yusuf\/12: 40) Then Allah SWT strengthens His explanation by explaining that they have no reason except because they are kind to their fathers, who walk on the wrong path and maintain their position in society, or because of their respect for their fathers. his father. What is clear is that they worshiped these idols only following assumptions, that their forefathers were walking the right path, when in fact they were following their passions. Furthermore, Allah swt explained that they should not have deserved to do that because a warning had come, what they did at that time was a negligence and mistake. Then in this verse Allah explains that they are only following opinions, whereas Allah has sent His messengers with real truth and with clear reasons. So they should have realized their mistake. However, they still turned away from the truth. It is explained in the word of God as follows: It is as if they were wild donkeys fleeing from a lion. (al-Muddatstsir\/74: 50-51)"
		   },
		   {
			"id": 4808,
			"surah": 53,
			"ayat": 24,
			"tafsir": "So Allah swt adds in this verse do they hope for something they aspire to in the form of intercession from their gods in the hereafter? No, idols are of no use at all, they will not help anything because idols are inanimate objects as hard as rock. That all that is in this world and in the hereafter belongs to Allah, and the idols have nothing. God had made them despair of deriving good from idol worship. The idol cannot be a connecting tool to draw them closer to Allah."
		   },
		   {
			"id": 4809,
			"surah": 53,
			"ayat": 25,
			"tafsir": "So Allah swt adds in this verse do they hope for something they aspire to in the form of intercession from their gods in the hereafter? No, idols are of no use at all, they will not help anything because idols are inanimate objects as hard as rock. That all that is in this world and in the hereafter belongs to Allah, and the idols have nothing. God had made them despair of deriving good from idol worship. The idol cannot be a connecting tool to draw them closer to Allah."
		   },
		   {
			"id": 4810,
			"surah": 53,
			"ayat": 26,
			"tafsir": "Then Allah swt explained about how many angels in the sky cannot help people with any help, unless Allah gives them permission for the people He wants, namely people who are sincere in their words and deeds. If the condition of angels is like that, while angels are creatures that are close to God, then what about idols that are only inanimate objects without spirit and life? Obviously the idols are completely useless."
		   },
		   {
			"id": 4811,
			"surah": 53,
			"ayat": 27,
			"tafsir": "Allah swt explained that those who do not believe in the hereafter and what will happen in the afterlife as the messengers have conveyed; they add disbelief to their stupid words that think that angels are the daughters of God (Glory be to Allah from what they say). Allah swt branded people like that as unbelievers and as a sign that their words had reached the limit of abomination which could not have come from people who believed in reckoning and retribution. Their words contain two sins: Namely the acknowledgment that God has a child, and that the child of God they say is a girl, with such a confession they feel proud to have surpassed God, because they have a son."
		   },
		   {
			"id": 4812,
			"surah": 53,
			"ayat": 28,
			"tafsir": "This verse explains that such words are a sign that they did not receive God's guidance in the form of knowledge that led them to the right path that caused them to say such things. They are only affected by prejudice that keeps them away from the truth. In fact, true knowledge must be based on belief, not just speculation or conjecture. As for the polytheists, they only follow the presumption in naming angels as God's daughters, not with scientific analysis. In an authentic hadith it is said that the Messenger of Allah said: ) \"Avoid bad prejudices, actually bad prejudices are the most lying words.\" (Al-Bukhari and Muslim) In the same verse Allah says: And they made the angels of the Most Merciful (Allah's) servants as women. Did they witness the creation (of the angels)? Later their testimonies will be written down and they will be held accountable. (az-Zukhruf\/43: 19) Strictly speaking that something related to faith should be based on sound thinking that can be accepted by reason and does not conflict with revelation."
		   },
		   {
			"id": 4813,
			"surah": 53,
			"ayat": 29,
			"tafsir": "In this verse, Allah swt orders the Messenger of Allah to turn away from the disbelievers and polytheists who have turned their backs on the Al-Qur'an, the book of Allah, who do not want to make it their guide in life, even though they should be aware that the Al-Qur'an can guide them. to achieve happiness in this world and the hereafter. The Qur'an also contains the stories of the former peoples, their attitude towards the prophets and apostles, and the result of their defiance of the teachings of the apostles, namely a painful punishment in the hereafter. The polytheists and the disbelievers did not even take lessons from the previous people, they were self-sufficient with worldly matters. Even they are willing to be deceived by the fakes of the world and dragged into thinking only about worldly pleasures. Strictly speaking, Muhammad saw was commanded by Allah not to pay too much attention to the attitude of unbelievers who turn their backs on Allah, because they really only want worldly pleasures which are their life goals and aspirations. Under such circumstances, there is no longer any path to faith. So Allah swt ordered His messenger, Muhammad saw, to feel no pity or grieve over their situation. Because the Apostle had almost harmed himself just because he was concerned about the condition of his people who did not believe. Allah swt said: Maybe you (Muhammad) will destroy yourself (with sadness), because they (people of Mecca) do not believe. (asySyu'ara'\/26: 3) The polytheists only limit themselves to worldly life, because their knowledge is limited to worldly matters and keeps themselves busy with worldly activities. They already feel successful with the many worldly possessions they have and their high social position. They did not pay attention to the other messages conveyed by the apostles, especially about the afterlife. Their condition is such that their ears are clogged, unable to hear news about the afterlife."
		   },
		   {
			"id": 4814,
			"surah": 53,
			"ayat": 30,
			"tafsir": "Then Allah swt confirms in this verse that in fact He is All-Knowing of those who think about His signs in this universe and think about what is contained in the call of His Messenger so that he gets guidance to the path of truth that will save him on the Day of Judgment. resurrection and gain the pleasure of his Lord. He is happy in the world because he follows what has been outlined by Allah for humans who obey His commands and stay away from His prohibitions. Allah is All-Knowing of those who deviate from the right path, which has made their lusts become their god, which freezes their conscience. Allah will reward all His creatures regardless of their position in the world, according to the extent of His knowledge, prioritizing those who serve Him. Allah swt says: For those who do good, there is the best reward (heaven) and additional (the pleasure of seeing Allah). (Yunus\/10: 26)"
		   },
		   {
			"id": 4815,
			"surah": 53,
			"ayat": 31,
			"tafsir": "This verse states that everything in the heavens and on earth belongs to Allah, everything is in His hands and under His dominion. Allah made everything in the heavens and on earth, He owns it and He controls it, He knows the ins and outs of its condition. So don't people think that God will leave them alone by not repaying every human being according to his deeds. He will repay according to His knowledge which encompasses everything. Those who do good are rewarded with goodness by being put into heaven where rivers flow and give pleasure that has never crossed the human heart. He repays the bad people according to the crimes he has committed, from various things, such as shirk and immorality, because his heart is covered with big and small sins."
		   },
		   {
			"id": 4816,
			"surah": 53,
			"ayat": 32,
			"tafsir": "This verse describes the characteristics of good people, namely those who distance themselves from major sins such as shirk, murder, adultery, and so on, even though they commit minor sins which are later realized so they immediately repent while regretting their actions. -the deeds they do, they also compensate by doing many good deeds because those good deeds erase small sins. As Allah says: Good deeds erase mistakes. (Hud\/11: 114) If you stay away from major sins among the sins that are forbidden to do, We will erase your mistakes and We will enter you into a glorious place (heaven). (an-Nisa'\/4: 31) There are seven major sins, Sayidina 'Ali \"Karramallahu Wajhah\" said that as mentioned in Sahih al-Bukhari and Muslim: Stay away from the seven major destructive sins. The companions asked, \"What is that? The Prophet replied, associating partners with Allah, witchcraft, killing humans who are forbidden by Allah except by right, consuming the property of orphans, eating usury, running away from the war that was raging and accusing women of muhsanat, your gafilat.\" interest. (Al-Bukhari and Muslim history from Abu Hurairah) There are also those who stated, \"Major sins are sins that Allah threatens with hell or with His anger or with anathema, punishment or oblige certain had or punishment in the world is like qisas cutting hands, stoning and others because those who do it are not worried and do not regret their actions, even though their actions cause great damage, even though in human eyes it is a small thing.\" Furthermore, verse 32 emphasizes that Allah is Most Extensive in forgiveness Him, and He will forgive small sins if they stay away from big sins and He forgives big sins if the culprit repents, and is accompanied by regret for their sins. made, but do not despair of God's forgiveness. Allah says: Say, \"O My servants who transgress against themselves! Do not despair of Allah's mercy. Verily Allah forgives all sins. Indeed, He is the Most Forgiving, Most Merciful. (azZumar\/39) : 53) The next verse explains that Allah swt knows better about human circumstances, actions, and speech when He made man from clay and when He formed his image in his mother's womb, from one stage to another. So no one should say he is pure. who knows best about people who are pious. If you are aware of that, then do not commend himself as pure from sin or pure from immoral acts or doing a lot of good, but let humans give thanks to Allah a lot for the abundance of gifts and His forgiveness. Allah All-Knowing who is clean from evil and who plunges himself into evil and smears himself with it a sin. In fact, the prohibition against purifying oneself only applies if what drives a person to do so is riya', arrogance or pride. Apart from the reasons above, self-purification is not forbidden, it is even recommended. In another verse Allah says: Do you not pay attention to those who consider themselves holy (Jews and Christians)? Actually Allah purifies whom He wills and they are not wronged in the slightest. (an-Nisa'\/4: 49)"
		   },
		   {
			"id": 4817,
			"surah": 53,
			"ayat": 33,
			"tafsir": "According to Mujahid and Ibn Zaid, this verse was revealed in the event of al-Walid bin al-Mugirah, he had heard the Prophet's reading and always accompanied him and received advice from him so that his heart was attracted to Islam and the Prophet also hoped for his faith. It so happened that a polytheist who knew about al-Walid criticized him, saying, \"Are you going to leave the religion of your forefathers? Go back to your religion and stick to it! I will bear everything that worries you in the afterlife, in exchange for you giving me something.\" Al-Walid agreed to this invitation, then he withdrew his desire to embrace Islam. Thus he becomes a real heretic and he has surrendered part of the reward he agreed to to the person he promised and withheld the other part. Al-Walid was about to become a believer and followed the instructions of the apostle, then one of the human demons tempted him so that he would not accept the persuasion, and invited him to return to the religion of his ancestors. A person will bear his sins if al-Walid bin al-Mugirah is willing to donate a little of his wealth. He accepted the idea, but he only gave it once, and nothing after that. Does he know something unseen, that his friend can bear the sins he fears on the Day of Resurrection? It was emphasized that the previous Shari'a did not justify the bearing of sins by other people."
		   },
		   {
			"id": 4818,
			"surah": 53,
			"ayat": 34,
			"tafsir": "According to Mujahid and Ibn Zaid, this verse was revealed in the event of al-Walid bin al-Mugirah, he had heard the Prophet's reading and always accompanied him and received advice from him so that his heart was attracted to Islam and the Prophet also hoped for his faith. It so happened that a polytheist who knew about al-Walid criticized him, saying, \"Are you going to leave the religion of your forefathers? Go back to your religion and stick to it! I will bear everything that worries you in the afterlife, in exchange for you giving me something.\" Al-Walid agreed to this invitation, then he withdrew his desire to embrace Islam. Thus he becomes a real heretic and he has surrendered part of the reward he agreed to to the person he promised and withheld the other part. Al-Walid was about to become a believer and followed the instructions of the apostle, then one of the human demons tempted him so that he would not accept the persuasion, and invited him to return to the religion of his ancestors. A person will bear his sins if al-Walid bin al-Mugirah is willing to donate a little of his wealth. He accepted the idea, but he only gave it once, and nothing after that. Does he know something unseen, that his friend can bear the sins he fears on the Day of Resurrection? It was emphasized that the previous Shari'a did not justify the bearing of sins by other people."
		   },
		   {
			"id": 4819,
			"surah": 53,
			"ayat": 35,
			"tafsir": "According to Mujahid and Ibn Zaid, this verse was revealed in the event of al-Walid bin al-Mugirah, he had heard the Prophet's reading and always accompanied him and received advice from him so that his heart was attracted to Islam and the Prophet also hoped for his faith. It so happened that a polytheist who knew about al-Walid criticized him, saying, \"Are you going to leave the religion of your forefathers? Go back to your religion and stick to it! I will bear everything that worries you in the afterlife, in exchange for you giving me something.\" Al-Walid agreed to this invitation, then he withdrew his desire to embrace Islam. Thus he becomes a real heretic and he has surrendered part of the reward he agreed to to the person he promised and withheld the other part. Al-Walid was about to become a believer and followed the instructions of the apostle, then one of the human demons tempted him so that he would not accept the persuasion, and invited him to return to the religion of his ancestors. A person will bear his sins if al-Walid bin al-Mugirah is willing to donate a little of his wealth. He accepted the idea, but he only gave it once, and nothing after that. Does he know something unseen, that his friend can bear the sins he fears on the Day of Resurrection? It was emphasized that the previous Shari'a did not justify the bearing of sins by other people."
		   },
		   {
			"id": 4820,
			"surah": 53,
			"ayat": 36,
			"tafsir": "In this verse it is explained about the stipulations of the Shari'a of Abraham who had carried out the tasks assigned to him, had delivered his message according to what was meant by the verse: And (remember), when Abraham was tested by his Lord with a few sentences, then he carried it out perfectly. . He (Allah) said, \"Verily I have made you a leader for all mankind.\" (al-Baqarah\/2: 124) Ibn 'Abbas stated, Ibrahim had carried out all the Islamic ideas of which there were thirty as many as never been carried out by other prophets, namely the ten ideas in surahh at-Taubah\/9 verses 111 and 112. In In the first verse there is only one kind of idea, namely fighting in the way of Allah and then he kills or is killed, while in the second verse it mentions nine types, namely people who repent, who worship, who praise (Allah), who wander (for the sake of Islam), who bowing, prostrate, who orders to do good and prevent doing wrong and who keeps the laws of Allah. Ten in surahh al-Ahzab\/33, in verse 35, namely Muslim men and women, believing men and women, humble men and women, men and women who give alms, men and women who fast, men and women who maintain their honor, men and women who chant (name) Allah a lot. There are six types in surahh al-Mu'minun\/23 from verse 2 to verse 9, namely: people who are humble in prayer, people who keep away from (actions and words) that are useless, people who pay zakat, people who guard their genitals , except for their wives or the slaves they own, they are not reprehensible in this matter. Whoever seeks what is behind it, they are people who exceed the limits, and people who keep the mandate (which they carry) and promises, people who keep their prayers. There are four kinds in surahh al-Ma'arij\/70, starting from verse 26 to verse 33; those who believe in the Day of Judgment, those who are afraid of the punishment of their Lord, because in fact the punishment of their Lord cannot be secure for anyone (from its arrival), those who guard their private parts, except for their wives or the slaves they have, then they are in this case there is nothing reprehensible. Whoever seeks what is behind it, then they are the people who transgress the limits, the people who keep the mandates (which they carry) and their promises and the people who give their testimony. Ibrahim was made special with these qualities, because of the severity of the ordeal he had experienced when an order was made to slaughter his son Ismail, the story of which was clear. As for the reason for mentioning only the Shari'a of these two Prophets, because the polytheists claim that they are followers of Abraham, while the People of the Book claim that they are followers of the Torah and its pages which are close to their time. Then Allah reveals the contents of the two Shari'a in the following verses 38 and 39."
		   },
		   {
			"id": 4821,
			"surah": 53,
			"ayat": 37,
			"tafsir": "In this verse it is explained about the stipulations of the Shari'a of Abraham who had carried out the tasks assigned to him, had delivered his message according to what was meant by the verse: And (remember), when Abraham was tested by his Lord with a few sentences, then he carried it out perfectly. . He (Allah) said, \"Verily I have made you a leader for all mankind.\" (al-Baqarah\/2: 124) Ibn 'Abbas stated, Ibrahim had carried out all the Islamic ideas of which there were thirty as many as never been carried out by other prophets, namely the ten ideas in surahh at-Taubah\/9 verses 111 and 112. In In the first verse there is only one kind of idea, namely fighting in the way of Allah and then he kills or is killed, while in the second verse it mentions nine types, namely people who repent, who worship, who praise (Allah), who wander (for the sake of Islam), who bowing, prostrate, who orders to do good and prevent doing wrong and who keeps the laws of Allah. Ten in surahh al-Ahzab\/33, in verse 35, namely Muslim men and women, believing men and women, humble men and women, men and women who give alms, men and women who fast, men and women who maintain their honor, men and women who chant (name) Allah a lot. There are six types in surahh al-Mu'minun\/23 from verse 2 to verse 9, namely: people who are humble in prayer, people who keep away from (actions and words) that are useless, people who pay zakat, people who guard their genitals , except for their wives or the slaves they own, they are not reprehensible in this matter. Whoever seeks what is behind it, they are people who exceed the limits, and people who keep the mandate (which they carry) and promises, people who keep their prayers. There are four kinds in surahh al-Ma'arij\/70, starting from verse 26 to verse 33; those who believe in the Day of Judgment, those who are afraid of the punishment of their Lord, because in fact the punishment of their Lord cannot be secure for anyone (from its arrival), those who guard their private parts, except for their wives or the slaves they have, then they are in this case there is nothing reprehensible. Whoever seeks what is behind it, then they are the people who transgress the limits, the people who keep the mandates (which they carry) and their promises and the people who give their testimony. Ibrahim was made special with these qualities, because of the severity of the ordeal he had experienced when an order was made to slaughter his son Ismail, the story of which was clear. As for the reason for mentioning only the Shari'a of these two Prophets, because the polytheists claim that they are followers of Abraham, while the People of the Book claim that they are followers of the Torah and its pages which are close to their time. Then Allah reveals the contents of the two Shari'a in the following verses 38 and 39."
		   },
		   {
			"id": 4822,
			"surah": 53,
			"ayat": 38,
			"tafsir": "One person will not shoulder the sins of others. Everyone who commits a sin because of his disbelief or because of his disobedience, he himself will bear the sin, and no one else will. And if someone who is burdened with the weight of his sins calls (another person) to carry his burden it will not be borne in the least, even if (the one he calls is) his relatives. (Fathir\/35: 18)"
		   },
		   {
			"id": 4823,
			"surah": 53,
			"ayat": 39,
			"tafsir": "For good deeds, humans only get rewards from their own efforts, so they are not entitled to the reward for an act that they did not do. From this verse, Imam Malik and Imam Syafi'i understand that it is illegal to give the reward of the living's deeds in the form of reading the Qur'an to the dead, because it was not their actions and their efforts. The same goes for all bodily worship, such as prayers, pilgrimage and recitations, because the Prophet never said this to the people, never ordered it satirically or through texts and neither did his companions convey it to us. If the action was good, they would have done it first. As for alms, the reward goes to the dead, as Muslim and al-Bukhari narrated from Abu Hurairah, that the Prophet said: When a child of Adam dies, all the deeds (which reward him) are cut off, except for three things, children the pious who pray to him, alms jariah (waqf) afterward and the knowledge that can be benefited. (Muslim history from Abu Hurairah) In fact, all of this includes a person's efforts, his efforts, as stated in the hadith: Verily, the best that a person eats is the result of his own efforts and that of his children, including his efforts as well. (History of an Nasa'i and Ibnu hibban) Alms jariah like endowments are the traces of their efforts, Allah said: Indeed, it is We who revive the dead, and We are the ones who record what they have done and the traces they (leave). (Yasin\/36: 12) Knowledge that is disseminated then people follow it and practice it, including their business. And has been narrated, among others, an authentic hadith: َThe one who invites to a clue, he will have a reward similar to the reward of those who follow the instructions, without reducing the reward of those who follow him in the least. (Muslim history) Imam Ahmad bin Hanbal and most of the Shafi'i followers are of the opinion that the reward of reading goes to the dead, if the reading is not paid for with wages. But if the recitation is paid for, as is common now, then the reward does not extend to the dead, because it is forbidden to take a fee to read the Qur'an, although it is permissible to take a fee to teach it. Included in acts of worship whose rewards reach other people are prayer and alms . ("
		   },
		   {
			"id": 4824,
			"surah": 53,
			"ayat": 40,
			"tafsir": "One's deeds will be shown on Mahsyar day so that everyone will be able to see it. This means respect for the good and contempt for the bad. And say, \"Work you, then Allah will see your work, so will His Messenger and the believers, and you will be returned to (Allah) Who Knows the unseen and the real, then He will inform you of what you have learned. do.\" (at-Taubah\/9: 105)"
		   },
		   {
			"id": 4825,
			"surah": 53,
			"ayat": 41,
			"tafsir": "This verse states that Allah will repay a person's deeds with a more perfect reward by multiplying his good deeds, and repaying a crime with something similar or being forgiven. Inform My servants that I am the Most Forgiving, the Most Merciful, and indeed My punishment is a very painful punishment. (al-hijr\/15: 49-50)"
		   },
		   {
			"id": 4826,
			"surah": 53,
			"ayat": 42,
			"tafsir": "Allah places everything back on the Day of Resurrection and He will give account of the small and the big, then He will reward or punish them according to their respective deeds. This verse is a strong warning to the bad people, and a subtle persuasion to the good people and a consolation to the Prophet Muhammad, as he said: So do not let their words make you (Muhammad) grieve. Indeed, We know what they conceal and what they reveal. (Yasin\/36: 76)"
		   },
		   {
			"id": 4827,
			"surah": 53,
			"ayat": 43,
			"tafsir": "It is Allah who makes people laugh and cry and the reasons for that. That is, He who makes people happy because of their good deeds, and He who causes people to be sad, cry and concerned because of their actions, namely actions that are pleasant or troublesome."
		   },
		   {
			"id": 4828,
			"surah": 53,
			"ayat": 44,
			"tafsir": "In this verse, Allah confirms that it is He who causes death and life because He is a substance capable of bringing life, death and life back to life. Who created death and life, to test you, which of you is better in deed. And He is Mighty, Most Forgiving. (al-Mulk\/67: 2)"
		   },
		   {
			"id": 4829,
			"surah": 53,
			"ayat": 45,
			"tafsir": "It was God who created male and female from \"semen ejaculated into the womb.\" Then he exhaled the spirit, so that it was alive and moving. Verse 45 again explains about the duality of creation. The description can be seen in several previous verses, such as: Yasin\/36: 36; ar-Ra'd\/13: 3; asy-Syu'ara'\/26: 7; and adhdzariyat\/51: 49. Verse 46 explains the creation of humans that came from a male and female pair, as stated in several previous verses. Semen as one of the life-forming components is described in passing. The explanation can be found in several descriptions in verses, such as, alhajj\/22: 5; al-Mu'minun\/23: 13-14; and Fathir\/35: 11. These verses have described in great detail the stages in the process of human embryo development. Even regarding the semen itself, it is explained, among other things, in the verses of as-Sajdah\/32: 7-9. The next explanation, which is very scientific, is found in the explanation from surahh ath-thariq\/86: 6-7 and al-Insan\/76: 2."
		   },
		   {
			"id": 4830,
			"surah": 53,
			"ayat": 46,
			"tafsir": "It was God who created male and female from \"semen ejaculated into the womb.\" Then he exhaled the spirit, so that it was alive and moving. Verse 45 again explains about the duality of creation. The description can be seen in several previous verses, such as: Yasin\/36: 36; ar-Ra'd\/13: 3; asy-Syu'ara'\/26: 7; and adhdzariyat\/51: 49. Verse 46 explains the creation of humans that came from a male and female pair, as stated in several previous verses. Semen as one of the life-forming components is described in passing. The explanation can be found in several descriptions in verses, such as, alhajj\/22: 5; al-Mu'minun\/23: 13-14; and Fathir\/35: 11. These verses have described in great detail the stages in the process of human embryo development. Even regarding the semen itself, it is explained, among other things, in the verses of as-Sajdah\/32: 7-9. The next explanation, which is very scientific, is found in the explanation from surahh ath-thariq\/86: 6-7 and al-Insan\/76: 2."
		   },
		   {
			"id": 4831,
			"surah": 53,
			"ayat": 47,
			"tafsir": "It is God who revives humans after death to repay those who do good or evil according to what they have done"
		   },
		   {
			"id": 4832,
			"surah": 53,
			"ayat": 48,
			"tafsir": "Allah who gives wealth or poverty to those He wants among His servants, according to the ability and effort of each. This verse shows perfect power, that nutfah (a drop of sperm) is according to its parts according to reality. From this nutfah Allah made various members, different characters and male or female, so no one claims to be able to make it, just as no one claims to have made the heavens and the earth apart from Allah. And indeed, if you (Muhammad) ask them, \"Who created the heavens and the earth?\" Of course they will answer, \"God.\" (Luqman\/31: 25) Does man think he will be left alone (without accountability)? Wasn't he originally just a drop of semen that was shed (into the womb), then (the semen) became something that was attached, then Allah created it and perfected it, then He made from it a male and a female pair. Isn't (God who does) so powerful (also) to bring the dead back to life? (al-Qiyamah\/75: 36-40)"
		   },
		   {
			"id": 4833,
			"surah": 53,
			"ayat": 49,
			"tafsir": "In this verse Allah states that He is the Lord who owns the star Shi'ra, which is very resplendent, which rises together with the star Jauza' in the middle of summer. Specializing in the designation of this star from other celestial planets which are bigger and more resplendent, because this star was worshiped during the Jahiliyah era, the Himyar and Khuza'ah tribes worshiped it. The first person to hold this worship was Abu Kabsyah. He was the ruler of the Arab nation, so that the Quraysh said that the Prophet Muhammad was the son of Abu Kabsyah, as a similarity because he differed in terms of the principles of his religion from the religion of their ancestors. Abu Kabsyah is one of the Prophet Muhammad's grandmothers, from his mother's side. As Abu Sufyan said when he was in the presence of Heraclius who became the Roman Magister, \"There has really become a big problem with this son of Abu Kabsyah (the Prophet). Among the Arabs there are those who worship the stars and acknowledge their influence on the universe and they talk about the problem -problems that are unseen when the star rises. There are two Shi'ra stars, one of which is next to Sham (Palestine) and the other is next to Yemen. This statement is what is meant here who is worshiped besides Allah."
		   },
		   {
			"id": 4834,
			"surah": 53,
			"ayat": 50,
			"tafsir": "Allah who destroyed the first 'Ad people was the Prophet Hud's people, and what is meant by the second 'Ad people were Iram bin Sam bin Nuh. Do you not (Muhammad) pay attention to how your Lord treats 'Ad? (namely) residents of Iram (the capital of 'Ad) who have high buildings, which have never been built (a city) like that in other countries. (al-Fajr\/89: 6-8) The people of 'Ad are a group of people who are very strong and do a lot of disobedience to Allah and His Messenger, Then Allah destroyed them with a very cold and strong wind, Allah brought the wind on them for seven nights and seven days continuously. ("
		   },
		   {
			"id": 4835,
			"surah": 53,
			"ayat": 51,
			"tafsir": "Allah destroyed the Samud people and did not let them live, they were even tortured with God's terrible punishment, in the same verse Allah said: So do you see anyone left among them? (al-haqqah\/69: 8)"
		   },
		   {
			"id": 4836,
			"surah": 53,
			"ayat": 52,
			"tafsir": "Allah destroyed the people of Noah before the people of 'Ad and Samud. They are more unjust than these two people, because they are the first to commit tyranny and iniquity while the most unjust, according to the hadith of the Prophet, \"Whoever commits an evil deed, he bears his sin.\" The people of Noah were more disobedient than the people of 'Ad and Samud, because they had transgressed their limits, even though they had long heard the call of Noah, but they remained disobedient so that Noah ran out of patience and prayed for their destruction. And Noah said, \"O my Lord, do not let any of the disbelievers live on the earth. (Nuh\/71: 26) There was a father who took his son to go to Noah to warn him while saying to his son, \"O my child! My father used to bring me to this man, as I have brought you now. Watch out, you don't believe it!\" The father died in his disbelief while his young son lived on his father's will, so that Noah's call to teach people to have faith no longer affected the child."
		   },
		   {
			"id": 4837,
			"surah": 53,
			"ayat": 53,
			"tafsir": "Allah has annihilated the people of Lut by turning their country upside down and sent down their doom in the form of a rain of burning stones, while showering them with stones from the burning ground, one after another. In another verse with the same meaning Allah says: And We rained on them (with rain of stones), so how bad is the rain that befalls those who have been warned. (asy-Syu'ara'\/26: 173) This is what Allah wills with His words, \"Allah will inflict on their land the punishment that befalls them.\" Disclosure of the situation with these words shows the greatness of the punishment that befell them because Allah turned Him upside down, the top became the bottom and the bottom became the top. This clear and obvious explanation could not convince them, even made them doubt, they laughed at it, even though the Prophet Muhammad constantly warned them. Actually they should weep over their mistakes and negligence and bow down to Allah."
		   },
		   {
			"id": 4838,
			"surah": 53,
			"ayat": 54,
			"tafsir": "Allah has annihilated the people of Lut by turning their country upside down and sent down their doom in the form of a rain of burning stones, while showering them with stones from the burning ground, one after another. In another verse with the same meaning Allah says: And We rained on them (with rain of stones), so how bad is the rain that befalls those who have been warned. (asy-Syu'ara'\/26: 173) This is what Allah wills with His words, \"Allah will inflict on their land the punishment that befalls them.\" Disclosure of the situation with these words shows the greatness of the punishment that befell them because Allah turned Him upside down, the top became the bottom and the bottom became the top. This clear and obvious explanation could not convince them, even made them doubt, they laughed at it, even though the Prophet Muhammad constantly warned them. Actually they should weep over their mistakes and negligence and bow down to Allah."
		   },
		   {
			"id": 4839,
			"surah": 53,
			"ayat": 55,
			"tafsir": "Allah states in the form of a question to humans about which of His favors, which are still in doubt, in the following verses have the same meaning. O people! What has deceived you (acted disobedience) against your Lord, the Most Glorious. (al-Infithar\/82: 6) But humans are indeed the ones who argue the most. (al-Kahf\/18: 54) So which of the favors of your Lord do you deny? (arRahman\/55: 16) In essence, the calamity that befalls can bring people to awareness for those who pay attention to it. All these favors are clear proof of the Oneness of Allah."
		   },
		   {
			"id": 4840,
			"surah": 53,
			"ayat": 56,
			"tafsir": "This verse states that in fact the Prophet Muhammad with his Qur'an is a warner against people who deviate from His instructions by following the desires that lead to accidents in this world and the hereafter. The Prophet Muhammad, like the previous apostles, delivered an appeal to humans, but some people denied His apostleship, so Allah destroyed and punished them according to their lies and their denial of the blessings that continue to come from God, in the verse the other: He is nothing but a warner for you before (facing) a severe punishment.\" (Saba'\/34: 46) In the hadith of the Prophet that has something to do with this verse, namely: I am a warner who is not clothed. (Riwayat al -Bukhari and Muslim) That is, because they were in a hurry to see evil, so they did not have time to wear clothes, they left to remind their people. It can also mean plain and firm. ("
		   },
		   {
			"id": 4841,
			"surah": 53,
			"ayat": 57,
			"tafsir": "This verse explains that the Day of Judgment is near and hell is available, every human being will receive a reward according to his deeds, so be careful, so that you are not among those who perish, that is, on a useless day. At that time, wealth and children, except for those who came to God with a clean heart on that day, a family member could not benefit any other family members and they did not receive any help. If the Day of Judgment occurs, its occurrence cannot be denied (denied). (al-Waqi'ah\/56: 1-2) And it is stated in the hadith: My Apostle compared to the Day of Judgment is like these two, and he divorced between the two children the middle and forefinger. (Ahmad's history"
		   },
		   {
			"id": 4842,
			"surah": 53,
			"ayat": 58,
			"tafsir": "This verse explains that no one knows when the Day of Judgment will come apart from Allah, so be prepared to face that day before it comes suddenly, in a situation you don't expect. You will regret pointless mistakes, therefore, do good deeds while there is still a chance to do good deeds. This verse reveals three basic types of religion, namely: 1. The oneness of Allah based on His word; then with the favor of your Lord which one do you doubt? 2. Confirmation of the Prophet Muhammad's apostolate, with his words; This (Muhammad) is a warner. 3. Confirmation of the gathering and resurrection on the Day of Judgment with His word; the Day of Judgment is near."
		   },
		   {
			"id": 4843,
			"surah": 53,
			"ayat": 59,
			"tafsir": "This verse is expressed in the form of a question, meaning: Is it appropriate for you, after this clear explanation, that people should be amazed at the Qur'an, while the Qur'an guides you to the right path and directs you to the straight path; or you still look down on him with scorn and turn away from him. Al-Baihaqi in the Book of Syu'abul Iman narrated from Abu Hurairah, he said, \"When Allah's word came down, 'then did you feel surprised at this news?' Suffah experts cry until their tears run down their cheeks. And when the Prophet Muhammad saw their weeping he wept, then we wept because of his weeping, saying: Those who weep for fear of Allah will not enter hell and will not enter paradise those who continue to do immoral acts And if people -people do not commit sins, Allah will bring people who sin, then they repent, then Allah forgives them. (Al-Baihaqi History) Then Allah stated the obligation to exalt and be humble' when hearing the Qur'an, as Allah says: And they lowered their faces while weeping and they became more solemn. (al-Isra'\/17: 109)"
		   },
		   {
			"id": 4844,
			"surah": 53,
			"ayat": 60,
			"tafsir": "This verse is expressed in the form of a question, meaning: Is it appropriate for you, after this clear explanation, that people should be amazed at the Qur'an, while the Qur'an guides you to the right path and directs you to the straight path; or you still look down on him with scorn and turn away from him. Al-Baihaqi in the Book of Syu'abul Iman narrated from Abu Hurairah, he said, \"When Allah's word came down, 'then did you feel surprised at this news?' Suffah experts cry until their tears run down their cheeks. And when the Prophet Muhammad saw their weeping he wept, then we wept because of his weeping, saying: Those who weep for fear of Allah will not enter hell and will not enter paradise those who continue to do immoral acts And if people -people do not commit sins, Allah will bring people who sin, then they repent, then Allah forgives them. (Al-Baihaqi History) Then Allah stated the obligation to exalt and be humble' when hearing the Qur'an, as Allah says: And they lowered their faces while weeping and they became more solemn. (al-Isra'\/17: 109)"
		   },
		   {
			"id": 4845,
			"surah": 53,
			"ayat": 61,
			"tafsir": "This verse is expressed in the form of a question, meaning: Is it appropriate for you, after this clear explanation, that people should be amazed at the Qur'an, while the Qur'an guides you to the right path and directs you to the straight path; or you still look down on him with scorn and turn away from him. Al-Baihaqi in the Book of Syu'abul Iman narrated from Abu Hurairah, he said, \"When Allah's word came down, 'then did you feel surprised at this news?' Suffah experts cry until their tears run down their cheeks. And when the Prophet Muhammad saw their weeping he wept, then we wept because of his weeping, saying: Those who weep for fear of Allah will not enter hell and will not enter paradise those who continue to do immoral acts And if people -people do not commit sins, Allah will bring people who sin, then they repent, then Allah forgives them. (Al-Baihaqi History) Then Allah stated the obligation to exalt and be humble' when hearing the Qur'an, as Allah says: And they lowered their faces while weeping and they became more solemn. (al-Isra'\/17: 109)"
		   },
		   {
			"id": 4846,
			"surah": 53,
			"ayat": 62,
			"tafsir": "This verse instructs humans to submit and worship Allah sincerely, because Allah sent down the Qur'an to humans through His Messenger, whose job is to give guidance and bring good news. Let people welcome the Qur'an by leaving the worship of idols that do not bring benefits."
		   }
	]
}
