{
	"tafseer": [
		{
			"id": 6222,
			"surah": 112,
			"ayat": 1,
			"tafsir": "In this verse, Allah ordered the Prophet Muhammad to answer the questions of people who asked about the nature of his Lord, that He is Allah, the One and only, unordered and unnumbered, because being multiplied in the composition of matter means that the part of the collection requires another part, while Allah absolutely nothing needed. The oneness of Allah includes three things: He is One in His Essence, One in His attributes and One in His actions. Almighty in His substance means that His substance is not composed of several substances or parts. Almighty in His nature means that there is not a single creature that equals Him and Almighty in His actions means that He is the one who makes all actions according to His words: Indeed, His business, if He wills something, He only says to him, \" Be!\" Then be that something. (Yasin\/36 : 82)"
		   },
		   {
			"id": 6223,
			"surah": 112,
			"ayat": 2,
			"tafsir": "Allah added in this verse an explanation about the nature of God Almighty, that is, He is the God of asking and supplicating."
		   },
		   {
			"id": 6224,
			"surah": 112,
			"ayat": 3,
			"tafsir": "Allah then confirmed that He is Most Holy from having children. This verse also contradicts the accusations of the Arab polytheists who say that angels are the daughters of Allah and the accusations of the Christians that Jesus is the son of Allah. In another verse, Allah says: So ask (Muhammad) to them (the disbelievers of Mecca), \"Are the daughters for your Lord while they are the sons?\" Or did We create angels in the form of women while they witnessed (it)? Remember, among their lies they actually said, \"God had a son.\" And really, they are total liars. (as-saffat\/37: 149-152) Allah is not begotten, nor begotten. Thus, He is not the same as creatures. He is not preceded by nothing. Glory be to Allah from what they say. Ibn 'Abbas said, \"He did not have children as Maryam gave birth to Isa and was not begotten. This is a rebuttal against the Christians who say Isa al-Masih is the son of Allah and a rebuttal against the Jews who say Uzair is the son of Allah."
		   },
		   {
			"id": 6225,
			"surah": 112,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains again that there is no one who is equal and comparable to Him in His substance, nature and deeds. This is a challenge to people who believe that there is someone who is equal to and resembles Allah in their actions, as is the case with the Arab polytheists who say that angels are partners with Allah."
		   }
	]
}
