{
	"tafseer": [
		{
			"id": 5623,
			"surah": 77,
			"ayat": 1,
			"tafsir": "In this verse, Allah swears by the angels who spread goodness. Al-Mursalat (sent angels) are angels whose job is to convey divine favors or gifts to a people or to bring torment to other groups who deserve them. Some scholars interpret al-mursalat as the wind that blows continuously in all directions at the behest of God to spread mercy and favors to this world."
		   },
		   {
			"id": 5624,
			"surah": 77,
			"ayat": 2,
			"tafsir": "Allah also swears by the wind that blows hard. There are also those who interpret al-'aikat with angels who keep away from evil, just as a strong wind that blows away piles of dirt or dust on a rock. Others interpret it as the wind scattering rainwater."
		   },
		   {
			"id": 5625,
			"surah": 77,
			"ayat": 3,
			"tafsir": "Furthermore, Allah swears by the angels who spread His mercy as wide as possible. There are various tafsirs of the word an-nasyirat here. Some interpret it as an angel who spreads death on people whose death is determined without the slightest knowledge. There are also those who interpret it with angels who spread and spread God's laws to all of His prophets and messengers."
		   },
		   {
			"id": 5626,
			"surah": 77,
			"ayat": 4,
			"tafsir": "Allah also swears by the angels who distinguish between right and wrong as clearly as possible, distinguishing between guidance and error. Some commentators interpret al-fariqat with the wind which can distinguish which one brings mercy and which one has the task of destroying many people. In other words, winds of mercy and winds of disaster."
		   },
		   {
			"id": 5627,
			"surah": 77,
			"ayat": 5,
			"tafsir": "In this verse, Allah swears by an angel who is in charge of bringing revelations to the prophets and messengers. However, as in the previous verses, there are those who interpret this al-mulqiyat as the wind that sends down warnings of Allah's disaster to humans."
		   },
		   {
			"id": 5628,
			"surah": 77,
			"ayat": 6,
			"tafsir": "In this verse it is emphasized that the coming of revelation to the prophets brought by angels is to convey reasons to refute the disbelief of polytheists in the existence of the resurrection day, and to threaten them with a painful punishment if they disobey God's commands."
		   },
		   {
			"id": 5629,
			"surah": 77,
			"ayat": 7,
			"tafsir": "After swearing by several kinds of His creatures above, then in this verse, Allah confirms that in fact what has been promised to humans will definitely happen. What is promised is the coming of the day of resurrection, the occurrence of the apocalypse, the revival of all creatures that have died long ago, now, until those who will come and be gathered in Padang Mahsyar. All of that according to the affirmation of this verse will definitely happen!"
		   },
		   {
			"id": 5630,
			"surah": 77,
			"ayat": 8,
			"tafsir": "In this verse, Allah explains that at the time of the arrival of the Day of Judgment, the light of the stars has been removed because their sources have been destroyed, as mentioned in another verse: And when the stars fall. (at-Takwir\/81: 2)"
		   },
		   {
			"id": 5631,
			"surah": 77,
			"ayat": 9,
			"tafsir": "It is also said that if the sky is shattered into pieces due to a very powerful earthquake shaking due to the celestial objects colliding with each other. Thus several other verses tell the same thing, namely: And (remember) on the day (when) the sky was broken and issued a white mist and the angels were sent down (in) waves. (al-Furqan\/25: 25)"
		   },
		   {
			"id": 5632,
			"surah": 77,
			"ayat": 10,
			"tafsir": "This verse mentions that the mountains are crushed to dust. In another verse, it is mentioned that the arrival of the Day of Judgment will cause mountains to fly like cotton or wool tossed by the wind or crushed as much as possible. Allah's Word: And they ask you (Muhammad) about the mountains, then say, \"My Lord will destroy them (on the Day of Judgment) as much as possible.\" (thaha\/20:105)"
		   },
		   {
			"id": 5633,
			"surah": 77,
			"ayat": 11,
			"tafsir": "In this verse it is emphasized that with the coming of the Day of Judgment, the prophets and messengers will be gathered together with their respective peoples. The aim is that the prophets and apostles are given the opportunity to account for their prophetic and apostolic missions before Allah and his people as witnesses. And what (the condition of the disbelievers will be), if We bring a witness (Rasul) from every nation and We bring you (Muhammad) as a witness over them. (an-Nisa'\/4: 41)"
		   },
		   {
			"id": 5634,
			"surah": 77,
			"ayat": 12,
			"tafsir": "This verse emphasizes that until when will the affairs of the people and their messengers be suspended, so that those who disbelieve must be punished or humiliated, and those who believe will receive pleasure and care from Allah? This verse is a threat to how great the problems faced by the people on that day, and how heavy the responsibility of humans before Allah will be."
		   },
		   {
			"id": 5635,
			"surah": 77,
			"ayat": 13,
			"tafsir": "Then Allah explained that on that promised day He resolved all matters that occurred among fellow creatures. It was on that day that the Divine Court was established which tried all cases fairly. That day is called Yaumul-Fasl (separation day)."
		   },
		   {
			"id": 5636,
			"surah": 77,
			"ayat": 14,
			"tafsir": "In this verse, Allah shows how terrible that day is in the form of a question to the Prophet Muhammad, \"Do you know what the day of separation is?\" What is the day when the people and their respective apostles are gathered?"
		   },
		   {
			"id": 5637,
			"surah": 77,
			"ayat": 15,
			"tafsir": "Then Allah Himself explains the answer to the question mentioned in the verse above. On that day doom and humiliation will befall those who deny Allah and the Messenger and the holy book that He sent down. Punishment will be meted out to humans who like to deny what has been conveyed and told by the apostles. All disbelievers still doubt everything that Allah affirms. However, God will not break His promise. Another verse confirms: (That is) on the day (when) the earth is replaced by another earth and (so does) the sky, and they (humans) gather (in Padang Mahsyar) to face Allah the Almighty, the Almighty. (Ibrahim\/14:: 48)"
		   },
		   {
			"id": 5638,
			"surah": 77,
			"ayat": 16,
			"tafsir": "This verse begins with Allah's question, \"Did We not destroy those who denied His messengers before you?\" The history of the prophets and apostles and their people records that almost every nation that has disobeyed Allah and His messengers has been annihilated with various kinds of doom which are different from one another. Sometimes God destroys them with floods like the fate that had been suffered by the people of Prophet Noah, when their country was drowned by Allah with floods. Some were swallowed up by the earth after the country was hit by a very great earthquake, like the people of Prophet Lut. There were also those who were attacked by strong winds for 8 days and 7 nights, which killed all the inhabitants, except for the believers, namely the people of Nabi Saleh. And so on. Such a question from Allah contains a subtle warning so that people who are still disbelievers should be self-aware, because no matter what the sunatullah, Allah's regulations that apply will not be changed. In this case, whoever disbelieves either before or now or in the future, will still feel torment from Him. Therefore, humans should be aware before useless regrets come."
		   },
		   {
			"id": 5639,
			"surah": 77,
			"ayat": 17,
			"tafsir": "This verse states that Allah's punishment that befell the ancient nations came one after another. One people perished, there are other people like that. In time they will also perish if they do not want to learn from the history of their ancestors who disobeyed Allah and His messenger. With the revelation of the Qur'an, Allah warned the Meccans who were challenging and belittling the Prophet Muhammad as well as the people who came after him in the present and in the future. Humanity should always learn from history, because history will repeat itself."
		   },
		   {
			"id": 5640,
			"surah": 77,
			"ayat": 18,
			"tafsir": "In this verse, Allah once again emphasizes that what He has done for the people in the past will be the same as what He has done for the people now. Because His sunnah from the past until now remains the same, it will not change one bit. That's how He has destroyed those who sinned because of the actions and attitudes of those who lied to Him."
		   },
		   {
			"id": 5641,
			"surah": 77,
			"ayat": 19,
			"tafsir": "This verse contains Allah's condemnation of those who deny Him and His prophets and apostles with the condemnation of \"woe to the deniers\". The repetition of oaths and censures contained in this surahh al-Mursalat, besides being intended to emphasize the meaning (ta'kid), also contains another meaning, namely that these censures are not only enforced in the hereafter, but are also shown by Him in this world. Imam al-Qurthubi said the word wail was repeated in this surah to show that for each nation that denied Allah, punishment was given that was different from what other nations had received before. Each of the people of the prophets of old who were rebellious had received divine punishment that was different from one another."
		   },
		   {
			"id": 5642,
			"surah": 77,
			"ayat": 20,
			"tafsir": "In this verse, Allah reminds us again with a question, \"Isn't man created from a drop of water that is despicable?\" This contemptible water called semen is stored in a firm place, namely the mother's womb. It is there that the sperm of the father and the mother's egg mix and follow the step-by-step process of events arranged very neatly and carefully by the Almighty. After enough time has been set, the human candidate is born in the form of a baby. The three verses above repeat about the role of semen in human development. However, this verse specifically mentions the uterus. For this reason, the pressure of tafsir associated with this verse is the womb. According to science, the womb or uterus is the place where the embryo and fetus grow and develop, before being born in the form of a complete human child. The uterus is said to be a solid and safe place for several reasons, namely: 1. It is protected because it is located between the pelvic bones. It is 'held firmly on either side by muscles, which at the same time allow the uterus the freedom to move and grow to several hundred times its previous size, at the peak of the prenatal period. 2. During pregnancy, a fluid called progesterone is produced, or commonly referred to as the pregnancy hormone, which functions to lower the frequency of uterine contractions. 3. The embryo in the uterus is surrounded by several layers of membranes which produce a fluid in which the embryo swims within. This keeps the embryo from possibly being damaged by external impacts. There is one other verse which indicates the stages of development and the security that the womb offers to the fetus: ... He made you in the womb of your mother incident by incident in three darknesses. Who (does) like that is Allah, your God, the Lord who has the kingdom. There is no god but Him; then why can you be turned away? (az-Zumar\/39: 6) Regarding the stages we have discussed before. As for the safety of the fetus in the womb, experts have found that there are three layers of membranes (in the verse above mentioned the 'three darknesses') that can protect the fetus while in the womb, namely: 1. The amniotic membrane layer which contains fluid so that the fetus is swimming condition. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position itself when it is about to be born. 2. The chorion membrane layer 3. The decidual membrane layer Some researchers attribute the three layers of darkness in the verse above to the layers of the amniotic membrane that surround the uterus, the wall of the uterus itself, and the abdominal wall in the abdomen."
		   },
		   {
			"id": 5643,
			"surah": 77,
			"ayat": 21,
			"tafsir": "In this verse, Allah reminds us again with a question, \"Isn't man created from a drop of water that is despicable?\" This contemptible water called semen is stored in a firm place, namely the mother's womb. It is there that the sperm of the father and the mother's egg mix and follow the step-by-step process of events arranged very neatly and carefully by the Almighty. After enough time has been set, the human candidate is born in the form of a baby. The three verses above repeat about the role of semen in human development. However, this verse specifically mentions the uterus. For this reason, the pressure of tafsir associated with this verse is the womb. According to science, the womb or uterus is the place where the embryo and fetus grow and develop, before being born in the form of a complete human child. The uterus is said to be a solid and safe place for several reasons, namely: 1. It is protected because it is located between the pelvic bones. It is 'held firmly on either side by muscles, which at the same time allow the uterus the freedom to move and grow to several hundred times its previous size, at the peak of the prenatal period. 2. During pregnancy, a fluid called progesterone is produced, or commonly referred to as the pregnancy hormone, which functions to lower the frequency of uterine contractions. 3. The embryo in the uterus is surrounded by several layers of membranes which produce a fluid in which the embryo swims within. This keeps the embryo from possibly being damaged by external impacts. There is one other verse which indicates the stages of development and the security that the womb offers to the fetus: ... He made you in the womb of your mother incident by incident in three darknesses. Who (does) like that is Allah, your God, the Lord who has the kingdom. There is no god but Him; then why can you be turned away? (az-Zumar\/39: 6) Regarding the stages we have discussed before. As for the safety of the fetus in the womb, experts have found that there are three layers of membranes (in the verse above mentioned the 'three darknesses') that can protect the fetus while in the womb, namely: 1. The amniotic membrane layer which contains fluid so that the fetus is swimming condition. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position itself when it is about to be born. 2. The chorion membrane layer 3. The decidual membrane layer Some researchers attribute the three layers of darkness in the verse above to the layers of the amniotic membrane that surround the uterus, the wall of the uterus itself, and the abdominal wall in the abdomen."
		   },
		   {
			"id": 5644,
			"surah": 77,
			"ayat": 22,
			"tafsir": "In this verse, Allah reminds us again with a question, \"Isn't man created from a drop of water that is despicable?\" This contemptible water called semen is stored in a firm place, namely the mother's womb. It is there that the sperm of the father and the mother's egg mix and follow the step-by-step process of events arranged very neatly and carefully by the Almighty. After enough time has been set, the human candidate is born in the form of a baby. The three verses above repeat about the role of semen in human development. However, this verse specifically mentions the uterus. For this reason, the pressure of tafsir associated with this verse is the womb. According to science, the womb or uterus is the place where the embryo and fetus grow and develop, before being born in the form of a complete human child. The uterus is said to be a solid and safe place for several reasons, namely: 1. It is protected because it is located between the pelvic bones. It is 'held firmly on either side by muscles, which at the same time allow the uterus the freedom to move and grow to several hundred times its previous size, at the peak of the prenatal period. 2. During pregnancy, a fluid called progesterone is produced, or commonly referred to as the pregnancy hormone, which functions to lower the frequency of uterine contractions. 3. The embryo in the uterus is surrounded by several layers of membranes which produce a fluid in which the embryo swims within. This keeps the embryo from possibly being damaged by external impacts. There is one other verse which indicates the stages of development and the security that the womb offers to the fetus: ... He made you in the womb of your mother incident by incident in three darknesses. Who (does) like that is Allah, your God, the Lord who has the kingdom. There is no god but Him; then why can you be turned away? (az-Zumar\/39: 6) Regarding the stages we have discussed before. As for the safety of the fetus in the womb, experts have found that there are three layers of membranes (in the verse above mentioned the 'three darknesses') that can protect the fetus while in the womb, namely: 1. The amniotic membrane layer which contains fluid so that the fetus is swimming condition. This condition protects the fetus if there is a collision from the outside. In addition, this swimming position provides an opportunity for the fetus to position itself when it is about to be born. 2. The chorion membrane layer 3. The decidual membrane layer Some researchers attribute the three layers of darkness in the verse above to the layers of the amniotic membrane that surround the uterus, the wall of the uterus itself, and the abdominal wall in the abdomen."
		   },
		   {
			"id": 5645,
			"surah": 77,
			"ayat": 23,
			"tafsir": "In the matter of arranging and determining the length of time the child is \"stored\" in the womb and then determining when he should be born as a perfect child into this world, is God's business alone. Man may know through his mind, but matters of arrangement are still in the hands of the Almighty. Regarding this matter, Allah confirms that He is the best who determines. We can compare, for example, with the form and likeness of animals to how precise, beautiful and harmonious the human events that He created were created by Him. Even though there are no defects or odd things to our eyes, the creations and anatomical structures of the human body are still far more perfect, beautiful, and attractive, compared to all existing living things. By contemplating this, then we can conclude that God is the best in determining. This verse contains an invitation for humans to think and conclude their attitude towards the Substance that made it. Is it not proper for humans to be grateful and grateful to Him? Is it not proper for man to abandon his attitude of denial and stubbornness after he fully realizes how loving God is, and how much God has guided this life by sending His messengers to teach the teachings about His oneness?"
		   },
		   {
			"id": 5646,
			"surah": 77,
			"ayat": 24,
			"tafsir": "In this verse, Allah explains that apart from all that, if indeed humans do not want to change their character and character, they are still cursed as infidels, and more than that they also try to undermine Divine authority by associating Him with other creatures created by Him, and at all not sure that there is a resurrection day, the day when humans receive rewards for their good deeds, then God threatens a second time, \"Woe to those who deny the truth that day.\""
		   },
		   {
			"id": 5647,
			"surah": 77,
			"ayat": 25,
			"tafsir": "After mentioning the various kinds of His favors surrounding the process of human occurrence, then in this verse, Allah invites people to pay close attention to His blessings that are in this firmament. This was revealed by God with a question sentence, \"Didn't We create the earth which is spread out and stretches so wide as a place to gather and a place to live together in search of a living. Scientifically, this planet earth and its atmosphere have been created by Allah correctly and precisely. Our earth and the atmosphere contains substances or materials that support life processes, including the presence of nitrogen gas (N2), which is harmless to living things, but is very much needed for the emergence of a life process, and oxygen gas (O2), which is very much needed for the continuity of all life. Because of that, on earth all life gathers (for more details see Al-Qur'an and its Tafsir Volume 5 surahh Ibrahim\/14:19)."
		   },
		   {
			"id": 5648,
			"surah": 77,
			"ayat": 26,
			"tafsir": "The use of the earth was created to be stretched out and a gathering place not only for the living who live on its surface, but also for those who have died to be buried in their stomachs. That is why it is said to be earth for the living and the dead. Kifat in Arabic means a grave for the dead and a home for the living. According to scientists, the upper part of the earth is composed of plates of the earth's crust which interact with each other and result in deformation of the earth's crust, which is manifested by the formation of mountains, volcanoes and earthquakes. High mountains participate in the hydrological cycle where water is eventually stored on land and becomes a source of drinking water for humans and other life."
		   },
		   {
			"id": 5649,
			"surah": 77,
			"ayat": 27,
			"tafsir": "In addition, Allah also directs human attention to the purpose of creating mountains that rise high from the surface of the earth. He is said to be a peg of the earth and thus, humans feel at ease living on earth. The mountain is what serves as a peg pole to maintain the balance of the earth. Sometimes some of the bodies of the mountains are immersed in the ground or in the sea or rivers. Furthermore, God invites people to think about the fresh water they drink every day, as a gift from Him. He is the one who, according to this verse, gives the drink. Sometimes the water pours down from the sky and is brought with it by rain that comes from clumps of clouds or from melting snow, and sometimes it also flows from streams or gushes from springs, under mountain crevices or on the banks of rivers, and so on."
		   },
		   {
			"id": 5650,
			"surah": 77,
			"ayat": 28,
			"tafsir": "Therefore, those who still deny God's grace are affected by the curse of this verse, \"Woe will be great in that day for those who deny.\""
		   },
		   {
			"id": 5651,
			"surah": 77,
			"ayat": 29,
			"tafsir": "In this verse, Allah explains that the unfortunate people who are about to be put into Hell will be rebuked by the guardian angel in a loud voice so that they will go to the doom and torment that they were denied when they were still in the world before."
		   },
		   {
			"id": 5652,
			"surah": 77,
			"ayat": 30,
			"tafsir": "The plume of hellish smoke was three-pronged. One passage is on the right, a branch is on the left, and a third is on their shoulders, so that they are trapped in it and can no longer get out. In another verse, Allah says: Verily, We have prepared hell for the wrongdoers, whose turmoil surrounds them. (al-Kahf\/18: 29)"
		   },
		   {
			"id": 5653,
			"surah": 77,
			"ayat": 31,
			"tafsir": "Allah says in this verse that even though hell is said to have protection, it does not protect them from the heat of hell fire. There is no place to rest and shelter from the heat. It is also emphasized here that their protection is not the kind of protection that a believer gets, because nothing can protect them from the heat of the fires of hell. Another verse explains: (They) are tormented by a very hot wind and boiling water, and a shade of black smoke, neither cool nor pleasant. (al-Waqi'ah\/56: 42-44)"
		   },
		   {
			"id": 5654,
			"surah": 77,
			"ayat": 32,
			"tafsir": "Allah also mentions that hell always throws sparks as big and as high as a palace in all directions. Allah likens the fierce turmoil of the hell fire of Jahanam to the many yellow camels that move fast. Allah repeats his threat again that disaster is for the deniers because they cannot escape such intense torment."
		   },
		   {
			"id": 5655,
			"surah": 77,
			"ayat": 33,
			"tafsir": "Allah also mentions that hell always throws sparks as big and as high as a palace in all directions. Allah likens the fierce turmoil of the hell fire of Jahanam to the many yellow camels that move fast. Allah repeats his threat again that disaster is for the deniers because they cannot escape such intense torment."
		   },
		   {
			"id": 5656,
			"surah": 77,
			"ayat": 34,
			"tafsir": "Allah also mentions that hell always throws sparks as big and as high as a palace in all directions. Allah likens the fierce turmoil of the hell fire of Jahanam to the many yellow camels that move fast. Allah repeats his threat again that disaster is for the deniers because they cannot escape such intense torment."
		   },
		   {
			"id": 5657,
			"surah": 77,
			"ayat": 35,
			"tafsir": "In this verse, Allah explains that on that day people will not be able to speak and will only be amazed by the severity of the situation. They were not allowed to speak, and even if they were, it would be of no use."
		   },
		   {
			"id": 5658,
			"surah": 77,
			"ayat": 36,
			"tafsir": "Allah further explained that they were not allowed to ask for excuses, because that day was not a day of self-defense, but a day of receiving judgment. They can complain and regret their fate, but it is no longer possible to submit objections because God's decision cannot be contested. In surahh al-An'am\/6: 23, the polytheists on that day stated that they did not want to be polytheists anymore. In surahh an-Nisa'\/4: 42 it is stated that they cannot hide their talk, and in verse az-Zumar\/39: 31 it is stated that those who disbelieve argue before Allah, accuse each other, and blame each other."
		   },
		   {
			"id": 5659,
			"surah": 77,
			"ayat": 37,
			"tafsir": "In this verse, Allah repeats His threat that there will be a big accident that day for those who deny. Because the apostle had invited them to believe and threatened them by warning them of the impending doom they would face. Unfortunately they do not want to accept and listen to the invitation."
		   },
		   {
			"id": 5660,
			"surah": 77,
			"ayat": 38,
			"tafsir": "Allah explained that today is the day of judgment. This is the day that separates truth from falsehood, the day when one's truth and falsehood are exposed. On that day, Allah gathered all humans who have lived in this world since the time of the Prophet Adam until the end of time in one place. The aim is to provide a legal decision for them who is wrong and who is right, so that each person gets his rights."
		   },
		   {
			"id": 5661,
			"surah": 77,
			"ayat": 39,
			"tafsir": "In this verse, Allah challenges by mocking the disbelievers and those who feel they have the power to defend themselves, to use their intelligence and deceit to save themselves from His torment. In addition, this verse provides a harsh lesson for those who are against the religion of Islam, who always deceive and toy with believers that one day they will know how weak the reasons of those who like to make fun of the religion are."
		   },
		   {
			"id": 5662,
			"surah": 77,
			"ayat": 40,
			"tafsir": "Allah repeats again His threat that a big accident on the Day of Resurrection will be for those who deny Him. Accident for them on the day of resurrection because that's when weakness is proven and they face Allah whom they lie to. At such times it was evident how void the charges they had believed so far were."
		   },
		   {
			"id": 5663,
			"surah": 77,
			"ayat": 41,
			"tafsir": "In this verse and the following verses, Allah describes various pleasures for those who are pious, namely the shade of heaven which is in (around) springs, under shady trees under which tributaries flow, they never feel hot air and the turmoil of fire. that burns. In this verse, Allah says: They and their spouses are in the shade, leaning on couches. (Yasin\/36: 56)"
		   },
		   {
			"id": 5664,
			"surah": 77,
			"ayat": 42,
			"tafsir": "In this verse, Allah explains that in heaven there are tributaries, various types of fruit that taste sweet and delicious, you can pick and eat whenever you want without anyone disturbing you. For those who eat it, there is no need to be afraid and worry that it will cause disease if you eat too much of it."
		   },
		   {
			"id": 5665,
			"surah": 77,
			"ayat": 43,
			"tafsir": "Residents of heaven are received with a friendly welcome from the guards, who say that people who did good in the world before, are allowed to enjoy all the fruits and drinks that are available forever. They won't get sick nor do they have to worry about running out. This is the reward for all their efforts in the past by doing good deeds to obey Allah, striving earnestly to draw closer to Him."
		   },
		   {
			"id": 5666,
			"surah": 77,
			"ayat": 44,
			"tafsir": "Furthermore, Allah explains that all these pleasures are a gift from Him as recompense for those who are pious, and those who always do good on the basis of and serve Him. There is no goodness that escapes the retribution of Allah's reward as mentioned in another verse: Indeed, those who believe and do good deeds, We really will not waste the reward of those who do good deeds. (al-Kahf\/18: 30)"
		   },
		   {
			"id": 5667,
			"surah": 77,
			"ayat": 45,
			"tafsir": "In this verse once again Allah curses those who deny Him, \"Woe to those who deny (Us) in that day.\" Accident for them for denying what Allah has given, namely the glory of the righteous and their humiliation on the Day of Judgment. How unlucky is the fate of those who deny it."
		   },
		   {
			"id": 5668,
			"surah": 77,
			"ayat": 46,
			"tafsir": "Then in this verse Allah calls out and threatens with His word so that they eat and enjoy the remnants of the joys of life in this little world, because later in time Allah will enforce the Sunnah in the form of coming to torment and doom them as being repeatedly imposed on them. the nations before them."
		   },
		   {
			"id": 5669,
			"surah": 77,
			"ayat": 47,
			"tafsir": "Allah then repeats His reproaches and threats to those who deny Him. They have committed an act that plunged themselves into eternal doom and misery. Whereas in the world they only enjoy very little pleasure and not long."
		   },
		   {
			"id": 5670,
			"surah": 77,
			"ayat": 48,
			"tafsir": "It is narrated that this verse was revealed when Rasulullah saw ordered the inhabitants of Saqif country, a land not far from Mecca to pray to worship Allah. They answered arrogantly, \"We will not bow down (praying) because it is not our custom.\" The Prophet replied that there is no good for a religion that does not have bowing and prostrating. Some say this command is that when disbelievers are asked to prostrate before Allah on the Hereafter, they are unable to do so, because it is not customary to do this in this world. Allah stated that they were ordered to bow (to pray), but they were reluctant. When ordered to obey and obey and fear Allah and on the day when all eyes bow down for fear, they will be stubborn."
		   },
		   {
			"id": 5671,
			"surah": 77,
			"ayat": 49,
			"tafsir": "In concluding these last two verses, Allah repeats His curse on those who deny His commandments and prohibitions. A big accident for people who deny because they do not obey His commands and do not want to leave His prohibitions. After severely denouncing the disbelievers to follow the true religion, Allah ends this surahh by emphasizing that those polytheists absolutely do not want to listen to the advice of the preachers who invite them to follow Divine teachings for the benefit of their lives in this world and the hereafter. Allah said, \"Then in what words besides the Qur'an will they believe?\" So with the explanations of the Qur'an which are so clear and easy to understand along with clear evidence, they don't even want to believe, then where else is the truth that can lead them to Divine guidance?\" From this last verse it is clear that Allah has established the teachings of the Al-Qur'an about the world and the hereafter which collect all available information, complete with all its intricacies as a strong reason.Thus, the Al-Qur'an is the only holy book known to mankind which contains clear information so clear and complete. It's just that humans don't want to believe that when death comes to take away their life."
		   },
		   {
			"id": 5672,
			"surah": 77,
			"ayat": 50,
			"tafsir": "In concluding these last two verses, Allah repeats His curse on those who deny His commandments and prohibitions. A big accident for people who deny because they do not obey His commands and do not want to leave His prohibitions. After severely denouncing the disbelievers to follow the true religion, Allah ends this surahh by emphasizing that those polytheists absolutely do not want to listen to the advice of the preachers who invite them to follow Divine teachings for the benefit of their lives in this world and the hereafter. Allah said, \"Then in what words besides the Qur'an will they believe?\" So with the explanations of the Qur'an which are so clear and easy to understand along with clear evidence, they don't even want to believe, then where else is the truth that can lead them to Divine guidance?\" From this last verse it is clear that Allah has established the teachings of the Al-Qur'an about the world and the hereafter which collect all available information, complete with all its intricacies as a strong reason.Thus, the Al-Qur'an is the only holy book known to mankind which contains clear information so clear and complete. It's just that humans don't want to believe that when death comes to take away their life."
		   }
	]
}
